RhinoCommon API
EventWatcher.UndeleteRhinoObject Event
Raised when a previously deleted object is un-deleted.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler<RhinoObjectEventArgs> UndeleteRhinoObject
Public Event UndeleteRhinoObject As EventHandler(Of RhinoObjectEventArgs)
Value
Type: System.EventHandler<RhinoObjectEventArgs>
See Also
Reference
EventWatcher Class
Rhino Namespace