RhinoCommon API
UndoRedo.UndoRedoEndedChanged Event
 This event is raised when undo/redo ends in rdk.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static event EventHandler<RenderPropertyChangedEvent> UndoRedoEndedChanged
Public Shared Event UndoRedoEndedChanged As EventHandler(Of RenderPropertyChangedEvent)
Value
Type: System.EventHandler<RenderPropertyChangedEvent>
See Also
Reference
UndoRedo Class
Rhino.Render Namespace