RhinoCommon API
RhinoApp.Initialized Event
 Is raised when the application is fully initialized.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler Initialized
Public Shared Event Initialized As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RhinoApp Class
Rhino Namespace