RhinoCommon API
RhinoApp.Closing Event
 Is raised when the application is about to close.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler Closing
Public Shared Event Closing As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RhinoApp Class
Rhino Namespace