RhinoCommon API
RhinoDoc.UnitsChangedWithScaling Event
 Called when a change in the model units results in a scaling operation on all of the objects in the document. This call is made before any of the objects are scaled. A call to RhinoDoc.DocumentPropertiesChanged follows.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.20
Syntax
public static event EventHandler<UnitsChangedWithScalingEventArgs> UnitsChangedWithScaling
Public Shared Event UnitsChangedWithScaling As EventHandler(Of UnitsChangedWithScalingEventArgs)
Value
Type: System.EventHandler<UnitsChangedWithScalingEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace