RhinoCommon API
DisplayPipeline.ViewportProjectionChanged Event
 Called when the projection changes for a viewport being drawn.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public static event EventHandler<DrawEventArgs> ViewportProjectionChanged
Public Shared Event ViewportProjectionChanged As EventHandler(Of DrawEventArgs)
Value
Type: System.EventHandler<DrawEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace