RhinoCommon API
RhinoDoc.ReplaceRhinoObject Event
 Called if an object is about to be replaced. If both UndoActive and RedoActive return false, then immediately after the ReplaceRhinoObject event, there will be a DeleteRhinoObject event followed by a AddRhinoObject event. If either UndoActive or UndoActive return true, then immediately after the ReplaceRhinoObject event, there will be a DeleteRhinoObject event followed by a UndeleteRhinoObject event.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<RhinoReplaceObjectEventArgs> ReplaceRhinoObject
Public Shared Event ReplaceRhinoObject As EventHandler(Of RhinoReplaceObjectEventArgs)
Value
Type: System.EventHandler<RhinoReplaceObjectEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace