RhinoCommon API
UserInterfaceTextBox.KeyboardFocusChanged Event
 Event triggered when the box gains or loses keyboard focus
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler KeyboardFocusChanged
Public Event KeyboardFocusChanged As EventHandler
Value
Type: System.EventHandler
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace