RhinoCommon API
RhinoPageView.PageViewPropertiesChange Event
[Missing <summary> documentation for "E:Rhino.Display.RhinoPageView.PageViewPropertiesChange"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<PageViewPropertiesChangeEventArgs> PageViewPropertiesChange
Public Shared Event PageViewPropertiesChange As EventHandler(Of PageViewPropertiesChangeEventArgs)
Value
Type: System.EventHandler<PageViewPropertiesChangeEventArgs>
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace