RhinoCommon API
FilePdf.PreWrite Event
 Fired immediately before a PDF is written
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static event EventHandler<FilePdfEventArgs> PreWrite
Public Shared Event PreWrite As EventHandler(Of FilePdfEventArgs)
Value
Type: System.EventHandler<FilePdfEventArgs>
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace