RhinoCommon API
UserInterfaceButton.Click Event
[Missing <summary> documentation for "E:Rhino.UI.UserInterfaceButton.Click"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler<EventArgs> Click
Public Event Click As EventHandler(Of EventArgs)
Value
Type: System.EventHandler<EventArgs>
See Also
Reference
UserInterfaceButton Class
Rhino.UI Namespace