RhinoCommon API
UserInterfaceRadioButton.CheckedChanged Event
 Event triggered when a click or a key changes the state of this radio button
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler CheckedChanged
Public Event CheckedChanged As EventHandler
Value
Type: System.EventHandler
See Also
Reference
UserInterfaceRadioButton Class
Rhino.UI Namespace