RhinoCommon API
RhinoDoc.CloseDocument Event
[Missing <summary> documentation for "E:Rhino.RhinoDoc.CloseDocument"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<DocumentEventArgs> CloseDocument
Public Shared Event CloseDocument As EventHandler(Of DocumentEventArgs)
Value
Type: System.EventHandler<DocumentEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace