RhinoCommon API
RhinoDoc.BeginSaveDocument Event
[Missing <summary> documentation for "E:Rhino.RhinoDoc.BeginSaveDocument"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<DocumentSaveEventArgs> BeginSaveDocument
Public Shared Event BeginSaveDocument As EventHandler(Of DocumentSaveEventArgs)
Value
Type: System.EventHandler<DocumentSaveEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace