RhinoCommon API
RealtimeDisplayMode.HudTimePressed Event
Note: This API is now obsolete.
 Listen tot his event if you want to handle a press press on the time component
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use HUDTimeLeftClicked instead")]
public event EventHandler HudTimePressed
<ObsoleteAttribute("Use HUDTimeLeftClicked instead")>
Public Event HudTimePressed As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace