RhinoCommon API
EventWatcher.NewDocument Event
Raised when a new document is created.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler<DocumentEventArgs> NewDocument
Public Event NewDocument As EventHandler(Of DocumentEventArgs)
Value
Type: System.EventHandler<DocumentEventArgs>
See Also
Reference
EventWatcher Class
Rhino Namespace