RhinoCommon API
RealtimeDisplayMode.HudLockButtonPressed Event
Note: This API is now obsolete.
 Listen tot his event if you want to handle the lock button control
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use HUDLockButtonLeftClicked instead")]
public event EventHandler HudLockButtonPressed
<ObsoleteAttribute("Use HUDLockButtonLeftClicked instead")>
Public Event HudLockButtonPressed As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace