RhinoCommon API
RhinoApp.RdkNewDocument Event
 Monitors when RDK document information is rebuilt.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public static event EventHandler RdkNewDocument
Public Shared Event RdkNewDocument As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RhinoApp Class
Rhino Namespace