RhinoCommon API
DisplayPipeline.InitFrameBuffer Event
[Missing <summary> documentation for "E:Rhino.Display.DisplayPipeline.InitFrameBuffer"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public static event EventHandler<InitFrameBufferEventArgs> InitFrameBuffer
Public Shared Event InitFrameBuffer As EventHandler(Of InitFrameBufferEventArgs)
Value
Type: System.EventHandler<InitFrameBufferEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace