RhinoCommon API
RhinoApp.RdkCacheImageChanged Event
 Monitors when the RDK thumbnail cache images are changed.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public static event EventHandler RdkCacheImageChanged
Public Shared Event RdkCacheImageChanged As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RhinoApp Class
Rhino Namespace