RhinoCommon API
RhinoDoc.UserStringChanged Event
 This event is raised when document user text strings are changed
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RhinoDoc.UserStringChangedArgs> UserStringChanged
Public Shared Event UserStringChanged As EventHandler(Of RhinoDoc.UserStringChangedArgs)
Value
Type: System.EventHandler<RhinoDoc.UserStringChangedArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace