RhinoCommon API
DisplayPipeline.PostDrawObject Event
 Called right after an individual object has been drawn. NOTE: Do not use this event unless you absolutely need to. It is called for every object in the document and can slow display down if a large number of objects exist in the document
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static event EventHandler<DrawObjectEventArgs> PostDrawObject
Public Shared Event PostDrawObject As EventHandler(Of DrawObjectEventArgs)
Value
Type: System.EventHandler<DrawObjectEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace