RhinoCommon API
RhinoDoc.AfterTransformObjects Event
 Called after objects are being transformed
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public static event EventHandler<RhinoAfterTransformObjectsEventArgs> AfterTransformObjects
Public Shared Event AfterTransformObjects As EventHandler(Of RhinoAfterTransformObjectsEventArgs)
Value
Type: System.EventHandler<RhinoAfterTransformObjectsEventArgs>
Examples
See Also
Reference
RhinoDoc Class
Rhino Namespace