RhinoCommon API
RhinoDoc.InstanceDefinitionTableEvent Event
 Called when any modification happens to a document's instance definition table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public static event EventHandler<InstanceDefinitionTableEventArgs> InstanceDefinitionTableEvent
Public Shared Event InstanceDefinitionTableEvent As EventHandler(Of InstanceDefinitionTableEventArgs)
Value
Type: System.EventHandler<InstanceDefinitionTableEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace