RhinoCommon API
DisplayPipeline.CalculateBoundingBox Event
[Missing <summary> documentation for "E:Rhino.Display.DisplayPipeline.CalculateBoundingBox"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<CalculateBoundingBoxEventArgs> CalculateBoundingBox
Public Shared Event CalculateBoundingBox As EventHandler(Of CalculateBoundingBoxEventArgs)
Value
Type: System.EventHandler<CalculateBoundingBoxEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace