RhinoCommon API
RhinoDoc.MarkupViewChanged Event
 Called when a document's markup view state changes, i.e. when the document enters or leaves markup viewing/editing, or switches which markup is being viewed or edited. Unlike MarkupTableEvent (which reports markup add/delete/modify), this reports which markup is currently active so UI can indicate it.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static event EventHandler<MarkupViewChangedEventArgs> MarkupViewChanged
Public Shared Event MarkupViewChanged As EventHandler(Of MarkupViewChangedEventArgs)
Value
Type: System.EventHandler<MarkupViewChangedEventArgs>
Remarks
 Switching directly from one markup to another first leaves the current markup, so the switch is reported as two events: an intervening None (index -1) followed by the new markup. Handlers should treat each event as the current state.
See Also
Reference
RhinoDoc Class
Rhino Namespace