RhinoCommon API
RhinoDoc.DeleteRhinoObject Event
 Called if an object is deleted. At some later point the object can be un-deleted.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<RhinoObjectEventArgs> DeleteRhinoObject
Public Shared Event DeleteRhinoObject As EventHandler(Of RhinoObjectEventArgs)
Value
Type: System.EventHandler<RhinoObjectEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace