RhinoCommon API
UserInterfaceCheckBox.CheckedChanged Event
 Event triggered when a click changes the state of the check box
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler CheckedChanged
Public Event CheckedChanged As EventHandler
Value
Type: System.EventHandler
See Also
Reference
UserInterfaceCheckBox Class
Rhino.UI Namespace