RhinoCommon API
RhinoDoc.BeginOpenDocument Event
 This event is raised when the document open operation begins. NOTE: On Windows, this event will be fired when a clipboard paste operation occurs, as Rhino opens a .tmp file in the User's Local folder with the contents of the pasted document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<DocumentOpenEventArgs> BeginOpenDocument
Public Shared Event BeginOpenDocument As EventHandler(Of DocumentOpenEventArgs)
Value
Type: System.EventHandler<DocumentOpenEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace