RhinoCommon API
HostUtils.OnSendLogMessageToCloud Event
 Is raised when an exception is reported with one of the method.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public static event HostUtils.SendLogMessageToCloudDelegate OnSendLogMessageToCloud
Public Shared Event OnSendLogMessageToCloud As HostUtils.SendLogMessageToCloudDelegate
Value
Type: Rhino.Runtime.HostUtils.SendLogMessageToCloudDelegate
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace