RhinoCommon API
PlugIn.SettingsSaved Event
 This event is raised when an instance of Rhino has modified the external settings file associated with this plug-in's Settings property.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public event EventHandler<PersistentSettingsSavedEventArgs> SettingsSaved
Public Event SettingsSaved As EventHandler(Of PersistentSettingsSavedEventArgs)
Value
Type: System.EventHandler<PersistentSettingsSavedEventArgs>
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace
PlugIn.SaveSettings()