RhinoCommon API
UserInterfaceSlider.ValueChanged Event
 Event triggered when the slider's value changes
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler ValueChanged
Public Event ValueChanged As EventHandler
Value
Type: System.EventHandler
See Also
Reference
UserInterfaceSlider Class
Rhino.UI Namespace