RhinoCommon API
RhinoDoc.TextureMappingEvent Event
 Called when any modification happens to a document objects texture mapping.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public static event EventHandler<RhinoDoc.TextureMappingEventArgs> TextureMappingEvent
Public Shared Event TextureMappingEvent As EventHandler(Of RhinoDoc.TextureMappingEventArgs)
Value
Type: System.EventHandler<RhinoDoc.TextureMappingEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace