RhinoCommon API
RhinoDoc.PurgeRhinoObject Event
 Called if an object is being purged from a document. The object will cease to exist forever.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<RhinoObjectEventArgs> PurgeRhinoObject
Public Shared Event PurgeRhinoObject As EventHandler(Of RhinoObjectEventArgs)
Value
Type: System.EventHandler<RhinoObjectEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace