RhinoCommon API
RhinoApp.LicenseStateChanged Event
 Fires when the license state has changed
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static event EventHandler<LicenseStateChangedEventArgs> LicenseStateChanged
Public Shared Event LicenseStateChanged As EventHandler(Of LicenseStateChangedEventArgs)
Value
Type: System.EventHandler<LicenseStateChangedEventArgs>
See Also
Reference
RhinoApp Class
Rhino Namespace