RhinoCommon API
RhinoDoc.HatchPatternTableEvent Event
 Called when any modification happens to a document's hatch pattern table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public static event EventHandler<HatchPatternTableEventArgs> HatchPatternTableEvent
Public Shared Event HatchPatternTableEvent As EventHandler(Of HatchPatternTableEventArgs)
Value
Type: System.EventHandler<HatchPatternTableEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace