RhinoCommon API
CollapsibleSectionImpl.DataChanged Event
[Missing <summary> documentation for "E:Rhino.UI.Controls.CollapsibleSectionImpl.DataChanged"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public event EventHandler<EventArgs> DataChanged
Public Event DataChanged As EventHandler(Of EventArgs)
Value
Type: System.EventHandler<EventArgs>
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace