RhinoCommon API
RhinoDoc.DocumentPropertiesChanged Event
[Missing <summary> documentation for "E:Rhino.RhinoDoc.DocumentPropertiesChanged"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<DocumentEventArgs> DocumentPropertiesChanged
Public Shared Event DocumentPropertiesChanged As EventHandler(Of DocumentEventArgs)
Value
Type: System.EventHandler<DocumentEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace