RhinoCommon API
RhinoObject.AnalysisModeChanged Event
 Called when the visual analysis mode of a changes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static event EventHandler<RhinoObjectAnalysisModeChangedEventArgs> AnalysisModeChanged
Public Shared Event AnalysisModeChanged As EventHandler(Of RhinoObjectAnalysisModeChangedEventArgs)
Value
Type: System.EventHandler<RhinoObjectAnalysisModeChangedEventArgs>
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace
Rhino.DocObjects.RhinoObject