RhinoCommon API
GroundPlane.Changed Event
 This event is raised when a GroundPlane property value is changed.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public static event EventHandler<RenderPropertyChangedEvent> Changed
Public Shared Event Changed As EventHandler(Of RenderPropertyChangedEvent)
Value
Type: System.EventHandler<RenderPropertyChangedEvent>
See Also
Reference
GroundPlane Class
Rhino.Render Namespace