RhinoCommon API
RhinoDoc.ModifyObjectAttributes Event
 Called when all object attributes are changed.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<RhinoModifyObjectAttributesEventArgs> ModifyObjectAttributes
Public Shared Event ModifyObjectAttributes As EventHandler(Of RhinoModifyObjectAttributesEventArgs)
Value
Type: System.EventHandler<RhinoModifyObjectAttributesEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace