RhinoCommon API
RhinoApp.Idle Event
 Occurs when the application finishes processing and is about to enter the idle state
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public static event EventHandler Idle
Public Shared Event Idle As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RhinoApp Class
Rhino Namespace