RhinoCommon API
RhinoDoc.DimensionStyleTableEvent Event
 Called when any modification happens to a document's dimension style table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static event EventHandler<DimStyleTableEventArgs> DimensionStyleTableEvent
Public Shared Event DimensionStyleTableEvent As EventHandler(Of DimStyleTableEventArgs)
Value
Type: System.EventHandler<DimStyleTableEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace