RhinoCommon API
RealtimeDisplayMode.OnDisplayPipelineSettingsChanged Event
[Missing <summary> documentation for "E:Rhino.Render.RealtimeDisplayMode.OnDisplayPipelineSettingsChanged"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public event EventHandler<RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs> OnDisplayPipelineSettingsChanged
Public Event OnDisplayPipelineSettingsChanged As EventHandler(Of RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs)
Value
Type: System.EventHandler<RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs>
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace