RhinoCommon API
PlugIn.UnknownUserData Event
 This event is raised when a 3dm file is loaded with unknown user data, and the plug-in to handle it could not be loaded.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.17
Syntax
public static event EventHandler<PlugIn.UnknownUserDataEventArgs> UnknownUserData
Public Shared Event UnknownUserData As EventHandler(Of PlugIn.UnknownUserDataEventArgs)
Value
Type: System.EventHandler<PlugIn.UnknownUserDataEventArgs>
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace