RhinoCommon API
RhinoDoc.AddRhinoObject Event
Called if a new object is added to the document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<RhinoObjectEventArgs> AddRhinoObject
Public Shared Event AddRhinoObject As EventHandler(Of RhinoObjectEventArgs)
Value
Type: System.EventHandler<RhinoObjectEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace