RhinoCommon API
EventWatcher.EndOpenDocument Event
Raised when a document open operation ends.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler<DocumentOpenEventArgs> EndOpenDocument
Public Event EndOpenDocument As EventHandler(Of DocumentOpenEventArgs)
Value
Type: System.EventHandler<DocumentOpenEventArgs>
See Also
Reference
EventWatcher Class
Rhino Namespace