RhinoCommon API
RhinoApp.RdkPlugInUnloading Event
 Monitors when RDK client plug-ins are unloaded.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public static event EventHandler RdkPlugInUnloading
Public Shared Event RdkPlugInUnloading As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RhinoApp Class
Rhino Namespace