RhinoCommon API
RhinoDoc.UndeleteRhinoObject Event
Called if an object is un-deleted.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<RhinoObjectEventArgs> UndeleteRhinoObject
Public Shared Event UndeleteRhinoObject As EventHandler(Of RhinoObjectEventArgs)
Value
Type: System.EventHandler<RhinoObjectEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace