RhinoCommon API
HostUtils.OnExceptionReport Event
 Is raised when an exception is reported with one of the ExceptionReport(Exception) method.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event HostUtils.ExceptionReportDelegate OnExceptionReport
Public Shared Event OnExceptionReport As HostUtils.ExceptionReportDelegate
Value
Type: Rhino.Runtime.HostUtils.ExceptionReportDelegate
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace