RhinoCommon API
RenderContent.ContentDeleting Event
 Used to monitor render content deletion from the document.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public static event EventHandler<RenderContentEventArgs> ContentDeleting
Public Shared Event ContentDeleting As EventHandler(Of RenderContentEventArgs)
Value
Type: System.EventHandler<RenderContentEventArgs>
See Also
Reference
RenderContent Class
Rhino.Render Namespace