RhinoCommon API
EventWatcher.AddRhinoObject Event
Raised when a new object is added to a document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler<RhinoObjectEventArgs> AddRhinoObject
Public Event AddRhinoObject As EventHandler(Of RhinoObjectEventArgs)
Value
Type: System.EventHandler<RhinoObjectEventArgs>
See Also
Reference
EventWatcher Class
Rhino Namespace