RhinoCommon API
RhinoDoc.DeselectAllObjects Event
 Called when all objects are deselected.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<RhinoDeselectAllObjectsEventArgs> DeselectAllObjects
Public Shared Event DeselectAllObjects As EventHandler(Of RhinoDeselectAllObjectsEventArgs)
Value
Type: System.EventHandler<RhinoDeselectAllObjectsEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace