RhinoCommon API
RhinoView.Rename Event
[Missing <summary> documentation for "E:Rhino.Display.RhinoView.Rename"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<ViewEventArgs> Rename
Public Shared Event Rename As EventHandler(Of ViewEventArgs)
Value
Type: System.EventHandler<ViewEventArgs>
See Also
Reference
RhinoView Class
Rhino.Display Namespace