RhinoCommon API
UserInterfaceTextBox.EditCanceled Event
 Event triggered when Escape puts back the text the box started with
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler EditCanceled
Public Event EditCanceled As EventHandler
Value
Type: System.EventHandler
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace