RhinoCommon API
RhinoDoc.LinetypeTableEvent Event
 Called when any modification happens to a document's linetype table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static event EventHandler<LinetypeTableEventArgs> LinetypeTableEvent
Public Shared Event LinetypeTableEvent As EventHandler(Of LinetypeTableEventArgs)
Value
Type: System.EventHandler<LinetypeTableEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace