RhinoCommon API
RhinoView.Create Event
[Missing <summary> documentation for "E:Rhino.Display.RhinoView.Create"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<ViewEventArgs> Create
Public Shared Event Create As EventHandler(Of ViewEventArgs)
Value
Type: System.EventHandler<ViewEventArgs>
See Also
Reference
RhinoView Class
Rhino.Display Namespace