RhinoCommon API
RhinoView.EnableDrawingChanged Event
 Called when the state of changes.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public static event EventHandler<ViewEnableDrawingEventArgs> EnableDrawingChanged
Public Shared Event EnableDrawingChanged As EventHandler(Of ViewEnableDrawingEventArgs)
Value
Type: System.EventHandler<ViewEnableDrawingEventArgs>
See Also
Reference
RhinoView Class
Rhino.Display Namespace
RhinoView.EnableDrawing