RhinoCommon API
DisplayPipeline.PostProcessFrameBuffer Event
 Called after the frame has been drawn, with the finished frame available to be read. Use this to record or stream a viewport: TryCopyFrameBuffer(IntPtr, Int32, Int32) copies the frame that was just drawn, and never redraws the scene.
Every frame drawn while this event is subscribed costs an extra frame buffer read back, whether or not the handler reads anything. Unsubscribe as soon as the frames are no longer needed.
The handler runs on the thread that drew the frame and holds up the next one. Copy the pixels here and do the rest of the work somewhere else.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<PostProcessFrameBufferEventArgs> PostProcessFrameBuffer
Public Shared Event PostProcessFrameBuffer As EventHandler(Of PostProcessFrameBufferEventArgs)
Value
Type: System.EventHandler<PostProcessFrameBufferEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace