RhinoCommon API
UserInterfaceTextBox.TextCommitted Event
 Event triggered when what was typed is committed, by Enter or by the box losing focus with the text changed
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler TextCommitted
Public Event TextCommitted As EventHandler
Value
Type: System.EventHandler
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace