RhinoCommon API
RhinoApp.KeyboardEvent Event
 Can add or removed delegates that are raised by a keyboard event.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.2
Syntax
public static event RhinoApp.KeyboardHookEvent KeyboardEvent
Public Shared Event KeyboardEvent As RhinoApp.KeyboardHookEvent
Value
Type: Rhino.RhinoApp.KeyboardHookEvent
See Also
Reference
RhinoApp Class
Rhino Namespace