RhinoCommon API
RenderContent.ContentChanged Event
 Used to monitor render content modifications.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public static event EventHandler<RenderContentChangedEventArgs> ContentChanged
Public Shared Event ContentChanged As EventHandler(Of RenderContentChangedEventArgs)
Value
Type: System.EventHandler<RenderContentChangedEventArgs>
See Also
Reference
RenderContent Class
Rhino.Render Namespace