RhinoCommon API
RhinoApp.MainLoop Event
 Gets called every loop iteration inside Rhino's main message loop.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static event EventHandler MainLoop
Public Shared Event MainLoop As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RhinoApp Class
Rhino Namespace