RhinoCommon API
RhinoApp.RdkGlobalSettingsChanged Event
 Monitors when RDK global settings are modified.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public static event EventHandler RdkGlobalSettingsChanged
Public Shared Event RdkGlobalSettingsChanged As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RhinoApp Class
Rhino Namespace