RhinoCommon API
RhinoDoc.WorksessionFileChanged Event
 Raised after a worksession reference model has been attached to or detached from a document. The document state already reflects the change at the time the event fires.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static event EventHandler<RhinoDoc.WorksessionFileChangedEventArgs> WorksessionFileChanged
Public Shared Event WorksessionFileChanged As EventHandler(Of RhinoDoc.WorksessionFileChangedEventArgs)
Value
Type: System.EventHandler<RhinoDoc.WorksessionFileChangedEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace