RhinoCommon API
RealtimeDisplayMode.HudUnlockButtonPressed Event
Note: This API is now obsolete.
 Listen tot his event if you want to handle the unlock button control
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use HUDUnlockButtonLeftClicked instead")]
public event EventHandler HudUnlockButtonPressed
<ObsoleteAttribute("Use HUDUnlockButtonLeftClicked instead")>
Public Event HudUnlockButtonPressed As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace