RhinoCommon API
RhinoView.SetActive Event
[Missing <summary> documentation for "E:Rhino.Display.RhinoView.SetActive"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<ViewEventArgs> SetActive
Public Shared Event SetActive As EventHandler(Of ViewEventArgs)
Value
Type: System.EventHandler<ViewEventArgs>
See Also
Reference
RhinoView Class
Rhino.Display Namespace