RhinoCommon API
RenderContent.PreviewRendered Event
 This event is raised when a preview has been rendered
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<PreviewRenderedEventArgs> PreviewRendered
Public Shared Event PreviewRendered As EventHandler(Of PreviewRenderedEventArgs)
Value
Type: System.EventHandler<PreviewRenderedEventArgs>
See Also
Reference
RenderContent Class
Rhino.Render Namespace