RhinoCommon API
RhinoDoc.SelectObjects Event
 Called when object(s) are selected.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<RhinoObjectSelectionEventArgs> SelectObjects
Public Shared Event SelectObjects As EventHandler(Of RhinoObjectSelectionEventArgs)
Value
Type: System.EventHandler<RhinoObjectSelectionEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace