RhinoCommon API
RhinoApp.RdkUpdateAllPreviews Event
 Monitors when RDK thumbnails are updated.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public static event EventHandler RdkUpdateAllPreviews
Public Shared Event RdkUpdateAllPreviews As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RhinoApp Class
Rhino Namespace