RhinoCommon API
TrulyObservableOrderedSet<T>.CollectionChanged Event
 Triggered whenever the set changes or when one of its elements has its PropertyChanged event triggered.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public event NotifyCollectionChangedEventHandler CollectionChanged
Public Event CollectionChanged As NotifyCollectionChangedEventHandler
Value
Type: System.Collections.Specialized.NotifyCollectionChangedEventHandler
Implements
INotifyCollectionChanged.CollectionChanged
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace