RhinoCommon API
RhinoApp.AppSettingsChanged Event
 Is raised when settings are changed.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler AppSettingsChanged
Public Shared Event AppSettingsChanged As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RhinoApp Class
Rhino Namespace