RhinoCommon API
RealtimeDisplayMode.OnDrawMiddleground Event
[Missing <summary> documentation for "E:Rhino.Render.RealtimeDisplayMode.OnDrawMiddleground"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public event EventHandler<RealtimeDisplayMode.DrawMiddlegroundEventArgs> OnDrawMiddleground
Public Event OnDrawMiddleground As EventHandler(Of RealtimeDisplayMode.DrawMiddlegroundEventArgs)
Value
Type: System.EventHandler<RealtimeDisplayMode.DrawMiddlegroundEventArgs>
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace