RhinoCommon API
RenderContent.ContentReplacing Event
 Used to monitor render content replacing in the document.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public static event EventHandler<RenderContentEventArgs> ContentReplacing
Public Shared Event ContentReplacing As EventHandler(Of RenderContentEventArgs)
Value
Type: System.EventHandler<RenderContentEventArgs>
See Also
Reference
RenderContent Class
Rhino.Render Namespace