RhinoCommon API
RhinoDoc.RenderTextureTableEvent Event
 Called when the RenderTextureTable has been loaded, is about to be cleared or has been cleared. See RhinoDoc.RenderContentTableEventType for more information.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public static event EventHandler<RhinoDoc.RenderContentTableEventArgs> RenderTextureTableEvent
Public Shared Event RenderTextureTableEvent As EventHandler(Of RhinoDoc.RenderContentTableEventArgs)
Value
Type: System.EventHandler<RhinoDoc.RenderContentTableEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace