RhinoCommon API
RhinoDoc.DeselectObjects Event
 Called when object(s) are deselected.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<RhinoObjectSelectionEventArgs> DeselectObjects
Public Shared Event DeselectObjects As EventHandler(Of RhinoObjectSelectionEventArgs)
Value
Type: System.EventHandler<RhinoObjectSelectionEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace