RhinoCommon API
RhinoView.Destroy Event
[Missing <summary> documentation for "E:Rhino.Display.RhinoView.Destroy"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<ViewEventArgs> Destroy
Public Shared Event Destroy As EventHandler(Of ViewEventArgs)
Value
Type: System.EventHandler<ViewEventArgs>
See Also
Reference
RhinoView Class
Rhino.Display Namespace