RhinoCommon API
DisplayPipeline.PreDrawTransparentObjects Event
 Called before transparent objects have been drawn. Depth writing and testing are on.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public static event EventHandler<DrawEventArgs> PreDrawTransparentObjects
Public Shared Event PreDrawTransparentObjects As EventHandler(Of DrawEventArgs)
Value
Type: System.EventHandler<DrawEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace