RhinoCommon API
RealtimeDisplayMode.HudStatusTextPressed Event
Note: This API is now obsolete.
 Listen tot his event if you want to handle a press on the status text component
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use HUDStatusTextLeftClicked instead")]
public event EventHandler HudStatusTextPressed
<ObsoleteAttribute("Use HUDStatusTextLeftClicked instead")>
Public Event HudStatusTextPressed As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace