RhinoCommon API
RealtimeDisplayMode.HudProductNamePressed Event
Note: This API is now obsolete.
 Listen tot his event if you want to handle a press on the product name component
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use HUDProductNameLeftClicked instead")]
public event EventHandler HudProductNamePressed
<ObsoleteAttribute("Use HUDProductNameLeftClicked instead")>
Public Event HudProductNamePressed As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace