RhinoCommon API
RhinoDoc.PageViewGroupTableEvent Event
 Called when any modification happens to a document's pageview group table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static event EventHandler<PageViewGroupTableEventArgs> PageViewGroupTableEvent
Public Shared Event PageViewGroupTableEvent As EventHandler(Of PageViewGroupTableEventArgs)
Value
Type: System.EventHandler<PageViewGroupTableEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace