RhinoCommon API
RhinoDoc.EndSaveDocument Event
[Missing <summary> documentation for "E:Rhino.RhinoDoc.EndSaveDocument"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<DocumentSaveEventArgs> EndSaveDocument
Public Shared Event EndSaveDocument As EventHandler(Of DocumentSaveEventArgs)
Value
Type: System.EventHandler<DocumentSaveEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace