RhinoCommon API
CollapsibleSectionImpl.ViewModelActivated Event
[Missing <summary> documentation for "E:Rhino.UI.Controls.CollapsibleSectionImpl.ViewModelActivated"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public event EventHandler ViewModelActivated
Public Event ViewModelActivated As EventHandler
Value
Type: System.EventHandler
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace