RhinoCommon API
RhinoPageView.PageViewSpaceChange Event
[Missing <summary> documentation for "E:Rhino.Display.RhinoPageView.PageViewSpaceChange"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<PageViewSpaceChangeEventArgs> PageViewSpaceChange
Public Shared Event PageViewSpaceChange As EventHandler(Of PageViewSpaceChangeEventArgs)
Value
Type: System.EventHandler<PageViewSpaceChangeEventArgs>
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace