RhinoCommon API
EventWatcher.ReplaceRhinoObject Event
Raised when an object is about to be replaced.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler<RhinoReplaceObjectEventArgs> ReplaceRhinoObject
Public Event ReplaceRhinoObject As EventHandler(Of RhinoReplaceObjectEventArgs)
Value
Type: System.EventHandler<RhinoReplaceObjectEventArgs>
See Also
Reference
EventWatcher Class
Rhino Namespace