RhinoCommon API
RhinoApp.EscapeKeyPressed Event
 Can add or removed delegates that are raised when the escape key is clicked.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler EscapeKeyPressed
Public Shared Event EscapeKeyPressed As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RhinoApp Class
Rhino Namespace