RhinoCommon API
RhinoApp.RendererChanged Event
 Monitors when Rhino's current renderer changes.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public static event EventHandler RendererChanged
Public Shared Event RendererChanged As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RhinoApp Class
Rhino Namespace