RhinoCommon API
RhinoDoc.MarkupTableEvent Event
 Called when any modification happens to a document's markup table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static event EventHandler<MarkupTableEventArgs> MarkupTableEvent
Public Shared Event MarkupTableEvent As EventHandler(Of MarkupTableEventArgs)
Value
Type: System.EventHandler<MarkupTableEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace