RhinoCommon API
EventWatcher.BeginOpenDocument Event
Raised when a document open operation begins.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler<DocumentOpenEventArgs> BeginOpenDocument
Public Event BeginOpenDocument As EventHandler(Of DocumentOpenEventArgs)
Value
Type: System.EventHandler<DocumentOpenEventArgs>
See Also
Reference
EventWatcher Class
Rhino Namespace