RhinoCommon API
AddCustomUISections.OnAddCustomUISections Event
 This event is raised when a OnAddCustomUISections Event is triggered in rdk.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static event EventHandler<AddCustomUISectionsEventArgs> OnAddCustomUISections
Public Shared Event OnAddCustomUISections As EventHandler(Of AddCustomUISectionsEventArgs)
Value
Type: System.EventHandler<AddCustomUISectionsEventArgs>
See Also
Reference
AddCustomUISections Class
Rhino.Render Namespace