RhinoCommon API
RealtimeDisplayMode.HudPauseButtonPressed Event
Note: This API is now obsolete.
 Listen tot his event if you want to handle the pause button control
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use HUDPauseButtonLeftClicked instead")]
public event EventHandler HudPauseButtonPressed
<ObsoleteAttribute("Use HUDPauseButtonLeftClicked instead")>
Public Event HudPauseButtonPressed As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace