RhinoCommon API
RenderContent.CurrentEnvironmentChanged Event
 Event fired when changes to current environments have been made. This will be one of Background, Reflection or Skylighting Since 6.11
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public static event EventHandler<RenderContentEventArgs> CurrentEnvironmentChanged
Public Shared Event CurrentEnvironmentChanged As EventHandler(Of RenderContentEventArgs)
Value
Type: System.EventHandler<RenderContentEventArgs>
See Also
Reference
RenderContent Class
Rhino.Render Namespace