RhinoCommon API
UndoRedo.UndoRedoChanged Event
 Called after undo or redo has occurred for document settings.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static event EventHandler<RenderPropertyChangedEvent> UndoRedoChanged
Public Shared Event UndoRedoChanged As EventHandler(Of RenderPropertyChangedEvent)
Value
Type: System.EventHandler<RenderPropertyChangedEvent>
See Also
Reference
UndoRedo Class
Rhino.Render Namespace