RhinoCommon API
RhinoDoc.EndOpenDocument Event
[Missing <summary> documentation for "E:Rhino.RhinoDoc.EndOpenDocument"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<DocumentOpenEventArgs> EndOpenDocument
Public Shared Event EndOpenDocument As EventHandler(Of DocumentOpenEventArgs)
Value
Type: System.EventHandler<DocumentOpenEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace