RhinoCommon API
UserInterfaceTextBox.TextChanged Event
 Event triggered every time the text changes, once per keystroke
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler TextChanged
Public Event TextChanged As EventHandler
Value
Type: System.EventHandler
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace