RhinoCommon API
RealtimeDisplayMode.HudPlayButtonPressed Event
Note: This API is now obsolete.
 Listen to this event if you want to handle the play button control.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use HUDPlayButtonLeftClicked instead")]
public event EventHandler HudPlayButtonPressed
<ObsoleteAttribute("Use HUDPlayButtonLeftClicked instead")>
Public Event HudPlayButtonPressed As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace