RhinoCommon API
Notification.PropertyChanged Event
 Triggered whenever a visible property of the instance changes.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public event PropertyChangedEventHandler PropertyChanged
Public Event PropertyChanged As PropertyChangedEventHandler
Value
Type: System.ComponentModel.PropertyChangedEventHandler
Implements
INotifyPropertyChanged.PropertyChanged
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace