RhinoCommon API
RhinoApp.CommandPromptChanged Event
 Fired when the command line changes
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<CommandPromptChangedEventArgs> CommandPromptChanged
Public Shared Event CommandPromptChanged As EventHandler(Of CommandPromptChangedEventArgs)
Value
Type: System.EventHandler<CommandPromptChangedEventArgs>
See Also
Reference
RhinoApp Class
Rhino Namespace