RhinoCommon API
DisplayPipeline.DisplayModeChanged Event
[Missing <summary> documentation for "E:Rhino.Display.DisplayPipeline.DisplayModeChanged"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public static event EventHandler<DisplayModeChangedEventArgs> DisplayModeChanged
Public Shared Event DisplayModeChanged As EventHandler(Of DisplayModeChangedEventArgs)
Value
Type: System.EventHandler<DisplayModeChangedEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace