RhinoCommon API
RhinoDoc.GroupTableEvent Event
 Called when any modification happens to a document's group table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<GroupTableEventArgs> GroupTableEvent
Public Shared Event GroupTableEvent As EventHandler(Of GroupTableEventArgs)
Value
Type: System.EventHandler<GroupTableEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace