RhinoCommon API
RenderContent.ContentDeleted Event
 Used to monitor render content deletion from the document.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static event EventHandler<RenderContentEventArgs> ContentDeleted
Public Shared Event ContentDeleted As EventHandler(Of RenderContentEventArgs)
Value
Type: System.EventHandler<RenderContentEventArgs>
See Also
Reference
RenderContent Class
Rhino.Render Namespace