RhinoCommon API
Command.UndoRedo Event
 Used to monitor Rhino's built in undo/redo support.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<UndoRedoEventArgs> UndoRedo
Public Shared Event UndoRedo As EventHandler(Of UndoRedoEventArgs)
Value
Type: System.EventHandler<UndoRedoEventArgs>
See Also
Reference
Command Class
Rhino.Commands Namespace