RhinoCommon API
ImageFile.Deleted Event
 Called when the RDK is cleaning up old render image files, a plug-in should delete any plug-in specific image files at this time.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public static event EventHandler<ImageFileEventArgs> Deleted
Public Shared Event Deleted As EventHandler(Of ImageFileEventArgs)
Value
Type: System.EventHandler<ImageFileEventArgs>
See Also
Reference
ImageFile Class
Rhino.Render Namespace