RhinoCommon API
RhinoDoc.NewDocument Event
[Missing <summary> documentation for "E:Rhino.RhinoDoc.NewDocument"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<DocumentEventArgs> NewDocument
Public Shared Event NewDocument As EventHandler(Of DocumentEventArgs)
Value
Type: System.EventHandler<DocumentEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace