RhinoCommon API
RhinoDoc.LayerTableEvent Event
 Called when any modification happens to a document's layer table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<LayerTableEventArgs> LayerTableEvent
Public Shared Event LayerTableEvent As EventHandler(Of LayerTableEventArgs)
Value
Type: System.EventHandler<LayerTableEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace