RhinoCommon API
EventWatcher.CloseDocument Event
Raised when a document is closed.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler<DocumentEventArgs> CloseDocument
Public Event CloseDocument As EventHandler(Of DocumentEventArgs)
Value
Type: System.EventHandler<DocumentEventArgs>
See Also
Reference
EventWatcher Class
Rhino Namespace