RhinoCommon API
ThumbData.PropertyChanged Event
[Missing <summary> documentation for "E:Rhino.UI.Controls.ThumbnailUI.ThumbData.PropertyChanged"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public event PropertyChangedEventHandler PropertyChanged
Public Event PropertyChanged As PropertyChangedEventHandler
Value
Type: System.ComponentModel.PropertyChangedEventHandler
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace