RhinoCommon API
RhinoDoc.ActiveDocumentChanged Event
 This event is raised when the active document used by modeless user interface changes. On Mac Rhino this will get raised before the NewDocument, BeginOpenDocument and EndOpenDocument events. Mac Rhino will also raise this event with 0 for the document Id and a null document pointer when the last document is closed. Windows Rhino will raise this event after the NewDocument, BeginOpenDocument and EndOpenDocument events when a new or existing model is opened.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static event EventHandler<DocumentEventArgs> ActiveDocumentChanged
Public Shared Event ActiveDocumentChanged As EventHandler(Of DocumentEventArgs)
Value
Type: System.EventHandler<DocumentEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace