RhinoCommon API
RenderChannels.Changed Event
 This event is raised when a Render Channels property value is changed.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static event EventHandler<RenderPropertyChangedEvent> Changed
Public Shared Event Changed As EventHandler(Of RenderPropertyChangedEvent)
Value
Type: System.EventHandler<RenderPropertyChangedEvent>
See Also
Reference
RenderChannels Class
Rhino.Render Namespace