RhinoCommon API
RhinoDoc.SectionStyleTableEvent Event
 Called when any modification happens to a document's section style table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static event EventHandler<SectionStyleTableEventArgs> SectionStyleTableEvent
Public Shared Event SectionStyleTableEvent As EventHandler(Of SectionStyleTableEventArgs)
Value
Type: System.EventHandler<SectionStyleTableEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace