RhinoCommon API
DisplayPipeline.CalculateBoundingBoxZoomExtents Event
 Calculate a bounding to include in the Zoom Extents command.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<CalculateBoundingBoxEventArgs> CalculateBoundingBoxZoomExtents
Public Shared Event CalculateBoundingBoxZoomExtents As EventHandler(Of CalculateBoundingBoxEventArgs)
Value
Type: System.EventHandler<CalculateBoundingBoxEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace