RhinoCommon API
EventWatcher.DeleteRhinoObject Event
Raised when an object is deleted from a document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler<RhinoObjectEventArgs> DeleteRhinoObject
Public Event DeleteRhinoObject As EventHandler(Of RhinoObjectEventArgs)
Value
Type: System.EventHandler<RhinoObjectEventArgs>
See Also
Reference
EventWatcher Class
Rhino Namespace