RhinoCommon API
RhinoDoc.LightTableEvent Event
 Called when any modification happens to a document's light table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public static event EventHandler<LightTableEventArgs> LightTableEvent
Public Shared Event LightTableEvent As EventHandler(Of LightTableEventArgs)
Value
Type: System.EventHandler<LightTableEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace