RhinoCommon API
Command.BeginCommand Event
 Called just before command.RunCommand().
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<CommandEventArgs> BeginCommand
Public Shared Event BeginCommand As EventHandler(Of CommandEventArgs)
Value
Type: System.EventHandler<CommandEventArgs>
See Also
Reference
Command Class
Rhino.Commands Namespace