RhinoCommon API
GetCancel.TaskCompleted Event
[Missing <summary> documentation for "E:Rhino.Input.Custom.GetCancel.TaskCompleted"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public event EventHandler<TaskCompleteEventArgs> TaskCompleted
Public Event TaskCompleted As EventHandler(Of TaskCompleteEventArgs)
Value
Type: System.EventHandler<TaskCompleteEventArgs>
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace