RhinoCommon API
RealtimeDisplayMode.MaxPassesChanged Event
 Listen to this if you want to handle changes in maximum pass count through the HUD.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public event EventHandler<RealtimeDisplayMode.HudMaxPassesChangedEventArgs> MaxPassesChanged
Public Event MaxPassesChanged As EventHandler(Of RealtimeDisplayMode.HudMaxPassesChangedEventArgs)
Value
Type: System.EventHandler<RealtimeDisplayMode.HudMaxPassesChangedEventArgs>
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace