RhinoCommon API
EventWatcher.PurgeRhinoObject Event
Raised when an object is purged from a document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public event EventHandler<RhinoObjectEventArgs> PurgeRhinoObject
Public Event PurgeRhinoObject As EventHandler(Of RhinoObjectEventArgs)
Value
Type: System.EventHandler<RhinoObjectEventArgs>
See Also
Reference
EventWatcher Class
Rhino Namespace