RhinoCommon API
RhinoDoc.MaterialTableEvent Event
 Called when any modification happens to a document's material table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static event EventHandler<MaterialTableEventArgs> MaterialTableEvent
Public Shared Event MaterialTableEvent As EventHandler(Of MaterialTableEventArgs)
Value
Type: System.EventHandler<MaterialTableEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace