RhinoCommon API
RhinoDoc.EndOpenDocumentInitialViewUpdate Event
 This event is raised after EndOpenDocument when the documents initial views have been created and initialized.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public static event EventHandler<DocumentOpenEventArgs> EndOpenDocumentInitialViewUpdate
Public Shared Event EndOpenDocumentInitialViewUpdate As EventHandler(Of DocumentOpenEventArgs)
Value
Type: System.EventHandler<DocumentOpenEventArgs>
See Also
Reference
RhinoDoc Class
Rhino Namespace