RhinoCommon API
RenderContent Events
The RenderContent type exposes the following members.
Events
Name | Description
ContentAdded
 Used to monitor render content addition to the document.
ContentChanged
 Used to monitor render content modifications.
ContentDeleted
 Used to monitor render content deletion from the document.
ContentDeleting
 Used to monitor render content deletion from the document.
ContentFieldChanged
 This event is raised when a field value is modified.
ContentRenamed
 Used to monitor render content renaming in the document.
ContentReplaced
 Used to monitor render content replacing in the document.
ContentReplacing
 Used to monitor render content replacing in the document.
ContentUpdatePreview
 Used to monitor render content preview updates.
CurrentEnvironmentChanged
 Event fired when changes to current environments have been made. This will be one of Background, Reflection or Skylighting Since 6.11
PreviewRendered
 This event is raised when a preview has been rendered
Top
See Also
Reference
RenderContent Class
Rhino.Render Namespace