RhinoCommon API
RenderChannels Events
The RenderChannels type exposes the following members.
Events
Name | Description
Changed
 This event is raised when a Render Channels property value is changed.
Top
See Also
Reference
RenderChannels Class
Rhino.Render Namespace