RhinoCommon API
UserInterfaceCheckBox Events
The UserInterfaceCheckBox type exposes the following members.
Events
Name | Description
CheckedChanged
 Event triggered when a click changes the state of the check box
Top
See Also
Reference
UserInterfaceCheckBox Class
Rhino.UI Namespace