RhinoCommon API
UserInterfaceRadioButton Events
The UserInterfaceRadioButton type exposes the following members.
Events
Name | Description
CheckedChanged
 Event triggered when a click or a key changes the state of this radio button
Top
See Also
Reference
UserInterfaceRadioButton Class
Rhino.UI Namespace