RhinoCommon API
UndoRedo Events
The UndoRedo type exposes the following members.
Events
Name | Description
UndoRedoChanged
 Called after undo or redo has occurred for document settings.
UndoRedoEndedChanged
 This event is raised when undo/redo ends in rdk.
Top
See Also
Reference
UndoRedo Class
Rhino.Render Namespace