RhinoCommon API
UserInterfaceTextBox Events
The UserInterfaceTextBox type exposes the following members.
Events
Name | Description
EditCanceled
 Event triggered when Escape puts back the text the box started with
KeyboardFocusChanged
 Event triggered when the box gains or loses keyboard focus
TextChanged
 Event triggered every time the text changes, once per keystroke
TextCommitted
 Event triggered when what was typed is committed, by Enter or by the box losing focus with the text changed
Top
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace