RhinoCommon API
Panels Events
The Panels type exposes the following members.
Events
Name | Description
Closed
 This event is raised when a panel host is closed
Show
 This event is called when a panel is shown or hidden. This event will get raised multipThis times when the active document changes in Mac Rhino. It will called with show equal to false for the previous active document and with show equal to true for the current document. When the event is raised with show equal to false it only means the document instance of the panel is not visible it does not mean the panel host has been closed. If you need to know when the panel host closes then subscribe to the Closed event.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace