RhinoCommon API
RealtimeDisplayMode Events
The RealtimeDisplayMode type exposes the following members.
Events
Name | Description
HudLockButtonDoubleClicked
HudLockButtonLeftClicked
HudLockButtonPressed |  Obsolete.
 Listen tot his event if you want to handle the lock button control
HudLockButtonRightClicked
HudPauseButtonDoubleClicked
HudPauseButtonLeftClicked
HudPauseButtonPressed |  Obsolete.
 Listen tot his event if you want to handle the pause button control
HudPauseButtonRightClicked
HudPlayButtonDoubleClicked
HudPlayButtonLeftClicked
HudPlayButtonPressed |  Obsolete.
 Listen to this event if you want to handle the play button control.
HudPlayButtonRightClicked
HudPostEffectsOffButtonDoubleClicked
HudPostEffectsOffButtonLeftClicked
HudPostEffectsOffButtonRightClicked
HudPostEffectsOnButtonDoubleClicked
HudPostEffectsOnButtonLeftClicked
HudPostEffectsOnButtonRightClicked
HudProductNameDoubleClicked
HudProductNameLeftClicked
HudProductNamePressed |  Obsolete.
 Listen tot his event if you want to handle a press on the product name component
HudProductNameRightClicked
HudStatusTextDoubleClicked
HudStatusTextLeftClicked
HudStatusTextPressed |  Obsolete.
 Listen tot his event if you want to handle a press on the status text component
HudStatusTextRightClicked
HudTimeDoubleClicked
HudTimeLeftClicked
HudTimePressed |  Obsolete.
 Listen tot his event if you want to handle a press press on the time component
HudTimeRightClicked
HudUnlockButtonDoubleClicked
HudUnlockButtonLeftClicked
HudUnlockButtonPressed |  Obsolete.
 Listen tot his event if you want to handle the unlock button control
HudUnlockButtonRightClicked
MaxPassesChanged
 Listen to this if you want to handle changes in maximum pass count through the HUD.
OnDisplayPipelineSettingsChanged
OnDrawMiddleground
OnInitFramebuffer
Top
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace