RhinoCommon API
HostUtils Events
The HostUtils type exposes the following members.
Events
Name | Description
OnExceptionReport
 Is raised when an exception is reported with one of the ExceptionReport(Exception) method.
OnSendLogMessageToCloud
 Is raised when an exception is reported with one of the method.
Top
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace