RhinoCommon API
CollapsibleSectionImpl Events
The CollapsibleSectionImpl type exposes the following members.
Events
Name | Description
DataChanged
ViewModelActivated
Top
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace