RhinoCommon API
Skylight Events
The Skylight type exposes the following members.
Events
Name | Description
Changed
 This event is raised when a Skylight property value is changed.
Top
See Also
Reference
Skylight Class
Rhino.Render Namespace