RhinoCommon API
Notification Events
The Notification type exposes the following members.
Events
Name | Description
PropertyChanged
 Triggered whenever a visible property of the instance changes.
Top
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace