RhinoCommon API
DisplayPipeline Events
The DisplayPipeline type exposes the following members.
Events
Name | Description
CalculateBoundingBox
CalculateBoundingBoxZoomExtents
 Calculate a bounding to include in the Zoom Extents command.
DisplayModeChanged
DrawForeground
 Called after all non-highlighted objects have been drawn and PostDrawObjects has been called. Depth writing and testing are turned OFF. If you want to draw with depth writing/testing, see PostDrawObjects.
DrawOverlay
 If Rhino is in a feedback mode, the draw overlay call allows for temporary geometry to be drawn on top of everything in the scene. This is similar to the dynamic draw routine that occurs with custom get point.
InitFrameBuffer
ObjectCulling
PostDrawObject
 Called right after an individual object has been drawn. NOTE: Do not use this event unless you absolutely need to. It is called for every object in the document and can slow display down if a large number of objects exist in the document
PostDrawObjects
 Called after all non-highlighted objects have been drawn. Depth writing and testing are still turned on. If you want to draw without depth writing/testing, see DrawForeground.
PostProcessFrameBuffer
 Called after the frame has been drawn, with the finished frame available to be read. Use this to record or stream a viewport: TryCopyFrameBuffer(IntPtr, Int32, Int32) copies the frame that was just drawn, and never redraws the scene.
Every frame drawn while this event is subscribed costs an extra frame buffer read back, whether or not the handler reads anything. Unsubscribe as soon as the frames are no longer needed.
The handler runs on the thread that drew the frame and holds up the next one. Copy the pixels here and do the rest of the work somewhere else.
PreDrawObject
 Called right before an individual object is being drawn. NOTE: Do not use this event unless you absolutely need to. It is called for every object in the document and can slow display down if a large number of objects exist in the document
PreDrawObjects
 Called before objects are been drawn. Depth writing and testing are on.
PreDrawTransparentObjects
 Called before transparent objects have been drawn. Depth writing and testing are on.
ViewportProjectionChanged
 Called when the projection changes for a viewport being drawn.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace