RhinoCommon API
RhinoDoc Events
The RhinoDoc type exposes the following members.
Events
Name | Description
ActiveDocumentChanged
 This event is raised when the active document used by modeless user interface changes. On Mac Rhino this will get raised before the NewDocument, BeginOpenDocument and EndOpenDocument events. Mac Rhino will also raise this event with 0 for the document Id and a null document pointer when the last document is closed. Windows Rhino will raise this event after the NewDocument, BeginOpenDocument and EndOpenDocument events when a new or existing model is opened.
AddRhinoObject
Called if a new object is added to the document.
AfterTransformObjects
 Called after objects are being transformed
BeforeTransformObjects
 Called before objects are being transformed
BeginOpenDocument
 This event is raised when the document open operation begins. NOTE: On Windows, this event will be fired when a clipboard paste operation occurs, as Rhino opens a .tmp file in the User's Local folder with the contents of the pasted document.
BeginSaveDocument
CloseDocument
DeleteRhinoObject
 Called if an object is deleted. At some later point the object can be un-deleted.
DeselectAllObjects
 Called when all objects are deselected.
DeselectObjects
 Called when object(s) are deselected.
DimensionStyleTableEvent
 Called when any modification happens to a document's dimension style table.
DocumentPropertiesChanged
EndOpenDocument
EndOpenDocumentInitialViewUpdate
 This event is raised after EndOpenDocument when the documents initial views have been created and initialized.
EndSaveDocument
GroupTableEvent
 Called when any modification happens to a document's group table.
HatchPatternTableEvent
 Called when any modification happens to a document's hatch pattern table.
InstanceDefinitionTableEvent
 Called when any modification happens to a document's instance definition table.
LayerTableEvent
 Called when any modification happens to a document's layer table.
LightTableEvent
 Called when any modification happens to a document's light table.
LinetypeTableEvent
 Called when any modification happens to a document's linetype table.
MarkupTableEvent
 Called when any modification happens to a document's markup table.
MarkupViewChanged
 Called when a document's markup view state changes, i.e. when the document enters or leaves markup viewing/editing, or switches which markup is being viewed or edited. Unlike MarkupTableEvent (which reports markup add/delete/modify), this reports which markup is currently active so UI can indicate it.
MaterialTableEvent
 Called when any modification happens to a document's material table.
ModifyObjectAttributes
 Called when all object attributes are changed.
NewDocument
PageViewGroupTableEvent
 Called when any modification happens to a document's pageview group table.
PurgeRhinoObject
 Called if an object is being purged from a document. The object will cease to exist forever.
RenderEnvironmentTableEvent
RenderMaterialsTableEvent
RenderTextureTableEvent
 Called when the RenderTextureTable has been loaded, is about to be cleared or has been cleared. See RhinoDoc.RenderContentTableEventType for more information.
ReplaceRhinoObject
 Called if an object is about to be replaced. If both UndoActive and RedoActive return false, then immediately after the ReplaceRhinoObject event, there will be a DeleteRhinoObject event followed by a AddRhinoObject event. If either UndoActive or UndoActive return true, then immediately after the ReplaceRhinoObject event, there will be a DeleteRhinoObject event followed by a UndeleteRhinoObject event.
SectionStyleTableEvent
 Called when any modification happens to a document's section style table.
SelectObjects
 Called when object(s) are selected.
TextureMappingEvent
 Called when any modification happens to a document objects texture mapping.
UndeleteRhinoObject
Called if an object is un-deleted.
UnitsChangedWithScaling
 Called when a change in the model units results in a scaling operation on all of the objects in the document. This call is made before any of the objects are scaled. A call to RhinoDoc.DocumentPropertiesChanged follows.
UserStringChanged
 This event is raised when document user text strings are changed
WorksessionFileChanged
 Raised after a worksession reference model has been attached to or detached from a document. The document state already reflects the change at the time the event fires.
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace