RhinoCommon API
SafeFrame Events
The SafeFrame type exposes the following members.
Events
Name | Description
Changed
 This event is raised when a SafeFrame property value is changed.
Top
See Also
Reference
SafeFrame Class
Rhino.Render Namespace