RhinoCommon API
RhinoObject Events
The RhinoObject type exposes the following members.
Events
Name | Description
AnalysisModeChanged
 Called when the visual analysis mode of a changes.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace