RhinoCommon API
TrulyObservableOrderedSet<T> Events
The TrulyObservableOrderedSet<T> generic type exposes the following members.
Events
Name | Description
CollectionChanged
 Triggered whenever the set changes or when one of its elements has its PropertyChanged event triggered.
Top
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace