RhinoCommon API
PlugIn Events
The PlugIn type exposes the following members.
Events
Name | Description
SettingsSaved
 This event is raised when an instance of Rhino has modified the external settings file associated with this plug-in's Settings property.
UnknownUserData
 This event is raised when a 3dm file is loaded with unknown user data, and the plug-in to handle it could not be loaded.
Top
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace