RhinoCommon API
RhinoView Events
The RhinoView type exposes the following members.
Events
Name | Description
Create
Destroy
EnableDrawingChanged
 Called when the state of changes.
Modified
Rename
SetActive
Top
See Also
Reference
RhinoView Class
Rhino.Display Namespace