RhinoCommon API
EventWatcher Events
The EventWatcher type exposes the following members.
Events
Name | Description
AddRhinoObject
Raised when a new object is added to a document.
BeginOpenDocument
Raised when a document open operation begins.
CloseDocument
Raised when a document is closed.
DeleteRhinoObject
Raised when an object is deleted from a document.
EndOpenDocument
Raised when a document open operation ends.
NewDocument
Raised when a new document is created.
PurgeRhinoObject
Raised when an object is purged from a document.
ReplaceRhinoObject
Raised when an object is about to be replaced.
UndeleteRhinoObject
Raised when a previously deleted object is un-deleted.
Top
See Also
Reference
EventWatcher Class
Rhino Namespace