RhinoCommon API
Sun Events
The Sun type exposes the following members.
Events
Name | Description
Changed
 This event is raised when a Sun property value is changed.
Top
See Also
Reference
Sun Class
Rhino.Render Namespace