RhinoCommon API
File3dmTypeCodes.TCODE_OBJECT_RECORD_END Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OBJECT_RECORD_END"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OBJECT_RECORD_END = 2181038207
Public Const TCODE_OBJECT_RECORD_END As UInteger = 2181038207
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace