RhinoCommon API
RhinoMath.DefaultAngleTolerance Field
 Represents the default angle tolerance, used when no other values are provided.
This is one degree, expressed in radians.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const double DefaultAngleTolerance = 0.0174532925199433
Public Const DefaultAngleTolerance As Double = 0.0174532925199433
Field Value
Type: Double
Remarks
 This is equivalent to openNURBS ON_DEFAULT_ANGLE_TOLERANCE.
See Also
Reference
RhinoMath Class
Rhino Namespace