RhinoCommon API
RhinoMath.Tau Field
 Ratio of circumference divided by radius. Full rotation. 360 degrees. 6.28...
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const double Tau = 6.28318530717959
Public Const Tau As Double = 6.28318530717959
Field Value
Type: Double
See Also
Reference
RhinoMath Class
Rhino Namespace