RhinoCommon API
MeshPointDataStruct.m_ci_type Field
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint m_ci_type
Public m_ci_type As UInteger
Field Value
Type: UInt32
See Also
Reference
MeshPointDataStruct Structure
Rhino.Runtime.InteropWrappers Namespace