RhinoCommon API
TexturedValue<T>.Texture Field
[Missing <summary> documentation for "F:Rhino.Render.TexturedValue`1.Texture"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderTexture Texture
Public Texture As RenderTexture
Field Value
Type: RenderTexture
See Also
Reference
TexturedValue<T> Class
Rhino.Render Namespace