RhinoCommon API
LengthUnit.Centimeters Field
1 millimeter = 1.0e-2 meters
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly LengthUnit Centimeters
Public Shared ReadOnly Centimeters As LengthUnit
Field Value
Type: LengthUnit
See Also
Reference
LengthUnit Structure
Rhino Namespace