RhinoCommon API
File3dmTypeCodes.TCODE_VIEW_CPLANE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_CPLANE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW_CPLANE = 536903995
Public Const TCODE_VIEW_CPLANE As UInteger = 536903995
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace