RhinoCommon API
RhDisplayPoint.m_fillColor Field
[Missing <summary> documentation for "F:Rhino.Runtime.InteropWrappers.RhDisplayPoint.m_fillColor"]
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int m_fillColor
Public m_fillColor As Integer
Field Value
Type: Int32
See Also
Reference
RhDisplayPoint Structure
Rhino.Runtime.InteropWrappers Namespace