RhinoCommon API
FilePlyWriteOptions.WriteOptions Field
[Missing <summary> documentation for "F:Rhino.FileIO.FilePlyWriteOptions.WriteOptions"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileWriteOptions WriteOptions
Public WriteOptions As FileWriteOptions
Field Value
Type: FileWriteOptions
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace