RhinoCommon API
FileObjReadOptions.ReadOptions Field
 Rhino's FileReadOptions passed into ReadFile
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileReadOptions ReadOptions
Public ReadOptions As FileReadOptions
Field Value
Type: FileReadOptions
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace