RhinoCommon API
RenderMaterial.BasicMaterialParameterNames.ReflectivityColor Field
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.ReflectivityColor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const string ReflectivityColor = "reflectivity-color"
Public Const ReflectivityColor As String = "reflectivity-color"
Field Value
Type: String
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace