RhinoCommon API
RenderMaterial.BasicMaterialParameterNames.Specular Field
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.Specular"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const string Specular = "specular"
Public Const Specular As String = "specular"
Field Value
Type: String
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace