RhinoCommon API
TexturedValue<T>.Value Field
[Missing <summary> documentation for "F:Rhino.Render.TexturedValue`1.Value"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public T Value
Public Value As T
Field Value
Type: T
See Also
Reference
TexturedValue<T> Class
Rhino.Render Namespace