RhinoCommon API
File3dmTypeCodes.TCODE_USER_TABLE_RECORD_HEADER Field
(TCODE_TABLEREC | TCODE_CRC | 0x0082)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_USER_TABLE_RECORD_HEADER = 536903810
Public Const TCODE_USER_TABLE_RECORD_HEADER As UInteger = 536903810
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace