RhinoCommon API
File3dmTypeCodes.TCODE_OPENNURBS_CLASS_USERDATA Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OPENNURBS_CLASS_USERDATA"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OPENNURBS_CLASS_USERDATA = 163837
Public Const TCODE_OPENNURBS_CLASS_USERDATA As UInteger = 163837
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace