RhinoCommon API
File3dmTypeCodes.TCODE_MATERIAL_RECORD Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_MATERIAL_RECORD"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_MATERIAL_RECORD = 536903744
Public Const TCODE_MATERIAL_RECORD As UInteger = 536903744
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace