RhinoCommon API
DracoCompressionOptions.IncludeVertexColors Field
 Include vertex colors in the compressed data.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncludeVertexColors
Public IncludeVertexColors As Boolean
Field Value
Type: Boolean
See Also
Reference
DracoCompressionOptions Class
Rhino.FileIO Namespace