RhinoCommon API
MeshPointDataStruct.m_t3 Field
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double m_t3
Public m_t3 As Double
Field Value
Type: Double
See Also
Reference
MeshPointDataStruct Structure
Rhino.Runtime.InteropWrappers Namespace