RhinoCommon API
RhinoMath.UnsetSingle Field
 Gets the single precision floating point number that is considered 'unset' in Rhino.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const float UnsetSingle = -1.234321E+38f
Public Const UnsetSingle As Single = -1.234321E+38F
Field Value
Type: Single
Remarks
 This is equivalent to openNURBS ON_UNSET_FLOAT.
See Also
Reference
RhinoMath Class
Rhino Namespace