RhinoCommon API
File3dmTypeCodes.TCODE_OPENNURBS_CLASS_UUID Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OPENNURBS_CLASS_UUID"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OPENNURBS_CLASS_UUID = 196603
Public Const TCODE_OPENNURBS_CLASS_UUID As UInteger = 196603
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace