RhinoCommon API
RhinoMath.HalfPI Field
 Quarter of a rotation. 90 degrees. 1.57...
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const double HalfPI = 1.5707963267949
Public Const HalfPI As Double = 1.5707963267949
Field Value
Type: Double
See Also
Reference
RhinoMath Class
Rhino Namespace