RhinoCommon API
File3dmTypeCodes.TCODE_UTF8_STRING_CHUNK Field
(TCODE_USER | TCODE_CRC | 0x0001)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_UTF8_STRING_CHUNK = 1073774593
Public Const TCODE_UTF8_STRING_CHUNK As UInteger = 1073774593
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace