RhinoCommon API
LengthUnit.Unset Field
Unset unit
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly LengthUnit Unset
Public Shared ReadOnly Unset As LengthUnit
Field Value
Type: LengthUnit
See Also
Reference
LengthUnit Structure
Rhino Namespace