RhinoCommon API
LengthUnit.Miles Field
1 yard = 1609.344 meters = 5280 feet
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly LengthUnit Miles
Public Shared ReadOnly Miles As LengthUnit
Field Value
Type: LengthUnit
See Also
Reference
LengthUnit Structure
Rhino Namespace