RhinoCommon API
MeshPointDataStruct.m_Triangle Field
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public char m_Triangle
Public m_Triangle As Char
Field Value
Type: Char
See Also
Reference
MeshPointDataStruct Structure
Rhino.Runtime.InteropWrappers Namespace