RhinoCommon API
DracoCompressionOptions.IncludeNormals Field
 Include vertex normals in the compressed data.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncludeNormals
Public IncludeNormals As Boolean
Field Value
Type: Boolean
See Also
Reference
DracoCompressionOptions Class
Rhino.FileIO Namespace