RhinoCommon API
RhinoMath.Epsilon Field
 Gets the value of DBL_EPSILON, which is the smallest positive floating point number x such that 1 + x != 1. This is different than Double.Epsilon which is the smallest positive Double value that is greater than zero.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const double Epsilon = 2.22044604925031E-16
Public Const Epsilon As Double = 2.22044604925031E-16
Field Value
Type: Double
Remarks
 This is equivalent to openNURBS ON_EPSILON.
See Also
Reference
RhinoMath Class
Rhino Namespace