RhinoCommon API
File3dmTypeCodes.TCODE_MARKUP_TABLE Field
(TCODE_TABLE | 0x0028)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_MARKUP_TABLE = 268435496
Public Const TCODE_MARKUP_TABLE As UInteger = 268435496
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace