RhinoCommon API
RenderMaterial.BasicMaterialParameterNames.Diffuse Field
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.Diffuse"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const string Diffuse = "diffuse"
Public Const Diffuse As String = "diffuse"
Field Value
Type: String
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace