RhinoCommon API
RenderMeshProvider.m_disposed Field
 m_disposed available for sub-classes to check.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected bool m_disposed
Protected m_disposed As Boolean
Field Value
Type: Boolean
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace