RhinoCommon API
File3dmTypeCodes.TCODE_NAMED_VIEW Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_NAMED_VIEW"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_NAMED_VIEW = 33554437
Public Const TCODE_NAMED_VIEW As UInteger = 33554437
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace