RhinoCommon API
LengthUnit.Feet Field
1 foot = 0.3048 meters = 12 inches
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly LengthUnit Feet
Public Shared ReadOnly Feet As LengthUnit
Field Value
Type: LengthUnit
See Also
Reference
LengthUnit Structure
Rhino Namespace