RhinoCommon API
File3dmTypeCodes.TCODE_OBSOLETE_LAYERSET_TABLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OBSOLETE_LAYERSET_TABLE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OBSOLETE_LAYERSET_TABLE = 268435492
Public Const TCODE_OBSOLETE_LAYERSET_TABLE As UInteger = 268435492
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace