RhinoCommon API
SubDEdgeSharpness.CreaseValue Field
 The value used to indicate that an edge is a crease, MaximumValue + 1.0. This is deliberately not a valid sharpness value: a crease edge is not a sharp edge. It exists because it is often convenient to use a single value to describe both.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public const double CreaseValue = 5
Public Const CreaseValue As Double = 5
Field Value
Type: Double
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace