RhinoCommon API
RhinoMath.SqrtEpsilon Field
 Represents a default value that is used when comparing square roots.
This value is several orders of magnitude larger than ZeroTolerance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const double SqrtEpsilon = 1.490116119385E-08
Public Const SqrtEpsilon As Double = 1.490116119385E-08
Field Value
Type: Double
Remarks
 This is equivalent to openNURBS ON_SQRT_EPSILON.
See Also
Reference
RhinoMath Class
Rhino Namespace