RhinoCommon API
SubDEdgeSharpness.SmoothValue Field
 The sharpness value of a smooth edge, 0.0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public const double SmoothValue = 0
Public Const SmoothValue As Double = 0
Field Value
Type: Double
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace