RhinoCommon API
DracoCompressionOptions.VertexColorFormat Field
 Color format of vertex colors in compressed data
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DracoColorFormat VertexColorFormat
Public VertexColorFormat As DracoColorFormat
Field Value
Type: DracoColorFormat
See Also
Reference
DracoCompressionOptions Class
Rhino.FileIO Namespace