RhinoCommon API
Light.LinearAttenuationVector Field
 Vector denoting a linear light attenuation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly Vector3d LinearAttenuationVector
Public Shared ReadOnly LinearAttenuationVector As Vector3d
Field Value
Type: Vector3d
See Also
Reference
Light Class
Rhino.Geometry Namespace