RhinoCommon API
File3dmTypeCodes.TCODE_LAYER_TABLE Field
layers.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LAYER_TABLE = 268435473
Public Const TCODE_LAYER_TABLE As UInteger = 268435473
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace