RhinoCommon API
MeshPointDataStruct.m_ci_index Field
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int m_ci_index
Public m_ci_index As Integer
Field Value
Type: Int32
See Also
Reference
MeshPointDataStruct Structure
Rhino.Runtime.InteropWrappers Namespace