RhinoCommon API
File3dmTypeCodes.TCODE_LEGACY_SHLSTUFF Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_SHLSTUFF"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LEGACY_SHLSTUFF = 65795
Public Const TCODE_LEGACY_SHLSTUFF As UInteger = 65795
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace