RhinoCommon API
File3dmTypeCodes.TCODE_PAGEVIEWGROUP_RECORD Field
(TCODE_TABLEREC | TCODE_CRC | 0x007E)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_PAGEVIEWGROUP_RECORD = 536903806
Public Const TCODE_PAGEVIEWGROUP_RECORD As UInteger = 536903806
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace