RhinoCommon API
File3dmTypeCodes.TCODE_CRC Field
0x8000.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_CRC = 32768
Public Const TCODE_CRC As UInteger = 32768
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace