RhinoCommon API
TexturedValue<T>.Name Field
[Missing <summary> documentation for "F:Rhino.Render.TexturedValue`1.Name"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public readonly string Name
Public ReadOnly Name As String
Field Value
Type: String
See Also
Reference
TexturedValue<T> Class
Rhino.Render Namespace