RhinoCommon API
File3dmTypeCodes.TCODE_PAGEVIEWGROUP_TABLE Field
(TCODE_TABLE | 0x0029)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_PAGEVIEWGROUP_TABLE = 268435497
Public Const TCODE_PAGEVIEWGROUP_TABLE As UInteger = 268435497
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace