RhinoCommon API
DracoCompressionOptions.IncludeTextureCoordinates Field
 Include texture coordinates in the compressed data.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncludeTextureCoordinates
Public IncludeTextureCoordinates As Boolean
Field Value
Type: Boolean
See Also
Reference
DracoCompressionOptions Class
Rhino.FileIO Namespace