RhinoCommon API
File3dmTypeCodes.TCODE_TEXTURE_MAPPING_RECORD Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_TEXTURE_MAPPING_RECORD"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_TEXTURE_MAPPING_RECORD = 536903802
Public Const TCODE_TEXTURE_MAPPING_RECORD As UInteger = 536903802
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace