RhinoCommon API
File3dmTypeCodes.TCODE_INSTANCE_DEFINITION_RECORD Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_INSTANCE_DEFINITION_RECORD"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_INSTANCE_DEFINITION_RECORD = 536903798
Public Const TCODE_INSTANCE_DEFINITION_RECORD As UInteger = 536903798
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace