RhinoCommon API
File3dmTypeCodes.TCODE_LAYER_OBSELETE_3 Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYER_OBSELETE_3"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LAYER_OBSELETE_3 = 2151677973
Public Const TCODE_LAYER_OBSELETE_3 As UInteger = 2151677973
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace