RhinoCommon API
File3dmTypeCodes.TCODE_SECTION_STYLE_TABLE Field
(TCODE_TABLE | 0x0027)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SECTION_STYLE_TABLE = 268435495
Public Const TCODE_SECTION_STYLE_TABLE As UInteger = 268435495
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace