RhinoCommon API
RhinoMath.ZeroTolerance Field
 Gets Rhino's Zero Tolerance constant, which is 2^-32. In cases when an absolute "zero" tolerance is required to compare model space coordinates, ZeroTolerance is used. The value of ZeroTolerance should be no smaller than Epsilon and should be several orders of magnitude smaller than SqrtEpsilon.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const double ZeroTolerance = 2.3283064365387E-10
Public Const ZeroTolerance As Double = 2.3283064365387E-10
Field Value
Type: Double
Remarks
 This is equivalent to openNURBS ON_ZERO_TOLERANCE.
See Also
Reference
RhinoMath Class
Rhino Namespace