RhinoCommon API
RhDisplayPoint.m_innerDiameterPixels Field
[Missing <summary> documentation for "F:Rhino.Runtime.InteropWrappers.RhDisplayPoint.m_innerDiameterPixels"]
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float m_innerDiameterPixels
Public m_innerDiameterPixels As Single
Field Value
Type: Single
See Also
Reference
RhDisplayPoint Structure
Rhino.Runtime.InteropWrappers Namespace