RhinoCommon API
Light.InverseSquaredAttenuationVector Field
 Vector denoting an inverse squared light attenuation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly Vector3d InverseSquaredAttenuationVector
Public Shared ReadOnly InverseSquaredAttenuationVector As Vector3d
Field Value
Type: Vector3d
See Also
Reference
Light Class
Rhino.Geometry Namespace