RhinoCommon API
RhinoMath.QuarterPI Field
 One eigth of a rotation. 45 degrees. 0.78...
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const double QuarterPI = 0.785398163397448
Public Const QuarterPI As Double = 0.785398163397448
Field Value
Type: Double
See Also
Reference
RhinoMath Class
Rhino Namespace