RhinoCommon API
LengthUnit.Kilometers Field
1 kilometer = 1.0e+3 meters
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly LengthUnit Kilometers
Public Shared ReadOnly Kilometers As LengthUnit
Field Value
Type: LengthUnit
See Also
Reference
LengthUnit Structure
Rhino Namespace