RhinoCommon API
Curve.SortedSegment.Reversed Field
 Indicates if the curve is to be reversed
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Reversed
Public Reversed As Boolean
Field Value
Type: Boolean
See Also
Reference
Curve.SortedSegment Structure
Rhino.Geometry Namespace