RhinoCommon API
File3dmTypeCodes.TCODE_PROPERTIES_AS_FILE_NAME Field
(TCODE_TABLEREC | TCODE_CRC | 0x0027)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_PROPERTIES_AS_FILE_NAME = 536903719
Public Const TCODE_PROPERTIES_AS_FILE_NAME As UInteger = 536903719
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace