RhinoCommon API
RhinoMath.InfiniteRadius Field
 Value used to indicate a radius of curvature is infinite.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public const double InfiniteRadius = 1E+300
Public Const InfiniteRadius As Double = 1E+300
Field Value
Type: Double
See Also
Reference
RhinoMath Class
Rhino Namespace