RhinoCommon API
SubDEdgeSharpness.MaximumValue Field
 The largest valid sharpness value, 4.0. Valid SubD edge sharpness values are between 0.0 and MaximumValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public const double MaximumValue = 4
Public Const MaximumValue As Double = 4
Field Value
Type: Double
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace