RhinoCommon API
TexturedValue<T>.On Field
[Missing <summary> documentation for "F:Rhino.Render.TexturedValue`1.On"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool On
Public On As Boolean
Field Value
Type: Boolean
See Also
Reference
TexturedValue<T> Class
Rhino.Render Namespace