RhinoCommon API
File3dmTypeCodes.TCODE_SETTINGS_GRID_DEFAULTS Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_GRID_DEFAULTS"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SETTINGS_GRID_DEFAULTS = 536903743
Public Const TCODE_SETTINGS_GRID_DEFAULTS As UInteger = 536903743
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace