RhinoCommon API
File3dmTypeCodes.TCODE_MARKUP_RECORD Field
(TCODE_TABLEREC | TCODE_CRC | 0x007D)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_MARKUP_RECORD = 536903805
Public Const TCODE_MARKUP_RECORD As UInteger = 536903805
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace