RhinoCommon API
SubDEdgeSharpness.Tolerance Field
 If a sharpness is within Tolerance of an integer value, it is snapped to that integer value. See Sanitize(Double).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public const double Tolerance = 0.01
Public Const Tolerance As Double = 0.01
Field Value
Type: Double
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace