RhinoCommon API
RhinoMath.DefaultDistanceToleranceMillimeters Field
 Get Rhino's default distance tolerance in millimeters.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const double DefaultDistanceToleranceMillimeters = 0.01
Public Const DefaultDistanceToleranceMillimeters As Double = 0.01
Field Value
Type: Double
Remarks
 This is equivalent to openNURBS ON_DEFAULT_DISTANCE_TOLERANCE_MM.
See Also
Reference
RhinoMath Class
Rhino Namespace