RhinoCommon API
File3dmTypeCodes.TCODE_SETTINGS_UNITSANDTOLS Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_UNITSANDTOLS"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SETTINGS_UNITSANDTOLS = 536903729
Public Const TCODE_SETTINGS_UNITSANDTOLS As UInteger = 536903729
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace