RhinoCommon API
File3dmTypeCodes.TCODE_VIEW_NAME Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_NAME"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW_NAME = 536906299
Public Const TCODE_VIEW_NAME As UInteger = 536906299
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace