RhinoCommon API
LengthUnit.Yards Field
1 yard = 0.9144 meters = 3 feet
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly LengthUnit Yards
Public Shared ReadOnly Yards As LengthUnit
Field Value
Type: LengthUnit
See Also
Reference
LengthUnit Structure
Rhino Namespace