RhinoCommon API
Light.ConstantAttenuationVector Field
 Vector denoting a constant light attenuation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly Vector3d ConstantAttenuationVector
Public Shared ReadOnly ConstantAttenuationVector As Vector3d
Field Value
Type: Vector3d
See Also
Reference
Light Class
Rhino.Geometry Namespace