RhinoCommon API
RhinoMath.UnsetValue Field
 Gets the Rhino standard Unset value. Use this value rather than Double.NaN when a bogus floating point value is required.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const double UnsetValue = -1.23432101234321E+308
Public Const UnsetValue As Double = -1.23432101234321E+308
Field Value
Type: Double
Remarks
 This is equivalent to openNURBS ON_UNSET_VALUE.
See Also
Reference
RhinoMath Class
Rhino Namespace