RhinoCommon API
File3dmTypeCodes.TCODE_MODEL_ATTRIBUTES_CHUNK Field
(TCODE_USER | TCODE_CRC | 0x0002)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_MODEL_ATTRIBUTES_CHUNK = 1073774594
Public Const TCODE_MODEL_ATTRIBUTES_CHUNK As UInteger = 1073774594
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace