RhinoCommon API
File3dmTypeCodes.TCODE_SECTION_STYLE_RECORD Field
(TCODE_TABLEREC | TCODE_CRC | 0x007C)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SECTION_STYLE_RECORD = 536903804
Public Const TCODE_SECTION_STYLE_RECORD As UInteger = 536903804
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace