RhinoCommon API
FileObjWriteOptions.AngleTolRadians Field
 If trim is TL_OBJ_FILE_TRIM_POLYLINE, angle_tol (in radians) controls the level of linearization on parameter space trimming curves.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public readonly double AngleTolRadians
Public ReadOnly AngleTolRadians As Double
Field Value
Type: Double
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace