RhinoCommon API
File3dmTypeCodes.TCODE_SETTINGS_RENDER_USERDATA Field
(TCODE_TABLEREC | TCODE_CRC | 0x0136)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SETTINGS_RENDER_USERDATA = 536903990
Public Const TCODE_SETTINGS_RENDER_USERDATA As UInteger = 536903990
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace