RhinoCommon API
Curve.SortedSegment.CurveId Field
 The id in the original input curve collection
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int CurveId
Public CurveId As Integer
Field Value
Type: Int32
See Also
Reference
Curve.SortedSegment Structure
Rhino.Geometry Namespace