RhinoCommon API
RenderMaterial.BasicMaterialParameterNames.FlamingoLibrary Field
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.FlamingoLibrary"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const string FlamingoLibrary = "flamingo-library"
Public Const FlamingoLibrary As String = "flamingo-library"
Field Value
Type: String
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace