RhinoCommon API
PostEffectChannel.m_cpp Field
[Missing <summary> documentation for "F:Rhino.Render.PostEffects.PostEffectChannel.m_cpp"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected IntPtr m_cpp
Protected m_cpp As IntPtr
Field Value
Type: IntPtr
See Also
Reference
PostEffectChannel Class
Rhino.Render.PostEffects Namespace