RhinoCommon API
LengthUnit.Millimeters Field
1 millimeter = 1.0e-3 meters
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly LengthUnit Millimeters
Public Shared ReadOnly Millimeters As LengthUnit
Field Value
Type: LengthUnit
See Also
Reference
LengthUnit Structure
Rhino Namespace