RhinoCommon API
File3dmTypeCodes.TCODE_LAYER_RECORD Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYER_RECORD"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LAYER_RECORD = 536903760
Public Const TCODE_LAYER_RECORD As UInteger = 536903760
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace