RhinoCommon API
Brep.CurveConstraint.Continuity Field
 The constraint continuity
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Continuity Continuity
Public Continuity As Continuity
Field Value
Type: Continuity
See Also
Reference
Brep.CurveConstraint Class
Rhino.Geometry Namespace