RhinoCommon API
File3dmTypeCodes.TCODE_ANALYSIS_MESH Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_ANALYSIS_MESH"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_ANALYSIS_MESH = 1048600
Public Const TCODE_ANALYSIS_MESH As UInteger = 1048600
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace