RhinoCommon API
FileObjWriteOptions.WriteOptions Field
[Missing <summary> documentation for "F:Rhino.FileIO.FileObjWriteOptions.WriteOptions"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileWriteOptions WriteOptions
Public WriteOptions As FileWriteOptions
Field Value
Type: FileWriteOptions
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace