RhinoCommon API
RhinoMath.TwoPI Field
 Full rotation. 360 degrees. 6.28...
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const double TwoPI = 6.28318530717959
Public Const TwoPI As Double = 6.28318530717959
Field Value
Type: Double
See Also
Reference
RhinoMath Class
Rhino Namespace