RhinoCommon API
LengthUnit.Meters Field
SI meter length unit
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly LengthUnit Meters
Public Shared ReadOnly Meters As LengthUnit
Field Value
Type: LengthUnit
See Also
Reference
LengthUnit Structure
Rhino Namespace