RhinoCommon API
File3dmTypeCodes.TCODE_VIEWPORT_WALLPAPER Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEWPORT_WALLPAPER"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEWPORT_WALLPAPER = 33554450
Public Const TCODE_VIEWPORT_WALLPAPER As UInteger = 33554450
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace