RhinoCommon API
NotificationCenter.Notifications Field
 A set containing all the Notification instances. Any Notification added will be displayed in the Notifications panel. Any Notification removed will be removed from the Notifications panel, and, if shown modally or queued to be shown modally, will be closed or dequeued from the modal queue.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly TrulyObservableOrderedSet<Notification> Notifications
Public Shared ReadOnly Notifications As TrulyObservableOrderedSet(Of Notification)
Field Value
Type: TrulyObservableOrderedSet<Notification>
See Also
Reference
NotificationCenter Class
Rhino.Runtime.Notifications Namespace