RhinoCommon API
LengthUnit.Inches Field
1 inch = 0.0254 meters = 1/12 foot
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly LengthUnit Inches
Public Shared ReadOnly Inches As LengthUnit
Field Value
Type: LengthUnit
See Also
Reference
LengthUnit Structure
Rhino Namespace