RhinoCommon API
File3dmTypeCodes.TCODE_LEGACY_TOL_FIT Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_TOL_FIT"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LEGACY_TOL_FIT = 134217729
Public Const TCODE_LEGACY_TOL_FIT As UInteger = 134217729
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace