RhinoCommon API
NotificationCenter Fields
The NotificationCenter type exposes the following members.
Fields
Name | Description
Notifications
 A set containing all the Notification instances. Any Notification added will be displayed in the Notifications panel. Any Notification removed will be removed from the Notifications panel, and, if shown modally or queued to be shown modally, will be closed or dequeued from the modal queue.
Top
See Also
Reference
NotificationCenter Class
Rhino.Runtime.Notifications Namespace