RhinoCommon API
BasicMaterialParameterNames Fields
The RenderMaterial.BasicMaterialParameterNames type exposes the following members.
Fields
Name | Description
Ambient
Diffuse
DisableLighting
Emission
FlamingoLibrary
Ior
Reflectivity
ReflectivityColor
Shine
Specular
Transparency
TransparencyColor
Top
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace