RhinoCommon API
Light Fields
The Light type exposes the following members.
Fields
Name | Description
ConstantAttenuationVector
 Vector denoting a constant light attenuation.
InverseSquaredAttenuationVector
 Vector denoting an inverse squared light attenuation.
LinearAttenuationVector
 Vector denoting a linear light attenuation.
Top
See Also
Reference
Light Class
Rhino.Geometry Namespace