RhinoCommon API
RenderMeshProvider Fields
The RenderMeshProvider type exposes the following members.
Fields
Name | Description
m_disposed
 m_disposed available for sub-classes to check.
Top
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace