RhinoCommon API
PostEffectChannel Fields
The PostEffectChannel type exposes the following members.
Fields
Name | Description
m_cpp
Top
See Also
Reference
PostEffectChannel Class
Rhino.Render.PostEffects Namespace