RhinoCommon API
LengthUnit Fields
The LengthUnit type exposes the following members.
Fields
Name | Description
Centimeters
1 millimeter = 1.0e-2 meters
Feet
1 foot = 0.3048 meters = 12 inches
Inches
1 inch = 0.0254 meters = 1/12 foot
Kilometers
1 kilometer = 1.0e+3 meters
Meters
SI meter length unit
Miles
1 yard = 1609.344 meters = 5280 feet
Millimeters
1 millimeter = 1.0e-3 meters
None
No unit
Unset
Unset unit
Yards
1 yard = 0.9144 meters = 3 feet
Top
See Also
Reference
LengthUnit Structure
Rhino Namespace