RhinoCommon API
FileObjReadOptions Fields
The FileObjReadOptions type exposes the following members.
Fields
Name | Description
ReadOptions
 Rhino's FileReadOptions passed into ReadFile
Top
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace