RhinoCommon API
RhDisplayPoint Fields
The RhDisplayPoint type exposes the following members.
Fields
Name | Description
m__padding1
m__padding2
m_diameterPixels
m_fillColor
m_innerDiameterPixels
m_rotationRadians
m_strokeColor
m_strokeWidthPixels
m_style
m_vertex
Top
See Also
Reference
RhDisplayPoint Structure
Rhino.Runtime.InteropWrappers Namespace