RhinoCommon API
CurveConstraint Fields
The Brep.CurveConstraint type exposes the following members.
Fields
Name | Description
Continuity
 The constraint continuity
Top
See Also
Reference
Brep.CurveConstraint Class
Rhino.Geometry Namespace