RhinoCommon API
TexturedValue<T> Fields
The TexturedValue<T> generic type exposes the following members.
Fields
Name | Description
Amount
Name
On
Texture
Value
Top
See Also
Reference
TexturedValue<T> Class
Rhino.Render Namespace