RhinoCommon API
SubDEdgeSharpness Fields
The SubDEdgeSharpness type exposes the following members.
Fields
Name | Description
CreaseValue
 The value used to indicate that an edge is a crease, MaximumValue + 1.0. This is deliberately not a valid sharpness value: a crease edge is not a sharp edge. It exists because it is often convenient to use a single value to describe both.
MaximumValue
 The largest valid sharpness value, 4.0. Valid SubD edge sharpness values are between 0.0 and MaximumValue.
SmoothValue
 The sharpness value of a smooth edge, 0.0.
Tolerance
 If a sharpness is within Tolerance of an integer value, it is snapped to that integer value. See Sanitize(Double).
Top
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace