RhinoCommon API
FilePlyWriteOptions Fields
The FilePlyWriteOptions type exposes the following members.
Fields
Name | Description
WriteOptions
Top
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace