RhinoCommon API
MeshPointDataStruct Fields
The MeshPointDataStruct type exposes the following members.
Fields
Name | Description
m_ci_index
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
m_ci_type
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
m_edge_index
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
m_et
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
m_face_index
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
m_Px
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
m_Py
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
m_Pz
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
m_t0
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
m_t1
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
m_t2
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
m_t3
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
m_Triangle
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
Top
See Also
Reference
MeshPointDataStruct Structure
Rhino.Runtime.InteropWrappers Namespace