RhinoCommon API
DracoCompressionOptions Fields
The DracoCompressionOptions type exposes the following members.
Fields
Name | Description
IncludeNormals
 Include vertex normals in the compressed data.
IncludeTextureCoordinates
 Include texture coordinates in the compressed data.
IncludeVertexColors
 Include vertex colors in the compressed data.
VertexColorFormat
 Color format of vertex colors in compressed data
Top
See Also
Reference
DracoCompressionOptions Class
Rhino.FileIO Namespace