RhinoCommon API
RhinoMath Fields
The RhinoMath type exposes the following members.
Fields
Name | Description
DefaultAngleTolerance
 Represents the default angle tolerance, used when no other values are provided.
This is one degree, expressed in radians.
DefaultDistanceToleranceMillimeters
 Get Rhino's default distance tolerance in millimeters.
Epsilon
 Gets the value of DBL_EPSILON, which is the smallest positive floating point number x such that 1 + x != 1. This is different than Double.Epsilon which is the smallest positive Double value that is greater than zero.
HalfPI
 Quarter of a rotation. 90 degrees. 1.57...
InfiniteRadius
 Value used to indicate a radius of curvature is infinite.
QuarterPI
 One eigth of a rotation. 45 degrees. 0.78...
SqrtEpsilon
 Represents a default value that is used when comparing square roots.
This value is several orders of magnitude larger than ZeroTolerance.
Tau
 Ratio of circumference divided by radius. Full rotation. 360 degrees. 6.28...
TwoPI
 Full rotation. 360 degrees. 6.28...
UnsetIntIndex
 When signed int values are used in a context where 0 and small negative values are valid indices and there needs to be a value that indicates the index is not set.
UnsetSingle
 Gets the single precision floating point number that is considered 'unset' in Rhino.
UnsetValue
 Gets the Rhino standard Unset value. Use this value rather than Double.NaN when a bogus floating point value is required.
ZeroTolerance
 Gets Rhino's Zero Tolerance constant, which is 2^-32. In cases when an absolute "zero" tolerance is required to compare model space coordinates, ZeroTolerance is used. The value of ZeroTolerance should be no smaller than Epsilon and should be several orders of magnitude smaller than SqrtEpsilon.
Top
See Also
Reference
RhinoMath Class
Rhino Namespace