RhinoCommon API
SortedSegment Fields
The Curve.SortedSegment type exposes the following members.
Fields
Name | Description
CurveId
 The id in the original input curve collection
Reversed
 Indicates if the curve is to be reversed
Top
See Also
Reference
Curve.SortedSegment Structure
Rhino.Geometry Namespace