RhinoCommon API
FileObjWriteOptions Fields
The FileObjWriteOptions type exposes the following members.
Fields
Name | Description
AngleTolRadians
 If trim is TL_OBJ_FILE_TRIM_POLYLINE, angle_tol (in radians) controls the level of linearization on parameter space trimming curves.
WriteOptions
Top
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace