RhinoCommon API
Transform.Rotation Method (Double, Point3d)
 Constructs a new rotation transformation with specified angle and rotation center. The axis of rotation is ZAxis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Transform Rotation(
	double angleRadians,
	Point3d rotationCenter
)
Public Shared Function Rotation (
	angleRadians As Double,
	rotationCenter As Point3d
) As Transform
Parameters
angleRadians
Type: System.Double
Rotation angle in radians.
rotationCenter
Type: Rhino.Geometry.Point3d
3D center of rotation.
Return Value
Type: Transform
A rotation transformation matrix.
See Also
Reference
Transform Structure
Rotation Overload
Rhino.Geometry Namespace