RhinoCommon API
DigitizerPlugIn.SendRay Method
 If the digitizer is enabled, call this function to send a point and direction to Rhino. Call this function as much as you like. The digitizers that Rhino currently supports send a point every 15 milliseconds or so. This function should be called when users press or release any digitizer button.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SendRay(
	Ray3d ray,
	MouseButton mousebuttons,
	bool shiftKey,
	bool controlKey
)
Public Sub SendRay (
	ray As Ray3d,
	mousebuttons As MouseButton,
	shiftKey As Boolean,
	controlKey As Boolean
)
Parameters
ray
Type: Rhino.Geometry.Ray3d
3d ray in digitizer coordinates.
mousebuttons
Type: Rhino.UI.MouseButton
corresponding digitizer button is down.
shiftKey
Type: System.Boolean
true if the Shift keyboard key was pressed. Otherwise, false.
controlKey
Type: System.Boolean
true if the Control keyboard key was pressed. Otherwise, false.
See Also
Reference
DigitizerPlugIn Class
Rhino.PlugIns Namespace