RhinoCommon API
Mesh.CreateFromSurface Method (Surface, MeshingParameters)
 Constructs a mesh from a surface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public static Mesh CreateFromSurface(
	Surface surface,
	MeshingParameters meshingParameters
)
Public Shared Function CreateFromSurface (
	surface As Surface,
	meshingParameters As MeshingParameters
) As Mesh
Parameters
surface
Type: Rhino.Geometry.Surface
Surface to approximate
meshingParameters
Type: Rhino.Geometry.MeshingParameters
settings used to create the mesh
Return Value
Type: Mesh
New mesh representing the surface
See Also
Reference
Mesh Class
CreateFromSurface Overload
Rhino.Geometry Namespace