RhinoCommon API
RenderContentCollection Constructor (IntPtr)
 Internal function to create collection from native pointer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderContentCollection(
	IntPtr nativePtr
)
Public Sub New (
	nativePtr As IntPtr
)
Parameters
nativePtr
Type: System.IntPtr
Native pointer
See Also
Reference
RenderContentCollection Class
RenderContentCollection Overload
Rhino.Render Namespace