RhinoCommon API
PreviewJobSignature Constructor (IntPtr)
 Preview Job Signature constructor
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public PreviewJobSignature(
	IntPtr intPtr
)
Public Sub New (
	intPtr As IntPtr
)
Parameters
intPtr
Type: System.IntPtr
[Missing <param name="intPtr"/> documentation for "M:Rhino.Render.PreviewJobSignature.#ctor(System.IntPtr)"]
See Also
Reference
PreviewJobSignature Class
PreviewJobSignature Overload
Rhino.Render Namespace