RhinoCommon API
MeshCageMorph.Dispose Method
Actively reclaims unmanaged resources that this instance uses
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
MeshCageMorph Class
Dispose Overload
Rhino.Geometry.Morphs Namespace