RhinoCommon API
RenderSettings.RenderEnvironment Method
 Get the render environment for a particular usage. Only works if this render settings is in a document. If usage is Background and the background mode is set to 'Solid Color' or 'Gradient' (i.e., not 'Environment'), then null will be returned.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RenderEnvironment RenderEnvironment(
	RenderSettings.EnvironmentUsage usage,
	RenderSettings.EnvironmentPurpose purpose
)
Public Function RenderEnvironment (
	usage As RenderSettings.EnvironmentUsage,
	purpose As RenderSettings.EnvironmentPurpose
) As RenderEnvironment
Parameters
usage
Type: Rhino.Render.RenderSettings.EnvironmentUsage
[Missing <param name="usage"/> documentation for "M:Rhino.Render.RenderSettings.RenderEnvironment(Rhino.Render.RenderSettings.EnvironmentUsage,Rhino.Render.RenderSettings.EnvironmentPurpose)"]
purpose
Type: Rhino.Render.RenderSettings.EnvironmentPurpose
[Missing <param name="purpose"/> documentation for "M:Rhino.Render.RenderSettings.RenderEnvironment(Rhino.Render.RenderSettings.EnvironmentUsage,Rhino.Render.RenderSettings.EnvironmentPurpose)"]
Return Value
Type: RenderEnvironment
[Missing <returns> documentation for "M:Rhino.Render.RenderSettings.RenderEnvironment(Rhino.Render.RenderSettings.EnvironmentUsage,Rhino.Render.RenderSettings.EnvironmentPurpose)"]
See Also
Reference
RenderSettings Class
Rhino.Render Namespace