RhinoCommon API
Unroller.AddFollowingGeometry Method (IEnumerable<TextDot>)
 Adds text dots that should be unrolled along with the surface/brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void AddFollowingGeometry(
	IEnumerable<TextDot> dots
)
Public Sub AddFollowingGeometry (
	dots As IEnumerable(Of TextDot)
)
Parameters
dots
Type: System.Collections.Generic.IEnumerable<TextDot>
An array, a list or any enumerable set of text dots.
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace