RhinoCommon API
PhysicallyBasedMaterial.GetTexture Method
 Get the texture that corresponds with the specified texture type for this material.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Texture GetTexture(
	TextureType which
)
Public Function GetTexture (
	which As TextureType
) As Texture
Parameters
which
Type: Rhino.DocObjects.TextureType
[Missing <param name="which"/> documentation for "M:Rhino.DocObjects.PhysicallyBasedMaterial.GetTexture(Rhino.DocObjects.TextureType)"]
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.DocObjects.PhysicallyBasedMaterial.GetTexture(Rhino.DocObjects.TextureType)"]
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace