RhinoCommon API
RhinoApp.Exit Method
Exits, or closes, Rhino.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void Exit()
Public Shared Sub Exit
See Also
Reference
RhinoApp Class
Exit Overload
Rhino Namespace