RhinoCommon API
NamedParametersEventArgs.Set Method (String, Point3d[])
 Set a point array for the specified key
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Set(
	string name,
	Point3d[] pts
)
Public Sub Set (
	name As String,
	pts As Point3d()
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.Point3d[])"]
pts
Type: Rhino.Geometry.Point3d[]
[Missing <param name="pts"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.Point3d[])"]
See Also
Reference
NamedParametersEventArgs Class
Set Overload
Rhino.Runtime Namespace