RhinoCommon API
LocalizedStringHandler Constructor
Initializes a new instance of the LocalizedStringHandler class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public LocalizedStringHandler(
	int literalLength,
	int formattedCount
)
Public Sub New (
	literalLength As Integer,
	formattedCount As Integer
)
Parameters
literalLength
Type: System.Int32
[Missing <param name="literalLength"/> documentation for "M:Rhino.UI.LocalizedStringHandler.#ctor(System.Int32,System.Int32)"]
formattedCount
Type: System.Int32
[Missing <param name="formattedCount"/> documentation for "M:Rhino.UI.LocalizedStringHandler.#ctor(System.Int32,System.Int32)"]
See Also
Reference
LocalizedStringHandler Structure
Rhino.UI Namespace