RhinoCommon API
RhinoDoc.HasCustomRenderMeshes Method
 Returns true if the document has a set of custom render primitives - ie, CustomRenderMeshes will return non-null.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool HasCustomRenderMeshes(
	MeshType mt,
	ViewportInfo vp,
	ref RenderMeshProvider.Flags flags,
	PlugIn plugin,
	DisplayPipelineAttributes attrs
)
Public Function HasCustomRenderMeshes (
	mt As MeshType,
	vp As ViewportInfo,
	ByRef flags As RenderMeshProvider.Flags,
	plugin As PlugIn,
	attrs As DisplayPipelineAttributes
) As Boolean
Parameters
mt
Type: Rhino.Geometry.MeshType
The mesh type requested (render or analysis).
vp
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
flags
Type: Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags
See RenderMeshProvider.Flags. This is an in/out parameter: on return it also carries any status flags - including Incomplete when an asynchronous provider has not finished - so reset it before each call and test it afterwards.
plugin
Type: Rhino.PlugIns.PlugIn
The requesting plug-in (typically the calling plugin)
attrs
Type: Rhino.Display.DisplayPipelineAttributes
Display attributes for the caller - null if this is a full rendering.
Return Value
Type: Boolean
Returns true if the object will has a set of custom render primitives
See Also
Reference
RhinoDoc Class
Rhino Namespace
RhinoDoc.RenderMeshes(MeshType, ViewportInfo, RenderMeshProvider.Flags, PlugIn, DisplayPipelineAttributes)