RhinoCommon API
NurbsSurface.ConvertSpanToBezier Method
 Convert a NURBS surface bispan into a Bezier surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public BezierSurface ConvertSpanToBezier(
	int spanIndex0,
	int spanIndex1
)
Public Function ConvertSpanToBezier (
	spanIndex0 As Integer,
	spanIndex1 As Integer
) As BezierSurface
Parameters
spanIndex0
Type: System.Int32
Specifies the "u" span
spanIndex1
Type: System.Int32
Specifies the "v" span
Return Value
Type: BezierSurface
Bezier surface on success
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace