RhinoCommon API
ObjectTable.Replace Method (ObjRef, Extrusion)
Replaces one object with new extrusion object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Replace(
	ObjRef objref,
	Extrusion extrusion
)
Public Function Replace (
	objref As ObjRef,
	extrusion As Extrusion
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
reference to old object to be replaced. The objref.Object() will be deleted.
extrusion
Type: Rhino.Geometry.Extrusion
New extrusion to be added. A duplicate of the extrusion is added to the Rhino model.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace