RhinoCommon API
ViewCaptureWriter.PushClipPath Method (RectangleF)
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.PushClipPath(System.Drawing.RectangleF)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected void PushClipPath(
	RectangleF rect
)
Protected Sub PushClipPath (
	rect As RectangleF
)
Parameters
rect
Type: System.Drawing.RectangleF
[Missing <param name="rect"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.PushClipPath(System.Drawing.RectangleF)"]
See Also
Reference
ViewCaptureWriter Class
PushClipPath Overload
Rhino.Runtime Namespace