RhinoCommon API
ArchivableDictionary.Set Method (String, SizeF)
 Sets a SizeF.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Set(
	string key,
	SizeF val
)
Public Function Set (
	key As String,
	val As SizeF
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: System.Drawing.SizeF
A value for that key.
Because SizeF has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,System.Drawing.SizeF)"]
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace