RhinoCommon API
Brep.CreateTrimmedPlane Method (Plane, Curve)
 Create a Brep trimmed plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep CreateTrimmedPlane(
	Plane plane,
	Curve curve
)
Public Shared Function CreateTrimmedPlane (
	plane As Plane,
	curve As Curve
) As Brep
Parameters
plane
Type: Rhino.Geometry.Plane
Plane that will be trimmed.
curve
Type: Rhino.Geometry.Curve
A simple (no self intersections) closed curve that defines the outer boundary of the trimmed plane.
Return Value
Type: Brep
Resulting brep or null on failure.
See Also
Reference
Brep Class
CreateTrimmedPlane Overload
Rhino.Geometry Namespace