RhinoCommon API
OptionDouble.Finalize Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.OptionDouble.Finalize"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
OptionDouble Class
Rhino.Input.Custom Namespace