RhinoCommon API
DisplayPipeline.DrawEmapPreview Method (Brep, Color, EmapAnalysisSettingsState)
 Draws a Brep in Environment Map preview with a texture of your own, instead of the one in EmapAnalysisSettings.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void DrawEmapPreview(
	Brep brep,
	Color color,
	EmapAnalysisSettingsState settings
)
Public Sub DrawEmapPreview (
	brep As Brep,
	color As Color,
	settings As EmapAnalysisSettingsState
)
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to draw.
color
Type: System.Drawing.Color
Object color.
settings
Type: Rhino.ApplicationSettings.EmapAnalysisSettingsState
 Settings for this call only. Get a copy of the current ones from GetCurrentState() and change what you need. A null or empty FileName keeps the texture the application settings name.
See Also
Reference
DisplayPipeline Class
DrawEmapPreview Overload
Rhino.Display Namespace