RhinoCommon API
ObjectTable.Replace Method (Guid, PointCloud)
 Replaces one object with new point cloud object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Replace(
	Guid objectId,
	PointCloud pointcloud
)
Public Function Replace (
	objectId As Guid,
	pointcloud As PointCloud
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
pointcloud
Type: Rhino.Geometry.PointCloud
 new point cloud to be added A duplicate of the point cloud is added to the Rhino model.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace