RhinoCommon API
RenderContentKindList.SingleKind Method
 The single kind in the list. If the list does not contain exactly one kind, returns 'None'.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public RenderContentKind SingleKind()
Public Function SingleKind As RenderContentKind
Return Value
Type: RenderContentKind
A RenderContentKind
See Also
Reference
RenderContentKindList Class
Rhino.Render Namespace