RhinoCommon API
RhinoHelp.Show Method
 Call this method to display standard Rhino help
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool Show(
	string helpLink
)
Public Shared Function Show (
	helpLink As String
) As Boolean
Parameters
helpLink
Type: System.String
 Rhino help links are formatted like this: http://docs.mcneel.com/rhino/6/help/en-us/index.htm#commands/line.htm This parameter would be equal to "#commands/line.htm" in the link above. Rhino will calculate the string up to and including the index.html and append this value to the end.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.RhinoHelp.Show(System.String)"]
See Also
Reference
RhinoHelp Class
Rhino.UI Namespace