RhinoCommon API
LocalizedStringHandler.AppendFormatted<T> Method (T)
[Missing <summary> documentation for "M:Rhino.UI.LocalizedStringHandler.AppendFormatted``1(``0)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void AppendFormatted<T>(
	T value
)
Public Sub AppendFormatted(Of T) (
	value As T
)
Parameters
value
Type: T
[Missing <param name="value"/> documentation for "M:Rhino.UI.LocalizedStringHandler.AppendFormatted``1(``0)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.UI.LocalizedStringHandler.AppendFormatted``1(``0)"]
See Also
Reference
LocalizedStringHandler Structure
AppendFormatted Overload
Rhino.UI Namespace