RhinoCommon API
RhinoApp.RunScript Method (String, String, Boolean)
Runs a Rhino command script.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool RunScript(
	string script,
	string mruDisplayString,
	bool echo
)
Public Shared Function RunScript (
	script As String,
	mruDisplayString As String,
	echo As Boolean
) As Boolean
Parameters
script
Type: System.String
[in] script to run.
mruDisplayString
Type: System.String
[in] String to display in the most recent command list.
echo
Type: System.Boolean
 Controls how the script is echoed in the command output window. false = silent - nothing is echoed. true = verbatim - the script is echoed literally.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoApp.RunScript(System.String,System.String,System.Boolean)"]
Exceptions
Exception | Condition
ApplicationException |  If RunScript is being called while inside an event watcher.
Remarks
 Rhino acts as if each character in the script string had been typed in the command prompt. When RunScript is called from a "script runner" command, it completely runs the script before returning. When RunScript is called outside of a command, it returns and the script is run. This way menus and buttons can use RunScript to execute complicated functions.
See Also
Reference
RhinoApp Class
RunScript Overload
Rhino Namespace