RhinoCommon API
Decal.SetVertSweep Method
 Sets the angles of the decal's arc of 'vertical sweep'.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetVertSweep(
	double sta,
	double end
)
Public Sub SetVertSweep (
	sta As Double,
	end As Double
)
Parameters
sta
Type: System.Double
[Missing <param name="sta"/> documentation for "M:Rhino.Render.Decal.SetVertSweep(System.Double,System.Double)"]
end
Type: System.Double
[Missing <param name="end"/> documentation for "M:Rhino.Render.Decal.SetVertSweep(System.Double,System.Double)"]
See Also
Reference
Decal Class
Rhino.Render Namespace