RhinoCommon API
PersistentSettings.TryGetGuid Method (String, Guid, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetGuid(System.String,System.Guid@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetGuid(
	string key,
	out Guid value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetGuid (
	key As String,
	<OutAttribute> ByRef value As Guid,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetGuid(System.String,System.Guid@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: System.Guid
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetGuid(System.String,System.Guid@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetGuid(System.String,System.Guid@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetGuid(System.String,System.Guid@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetGuid Overload
Rhino Namespace