RhinoCommon API
Group.GetUserString Method
 Gets user string from this geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public string GetUserString(
	string key
)
Public Function GetUserString (
	key As String
) As String
Parameters
key
Type: System.String
id used to retrieve the string.
Return Value
Type: String
string associated with the key if successful. null if no key was found.
See Also
Reference
Group Class
Rhino.DocObjects Namespace