RhinoCommon API
SnapShotsClient.IsCurrentModelStateInAnySnapshot Method (RhinoDoc, RhinoObject, BinaryArchiveReader, SimpleArrayBinaryArchiveReader, TextLog)
 Called before restoring a snapshot. Warns the user if the current model state is not already saved.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool IsCurrentModelStateInAnySnapshot(
	RhinoDoc doc,
	RhinoObject doc_object,
	BinaryArchiveReader archive,
	SimpleArrayBinaryArchiveReader archive_array,
	TextLog text_log = null
)
Public MustOverride Function IsCurrentModelStateInAnySnapshot (
	doc As RhinoDoc,
	doc_object As RhinoObject,
	archive As BinaryArchiveReader,
	archive_array As SimpleArrayBinaryArchiveReader,
	Optional text_log As TextLog = Nothing
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
doc is the current document.
doc_object
Type: Rhino.DocObjects.RhinoObject
doc_object is the current object.
archive
Type: Rhino.FileIO.BinaryArchiveReader
archive is the current state of the model.
archive_array
Type: Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader
archive_array is a list of client data.
text_log (Optional)
Type: Rhino.FileIO.TextLog
text_log is used to list the missing items that cannot be found in the current model.
Return Value
Type: Boolean
return true if successful, otherwise false.
See Also
Reference
SnapShotsClient Class
IsCurrentModelStateInAnySnapshot Overload
Rhino.DocObjects.SnapShots Namespace