RhinoCommon API
LightArray Constructor (IntPtr)
Initializes a new instance of the LightArray class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LightArray(
	IntPtr pLightArray
)
Public Sub New (
	pLightArray As IntPtr
)
Parameters
pLightArray
Type: System.IntPtr
[Missing <param name="pLightArray"/> documentation for "M:Rhino.Render.LightArray.#ctor(System.IntPtr)"]
See Also
Reference
LightArray Class
LightArray Overload
Rhino.Render Namespace