RhinoCommon API
Quaternion.GetEulerZYZ Method
 Find the Euler angles for a rotation transformation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool GetEulerZYZ(
	out double alpha,
	out double beta,
	out double gamma
)
Public Function GetEulerZYZ (
	<OutAttribute> ByRef alpha As Double,
	<OutAttribute> ByRef beta As Double,
	<OutAttribute> ByRef gamma As Double
) As Boolean
Parameters
alpha
Type: System.Double
Angle, in radians, to rotate about the ZAxis.
beta
Type: System.Double
Angle, in radians, to rotate about the YAxis.
gamma
Type: System.Double
Angle, in radians, to rotate about the ZAxis.
Return Value
Type: Boolean
true if successful, or false if this is not a rotation.
Remarks
 When true, this = RotationZYZ(alpha, beta, gamma) = R_z(alpha) * R_y(beta) * R_z(gamma), where R_*(angle) is rotation of angle radians about the corresponding *-world coordinate axis. alpha and gamma are in the range (-pi, pi], while beta in the range [0, pi].
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace