RhinoCommon API
RhinoSettings.SetCurrentRenderer Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RhinoSettings.SetCurrentRenderer(System.Guid)"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.17
Syntax
public void SetCurrentRenderer(
	Guid g
)
Public Sub SetCurrentRenderer (
	g As Guid
)
Parameters
g
Type: System.Guid
[Missing <param name="g"/> documentation for "M:Rhino.Render.DataSources.RhinoSettings.SetCurrentRenderer(System.Guid)"]
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace