RhinoCommon API
PlugIn.LoadComputeExtensionPlugins Method
 Used by compute's startup code to load plug-ins that have registered custom endpoints
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static void LoadComputeExtensionPlugins()
Public Shared Sub LoadComputeExtensionPlugins
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace