RhinoCommon API
File3dm.WriteWithLog Method (String, Int32, String)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool WriteWithLog(
	string path,
	int version,
	out string errorLog
)
Public Function WriteWithLog (
	path As String,
	version As Integer,
	<OutAttribute> ByRef errorLog As String
) As Boolean
Parameters
path
Type: System.String
The file name to use for writing.
version
Type: System.Int32
 Version of the openNURBS archive to write. Must be [2; current version]. Rhino can read its current version, plus earlier file versions except 1. Use latest version when possible.
Alternatively, 0 is a placeholder for the last valid version.
errorLog
Type: System.String
This argument will be filled by out reference.
Return Value
Type: Boolean
 true if archive is written with no error. false if errors occur.
See Also
Reference
File3dm Class
WriteWithLog Overload
Rhino.FileIO Namespace