RhinoCommon API
TextureEvaluator.WriteToByteArray2 Method
 Fast access to bitmap evaluator - supply size (which you will probably have received from CRhRdkTexture::PixelSize) to see if the data can be extracted direct to a width*height*4 array of unsigned chars.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public virtual StdVectorByte WriteToByteArray2(
	int width,
	int height
)
Public Overridable Function WriteToByteArray2 (
	width As Integer,
	height As Integer
) As StdVectorByte
Parameters
width
Type: System.Int32
is the point for which to evaluate the texture.
height
Type: System.Int32
duvwdx is a ray differential.
Return Value
Type: StdVectorByte
A ByteArray full of the byte values in RGBA order, or null if the function did not succeed
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace