RhinoCommon API
DisplayPen.FromLinetype Method (Linetype, Color)
 Create a display pen that matches a linetype definition on any viewport.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static DisplayPen FromLinetype(
	Linetype linetype,
	Color color
)
Public Shared Function FromLinetype (
	linetype As Linetype,
	color As Color
) As DisplayPen
Parameters
linetype
Type: Rhino.DocObjects.Linetype
[Missing <param name="linetype"/> documentation for "M:Rhino.Display.DisplayPen.FromLinetype(Rhino.DocObjects.Linetype,System.Drawing.Color)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPen.FromLinetype(Rhino.DocObjects.Linetype,System.Drawing.Color)"]
Return Value
Type: DisplayPen
[Missing <returns> documentation for "M:Rhino.Display.DisplayPen.FromLinetype(Rhino.DocObjects.Linetype,System.Drawing.Color)"]
See Also
Reference
DisplayPen Class
FromLinetype Overload
Rhino.Display Namespace