RhinoCommon API
Brep.JoinBreps Method (IEnumerable<Brep>, Double, Double, List<Int32[]>)
 Joins the breps in the input array at any overlapping edges to form as few as possible resulting breps. There may be more than one brep in the result array.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public static Brep[] JoinBreps(
	IEnumerable<Brep> brepsToJoin,
	double tolerance,
	double angleTolerance,
	out List<int[]> indexMap
)
Public Shared Function JoinBreps (
	brepsToJoin As IEnumerable(Of Brep),
	tolerance As Double,
	angleTolerance As Double,
	<OutAttribute> ByRef indexMap As List(Of Integer())
) As Brep()
Parameters
brepsToJoin
Type: System.Collections.Generic.IEnumerable<Brep>
A list, an array or any enumerable set of breps to join.
tolerance
Type: System.Double
 3d distance tolerance for detecting overlapping edges. When in doubt, use the document's model absolute tolerance.
angleTolerance
Type: System.Double
 Angle tolerance, in radians, used for merging edges. When in doubt, use the document's model angle tolerance.
indexMap
Type: System.Collections.Generic.List<Int32[]>
 List of integer arrays, one for each joined result, containing all input Brep indices that went into making each result. Note, this can be null.
Return Value
Type: Brep[]
New joined breps on success, null on failure.
See Also
Reference
Brep Class
JoinBreps Overload
Rhino.Geometry Namespace