RhinoCommon API
RdkSelectionNavigator.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RdkSelectionNavigator.Finalize"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace