RhinoCommon API
RenderSettings.SetRenderEnvironmentId Method
 Set the id of the render environment for a particular usage. Passing Guid.Empty for usage Skylighting or Reflection will turn the override for that usage off.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetRenderEnvironmentId(
	RenderSettings.EnvironmentUsage usage,
	Guid guid
)
Public Sub SetRenderEnvironmentId (
	usage As RenderSettings.EnvironmentUsage,
	guid As Guid
)
Parameters
usage
Type: Rhino.Render.RenderSettings.EnvironmentUsage
[Missing <param name="usage"/> documentation for "M:Rhino.Render.RenderSettings.SetRenderEnvironmentId(Rhino.Render.RenderSettings.EnvironmentUsage,System.Guid)"]
guid
Type: System.Guid
[Missing <param name="guid"/> documentation for "M:Rhino.Render.RenderSettings.SetRenderEnvironmentId(Rhino.Render.RenderSettings.EnvironmentUsage,System.Guid)"]
See Also
Reference
RenderSettings Class
Rhino.Render Namespace