RhinoCommon API
MetaData.ContentInstanceId Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.MetaData.ContentInstanceId"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public Guid ContentInstanceId()
Public Function ContentInstanceId As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.DataSources.MetaData.ContentInstanceId"]
See Also
Reference
MetaData Class
Rhino.Render.DataSources Namespace