RhinoCommon API
Interop.NativeRhinoDocPointer Method
 Gets the C++ CRhinoDoc* for a given RhinoCommon RhinoDoc class.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static IntPtr NativeRhinoDocPointer(
	RhinoDoc doc
)
Public Shared Function NativeRhinoDocPointer (
	doc As RhinoDoc
) As IntPtr
Parameters
doc
Type: Rhino.RhinoDoc
A document.
Return Value
Type: IntPtr
A pointer value.
See Also
Reference
Interop Class
Rhino.Runtime Namespace