RhinoCommon API
File3dmRenderMaterials Constructor
Initializes a new instance of the File3dmRenderMaterials class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmRenderMaterials(
	File3dm f
)
Public Sub New (
	f As File3dm
)
Parameters
f
Type: Rhino.FileIO.File3dm
[Missing <param name="f"/> documentation for "M:Rhino.FileIO.File3dmRenderMaterials.#ctor(Rhino.FileIO.File3dm)"]
See Also
Reference
File3dmRenderMaterials Class
Rhino.FileIO Namespace