RhinoCommon API
Layer.PerViewportPersistentVisibility Method
 Gets the per layer persistent visibility. The persistent viability setting is used for layers whose visibility can be changed by a parent layer. In this case, when a parent layer is turned off, then child layers are also turned off. The persistent visibility setting determines what happens when the parent is turned on again.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool PerViewportPersistentVisibility(
	Guid viewportId
)
Public Function PerViewportPersistentVisibility (
	viewportId As Guid
) As Boolean
Parameters
viewportId
Type: System.Guid
[Missing <param name="viewportId"/> documentation for "M:Rhino.DocObjects.Layer.PerViewportPersistentVisibility(System.Guid)"]
Return Value
Type: Boolean
 Return true if this layer's visibility in the specified viewport is controlled by a parent object and the parent is turned on (after being off), then this layer will also be turned on in the specified viewport. Returns false if this layer's visibility in the specified viewport is controlled by a parent object and the parent layer is turned on(after being off), then this layer will continue to be off in the specified viewport.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace