RhinoCommon API
RealtimeDisplayMode.HudMaximumPasses Method
 Override to communicate the maximum passes count currently in use for the render session. Can be shown in the HUD
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual int HudMaximumPasses()
Public Overridable Function HudMaximumPasses As Integer
Return Value
Type: Int32
Maximum passes
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace