RhinoCommon API
PersistentSettingsConverter.IsStringDictionary Method
 Determines if the string value is formatted as a key value pair string list.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool IsStringDictionary(
	string s
)
Public Shared Function IsStringDictionary (
	s As String
) As Boolean
Parameters
s
Type: System.String
String to check
Return Value
Type: Boolean
 Returns true if it is a XML key value pair list otherwise return false.
See Also
Reference
PersistentSettingsConverter Class
Rhino Namespace