RhinoCommon API
RenderTexture.GetOffsetLocked Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetOffsetLocked"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual bool GetOffsetLocked()
Public Overridable Function GetOffsetLocked As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetOffsetLocked"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace