RhinoCommon API
PersistentSettings.GetChar Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetChar(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public char GetChar(
	string key
)
Public Function GetChar (
	key As String
) As Char
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetChar(System.String)"]
Return Value
Type: Char
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetChar(System.String)"]
See Also
Reference
PersistentSettings Class
GetChar Overload
Rhino Namespace