RhinoCommon API
ToolbarFileCollection.Open Method
 Opens a toolbar file.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ToolbarFile Open(
	string path
)
Public Function Open (
	path As String
) As ToolbarFile
Parameters
path
Type: System.String
The full path to the toolbar file.
Return Value
Type: ToolbarFile
The toolbar if successful, null otherwise.
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace