RhinoCommon API
Brep.RemoveHoles Method (IEnumerable<ComponentIndex>, Double)
 Removes inner loops, or holes, in a Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public Brep RemoveHoles(
	IEnumerable<ComponentIndex> loops,
	double tolerance
)
Public Function RemoveHoles (
	loops As IEnumerable(Of ComponentIndex),
	tolerance As Double
) As Brep
Parameters
loops
Type: System.Collections.Generic.IEnumerable<ComponentIndex>
A list of BrepLoop component indexes, where BrepLoop.LoopType == Rhino.Geometry.BrepLoopType.Inner.
tolerance
Type: System.Double
The tolerance. When in doubt, use the document's model absolute tolerance.
Return Value
Type: Brep
The Brep without holes if successful, null otherwise.
See Also
Reference
Brep Class
RemoveHoles Overload
Rhino.Geometry Namespace