RhinoCommon API
UserInterfaceObjectBase Constructor
Initializes a new instance of the UserInterfaceObjectBase class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected UserInterfaceObjectBase()
Protected Sub New
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace