RhinoCommon API
PersistentSettings.GetPoint Method (String, Point)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetPoint(System.String,System.Drawing.Point)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point GetPoint(
	string key,
	Point defaultValue
)
Public Function GetPoint (
	key As String,
	defaultValue As Point
) As Point
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetPoint(System.String,System.Drawing.Point)"]
defaultValue
Type: System.Drawing.Point
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetPoint(System.String,System.Drawing.Point)"]
Return Value
Type: Point
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetPoint(System.String,System.Drawing.Point)"]
See Also
Reference
PersistentSettings Class
GetPoint Overload
Rhino Namespace