RhinoCommon API
Panels.OpenPanel Method (Guid, Boolean)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void OpenPanel(
	Guid panelId,
	bool makeSelectedPanel
)
Public Shared Sub OpenPanel (
	panelId As Guid,
	makeSelectedPanel As Boolean
)
Parameters
panelId
Type: System.Guid
 Class type Id for the panel to open.
makeSelectedPanel
Type: System.Boolean
 If true then the panel is set as the active tab after opening it otherwise; the panel is opened but not set as the active tab.
See Also
Reference
Panels Class
OpenPanel Overload
Rhino.UI Namespace