RhinoCommon API
HostUtils.ClearFpuExceptionStatus Method
 Clear FPU exception and busy flags (Intel assembly fnclex)
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void ClearFpuExceptionStatus()
Public Shared Sub ClearFpuExceptionStatus
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace