RhinoCommon API
RenderPipeline.OnRenderEnd Method
 Called by the framework when the user closes the render window or clicks on the stop button in the render window.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract void OnRenderEnd(
	RenderEndEventArgs e
)
Protected MustOverride Sub OnRenderEnd (
	e As RenderEndEventArgs
)
Parameters
e
Type: Rhino.Render.RenderEndEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.Render.RenderPipeline.OnRenderEnd(Rhino.Render.RenderEndEventArgs)"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace