RhinoCommon API
Curve.CreateConicCornerRectangle Method
 Creates a conic-corned (rounded) rectangular curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public static Curve CreateConicCornerRectangle(
	Rectangle3d rectangle,
	double rho
)
Public Shared Function CreateConicCornerRectangle (
	rectangle As Rectangle3d,
	rho As Double
) As Curve
Parameters
rectangle
Type: Rhino.Geometry.Rectangle3d
The rectangle.
rho
Type: System.Double
The rho value at each corner, in the exclusive range (0.0, 1.0).
Return Value
Type: Curve
A conic-cornered rectangular curve if successful, null otherwise.
See Also
Reference
Curve Class
Rhino.Geometry Namespace