RhinoCommon API
CommonObject.ConstructConstObject Method
 Assigns a parent object and a sub-object index to this.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected void ConstructConstObject(
	Object parentObject,
	int subobjectIndex
)
Protected Sub ConstructConstObject (
	parentObject As Object,
	subobjectIndex As Integer
)
Parameters
parentObject
Type: System.Object
The parent object.
subobjectIndex
Type: System.Int32
The sub-object index.
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace