RhinoCommon API
RealtimeDisplayMode.HudMaxPassesChangedEventArgs Constructor
Initializes a new instance of the RealtimeDisplayMode.HudMaxPassesChangedEventArgs class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public HudMaxPassesChangedEventArgs(
	int mp
)
Public Sub New (
	mp As Integer
)
Parameters
mp
Type: System.Int32
[Missing <param name="mp"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudMaxPassesChangedEventArgs.#ctor(System.Int32)"]
See Also
Reference
RealtimeDisplayMode.HudMaxPassesChangedEventArgs Class
Rhino.Render Namespace