RhinoCommon API
SurfaceFilletBase.CreateNonRationalCubicFilletSrf Method
 Creates a fillet using non-rational Cubic sections with a tangent slider
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool CreateNonRationalCubicFilletSrf(
	BrepFace faceA,
	Point2d uvA,
	BrepFace faceB,
	Point2d uvB,
	double radius,
	double tolerance,
	List<Brep> trimmedBrepsA,
	List<Brep> trimmedBrepsB,
	int rail_degree,
	double TanSlider,
	bool bTrim,
	bool bExtend,
	List<Brep> Fillets
)
Public Shared Function CreateNonRationalCubicFilletSrf (
	faceA As BrepFace,
	uvA As Point2d,
	faceB As BrepFace,
	uvB As Point2d,
	radius As Double,
	tolerance As Double,
	trimmedBrepsA As List(Of Brep),
	trimmedBrepsB As List(Of Brep),
	rail_degree As Integer,
	TanSlider As Double,
	bTrim As Boolean,
	bExtend As Boolean,
	Fillets As List(Of Brep)
) As Boolean
Parameters
faceA
Type: Rhino.Geometry.BrepFace
the first face to use constructing the fillet
uvA
Type: Rhino.Geometry.Point2d
The parametric u,v selection point on FaceA close to the edge to fillet
faceB
Type: Rhino.Geometry.BrepFace
the second face to use constructing the fillet
uvB
Type: Rhino.Geometry.Point2d
The parametric u,v selection point on FaceB close to the edge to fillet
radius
Type: System.Double
The radius of the fillet
tolerance
Type: System.Double
Tolerance to use in fitting a solution
trimmedBrepsA
Type: System.Collections.Generic.List<Brep>
if bTrim = true, returns the remains of FaceA trimmed to the fillet
trimmedBrepsB
Type: System.Collections.Generic.List<Brep>
if bTrim = true, the remains of FaceB trimmed to the fillet
rail_degree
Type: System.Int32
the degree of the rail curve
TanSlider
Type: System.Double
A number between -0.95 and 0.95 indicating how far to push the tangent control points toward or away from the theoretical quadratic middle control point
bTrim
Type: System.Boolean
if True, trim the faces and retuen those results in resultsA and resultsB
bExtend
Type: System.Boolean
if True and if one input surface is longer than the other, the fillet surface is extended to the input surface edges
Fillets
Type: System.Collections.Generic.List<Brep>
the resulting fillet surfaces
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SurfaceFilletBase.CreateNonRationalCubicFilletSrf(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Int32,System.Double,System.Boolean,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})"]
See Also
Reference
SurfaceFilletBase Class
Rhino.Geometry Namespace