RhinoCommon API
CustomRenderMeshProvider.AllObjectsChanged Method (RhinoDoc)
 Call this method if your render meshes change.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void AllObjectsChanged(
	RhinoDoc doc
)
Public Shared Sub AllObjectsChanged (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider.AllObjectsChanged(Rhino.RhinoDoc)"]
See Also
Reference
CustomRenderMeshProvider Class
AllObjectsChanged Overload
Rhino.Render Namespace