RhinoCommon API
BrepFaceList.StandardizeFaceSurfaces Method
Standardize all faces in the brep.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void StandardizeFaceSurfaces()
Public Sub StandardizeFaceSurfaces
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace