RhinoCommon API
ObjectPropertiesPageEventArgs.IncludesObjectsType Method (ObjectType)
[Missing <summary> documentation for "M:Rhino.UI.ObjectPropertiesPageEventArgs.IncludesObjectsType(Rhino.DocObjects.ObjectType)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IncludesObjectsType(
	ObjectType objectTypes
)
Public Function IncludesObjectsType (
	objectTypes As ObjectType
) As Boolean
Parameters
objectTypes
Type: Rhino.DocObjects.ObjectType
[Missing <param name="objectTypes"/> documentation for "M:Rhino.UI.ObjectPropertiesPageEventArgs.IncludesObjectsType(Rhino.DocObjects.ObjectType)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPageEventArgs.IncludesObjectsType(Rhino.DocObjects.ObjectType)"]
See Also
Reference
ObjectPropertiesPageEventArgs Class
IncludesObjectsType Overload
Rhino.UI Namespace