RhinoCommon API
Vector3f.Negate Method
 Computes the reversed vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Vector3f Negate(
	Vector3f vector
)
Public Shared Function Negate (
	vector As Vector3f
) As Vector3f
Parameters
vector
Type: Rhino.Geometry.Vector3f
A vector to negate.
Return Value
Type: Vector3f
A new vector where all components were multiplied by -1.
Remarks
This is similar to Reverse(), but is static for CLR compliance, and with default name.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace