RhinoCommon API
ViewInfo Constructor
 Create a default ViewInfo instance
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
public ViewInfo()
Public Sub New
See Also
Reference
ViewInfo Class
ViewInfo Overload
Rhino.DocObjects Namespace