RhinoCommon API
RealtimeDisplayMode.PostConstruct Method
 Override PostConstruct if you need to initialize where the underlying RealtimeDisplayMode is available. The connection is made right after RealtimeDisplayMode has been instantiated, but just before PostConstruct is called. For instance finding out OpenGL information can be done in PostConstruct.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual void PostConstruct()
Public Overridable Sub PostConstruct
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace