RhinoCommon API
DirectionGripUserInterfaceObject.ArrowsVisibleInViewport Method
 Are the arrows visible for a given viewport. Projections that cause the arrows to be end on are projections where arrows are not drawn.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ArrowsVisibleInViewport(
	RhinoViewport viewport
)
Public Function ArrowsVisibleInViewport (
	viewport As RhinoViewport
) As Boolean
Parameters
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.UI.DirectionGripUserInterfaceObject.ArrowsVisibleInViewport(Rhino.Display.RhinoViewport)"]
Return Value
Type: Boolean
True if the arrow are visible for a given viewport.
See Also
Reference
DirectionGripUserInterfaceObject Class
Rhino.UI Namespace