RhinoCommon API
SceneServerData Constructor (PreviewAppearance, SceneServerDataUsage)
Initializes a new instance of the SceneServerData class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public SceneServerData(
	PreviewAppearance appearance,
	SceneServerDataUsage usage
)
Public Sub New (
	appearance As PreviewAppearance,
	usage As SceneServerDataUsage
)
Parameters
appearance
Type: Rhino.Render.PreviewAppearance
[Missing <param name="appearance"/> documentation for "M:Rhino.Render.SceneServerData.#ctor(Rhino.Render.PreviewAppearance,Rhino.Render.SceneServerDataUsage)"]
usage
Type: Rhino.Render.SceneServerDataUsage
[Missing <param name="usage"/> documentation for "M:Rhino.Render.SceneServerData.#ctor(Rhino.Render.PreviewAppearance,Rhino.Render.SceneServerDataUsage)"]
See Also
Reference
SceneServerData Class
SceneServerData Overload
Rhino.Render Namespace