RhinoCommon API
Line.Flip Method
 Flip the endpoints of the line segment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Flip()
Public Sub Flip
See Also
Reference
Line Structure
Rhino.Geometry Namespace