RhinoCommon API
Transform2d.Multiply Operator (Transform2d, Vector2d)
 Multiplies a transformation by a vector and gets a new vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Vector2d operator *(
	Transform2d m,
	Vector2d v
)
Public Shared Operator * (
	m As Transform2d,
	v As Vector2d
) As Vector2d
Parameters
m
Type: Rhino.Geometry.Transform2d
A transformation.
v
Type: Rhino.Geometry.Vector2d
A vector.
Return Value
Type: Vector2d
The transformed vector.
Remarks
 Note well: The right hand column is the translation. It has an important effect when transforming a Euclidean point and has no effect when transforming a vector.
See Also
Reference
Transform2d Structure
Multiply Overload
Rhino.Geometry Namespace