RhinoCommon API
ViewCaptureSettings Constructor (ViewCaptureSettings)
Copy constructor
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public ViewCaptureSettings(
	ViewCaptureSettings other
)
Public Sub New (
	other As ViewCaptureSettings
)
Parameters
other
Type: Rhino.Display.ViewCaptureSettings
settings to copy data from
See Also
Reference
ViewCaptureSettings Class
ViewCaptureSettings Overload
Rhino.Display Namespace