RhinoCommon API
SupportOptions.CustomLibraryPath Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.CustomLibraryPath"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_CustomPath' instead")]
public static string CustomLibraryPath()
<ObsoleteAttribute("Use 'Libraries_CustomPath' instead")>
Public Shared Function CustomLibraryPath As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.CustomLibraryPath"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace