RhinoCommon API
RhinoDoc.Open Method
 Opens a 3dm file and makes it the active document. If called on windows the active document will be saved and closed and the new document will be opened and become the active document. If called on the Mac the file will be opened in a new document window.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RhinoDoc Open(
	string filePath,
	out bool wasAlreadyOpen
)
Public Shared Function Open (
	filePath As String,
	<OutAttribute> ByRef wasAlreadyOpen As Boolean
) As RhinoDoc
Parameters
filePath
Type: System.String
Full path to the 3dm file to open
wasAlreadyOpen
Type: System.Boolean
 Will get set to true if there is a currently open document with the specified path; otherwise it will get set to false.
Return Value
Type: RhinoDoc
 Returns the newly opened document on success or null on error.
See Also
Reference
RhinoDoc Class
Rhino Namespace