RhinoCommon API
Mesh.SplitNon2Manifolds Method (TextLog, CancellationToken, IProgress<Double>)
 Split a mesh where at non-2 manifolds boundaries.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Mesh[] SplitNon2Manifolds(
	TextLog textLog,
	CancellationToken cancel,
	IProgress<double> progress
)
Public Function SplitNon2Manifolds (
	textLog As TextLog,
	cancel As CancellationToken,
	progress As IProgress(Of Double)
) As Mesh()
Parameters
textLog
Type: Rhino.FileIO.TextLog
A text log to write onto.
cancel
Type: System.Threading.CancellationToken
A cancellation token.
progress
Type: System.IProgress<Double>
A progress reporter item. This can be null.
Return Value
Type: Mesh[]
An array of mesh parts representing the split result, or null: when no mesh split, or if a cancel stopped the computation.
See Also
Reference
Mesh Class
SplitNon2Manifolds Overload
Rhino.Geometry Namespace