RhinoCommon API
Arc.Reverse Method
 Reverses the orientation of the arc. Changes the domain from [a,b] to [-b,-a].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Reverse()
Public Sub Reverse
See Also
Reference
Arc Structure
Rhino.Geometry Namespace