RhinoCommon API
Vector2d.Multiply Method (Double, Vector2d)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Vector2d Multiply(
	double t,
	Vector2d vector
)
Public Shared Function Multiply (
	t As Double,
	vector As Vector2d
) As Vector2d
Parameters
t
Type: System.Double
A number.
vector
Type: Rhino.Geometry.Vector2d
A vector.
Return Value
Type: Vector2d
A new vector that is the original vector coordinate-wise multiplied by t.
See Also
Reference
Vector2d Structure
Multiply Overload
Rhino.Geometry Namespace