RhinoCommon API
ViewInfo.SetConstructionPlane Method
 Sets the view's construction plane, including its grid settings.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.35
Syntax
public void SetConstructionPlane(
	ConstructionPlane constructionPlane
)
Public Sub SetConstructionPlane (
	constructionPlane As ConstructionPlane
)
Parameters
constructionPlane
Type: Rhino.DocObjects.ConstructionPlane
The construction plane to store on the view.
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace