RhinoCommon API
PersistentSettings.TryGetDefault Method (String, Char)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Char@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetDefault(
	string key,
	out char value
)
Public Function TryGetDefault (
	key As String,
	<OutAttribute> ByRef value As Char
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Char@)"]
value
Type: System.Char
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Char@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Char@)"]
See Also
Reference
PersistentSettings Class
TryGetDefault Overload
Rhino Namespace