RhinoCommon API
File3dmShutLining.CurveProfile Method
 Returns the profile of the shut-line for the given curve.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int CurveProfile(
	Guid curve_id
)
Public Function CurveProfile (
	curve_id As Guid
) As Integer
Parameters
curve_id
Type: System.Guid
[Missing <param name="curve_id"/> documentation for "M:Rhino.FileIO.File3dmShutLining.CurveProfile(System.Guid)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmShutLining.CurveProfile(System.Guid)"]
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace