RhinoCommon API
CurveList Constructor (IEnumerable<Curve>)
 Initializes a new list that is filled with all items of the input enumerable.
Input items are not explicitly duplicated (this is a shallow copy).
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public CurveList(
	IEnumerable<Curve> collection
)
Public Sub New (
	collection As IEnumerable(Of Curve)
)
Parameters
collection
Type: System.Collections.Generic.IEnumerable<Curve>
A list, an array or any enumerable set of Curve.
See Also
Reference
CurveList Class
CurveList Overload
Rhino.Collections Namespace