RhinoCommon API
RealtimeDisplayMode.HudCustomStatusText Method
 Override to display status of the render engine.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual string HudCustomStatusText()
Public Overridable Function HudCustomStatusText As String
Return Value
Type: String
Status text to display
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace