RhinoCommon API
ToolbarFileCollection.FindByName Method
 Gets an open toolbar file by name, or alias.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ToolbarFile FindByName(
	string name,
	bool ignoreCase
)
Public Function FindByName (
	name As String,
	ignoreCase As Boolean
) As ToolbarFile
Parameters
name
Type: System.String
The name, or alias, of the toolbar file.
ignoreCase
Type: System.Boolean
true to ignore case during the comparison; otherwise, false.
Return Value
Type: ToolbarFile
The toolbar if successful, null otherwise.
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace