RhinoCommon API
Curve.ProjectToMesh Method (IEnumerable<Curve>, IEnumerable<Mesh>, Vector3d, Double, Boolean)
 Projects a curve to a set of meshes using a direction and tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.17
Syntax
public static Curve[] ProjectToMesh(
	IEnumerable<Curve> curves,
	IEnumerable<Mesh> meshes,
	Vector3d direction,
	double tolerance,
	bool loose
)
Public Shared Function ProjectToMesh (
	curves As IEnumerable(Of Curve),
	meshes As IEnumerable(Of Mesh),
	direction As Vector3d,
	tolerance As Double,
	loose As Boolean
) As Curve()
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
A list, an array, or any enumerable of curves.
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
A list, an array, or any enumerable of meshes.
direction
Type: Rhino.Geometry.Vector3d
A direction vector.
tolerance
Type: System.Double
A tolerance value.
loose
Type: System.Boolean
If true, then project curve edit points onto meshes.
Return Value
Type: Curve[]
An array of curves if successful, an empty array otherwise.
See Also
Reference
Curve Class
ProjectToMesh Overload
Rhino.Geometry Namespace