RhinoCommon API
Mesh.SetTextureCoordinates Method (TextureMapping, Transform, Boolean, Boolean)
 Sets texture coordinates using the given texture mapping and transform.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SetTextureCoordinates(
	TextureMapping tm,
	Transform xf,
	bool lazy,
	bool seamCheck
)
Public Sub SetTextureCoordinates (
	tm As TextureMapping,
	xf As Transform,
	lazy As Boolean,
	seamCheck As Boolean
)
Parameters
tm
Type: Rhino.Render.TextureMapping
Texture mapping
xf
Type: Rhino.Geometry.Transform
Transform to apply to the texture mapping
lazy
Type: System.Boolean
 If true and the mesh's texture coordinates were already computed from this same mapping and transform, no calculation is performed. If false, texture coordinates are always recalculated.
seamCheck
Type: System.Boolean
If true then some mesh edges might be unwelded to better represent UV discontinuities in the texture mapping. This only happens for the following mappings: Box, Sphere, Cylinder
See Also
Reference
Mesh Class
SetTextureCoordinates Overload
Rhino.Geometry Namespace