RhinoCommon API
NurbsSurfaceKnotList.RemoveKnots Method
 Remove knots from the knot vector and adjusts the remaining control points to maintain surface position as closely as possible. The knots from Knots[index0] through Knots[index1 - 1] will be removed.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool RemoveKnots(
	int index0,
	int index1
)
Public Function RemoveKnots (
	index0 As Integer,
	index1 As Integer
) As Boolean
Parameters
index0
Type: System.Int32
The starting knot index, where Degree-1 < index0 < index1 <= Points.Count-1.
index1
Type: System.Int32
The ending knot index, where Degree-1 < index0 < index1 <= Points.Count-1.
Return Value
Type: Boolean
true if successful, false on failure.
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace