RhinoCommon API
AppearanceSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static AppearanceSettingsState GetDefaultState()
Public Shared Function GetDefaultState As AppearanceSettingsState
Return Value
Type: AppearanceSettingsState
An instance of a class that represents all the default settings joined together.
See Also
Reference
AppearanceSettings Class
GetDefaultState Overload
Rhino.ApplicationSettings Namespace