RhinoCommon API
File3dmObject.GetHashCode Method
 Provides an hash code for this item.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
The hash code.
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace