RhinoCommon API
Transform2d.Equals Method (Transform2d)
 Determines if another transform equals this transform value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Equals(
	Transform2d other
)
Public Function Equals (
	other As Transform2d
) As Boolean
Parameters
other
Type: Rhino.Geometry.Transform2d
Another transform.
Return Value
Type: Boolean
true if other has the same value as this transform; otherwise, false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Transform2d Structure
Equals Overload
Rhino.Geometry Namespace