RhinoCommon API
GetCylinder.Get Method (Cylinder)
 Prompt for the getting of a cylinder.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Result Get(
	out Cylinder cylinder
)
Public Function Get (
	<OutAttribute> ByRef cylinder As Cylinder
) As Result
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
The cylinder geometry defined by the user.
Return Value
Type: Result
The result of the getting operation.
See Also
Reference
GetCylinder Class
Get Overload
Rhino.Input.Custom Namespace