RhinoCommon API
RhinoObject.GetMaterial Method (ComponentIndex, Guid)
 Get the Material associated with the sub object identified by componentIndex if the component index is set to ComponentIndex.Unset then the top level material is returned.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Material GetMaterial(
	ComponentIndex componentIndex,
	Guid plugInId
)
Public Function GetMaterial (
	componentIndex As ComponentIndex,
	plugInId As Guid
) As Material
Parameters
componentIndex
Type: Rhino.Geometry.ComponentIndex
 Returns the material associated with the specified sub object or the objects top level material if it is set to ComponentIndex.Unset
plugInId
Type: System.Guid
 The plug-in specific material to look for.
Return Value
Type: Material
 Returns the Material associated with the sub object identified by componentIndex if the component index is set to ComponentIndex.Unset then the top level material is returned.
See Also
Reference
RhinoObject Class
GetMaterial Overload
Rhino.DocObjects Namespace