RhinoCommon API
HermiteSurface.VParameterAt Method
 Gets the "v" parameter at an index. These parameters are strictly increasing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double VParameterAt(
	int index
)
Public Function VParameterAt (
	index As Integer
) As Double
Parameters
index
Type: System.Int32
The index.
Return Value
Type: Double
The parameter.
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace