RhinoCommon API
BinaryArchiveFile.Open Method
[Missing <summary> documentation for "M:Rhino.FileIO.BinaryArchiveFile.Open"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public bool Open()
Public Function Open As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveFile.Open"]
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace