RhinoCommon API
DisplayPipeline.Draw2dLine Method (PointF, PointF, Color, Single)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.Draw2dLine(System.Drawing.PointF,System.Drawing.PointF,System.Drawing.Color,System.Single)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Draw2dLine(
	PointF from,
	PointF to,
	Color color,
	float thickness
)
Public Sub Draw2dLine (
	from As PointF,
	to As PointF,
	color As Color,
	thickness As Single
)
Parameters
from
Type: System.Drawing.PointF
[Missing <param name="from"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw2dLine(System.Drawing.PointF,System.Drawing.PointF,System.Drawing.Color,System.Single)"]
to
Type: System.Drawing.PointF
[Missing <param name="to"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw2dLine(System.Drawing.PointF,System.Drawing.PointF,System.Drawing.Color,System.Single)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw2dLine(System.Drawing.PointF,System.Drawing.PointF,System.Drawing.Color,System.Single)"]
thickness
Type: System.Single
[Missing <param name="thickness"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw2dLine(System.Drawing.PointF,System.Drawing.PointF,System.Drawing.Color,System.Single)"]
See Also
Reference
DisplayPipeline Class
Draw2dLine Overload
Rhino.Display Namespace