RhinoCommon API
Mesh.Volume Method
 Compute volume of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Volume()
Public Function Volume As Double
Return Value
Type: Double
Volume of the mesh.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace