RhinoCommon API
Surface.Extend Method (Int32, Interval)
 Analytically extends the surface to include the interval.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
public bool Extend(
	int direction,
	Interval interval
)
Public Function Extend (
	direction As Integer,
	interval As Interval
) As Boolean
Parameters
direction
Type: System.Int32
 If 0, Surface.Domain(0) will include the interval. (the first surface parameter). If 1, Surface.Domain(1) will include the interval. (the second surface parameter).
interval
Type: Rhino.Geometry.Interval
 If the interval is not included in surface domain, the surface will be extended so that its domain includes the interval. Note, this method will fail if the surface is closed in the specified direction.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
Surface Class
Extend Overload
Rhino.Geometry Namespace