RhinoCommon API
RenderWindow.IsChannelAvailable Method
 Query if a channel is available.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool IsChannelAvailable(
	Guid id
)
Public Function IsChannelAvailable (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Render.RenderWindow.IsChannelAvailable(System.Guid)"]
Return Value
Type: Boolean
Returns true if the channel is available.
See Also
Reference
RenderWindow Class
Rhino.Render Namespace