RhinoCommon API
GetEllipse.Dispose Method (Boolean)
 Releases the unmanaged object.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
GetEllipse Class
Dispose Overload
Rhino.Input.Custom Namespace