RhinoCommon API
File3dmHatchPatternTable.FindNameHash Method
 Finds a HatchPattern given its name hash.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public HatchPattern FindNameHash(
	NameHash nameHash
)
Public Function FindNameHash (
	nameHash As NameHash
) As HatchPattern
Parameters
nameHash
Type: Rhino.FileIO.NameHash
The name hash of the HatchPattern to be searched.
Return Value
Type: HatchPattern
An HatchPattern, or null on error.
See Also
Reference
File3dmHatchPatternTable Class
Rhino.FileIO Namespace