RhinoCommon API
TextFields.PageWidth Method
 Return the current layout page width in the layout units
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static double PageWidth()
Public Shared Function PageWidth As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.PageWidth"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace