RhinoCommon API
RenderPipeline.OnRenderBeginQuiet Method
 Called by the framework when it is time to start rendering quietly, there is no user interface when rendering in this mode and the default post process effects will get applied to the scene when the rendering is complete.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool OnRenderBeginQuiet(
	Size imageSize
)
Protected Overridable Function OnRenderBeginQuiet (
	imageSize As Size
) As Boolean
Parameters
imageSize
Type: System.Drawing.Size
[Missing <param name="imageSize"/> documentation for "M:Rhino.Render.RenderPipeline.OnRenderBeginQuiet(System.Drawing.Size)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.OnRenderBeginQuiet(System.Drawing.Size)"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace