RhinoCommon API
RhinoObject.UnselectAllSubObjects Method
 Removes selection from all sub-objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int UnselectAllSubObjects()
Public Function UnselectAllSubObjects As Integer
Return Value
Type: Int32
The number of unselected sub-objects.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace