RhinoCommon API
ObjectTable.DeleteGrips Method (IEnumerable<GripObject>)
 Deletes one or more grip objects.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public int DeleteGrips(
	IEnumerable<GripObject> grips
)
Public Function DeleteGrips (
	grips As IEnumerable(Of GripObject)
) As Integer
Parameters
grips
Type: System.Collections.Generic.IEnumerable<GripObject>
The grip objects to delete.
Return Value
Type: Int32
The number of successfully deleted grip objects.
See Also
Reference
ObjectTable Class
DeleteGrips Overload
Rhino.DocObjects.Tables Namespace