RhinoCommon API
ArchivableDictionary.Set Method (String, IEnumerable<GeometryBase>)
 Sets an array of GeometryBase
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Set(
	string key,
	IEnumerable<GeometryBase> val
)
Public Function Set (
	key As String,
	val As IEnumerable(Of GeometryBase)
) As Boolean
Parameters
key
Type: System.String
A text key
val
Type: System.Collections.Generic.IEnumerable<GeometryBase>
An object for that key
Because this class is a reference type and is mutable, changes to this object will propagate to the object inside the dictionary.
It is up to the user to clone this entry when appropriate.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace