RhinoCommon API
Brep.TryGetExtrusion Method (Extrusion, Double)
Tests a Brep to see if it is an extrusion and returns the extrusion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetExtrusion(
	out Extrusion extrusion,
	double tolerance
)
Public Function TryGetExtrusion (
	<OutAttribute> ByRef extrusion As Extrusion,
	tolerance As Double
) As Boolean
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
On success, the extrusion parameters are filled in.
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the Brep is a portion of an extrusion.
See Also
Reference
Brep Class
TryGetExtrusion Overload
Rhino.Geometry Namespace