RhinoCommon API
BrepEdge.Get3dVectorsIntoFaces Method
 For each trim at this edge, find the 3d unit vector at the edge parameter in the trim's surface tangent plane, perpendicular to the edge, which points to the active side of the trim.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Get3dVectorsIntoFaces(
	double t,
	out Vector3d[] vectors,
	out Vector3d[] normals
)
Public Function Get3dVectorsIntoFaces (
	t As Double,
	<OutAttribute> ByRef vectors As Vector3d(),
	<OutAttribute> ByRef normals As Vector3d()
) As Boolean
Parameters
t
Type: System.Double
edge parameter where vectors and normals are evaluated
vectors
Type: Rhino.Geometry.Vector3d[]
3d vectors point into the face(s). One for each trim, in order of TrimIndices()
normals
Type: Rhino.Geometry.Vector3d[]
Surface normals at edge parameter. Perpendicular to the 3d vectors.
Return Value
Type: Boolean
True if vectors can be found. False if edge tangent or surface normals can't be found, or if input is bad.
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace