RhinoCommon API
TextEntity.Transform Method (Transform, DimensionStyle)
 Transform the object by a 4x4 transform matrix and change text height override to accommodate scaling in the transform if necessary
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Transform(
	Transform transform,
	DimensionStyle style
)
Public Function Transform (
	transform As Transform,
	style As DimensionStyle
) As Boolean
Parameters
transform
Type: Rhino.Geometry.Transform
 An Transform with the transformation information
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.TextEntity.Transform(Rhino.Geometry.Transform,Rhino.DocObjects.DimensionStyle)"]
Return Value
Type: Boolean
 Returns true on success otherwise returns false.
See Also
Reference
TextEntity Class
Transform Overload
Rhino.Geometry Namespace