RhinoCommon API
SubDEdgeSharpness.FromIntervalPercentage Method (Interval)
 Creates a sharpness that varies from one end of the edge to the other, from percentages. This is useful in user interface code that expresses sharpness as a percentage.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static SubDEdgeSharpness FromIntervalPercentage(
	Interval percentageInterval
)
Public Shared Function FromIntervalPercentage (
	percentageInterval As Interval
) As SubDEdgeSharpness
Parameters
percentageInterval
Type: Rhino.Geometry.Interval
 Percentages at the start and end of the edge, each between 0.0 and 100.0, or MaxValue for a crease.
Return Value
Type: SubDEdgeSharpness
See FromIntervalPercentage(Double, Double).
See Also
Reference
SubDEdgeSharpness Structure
FromIntervalPercentage Overload
Rhino.Geometry Namespace