RhinoCommon API
ObjectAttributes.GetDisplayModeOverride Method
 Returns the id of the display mode of an objects. Object display modes are view based. Thus, it is possible to have an object display different in different views.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public Guid GetDisplayModeOverride(
	Guid viewportId
)
Public Function GetDisplayModeOverride (
	viewportId As Guid
) As Guid
Parameters
viewportId
Type: System.Guid
Id of a Rhino Viewport.
Return Value
Type: Guid
A display node id if the object has a display mode override for the viewport; otherwise Guid.Empty is returned.
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace