RhinoCommon API
PostEffectJob.Clone Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffectJob.Clone"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public abstract PostEffectJob Clone()
Public MustOverride Function Clone As PostEffectJob
Return Value
Type: PostEffectJob
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectJob.Clone"]
See Also
Reference
PostEffectJob Class
Rhino.Render.PostEffects Namespace