RhinoCommon API
DisplayPipeline.PushClipTesting Method
Note: This API is now obsolete.
 Push a ClipTesting flag on the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use PushDepthTesting")]
public void PushClipTesting(
	bool enable
)
<ObsoleteAttribute("Use PushDepthTesting")>
Public Sub PushClipTesting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
ClipTesting flag.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace