RhinoCommon API
RhinoDoc.OpenHeadless Method (String, ArchivableDictionary)
 Opens a file into a new headless RhinoDoc.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public static RhinoDoc OpenHeadless(
	string filePath,
	ArchivableDictionary options
)
Public Shared Function OpenHeadless (
	filePath As String,
	options As ArchivableDictionary
) As RhinoDoc
Parameters
filePath
Type: System.String
Path of a Rhino model to load.
options
Type: Rhino.Collections.ArchivableDictionary
[Missing <param name="options"/> documentation for "M:Rhino.RhinoDoc.OpenHeadless(System.String,Rhino.Collections.ArchivableDictionary)"]
Return Value
Type: RhinoDoc
[Missing <returns> documentation for "M:Rhino.RhinoDoc.OpenHeadless(System.String,Rhino.Collections.ArchivableDictionary)"]
See Also
Reference
RhinoDoc Class
OpenHeadless Overload
Rhino Namespace