RhinoCommon API
MeshObject.CheckMeshes Method
 Examines mesh objects and logs a description of what it finds right or wrong. The various properties the function checks for are described in MeshCheckParameters.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool CheckMeshes(
	IEnumerable<MeshObject> meshObjects,
	TextLog textLog,
	ref MeshCheckParameters parameters
)
Public Shared Function CheckMeshes (
	meshObjects As IEnumerable(Of MeshObject),
	textLog As TextLog,
	ByRef parameters As MeshCheckParameters
) As Boolean
Parameters
meshObjects
Type: System.Collections.Generic.IEnumerable<MeshObject>
A collection of mesh objects.
textLog
Type: Rhino.FileIO.TextLog
The text log.
parameters
Type: Rhino.Geometry.MeshCheckParameters
The mesh checking parameter and results.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
MeshObject Class
Rhino.DocObjects Namespace