RhinoCommon API
IEpsilonComparable<T>.EpsilonEquals Method
[Missing <summary> documentation for "M:Rhino.IEpsilonComparable`1.EpsilonEquals(`0,System.Double)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool EpsilonEquals(
	T other,
	double epsilon
)
Function EpsilonEquals (
	other As T,
	epsilon As Double
) As Boolean
Parameters
other
Type: T
[Missing <param name="other"/> documentation for "M:Rhino.IEpsilonComparable`1.EpsilonEquals(`0,System.Double)"]
epsilon
Type: System.Double
[Missing <param name="epsilon"/> documentation for "M:Rhino.IEpsilonComparable`1.EpsilonEquals(`0,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.IEpsilonComparable`1.EpsilonEquals(`0,System.Double)"]
See Also
Reference
IEpsilonComparable<T> Interface
Rhino Namespace