RhinoCommon API
NamedPositionTable.Update Method (String)
 Updates a Named Position, effectively storing the current positions of the objects which the Named Position is tracking.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Update(
	string name
)
Public Function Update (
	name As String
) As Boolean
Parameters
name
Type: System.String
 Name of the Named Position which you want to update.
Return Value
Type: Boolean
 True or False depending on whether the Update was successful.
See Also
Reference
NamedPositionTable Class
Update Overload
Rhino.DocObjects.Tables Namespace