RhinoCommon API
RenderPrimitive.Dispose Method (Boolean)
Releases the unmanaged resources used by the RenderPrimitive and optionally releases the managed resources
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected void Dispose(
	bool isDisposing
)
Protected Sub Dispose (
	isDisposing As Boolean
)
Parameters
isDisposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
RenderPrimitive Class
Dispose Overload
Rhino.Render Namespace