RhinoCommon API
BezierSurface.PointAt Method
Evaluates point at a surface parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Point3d PointAt(
	double u,
	double v
)
Public Function PointAt (
	u As Double,
	v As Double
) As Point3d
Parameters
u
Type: System.Double
evaluation parameters.
v
Type: System.Double
evaluation parameters.
Return Value
Type: Point3d
Point (location of surface at the parameter u,v).
Remarks
No error handling.
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace