RhinoCommon API
Layer.IsChildOf Method (Guid)
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(System.Guid)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsChildOf(
	Guid otherlayerId
)
Public Function IsChildOf (
	otherlayerId As Guid
) As Boolean
Parameters
otherlayerId
Type: System.Guid
[Missing <param name="otherlayerId"/> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(System.Guid)"]
See Also
Reference
Layer Class
IsChildOf Overload
Rhino.DocObjects Namespace