RhinoCommon API
ObjectTable.SelectedObjectsExist Method
 Quick way to test if any objects are currently selected
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public bool SelectedObjectsExist(
	ObjectType objectType,
	bool checkSubObjects
)
Public Function SelectedObjectsExist (
	objectType As ObjectType,
	checkSubObjects As Boolean
) As Boolean
Parameters
objectType
Type: Rhino.DocObjects.ObjectType
the type of objects to test for
checkSubObjects
Type: System.Boolean
Check to see if subobjects are selected
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.SelectedObjectsExist(Rhino.DocObjects.ObjectType,System.Boolean)"]
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace