RhinoCommon API
LengthUnit.GetHashCode Method
 Returns the hash code for this instance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A 32-bit integer that is the hash code for this instance.
See Also
Reference
LengthUnit Structure
Rhino Namespace