RhinoCommon API
PersistentSettings.SetDefault Method (String, Guid)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Guid)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetDefault(
	string key,
	Guid value
)
Public Sub SetDefault (
	key As String,
	value As Guid
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Guid)"]
value
Type: System.Guid
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Guid)"]
See Also
Reference
PersistentSettings Class
SetDefault Overload
Rhino Namespace