RhinoCommon API
Transform2d.ToAffineElements Method
 Gets the six coefficients used by the traditional 2d drawing APIs as an array in (a, b, c, d, tx, ty) order.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double[] ToAffineElements()
Public Function ToAffineElements As Double()
Return Value
Type: Double[]
Six values.
Remarks
 Those APIs map a point (x,y) to (a*x + c*y + tx, b*x + d*y + ty), so the six values are the transpose of the Transform2d value order: a is M00, b is M10, c is M01, d is M11, tx is M02 and ty is M12. Composition order is reversed as well, because those APIs use the row vector convention: A2d * B2d is the equivalent of the platform product B * A.
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace