RhinoCommon API
RenderContentCollection.Remove Method
 Remove an array of contents from the collection.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Remove(
	RenderContentCollection collection
)
Public Sub Remove (
	collection As RenderContentCollection
)
Parameters
collection
Type: Rhino.Render.RenderContentCollection
Collection of contents to remove
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace