RhinoCommon API
RadialDimension.GetDistanceDisplayText Method (UnitSystem, DimensionStyle)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Geometry.RadialDimension.GetDistanceDisplayText(Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Since 9.0")]
public string GetDistanceDisplayText(
	UnitSystem unitsystem,
	DimensionStyle style
)
<ObsoleteAttribute("Since 9.0")>
Public Function GetDistanceDisplayText (
	unitsystem As UnitSystem,
	style As DimensionStyle
) As String
Parameters
unitsystem
Type: Rhino.UnitSystem
[Missing <param name="unitsystem"/> documentation for "M:Rhino.Geometry.RadialDimension.GetDistanceDisplayText(Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle)"]
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.RadialDimension.GetDistanceDisplayText(Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Geometry.RadialDimension.GetDistanceDisplayText(Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle)"]
See Also
Reference
RadialDimension Class
GetDistanceDisplayText Overload
Rhino.Geometry Namespace