RhinoCommon API
WorksessionFileLayerOverride.Dispose Method
Releases the native layer override.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
WorksessionFileLayerOverride Class
Rhino.FileIO Namespace