RhinoCommon API
HatchPattern Constructor (HatchPattern)
Initializes a new instance of the HatchPattern class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public HatchPattern(
	HatchPattern other
)
Public Sub New (
	other As HatchPattern
)
Parameters
other
Type: Rhino.DocObjects.HatchPattern
[Missing <param name="other"/> documentation for "M:Rhino.DocObjects.HatchPattern.#ctor(Rhino.DocObjects.HatchPattern)"]
See Also
Reference
HatchPattern Class
HatchPattern Overload
Rhino.DocObjects Namespace