RhinoCommon API
ChangeQueue.RefreshMaterials Method
 Signal the queue to refresh all of the materials in the scene.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void RefreshMaterials()
Public Sub RefreshMaterials
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace