RhinoCommon API
DetailViewObject.TryGetModelLength Method
 Converts a paper length into a model length.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.17
Syntax
public bool TryGetModelLength(
	double paper,
	out double model
)
Public Function TryGetModelLength (
	paper As Double,
	<OutAttribute> ByRef model As Double
) As Boolean
Parameters
paper
Type: System.Double
[Missing <param name="paper"/> documentation for "M:Rhino.DocObjects.DetailViewObject.TryGetModelLength(System.Double,System.Double@)"]
model
Type: System.Double
[Missing <param name="model"/> documentation for "M:Rhino.DocObjects.DetailViewObject.TryGetModelLength(System.Double,System.Double@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.DetailViewObject.TryGetModelLength(System.Double,System.Double@)"]
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace