RhinoCommon API
RenderContent.RenderHashExclude Method (CrcRenderHashFlags, String)
 As RenderHash, but allows you to specify flags and exclude specific parameters.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public uint RenderHashExclude(
	CrcRenderHashFlags flags,
	string excludeParameterNames
)
Public Function RenderHashExclude (
	flags As CrcRenderHashFlags,
	excludeParameterNames As String
) As UInteger
Parameters
flags
Type: Rhino.Render.CrcRenderHashFlags
Flags to finely control the render hash.
excludeParameterNames
Type: System.String
Semicolon-delimited string of parameter names to exclude.
Return Value
Type: UInt32
The render hash.
See Also
Reference
RenderContent Class
RenderHashExclude Overload
Rhino.Render Namespace