RhinoCommon API
ZBufferCapture.ShowMeshWires Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowMeshWires(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public void ShowMeshWires(
	bool on
)
Public Sub ShowMeshWires (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowMeshWires(System.Boolean)"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace