RhinoCommon API
FilePdf.GetCustomPages Method
 Get a list of custom PDF page definitions defined by the user
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static PrintedPageDefinition[] GetCustomPages()
Public Shared Function GetCustomPages As PrintedPageDefinition()
Return Value
Type: PrintedPageDefinition[]
[Missing <returns> documentation for "M:Rhino.FileIO.FilePdf.GetCustomPages"]
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace