RhinoCommon API
LicenseUtils.ShowRhinoExpiredMessage Method
 Show Rhino or Beta expired message
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool ShowRhinoExpiredMessage(
	Mode mode,
	ref int result
)
Public Shared Function ShowRhinoExpiredMessage (
	mode As Mode,
	ByRef result As Integer
) As Boolean
Parameters
mode
Type: Rhino.Runtime.Mode
[Missing <param name="mode"/> documentation for "M:Rhino.PlugIns.LicenseUtils.ShowRhinoExpiredMessage(Rhino.Runtime.Mode,System.Int32@)"]
result
Type: System.Int32
[Missing <param name="result"/> documentation for "M:Rhino.PlugIns.LicenseUtils.ShowRhinoExpiredMessage(Rhino.Runtime.Mode,System.Int32@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.ShowRhinoExpiredMessage(Rhino.Runtime.Mode,System.Int32@)"]
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace