RhinoCommon API
SubD.DuplicateEdgeCurves Method
 Gets Nurbs form of all edges in this SubD, with clamped knots. NB: Does not update the SubD evaluation cache before getting the edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public Curve[] DuplicateEdgeCurves()
Public Function DuplicateEdgeCurves As Curve()
Return Value
Type: Curve[]
An array of edge curves.
See Also
Reference
SubD Class
DuplicateEdgeCurves Overload
Rhino.Geometry Namespace
SubD.UpdateSurfaceMeshCache(Boolean)