RhinoCommon API
BezierCurve.Derivative Method
[Missing <summary> documentation for "M:Rhino.Geometry.BezierCurve.Derivative"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public BezierCurve Derivative()
Public Function Derivative As BezierCurve
Return Value
Type: BezierCurve
[Missing <returns> documentation for "M:Rhino.Geometry.BezierCurve.Derivative"]
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace