RhinoCommon API
Curve.DivideEquidistant Method (Double, Double[])
 Calculates 3d points on a curve where the linear distance between the points is equal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public Point3d[] DivideEquidistant(
	double distance,
	out double[] curveParameters
)
Public Function DivideEquidistant (
	distance As Double,
	<OutAttribute> ByRef curveParameters As Double()
) As Point3d()
Parameters
distance
Type: System.Double
The distance between division points.
curveParameters
Type: System.Double[]
If successful, an array of curve parameters at the point locations.
Return Value
Type: Point3d[]
An array of equidistant points, or null on error.
Remarks
 Unlike the other divide methods, which divides a curve based on arc length, or the distance along the curve between two points, this function divides a curve based on the linear distance between points.
See Also
Reference
Curve Class
DivideEquidistant Overload
Rhino.Geometry Namespace