RhinoCommon API
Mesh.CreateFromFilteredFaceList Method
 Constructs a sub-mesh, that contains a filtered list of faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Mesh CreateFromFilteredFaceList(
	Mesh original,
	IEnumerable<bool> inclusion
)
Public Shared Function CreateFromFilteredFaceList (
	original As Mesh,
	inclusion As IEnumerable(Of Boolean)
) As Mesh
Parameters
original
Type: Rhino.Geometry.Mesh
The mesh to copy. If null, null is returned.
inclusion
Type: System.Collections.Generic.IEnumerable<Boolean>
A series of true and false values, that determine if each face is used in the new mesh. If null or empty, a non-filtered copy of the original mesh is returned.
If the amount does not match the length of the face list, the pattern is repeated. If it exceeds the amount of faces in the mesh face list, the pattern is truncated.
Return Value
Type: Mesh
A copy of the original mesh with its faces filtered, or null on failure.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace