RhinoCommon API
SimulatedTexture Constructor (RhinoDoc)
Initializes a new instance of the SimulatedTexture class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public SimulatedTexture(
	RhinoDoc doc
)
Public Sub New (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.SimulatedTexture.#ctor(Rhino.RhinoDoc)"]
See Also
Reference
SimulatedTexture Class
SimulatedTexture Overload
Rhino.Render Namespace