RhinoCommon API
MeshTextureCoordinateList.GetEnumerator Method
 Gets an enumerator that yields all texture coordinates in this collection.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IEnumerator<Point2f> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Point2f)
Return Value
Type: IEnumerator<Point2f>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace