RhinoCommon API
FileCsvDocument.Read Method (TextReader, Boolean)
 Reads CSV content from a text reader.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static FileCsvDocument Read(
	TextReader reader,
	bool hasHeader
)
Public Shared Function Read (
	reader As TextReader,
	hasHeader As Boolean
) As FileCsvDocument
Parameters
reader
Type: System.IO.TextReader
The reader to read from.
hasHeader
Type: System.Boolean
When true, the first row is taken as the column-name header and is not counted as a data row.
Return Value
Type: FileCsvDocument
A new document populated with the contents of the reader.
See Also
Reference
FileCsvDocument Class
Read Overload
Rhino.FileIO Namespace