RhinoCommon API
Brep.UntrimFace Method
 Untrims a face completely, expanding it back to its underlying surface: the outer boundary is untrimmed and all inner loops (holes) are removed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Brep UntrimFace(
	int faceIndex,
	double tolerance
)
Public Function UntrimFace (
	faceIndex As Integer,
	tolerance As Double
) As Brep
Parameters
faceIndex
Type: System.Int32
The index of the face to untrim.
tolerance
Type: System.Double
The tolerance. When in doubt, use the document's model absolute tolerance.
Return Value
Type: Brep
The untrimmed Brep if successful, null otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace