RhinoCommon API
Brep.CreateCurvatureAnalysisMesh Method (Brep, CurvatureAnalysisSettingsState, MeshingParameters)
 Creates an array of analysis meshes for the brep, one per face. The meshes are not set on the brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Mesh[] CreateCurvatureAnalysisMesh(
	Brep brep,
	CurvatureAnalysisSettingsState state,
	MeshingParameters meshingParameters
)
Public Shared Function CreateCurvatureAnalysisMesh (
	brep As Brep,
	state As CurvatureAnalysisSettingsState,
	meshingParameters As MeshingParameters
) As Mesh()
Parameters
brep
Type: Rhino.Geometry.Brep
The brep to mesh.
state
Type: Rhino.ApplicationSettings.CurvatureAnalysisSettingsState
Supplies the curvature style and the false color ranges.
meshingParameters
Type: Rhino.Geometry.MeshingParameters
The mesh density. RhinoDoc.GetAnalysisMeshingParameters returns what a document uses, and MeshingParameters.DefaultAnalysisMesh is the default.
Return Value
Type: Mesh[]
The analysis meshes. The array is empty if no mesh could be created.
Remarks
 Each mesh covers the untrimmed surface under a face, so on a trimmed face the mesh extends past the trims and any statistic taken from it includes area that is not part of the brep. For statistics, mesh the brep with MeshingParameters.ComputeCurvature set and pass the result to MeshCurvatureStats; the curvature values do not depend on the style, so one mesh serves every style.
See Also
Reference
Brep Class
CreateCurvatureAnalysisMesh Overload
Rhino.Geometry Namespace