RhinoCommon API
Panels.GetPanel Method (Guid, UInt32)
 Will return an instance of a .Net panel if the panel has been displayed at least once. Panel instances are not created until a panel is displayed.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Object GetPanel(
	Guid panelId,
	uint documentSerialNumber
)
Public Shared Function GetPanel (
	panelId As Guid,
	documentSerialNumber As UInteger
) As Object
Parameters
panelId
Type: System.Guid
 Class Id of the panel to search for.
documentSerialNumber
Type: System.UInt32
 Runtime document Id associated with the requested panel.
Return Value
Type: Object
 Returns the one and only instance of a panel if it has been properly registered and displayed at least once. If the panel has never been displayed then null will be returned even if the panel is properly registered.
See Also
Reference
Panels Class
GetPanel Overload
Rhino.UI Namespace