RhinoCommon API
Point2f.Division Operator
 Divides a Point2f by a scalar.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Point2f operator /(
	Point2f a,
	float b
)
Public Shared Operator / (
	a As Point2f,
	b As Single
) As Point2f
Parameters
a
Type: Rhino.Geometry.Point2f
First point.
b
Type: System.Single
Scalar.
Return Value
Type: Point2f
A divided Point2f.
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace