RhinoCommon API
Interop.FromOnMesh Method
 Copies a Rhino_DotNet mesh to a RhinoCommon mesh class.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Mesh FromOnMesh(
	Object source
)
Public Shared Function FromOnMesh (
	source As Object
) As Mesh
Parameters
source
Type: System.Object
 RMA.OpenNURBS.IOnMesh or RMA.OpenNURBS.OnMesh.
Return Value
Type: Mesh
 RhinoCommon object on success. This will be an independent copy.
See Also
Reference
Interop Class
Rhino.Runtime Namespace