RhinoCommon API
ViewCaptureWriter.PushClipPath Method (ViewCaptureWriter.PathPoint[])
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.PushClipPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[])"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected void PushClipPath(
	ViewCaptureWriter.PathPoint[] points
)
Protected Sub PushClipPath (
	points As ViewCaptureWriter.PathPoint()
)
Parameters
points
Type: Rhino.Runtime.ViewCaptureWriter.PathPoint[]
[Missing <param name="points"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.PushClipPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[])"]
See Also
Reference
ViewCaptureWriter Class
PushClipPath Overload
Rhino.Runtime Namespace