RhinoCommon API
MeshIntersectionCache Constructor
 Provides a mechanism for lazily evaluating mesh data. The implementation is private and subject to change.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public MeshIntersectionCache()
Public Sub New
See Also
Reference
MeshIntersectionCache Class
Rhino.Geometry.Intersect Namespace