RhinoCommon API
Interop.NativeNonConstPointer Method (RhinoViewport)
 Get CRhinoViewport* from a RhinoViewport instance
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static IntPtr NativeNonConstPointer(
	RhinoViewport viewport
)
Public Shared Function NativeNonConstPointer (
	viewport As RhinoViewport
) As IntPtr
Parameters
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Display.RhinoViewport)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Display.RhinoViewport)"]
See Also
Reference
Interop Class
NativeNonConstPointer Overload
Rhino.Runtime Namespace