RhinoCommon API
Intersection.MeshRays Method (Mesh, IEnumerable<Ray3d>, Boolean)
 Finds the first intersection of each one of a set of rays with a mesh.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static double[] MeshRays(
	Mesh mesh,
	IEnumerable<Ray3d> rays,
	bool multithreaded
)
Public Shared Function MeshRays (
	mesh As Mesh,
	rays As IEnumerable(Of Ray3d),
	multithreaded As Boolean
) As Double()
Parameters
mesh
Type: Rhino.Geometry.Mesh
A mesh to intersect.
rays
Type: System.Collections.Generic.IEnumerable<Ray3d>
The rays to cast.
multithreaded
Type: System.Boolean
True to cast the rays on several threads.
Return Value
Type: Double[]
 One value for each ray, in the order of the rays: the parameter along that ray of its first intersection with the mesh, or a value smaller than 0.0 where that ray does not meet the mesh. Null when the mesh or the set of rays is null.
See Also
Reference
Intersection Class
MeshRays Overload
Rhino.Geometry.Intersect Namespace