RhinoCommon API
SubDComponentParameter.Equals Method (Object)
Indicates whether this instance and a specified object are equal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
The object to compare with the current instance.
Return Value
Type: Boolean
true if obj and this instance are the same type and represent the same value; otherwise, false.
See Also
Reference
SubDComponentParameter Structure
Equals Overload
Rhino.Geometry Namespace