RhinoCommon API
GetEllipse Constructor
 Constructs a GetEllispe object.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public GetEllipse()
Public Sub New
See Also
Reference
GetEllipse Class
Rhino.Input.Custom Namespace