RhinoCommon API
Plane Constructor (Plane)
Copy constructor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Plane(
	Plane other
)
Public Sub New (
	other As Plane
)
Parameters
other
Type: Rhino.Geometry.Plane
The source plane value.
See Also
Reference
Plane Structure
Plane Overload
Rhino.Geometry Namespace