RhinoCommon API
Intersection.MeshPlane Method (Mesh, Plane)
 Intersects a mesh with an infinite plane. ZeroTolerance is used as fixed tolerance. We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient instaed.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Polyline[] MeshPlane(
	Mesh mesh,
	Plane plane
)
Public Shared Function MeshPlane (
	mesh As Mesh,
	plane As Plane
) As Polyline()
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to intersect.
plane
Type: Rhino.Geometry.Plane
Plane to intersect with.
Return Value
Type: Polyline[]
 An array of polylines describing the intersection loops, or null if no intersections could be found.
See Also
Reference
Intersection Class
MeshPlane Overload
Rhino.Geometry.Intersect Namespace