RhinoCommon API
NurbsCurvePointList.MakeRational Method
 Converts the curve to a Rational NURBS curve. Rational NURBS curves have weighted control points.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool MakeRational()
Public Function MakeRational As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace