RhinoCommon API
PythonScript.EvaluateExpression Method
 Evaluates statements and an expression in the main scripting context.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public abstract Object EvaluateExpression(
	string statements,
	string expression
)
Public MustOverride Function EvaluateExpression (
	statements As String,
	expression As String
) As Object
Parameters
statements
Type: System.String
One or several statements.
expression
Type: System.String
An expression.
Return Value
Type: Object
The expression result.
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace