RhinoCommon API
IsoDrawEffect Constructor
Initializes a new instance of the IsoDrawEffect class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IsoDrawEffect()
Public Sub New
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace