RhinoCommon API
Brep.CreateThickPipe Method (Curve, IEnumerable<Double>, IEnumerable<Double>, IEnumerable<Double>, Boolean, PipeCapMode, Boolean, Double, Double)
 Creates a double-walled pipe.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Brep[] CreateThickPipe(
	Curve rail,
	IEnumerable<double> railRadiiParameters,
	IEnumerable<double> radii0,
	IEnumerable<double> radii1,
	bool localBlending,
	PipeCapMode cap,
	bool fitRail,
	double absoluteTolerance,
	double angleToleranceRadians
)
Public Shared Function CreateThickPipe (
	rail As Curve,
	railRadiiParameters As IEnumerable(Of Double),
	radii0 As IEnumerable(Of Double),
	radii1 As IEnumerable(Of Double),
	localBlending As Boolean,
	cap As PipeCapMode,
	fitRail As Boolean,
	absoluteTolerance As Double,
	angleToleranceRadians As Double
) As Brep()
Parameters
rail
Type: Rhino.Geometry.Curve
The rail, or path, curve.
railRadiiParameters
Type: System.Collections.Generic.IEnumerable<Double>
 One or more normalized curve parameters where changes in radius occur. Important: curve parameters must be normalized - ranging between 0.0 and 1.0. Use Interval.NormalizedParameterAt to calculate these.
radii0
Type: System.Collections.Generic.IEnumerable<Double>
 One or more radii for the first wall - one at each normalized curve parameter in railRadiiParameters.
radii1
Type: System.Collections.Generic.IEnumerable<Double>
 One or more radii for the second wall - one at each normalized curve parameter in railRadiiParameters.
localBlending
Type: System.Boolean
 The shape blending. If True, Local (pipe radius stays constant at the ends and changes more rapidly in the middle) is applied. If False, Global (radius is linearly blended from one end to the other, creating pipes that taper from one radius to the other) is applied.
cap
Type: Rhino.Geometry.PipeCapMode
The end cap mode.
fitRail
Type: System.Boolean
 If the curve is a polycurve of lines and arcs, the curve is fit and a single surface is created; otherwise the result is a Brep with joined surfaces created from the polycurve segments.
absoluteTolerance
Type: System.Double
 The sweeping and fitting tolerance. When in doubt, use the document's absolute tolerance.
angleToleranceRadians
Type: System.Double
 The angle tolerance. When in doubt, use the document's angle tolerance in radians.
Return Value
Type: Brep[]
Array of Breps success.
See Also
Reference
Brep Class
CreateThickPipe Overload
Rhino.Geometry Namespace