RhinoCommon API
Transform.Multiply Operator (Transform, Vector3d)
 Multiplies a transformation by a vector and gets a new vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector3d operator *(
	Transform m,
	Vector3d v
)
Public Shared Operator * (
	m As Transform,
	v As Vector3d
) As Vector3d
Parameters
m
Type: Rhino.Geometry.Transform
A transformation.
v
Type: Rhino.Geometry.Vector3d
A vector.
Return Value
Type: Vector3d
The transformed vector.
Remarks
 Note well: The right hand column and bottom row have an important effect when transforming a Euclidean point and have no effect when transforming a vector. Be sure you understand the differences between vectors and points when applying a 4x4 transformation.
See Also
Reference
Transform Structure
Multiply Overload
Rhino.Geometry Namespace