RhinoCommon API
Curve.RibbonOffset Method (RibbonOffsetParameters, Curve[], Curve[], Brep[])
 Ribbon offset method to mimic RibbonOffset command
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public Curve RibbonOffset(
	RibbonOffsetParameters ribbonParameters,
	out Curve[] railCurves,
	out Curve[] crossSectionCurves,
	out Brep[] brepSurfaces
)
Public Function RibbonOffset (
	ribbonParameters As RibbonOffsetParameters,
	<OutAttribute> ByRef railCurves As Curve(),
	<OutAttribute> ByRef crossSectionCurves As Curve(),
	<OutAttribute> ByRef brepSurfaces As Brep()
) As Curve
Parameters
ribbonParameters
Type: Rhino.Geometry.RibbonOffsetParameters
The ribbon offset parameters
railCurves
Type: Rhino.Geometry.Curve[]
on success an array of split curves representing the sweep rail segments, null on failure
crossSectionCurves
Type: Rhino.Geometry.Curve[]
on success an array of cross section curves used during brep creation, null on failure
brepSurfaces
Type: Rhino.Geometry.Brep[]
on success and array of breps representing the ribbon surfaces, null on failure
Return Value
Type: Curve
return an offset curve on success, null on failure
See Also
Reference
Curve Class
RibbonOffset Overload
Rhino.Geometry Namespace