RhinoCommon API
Circle.Transform Method
 Transforms this circle using an transformation matrix.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to apply.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
 Circles may not be transformed accurately if the transformation defines a non-euclidean transformation.
See Also
Reference
Circle Structure
Rhino.Geometry Namespace