RhinoCommon API
RenderTexture.NewBitmapTexture Method (SimulatedTexture)
Note: This API is now obsolete.
 Constructs a new basic texture from a SimulatedTexture.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
[ObsoleteAttribute]
public static RenderTexture NewBitmapTexture(
	SimulatedTexture texture
)
<ObsoleteAttribute>
Public Shared Function NewBitmapTexture (
	texture As SimulatedTexture
) As RenderTexture
Parameters
texture
Type: Rhino.Render.SimulatedTexture
The texture to create the basic texture from.
Return Value
Type: RenderTexture
A new render texture.
See Also
Reference
RenderTexture Class
NewBitmapTexture Overload
Rhino.Render Namespace