RhinoCommon API
ContentUndoHelper.TweakContent Method
 Call this before tweaking a single content parameter. Undo will cause the parameter to be restored.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TweakContent(
	RenderContent content,
	string parameterName
)
Public Function TweakContent (
	content As RenderContent,
	parameterName As String
) As Boolean
Parameters
content
Type: Rhino.Render.RenderContent
The render content
parameterName
Type: System.String
The parameter name you are about to change.
Return Value
Type: Boolean
true if the content was tweaked.
See Also
Reference
ContentUndoHelper Class
Rhino.Render Namespace