RhinoCommon API
HostUtils.ExceptionReport Method (Exception)
 Informs RhinoCommon of an exception that has been handled but that the developer wants to screen.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void ExceptionReport(
	Exception ex
)
Public Shared Sub ExceptionReport (
	ex As Exception
)
Parameters
ex
Type: System.Exception
An exception.
See Also
Reference
HostUtils Class
ExceptionReport Overload
Rhino.Runtime Namespace