RhinoCommon API
Quaternion.Distance Method
 Returns the distance or norm of the difference between two quaternions.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static double Distance(
	Quaternion p,
	Quaternion q
)
Public Shared Function Distance (
	p As Quaternion,
	q As Quaternion
) As Double
Parameters
p
Type: Rhino.Geometry.Quaternion
A quaternion.
q
Type: Rhino.Geometry.Quaternion
Another quaternion.
Return Value
Type: Double
(p - q).Length()
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace