RhinoCommon API
LengthValue.Create Method (Double, LengthUnit, LengthValue.StringFormat)
Create from Length and LengthUnit
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static LengthValue Create(
	double length,
	LengthUnit units,
	LengthValue.StringFormat format
)
Public Shared Function Create (
	length As Double,
	units As LengthUnit,
	format As LengthValue.StringFormat
) As LengthValue
Parameters
length
Type: System.Double
Numeric length value
units
Type: Rhino.LengthUnit
Length units
format
Type: Rhino.LengthValue.StringFormat
[Missing <param name="format"/> documentation for "M:Rhino.LengthValue.Create(System.Double,Rhino.LengthUnit,Rhino.LengthValue.StringFormat)"]
Return Value
Type: LengthValue
[Missing <returns> documentation for "M:Rhino.LengthValue.Create(System.Double,Rhino.LengthUnit,Rhino.LengthValue.StringFormat)"]
See Also
Reference
LengthValue Class
Create Overload
Rhino Namespace