RhinoCommon API
Mesh.DuplicateMesh Method
Constructs a copy of this mesh. This is the same as Duplicate().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Mesh DuplicateMesh()
Public Function DuplicateMesh As Mesh
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.DuplicateMesh"]
See Also
Reference
Mesh Class
Rhino.Geometry Namespace