RhinoCommon API
MetaData Constructor
Initializes a new instance of the MetaData class
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public MetaData(
	IntPtr pMetaData
)
Public Sub New (
	pMetaData As IntPtr
)
Parameters
pMetaData
Type: System.IntPtr
[Missing <param name="pMetaData"/> documentation for "M:Rhino.Render.DataSources.MetaData.#ctor(System.IntPtr)"]
See Also
Reference
MetaData Class
Rhino.Render.DataSources Namespace