RhinoCommon API
DisplayAttributeMaterial.RemoveTexture Method
 Removes every texture of the given type.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool RemoveTexture(
	TextureType which
)
Public Function RemoveTexture (
	which As TextureType
) As Boolean
Parameters
which
Type: Rhino.DocObjects.TextureType
 The texture type. None removes nothing.
Return Value
Type: Boolean
true when a texture was removed.
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace