RhinoCommon API
Polyline.RemoveNearlyEqualSubsequentPoints Method
 Removes one copy of a point that is equal to the previous or later point, by an absolute tolerance factor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public void RemoveNearlyEqualSubsequentPoints(
	double tolerance
)
Public Sub RemoveNearlyEqualSubsequentPoints (
	tolerance As Double
)
Parameters
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.Polyline.RemoveNearlyEqualSubsequentPoints(System.Double)"]
See Also
Reference
Polyline Class
Rhino.Geometry Namespace