RhinoCommon API
Mesh.ComputeThickness Method (IEnumerable<Mesh>, Double)
 Compute thickness metrics for this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static MeshThicknessMeasurement[] ComputeThickness(
	IEnumerable<Mesh> meshes,
	double maximumThickness
)
Public Shared Function ComputeThickness (
	meshes As IEnumerable(Of Mesh),
	maximumThickness As Double
) As MeshThicknessMeasurement()
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
Meshes to include in thickness analysis.
maximumThickness
Type: System.Double
Maximum thickness to consider. Use as small a thickness as possible to speed up the solver.
Return Value
Type: MeshThicknessMeasurement[]
Array of thickness measurements.
See Also
Reference
Mesh Class
ComputeThickness Overload
Rhino.Geometry Namespace