RhinoCommon API
LengthUnit.ToUnitSystem Method (Double, ISet<UnitSystem>)
 Returns the most similar UnitSystem to this instance available on unitSystems set.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UnitSystem? ToUnitSystem(
	out double factor,
	ISet<UnitSystem> unitSystems
)
Public Function ToUnitSystem (
	<OutAttribute> ByRef factor As Double,
	unitSystems As ISet(Of UnitSystem)
) As UnitSystem?
Parameters
factor
Type: System.Double
unitSystems
Type: System.Collections.Generic.ISet<UnitSystem>
Return Value
Type: Nullable<UnitSystem>
A UnitSystem in the provided set of available unitSystems.
See Also
Reference
LengthUnit Structure
ToUnitSystem Overload
Rhino Namespace