RhinoCommon API
IsoDrawEffect.GetBandColor Method
[Missing <summary> documentation for "M:Rhino.Display.IsoDrawEffect.GetBandColor(System.Int32)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color GetBandColor(
	int index
)
Public Function GetBandColor (
	index As Integer
) As Color
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Display.IsoDrawEffect.GetBandColor(System.Int32)"]
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.Display.IsoDrawEffect.GetBandColor(System.Int32)"]
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace