RhinoCommon API
IRhinoUiDialogService.ShowComboListBox Method
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowComboListBox(System.String,System.String,System.Collections.IList)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
Object ShowComboListBox(
	string title,
	string message,
	IList items
)
Function ShowComboListBox (
	title As String,
	message As String,
	items As IList
) As Object
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowComboListBox(System.String,System.String,System.Collections.IList)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowComboListBox(System.String,System.String,System.Collections.IList)"]
items
Type: System.Collections.IList
[Missing <param name="items"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowComboListBox(System.String,System.String,System.Collections.IList)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowComboListBox(System.String,System.String,System.Collections.IList)"]
See Also
Reference
IRhinoUiDialogService Interface
Rhino.UI Namespace