RhinoCommon API
UserInterfaceObjectBase.OnMouseMove Method
 Called when the mouse is moved
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnMouseMove(
	MouseState mouse
)
Protected Overridable Sub OnMouseMove (
	mouse As MouseState
)
Parameters
mouse
Type: Rhino.UI.MouseState
[Missing <param name="mouse"/> documentation for "M:Rhino.UI.UserInterfaceObjectBase.OnMouseMove(Rhino.UI.MouseState)"]
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace