RhinoCommon API
SupportOptions.Libraries_InitialLocationCustomFolder Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.Libraries_InitialLocationCustomFolder"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string Libraries_InitialLocationCustomFolder()
Public Shared Function Libraries_InitialLocationCustomFolder As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.Libraries_InitialLocationCustomFolder"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace