RhinoCommon API
Point3dGrid Constructor
 Initializes a rectangular grid of points, with no points in it.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3dGrid()
Public Sub New
See Also
Reference
Point3dGrid Class
Point3dGrid Overload
Rhino.Geometry Namespace