RhinoCommon API
Interval.Expand Method
 Expand an interval by adding the value to T1 and subtracting it from T0. If T1 < T0, T0 and T1 are swapped.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Expand(
	double value
)
Public Sub Expand (
	value As Double
)
Parameters
value
Type: System.Double
[Missing <param name="value"/> documentation for "M:Rhino.Geometry.Interval.Expand(System.Double)"]
See Also
Reference
Interval Structure
Rhino.Geometry Namespace