RhinoCommon API
FileCsvDocument.TryGetColor Method (String, Int32, Color)
 Retrieves the value of a cell as a color, addressing the column by header name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetColor(
	string column,
	int row,
	out Color value
)
Public Function TryGetColor (
	column As String,
	row As Integer,
	<OutAttribute> ByRef value As Color
) As Boolean
Parameters
column
Type: System.String
The header name of the column.
row
Type: System.Int32
The zero-based data-row index (y).
value
Type: System.Drawing.Color
The parsed value, or Empty if the column or cell does not exist or cannot be parsed.
Return Value
Type: Boolean
true if the column and cell exist and were parsed; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetColor Overload
Rhino.FileIO Namespace