RhinoCommon API
FileEps.Read Method
Read a Eps file into a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	FileEpsReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As FileEpsReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.FileEpsReadOptions
options used for importing the Ai file
Return Value
Type: Boolean
true on success
See Also
Reference
FileEps Class
Rhino.FileIO Namespace