RhinoCommon API
ZBufferCapture.ShowPoints Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowPoints(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public void ShowPoints(
	bool on
)
Public Sub ShowPoints (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowPoints(System.Boolean)"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace