RhinoCommon API
Squisher.Is2dPatternSquished Method
 Returns true if the input geometry was the result of a squish operation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public static bool Is2dPatternSquished(
	GeometryBase geometry
)
Public Shared Function Is2dPatternSquished (
	geometry As GeometryBase
) As Boolean
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
[Missing <param name="geometry"/> documentation for "M:Rhino.Geometry.Squisher.Is2dPatternSquished(Rhino.Geometry.GeometryBase)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Squisher.Is2dPatternSquished(Rhino.Geometry.GeometryBase)"]
See Also
Reference
Squisher Class
Rhino.Geometry Namespace