RhinoCommon API
EndAnalysisSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static EndAnalysisSettingsState GetDefaultState()
Public Shared Function GetDefaultState As EndAnalysisSettingsState
Return Value
Type: EndAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.EndAnalysisSettings.GetDefaultState"]
See Also
Reference
EndAnalysisSettings Class
Rhino.ApplicationSettings Namespace