RhinoCommon API
RhinoObject.TryGetGumballFrameForCurrentAlignment Method
 Gets the gumball frame for this object under the current gumball alignment mode (Object / World / CPlane). For Object mode the frame always reflects the object's orientation (including any user relocation in that mode). For World and CPlane mode the frame is only returned when the user has manually repositioned the gumball for this object; if it has never been moved in that mode, the method returns false. Sub-object selections are not taken into account; this is a whole-object helper.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetGumballFrameForCurrentAlignment(
	out GumballFrame frame
)
Public Function TryGetGumballFrameForCurrentAlignment (
	<OutAttribute> ByRef frame As GumballFrame
) As Boolean
Parameters
frame
Type: Rhino.UI.Gumball.GumballFrame
The gumball frame for the current alignment mode.
Return Value
Type: Boolean
 true if a frame is available for the current alignment mode; false when the gumball has not been repositioned in the active World or CPlane mode.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace