RhinoCommon API
ArchivableDictionary.Set Method (String, Byte)
 Sets a Byte.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Set(
	string key,
	byte val
)
Public Function Set (
	key As String,
	val As Byte
) As Boolean
Parameters
key
Type: System.String
The text key.
val
Type: System.Byte
A Byte.
Because Byte has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
true if set operation succeeded, otherwise false.
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace