RhinoCommon API
PointCloud Constructor
 Initializes a new instance of the PointCloud class that is empty.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PointCloud()
Public Sub New
See Also
Reference
PointCloud Class
PointCloud Overload
Rhino.Geometry Namespace