RhinoCommon API
SimpleArrayBinaryArchiveReader Constructor (IntPtr)
 Initializes a new SimpleArrayBinaryArchiveReader class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public SimpleArrayBinaryArchiveReader(
	IntPtr p
)
Public Sub New (
	p As IntPtr
)
Parameters
p
Type: System.IntPtr
[Missing <param name="p"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.#ctor(System.IntPtr)"]
See Also
Reference
SimpleArrayBinaryArchiveReader Class
SimpleArrayBinaryArchiveReader Overload
Rhino.Runtime.InteropWrappers Namespace