RhinoCommon API
Brep.ChangeSeam Method
 Change the seam of a closed trimmed surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public static Brep ChangeSeam(
	BrepFace face,
	int direction,
	double parameter,
	double tolerance
)
Public Shared Function ChangeSeam (
	face As BrepFace,
	direction As Integer,
	parameter As Double,
	tolerance As Double
) As Brep
Parameters
face
Type: Rhino.Geometry.BrepFace
A Brep face with a closed underlying surface.
direction
Type: System.Int32
The parameter direction (0 = U, 1 = V). The face's underlying surface must be closed in this direction.
parameter
Type: System.Double
The parameter at which to place the seam.
tolerance
Type: System.Double
Tolerance used to cut up surface.
Return Value
Type: Brep
A new Brep that has the same geometry as the face with a relocated seam if successful, or null on failure.
See Also
Reference
Brep Class
Rhino.Geometry Namespace