RhinoCommon API
Layer.SetPersistentVisibility Method
 Set the global persistent visibility setting for this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.5
Syntax
public void SetPersistentVisibility(
	bool persistentVisibility
)
Public Sub SetPersistentVisibility (
	persistentVisibility As Boolean
)
Parameters
persistentVisibility
Type: System.Boolean
[Missing <param name="persistentVisibility"/> documentation for "M:Rhino.DocObjects.Layer.SetPersistentVisibility(System.Boolean)"]
See Also
Reference
Layer Class
Rhino.DocObjects Namespace