RhinoCommon API
SimpleArrayGuidPointer.ToArray Method
 Returns the managed counterpart of the unmanaged array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid[] ToArray()
Public Function ToArray As Guid()
Return Value
Type: Guid[]
The managed array.
See Also
Reference
SimpleArrayGuidPointer Class
Rhino.Runtime.InteropWrappers Namespace