RhinoCommon API
RhinoDoc.FormatNumber Method (Double, Boolean, Boolean)
 Call this method to get string representing the specified value using the documents display coordinate system and display precision.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string FormatNumber(
	double value,
	bool appendUnitSystemName,
	bool abbreviate
)
Public Function FormatNumber (
	value As Double,
	appendUnitSystemName As Boolean,
	abbreviate As Boolean
) As String
Parameters
value
Type: System.Double
[Missing <param name="value"/> documentation for "M:Rhino.RhinoDoc.FormatNumber(System.Double,System.Boolean,System.Boolean)"]
appendUnitSystemName
Type: System.Boolean
[Missing <param name="appendUnitSystemName"/> documentation for "M:Rhino.RhinoDoc.FormatNumber(System.Double,System.Boolean,System.Boolean)"]
abbreviate
Type: System.Boolean
[Missing <param name="abbreviate"/> documentation for "M:Rhino.RhinoDoc.FormatNumber(System.Double,System.Boolean,System.Boolean)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.RhinoDoc.FormatNumber(System.Double,System.Boolean,System.Boolean)"]
See Also
Reference
RhinoDoc Class
FormatNumber Overload
Rhino Namespace