RhinoCommon API
Mesh.SetCachedTextureCoordinatesFromMaterial Method
 Sets up cached texture coordinate set for each texture in the material. Textures in the Material define which mapping channels are used and the RhinoObject defines what texture mapping is used for each mapping channel. After this method is called all necessary texture coordinate sets are cached and correct texture coordinates for each texture can be fetched using GetCachedTextureCoordinates(RhinoObject rhinoObject, Rhino.DocObjects.Texture texture) If any texture coordinates are already cached they will not be re-computed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public void SetCachedTextureCoordinatesFromMaterial(
	RhinoObject rhinoObject,
	Material material
)
Public Sub SetCachedTextureCoordinatesFromMaterial (
	rhinoObject As RhinoObject,
	material As Material
)
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
RhinoObject that defines texture mappings
material
Type: Rhino.DocObjects.Material
Material with textures that define mapping channels
See Also
Reference
Mesh Class
Rhino.Geometry Namespace