RhinoCommon API
Panels.OpenPanel Method (Guid, Guid, Boolean)
 In Mac Rhino this will just call the version of OpenPanel that takes a class type Id. In Windows Rhino this will look for a dock bar with the specified Id and open or move the specified panel to that dock bar.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid OpenPanel(
	Guid dockBarId,
	Guid panelId,
	bool makeSelectedPanel
)
Public Shared Function OpenPanel (
	dockBarId As Guid,
	panelId As Guid,
	makeSelectedPanel As Boolean
) As Guid
Parameters
dockBarId
Type: System.Guid
 Id of the dock bar hosting one or more panels.
panelId
Type: System.Guid
 Class type Id for the panel to open.
makeSelectedPanel
Type: System.Boolean
 If true then the panel is set as the active tab after opening it otherwise; the panel is opened but not set as the active tab.
Return Value
Type: Guid
 Returns true if the
See Also
Reference
Panels Class
OpenPanel Overload
Rhino.UI Namespace