RhinoCommon API
RenderPipeline.GetRenderWindow Method
 Get the RenderWindow associated with this RenderPipeline instance. This is virtual rather than abstract for V5 compat
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RenderWindow GetRenderWindow()
Public Function GetRenderWindow As RenderWindow
Return Value
Type: RenderWindow
RenderWindow if one exists, null otherwise (i.e. rendering has already completed).
See Also
Reference
RenderPipeline Class
GetRenderWindow Overload
Rhino.Render Namespace