RhinoCommon API
PersistentSettingsEventArgs Constructor
Initializes a new instance of the PersistentSettingsEventArgs class
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected PersistentSettingsEventArgs()
Protected Sub New
See Also
Reference
PersistentSettingsEventArgs Class
Rhino Namespace