RhinoCommon API
ChangeQueue.ApplyMeshChanges Method
 Override this when you want to handle mesh changes.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplyMeshChanges(
	Guid[] deleted,
	List<Mesh> added
)
Protected Overridable Sub ApplyMeshChanges (
	deleted As Guid(),
	added As List(Of Mesh)
)
Parameters
deleted
Type: System.Guid[]
List of Guids to meshes that have been deleted
added
Type: System.Collections.Generic.List<Mesh>
List of ChangeQueueMeshes that have been added or changed
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace