RhinoCommon API
RenderTexture.SimulatedTexture Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.SimulatedTexture(Rhino.Render.RenderTexture.TextureGeneration,System.Int32,Rhino.DocObjects.RhinoObject)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual SimulatedTexture SimulatedTexture(
	RenderTexture.TextureGeneration tg,
	int size = -1,
	RhinoObject obj = null
)
Public Overridable Function SimulatedTexture (
	tg As RenderTexture.TextureGeneration,
	Optional size As Integer = -1,
	Optional obj As RhinoObject = Nothing
) As SimulatedTexture
Parameters
tg
Type: Rhino.Render.RenderTexture.TextureGeneration
[Missing <param name="tg"/> documentation for "M:Rhino.Render.RenderTexture.SimulatedTexture(Rhino.Render.RenderTexture.TextureGeneration,System.Int32,Rhino.DocObjects.RhinoObject)"]
size (Optional)
Type: System.Int32
[Missing <param name="size"/> documentation for "M:Rhino.Render.RenderTexture.SimulatedTexture(Rhino.Render.RenderTexture.TextureGeneration,System.Int32,Rhino.DocObjects.RhinoObject)"]
obj (Optional)
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="obj"/> documentation for "M:Rhino.Render.RenderTexture.SimulatedTexture(Rhino.Render.RenderTexture.TextureGeneration,System.Int32,Rhino.DocObjects.RhinoObject)"]
Return Value
Type: SimulatedTexture
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.SimulatedTexture(Rhino.Render.RenderTexture.TextureGeneration,System.Int32,Rhino.DocObjects.RhinoObject)"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace