RhinoCommon API
SafeFrame.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.SafeFrame.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
SafeFrame Class
Rhino.Render Namespace