RhinoCommon API
Curve.CreateBooleanUnion Method (IEnumerable<Curve>, Double)
 Calculates the boolean union of two or more closed, planar curves. Note, curves must be co-planar.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Curve[] CreateBooleanUnion(
	IEnumerable<Curve> curves,
	double tolerance
)
Public Shared Function CreateBooleanUnion (
	curves As IEnumerable(Of Curve),
	tolerance As Double
) As Curve()
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
The co-planar curves to union.
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.Curve.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)"]
Return Value
Type: Curve[]
Result curves on success, empty array if no union could be calculated.
See Also
Reference
Curve Class
CreateBooleanUnion Overload
Rhino.Geometry Namespace