RhinoCommon API
DisplayPipeline.Draw2dLine Method (Point2f, Point2f, DisplayPen)
 Draws a line whose coordinates are viewport pixels rather than world units. The origin is the top left of the frame, with y increasing downwards - the same space Draw2dText and DrawBitmap work in.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Draw2dLine(
	Point2f from,
	Point2f to,
	DisplayPen pen
)
Public Sub Draw2dLine (
	from As Point2f,
	to As Point2f,
	pen As DisplayPen
)
Parameters
from
Type: Rhino.Geometry.Point2f
Start of the line, in screen coordinates.
to
Type: Rhino.Geometry.Point2f
End of the line, in screen coordinates.
pen
Type: Rhino.Display.DisplayPen
Pen to stroke the line with.
See Also
Reference
DisplayPipeline Class
Draw2dLine Overload
Rhino.Display Namespace