RhinoCommon API
Transform.TransformBoundingBox Method
 Computes a new bounding box that is the smallest axis aligned bounding box that contains the transformed result of its 8 original corner points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox TransformBoundingBox(
	BoundingBox bbox
)
Public Function TransformBoundingBox (
	bbox As BoundingBox
) As BoundingBox
Parameters
bbox
Type: Rhino.Geometry.BoundingBox
[Missing <param name="bbox"/> documentation for "M:Rhino.Geometry.Transform.TransformBoundingBox(Rhino.Geometry.BoundingBox)"]
Return Value
Type: BoundingBox
A new bounding box.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace