RhinoCommon API
RhinoDoc.BeginUndoRecord Method
 Instructs Rhino to begin recording undo information when the document is changed outside of a command. We use this, e.g., to save changes caused by the modeless layer or object properties dialogs when commands are not running.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public uint BeginUndoRecord(
	string description
)
Public Function BeginUndoRecord (
	description As String
) As UInteger
Parameters
description
Type: System.String
A text describing the record.
Return Value
Type: UInt32
 Serial number of record. Returns 0 if record is not started because undo information is already being recorded or undo is disabled.
See Also
Reference
RhinoDoc Class
Rhino Namespace