RhinoCommon API
Extrusion.GetProfileTransformation Method
 Gets the transformation that maps the XY profile curve to its 3d location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Transform GetProfileTransformation(
	double s
)
Public Function GetProfileTransformation (
	s As Double
) As Transform
Parameters
s
Type: System.Double
 0.0 = starting profile 1.0 = ending profile.
Return Value
Type: Transform
A Transformation. The transform is Invalid on failure.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace