RhinoCommon API
ChangeQueue.ApplySunChanges Method
 Override this when you want to handle sun changes
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplySunChanges(
	Light sun
)
Protected Overridable Sub ApplySunChanges (
	sun As Light
)
Parameters
sun
Type: Rhino.Geometry.Light
[Missing <param name="sun"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplySunChanges(Rhino.Geometry.Light)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace