RhinoCommon API
ViewSettings.GetCurrentState Method
 Gets the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static ViewSettingsState GetCurrentState()
Public Shared Function GetCurrentState As ViewSettingsState
Return Value
Type: ViewSettingsState
A new view state with current settings.
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace