RhinoCommon API
IDialogService.ObjectToWindowHandle Method
[Missing <summary> documentation for "M:Rhino.UI.IDialogService.ObjectToWindowHandle(System.Object,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
IntPtr ObjectToWindowHandle(
	Object window,
	bool useMainRhinoWindowWhenNull
)
Function ObjectToWindowHandle (
	window As Object,
	useMainRhinoWindowWhenNull As Boolean
) As IntPtr
Parameters
window
Type: System.Object
[Missing <param name="window"/> documentation for "M:Rhino.UI.IDialogService.ObjectToWindowHandle(System.Object,System.Boolean)"]
useMainRhinoWindowWhenNull
Type: System.Boolean
[Missing <param name="useMainRhinoWindowWhenNull"/> documentation for "M:Rhino.UI.IDialogService.ObjectToWindowHandle(System.Object,System.Boolean)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.IDialogService.ObjectToWindowHandle(System.Object,System.Boolean)"]
See Also
Reference
IDialogService Interface
Rhino.UI Namespace