RhinoCommon API
PythonScript.SetIntellisenseVariable Method
 Sets a variable for runtime introspection.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual void SetIntellisenseVariable(
	string name,
	Object value
)
Public Overridable Sub SetIntellisenseVariable (
	name As String,
	value As Object
)
Parameters
name
Type: System.String
A variable name.
value
Type: System.Object
A variable value.
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace