RhinoCommon API
HostUtils.GetCustomComputeEndpoints Method
 Used by compute to define custom endpoints
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Tuple<string, Type>[] GetCustomComputeEndpoints()
Public Shared Function GetCustomComputeEndpoints As Tuple(Of String, Type)()
Return Value
Type: Tuple<String, Type>[]
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.GetCustomComputeEndpoints"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace