RhinoCommon API
RenderContent.RenderHashExclude Method (CrcRenderHashFlags, String, LinearWorkflow)
 As RenderHash, but allows you to specify flags and exclude specific parameters. Use this version of the function to calculate a render hash when you have the linear workflow information and you are not running on the main thread. Access to LinearWorkflow data requires document access. CrcRenderHashFlags.ExcludeLinearWorkflow must be specified.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public uint RenderHashExclude(
	CrcRenderHashFlags flags,
	string excludeParameterNames,
	LinearWorkflow lw
)
Public Function RenderHashExclude (
	flags As CrcRenderHashFlags,
	excludeParameterNames As String,
	lw As LinearWorkflow
) As UInteger
Parameters
flags
Type: Rhino.Render.CrcRenderHashFlags
Flags to finely control the render hash.
excludeParameterNames
Type: System.String
Semicolon-delimited string of parameter names to exclude.
lw
Type: Rhino.Render.LinearWorkflow
Linear Workflow to use.
Return Value
Type: UInt32
The render hash.
See Also
Reference
RenderContent Class
RenderHashExclude Overload
Rhino.Render Namespace