RhinoCommon API
ViewCaptureWriter.SupportsArc Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.SupportsArc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool SupportsArc()
Protected Overridable Function SupportsArc As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.ViewCaptureWriter.SupportsArc"]
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace