RhinoCommon API
DisplayPointSet.Dispose Method
Releases all resources used by the DisplayPointSet
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
DisplayPointSet Class
Rhino.Display Namespace