RhinoCommon API
TextFields.UserText Method (String, String, String, String)
 User text associated with an object, block or layout
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string UserText(
	string id,
	string key,
	string prompt,
	string defaultValue
)
Public Shared Function UserText (
	id As String,
	key As String,
	prompt As String,
	defaultValue As String
) As String
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.UserText(System.String,System.String,System.String,System.String)"]
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Runtime.TextFields.UserText(System.String,System.String,System.String,System.String)"]
prompt
Type: System.String
[Missing <param name="prompt"/> documentation for "M:Rhino.Runtime.TextFields.UserText(System.String,System.String,System.String,System.String)"]
defaultValue
Type: System.String
[Missing <param name="defaultValue"/> documentation for "M:Rhino.Runtime.TextFields.UserText(System.String,System.String,System.String,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.UserText(System.String,System.String,System.String,System.String)"]
See Also
Reference
TextFields Class
UserText Overload
Rhino.Runtime Namespace