RhinoCommon API
PreviewSceneServer.ApplyRotation Method
 Set Scene Server Rotation
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void ApplyRotation(
	double X,
	double Y,
	IRhRdkPreviewSceneServer_eRotationType type
)
Public Sub ApplyRotation (
	X As Double,
	Y As Double,
	type As IRhRdkPreviewSceneServer_eRotationType
)
Parameters
X
Type: System.Double
[Missing <param name="X"/> documentation for "M:Rhino.Render.PreviewSceneServer.ApplyRotation(System.Double,System.Double,Rhino.Render.IRhRdkPreviewSceneServer_eRotationType)"]
Y
Type: System.Double
[Missing <param name="Y"/> documentation for "M:Rhino.Render.PreviewSceneServer.ApplyRotation(System.Double,System.Double,Rhino.Render.IRhRdkPreviewSceneServer_eRotationType)"]
type
Type: Rhino.Render.IRhRdkPreviewSceneServer_eRotationType
[Missing <param name="type"/> documentation for "M:Rhino.Render.PreviewSceneServer.ApplyRotation(System.Double,System.Double,Rhino.Render.IRhRdkPreviewSceneServer_eRotationType)"]
See Also
Reference
PreviewSceneServer Class
Rhino.Render Namespace