RhinoCommon API
RealtimeDisplayMode.HudShowPasses Method
 Override to show current pass in HUD. By default disabled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool HudShowPasses()
Public Overridable Function HudShowPasses As Boolean
Return Value
Type: Boolean
Return true to show current pass in HUD.
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace