RhinoCommon API
Mesh.Reduce Method (ReduceMeshParameters)
Reduce polygon count
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Reduce(
	ReduceMeshParameters parameters
)
Public Function Reduce (
	parameters As ReduceMeshParameters
) As Boolean
Parameters
parameters
Type: Rhino.Geometry.ReduceMeshParameters
Parameters
Return Value
Type: Boolean
True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
See Also
Reference
Mesh Class
Reduce Overload
Rhino.Geometry Namespace