RhinoCommon API
Curve.IsShort Method (Double, Interval)
Used to quickly find short curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsShort(
	double tolerance,
	Interval subdomain
)
Public Function IsShort (
	tolerance As Double,
	subdomain As Interval
) As Boolean
Parameters
tolerance
Type: System.Double
Length threshold value for "shortness".
subdomain
Type: Rhino.Geometry.Interval
 The test is performed on the interval that is the intersection of sub-domain with Domain()
Return Value
Type: Boolean
true if the length of the curve is <= tolerance.
Remarks
Faster than calling Length() and testing the result.
See Also
Reference
Curve Class
IsShort Overload
Rhino.Geometry Namespace