RhinoCommon API
Circle.PointAt Method
 Circles use trigonometric parameterization: t -> center + cos(t)*radius*xaxis + sin(t)*radius*yaxis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d PointAt(
	double t
)
Public Function PointAt (
	t As Double
) As Point3d
Parameters
t
Type: System.Double
Parameter of point to evaluate.
Return Value
Type: Point3d
The point on the circle at the given parameter.
See Also
Reference
Circle Structure
Rhino.Geometry Namespace