RhinoCommon API
IRhRdkThumbnailList.GetGridMetrics Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.GetGridMetrics(System.Int32@,System.Int32@,System.Int32@,System.Int32@)"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void GetGridMetrics(
	ref int w,
	ref int h,
	ref int ox,
	ref int oy
)
Sub GetGridMetrics (
	ByRef w As Integer,
	ByRef h As Integer,
	ByRef ox As Integer,
	ByRef oy As Integer
)
Parameters
w
Type: System.Int32
[Missing <param name="w"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.GetGridMetrics(System.Int32@,System.Int32@,System.Int32@,System.Int32@)"]
h
Type: System.Int32
[Missing <param name="h"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.GetGridMetrics(System.Int32@,System.Int32@,System.Int32@,System.Int32@)"]
ox
Type: System.Int32
[Missing <param name="ox"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.GetGridMetrics(System.Int32@,System.Int32@,System.Int32@,System.Int32@)"]
oy
Type: System.Int32
[Missing <param name="oy"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.GetGridMetrics(System.Int32@,System.Int32@,System.Int32@,System.Int32@)"]
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace