RhinoCommon API
CustomRenderContentAttribute Constructor (String, Boolean, String, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
Initializes a new instance of the CustomRenderContentAttribute class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.16
Syntax
public CustomRenderContentAttribute(
	string renderEngineGuid,
	bool imageBased,
	string category,
	bool is_elevated,
	bool is_built_in,
	bool is_private,
	bool is_linear,
	bool is_hdrcapable,
	bool is_normalmap
)
Public Sub New (
	renderEngineGuid As String,
	imageBased As Boolean,
	category As String,
	is_elevated As Boolean,
	is_built_in As Boolean,
	is_private As Boolean,
	is_linear As Boolean,
	is_hdrcapable As Boolean,
	is_normalmap As Boolean
)
Parameters
renderEngineGuid
Type: System.String
[Missing <param name="renderEngineGuid"/> documentation for "M:Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
imageBased
Type: System.Boolean
[Missing <param name="imageBased"/> documentation for "M:Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
category
Type: System.String
[Missing <param name="category"/> documentation for "M:Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
is_elevated
Type: System.Boolean
[Missing <param name="is_elevated"/> documentation for "M:Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
is_built_in
Type: System.Boolean
[Missing <param name="is_built_in"/> documentation for "M:Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
is_private
Type: System.Boolean
[Missing <param name="is_private"/> documentation for "M:Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
is_linear
Type: System.Boolean
[Missing <param name="is_linear"/> documentation for "M:Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
is_hdrcapable
Type: System.Boolean
[Missing <param name="is_hdrcapable"/> documentation for "M:Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
is_normalmap
Type: System.Boolean
[Missing <param name="is_normalmap"/> documentation for "M:Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
See Also
Reference
CustomRenderContentAttribute Class
CustomRenderContentAttribute Overload
Rhino.Render Namespace