RhinoCommon API
CustomGripObject.OnUndoMove Method
 Called when Rhino undoes a grip move. Restore anything the grip changed alongside its location, such as a weight. The location itself is restored by Rhino.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnUndoMove()
Protected Overridable Sub OnUndoMove
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace