RhinoCommon API
NamedParametersEventArgs.TryGetRhinoObjects Method
 Get array of RhinoObject for the specified key
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool TryGetRhinoObjects(
	string key,
	out RhinoObject[] values
)
Public Function TryGetRhinoObjects (
	key As String,
	<OutAttribute> ByRef values As RhinoObject()
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetRhinoObjects(System.String,Rhino.DocObjects.RhinoObject[]@)"]
values
Type: Rhino.DocObjects.RhinoObject[]
[Missing <param name="values"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetRhinoObjects(System.String,Rhino.DocObjects.RhinoObject[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetRhinoObjects(System.String,Rhino.DocObjects.RhinoObject[]@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace