RhinoCommon API
DisplayPen.SetPattern Method
 Set pattern to apply for a stroke.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetPattern(
	IEnumerable<float> dashesAndGaps
)
Public Sub SetPattern (
	dashesAndGaps As IEnumerable(Of Single)
)
Parameters
dashesAndGaps
Type: System.Collections.Generic.IEnumerable<Single>
 Lengths of dashes and gaps for a pattern. Dash is always assumed the first item. There is a limit to 8 dashes and gaps total
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  thrown when dashes and gaps have more than 8 items
See Also
Reference
DisplayPen Class
Rhino.Display Namespace