RhinoCommon API
DisplayPipeline.Push2dProjection Method
 Push the current view projection and set the viewport up to be a simple 2D top projection where the camera frustum matches the same size as the screen port. This allows geometry draw functions to act like they are working with typical 2d graphics APIs on a window
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Push2dProjection()
Public Sub Push2dProjection
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace