RhinoCommon API
Localization.LocalizeString Method (LocalizedStringHandler, Int32, String)
 Returns localized version of an interpolated English string, such as LocalizeString($"Plug-in: {pi.Name}", 1428). The string table key is the source text of the literal, holes and all, which is what the string extractor records. Holes in the translation are matched by their source text and replaced with the formatted values.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static string LocalizeString(
	ref LocalizedStringHandler english,
	int contextId,
	string englishSource = null
)
Public Shared Function LocalizeString (
	ByRef english As LocalizedStringHandler,
	contextId As Integer,
	Optional englishSource As String = Nothing
) As String
Parameters
english
Type: Rhino.UI.LocalizedStringHandler
The interpolated text in English.
contextId
Type: System.Int32
The context ID.
englishSource (Optional)
Type: System.String
Supplied by the compiler; do not pass.
Return Value
Type: String
The localized string.
See Also
Reference
Localization Class
LocalizeString Overload
Rhino.UI Namespace