RhinoCommon API
ToolbarFile.GetGroup Method (String)
 Gets a toolbar group.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ToolbarGroup GetGroup(
	string name
)
Public Function GetGroup (
	name As String
) As ToolbarGroup
Parameters
name
Type: System.String
The name of the toolbar group.
Return Value
Type: ToolbarGroup
The toolbar group if successful, null otherwise.
See Also
Reference
ToolbarFile Class
GetGroup Overload
Rhino.UI Namespace