RhinoCommon API
FileCsvDocument Constructor (String[])
 Constructs a new, empty document with a header row of column names. The number of columns is the number of names supplied, and the header is written ahead of the data rows by Save(String). Columns can then be addressed by name (see ColumnIndex(String) and the name-keyed TryGet overloads).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public FileCsvDocument(
	params string[] columnNames
)
Public Sub New (
	ParamArray columnNames As String()
)
Parameters
columnNames
Type: System.String[]
The column names. At least one is required.
Exceptions
Exception | Condition
ArgumentException | Thrown when columnNames is null or empty.
See Also
Reference
FileCsvDocument Class
FileCsvDocument Overload
Rhino.FileIO Namespace