RhinoCommon API
TextEntity.CreateSurfaces Method (DimensionStyle, Boolean, Double, Double)
 Creates planar breps from the outline curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Brep[] CreateSurfaces(
	DimensionStyle dimstyle,
	bool makeSmallCaps,
	double smallCapsScale,
	double spacing
)
Public Function CreateSurfaces (
	dimstyle As DimensionStyle,
	makeSmallCaps As Boolean,
	smallCapsScale As Double,
	spacing As Double
) As Brep()
Parameters
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.TextEntity.CreateSurfaces(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)"]
makeSmallCaps
Type: System.Boolean
 Set to true to create small caps out of lower case letters.
smallCapsScale
Type: System.Double
 Set to create small caps out of lower case letters.
spacing
Type: System.Double
 Set to add additional spacing between glyph output.
Return Value
Type: Brep[]
An array of planar breps.
See Also
Reference
TextEntity Class
CreateSurfaces Overload
Rhino.Geometry Namespace