RhinoCommon API
FileDwgReadOptions Constructor
Initializes a new instance of the FileDwgReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileDwgReadOptions()
Public Sub New
See Also
Reference
FileDwgReadOptions Class
Rhino.FileIO Namespace