RhinoCommon API
SnapShotsClient.Dispose Method
 SnapShotsClient Dispose
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace