RhinoCommon API
ViewInfo.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ViewInfo Class
Dispose Overload
Rhino.DocObjects Namespace