RhinoCommon API
TextFields.Notes Method
 Notes for a RhinoDoc
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Notes()
Public Shared Function Notes As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.Notes"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace