RhinoCommon API
File3dmViewTable.GetEnumerator Method
 Returns an enumerator that yields all views in the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IEnumerator<ViewInfo> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of ViewInfo)
Return Value
Type: IEnumerator<ViewInfo>
An enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace