RhinoCommon API
GetBaseClass.IsValidOptionName Method
 Test a string to see if it can be used as an option name in any of the AddOption...() functions.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.24
Syntax
public static bool IsValidOptionName(
	string optionName
)
Public Shared Function IsValidOptionName (
	optionName As String
) As Boolean
Parameters
optionName
Type: System.String
String to test.
Return Value
Type: Boolean
True if string can be used as an option name.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace