RhinoCommon API
AngularDimension Constructor
 Constructs an angular dimension.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public AngularDimension()
Public Sub New
See Also
Reference
AngularDimension Class
AngularDimension Overload
Rhino.Geometry Namespace