RhinoCommon API
ClippingPlaneSurface.GetClipParticipation Method
[Missing <summary> documentation for "M:Rhino.Geometry.ClippingPlaneSurface.GetClipParticipation(System.Collections.Generic.IEnumerable{System.Guid}@,System.Collections.Generic.IEnumerable{System.Int32}@,System.Boolean@)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void GetClipParticipation(
	out IEnumerable<Guid> objectIds,
	out IEnumerable<int> layerIndices,
	out bool isExclusionList
)
Public Sub GetClipParticipation (
	<OutAttribute> ByRef objectIds As IEnumerable(Of Guid),
	<OutAttribute> ByRef layerIndices As IEnumerable(Of Integer),
	<OutAttribute> ByRef isExclusionList As Boolean
)
Parameters
objectIds
Type: System.Collections.Generic.IEnumerable<Guid>
[Missing <param name="objectIds"/> documentation for "M:Rhino.Geometry.ClippingPlaneSurface.GetClipParticipation(System.Collections.Generic.IEnumerable{System.Guid}@,System.Collections.Generic.IEnumerable{System.Int32}@,System.Boolean@)"]
layerIndices
Type: System.Collections.Generic.IEnumerable<Int32>
[Missing <param name="layerIndices"/> documentation for "M:Rhino.Geometry.ClippingPlaneSurface.GetClipParticipation(System.Collections.Generic.IEnumerable{System.Guid}@,System.Collections.Generic.IEnumerable{System.Int32}@,System.Boolean@)"]
isExclusionList
Type: System.Boolean
[Missing <param name="isExclusionList"/> documentation for "M:Rhino.Geometry.ClippingPlaneSurface.GetClipParticipation(System.Collections.Generic.IEnumerable{System.Guid}@,System.Collections.Generic.IEnumerable{System.Int32}@,System.Boolean@)"]
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace