RhinoCommon API
SimpleArrayGuid Constructor (IEnumerable<Guid>)
 Initializes a new SimpleArrayGuid class
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SimpleArrayGuid(
	IEnumerable<Guid> values
)
Public Sub New (
	values As IEnumerable(Of Guid)
)
Parameters
values
Type: System.Collections.Generic.IEnumerable<Guid>
initial set of Guids to add to the array
See Also
Reference
SimpleArrayGuid Class
SimpleArrayGuid Overload
Rhino.Runtime.InteropWrappers Namespace