RhinoCommon API
Panels.OpenPanelAsSibling Method (Guid, Guid, Boolean)
 In Mac Rhino this will currently just call OpenPanel, in Windows Rhino this will look for a dock bar which contains the sibling panel and add this panel to that dock bar as necessary, if the panel was in another dock bar it will be moved to this dock bar.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool OpenPanelAsSibling(
	Guid panelId,
	Guid siblingPanelId,
	bool makeSelectedPanel
)
Public Shared Function OpenPanelAsSibling (
	panelId As Guid,
	siblingPanelId As Guid,
	makeSelectedPanel As Boolean
) As Boolean
Parameters
panelId
Type: System.Guid
 The class Id of the panel type to open.
siblingPanelId
Type: System.Guid
 The class Id of the sibling panel.
makeSelectedPanel
Type: System.Boolean
 If true then the panel is set as the active tab after opening it otherwise; the panel is opened but not set as the active tab.
Return Value
Type: Boolean
 Returns true if the panel was successfully opened.
See Also
Reference
Panels Class
OpenPanelAsSibling Overload
Rhino.UI Namespace