RhinoCommon API
Analytics Constructor (String, String, String, String, String)
 Construct Analytics class
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Analytics(
	string TrackingID,
	string Name,
	string Platform,
	string InstallerId,
	string Version
)
Public Sub New (
	TrackingID As String,
	Name As String,
	Platform As String,
	InstallerId As String,
	Version As String
)
Parameters
TrackingID
Type: System.String
Google Analytics Tracking ID
Name
Type: System.String
Name of Application. For example, "Ocelot". Do not include version numbers. Maps to Google Analytics parameter 'an'
Platform
Type: System.String
Platform application is running on. For example "Mac", "Windows". Again, don't include version numbers. Maps to Google Analytics parameter 'ai'
InstallerId
Type: System.String
App Installer Id. In Rhino, we use this to differentiate between different builds such as "WIP" and "Commercial". Maps to Google Analytics parameter 'aiid'
Version
Type: System.String
 Application version string. Maps to Google Analytics parameter 'av'
See Also
Reference
Analytics Class
Analytics Overload
Rhino.Runtime Namespace