RhinoCommon API
MouseCallbackEventArgs.IsOverGumball Method
[Missing <summary> documentation for "M:Rhino.UI.MouseCallbackEventArgs.IsOverGumball"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public GumballMode IsOverGumball()
Public Function IsOverGumball As GumballMode
Return Value
Type: GumballMode
[Missing <returns> documentation for "M:Rhino.UI.MouseCallbackEventArgs.IsOverGumball"]
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace