RhinoCommon API
RhinoMath.ParseNumber Method
 Evaluates command line math expression.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static double ParseNumber(
	string expression
)
Public Shared Function ParseNumber (
	expression As String
) As Double
Parameters
expression
Type: System.String
Return Value
Type: Double
result
Exceptions
Exception | Condition
ArgumentNullException | expression is null.
FormatException | expression cannot be parsed.
See Also
Reference
RhinoMath Class
Rhino Namespace