RhinoCommon API
MeshVertexColorList.Add Method (Color)
 Adds a new vertex color to the end of the color list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Add(
	Color color
)
Public Function Add (
	color As Color
) As Integer
Parameters
color
Type: System.Drawing.Color
Color to append.
Return Value
Type: Int32
The index of the newly added color.
See Also
Reference
MeshVertexColorList Class
Add Overload
Rhino.Geometry.Collections Namespace