RhinoCommon API
SelCommand.SelSubObjectFilter Method
 To select subobjects, override this virtual function, add component indices of the subobjects that should get selected to indicesToSelect list and return true. This is called only if the SelFilter returns false and the whole object does not get selected.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
protected virtual bool SelSubObjectFilter(
	RhinoObject rhObj,
	List<ComponentIndex> indicesToSelect
)
Protected Overridable Function SelSubObjectFilter (
	rhObj As RhinoObject,
	indicesToSelect As List(Of ComponentIndex)
) As Boolean
Parameters
rhObj
Type: Rhino.DocObjects.RhinoObject
The object to check regarding selection status.
indicesToSelect
Type: System.Collections.Generic.List<ComponentIndex>
The component indices of the subobjects to select.
Return Value
Type: Boolean
 true if components added to indicesToSelect should get selected.
See Also
Reference
SelCommand Class
Rhino.Commands Namespace