RhinoCommon API
PersistentSettings.GetChar Method (String, Char)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetChar(System.String,System.Char)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public char GetChar(
	string key,
	char defaultValue
)
Public Function GetChar (
	key As String,
	defaultValue As Char
) As Char
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetChar(System.String,System.Char)"]
defaultValue
Type: System.Char
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetChar(System.String,System.Char)"]
Return Value
Type: Char
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetChar(System.String,System.Char)"]
See Also
Reference
PersistentSettings Class
GetChar Overload
Rhino Namespace