RhinoCommon API
City.Cities Method
 Returns number of available cities.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static int Cities()
Public Shared Function Cities As Integer
Return Value
Type: Int32
City count.
See Also
Reference
City Class
Rhino.Render Namespace