RhinoCommon API
SupportOptions.LastNavigatedLocation Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.LastNavigatedLocation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
[ObsoleteAttribute("Use Libraries_LastNavigatedLocation or FileExplorer_LastNavigatedLocation")]
public static string LastNavigatedLocation()
<ObsoleteAttribute("Use Libraries_LastNavigatedLocation or FileExplorer_LastNavigatedLocation")>
Public Shared Function LastNavigatedLocation As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.LastNavigatedLocation"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace