RhinoCommon API
UserInterfaceGrid.RemoveChild Method
 Take a control out of the grid. Returns the control that was in the cell, or null for an empty cell or an out of range index.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceControl RemoveChild(
	int index
)
Public Function RemoveChild (
	index As Integer
) As UserInterfaceControl
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.UserInterfaceGrid.RemoveChild(System.Int32)"]
Return Value
Type: UserInterfaceControl
[Missing <returns> documentation for "M:Rhino.UI.UserInterfaceGrid.RemoveChild(System.Int32)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace