RhinoCommon API
MeshVertexStatusList.AddRange Method
 Appends an array, a list or any enumerable of flags to the end of the list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void AddRange(
	IEnumerable<bool> values
)
Public Sub AddRange (
	values As IEnumerable(Of Boolean)
)
Parameters
values
Type: System.Collections.Generic.IEnumerable<Boolean>
Hidden values to append.
Return Value
Type:
true on success, false on failure.
See Also
Reference
MeshVertexStatusList Class
Rhino.Geometry.Collections Namespace