RhinoCommon API
ViewCaptureSettings.SetMargins Method
 Set distances from the edge of the paper (MediaSize) to the CropRectange in a defined unit system
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public bool SetMargins(
	UnitSystem lengthUnits,
	double left,
	double top,
	double right,
	double bottom
)
Public Function SetMargins (
	lengthUnits As UnitSystem,
	left As Double,
	top As Double,
	right As Double,
	bottom As Double
) As Boolean
Parameters
lengthUnits
Type: Rhino.UnitSystem
Units that left, top, right, and bottom are defined in
left
Type: System.Double
Distance from left edge of paper to left edge of CropRectangle
top
Type: System.Double
Distance from top edge of paper to top edge of CropRectangle
right
Type: System.Double
Distance from right edge of paper to right edge of CropRectangle
bottom
Type: System.Double
Distance from bottom edge of paper to bottom edge of CropRectangle
Return Value
Type: Boolean
 True if successful. False if unsuccessful (this could happen if there is no set device_dpi)
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace