RhinoCommon API
InstanceDefinition.UseCount Method
 Returns the number of references of this instance definition in the model. Both top-level references and nested instances are included in the count.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
public int UseCount()
Public Function UseCount As Integer
Return Value
Type: Int32
The number of references of this instance definition in the model.
See Also
Reference
InstanceDefinition Class
UseCount Overload
Rhino.DocObjects Namespace