RhinoCommon API
Mesh.SelfSplit Method (MeshSplitOptions)
 Split a mesh with itself.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Mesh[] SelfSplit(
	MeshSplitOptions options
)
Public Function SelfSplit (
	options As MeshSplitOptions
) As Mesh()
Parameters
options
Type: Rhino.Geometry.MeshSplitOptions
The split option instance, or null for the defaults.
Because MeshBooleanOptions derives from MeshSplitOptions, an instance used for mesh booleans can be passed here directly.
Return Value
Type: Mesh[]
An array of mesh parts representing the split result, or null: when no mesh intersected, or if a cancel stopped the computation.
See Also
Reference
Mesh Class
SelfSplit Overload
Rhino.Geometry Namespace