RhinoCommon API
SubDComponent.ReverseComponentDirection Method
 Flips ComponentDirection and returns this component, so it can be used inline where an oppositely oriented reference is wanted.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDComponent ReverseComponentDirection()
Public Function ReverseComponentDirection As SubDComponent
Return Value
Type: SubDComponent
This component.
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace