RhinoCommon API
ShortcutKeySettings.GetDefaults Method
 Get all the default shortcuts registered with Rhino
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static KeyboardShortcut[] GetDefaults()
Public Shared Function GetDefaults As KeyboardShortcut()
Return Value
Type: KeyboardShortcut[]
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.GetDefaults"]
See Also
Reference
ShortcutKeySettings Class
Rhino.ApplicationSettings Namespace