RhinoCommon API
SurfaceCurvature.CreateFromPrincipalCurvatures Method
 Create a SurfaceCurvature from the principal curvature values. The principal curvature values are the most fundamental curvature properties of a surface. Other curvatures are calculated from them.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static SurfaceCurvature CreateFromPrincipalCurvatures(
	double kappa1,
	double kappa2
)
Public Shared Function CreateFromPrincipalCurvatures (
	kappa1 As Double,
	kappa2 As Double
) As SurfaceCurvature
Parameters
kappa1
Type: System.Double
[Missing <param name="kappa1"/> documentation for "M:Rhino.Geometry.SurfaceCurvature.CreateFromPrincipalCurvatures(System.Double,System.Double)"]
kappa2
Type: System.Double
[Missing <param name="kappa2"/> documentation for "M:Rhino.Geometry.SurfaceCurvature.CreateFromPrincipalCurvatures(System.Double,System.Double)"]
Return Value
Type: SurfaceCurvature
A SurfaceCurvature if successful, null otherwise.
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace