RhinoCommon API
CurveObject.DuplicateCurveGeometry Method
 Returns a copy of the underlying curve geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Curve DuplicateCurveGeometry()
Public Function DuplicateCurveGeometry As Curve
Return Value
Type: Curve
[Missing <returns> documentation for "M:Rhino.DocObjects.CurveObject.DuplicateCurveGeometry"]
See Also
Reference
CurveObject Class
Rhino.DocObjects Namespace