RhinoCommon API
IPostEffects.GetPostEffects Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.IPostEffects.GetPostEffects(Rhino.Render.PostEffects.PostEffectType)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
PostEffect[] GetPostEffects(
	PostEffectType type
)
Function GetPostEffects (
	type As PostEffectType
) As PostEffect()
Parameters
type
Type: Rhino.Render.PostEffects.PostEffectType
[Missing <param name="type"/> documentation for "M:Rhino.Render.PostEffects.IPostEffects.GetPostEffects(Rhino.Render.PostEffects.PostEffectType)"]
Return Value
Type: PostEffect[]
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.IPostEffects.GetPostEffects(Rhino.Render.PostEffects.PostEffectType)"]
See Also
Reference
IPostEffects Interface
Rhino.Render.PostEffects Namespace