RhinoCommon API
RenderContent.RegisterContent Method (Assembly, Guid)
 Call RegisterContent in your plug-in's OnLoad function in order to register all of the custom RenderContent classes in your assembly.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public static Type[] RegisterContent(
	Assembly assembly,
	Guid pluginId
)
Public Shared Function RegisterContent (
	assembly As Assembly,
	pluginId As Guid
) As Type()
Parameters
assembly
Type: System.Reflection.Assembly
 Assembly where custom content is defined, this may be a plug-in assembly or another assembly referenced by the plug-in.
pluginId
Type: System.Guid
Parent plug-in for this assembly.
Return Value
Type: Type[]
array of render content types registered on success. null on error.
See Also
Reference
RenderContent Class
RegisterContent Overload
Rhino.Render Namespace