RhinoCommon API
RenderMaterial.TextureTypeFromSlot Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.TextureTypeFromSlot(Rhino.Render.RenderMaterial.StandardChildSlots)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public static TextureType TextureTypeFromSlot(
	RenderMaterial.StandardChildSlots slot
)
Public Shared Function TextureTypeFromSlot (
	slot As RenderMaterial.StandardChildSlots
) As TextureType
Parameters
slot
Type: Rhino.Render.RenderMaterial.StandardChildSlots
[Missing <param name="slot"/> documentation for "M:Rhino.Render.RenderMaterial.TextureTypeFromSlot(Rhino.Render.RenderMaterial.StandardChildSlots)"]
Return Value
Type: TextureType
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.TextureTypeFromSlot(Rhino.Render.RenderMaterial.StandardChildSlots)"]
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace