RhinoCommon API
Field Constructor (RenderContent, IntPtr)
Initializes a new instance of the Field class
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Field(
	RenderContent renderContent,
	IntPtr pointer
)
Protected Sub New (
	renderContent As RenderContent,
	pointer As IntPtr
)
Parameters
renderContent
Type: Rhino.Render.RenderContent
[Missing <param name="renderContent"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.IntPtr)"]
pointer
Type: System.IntPtr
[Missing <param name="pointer"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.IntPtr)"]
See Also
Reference
Field Class
Field Overload
Rhino.Render.Fields Namespace