RhinoCommon API
WorksessionFileModel.RemoveLayerOverrideAt Method
Removes a layer override.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void RemoveLayerOverrideAt(
	int index
)
Public Sub RemoveLayerOverrideAt (
	index As Integer
)
Parameters
index
Type: System.Int32
Index of the layer override to remove.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If index is out of range.
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace