RhinoCommon API
RhinoDoc.Import Method (String, ArchivableDictionary)
 Import geometry into a RhinoDoc from a file. This can be any file format that Rhino can import
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Import(
	string filePath,
	ArchivableDictionary options
)
Public Function Import (
	filePath As String,
	options As ArchivableDictionary
) As Boolean
Parameters
filePath
Type: System.String
[Missing <param name="filePath"/> documentation for "M:Rhino.RhinoDoc.Import(System.String,Rhino.Collections.ArchivableDictionary)"]
options
Type: Rhino.Collections.ArchivableDictionary
[Missing <param name="options"/> documentation for "M:Rhino.RhinoDoc.Import(System.String,Rhino.Collections.ArchivableDictionary)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoDoc.Import(System.String,Rhino.Collections.ArchivableDictionary)"]
Exceptions
Exception | Condition
FileNotFoundException
See Also
Reference
RhinoDoc Class
Import Overload
Rhino Namespace