RhinoCommon API
PersistentSettings.GetDate Method (String, DateTime)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetDate(System.String,System.DateTime)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DateTime GetDate(
	string key,
	DateTime defaultValue
)
Public Function GetDate (
	key As String,
	defaultValue As DateTime
) As DateTime
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetDate(System.String,System.DateTime)"]
defaultValue
Type: System.DateTime
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetDate(System.String,System.DateTime)"]
Return Value
Type: DateTime
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetDate(System.String,System.DateTime)"]
See Also
Reference
PersistentSettings Class
GetDate Overload
Rhino Namespace