RhinoCommon API
FileWriteOptions.Finalize Method
[Missing <summary> documentation for "M:Rhino.FileIO.FileWriteOptions.Finalize"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace