RhinoCommon API
RealtimeDisplayMode.UnregisterDisplayModes Method (Assembly, Guid)
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.UnregisterDisplayModes(System.Reflection.Assembly,System.Guid)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void UnregisterDisplayModes(
	Assembly assembly,
	Guid pluginId
)
Public Shared Sub UnregisterDisplayModes (
	assembly As Assembly,
	pluginId As Guid
)
Parameters
assembly
Type: System.Reflection.Assembly
[Missing <param name="assembly"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.UnregisterDisplayModes(System.Reflection.Assembly,System.Guid)"]
pluginId
Type: System.Guid
[Missing <param name="pluginId"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.UnregisterDisplayModes(System.Reflection.Assembly,System.Guid)"]
See Also
Reference
RealtimeDisplayMode Class
UnregisterDisplayModes Overload
Rhino.Render Namespace