RhinoCommon API
FileTypeList.AddFileType Method (String, IEnumerable<String>, Boolean)
[Missing <summary> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.Collections.Generic.IEnumerable{System.String},System.Boolean)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int AddFileType(
	string description,
	IEnumerable<string> extensions,
	bool showOptionsButtonInFileDialog
)
Public Function AddFileType (
	description As String,
	extensions As IEnumerable(Of String),
	showOptionsButtonInFileDialog As Boolean
) As Integer
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.Collections.Generic.IEnumerable{System.String},System.Boolean)"]
extensions
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="extensions"/> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.Collections.Generic.IEnumerable{System.String},System.Boolean)"]
showOptionsButtonInFileDialog
Type: System.Boolean
[Missing <param name="showOptionsButtonInFileDialog"/> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.Collections.Generic.IEnumerable{System.String},System.Boolean)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.Collections.Generic.IEnumerable{System.String},System.Boolean)"]
See Also
Reference
FileTypeList Class
AddFileType Overload
Rhino.PlugIns Namespace