RhinoCommon API
StringWrapper.SetString Method
 Set contents of this string.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetString(
	string s
)
Public Sub SetString (
	s As String
)
Parameters
s
Type: System.String
The new string.
See Also
Reference
StringWrapper Class
Rhino.Runtime.InteropWrappers Namespace