RhinoCommon API
PointCloud.AddRange Method (IEnumerable<Point3d>)
 Appends a collection of points to this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void AddRange(
	IEnumerable<Point3d> points
)
Public Sub AddRange (
	points As IEnumerable(Of Point3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to append.
See Also
Reference
PointCloud Class
AddRange Overload
Rhino.Geometry Namespace