RhinoCommon API
RealtimeDisplayMode.DrawMiddlegroundEventArgs Constructor
Initializes a new instance of the RealtimeDisplayMode.DrawMiddlegroundEventArgs class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DrawMiddlegroundEventArgs(
	DisplayPipeline dp
)
Public Sub New (
	dp As DisplayPipeline
)
Parameters
dp
Type: Rhino.Display.DisplayPipeline
[Missing <param name="dp"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.DrawMiddlegroundEventArgs.#ctor(Rhino.Display.DisplayPipeline)"]
See Also
Reference
RealtimeDisplayMode.DrawMiddlegroundEventArgs Class
Rhino.Render Namespace