RhinoCommon API
ReplayHistoryData.TryGetGuids Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetGuids(System.Int32,System.Guid[]@)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool TryGetGuids(
	int id,
	out Guid[] values
)
Public Function TryGetGuids (
	id As Integer,
	<OutAttribute> ByRef values As Guid()
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetGuids(System.Int32,System.Guid[]@)"]
values
Type: System.Guid[]
[Missing <param name="values"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetGuids(System.Int32,System.Guid[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetGuids(System.Int32,System.Guid[]@)"]
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace