RhinoCommon API
IPanelsService.SupportedType Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.SupportedType(System.Type,System.String@)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
bool SupportedType(
	Type type,
	out string exceptionMessage
)
Function SupportedType (
	type As Type,
	<OutAttribute> ByRef exceptionMessage As String
) As Boolean
Parameters
type
Type: System.Type
[Missing <param name="type"/> documentation for "M:Rhino.UI.IPanelsService.SupportedType(System.Type,System.String@)"]
exceptionMessage
Type: System.String
[Missing <param name="exceptionMessage"/> documentation for "M:Rhino.UI.IPanelsService.SupportedType(System.Type,System.String@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.SupportedType(System.Type,System.String@)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace