RhinoCommon API
ChangeQueue Constructor (Guid, CreatePreviewEventArgs)
 Construct a new ChangeQueue using the given CreatePreviewEventArgs. The preview scene for these args will be used to populate the world.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected ChangeQueue(
	Guid pluginId,
	CreatePreviewEventArgs createPreviewEventArgs
)
Protected Sub New (
	pluginId As Guid,
	createPreviewEventArgs As CreatePreviewEventArgs
)
Parameters
pluginId
Type: System.Guid
Id of plugin instantiating ChangeQueue
createPreviewEventArgs
Type: Rhino.Render.CreatePreviewEventArgs
[Missing <param name="createPreviewEventArgs"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.#ctor(System.Guid,Rhino.Render.CreatePreviewEventArgs)"]
See Also
Reference
ChangeQueue Class
ChangeQueue Overload
Rhino.Render.ChangeQueue Namespace