RhinoCommon API
ObjectAttributes.ObjectFrame Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.ObjectFrame"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Plane ObjectFrame()
Public Function ObjectFrame As Plane
Return Value
Type: Plane
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.ObjectFrame"]
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace