RhinoCommon API
File3dmShutLining.SetCurvePull Method
 Sets whether the given curve is pulled to the surface before creating the shut-line.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetCurvePull(
	Guid curve_id,
	bool pull
)
Public Sub SetCurvePull (
	curve_id As Guid,
	pull As Boolean
)
Parameters
curve_id
Type: System.Guid
[Missing <param name="curve_id"/> documentation for "M:Rhino.FileIO.File3dmShutLining.SetCurvePull(System.Guid,System.Boolean)"]
pull
Type: System.Boolean
[Missing <param name="pull"/> documentation for "M:Rhino.FileIO.File3dmShutLining.SetCurvePull(System.Guid,System.Boolean)"]
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace