RhinoCommon API
DisplayMaterial.Dispose Method
Releases all resources used by the DisplayMaterial
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
DisplayMaterial Class
Dispose Overload
Rhino.Display Namespace