RhinoCommon API
RenderMaterial.ConvertToPhysicallyBased Method
 Returns a material that is the best approximation of the original, but as a physically based material.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PhysicallyBasedMaterial ConvertToPhysicallyBased(
	RenderTexture.TextureGeneration tg
)
Public Function ConvertToPhysicallyBased (
	tg As RenderTexture.TextureGeneration
) As PhysicallyBasedMaterial
Parameters
tg
Type: Rhino.Render.RenderTexture.TextureGeneration
Determines whether simulated textures will be generated as files.
Return Value
Type: PhysicallyBasedMaterial
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.ConvertToPhysicallyBased(Rhino.Render.RenderTexture.TextureGeneration)"]
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace