RhinoCommon API
RenderWindow.SetView Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.SetView(Rhino.DocObjects.ViewInfo)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetView(
	ViewInfo view
)
Public Sub SetView (
	view As ViewInfo
)
Parameters
view
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="view"/> documentation for "M:Rhino.Render.RenderWindow.SetView(Rhino.DocObjects.ViewInfo)"]
See Also
Reference
RenderWindow Class
Rhino.Render Namespace