RhinoCommon API
LicenseData.IsNotValid Method
 Indicates whether a LicenseData object is either null or invalid.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool IsNotValid(
	LicenseData data
)
Public Shared Function IsNotValid (
	data As LicenseData
) As Boolean
Parameters
data
Type: Rhino.PlugIns.LicenseData
[Missing <param name="data"/> documentation for "M:Rhino.PlugIns.LicenseData.IsNotValid(Rhino.PlugIns.LicenseData)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseData.IsNotValid(Rhino.PlugIns.LicenseData)"]
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace