RhinoCommon API
Box.Transform Method
 Transforms this Box using a Transformation matrix. If the Transform is not a Similarity, the dimensions of the resulting box cannot be trusted.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation matrix to apply to this Box.
Return Value
Type: Boolean
true if the Box was successfully transformed, false otherwise.
See Also
Reference
Box Structure
Rhino.Geometry Namespace