RhinoCommon API
ColorGradient Constructor
Initializes a new instance of the ColorGradient class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ColorGradient()
Public Sub New
See Also
Reference
ColorGradient Class
Rhino.Display Namespace