RhinoCommon API
DisplayBitmap.Load Method
 Load a DisplayBitmap from and image file on disk or from URL. If path starts with http:// or https:// then an attempt is made to load the bitmap from an online resource
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static DisplayBitmap Load(
	string path
)
Public Shared Function Load (
	path As String
) As DisplayBitmap
Parameters
path
Type: System.String
A location from which to load the file.
Return Value
Type: DisplayBitmap
The new display bitmap, or null on error.
See Also
Reference
DisplayBitmap Class
Rhino.Display Namespace