RhinoCommon API
NamedParametersEventArgs.Dispose Method
 Dispose native resources
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace