RhinoCommon API
ObjectTable.AddRectangle Method (Rectangle3d, ObjectAttributes)
 Adds a rectangle to the object table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid AddRectangle(
	Rectangle3d rectangle,
	ObjectAttributes attributes
)
Public Function AddRectangle (
	rectangle As Rectangle3d,
	attributes As ObjectAttributes
) As Guid
Parameters
rectangle
Type: Rhino.Geometry.Rectangle3d
The rectangle.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes that will be linked with the surface object.
Return Value
Type: Guid
The ID.
See Also
Reference
ObjectTable Class
AddRectangle Overload
Rhino.DocObjects.Tables Namespace