RhinoCommon API
ViewCaptureWriter.SetClipPath Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.SetClipPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[])"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract void SetClipPath(
	ViewCaptureWriter.PathPoint[] points
)
Protected MustOverride Sub SetClipPath (
	points As ViewCaptureWriter.PathPoint()
)
Parameters
points
Type: Rhino.Runtime.ViewCaptureWriter.PathPoint[]
[Missing <param name="points"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.SetClipPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[])"]
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace