RhinoCommon API
TextureMapping.CreateOcsMapping Method
 Create a Ocs texture mapping. Note that OCS mappings must be placed on mapping channel ON_ObjectRenderingAttributes::OCSMappingChannelId() otherwise they will not work.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.17
Syntax
public static TextureMapping CreateOcsMapping(
	Plane plane
)
Public Shared Function CreateOcsMapping (
	plane As Plane
) As TextureMapping
Parameters
plane
Type: Rhino.Geometry.Plane
A plane to use for mapping.
Return Value
Type: TextureMapping
[Missing <returns> documentation for "M:Rhino.Render.TextureMapping.CreateOcsMapping(Rhino.Geometry.Plane)"]
See Also
Reference
TextureMapping Class
Rhino.Render Namespace