RhinoCommon API
ManifestTable.GetEnumerator<T> Method
 Visits all model components in the document, including default ones.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual IEnumerator<T> GetEnumerator<T>()
where T : ModelComponent
Public Overridable Function GetEnumerator(Of T As ModelComponent) As IEnumerator(Of T)
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.FileIO.ManifestTable.GetEnumerator``1"]
Return Value
Type: IEnumerator<T>
An enumerator.
See Also
Reference
ManifestTable Class
GetEnumerator Overload
Rhino.FileIO Namespace