RhinoCommon API
Point3dList.SetAllX Method
 Set all the X values for the points to a single value
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public void SetAllX(
	double xValue
)
Public Sub SetAllX (
	xValue As Double
)
Parameters
xValue
Type: System.Double
See Also
Reference
Point3dList Class
Rhino.Collections Namespace