RhinoCommon API
DisplayPipeline.SupportedMultisamlpleModes Method
 Multisample modes available
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int[] SupportedMultisamlpleModes(
	DisplayTechnology technology
)
Public Shared Function SupportedMultisamlpleModes (
	technology As DisplayTechnology
) As Integer()
Parameters
technology
Type: Rhino.Display.DisplayTechnology
[Missing <param name="technology"/> documentation for "M:Rhino.Display.DisplayPipeline.SupportedMultisamlpleModes(Rhino.Display.DisplayTechnology)"]
Return Value
Type: Int32[]
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipeline.SupportedMultisamlpleModes(Rhino.Display.DisplayTechnology)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace