RhinoCommon API
DisplayBitmap Constructor (Bitmap)
 Constructs a DisplayBitmap from an existing bitmap.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DisplayBitmap(
	Bitmap bitmap
)
Public Sub New (
	bitmap As Bitmap
)
Parameters
bitmap
Type: System.Drawing.Bitmap
The original bitmap.
See Also
Reference
DisplayBitmap Class
DisplayBitmap Overload
Rhino.Display Namespace