RhinoCommon API
TransformObjectList.Clear Method
 Remove all elements from this list
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace