RhinoCommon API
SupportOptions.FileExplorer_SetLastNavigatedLocation Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.FileExplorer_SetLastNavigatedLocation(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void FileExplorer_SetLastNavigatedLocation(
	string folder
)
Public Shared Sub FileExplorer_SetLastNavigatedLocation (
	folder As String
)
Parameters
folder
Type: System.String
[Missing <param name="folder"/> documentation for "M:Rhino.Render.SupportOptions.FileExplorer_SetLastNavigatedLocation(System.String)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace