RhinoCommon API
SimpleArrayGuidPointer Constructor
 Initializes a new SimpleArrayGuidPointer class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public SimpleArrayGuidPointer()
Public Sub New
See Also
Reference
SimpleArrayGuidPointer Class
Rhino.Runtime.InteropWrappers Namespace