RhinoCommon API
RenderTexture.NewBitmapTexture Method (Bitmap, RhinoDoc)
 Constructs a new basic texture from a Bitmap.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static RenderTexture NewBitmapTexture(
	Bitmap bitmap,
	RhinoDoc doc
)
Public Shared Function NewBitmapTexture (
	bitmap As Bitmap,
	doc As RhinoDoc
) As RenderTexture
Parameters
bitmap
Type: System.Drawing.Bitmap
The bitmap to create the basic texture from.
doc
Type: Rhino.RhinoDoc
The document to associate the texture with.
Return Value
Type: RenderTexture
A new render texture.
Remarks
The returned bitmap texture holds a copy of 'bitmap'.
See Also
Reference
RenderTexture Class
NewBitmapTexture Overload
Rhino.Render Namespace