RhinoCommon API
RhinoApp.AskUserForRhinoLicense Method
 Display UI asking the user to enter a license for Rhino or use one from the Zoo.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool AskUserForRhinoLicense(
	bool standAlone,
	Object parentWindow
)
Public Shared Function AskUserForRhinoLicense (
	standAlone As Boolean,
	parentWindow As Object
) As Boolean
Parameters
standAlone
Type: System.Boolean
True to ask for a stand-alone license, false to ask the user for a license from the Zoo
parentWindow
Type: System.Object
Parent window for the user interface dialog.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoApp.AskUserForRhinoLicense(System.Boolean,System.Object)"]
See Also
Reference
RhinoApp Class
Rhino Namespace