RhinoCommon API
TextureEvaluator.Initialize Method
 Call this function before calling GetColor for the first time. Ideally, this should be on the main thread, but you can also call it on a worker thread as long as you are sure that Initialize() or GetColor() cannot be called at the same time on another thread.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool Initialize()
Public Overridable Function Initialize As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.TextureEvaluator.Initialize"]
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace