RhinoCommon API
PersistentSettings.GetColor Method (String, Nullable<Color>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Nullable{System.Drawing.Color})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color? GetColor(
	string key,
	Color? defaultValue
)
Public Function GetColor (
	key As String,
	defaultValue As Color?
) As Color?
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Nullable{System.Drawing.Color})"]
defaultValue
Type: System.Nullable<Color>
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Nullable{System.Drawing.Color})"]
Return Value
Type: Nullable<Color>
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Nullable{System.Drawing.Color})"]
See Also
Reference
PersistentSettings Class
GetColor Overload
Rhino Namespace