RhinoCommon API
ViewCapture.CaptureToBitmap Method (ViewCaptureSettings)
[Missing <summary> documentation for "M:Rhino.Display.ViewCapture.CaptureToBitmap(Rhino.Display.ViewCaptureSettings)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Bitmap CaptureToBitmap(
	ViewCaptureSettings settings
)
Public Shared Function CaptureToBitmap (
	settings As ViewCaptureSettings
) As Bitmap
Parameters
settings
Type: Rhino.Display.ViewCaptureSettings
[Missing <param name="settings"/> documentation for "M:Rhino.Display.ViewCapture.CaptureToBitmap(Rhino.Display.ViewCaptureSettings)"]
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.Display.ViewCapture.CaptureToBitmap(Rhino.Display.ViewCaptureSettings)"]
See Also
Reference
ViewCapture Class
CaptureToBitmap Overload
Rhino.Display Namespace