RhinoCommon API
ObjectAttributes.ClearRenderingAttributes Method
 Clears, or resets the rendering attributes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.28
Syntax
public void ClearRenderingAttributes()
Public Sub ClearRenderingAttributes
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace