RhinoCommon API
NameHash.Inequality Operator
 Determines if two NameHash instances are different by value.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool operator !=(
	NameHash left,
	NameHash right
)
Public Shared Operator <> (
	left As NameHash,
	right As NameHash
) As Boolean
Parameters
left
Type: Rhino.FileIO.NameHash
The first hash.
right
Type: Rhino.FileIO.NameHash
The second hash.
Return Value
Type: Boolean
True if they are different by value, otherwise false.
See Also
Reference
NameHash Class
Rhino.FileIO Namespace