RhinoCommon API
PersistentSettings.TryGetStringList Method (String, String[], IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetStringList(System.String,System.String[]@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetStringList(
	string key,
	out string[] value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetStringList (
	key As String,
	<OutAttribute> ByRef value As String(),
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetStringList(System.String,System.String[]@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: System.String[]
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetStringList(System.String,System.String[]@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetStringList(System.String,System.String[]@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetStringList(System.String,System.String[]@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetStringList Overload
Rhino Namespace