RhinoCommon API
MouseCursor.SetToolTip Method
 Sets a cursor tooltip string shown next to the mouse cursor. Overrides all cursor tooltip panes.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void SetToolTip(
	string tooltip
)
Public Shared Sub SetToolTip (
	tooltip As String
)
Parameters
tooltip
Type: System.String
The text to show.
See Also
Reference
MouseCursor Class
Rhino.UI Namespace