RhinoCommon API
BezierSurface.Split Method
 Divides the Bezier surface at the specified parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool Split(
	int direction,
	double t,
	out BezierSurface left,
	out BezierSurface right
)
Public Function Split (
	direction As Integer,
	t As Double,
	<OutAttribute> ByRef left As BezierSurface,
	<OutAttribute> ByRef right As BezierSurface
) As Boolean
Parameters
direction
Type: System.Int32
0 is split along u and 1 is split along v
t
Type: System.Double
parameter must satisfy 0 < t < 1
left
Type: Rhino.Geometry.BezierSurface
[Missing <param name="left"/> documentation for "M:Rhino.Geometry.BezierSurface.Split(System.Int32,System.Double,Rhino.Geometry.BezierSurface@,Rhino.Geometry.BezierSurface@)"]
right
Type: Rhino.Geometry.BezierSurface
[Missing <param name="right"/> documentation for "M:Rhino.Geometry.BezierSurface.Split(System.Int32,System.Double,Rhino.Geometry.BezierSurface@,Rhino.Geometry.BezierSurface@)"]
Return Value
Type: Boolean
true on success
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace