RhinoCommon API
CommandAliasList.GetAlias Method
 Get command alias from the list
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static CommandAlias GetAlias(
	int index
)
Public Shared Function GetAlias (
	index As Integer
) As CommandAlias
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.ApplicationSettings.CommandAliasList.GetAlias(System.Int32)"]
Return Value
Type: CommandAlias
null is index is out of range
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace