RhinoCommon API
RhinoDoc.SaveAs Method (String)
 Save doc as a 3dm to a specified path using the current Rhino file version
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool SaveAs(
	string file3dmPath
)
Public Function SaveAs (
	file3dmPath As String
) As Boolean
Parameters
file3dmPath
Type: System.String
[Missing <param name="file3dmPath"/> documentation for "M:Rhino.RhinoDoc.SaveAs(System.String)"]
Return Value
Type: Boolean
true on success
See Also
Reference
RhinoDoc Class
SaveAs Overload
Rhino Namespace