RhinoCommon API
Interop.FontFromPointer Method
 Create managed Font from native ON_Font*
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Font FontFromPointer(
	IntPtr ptrManagedFont
)
Public Shared Function FontFromPointer (
	ptrManagedFont As IntPtr
) As Font
Parameters
ptrManagedFont
Type: System.IntPtr
[Missing <param name="ptrManagedFont"/> documentation for "M:Rhino.Runtime.Interop.FontFromPointer(System.IntPtr)"]
Return Value
Type: Font
[Missing <returns> documentation for "M:Rhino.Runtime.Interop.FontFromPointer(System.IntPtr)"]
See Also
Reference
Interop Class
Rhino.Runtime Namespace