RhinoCommon API
SimpleArrayClippingPlaneObjectPointer.Add Method
 Adds a clipping plane to the list.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public void Add(
	ClippingPlaneObject clippingplane,
	bool asConst
)
Public Sub Add (
	clippingplane As ClippingPlaneObject,
	asConst As Boolean
)
Parameters
clippingplane
Type: Rhino.DocObjects.ClippingPlaneObject
A clipping plane to add.
asConst
Type: System.Boolean
Whether this clipping plane should be treated as non-modifiable.
See Also
Reference
SimpleArrayClippingPlaneObjectPointer Class
Rhino.Runtime.InteropWrappers Namespace