RhinoCommon API
BinaryArchiveReader.ReadString Method
 Reads a String from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string ReadString()
Public Function ReadString As String
Return Value
Type: String
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace