RhinoCommon API
DisplayPipeline.DrawZebraPreview Method (Mesh, Color)
 Draws a shaded Mesh with Zebra stripe preview.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
public void DrawZebraPreview(
	Mesh mesh,
	Color color
)
Public Sub DrawZebraPreview (
	mesh As Mesh,
	color As Color
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to draw.
color
Type: System.Drawing.Color
Object color.
See Also
Reference
DisplayPipeline Class
DrawZebraPreview Overload
Rhino.Display Namespace