RhinoCommon API
RenderPlugIn.CreatePreview Method
 Creates the preview bitmap that will appear in the content editor's thumbnail display when previewing materials and environments. If this function is not overridden or the PreviewImage is not set on the arguments, then the internal OpenGL renderer will generate a simulation of the content. This function is called with four different preview quality settings. The first quality level of RealtimeQuick is called on the main thread and needs to be drawn as fast as possible. This function is called with the other three quality settings on a separate thread and are meant for generating progressively refined preview.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void CreatePreview(
	CreatePreviewEventArgs args
)
Protected Overridable Sub CreatePreview (
	args As CreatePreviewEventArgs
)
Parameters
args
Type: Rhino.Render.CreatePreviewEventArgs
Event argument with several preview option state properties.
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace