RhinoCommon API
ColorRGBA.CreateFromCMYK Method
 Create the nearest RGBA equivalent of a CMYK color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static ColorRGBA CreateFromCMYK(
	ColorCMYK cmyk
)
Public Shared Function CreateFromCMYK (
	cmyk As ColorCMYK
) As ColorRGBA
Parameters
cmyk
Type: Rhino.Display.ColorCMYK
Target color in CMYK space.
Return Value
Type: ColorRGBA
The RGBA equivalent of the CMYK color.
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace