RhinoCommon API
FactoryBase.Finalize Method
 Finalizer
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
FactoryBase Class
Rhino.UI.Controls Namespace