RhinoCommon API
ComponentIndex.Inequality Operator
 Determines whether two ComponentIndexes have different values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool operator !=(
	ComponentIndex a,
	ComponentIndex b
)
Public Shared Operator <> (
	a As ComponentIndex,
	b As ComponentIndex
) As Boolean
Parameters
a
Type: Rhino.Geometry.ComponentIndex
The first ComponentIndex
b
Type: Rhino.Geometry.ComponentIndex
The second ComponentIndex
Return Value
Type: Boolean
True if the ComponentIndexes are unequal
See Also
Reference
ComponentIndex Structure
Rhino.Geometry Namespace