RhinoCommon API
RhinoDocUndoRecord Constructor (UInt32, String)
 Begin a RhinoDoc undo record.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.23
Syntax
public RhinoDocUndoRecord(
	uint docRuntimeSerialNumber,
	string description
)
Public Sub New (
	docRuntimeSerialNumber As UInteger,
	description As String
)
Parameters
docRuntimeSerialNumber
Type: System.UInt32
The active document's runtime serial number.
description
Type: System.String
A description of the record.
See Also
Reference
RhinoDocUndoRecord Class
RhinoDocUndoRecord Overload
Rhino Namespace