RhinoCommon API
LayerTable.Purge Method (Guid, Boolean)
 Deletes a layer and all geometry objects on a layer.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Purge(
	Guid layerId,
	bool quiet
)
Public Function Purge (
	layerId As Guid,
	quiet As Boolean
) As Boolean
Parameters
layerId
Type: System.Guid
 Id of the layer to purge.
quiet
Type: System.Boolean
 If true, no warning message box appears if a layer the layer cannot be deleted because it is the current layer.
Return Value
Type: Boolean
 true if successful. false if layerIndex is out of range or the layer cannot be deleted because it is the current layer.
See Also
Reference
LayerTable Class
Purge Overload
Rhino.DocObjects.Tables Namespace