RhinoCommon API
Panels.GetPanels Method (Guid, UInt32)
 Gets the panels.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static Object[] GetPanels(
	Guid panelId,
	uint documentRuntimeSerialNumber
)
Public Shared Function GetPanels (
	panelId As Guid,
	documentRuntimeSerialNumber As UInteger
) As Object()
Parameters
panelId
Type: System.Guid
Panel identifier.
documentRuntimeSerialNumber
Type: System.UInt32
Document runtime serial number.
Return Value
Type: Object[]
The panels.
See Also
Reference
Panels Class
GetPanels Overload
Rhino.UI Namespace