RhinoCommon API
Transform.GetYawPitchRoll Method
 Find the Tait-Byran angles (also loosely called Euler angles) for a rotation transformation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public bool GetYawPitchRoll(
	out double yaw,
	out double pitch,
	out double roll
)
Public Function GetYawPitchRoll (
	<OutAttribute> ByRef yaw As Double,
	<OutAttribute> ByRef pitch As Double,
	<OutAttribute> ByRef roll As Double
) As Boolean
Parameters
yaw
Type: System.Double
Angle of rotation, in radians, about the Z axis.
pitch
Type: System.Double
Angle of rotation, in radians, about the Y axis.
roll
Type: System.Double
Angle of rotation, in radians, about the X axis.
Return Value
Type: Boolean
If true, then this = RotationZYX(yaw, pitch, roll) = R_z(yaw) * R_y(pitch) * R_x(roll) where R_*(angle) is rotation of angle radians about the corresponding world coordinate axis. If false, then this is not a rotation.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace