RhinoCommon API
RhinoApp.PostEnterEvent Method
 Post an enter event to the command line
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void PostEnterEvent(
	uint runtimeDocSerialNumber,
	bool bRepeatedEnter
)
Public Shared Sub PostEnterEvent (
	runtimeDocSerialNumber As UInteger,
	bRepeatedEnter As Boolean
)
Parameters
runtimeDocSerialNumber
Type: System.UInt32
Unique serialNumber for the document to post the event to.
bRepeatedEnter
Type: System.Boolean
if true, allow multiple enter events to be posted simultaneouslyt.
See Also
Reference
RhinoApp Class
Rhino Namespace