RhinoCommon API
Panels.PanelDockBars Method
 Will always return a empty array in Mac Rhino. In Windows Rhino it will look for any panel dock bars that contain the specified panel class Id and return the dock bar Id's.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public static Guid[] PanelDockBars(
	Guid panelId
)
Public Shared Function PanelDockBars (
	panelId As Guid
) As Guid()
Parameters
panelId
Type: System.Guid
 Panel class Id for of the panel to look for.
Return Value
Type: Guid[]
 Always returns Guid.Empty on Mac Rhino. On Windows Rhino it will return the Id for the dock bar which host the specified panel or Guid.Empty if the panel is not currently visible.
See Also
Reference
Panels Class
Rhino.UI Namespace