RhinoCommon API
ArcCurve Constructor (Arc)
 Initializes a new ArcCurve instance, copying values from another Arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ArcCurve(
	Arc arc
)
Public Sub New (
	arc As Arc
)
Parameters
arc
Type: Rhino.Geometry.Arc
Another Arc.
See Also
Reference
ArcCurve Class
ArcCurve Overload
Rhino.Geometry Namespace