RhinoCommon API
RenderPlugIn.AllowChooseContent Method
 Default implementation returns true which means the content can be picked from the content browser by the user. Override this method and return false if you don't want to allow a certain content contentType to be picked from the content browser while your render engine is current.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool AllowChooseContent(
	RenderContent content
)
Protected Overridable Function AllowChooseContent (
	content As RenderContent
) As Boolean
Parameters
content
Type: Rhino.Render.RenderContent
A render context.
Return Value
Type: Boolean
true if the operation was successful.
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace