RhinoCommon API
Material.ToPhysicallyBased Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.ToPhysicallyBased"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void ToPhysicallyBased()
Public Sub ToPhysicallyBased
See Also
Reference
Material Class
Rhino.DocObjects Namespace