RhinoCommon API
Mesh.CreateQuickHull3D Method (IEnumerable<Point3d>, List<Int32[]>)
 Attempts to create a 3d convex hull mesh from input points using the QuickHull algorithm. Hull faces whose shared edges are not clearly convex are merged, so faces of the resulting mesh may be triangles, quads, or larger convex polygons (returned as mesh ngons).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Mesh CreateQuickHull3D(
	IEnumerable<Point3d> points,
	out List<int[]> indexMap
)
Public Shared Function CreateQuickHull3D (
	points As IEnumerable(Of Point3d),
	<OutAttribute> ByRef indexMap As List(Of Integer())
) As Mesh
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
The 3D input points to be covered with the convex hull. At least four points are required, and they must not be coincident, colinear, or coplanar.
indexMap
Type: System.Collections.Generic.List<Int32[]>
 List of integer arrays, one for each hull face, containing the indices into the input points enumerable that make up that face. Note, this can be null.
Return Value
Type: Mesh
A valid mesh if successful. If there were too few input points, or the input was degenerate (coincident, colinear, or coplanar), the result is null.
See Also
Reference
Mesh Class
CreateQuickHull3D Overload
Rhino.Geometry Namespace