RhinoCommon API
CustomRenderMeshProvider.RegisterProviders Method
 Call this method once from your plug-ins OnLoad override for each assembly containing a custom mesh provider. Only publicly exported classes derived from CustomRenderMeshProvider with a public constructor that has no parameters will get registered.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public static void RegisterProviders(
	Assembly assembly,
	Guid pluginId
)
Public Shared Sub RegisterProviders (
	assembly As Assembly,
	pluginId As Guid
)
Parameters
assembly
Type: System.Reflection.Assembly
 Assembly to search for valid CustomRenderMeshProvider derived classes.
pluginId
Type: System.Guid
 The plug-in that owns the custom mesh providers.
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace