RhinoCommon API
DrawingUtilities.CreateMeshPreviewImage Method (IEnumerable<Mesh>, IEnumerable<Color>, Size)
 Creates a preview image of one or more meshes.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Bitmap CreateMeshPreviewImage(
	IEnumerable<Mesh> meshes,
	IEnumerable<Color> colors,
	Size size
)
Public Shared Function CreateMeshPreviewImage (
	meshes As IEnumerable(Of Mesh),
	colors As IEnumerable(Of Color),
	size As Size
) As Bitmap
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
The meshes.
colors
Type: System.Collections.Generic.IEnumerable<Color>
The draw colors, one for each mesh.
size
Type: System.Drawing.Size
The size of the preview image.
Return Value
Type: Bitmap
A bitmap if successful, null otherwise.
See Also
Reference
DrawingUtilities Class
CreateMeshPreviewImage Overload
Rhino.UI Namespace