RhinoCommon API
RenderContent.SaveToFile Method
 Saves content to a file - RMTL, RENV or RTEX.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public bool SaveToFile(
	string filename,
	RenderContent.EmbedFilesChoice embedFilesChoice
)
Public Function SaveToFile (
	filename As String,
	embedFilesChoice As RenderContent.EmbedFilesChoice
) As Boolean
Parameters
filename
Type: System.String
Full path to the file to be saved.
embedFilesChoice
Type: Rhino.Render.RenderContent.EmbedFilesChoice
[Missing <param name="embedFilesChoice"/> documentation for "M:Rhino.Render.RenderContent.SaveToFile(System.String,Rhino.Render.RenderContent.EmbedFilesChoice)"]
Return Value
Type: Boolean
The loaded content or null if an error occurred.
See Also
Reference
RenderContent Class
Rhino.Render Namespace