RhinoCommon API
ComponentStatus.Inequality Operator
 Determines if two ComponentStatus objects differ.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool operator !=(
	ComponentStatus a,
	ComponentStatus b
)
Public Shared Operator <> (
	a As ComponentStatus,
	b As ComponentStatus
) As Boolean
Parameters
a
Type: Rhino.Geometry.ComponentStatus
The first ComponentStatus.
b
Type: Rhino.Geometry.ComponentStatus
The second ComponentStatus.
Return Value
Type: Boolean
true if they are in any way different. False otherwise.
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace