RhinoCommon API
SimpleArrayCurvePointer.ToNonConstArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Curve[] ToNonConstArray()
Public Function ToNonConstArray As Curve()
Return Value
Type: Curve[]
The managed array.
See Also
Reference
SimpleArrayCurvePointer Class
Rhino.Runtime.InteropWrappers Namespace