RhinoCommon API
LightArray.Count Method
[Missing <summary> documentation for "M:Rhino.Render.LightArray.Count"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Count()
Public Function Count As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.LightArray.Count"]
See Also
Reference
LightArray Class
Rhino.Render Namespace