RhinoCommon API
LayerTable.PurgeUnused Method
 Purges any unused layers.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PurgeUnused()
Public Function PurgeUnused As Integer
Return Value
Type: Int32
The number of unused layers that were purged.
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace