RhinoCommon API
BinaryArchiveReader.ReadUtf8String Method
 Reads a String from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string ReadUtf8String()
Public Function ReadUtf8String As String
Return Value
Type: String
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace