RhinoCommon API
Mesh.ShrinkWrap Method (PointCloud, ShrinkWrapParameters, CancellationToken)
 Creates a unified ShrinkWrap mesh from a point cloud returns null on error or failure Supports cancellation during volumetric calculations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public static Mesh ShrinkWrap(
	PointCloud pointCloud,
	ShrinkWrapParameters parameters,
	CancellationToken token
)
Public Shared Function ShrinkWrap (
	pointCloud As PointCloud,
	parameters As ShrinkWrapParameters,
	token As CancellationToken
) As Mesh
Parameters
pointCloud
Type: Rhino.Geometry.PointCloud
[Missing <param name="pointCloud"/> documentation for "M:Rhino.Geometry.Mesh.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
parameters
Type: Rhino.Geometry.ShrinkWrapParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.Mesh.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
token
Type: System.Threading.CancellationToken
[Missing <param name="token"/> documentation for "M:Rhino.Geometry.Mesh.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
See Also
Reference
Mesh Class
ShrinkWrap Overload
Rhino.Geometry Namespace