RhinoCommon API
Plane.PointAt Method (Double, Double)
 Evaluate a point on the plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d PointAt(
	double u,
	double v
)
Public Function PointAt (
	u As Double,
	v As Double
) As Point3d
Parameters
u
Type: System.Double
evaluation parameter.
v
Type: System.Double
evaluation parameter.
Return Value
Type: Point3d
plane.origin + u*plane.xaxis + v*plane.yaxis.
See Also
Reference
Plane Structure
PointAt Overload
Rhino.Geometry Namespace