RhinoCommon API
Brep.CreateFromTaperedExtrude Method (Curve, Double, Vector3d, Point3d, Double, ExtrudeCornerType, Double, Double)
 Extrude a curve to a taper making a brep (potentially more than 1)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep[] CreateFromTaperedExtrude(
	Curve curveToExtrude,
	double distance,
	Vector3d direction,
	Point3d basePoint,
	double draftAngleRadians,
	ExtrudeCornerType cornerType,
	double tolerance,
	double angleToleranceRadians
)
Public Shared Function CreateFromTaperedExtrude (
	curveToExtrude As Curve,
	distance As Double,
	direction As Vector3d,
	basePoint As Point3d,
	draftAngleRadians As Double,
	cornerType As ExtrudeCornerType,
	tolerance As Double,
	angleToleranceRadians As Double
) As Brep()
Parameters
curveToExtrude
Type: Rhino.Geometry.Curve
the curve to extrude
distance
Type: System.Double
the distance to extrude
direction
Type: Rhino.Geometry.Vector3d
the direction of the extrusion
basePoint
Type: Rhino.Geometry.Point3d
the base point of the extrusion
draftAngleRadians
Type: System.Double
angle of the extrusion
cornerType
Type: Rhino.Geometry.ExtrudeCornerType
[Missing <param name="cornerType"/> documentation for "M:Rhino.Geometry.Brep.CreateFromTaperedExtrude(Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,System.Double,Rhino.Geometry.ExtrudeCornerType,System.Double,System.Double)"]
tolerance
Type: System.Double
tolerance to use for the extrusion
angleToleranceRadians
Type: System.Double
angle tolerance to use for the extrusion
Return Value
Type: Brep[]
array of breps on success
See Also
Reference
Brep Class
CreateFromTaperedExtrude Overload
Rhino.Geometry Namespace