RhinoCommon API
InstanceDefinitionTable.GetList Method
 Gets an array of instance definitions.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public InstanceDefinition[] GetList(
	bool ignoreDeleted
)
Public Function GetList (
	ignoreDeleted As Boolean
) As InstanceDefinition()
Parameters
ignoreDeleted
Type: System.Boolean
If true then deleted instance definitions are filtered out.
Return Value
Type: InstanceDefinition[]
An array of instance definitions. This can be empty, but not null.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace