RhinoCommon API
TextureGraphInfo.ActiveChannel Method
[Missing <summary> documentation for "M:Rhino.Render.TextureGraphInfo.ActiveChannel"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public TextureGraphInfo.Channel ActiveChannel()
Public Function ActiveChannel As TextureGraphInfo.Channel
Return Value
Type: TextureGraphInfo.Channel
[Missing <returns> documentation for "M:Rhino.Render.TextureGraphInfo.ActiveChannel"]
See Also
Reference
TextureGraphInfo Class
Rhino.Render Namespace