RhinoCommon API
ReplayHistoryData.TryGetInts Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetInts(System.Int32,System.Int32[]@)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetInts(
	int id,
	out int[] values
)
Public Function TryGetInts (
	id As Integer,
	<OutAttribute> ByRef values As Integer()
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetInts(System.Int32,System.Int32[]@)"]
values
Type: System.Int32[]
[Missing <param name="values"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetInts(System.Int32,System.Int32[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetInts(System.Int32,System.Int32[]@)"]
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace