RhinoCommon API
DocumentCollectedException Constructor
 Initializes a new instance of the document controlled exception class.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DocumentCollectedException()
Public Sub New
See Also
Reference
DocumentCollectedException Class
DocumentCollectedException Overload
Rhino.Runtime Namespace