RhinoCommon API
Texture Constructor
 Initializes a new texture.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Texture()
Public Sub New
See Also
Reference
Texture Class
Texture Overload
Rhino.DocObjects Namespace