RhinoCommon API
HostUtils.SetInShutDown Method
 Informs the runtime that the application is shutting down.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void SetInShutDown()
Public Shared Sub SetInShutDown
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace