RhinoCommon API
PlaneSurface.ToMesh Method
 Computes a polygon mesh of the surface made of one quad.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Mesh ToMesh()
Public Function ToMesh As Mesh
Return Value
Type: Mesh
A polygon mesh of the surface.
See Also
Reference
PlaneSurface Class
Rhino.Geometry Namespace