RhinoCommon API
FieldDictionary.Set Method (String, String)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public void Set(
	string key,
	string value
)
Public Sub Set (
	key As String,
	value As String
)
Parameters
key
Type: System.String
Key name for the field value to change. See important note above.
value
Type: System.String
New value for this field.
See Also
Reference
FieldDictionary Class
Set Overload
Rhino.Render.Fields Namespace