RhinoCommon API
File3dmGroupTable.AddGroup Method
 Adds a new empty group to the group table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public int AddGroup()
Public Function AddGroup As Integer
Return Value
Type: Int32
>=0 index of new group or -1 on error.
See Also
Reference
File3dmGroupTable Class
Rhino.FileIO Namespace