RhinoCommon API
ArchivableDictionary Constructor
Initializes an instance of a dictionary for writing to a 3dm archive.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ArchivableDictionary()
Public Sub New
See Also
Reference
ArchivableDictionary Class
ArchivableDictionary Overload
Rhino.Collections Namespace