RhinoCommon API
Brep.CreateDevelopableLoft Method (NurbsCurve, NurbsCurve, IEnumerable<Point2d>)
 Creates a single developable surface between two curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public static Brep[] CreateDevelopableLoft(
	NurbsCurve rail0,
	NurbsCurve rail1,
	IEnumerable<Point2d> fixedRulings
)
Public Shared Function CreateDevelopableLoft (
	rail0 As NurbsCurve,
	rail1 As NurbsCurve,
	fixedRulings As IEnumerable(Of Point2d)
) As Brep()
Parameters
rail0
Type: Rhino.Geometry.NurbsCurve
The first rail curve.
rail1
Type: Rhino.Geometry.NurbsCurve
The second rail curve.
fixedRulings
Type: System.Collections.Generic.IEnumerable<Point2d>
 Rulings define lines across the surface that define the straight sections on the developable surface, where rulings[i].X = parameter on first rail curve, and rulings[i].Y = parameter on second rail curve. Note, rulings will be automatically adjusted to minimum twist.
Return Value
Type: Brep[]
The output Breps if successful, otherwise an empty array.
See Also
Reference
Brep Class
CreateDevelopableLoft Overload
Rhino.Geometry Namespace