RhinoCommon API
Brep.VariationalPatchSettings Constructor
 Constructor with defaults
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public VariationalPatchSettings()
Public Sub New
See Also
Reference
Brep.VariationalPatchSettings Class
Brep.VariationalPatchSettings Overload
Rhino.Geometry Namespace