RhinoCommon API
ObjRef.SelectionView Method
 If the object was interactively selected in a particular viewport, then SelectionView() returns the view where the object was selected.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public RhinoView SelectionView()
Public Function SelectionView As RhinoView
Return Value
Type: RhinoView
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjRef.SelectionView"]
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace