RhinoCommon API
PointCloud.GetColors Method
 Copy all the point colors in this point cloud to an array.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color[] GetColors()
Public Function GetColors As Color()
Return Value
Type: Color[]
An array containing all the colors in this point cloud.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace