RhinoCommon API
PersistentSettings.ClearChangedFlag Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.ClearChangedFlag"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void ClearChangedFlag()
Public Sub ClearChangedFlag
See Also
Reference
PersistentSettings Class
Rhino Namespace