RhinoCommon API
RhinoMath.TryParseNumber Method
 Evaluates command line math expression.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool TryParseNumber(
	string expression,
	out double result
)
Public Shared Function TryParseNumber (
	expression As String,
	<OutAttribute> ByRef result As Double
) As Boolean
Parameters
expression
Type: System.String
result
Type: System.Double
Return Value
Type: Boolean
true if successful otherwise false
See Also
Reference
RhinoMath Class
Rhino Namespace