RhinoCommon API
TextureMapping.TryGetMappingCylinder Method (Cylinder, Boolean)
 Get a cylindrical projection parameters from this texture mapping.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public bool TryGetMappingCylinder(
	out Cylinder cylinder,
	out bool capped
)
Public Function TryGetMappingCylinder (
	<OutAttribute> ByRef cylinder As Cylinder,
	<OutAttribute> ByRef capped As Boolean
) As Boolean
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
[Missing <param name="cylinder"/> documentation for "M:Rhino.Render.TextureMapping.TryGetMappingCylinder(Rhino.Geometry.Cylinder@,System.Boolean@)"]
capped
Type: System.Boolean
will be true if capped
Return Value
Type: Boolean
 Returns true if a valid cylinder is returned.
Remarks
 Generally, GetMappingCylinder will not return the same parameters passed to SetCylinderMapping. However, the location of the cylinder will be the same. If this mapping is not cylindrical, the cylinder will approximate the actual mapping primitive.
See Also
Reference
TextureMapping Class
TryGetMappingCylinder Overload
Rhino.Render Namespace