RhinoCommon API
Layer.SetPerViewportPlotWeight Method
 Sets the plot weight, in millimeters, for this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetPerViewportPlotWeight(
	Guid viewportId,
	double plotWeight
)
Public Sub SetPerViewportPlotWeight (
	viewportId As Guid,
	plotWeight As Double
)
Parameters
viewportId
Type: System.Guid
If not Guid.Empty, then the setting applies only to the viewport with the specified id.
plotWeight
Type: System.Double
 The plot weight in millimeters. A weight of 0.0 indicates the "default" pen weight should be used. A weight of -1.0 indicates the layer should not be printed.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace