RhinoCommon API
BezierSurface.Domain Method
Gets the domain in a direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Interval Domain(
	int direction
)
Public Function Domain (
	direction As Integer
) As Interval
Parameters
direction
Type: System.Int32
0 gets first parameter, 1 gets second parameter.
Return Value
Type: Interval
An interval value.
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace