RhinoCommon API
NamedPositionTable.Update Method (Guid)
 Updates a Named Position, effectively storing the current positions of the objects which the Named Position is tracking.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Update(
	Guid id
)
Public Function Update (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
 Guid of the Named Position which you want to update.
Return Value
Type: Boolean
 True or False depending on whether the Update was successful.
See Also
Reference
NamedPositionTable Class
Update Overload
Rhino.DocObjects.Tables Namespace