RhinoCommon API
Linetype.AddShape Method (Curve, Double)
 Add a curve shape to this linetype definition
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool AddShape(
	Curve shapeCurve,
	double offset
)
Public Function AddShape (
	shapeCurve As Curve,
	offset As Double
) As Boolean
Parameters
shapeCurve
Type: Rhino.Geometry.Curve
[Missing <param name="shapeCurve"/> documentation for "M:Rhino.DocObjects.Linetype.AddShape(Rhino.Geometry.Curve,System.Double)"]
offset
Type: System.Double
[Missing <param name="offset"/> documentation for "M:Rhino.DocObjects.Linetype.AddShape(Rhino.Geometry.Curve,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Linetype.AddShape(Rhino.Geometry.Curve,System.Double)"]
See Also
Reference
Linetype Class
AddShape Overload
Rhino.DocObjects Namespace