RhinoCommon API
UserInterfaceTextBox Constructor (String)
Initializes a new instance of the UserInterfaceTextBox class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceTextBox(
	string text
)
Public Sub New (
	text As String
)
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.UI.UserInterfaceTextBox.#ctor(System.String)"]
See Also
Reference
UserInterfaceTextBox Class
UserInterfaceTextBox Overload
Rhino.UI Namespace