RhinoCommon API
GetCone.GetMesh Method (Int32, Int32, Int32, Cone)
 Prompt for the getting of a mesh cone.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Result GetMesh(
	ref int verticalFaces,
	ref int aroundFaces,
	ref int capStyle,
	out Cone cone
)
Public Function GetMesh (
	ByRef verticalFaces As Integer,
	ByRef aroundFaces As Integer,
	ByRef capStyle As Integer,
	<OutAttribute> ByRef cone As Cone
) As Result
Parameters
verticalFaces
Type: System.Int32
The number of faces in the vertical direction.
aroundFaces
Type: System.Int32
The number of faces in the around direction
capStyle
Type: System.Int32
Set to 0 if you don't want the prompt, 3 is triangles, 4 is quads.
cone
Type: Rhino.Geometry.Cone
The cone geometry defined by the user.
Return Value
Type: Result
The result of the getting operation.
Remarks
The prompt for capStyle will only be seen if it's not zero, aroundFaces is even and the solid option is on.
See Also
Reference
GetCone Class
GetMesh Overload
Rhino.Input.Custom Namespace