RhinoCommon API
GetObject.DisablePreSelect Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetObject.DisablePreSelect"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DisablePreSelect()
Public Sub DisablePreSelect
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace