RhinoCommon API
CustomDisplay.AddArc Method (Arc)
 Adds a new, black arc to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void AddArc(
	Arc arc
)
Public Sub AddArc (
	arc As Arc
)
Parameters
arc
Type: Rhino.Geometry.Arc
Arc to add.
See Also
Reference
CustomDisplay Class
AddArc Overload
Rhino.Display Namespace