RhinoCommon API
ComponentIndex.Equals Method (ComponentIndex)
 Determines whether the specified ComponentIndex is equal to the current ComponentIndex, comparing by value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Equals(
	ComponentIndex other
)
Public Function Equals (
	other As ComponentIndex
) As Boolean
Parameters
other
Type: Rhino.Geometry.ComponentIndex
The other ComponentIndex to compare with.
Return Value
Type: Boolean
true if other has the same ComponentIndexType and Index as this; otherwise, false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ComponentIndex Structure
Equals Overload
Rhino.Geometry Namespace