RhinoCommon API
HostUtils.SendLogMessageToCloudCallbackProc Method
 Informs RhinoCommon of an message that has been handled but that the developer wants to screen.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public static void SendLogMessageToCloudCallbackProc(
	HostUtils.LogMessageType msg_type,
	IntPtr pwStringClass,
	IntPtr pwStringDesc,
	IntPtr pwStringMessage
)
Public Shared Sub SendLogMessageToCloudCallbackProc (
	msg_type As HostUtils.LogMessageType,
	pwStringClass As IntPtr,
	pwStringDesc As IntPtr,
	pwStringMessage As IntPtr
)
Parameters
msg_type
Type: Rhino.Runtime.HostUtils.LogMessageType
The messag type
pwStringClass
Type: System.IntPtr
The top level message type.
pwStringDesc
Type: System.IntPtr
Finer grained description of the message.
pwStringMessage
Type: System.IntPtr
The message.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace