RhinoCommon API
NamedParametersEventArgs.SetWindowHandle Method
 Set a HWND on Windows or NSView* on Mac
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SetWindowHandle(
	string name,
	IntPtr value
)
Public Sub SetWindowHandle (
	name As String,
	value As IntPtr
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetWindowHandle(System.String,System.IntPtr)"]
value
Type: System.IntPtr
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetWindowHandle(System.String,System.IntPtr)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace