RhinoCommon API
SimpleArrayInterval Constructor
 Initializes a new SimpleArrayInterval class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SimpleArrayInterval()
Public Sub New
See Also
Reference
SimpleArrayInterval Class
SimpleArrayInterval Overload
Rhino.Runtime.InteropWrappers Namespace