RhinoCommon API
Transform2d.Scale Method (Point2d, Double)
 Constructs a new uniform scaling transformation with a specified anchor point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d Scale(
	Point2d anchor,
	double scaleFactor
)
Public Shared Function Scale (
	anchor As Point2d,
	scaleFactor As Double
) As Transform2d
Parameters
anchor
Type: Rhino.Geometry.Point2d
The fixed point of the scaling.
scaleFactor
Type: System.Double
The scaling factor in both directions.
Return Value
Type: Transform2d
A transform matrix which scales geometry uniformly around the anchor point.
See Also
Reference
Transform2d Structure
Scale Overload
Rhino.Geometry Namespace