RhinoCommon API
PlugIn.ObjectPropertiesPages Method (List<ObjectPropertiesPage>)
Note: This API is now obsolete.
 Override this function is you want to extend the object properties dialog
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use ObjectPropertiesPages(ObjectPropertiesPageCollection collection) instead")]
protected virtual void ObjectPropertiesPages(
	List<ObjectPropertiesPage> pages
)
<ObsoleteAttribute("Use ObjectPropertiesPages(ObjectPropertiesPageCollection collection) instead")>
Protected Overridable Sub ObjectPropertiesPages (
	pages As List(Of ObjectPropertiesPage)
)
Parameters
pages
Type: System.Collections.Generic.List<ObjectPropertiesPage>
[Missing <param name="pages"/> documentation for "M:Rhino.PlugIns.PlugIn.ObjectPropertiesPages(System.Collections.Generic.List{Rhino.UI.ObjectPropertiesPage})"]
See Also
Reference
PlugIn Class
ObjectPropertiesPages Overload
Rhino.PlugIns Namespace