RhinoCommon API
MeshVertexColorList.CreateMonotoneMesh Method
 Constructs a valid vertex color list consisting of a single color.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool CreateMonotoneMesh(
	Color baseColor
)
Public Function CreateMonotoneMesh (
	baseColor As Color
) As Boolean
Parameters
baseColor
Type: System.Drawing.Color
Color to apply to every vertex.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace