RhinoCommon API
TextFields.GetInstanceAttributeFields Method (InstanceDefinition)
[Missing <summary> documentation for "M:Rhino.Runtime.TextFields.GetInstanceAttributeFields(Rhino.DocObjects.InstanceDefinition)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static TextFields.InstanceAttributeField[] GetInstanceAttributeFields(
	InstanceDefinition idef
)
Public Shared Function GetInstanceAttributeFields (
	idef As InstanceDefinition
) As TextFields.InstanceAttributeField()
Parameters
idef
Type: Rhino.DocObjects.InstanceDefinition
[Missing <param name="idef"/> documentation for "M:Rhino.Runtime.TextFields.GetInstanceAttributeFields(Rhino.DocObjects.InstanceDefinition)"]
Return Value
Type: TextFields.InstanceAttributeField[]
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.GetInstanceAttributeFields(Rhino.DocObjects.InstanceDefinition)"]
See Also
Reference
TextFields Class
GetInstanceAttributeFields Overload
Rhino.Runtime Namespace