RhinoCommon API
File3dm.Write Method (String, File3dmWriteOptions)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public bool Write(
	string path,
	File3dmWriteOptions options
)
Public Function Write (
	path As String,
	options As File3dmWriteOptions
) As Boolean
Parameters
path
Type: System.String
The file name to use for writing.
options
Type: Rhino.FileIO.File3dmWriteOptions
An options instance, or null for default.
Return Value
Type: Boolean
 true if archive is written with no error. false if errors occur.
See Also
Reference
File3dm Class
Write Overload
Rhino.FileIO Namespace