RhinoCommon API
GetSphere Constructor
Initializes a new instance of the GetSphere class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public GetSphere()
Public Sub New
See Also
Reference
GetSphere Class
Rhino.Input.Custom Namespace