RhinoCommon API
RhinoGet.GetViewports Method
 Easy to use getter for selecting multiple viewports.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Result GetViewports(
	string commandPrompt,
	out RhinoViewport[] viewports
)
Public Shared Function GetViewports (
	commandPrompt As String,
	<OutAttribute> ByRef viewports As RhinoViewport()
) As Result
Parameters
commandPrompt
Type: System.String
Prompt to display in command line during the operation.
viewports
Type: Rhino.Display.RhinoViewport[]
An array of /selected Viewports.
Return Value
Type: Result
 Commands.Result.Success - got point Commands.Result.Cancel - user cancel point getting.
See Also
Reference
RhinoGet Class
Rhino.Input Namespace