RhinoCommon API
TransformCommand Constructor
Initializes a new instance of the TransformCommand class
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected TransformCommand()
Protected Sub New
See Also
Reference
TransformCommand Class
Rhino.Commands Namespace