RhinoCommon API
Brep.CreateBlendSurface Method
 Makes a surface blend between two surface edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep[] CreateBlendSurface(
	BrepFace face0,
	BrepEdge edge0,
	Interval domain0,
	bool rev0,
	BlendContinuity continuity0,
	BrepFace face1,
	BrepEdge edge1,
	Interval domain1,
	bool rev1,
	BlendContinuity continuity1
)
Public Shared Function CreateBlendSurface (
	face0 As BrepFace,
	edge0 As BrepEdge,
	domain0 As Interval,
	rev0 As Boolean,
	continuity0 As BlendContinuity,
	face1 As BrepFace,
	edge1 As BrepEdge,
	domain1 As Interval,
	rev1 As Boolean,
	continuity1 As BlendContinuity
) As Brep()
Parameters
face0
Type: Rhino.Geometry.BrepFace
First face to blend from.
edge0
Type: Rhino.Geometry.BrepEdge
First edge to blend from.
domain0
Type: Rhino.Geometry.Interval
The domain of edge0 to use.
rev0
Type: System.Boolean
If false, edge0 will be used in its natural direction. If true, edge0 will be used in the reversed direction.
continuity0
Type: Rhino.Geometry.BlendContinuity
Continuity for the blend at the start.
face1
Type: Rhino.Geometry.BrepFace
Second face to blend from.
edge1
Type: Rhino.Geometry.BrepEdge
Second edge to blend from.
domain1
Type: Rhino.Geometry.Interval
The domain of edge1 to use.
rev1
Type: System.Boolean
If false, edge1 will be used in its natural direction. If true, edge1 will be used in the reversed direction.
continuity1
Type: Rhino.Geometry.BlendContinuity
Continuity for the blend at the end.
Return Value
Type: Brep[]
Array of Breps if successful.
See Also
Reference
Brep Class
Rhino.Geometry Namespace