RhinoCommon API
Linetype Constructor
Initializes a new instance of the Linetype class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Linetype()
Public Sub New
See Also
Reference
Linetype Class
Linetype Overload
Rhino.DocObjects Namespace