RhinoCommon API
ViewTable.IsCameraIconVisible Method
 Determine if a camera icon is being shown
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsCameraIconVisible(
	RhinoView view
)
Public Function IsCameraIconVisible (
	view As RhinoView
) As Boolean
Parameters
view
Type: Rhino.Display.RhinoView
 if null, then all views are tested. If not null, then just view is tested.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ViewTable.IsCameraIconVisible(Rhino.Display.RhinoView)"]
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace