RhinoCommon API
File3dm.ReadPageViews Method
 Reads page view, or layout, information from an existing 3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static ViewInfo[] ReadPageViews(
	string path
)
Public Shared Function ReadPageViews (
	path As String
) As ViewInfo()
Parameters
path
Type: System.String
A location on disk or network.
Return Value
Type: ViewInfo[]
An array of view information if successful, otherwise an empty array.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace