RhinoCommon API
Intersection.ArcArc Method
 Intersects two arcs using exact calculations.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public static ArcArcIntersection ArcArc(
	Arc arcA,
	Arc arcB,
	out Point3d intersectionPoint1,
	out Point3d intersectionPoint2
)
Public Shared Function ArcArc (
	arcA As Arc,
	arcB As Arc,
	<OutAttribute> ByRef intersectionPoint1 As Point3d,
	<OutAttribute> ByRef intersectionPoint2 As Point3d
) As ArcArcIntersection
Parameters
arcA
Type: Rhino.Geometry.Arc
First arc to intersect.
arcB
Type: Rhino.Geometry.Arc
Second arc to intersect.
intersectionPoint1
Type: Rhino.Geometry.Point3d
First intersection point.
intersectionPoint2
Type: Rhino.Geometry.Point3d
Second intersection point.
Return Value
Type: ArcArcIntersection
The intersection type.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace