RhinoCommon API
Intersection.CurveSurfaceValidate Method (Curve, Interval, Surface, Double, Double, Int32[], TextLog)
 Intersects a sub-curve and a surface.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static CurveIntersections CurveSurfaceValidate(
	Curve curve,
	Interval curveDomain,
	Surface surface,
	double tolerance,
	double overlapTolerance,
	out int[] invalidIndices,
	out TextLog textLog
)
Public Shared Function CurveSurfaceValidate (
	curve As Curve,
	curveDomain As Interval,
	surface As Surface,
	tolerance As Double,
	overlapTolerance As Double,
	<OutAttribute> ByRef invalidIndices As Integer(),
	<OutAttribute> ByRef textLog As TextLog
) As CurveIntersections
Parameters
curve
Type: Rhino.Geometry.Curve
Curve for intersection.
curveDomain
Type: Rhino.Geometry.Interval
Domain of sub-curve to take into consideration for Intersections.
surface
Type: Rhino.Geometry.Surface
Surface for intersection.
tolerance
Type: System.Double
Intersection tolerance. If the curve approaches the surface to within tolerance, an intersection is assumed.
overlapTolerance
Type: System.Double
The tolerance with which the curves are tested.
invalidIndices
Type: System.Int32[]
The indices in the resulting CurveIntersections collection that are invalid.
textLog
Type: Rhino.FileIO.TextLog
A text log that contains tails about the invalid intersection events.
Return Value
Type: CurveIntersections
A collection of intersection events.
See Also
Reference
Intersection Class
CurveSurfaceValidate Overload
Rhino.Geometry.Intersect Namespace