RhinoCommon API
RhinoApp.ParseTextField Method (String, RhinoObject, RhinoObject, InstanceObject)
 Parses a text field string.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public static string ParseTextField(
	string formula,
	RhinoObject obj,
	RhinoObject topParentObject,
	InstanceObject immediateParent
)
Public Shared Function ParseTextField (
	formula As String,
	obj As RhinoObject,
	topParentObject As RhinoObject,
	immediateParent As InstanceObject
) As String
Parameters
formula
Type: System.String
The text formula.
obj
Type: Rhino.DocObjects.RhinoObject
The Rhino object. Value can be IntPtr.Zero.
topParentObject
Type: Rhino.DocObjects.RhinoObject
The parent Rhino object. Value can be IntPtr.Zero.
immediateParent
Type: Rhino.DocObjects.InstanceObject
The immediate parent instance object. Value can be IntPtr.Zero.
Return Value
Type: String
The parsed text field if sucessful.
See Also
Reference
RhinoApp Class
ParseTextField Overload
Rhino Namespace