RhinoCommon API
UserInterfaceGrid.SetPadding Method (Double)
 Space between the edges of the grid and its cells in logical pixels. The default is 6 on all four sides.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetPadding(
	double padding
)
Public Sub SetPadding (
	padding As Double
)
Parameters
padding
Type: System.Double
[Missing <param name="padding"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetPadding(System.Double)"]
See Also
Reference
UserInterfaceGrid Class
SetPadding Overload
Rhino.UI Namespace