RhinoCommon API
Intersection.MeshPolylineSorted Method
 Finds the intersection of a mesh and a polyline. Points are guaranteed to be sorted along the polyline.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Point3d[] MeshPolylineSorted(
	Mesh mesh,
	PolylineCurve curve,
	out int[] faceIds
)
Public Shared Function MeshPolylineSorted (
	mesh As Mesh,
	curve As PolylineCurve,
	<OutAttribute> ByRef faceIds As Integer()
) As Point3d()
Parameters
mesh
Type: Rhino.Geometry.Mesh
A mesh to intersect.
curve
Type: Rhino.Geometry.PolylineCurve
A polyline curves to intersect.
faceIds
Type: System.Int32[]
The indices of the intersecting faces. This out reference is assigned during the call.
Return Value
Type: Point3d[]
An array of points: one for each face that was passed by the faceIds out reference.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace