RhinoCommon API
Curve.Trim Method (Interval)
 Removes portions of the curve outside the specified interval.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Curve Trim(
	Interval domain
)
Public Function Trim (
	domain As Interval
) As Curve
Parameters
domain
Type: Rhino.Geometry.Interval
 Trimming interval.
Return Value
Type: Curve
Trimmed curve if successful, null on failure.
Remarks
 If curve is open, then trimming interval must be an increasing interval. If curve is closed, and trimming interval is a decreasing interval, then the portion of the curve across the start/end is returned.
See Also
Reference
Curve Class
Trim Overload
Rhino.Geometry Namespace