RhinoCommon API
ShortcutKeySettings.Update Method
 Add or modify shortcuts with a list or KeyboardShortcut elements
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public static void Update(
	IEnumerable<KeyboardShortcut> shortcuts,
	bool replaceAll
)
Public Shared Sub Update (
	shortcuts As IEnumerable(Of KeyboardShortcut),
	replaceAll As Boolean
)
Parameters
shortcuts
Type: System.Collections.Generic.IEnumerable<KeyboardShortcut>
[Missing <param name="shortcuts"/> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.Update(System.Collections.Generic.IEnumerable{Rhino.ApplicationSettings.KeyboardShortcut},System.Boolean)"]
replaceAll
Type: System.Boolean
[Missing <param name="replaceAll"/> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.Update(System.Collections.Generic.IEnumerable{Rhino.ApplicationSettings.KeyboardShortcut},System.Boolean)"]
See Also
Reference
ShortcutKeySettings Class
Rhino.ApplicationSettings Namespace