RhinoCommon API
Curve.IsCircle Method (Double)
 Test a curve to see if it can be represented by a circle within the given tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsCircle(
	double tolerance
)
Public Function IsCircle (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
Tolerance to use when checking.
Return Value
Type: Boolean
 true if the curve can be represented by a circle to within tolerance.
See Also
Reference
Curve Class
IsCircle Overload
Rhino.Geometry Namespace