RhinoCommon API
ObjectPropertiesPage Constructor
Initializes a new instance of the ObjectPropertiesPage class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected ObjectPropertiesPage()
Protected Sub New
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace