RhinoCommon API
PostEffectData.Dispose Method
Releases all resources used by the PostEffectData
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PostEffectData Class
Dispose Overload
Rhino.Render.PostEffects Namespace