RhinoCommon API
RenderMaterial.TextureChildSlotName Method
 Override this function to provide information about which texture is used for the standard (ie - defined in ON_Texture) texture channels.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public virtual string TextureChildSlotName(
	RenderMaterial.StandardChildSlots slot
)
Public Overridable Function TextureChildSlotName (
	slot As RenderMaterial.StandardChildSlots
) As String
Parameters
slot
Type: Rhino.Render.RenderMaterial.StandardChildSlots
An valid slot.
Return Value
Type: String
The texture used for the channel.
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace