RhinoCommon API
Mesh.UnweldVertices Method
 Ensures that faces sharing a common topological vertex have unique indices into the MeshVertexList collection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool UnweldVertices(
	IEnumerable<int> topologyVertexIndices,
	bool modifyNormals
)
Public Function UnweldVertices (
	topologyVertexIndices As IEnumerable(Of Integer),
	modifyNormals As Boolean
) As Boolean
Parameters
topologyVertexIndices
Type: System.Collections.Generic.IEnumerable<Int32>
 Topological vertex indices, from the MeshTopologyVertexList collection, to be unwelded. Use TopologyVertexIndex(Int32) to convert from vertex indices to topological vertex indices.
modifyNormals
Type: System.Boolean
If true, the new vertex normals will be calculated from the face normal.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace