RhinoCommon API
File3dmRenderEnvironment.ToEnvironment Method
 Get a simulated environment that approximates this environment's appearance.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Environment ToEnvironment()
Public Function ToEnvironment As Environment
Return Value
Type: Environment
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderEnvironment.ToEnvironment"]
See Also
Reference
File3dmRenderEnvironment Class
Rhino.FileIO Namespace