RhinoCommon API
RhinoApp.InvokeAndWait Method
 Work-In-Progress. Testing this with our unit test framework
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void InvokeAndWait(
	Action action
)
Public Shared Sub InvokeAndWait (
	action As Action
)
Parameters
action
Type: System.Action
[Missing <param name="action"/> documentation for "M:Rhino.RhinoApp.InvokeAndWait(System.Action)"]
See Also
Reference
RhinoApp Class
Rhino Namespace