RhinoCommon API
ViewCaptureSettings.SetOffset Method
[Missing <summary> documentation for "M:Rhino.Display.ViewCaptureSettings.SetOffset(Rhino.UnitSystem,System.Boolean,System.Double,System.Double)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public void SetOffset(
	UnitSystem lengthUnits,
	bool fromMargin,
	double x,
	double y
)
Public Sub SetOffset (
	lengthUnits As UnitSystem,
	fromMargin As Boolean,
	x As Double,
	y As Double
)
Parameters
lengthUnits
Type: Rhino.UnitSystem
[Missing <param name="lengthUnits"/> documentation for "M:Rhino.Display.ViewCaptureSettings.SetOffset(Rhino.UnitSystem,System.Boolean,System.Double,System.Double)"]
fromMargin
Type: System.Boolean
[Missing <param name="fromMargin"/> documentation for "M:Rhino.Display.ViewCaptureSettings.SetOffset(Rhino.UnitSystem,System.Boolean,System.Double,System.Double)"]
x
Type: System.Double
[Missing <param name="x"/> documentation for "M:Rhino.Display.ViewCaptureSettings.SetOffset(Rhino.UnitSystem,System.Boolean,System.Double,System.Double)"]
y
Type: System.Double
[Missing <param name="y"/> documentation for "M:Rhino.Display.ViewCaptureSettings.SetOffset(Rhino.UnitSystem,System.Boolean,System.Double,System.Double)"]
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace