RhinoCommon API
Brep.CreateBooleanIntersection Method (IEnumerable<Brep>, IEnumerable<Brep>, Double, Boolean)
 Compute the Solid Intersection of two sets of Breps.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep[] CreateBooleanIntersection(
	IEnumerable<Brep> firstSet,
	IEnumerable<Brep> secondSet,
	double tolerance,
	bool manifoldOnly
)
Public Shared Function CreateBooleanIntersection (
	firstSet As IEnumerable(Of Brep),
	secondSet As IEnumerable(Of Brep),
	tolerance As Double,
	manifoldOnly As Boolean
) As Brep()
Parameters
firstSet
Type: System.Collections.Generic.IEnumerable<Brep>
First set of Breps.
secondSet
Type: System.Collections.Generic.IEnumerable<Brep>
Second set of Breps.
tolerance
Type: System.Double
Tolerance to use for intersection operation.
manifoldOnly
Type: System.Boolean
If true, non-manifold input breps are ignored.
Return Value
Type: Brep[]
An array of Brep results or null on failure.
Remarks
 The solid orientation of the breps make a difference when calling this function. Breps that have never been added to a document may need preparing first, or this method can fail, or return an unexpected result. See PrepareForBooleans().
See Also
Reference
Brep Class
CreateBooleanIntersection Overload
Rhino.Geometry Namespace
Brep.PrepareForBooleans()