RhinoCommon API
IShrinkWrapService.ShrinkWrap Method (PointCloud, ShrinkWrapParameters, CancellationToken)
 Create mesh from point cloud input. Null on error or incompatible settings
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
Mesh ShrinkWrap(
	PointCloud pointCloud,
	ShrinkWrapParameters parameters,
	CancellationToken cancellationToken
)
Function ShrinkWrap (
	pointCloud As PointCloud,
	parameters As ShrinkWrapParameters,
	cancellationToken As CancellationToken
) As Mesh
Parameters
pointCloud
Type: Rhino.Geometry.PointCloud
[Missing <param name="pointCloud"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
parameters
Type: Rhino.Geometry.ShrinkWrapParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
cancellationToken
Type: System.Threading.CancellationToken
[Missing <param name="cancellationToken"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
See Also
Reference
IShrinkWrapService Interface
ShrinkWrap Overload
Rhino.Runtime Namespace