RhinoCommon API
MarkupTable.FindIndex Method
 Retrieves a markup based on Index. This type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Markup FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As Markup
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: Markup
A SectionStyle object, or null if none was found.
See Also
Reference
MarkupTable Class
Rhino.DocObjects.Tables Namespace