RhinoCommon API
RhinoList<T>.FindLast Method
 Searches for an element that matches the conditions defined by the specified predicate, and returns the last occurrence within the entire List.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public T FindLast(
	Predicate<T> match
)
Public Function FindLast (
	match As Predicate(Of T)
) As T
Parameters
match
Type: System.Predicate<T>
The Predicate(T) delegate that defines the conditions of the element to search for.
Return Value
Type: T
The last element that matches the conditions defined by the specified predicate, if found; otherwise, the default value for type T.
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace