RhinoCommon API
ManifestTable.Clear Method
 Marks all items as deleted.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual void Clear()
Public Overridable Sub Clear
Implements
ICollection<T>.Clear()
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace