RhinoCommon API
SubD.ClosestPoints Method
 Gets the points on this SubD's surface that are closest to each of a list of test points. This is faster than calling ClosestPoint(Point3d, Point3d, SubDComponentParameter) in a loop because the spatial index over the surface is built once.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int ClosestPoints(
	IEnumerable<Point3d> testPoints,
	out Point3d[] closestPoints,
	out SubDComponentParameter[] parameters,
	double maximumDistance
)
Public Function ClosestPoints (
	testPoints As IEnumerable(Of Point3d),
	<OutAttribute> ByRef closestPoints As Point3d(),
	<OutAttribute> ByRef parameters As SubDComponentParameter(),
	maximumDistance As Double
) As Integer
Parameters
testPoints
Type: System.Collections.Generic.IEnumerable<Point3d>
The points to project onto this SubD.
closestPoints
Type: Rhino.Geometry.Point3d[]
 One point per test point. Entries where no closest point was found are Unset.
parameters
Type: Rhino.Geometry.SubDComponentParameter[]
 One parameter per test point. Entries where no closest point was found are Unset.
maximumDistance
Type: System.Double
 If larger than 0, test points farther than this from the SubD get no closest point. Otherwise this is ignored.
Return Value
Type: Int32
The number of closest points that were found.
See Also
Reference
SubD Class
Rhino.Geometry Namespace