RhinoCommon API
GetBaseClass.ClearDefault Method
 Clears any defaults set using SetDefaultPoint, SetDefaultNumber, SetDefaultString, or SetCommandPromptDefault.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void ClearDefault()
Public Sub ClearDefault
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace