RhinoCommon API
RealtimeDisplayMode.GetView Method
 Get ViewInfo that has been registered with this RealtimeDisplayMode instance.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ViewInfo GetView()
Public Function GetView As ViewInfo
Return Value
Type: ViewInfo
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetView"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace