RhinoCommon API
PostEffectUI.Dispose Method
Releases all resources used by the PostEffectUI
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PostEffectUI Class
Rhino.Render.PostEffects Namespace