RhinoCommon API
CurveObject.GetLinetypeSegments Method (RhinoViewport)
 Converts the linetype pattern of the curve into curve segments and points based on the specified Rhino viewport.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public GeometryBase[] GetLinetypeSegments(
	RhinoViewport viewport
)
Public Function GetLinetypeSegments (
	viewport As RhinoViewport
) As GeometryBase()
Parameters
viewport
Type: Rhino.Display.RhinoViewport
The Rhino viewport used to generate the curve segments and points.
Return Value
Type: GeometryBase[]
An array of curve and point objects if successful.
See Also
Reference
CurveObject Class
GetLinetypeSegments Overload
Rhino.DocObjects Namespace