RhinoCommon API
NamedParametersEventArgs.TryGetString Method
 Try to get a string value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public bool TryGetString(
	string name,
	out string value
)
Public Function TryGetString (
	name As String,
	<OutAttribute> ByRef value As String
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetString(System.String,System.String@)"]
value
Type: System.String
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetString(System.String,System.String@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetString(System.String,System.String@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace