RhinoCommon API
FileUsd.Write Method
Write a USD file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	FileUsdWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As FileUsdWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileUsdWriteOptions
options used for generating the USD file
Return Value
Type: Boolean
true on success
See Also
Reference
FileUsd Class
Rhino.FileIO Namespace