RhinoCommon API
NamedParametersEventArgs.TryGetWindowHandle Method
 Gets a HWND on Windows or NSVIew* on Mac
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool TryGetWindowHandle(
	string name,
	out IntPtr value
)
Public Function TryGetWindowHandle (
	name As String,
	<OutAttribute> ByRef value As IntPtr
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetWindowHandle(System.String,System.IntPtr@)"]
value
Type: System.IntPtr
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetWindowHandle(System.String,System.IntPtr@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetWindowHandle(System.String,System.IntPtr@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace