RhinoCommon API
IRhRdkThumbnail.Label Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.Label"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
string Label()
Function Label As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.Label"]
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls.ThumbnailUI Namespace