RhinoCommon API
RenderPrimitiveList.ConvertMeshesToTriangles Method
 Convert mesh quad faces to triangle faces.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public void ConvertMeshesToTriangles()
Public Sub ConvertMeshesToTriangles
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace