RhinoCommon API
HatchPatternTable.Delete Method (Int32)
 Deletes a hatch pattern from the table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Delete(
	int hatchPatternIndex
)
Public Function Delete (
	hatchPatternIndex As Integer
) As Boolean
Parameters
hatchPatternIndex
Type: System.Int32
The index of the hatch pattern to delete.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
HatchPatternTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace