RhinoCommon API
InstanceDefinitionTable.ModifySourceArchive Method (Int32, FileReference, InstanceDefinitionUpdateType, InstanceDefinitionLayerStyle, Boolean)
 If the instance definition is linked or embedded, use SetSource to specify the source archive.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ModifySourceArchive(
	int idefIndex,
	FileReference sourceArchive,
	InstanceDefinitionUpdateType updateType,
	InstanceDefinitionLayerStyle layerStyle,
	bool quiet
)
Public Function ModifySourceArchive (
	idefIndex As Integer,
	sourceArchive As FileReference,
	updateType As InstanceDefinitionUpdateType,
	layerStyle As InstanceDefinitionLayerStyle,
	quiet As Boolean
) As Boolean
Parameters
idefIndex
Type: System.Int32
The index of the instance definition to be modified.
sourceArchive
Type: Rhino.FileIO.FileReference
The new source archive file name.
updateType
Type: Rhino.DocObjects.InstanceDefinitionUpdateType
layerStyle
Type: Rhino.DocObjects.InstanceDefinitionLayerStyle
 The layer style to apply when updateType is Linked. Pass None to use the default layer style, which is Reference. This parameter is ignored for all other update types.
quiet
Type: System.Boolean
If true, then message boxes about erroneous parameters will not be shown.
Return Value
Type: Boolean
 Returns true if the definition was successfully modified otherwise returns false.
Remarks
 A linked instance definition does not remember its layer style once it has been changed to another update type. Use this overload to restore the layer style when changing an instance definition back to InstanceDefinitionUpdateType.Linked.
See Also
Reference
InstanceDefinitionTable Class
ModifySourceArchive Overload
Rhino.DocObjects.Tables Namespace