RhinoCommon API
ObjectTable.Replace Method (ObjRef, SubD)
 Replaces one object with a new SubD object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Replace(
	ObjRef objref,
	SubD subD
)
Public Function Replace (
	objref As ObjRef,
	subD As SubD
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
reference to old object to be replaced. The objref.Object() will be deleted.
subD
Type: Rhino.Geometry.SubD
 new SubD to be added A duplicate of the SubD is added to the Rhino model.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace