RhinoCommon API
MeshFaceList.ExtractDuplicateFaces Method
 Extracts, or removes, duplicate faces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Mesh ExtractDuplicateFaces()
Public Function ExtractDuplicateFaces As Mesh
Return Value
Type: Mesh
A mesh containing the extracted duplicate faces if successful, null otherwise.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace