RhinoCommon API
SimpleArrayDouble Constructor
 Initializes a new SimpleArrayDouble instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SimpleArrayDouble()
Public Sub New
See Also
Reference
SimpleArrayDouble Class
SimpleArrayDouble Overload
Rhino.Runtime.InteropWrappers Namespace