RhinoCommon API
NamedParametersEventArgs.TryGetBool Method
 Try to get a bool value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public bool TryGetBool(
	string name,
	out bool value
)
Public Function TryGetBool (
	name As String,
	<OutAttribute> ByRef value As Boolean
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetBool(System.String,System.Boolean@)"]
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetBool(System.String,System.Boolean@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetBool(System.String,System.Boolean@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace