RhinoCommon API
RenderTexture.SetProjectionMode Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.SetProjectionMode(Rhino.Render.TextureProjectionMode,Rhino.Render.RenderContent.ChangeContexts)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual void SetProjectionMode(
	TextureProjectionMode value,
	RenderContent.ChangeContexts changeContext
)
Public Overridable Sub SetProjectionMode (
	value As TextureProjectionMode,
	changeContext As RenderContent.ChangeContexts
)
Parameters
value
Type: Rhino.Render.TextureProjectionMode
[Missing <param name="value"/> documentation for "M:Rhino.Render.RenderTexture.SetProjectionMode(Rhino.Render.TextureProjectionMode,Rhino.Render.RenderContent.ChangeContexts)"]
changeContext
Type: Rhino.Render.RenderContent.ChangeContexts
[Missing <param name="changeContext"/> documentation for "M:Rhino.Render.RenderTexture.SetProjectionMode(Rhino.Render.TextureProjectionMode,Rhino.Render.RenderContent.ChangeContexts)"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace