RhinoCommon API
DisplayPen.SetTaper Method
 Positions and thickness at those positions along a curve that define a taper.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetTaper(
	float startThickness,
	float endThickness,
	Point2f taperPoint
)
Public Sub SetTaper (
	startThickness As Single,
	endThickness As Single,
	taperPoint As Point2f
)
Parameters
startThickness
Type: System.Single
[Missing <param name="startThickness"/> documentation for "M:Rhino.Display.DisplayPen.SetTaper(System.Single,System.Single,Rhino.Geometry.Point2f)"]
endThickness
Type: System.Single
[Missing <param name="endThickness"/> documentation for "M:Rhino.Display.DisplayPen.SetTaper(System.Single,System.Single,Rhino.Geometry.Point2f)"]
taperPoint
Type: Rhino.Geometry.Point2f
[Missing <param name="taperPoint"/> documentation for "M:Rhino.Display.DisplayPen.SetTaper(System.Single,System.Single,Rhino.Geometry.Point2f)"]
See Also
Reference
DisplayPen Class
Rhino.Display Namespace