RhinoCommon API
PageViewGroupTable.Add Method (PageViewGroup, IEnumerable<RhinoPageView>)
 Adds a new page view group to the table, and adds page views to the group.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Add(
	PageViewGroup group,
	IEnumerable<RhinoPageView> groupMembers
)
Public Function Add (
	group As PageViewGroup,
	groupMembers As IEnumerable(Of RhinoPageView)
) As Integer
Parameters
group
Type: Rhino.DocObjects.PageViewGroup
 The page view group to add. The information in the page view group is copied. If group.Name is empty a unique name will be used.
groupMembers
Type: System.Collections.Generic.IEnumerable<RhinoPageView>
An enumeration of page views.
Return Value
Type: Int32
Index of new page view group if successful, -1 otherwise.
See Also
Reference
PageViewGroupTable Class
Add Overload
Rhino.DocObjects.Tables Namespace