RhinoCommon API
MeshExtruder.ExtrudedMesh Method (Mesh, List<ComponentIndex>)
 Creates new extruded mesh. Returns true if any edges or faces were extruded.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExtrudedMesh(
	out Mesh extrudedMeshOut,
	out List<ComponentIndex> componentIndicesOut
)
Public Function ExtrudedMesh (
	<OutAttribute> ByRef extrudedMeshOut As Mesh,
	<OutAttribute> ByRef componentIndicesOut As List(Of ComponentIndex)
) As Boolean
Parameters
extrudedMeshOut
Type: Rhino.Geometry.Mesh
Extruded mesh
componentIndicesOut
Type: System.Collections.Generic.List<ComponentIndex>
Component indices of extruded faces and vertices
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.MeshExtruder.ExtrudedMesh(Rhino.Geometry.Mesh@,System.Collections.Generic.List{Rhino.Geometry.ComponentIndex}@)"]
See Also
Reference
MeshExtruder Class
ExtrudedMesh Overload
Rhino.Geometry Namespace