RhinoCommon API
MeshFaceList.GetClashingFacePairs Method
 Gets an array of pairs of mesh faces that clash.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IndexPair[] GetClashingFacePairs(
	int maxPairCount
)
Public Function GetClashingFacePairs (
	maxPairCount As Integer
) As IndexPair()
Parameters
maxPairCount
Type: System.Int32
 If >0, then at most this many pairs will be added to the output array. If <=0, then all clashing pairs will be added to the output array.
Return Value
Type: IndexPair[]
Array of pairs of mesh face indices.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace