RhinoCommon API
PersistentSettings.GetByte Method (String, Byte)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetByte(System.String,System.Byte)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public byte GetByte(
	string key,
	byte defaultValue
)
Public Function GetByte (
	key As String,
	defaultValue As Byte
) As Byte
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetByte(System.String,System.Byte)"]
defaultValue
Type: System.Byte
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetByte(System.String,System.Byte)"]
Return Value
Type: Byte
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetByte(System.String,System.Byte)"]
See Also
Reference
PersistentSettings Class
GetByte Overload
Rhino Namespace