RhinoCommon API
InstanceDefinitionTable.Delete Method (InstanceDefinition)
 Deletes the instance definition. This deletes all references too.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override bool Delete(
	InstanceDefinition item
)
Public Overrides Function Delete (
	item As InstanceDefinition
) As Boolean
Parameters
item
Type: Rhino.DocObjects.InstanceDefinition
The item to delete.
Return Value
Type: Boolean
True on success.
See Also
Reference
InstanceDefinitionTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace