RhinoCommon API
GetTruncatedCone.GetMesh Method (Int32, Int32, Int32, Mesh)
 Prompt for the getting of a mesh truncated cone.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Result GetMesh(
	ref int verticalFaces,
	ref int aroundFaces,
	ref int capStyle,
	out Mesh truncatedCone
)
Public Function GetMesh (
	ByRef verticalFaces As Integer,
	ByRef aroundFaces As Integer,
	ByRef capStyle As Integer,
	<OutAttribute> ByRef truncatedCone As Mesh
) As Result
Parameters
verticalFaces
Type: System.Int32
The number of faces in the vertical direction.
aroundFaces
Type: System.Int32
The number of faces in the around direction
capStyle
Type: System.Int32
Set to 0 if you don't want the prompt, 3 is triangles, 4 is quads.
truncatedCone
Type: Rhino.Geometry.Mesh
The truncated cone in Mesh form.
Return Value
Type: Result
The result of the getting operation.
Remarks
The prompt for capStyle will only be seen if it's not zero, aroundFaces is even and the solid option is on.
See Also
Reference
GetTruncatedCone Class
GetMesh Overload
Rhino.Input.Custom Namespace