RhinoCommon API
RhinoDoc.GetUndoRecords Method
 Gets this document's undo history, ordered from the most recently recorded action to the oldest recorded action.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UndoRecordEntry[] GetUndoRecords()
Public Function GetUndoRecords As UndoRecordEntry()
Return Value
Type: UndoRecordEntry[]
 The undo records. The list is empty when there is nothing to undo.
See Also
Reference
RhinoDoc Class
Rhino Namespace