RhinoCommon API
NurbsSurface.CreateSubDFriendly Method
 Create a bi-cubic SubD friendly surface from a surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static NurbsSurface CreateSubDFriendly(
	Surface surface
)
Public Shared Function CreateSubDFriendly (
	surface As Surface
) As NurbsSurface
Parameters
surface
Type: Rhino.Geometry.Surface
>Surface to rebuild as a SubD friendly surface.
Return Value
Type: NurbsSurface
A SubD friendly NURBS surface is successful, null otherwise.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace