RhinoCommon API
LicenseLease Constructor (String, String, String, String, String, String, String, String, String, DateTime, DateTime, DateTime)
Initializes a new instance of the LicenseLease class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public LicenseLease(
	string productId,
	string groupName,
	string groupId,
	string userName,
	string userId,
	string productTitle,
	string productVersion,
	string productEdition,
	string leaseId,
	DateTime iat,
	DateTime exp,
	DateTime renewable_until
)
Public Sub New (
	productId As String,
	groupName As String,
	groupId As String,
	userName As String,
	userId As String,
	productTitle As String,
	productVersion As String,
	productEdition As String,
	leaseId As String,
	iat As DateTime,
	exp As DateTime,
	renewable_until As DateTime
)
Parameters
productId
Type: System.String
[Missing <param name="productId"/> documentation for "M:Rhino.PlugIns.LicenseLease.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.DateTime,System.DateTime,System.DateTime)"]
groupName
Type: System.String
[Missing <param name="groupName"/> documentation for "M:Rhino.PlugIns.LicenseLease.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.DateTime,System.DateTime,System.DateTime)"]
groupId
Type: System.String
[Missing <param name="groupId"/> documentation for "M:Rhino.PlugIns.LicenseLease.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.DateTime,System.DateTime,System.DateTime)"]
userName
Type: System.String
[Missing <param name="userName"/> documentation for "M:Rhino.PlugIns.LicenseLease.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.DateTime,System.DateTime,System.DateTime)"]
userId
Type: System.String
[Missing <param name="userId"/> documentation for "M:Rhino.PlugIns.LicenseLease.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.DateTime,System.DateTime,System.DateTime)"]
productTitle
Type: System.String
[Missing <param name="productTitle"/> documentation for "M:Rhino.PlugIns.LicenseLease.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.DateTime,System.DateTime,System.DateTime)"]
productVersion
Type: System.String
[Missing <param name="productVersion"/> documentation for "M:Rhino.PlugIns.LicenseLease.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.DateTime,System.DateTime,System.DateTime)"]
productEdition
Type: System.String
[Missing <param name="productEdition"/> documentation for "M:Rhino.PlugIns.LicenseLease.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.DateTime,System.DateTime,System.DateTime)"]
leaseId
Type: System.String
[Missing <param name="leaseId"/> documentation for "M:Rhino.PlugIns.LicenseLease.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.DateTime,System.DateTime,System.DateTime)"]
iat
Type: System.DateTime
[Missing <param name="iat"/> documentation for "M:Rhino.PlugIns.LicenseLease.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.DateTime,System.DateTime,System.DateTime)"]
exp
Type: System.DateTime
[Missing <param name="exp"/> documentation for "M:Rhino.PlugIns.LicenseLease.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.DateTime,System.DateTime,System.DateTime)"]
renewable_until
Type: System.DateTime
[Missing <param name="renewable_until"/> documentation for "M:Rhino.PlugIns.LicenseLease.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.DateTime,System.DateTime,System.DateTime)"]
See Also
Reference
LicenseLease Class
LicenseLease Overload
Rhino.PlugIns Namespace