RhinoCommon API
RenderMaterial Constructor
Initializes a new instance of the RenderMaterial class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected RenderMaterial()
Protected Sub New
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace