RhinoCommon API
Brep.CreateFromMatch Method (BrepEdge, IEnumerable<Curve>, MatchSrfSettings, Brep, Brep)
 Match an edge to the target curves using the settings provided
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public static bool CreateFromMatch(
	BrepEdge edge,
	IEnumerable<Curve> targetCurves,
	MatchSrfSettings settings,
	out Brep matched,
	out Brep target
)
Public Shared Function CreateFromMatch (
	edge As BrepEdge,
	targetCurves As IEnumerable(Of Curve),
	settings As MatchSrfSettings,
	<OutAttribute> ByRef matched As Brep,
	<OutAttribute> ByRef target As Brep
) As Boolean
Parameters
edge
Type: Rhino.Geometry.BrepEdge
The edge to match. This need to be an untrimmed surface edge.
targetCurves
Type: System.Collections.Generic.IEnumerable<Curve>
The curves to match to. These need to be BrepEdge if tangent or curvature matching is requested.
settings
Type: Rhino.Geometry.MatchSrfSettings
The settings used for matching
matched
Type: Rhino.Geometry.Brep
If successful, this contains the matched brep
target
Type: Rhino.Geometry.Brep
If successful and Average is true, this contains the changed target brep.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Brep.CreateFromMatch(Rhino.Geometry.BrepEdge,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.MatchSrfSettings,Rhino.Geometry.Brep@,Rhino.Geometry.Brep@)"]
See Also
Reference
Brep Class
CreateFromMatch Overload
Rhino.Geometry Namespace