RhinoCommon API
FileCsvDocument.Set Method (Int32, Int32, Color)
 Sets the value of a cell to a color, stored as its 32-bit ARGB integer (ToArgb()), so that the alpha channel round-trips.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Set(
	int column,
	int row,
	Color value
)
Public Sub Set (
	column As Integer,
	row As Integer,
	value As Color
)
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.Drawing.Color
The value to store.
See Also
Reference
FileCsvDocument Class
Set Overload
Rhino.FileIO Namespace