RhinoCommon API
RhinoDoc.OpenFile Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.RhinoDoc.OpenFile(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("OpenFile is obsolete, use Open instead")]
public static bool OpenFile(
	string path
)
<ObsoleteAttribute("OpenFile is obsolete, use Open instead")>
Public Shared Function OpenFile (
	path As String
) As Boolean
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.RhinoDoc.OpenFile(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoDoc.OpenFile(System.String)"]
See Also
Reference
RhinoDoc Class
Rhino Namespace