RhinoCommon API
Polyline.ToNurbsCurve Method
 Constructs a nurbs curve representation of this polyline.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public NurbsCurve ToNurbsCurve()
Public Function ToNurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
A Nurbs curve shaped like this polyline or null on failure.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace