RhinoCommon API
NamedParametersEventArgs.TryGetColor Method
 Try to get a Color value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool TryGetColor(
	string name,
	out Color value
)
Public Function TryGetColor (
	name As String,
	<OutAttribute> ByRef value As Color
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetColor(System.String,System.Drawing.Color@)"]
value
Type: System.Drawing.Color
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetColor(System.String,System.Drawing.Color@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetColor(System.String,System.Drawing.Color@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace