RhinoCommon API
ObjectTable.AddSubD Method (SubD, ObjectAttributes)
Adds a SubD object to Rhino.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Guid AddSubD(
	SubD subD,
	ObjectAttributes attributes
)
Public Function AddSubD (
	subD As SubD,
	attributes As ObjectAttributes
) As Guid
Parameters
subD
Type: Rhino.Geometry.SubD
A duplicate of this SubD is added to Rhino.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes that will be linked with the object.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddSubD Overload
Rhino.DocObjects.Tables Namespace