RhinoCommon API
RhinoDoc.Create Method
 Creates a new RhinoDoc
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public static RhinoDoc Create(
	string modelTemplateFileName
)
Public Shared Function Create (
	modelTemplateFileName As String
) As RhinoDoc
Parameters
modelTemplateFileName
Type: System.String
 Name of a Rhino model to use as a template to initialize the document. If the template contains views, those views are created. If null, an empty document with no views is created
Return Value
Type: RhinoDoc
[Missing <returns> documentation for "M:Rhino.RhinoDoc.Create(System.String)"]
See Also
Reference
RhinoDoc Class
Rhino Namespace