RhinoCommon API
UndoRecord Constructor
 UndoRecord Constructor
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public UndoRecord(
	string description,
	IRdkViewModel viewModel
)
Public Sub New (
	description As String,
	viewModel As IRdkViewModel
)
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.UI.Controls.UndoRecord.#ctor(System.String,Rhino.UI.Controls.IRdkViewModel)"]
viewModel
Type: Rhino.UI.Controls.IRdkViewModel
[Missing <param name="viewModel"/> documentation for "M:Rhino.UI.Controls.UndoRecord.#ctor(System.String,Rhino.UI.Controls.IRdkViewModel)"]
Return Value
Type:
Return the undo record
See Also
Reference
UndoRecord Class
Rhino.UI.Controls Namespace