RhinoCommon API
Mesh.CreateContourCurves Method (Mesh, Plane)
Note: This API is now obsolete.
 (Old call maintained for compatibility.)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Prefer the option that takes a tolerance value.")]
public static Curve[] CreateContourCurves(
	Mesh meshToContour,
	Plane sectionPlane
)
<ObsoleteAttribute("Prefer the option that takes a tolerance value.")>
Public Shared Function CreateContourCurves (
	meshToContour As Mesh,
	sectionPlane As Plane
) As Curve()
Parameters
meshToContour
Type: Rhino.Geometry.Mesh
Avoid.
sectionPlane
Type: Rhino.Geometry.Plane
Avoid.
Return Value
Type: Curve[]
Avoid.
See Also
Reference
Mesh Class
CreateContourCurves Overload
Rhino.Geometry Namespace