RhinoCommon API
Panels.GetPanels<T> Method (RhinoDoc)
[Missing <summary> documentation for "M:Rhino.UI.Panels.GetPanels``1(Rhino.RhinoDoc)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static T[] GetPanels<T>(
	RhinoDoc doc
)
where T : class
Public Shared Function GetPanels(Of T As Class) (
	doc As RhinoDoc
) As T()
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.UI.Panels.GetPanels``1(Rhino.RhinoDoc)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.UI.Panels.GetPanels``1(Rhino.RhinoDoc)"]
Return Value
Type: T[]
[Missing <returns> documentation for "M:Rhino.UI.Panels.GetPanels``1(Rhino.RhinoDoc)"]
See Also
Reference
Panels Class
GetPanels Overload
Rhino.UI Namespace