RhinoCommon API
BezierSurface.Reverse Method
 Reverses parameterization Domain changes from [a,b] to [-b,-a]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public BezierSurface Reverse(
	int direction
)
Public Function Reverse (
	direction As Integer
) As BezierSurface
Parameters
direction
Type: System.Int32
 0 for first parameter's domain, 1 for second parameter's domain.
Return Value
Type: BezierSurface
a new reversed surface on success.
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace