RhinoCommon API
Transform.Affineize Method
 Replaces the last row with (0 0 0 1), discarding any perspective part of this transform
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public void Affineize()
Public Sub Affineize
See Also
Reference
Transform Structure
Rhino.Geometry Namespace