RhinoCommon API
RenderContentCollection.SetForcedVaries Method
 Set the collection to 'varies'. Only valid if the collection is a 'selection' collection. Useful for clients that only support single content selections.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.9
Syntax
public void SetForcedVaries(
	bool b
)
Public Sub SetForcedVaries (
	b As Boolean
)
Parameters
b
Type: System.Boolean
Varies if true
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace