RhinoCommon API
PersistentSettings.SetChar Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetChar(System.String,System.Char)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetChar(
	string key,
	char value
)
Public Sub SetChar (
	key As String,
	value As Char
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetChar(System.String,System.Char)"]
value
Type: System.Char
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetChar(System.String,System.Char)"]
See Also
Reference
PersistentSettings Class
Rhino Namespace