RhinoCommon API
File3dmCommonComponentTable<T>.Dump Method
Prepares a text dump of object table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Dump()
Public Function Dump As String
Return Value
Type: String
A string containing the dump.
See Also
Reference
File3dmCommonComponentTable<T> Class
Rhino.FileIO Namespace