RhinoCommon API
IZooClientUtilities.GetLicenseType Method
 Returns the type of a specified product license
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
int GetLicenseType(
	Object verify,
	Guid productId
)
Function GetLicenseType (
	verify As Object,
	productId As Guid
) As Integer
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.GetLicenseType(System.Object,System.Guid)"]
productId
Type: System.Guid
[Missing <param name="productId"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.GetLicenseType(System.Object,System.Guid)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.GetLicenseType(System.Object,System.Guid)"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace