RhinoCommon API
Matrix.Scale Method
 Modifies the current matrix by multiplying its values by a number.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Scale(
	double s
)
Public Sub Scale (
	s As Double
)
Parameters
s
Type: System.Double
A scale factor.
See Also
Reference
Matrix Class
Rhino.Geometry Namespace