RhinoCommon API
BrepFace.ShrinkSurfaceToEdge Method
 Shrinks the underlying untrimmed surface of this Brep face right to the trimming boundaries. Note, shrinking the trimmed surface can sometimes cause problems later since having the edges so close to the trimming boundaries can cause commands that use the surface edges as input to fail.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.16
Syntax
public bool ShrinkSurfaceToEdge()
Public Function ShrinkSurfaceToEdge As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace