RhinoCommon API
RenderPipeline.OnRenderWindowBegin Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.OnRenderWindowBegin(Rhino.Display.RhinoView,System.Drawing.Rectangle)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract bool OnRenderWindowBegin(
	RhinoView view,
	Rectangle rectangle
)
Protected MustOverride Function OnRenderWindowBegin (
	view As RhinoView,
	rectangle As Rectangle
) As Boolean
Parameters
view
Type: Rhino.Display.RhinoView
[Missing <param name="view"/> documentation for "M:Rhino.Render.RenderPipeline.OnRenderWindowBegin(Rhino.Display.RhinoView,System.Drawing.Rectangle)"]
rectangle
Type: System.Drawing.Rectangle
[Missing <param name="rectangle"/> documentation for "M:Rhino.Render.RenderPipeline.OnRenderWindowBegin(Rhino.Display.RhinoView,System.Drawing.Rectangle)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.OnRenderWindowBegin(Rhino.Display.RhinoView,System.Drawing.Rectangle)"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace