RhinoCommon API
DisplayAttributeMaterial.GetTexture Method
 Gets the texture of the given type, or null when this material has none.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Texture GetTexture(
	TextureType which
)
Public Function GetTexture (
	which As TextureType
) As Texture
Parameters
which
Type: Rhino.DocObjects.TextureType
 The texture type. None matches nothing.
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.Display.DisplayAttributeMaterial.GetTexture(Rhino.DocObjects.TextureType)"]
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace