RhinoCommon API
LinearWorkflow.Equals Method
 Compare two LinearWorkflow objects. They are considered equal if their hashes match.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
[Missing <param name="obj"/> documentation for "M:Rhino.Render.LinearWorkflow.Equals(System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.LinearWorkflow.Equals(System.Object)"]
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace