RhinoCommon API
RenderMaterialTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterialTable.GetEnumerator"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public IEnumerator<RenderMaterial> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of RenderMaterial)
Return Value
Type: IEnumerator<RenderMaterial>
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterialTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
RenderMaterialTable Class
Rhino.Render Namespace