RhinoCommon API
DisplayPipelineAttributes.SetDitherTransparencyEffect Method
 Set a dither transparency effect to make objects render with a given amount of transparency using a dither effect.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetDitherTransparencyEffect(
	 in float transparencyAmount
)
Public Sub SetDitherTransparencyEffect (
	 ByRef transparencyAmount As Single
)
Parameters
transparencyAmount
Type: System.Single
The amount of transparency (0..1).
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace