RhinoCommon API
HatchPatternTable.Delete Method (IEnumerable<Int32>, Boolean)
 Delete multiple hatch patterns.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Delete(
	IEnumerable<int> hatchPatternIndices,
	bool quiet
)
Public Function Delete (
	hatchPatternIndices As IEnumerable(Of Integer),
	quiet As Boolean
) As Integer
Parameters
hatchPatternIndices
Type: System.Collections.Generic.IEnumerable<Int32>
An enumeration of hatch pattern indices.
quiet
Type: System.Boolean
If true, no warning message box appears if a hatch pattern is in use.
Return Value
Type: Int32
The number of hatch patterns that were deleted.
See Also
Reference
HatchPatternTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace