RhinoCommon API
File3dmEmbeddedFiles Constructor
Initializes a new instance of the File3dmEmbeddedFiles class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmEmbeddedFiles(
	File3dm f
)
Public Sub New (
	f As File3dm
)
Parameters
f
Type: Rhino.FileIO.File3dm
[Missing <param name="f"/> documentation for "M:Rhino.FileIO.File3dmEmbeddedFiles.#ctor(Rhino.FileIO.File3dm)"]
See Also
Reference
File3dmEmbeddedFiles Class
Rhino.FileIO Namespace