RhinoCommon API
StdVectorGuid.Append Method
 Appends a new Guid at the end of this vector.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Append(
	Guid uuid
)
Public Sub Append (
	uuid As Guid
)
Parameters
uuid
Type: System.Guid
[Missing <param name="uuid"/> documentation for "M:Rhino.Runtime.InteropWrappers.StdVectorGuid.Append(System.Guid)"]
See Also
Reference
StdVectorGuid Class
Rhino.Runtime.InteropWrappers Namespace