RhinoCommon API
RenderMeshProvider.RegisterProvider Method
 Register RenderMeshProvider without relying on the auto-plug-in registration.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool RegisterProvider(
	RenderMeshProvider provider,
	PlugIn plugin
)
Public Shared Function RegisterProvider (
	provider As RenderMeshProvider,
	plugin As PlugIn
) As Boolean
Parameters
provider
Type: Rhino.Render.CustomRenderMeshes.RenderMeshProvider
[Missing <param name="provider"/> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshProvider.RegisterProvider(Rhino.Render.CustomRenderMeshes.RenderMeshProvider,Rhino.PlugIns.PlugIn)"]
plugin
Type: Rhino.PlugIns.PlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshProvider.RegisterProvider(Rhino.Render.CustomRenderMeshes.RenderMeshProvider,Rhino.PlugIns.PlugIn)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshProvider.RegisterProvider(Rhino.Render.CustomRenderMeshes.RenderMeshProvider,Rhino.PlugIns.PlugIn)"]
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace