RhinoCommon API
ObjRef.SelectionMethod Method
 Gets the method used to select this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SelectionMethod SelectionMethod()
Public Function SelectionMethod As SelectionMethod
Return Value
Type: SelectionMethod
The method used to select this object.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace