RhinoCommon API
RTree.Point3dClosestPoints Method
 Finds the point in a list of 3D points that is closest to a test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static IEnumerable<int[]> Point3dClosestPoints(
	IEnumerable<Point3d> hayPoints,
	IEnumerable<Point3d> needlePts,
	double limitDistance
)
Public Shared Function Point3dClosestPoints (
	hayPoints As IEnumerable(Of Point3d),
	needlePts As IEnumerable(Of Point3d),
	limitDistance As Double
) As IEnumerable(Of Integer())
Parameters
hayPoints
Type: System.Collections.Generic.IEnumerable<Point3d>
A series of points.
needlePts
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to search for.
limitDistance
Type: System.Double
The maximum allowed distance.
Return Value
Type: IEnumerable<Int32[]>
An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
See Also
Reference
RTree Class
Rhino.Geometry Namespace