RhinoCommon API
File3dmStringTable.GetEntryNames Method
 Return list of all entry names for a given section of document strings in the 3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string[] GetEntryNames(
	string section
)
Public Function GetEntryNames (
	section As String
) As String()
Parameters
section
Type: System.String
The section from which to retrieve section names.
Return Value
Type: String[]
An array of section names. This can be empty, but not null.
See Also
Reference
File3dmStringTable Class
Rhino.FileIO Namespace