RhinoCommon API
ContentUI.EditorUuid Method
 Get the unique identifier of the editor that the UI is being displayed in.
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public virtual Guid EditorUuid()
Public Overridable Function EditorUuid As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.Controls.ContentUI.EditorUuid"]
See Also
Reference
ContentUI Class
Rhino.UI.Controls Namespace