RhinoCommon API
ObjectPropertiesPageCollection.Add Method
 Custom page to add
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Add(
	ObjectPropertiesPage page
)
Public Sub Add (
	page As ObjectPropertiesPage
)
Parameters
page
Type: Rhino.UI.ObjectPropertiesPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.ObjectPropertiesPageCollection.Add(Rhino.UI.ObjectPropertiesPage)"]
See Also
Reference
ObjectPropertiesPageCollection Class
Rhino.UI Namespace