RhinoCommon API
IUserInterfaceSection.UserInterfaceDisplayData Method
 Called by UserInterfaceSection when the selected content changes or a content field property value changes.
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
void UserInterfaceDisplayData(
	UserInterfaceSection userInterfaceSection,
	RenderContent[] renderContentList
)
Sub UserInterfaceDisplayData (
	userInterfaceSection As UserInterfaceSection,
	renderContentList As RenderContent()
)
Parameters
userInterfaceSection
Type: Rhino.Render.UI.UserInterfaceSection
 The UserInterfaceSection object that called this interface method.
renderContentList
Type: Rhino.Render.RenderContent[]
 The currently selected list of content items to edit.
See Also
Reference
IUserInterfaceSection Interface
Rhino.Render.UI Namespace