RhinoCommon API
BinaryArchiveReader.ReadShort Method
 Reads a Int16 from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public short ReadShort()
Public Function ReadShort As Short
Return Value
Type: Int16
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace