RhinoCommon API
Vector2d.Rotate Method
 Rotates this vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Rotate(
	double angleRadians
)
Public Function Rotate (
	angleRadians As Double
) As Boolean
Parameters
angleRadians
Type: System.Double
Angle of rotation (in radians).
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace