RhinoCommon API
SimpleArraySubDPointer.ToNonConstArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public SubD[] ToNonConstArray()
Public Function ToNonConstArray As SubD()
Return Value
Type: SubD[]
The managed array.
See Also
Reference
SimpleArraySubDPointer Class
Rhino.Runtime.InteropWrappers Namespace