RhinoCommon API
Dithering.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.Dithering.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
Dithering Class
Rhino.Render Namespace