RhinoCommon API
RhinoApp.SetCommandPrompt Method (String)
Set Rhino command prompt.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void SetCommandPrompt(
	string prompt
)
Public Shared Sub SetCommandPrompt (
	prompt As String
)
Parameters
prompt
Type: System.String
The new prompt text.
See Also
Reference
RhinoApp Class
SetCommandPrompt Overload
Rhino Namespace