RhinoCommon API
SubDEdgeChain.VertexAt Method
 Gets the vertex at the given position along the chain. A chain of N edges has N+1 vertices, or N when it is a closed loop.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDVertex VertexAt(
	int index
)
Public Function VertexAt (
	index As Integer
) As SubDVertex
Parameters
index
Type: System.Int32
The position along the chain.
Return Value
Type: SubDVertex
The vertex, or null if index is out of range.
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace