RhinoCommon API
TextureEvaluator.GetColor Method (Point3d, Vector3d, Vector3d, Color4f)
 Optimized version of GetColor for callers. Much faster in the case of a native (C++) evaluator.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool GetColor(
	Point3d uvw,
	Vector3d duvwdx,
	Vector3d duvwdy,
	ref Color4f color
)
Public Function GetColor (
	uvw As Point3d,
	duvwdx As Vector3d,
	duvwdy As Vector3d,
	ByRef color As Color4f
) As Boolean
Parameters
uvw
Type: Rhino.Geometry.Point3d
is the point for which to evaluate the texture.
duvwdx
Type: Rhino.Geometry.Vector3d
duvwdx is a ray differential.
duvwdy
Type: Rhino.Geometry.Vector3d
duvwdy is a ray differential.
color
Type: Rhino.Display.Color4f
The texture color at this point in UV space.
Return Value
Type: Boolean
True if the evaluator returned a valid color. Otherwise false.
See Also
Reference
TextureEvaluator Class
GetColor Overload
Rhino.Render Namespace