RhinoCommon API
SubD.SurfaceMeshCacheExists Method
 Checks that a surface mesh evaluation cache exists, and that it has the required options. This cache is used by - SurfacePoint(), - ToNurbsCurve(Boolean), and - CreateFromSubD(SubD, Int32).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public bool SurfaceMeshCacheExists(
	bool bTextureCoordinatesExist,
	bool bCurvaturesExist,
	bool bColorsExist
)
Public Function SurfaceMeshCacheExists (
	bTextureCoordinatesExist As Boolean,
	bCurvaturesExist As Boolean,
	bColorsExist As Boolean
) As Boolean
Parameters
bTextureCoordinatesExist
Type: System.Boolean
If True, the cache must contain texture coordinates information.
bCurvaturesExist
Type: System.Boolean
If True, the cache must contain curvature information.
bColorsExist
Type: System.Boolean
If True, the cache must contain color information.
Return Value
Type: Boolean
True if the cache exists on all face fragments and has the required options.
Remarks
This does not check that the cache is up to date, UpdateSurfaceMeshCache(Boolean).
See Also
Reference
SubD Class
Rhino.Geometry Namespace
SubD.ClearEvaluationCache()
SubD.CopyEvaluationCache(SubD)