RhinoCommon API
Surface.IsIsoparametric Method (Curve)
 Determines if a 2d curve is isoparametric in the parameter space of this surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IsoStatus IsIsoparametric(
	Curve curve
)
Public Function IsIsoparametric (
	curve As Curve
) As IsoStatus
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to test.
Return Value
Type: IsoStatus
IsoStatus flag describing the iso-parametric relationship between the surface and the curve.
See Also
Reference
Surface Class
IsIsoparametric Overload
Rhino.Geometry Namespace