RhinoCommon API
PlugIn.LoadPlugIn Method (Guid)
 Loads an installed plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool LoadPlugIn(
	Guid pluginId
)
Public Shared Function LoadPlugIn (
	pluginId As Guid
) As Boolean
Parameters
pluginId
Type: System.Guid
The id of the installed plug-in.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
PlugIn Class
LoadPlugIn Overload
Rhino.PlugIns Namespace