RhinoCommon API
IPanelsService.UnhookDeleteAndDestroyDockBar Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.UnhookDeleteAndDestroyDockBar(System.Guid)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
bool UnhookDeleteAndDestroyDockBar(
	Guid id
)
Function UnhookDeleteAndDestroyDockBar (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.UI.IPanelsService.UnhookDeleteAndDestroyDockBar(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.UnhookDeleteAndDestroyDockBar(System.Guid)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace