RhinoCommon API
GroupTable.RemapObjects Method (IEnumerable<RhinoObject>)
 Remaps an enumeration of Rhino objects to new groups.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.16
Syntax
public int RemapObjects(
	IEnumerable<RhinoObject> rhinoObjects
)
Public Function RemapObjects (
	rhinoObjects As IEnumerable(Of RhinoObject)
) As Integer
Parameters
rhinoObjects
Type: System.Collections.Generic.IEnumerable<RhinoObject>
The enumeration of Rhino objects.
Return Value
Type: Int32
The number of Rhino objects that were modified.
Remarks
 In some situations, a bunch of Rhino objects are copied, new groups need to be created. This method handles the details.
See Also
Reference
GroupTable Class
RemapObjects Overload
Rhino.DocObjects.Tables Namespace