RhinoCommon API
GetObject.AppendToPickList Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetObject.AppendToPickList(Rhino.DocObjects.ObjRef)"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public void AppendToPickList(
	ObjRef objref
)
Public Sub AppendToPickList (
	objref As ObjRef
)
Parameters
objref
Type: Rhino.DocObjects.ObjRef
[Missing <param name="objref"/> documentation for "M:Rhino.Input.Custom.GetObject.AppendToPickList(Rhino.DocObjects.ObjRef)"]
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace