RhinoCommon API
MeshCageMorph Constructor
Constructs a mesh cage morph
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public MeshCageMorph(
	Mesh referenceMesh,
	Mesh targetMesh
)
Public Sub New (
	referenceMesh As Mesh,
	targetMesh As Mesh
)
Parameters
referenceMesh
Type: Rhino.Geometry.Mesh
[Missing <param name="referenceMesh"/> documentation for "M:Rhino.Geometry.Morphs.MeshCageMorph.#ctor(Rhino.Geometry.Mesh,Rhino.Geometry.Mesh)"]
targetMesh
Type: Rhino.Geometry.Mesh
[Missing <param name="targetMesh"/> documentation for "M:Rhino.Geometry.Morphs.MeshCageMorph.#ctor(Rhino.Geometry.Mesh,Rhino.Geometry.Mesh)"]
See Also
Reference
MeshCageMorph Class
Rhino.Geometry.Morphs Namespace