RhinoCommon API
GumballDisplayConduit.UpdateGumball Method (Point3d, Line)
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.UpdateGumball(Rhino.Geometry.Point3d,Rhino.Geometry.Line)"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool UpdateGumball(
	Point3d point,
	Line worldLine
)
Public Function UpdateGumball (
	point As Point3d,
	worldLine As Line
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
[Missing <param name="point"/> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.UpdateGumball(Rhino.Geometry.Point3d,Rhino.Geometry.Line)"]
worldLine
Type: Rhino.Geometry.Line
[Missing <param name="worldLine"/> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.UpdateGumball(Rhino.Geometry.Point3d,Rhino.Geometry.Line)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.UpdateGumball(Rhino.Geometry.Point3d,Rhino.Geometry.Line)"]
See Also
Reference
GumballDisplayConduit Class
UpdateGumball Overload
Rhino.UI.Gumball Namespace