RhinoCommon API
DraftAngleAnalysisSettings.UpdateFromState Method
 Sets all settings to a particular defined joined state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static void UpdateFromState(
	DraftAngleAnalysisSettingsState state
)
Public Shared Sub UpdateFromState (
	state As DraftAngleAnalysisSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.DraftAngleAnalysisSettingsState
The particular state.
See Also
Reference
DraftAngleAnalysisSettings Class
Rhino.ApplicationSettings Namespace