RhinoCommon API
IPanelsService.FactoryResetSettings Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.FactoryResetSettings"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
void FactoryResetSettings()
Sub FactoryResetSettings
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace