RhinoCommon API
TextFields.DimValue Method (String)
 Returns the measured value of a dimension formatted with the dimension's own annotation style.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static string DimValue(
	string dimensionId
)
Public Shared Function DimValue (
	dimensionId As String
) As String
Parameters
dimensionId
Type: System.String
[Missing <param name="dimensionId"/> documentation for "M:Rhino.Runtime.TextFields.DimValue(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.DimValue(System.String)"]
See Also
Reference
TextFields Class
DimValue Overload
Rhino.Runtime Namespace