RhinoCommon API
MeshNgon.Set Method
 Set the ngon vertex and face index lists.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Set(
	IList<int> meshVertexIndexList,
	IList<int> meshFaceIndexList
)
Public Sub Set (
	meshVertexIndexList As IList(Of Integer),
	meshFaceIndexList As IList(Of Integer)
)
Parameters
meshVertexIndexList
Type: System.Collections.Generic.IList<Int32>
 A list of mesh vertex indexes that define the outer boundary of the ngon. The mesh vertex indexes must be in the correct order.
meshFaceIndexList
Type: System.Collections.Generic.IList<Int32>
 A list of mesh face indexes that define the interior of the ngon. The mesh face indexes may be in any order.
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace