RhinoCommon API
CurvatureAnalysisSettings.UpdateFromState Method
 Sets all settings to a particular defined joined state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void UpdateFromState(
	CurvatureAnalysisSettingsState state
)
Public Shared Sub UpdateFromState (
	state As CurvatureAnalysisSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.CurvatureAnalysisSettingsState
The particular state.
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace