RhinoCommon API
Curve.GetLocalTangentPoint Method (Point3d, Double, Double)
 Search for a location on the curve, near seedParmameter, that is tangent to a test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GetLocalTangentPoint(
	Point3d testPoint,
	double seedParmameter,
	out double curveParameter
)
Public Function GetLocalTangentPoint (
	testPoint As Point3d,
	seedParmameter As Double,
	<OutAttribute> ByRef curveParameter As Double
) As Boolean
Parameters
testPoint
Type: Rhino.Geometry.Point3d
The test point.
seedParmameter
Type: System.Double
A "seed" parameter on the curve.
curveParameter
Type: System.Double
The parameter value at the tangent point
Return Value
Type: Boolean
True if a solution is found, false otherwise.
See Also
Reference
Curve Class
GetLocalTangentPoint Overload
Rhino.Geometry Namespace