RhinoCommon API
MeshInstance.AncestryRecord.Dispose Method (Boolean)
 Dispose. Disposes unmanaged memory.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool isDisposing
)
Protected Overridable Sub Dispose (
	isDisposing As Boolean
)
Parameters
isDisposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
MeshInstance.AncestryRecord Class
Dispose Overload
Rhino.Render.ChangeQueue Namespace