RhinoCommon API
CurveKinkDefinition.IsTangentKink Method (Vector3d, Vector3d)
 True if the angle between tangent_from_below and tangent_from_above is > KinkAngleDegrees
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsTangentKink(
	Vector3d tangentFromBelow,
	Vector3d tangentFromAbove
)
Public Function IsTangentKink (
	tangentFromBelow As Vector3d,
	tangentFromAbove As Vector3d
) As Boolean
Parameters
tangentFromBelow
Type: Rhino.Geometry.Vector3d
tangentFromAbove
Type: Rhino.Geometry.Vector3d
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.CurveKinkDefinition.IsTangentKink(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)"]
See Also
Reference
CurveKinkDefinition Class
IsTangentKink Overload
Rhino.Geometry Namespace