RhinoCommon API
SHA1OpenNURBS.Initialize Method
 Resets this instance of the algorithm, so that it can be used again. It is not required to call this method after creation.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override void Initialize()
Public Overrides Sub Initialize
See Also
Reference
SHA1OpenNURBS Class
Rhino.FileIO Namespace