RhinoCommon API
PostEffectPipeline.ExecutionOrder Method
 Returns a list of the post effects to be executed by this pipeline in order.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Guid[] ExecutionOrder()
Public Function ExecutionOrder As Guid()
Return Value
Type: Guid[]
A list of the post effects to be executed by this pipeline in order
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace