RhinoCommon API
ObjectTable.AddOrderedPointCloud Method (Int32, Int32, Int32, Point3d[], ObjectAttributes, HistoryRecord, Boolean)
Adds a point cloud object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid AddOrderedPointCloud(
	int xCt,
	int yCt,
	int zCt,
	Point3d[] box,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddOrderedPointCloud (
	xCt As Integer,
	yCt As Integer,
	zCt As Integer,
	box As Point3d(),
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
xCt
Type: System.Int32
Number of points in X dir.
yCt
Type: System.Int32
Number of points in Y dir.
zCt
Type: System.Int32
Number of points in Z dir.
box
Type: Rhino.Geometry.Point3d[]
box to use for output, does not need to be a boundingbox. The function that takes to points assumes it's a bounding box.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to point cloud. null is acceptable
history
Type: Rhino.DocObjects.HistoryRecord
history associated with this point cloud. null is acceptable
reference
Type: System.Boolean
 true if the object is from a reference file. Reference objects do not persist in archives
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddOrderedPointCloud Overload
Rhino.DocObjects.Tables Namespace