RhinoCommon API
ChangeQueue Constructor (Guid, UInt32, ViewInfo, DisplayPipelineAttributes, Boolean, Boolean)
 Construct a new ChangeQueue from the given document, using given display pipeline attributes.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected ChangeQueue(
	Guid pluginId,
	uint docRuntimeSerialNumber,
	ViewInfo viewinfo,
	DisplayPipelineAttributes attributes,
	bool bRespectDisplayPipelineAttributes,
	bool bNotifyChanges
)
Protected Sub New (
	pluginId As Guid,
	docRuntimeSerialNumber As UInteger,
	viewinfo As ViewInfo,
	attributes As DisplayPipelineAttributes,
	bRespectDisplayPipelineAttributes As Boolean,
	bNotifyChanges As Boolean
)
Parameters
pluginId
Type: System.Guid
Id of plugin instantiating ChangeQueue
docRuntimeSerialNumber
Type: System.UInt32
[Missing <param name="docRuntimeSerialNumber"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.#ctor(System.Guid,System.UInt32,Rhino.DocObjects.ViewInfo,Rhino.Display.DisplayPipelineAttributes,System.Boolean,System.Boolean)"]
viewinfo
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="viewinfo"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.#ctor(System.Guid,System.UInt32,Rhino.DocObjects.ViewInfo,Rhino.Display.DisplayPipelineAttributes,System.Boolean,System.Boolean)"]
attributes
Type: Rhino.Display.DisplayPipelineAttributes
Display pipeline attributes to use.
bRespectDisplayPipelineAttributes
Type: System.Boolean
Determines whether the display pipeline attributes for this viewport should be taken into account when supplying data. If you are using this queue to populate a scene for the "Render" command, set this to false. If you are using it to draw a realtime preview, you will probably want to set it to true.
bNotifyChanges
Type: System.Boolean
Determines whether you want to receive updates when the model changes. If you are rendering for a view capture, print or something similar, you will probably want to set this to false.
See Also
Reference
ChangeQueue Class
ChangeQueue Overload
Rhino.Render.ChangeQueue Namespace