RhinoCommon API
WorksessionFileLayerValues.GetLayer Method
 Gets a copy of the rest of the layer's settings, saved by Rhino 9 and later. Reading an older file leaves this set to a default layer.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Layer GetLayer()
Public Function GetLayer As Layer
Return Value
Type: Layer
A new layer. Changes to it are kept only after SetLayer(Layer).
Remarks
 Rhino uses the print color and width, model visibility, visibility in new details, whether the layer is expanded, and the per-viewport settings. It does not use the layer's id, and a layer saved without one gets a new id when it is read.
See Also
Reference
WorksessionFileLayerValues Class
Rhino.FileIO Namespace