RhinoCommon API
Brep.SetTolerancesBoxesAndFlags Method (Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Set tolerances and flags in a Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetTolerancesBoxesAndFlags(
	bool bLazy,
	bool bSetVertexTolerances,
	bool bSetEdgeTolerances,
	bool bSetTrimTolerances,
	bool bSetTrimIsoFlags,
	bool bSetTrimTypeFlags,
	bool bSetLoopTypeFlags,
	bool bSetTrimBoxes
)
Public Sub SetTolerancesBoxesAndFlags (
	bLazy As Boolean,
	bSetVertexTolerances As Boolean,
	bSetEdgeTolerances As Boolean,
	bSetTrimTolerances As Boolean,
	bSetTrimIsoFlags As Boolean,
	bSetTrimTypeFlags As Boolean,
	bSetLoopTypeFlags As Boolean,
	bSetTrimBoxes As Boolean
)
Parameters
bLazy
Type: System.Boolean
If true, only flags and tolerances that are not set will be calculated.
bSetVertexTolerances
Type: System.Boolean
Set true to compute BrepVertex tolerances.
bSetEdgeTolerances
Type: System.Boolean
Set true to compute BrepEdge tolerances.
bSetTrimTolerances
Type: System.Boolean
Set true to compute BrepTrim tolerances.
bSetTrimIsoFlags
Type: System.Boolean
Set true to compute BrepTrim.IsoStatus values.
bSetTrimTypeFlags
Type: System.Boolean
Set true to compute BrepTrim.TrimType values.
bSetLoopTypeFlags
Type: System.Boolean
Set true to compute BrepLoop.BrepLoopType values.
bSetTrimBoxes
Type: System.Boolean
Set true to compute BrepTrim bounding boxes.
See Also
Reference
Brep Class
SetTolerancesBoxesAndFlags Overload
Rhino.Geometry Namespace