RhinoCommon API
Hatch.CreateFromBrep Method
 Create a hatch from a planar face of a Brep
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static Hatch CreateFromBrep(
	Brep brep,
	int brepFaceIndex,
	int hatchPatternIndex,
	double rotationRadians,
	double scale,
	Point3d basePoint
)
Public Shared Function CreateFromBrep (
	brep As Brep,
	brepFaceIndex As Integer,
	hatchPatternIndex As Integer,
	rotationRadians As Double,
	scale As Double,
	basePoint As Point3d
) As Hatch
Parameters
brep
Type: Rhino.Geometry.Brep
[Missing <param name="brep"/> documentation for "M:Rhino.Geometry.Hatch.CreateFromBrep(Rhino.Geometry.Brep,System.Int32,System.Int32,System.Double,System.Double,Rhino.Geometry.Point3d)"]
brepFaceIndex
Type: System.Int32
[Missing <param name="brepFaceIndex"/> documentation for "M:Rhino.Geometry.Hatch.CreateFromBrep(Rhino.Geometry.Brep,System.Int32,System.Int32,System.Double,System.Double,Rhino.Geometry.Point3d)"]
hatchPatternIndex
Type: System.Int32
[Missing <param name="hatchPatternIndex"/> documentation for "M:Rhino.Geometry.Hatch.CreateFromBrep(Rhino.Geometry.Brep,System.Int32,System.Int32,System.Double,System.Double,Rhino.Geometry.Point3d)"]
rotationRadians
Type: System.Double
[Missing <param name="rotationRadians"/> documentation for "M:Rhino.Geometry.Hatch.CreateFromBrep(Rhino.Geometry.Brep,System.Int32,System.Int32,System.Double,System.Double,Rhino.Geometry.Point3d)"]
scale
Type: System.Double
[Missing <param name="scale"/> documentation for "M:Rhino.Geometry.Hatch.CreateFromBrep(Rhino.Geometry.Brep,System.Int32,System.Int32,System.Double,System.Double,Rhino.Geometry.Point3d)"]
basePoint
Type: Rhino.Geometry.Point3d
[Missing <param name="basePoint"/> documentation for "M:Rhino.Geometry.Hatch.CreateFromBrep(Rhino.Geometry.Brep,System.Int32,System.Int32,System.Double,System.Double,Rhino.Geometry.Point3d)"]
Return Value
Type: Hatch
[Missing <returns> documentation for "M:Rhino.Geometry.Hatch.CreateFromBrep(Rhino.Geometry.Brep,System.Int32,System.Int32,System.Double,System.Double,Rhino.Geometry.Point3d)"]
See Also
Reference
Hatch Class
Rhino.Geometry Namespace