RhinoCommon API
PageViewGroupTable.FindNameHash Method
 Finds a page view group given its name hash.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PageViewGroup FindNameHash(
	NameHash nameHash
)
Public Function FindNameHash (
	nameHash As NameHash
) As PageViewGroup
Parameters
nameHash
Type: Rhino.FileIO.NameHash
The name hash of the page view group.
Return Value
Type: PageViewGroup
An page view group, or null if not found or on error.
See Also
Reference
PageViewGroupTable Class
Rhino.DocObjects.Tables Namespace