RhinoCommon API
FileStlReadOptions Constructor
Initializes a new instance of the FileStlReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileStlReadOptions()
Public Sub New
See Also
Reference
FileStlReadOptions Class
Rhino.FileIO Namespace