RhinoCommon API
ColorCMYK.CreateFromRGBA Method
 Create the nearest CMYK equivalent of a RGBA color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static ColorCMYK CreateFromRGBA(
	ColorRGBA rgba
)
Public Shared Function CreateFromRGBA (
	rgba As ColorRGBA
) As ColorCMYK
Parameters
rgba
Type: Rhino.Display.ColorRGBA
Target color in RGBA space.
Return Value
Type: ColorCMYK
The CMYK equivalent of the RGBA color.
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace