RhinoCommon API
ManifestTable.FindIndex Method (Int32, ModelComponentType)
 Uses the index to find a model component. The index is the value that is stored in the .Index property.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract ModelComponent FindIndex(
	int index,
	ModelComponentType type
)
Public MustOverride Function FindIndex (
	index As Integer,
	type As ModelComponentType
) As ModelComponent
Parameters
index
Type: System.Int32
Index of model component to search for.
type
Type: Rhino.DocObjects.ModelComponentType
The type to be searched. Cannot be Unset.
Return Value
Type: ModelComponent
Reference to the rhino object or null if no such object could be found.
See Also
Reference
ManifestTable Class
FindIndex Overload
Rhino.FileIO Namespace