RhinoCommon API
StatusBar.UpdateProgressMeter Method (UInt32, String, Int32, Boolean)
 Sets the label and current position of Rhino's status bar progress meter.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public static int UpdateProgressMeter(
	uint docSerialNumber,
	string label,
	int position,
	bool absolute
)
Public Shared Function UpdateProgressMeter (
	docSerialNumber As UInteger,
	label As String,
	position As Integer,
	absolute As Boolean
) As Integer
Parameters
docSerialNumber
Type: System.UInt32
The document runtime serial number.
label
Type: System.String
The short description of the progress (e.g. "Calculating", "Meshing", etc)
position
Type: System.Int32
 The new value. This can be stated in absolute terms, or relative compared to the current position. The interval bounds are specified when you first show the bar. Note, if value is , only the label is updated.
absolute
Type: System.Boolean
 If true, then the progress meter is moved to position. If false, then the progress meter is moved position from the current position (relative).
Return Value
Type: Int32
 The previous position if successful.
See Also
Reference
StatusBar Class
UpdateProgressMeter Overload
Rhino.UI Namespace
RhinoMath.UnsetIntIndex