RhinoCommon API
NamedLayerStateTable.Delete Method
 Deletes an existing named layer state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public bool Delete(
	string name
)
Public Function Delete (
	name As String
) As Boolean
Parameters
name
Type: System.String
The name of the layer state.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
NamedLayerStateTable Class
Rhino.DocObjects.Tables Namespace