RhinoCommon API
WorksessionFileLayerValues Constructor (WorksessionFileLayerValues)
Creates a copy of other layer settings.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFileLayerValues(
	WorksessionFileLayerValues other
)
Public Sub New (
	other As WorksessionFileLayerValues
)
Parameters
other
Type: Rhino.FileIO.WorksessionFileLayerValues
The settings to copy.
Exceptions
Exception | Condition
ArgumentNullException | If other is null.
See Also
Reference
WorksessionFileLayerValues Class
WorksessionFileLayerValues Overload
Rhino.FileIO Namespace