RhinoCommon API
StdVectorGuid Constructor
 Initializes a new StdVectorGuid class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public StdVectorGuid()
Public Sub New
See Also
Reference
StdVectorGuid Class
StdVectorGuid Overload
Rhino.Runtime.InteropWrappers Namespace