RhinoCommon API
RhinoDoc.ExtractPreviewImage Method
 Extracts the bitmap preview image from the specified .3dm file.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Bitmap ExtractPreviewImage(
	string path
)
Public Shared Function ExtractPreviewImage (
	path As String
) As Bitmap
Parameters
path
Type: System.String
 The .3dm file from which to extract the preview image. If null, the path to the active document is used.
Return Value
Type: Bitmap
The preview bitmap if successful, null otherwise.
See Also
Reference
RhinoDoc Class
Rhino Namespace