RhinoCommon API
PolyCurve.AppendSegment Method
 Appends the curve to the polycurve without changing the new segment's geometry. This function will fail if the PolyCurve is closed or if SegmentCount > 0 and the new segment is closed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AppendSegment(
	Curve curve
)
Public Function AppendSegment (
	curve As Curve
) As Boolean
Parameters
curve
Type: Rhino.Geometry.Curve
Segment to append.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace