RhinoCommon API
Sun.SunDirection Method
[Missing <summary> documentation for "M:Rhino.Render.Sun.SunDirection(System.Double,System.Double,System.DateTime)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector3d SunDirection(
	double latitude,
	double longitude,
	DateTime when
)
Public Shared Function SunDirection (
	latitude As Double,
	longitude As Double,
	when As DateTime
) As Vector3d
Parameters
latitude
Type: System.Double
[Missing <param name="latitude"/> documentation for "M:Rhino.Render.Sun.SunDirection(System.Double,System.Double,System.DateTime)"]
longitude
Type: System.Double
[Missing <param name="longitude"/> documentation for "M:Rhino.Render.Sun.SunDirection(System.Double,System.Double,System.DateTime)"]
when
Type: System.DateTime
[Missing <param name="when"/> documentation for "M:Rhino.Render.Sun.SunDirection(System.Double,System.Double,System.DateTime)"]
Return Value
Type: Vector3d
[Missing <returns> documentation for "M:Rhino.Render.Sun.SunDirection(System.Double,System.Double,System.DateTime)"]
See Also
Reference
Sun Class
Rhino.Render Namespace