RhinoCommon API
FileNwd.Write Method
Write a nwd file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	FileNwdWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As FileNwdWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileNwdWriteOptions
options used for generating the nwd file
Return Value
Type: Boolean
true on success
See Also
Reference
FileNwd Class
Rhino.FileIO Namespace