RhinoCommon API
Dimension.SetAltDimensionLengthDisplayWithZeroSuppressionReset Method
[Missing <summary> documentation for "M:Rhino.Geometry.Dimension.SetAltDimensionLengthDisplayWithZeroSuppressionReset(Rhino.DocObjects.DimensionStyle.LengthDisplay)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetAltDimensionLengthDisplayWithZeroSuppressionReset(
	DimensionStyle.LengthDisplay ld
)
Public Sub SetAltDimensionLengthDisplayWithZeroSuppressionReset (
	ld As DimensionStyle.LengthDisplay
)
Parameters
ld
Type: Rhino.DocObjects.DimensionStyle.LengthDisplay
[Missing <param name="ld"/> documentation for "M:Rhino.Geometry.Dimension.SetAltDimensionLengthDisplayWithZeroSuppressionReset(Rhino.DocObjects.DimensionStyle.LengthDisplay)"]
See Also
Reference
Dimension Class
Rhino.Geometry Namespace