RhinoCommon API
RhinoApp.SetFocusToMainWindow Method
 Sets the focus to the main window. This function attempts to use the ActiveDoc on Mac to figure out which window to set focus to.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void SetFocusToMainWindow()
Public Shared Sub SetFocusToMainWindow
See Also
Reference
RhinoApp Class
SetFocusToMainWindow Overload
Rhino Namespace