RhinoCommon API
EmapAnalysisSettings.GetDefaultFileNames Method
 Get list of emap's Default MRU filenames
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static string[] GetDefaultFileNames()
Public Shared Function GetDefaultFileNames As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.EmapAnalysisSettings.GetDefaultFileNames"]
See Also
Reference
EmapAnalysisSettings Class
Rhino.ApplicationSettings Namespace