RhinoCommon API
DisplayPipeline.PopProjection Method
 Pop a view projection off this pipelines projection stack
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void PopProjection()
Public Sub PopProjection
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace