RhinoCommon API
File3dmEmbeddedFiles.Add Method
 Add a new embedded file and load it from a local file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Add(
	string filename
)
Public Function Add (
	filename As String
) As Boolean
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.FileIO.File3dmEmbeddedFiles.Add(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmEmbeddedFiles.Add(System.String)"]
See Also
Reference
File3dmEmbeddedFiles Class
Rhino.FileIO Namespace