RhinoCommon API
Intersection.MeshMeshPredicate Method (IEnumerable<Mesh>, Double, Int32[], TextLog)
 Determines which meshes intersect. No geometry is computed: each pair of meshes is tested only until its first crossing is found, with the fast intersector behind MeshMeshFast(Mesh, Mesh). Faces that cross or touch within tolerance count; coplanar overlap without a crossing does not.
The same as MeshMeshPredicate(IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Boolean, IntersectingMeshPair[], TextLog, CancellationToken) with fast = true.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool MeshMeshPredicate(
	IEnumerable<Mesh> meshes,
	double tolerance,
	out int[] pairs,
	TextLog textLog
)
Public Shared Function MeshMeshPredicate (
	meshes As IEnumerable(Of Mesh),
	tolerance As Double,
	<OutAttribute> ByRef pairs As Integer(),
	textLog As TextLog
) As Boolean
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
The mesh input list. This cannot be null. Null entries are tolerated.
tolerance
Type: System.Double
A tolerance value. If negative, the positive value will be used. WARNING! Good tolerance values are in the magnitude of 10^-7, or RhinoMath.SqrtEpsilon*10.
pairs
Type: System.Int32[]
An array containing pairs of meshes that intersect.
textLog
Type: Rhino.FileIO.TextLog
A text log, or null.
Return Value
Type: Boolean
True, if meshes intersect, otherwise false. False is also returned on error, but textLog will start with Error: and contain the error.
See Also
Reference
Intersection Class
MeshMeshPredicate Overload
Rhino.Geometry.Intersect Namespace