RhinoCommon API
RealtimeDisplayMode.HudShowCustomStatusText Method
 Override to show status text in HUD. By default disabled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool HudShowCustomStatusText()
Public Overridable Function HudShowCustomStatusText As Boolean
Return Value
Type: Boolean
Return true to show status text in HUD
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace