RhinoCommon API
IRhRdkThumbnail.Dib Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.Dib(System.Drawing.Bitmap@)"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void Dib(
	ref Bitmap dibOut
)
Sub Dib (
	ByRef dibOut As Bitmap
)
Parameters
dibOut
Type: System.Drawing.Bitmap
[Missing <param name="dibOut"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.Dib(System.Drawing.Bitmap@)"]
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls.ThumbnailUI Namespace