RhinoCommon API
SimpleArrayInterval.ToArray Method
 Returns the managed counterpart of the unmanaged array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Interval[] ToArray()
Public Function ToArray As Interval()
Return Value
Type: Interval[]
The managed array.
See Also
Reference
SimpleArrayInterval Class
Rhino.Runtime.InteropWrappers Namespace