RhinoCommon API
Mesh.CreateVertexColorsFromBitmap Method
 Populate the vertex colors from a bitmap image.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.10
Syntax
public bool CreateVertexColorsFromBitmap(
	RhinoDoc doc,
	TextureMapping mapping,
	Transform xform,
	Bitmap bitmap
)
Public Function CreateVertexColorsFromBitmap (
	doc As RhinoDoc,
	mapping As TextureMapping,
	xform As Transform,
	bitmap As Bitmap
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
The document associated with this operation for searching purposes.
mapping
Type: Rhino.Render.TextureMapping
The texture mapping to be used on the mesh. Surface parameter mapping is assumed if null - but surface parameters must be available on the mesh.
xform
Type: Rhino.Geometry.Transform
Local mapping transform for the mesh mapping. Use identity for surface parameter mapping.
bitmap
Type: System.Drawing.Bitmap
The bitmap to use for the colors.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.CreateVertexColorsFromBitmap(Rhino.RhinoDoc,Rhino.Render.TextureMapping,Rhino.Geometry.Transform,System.Drawing.Bitmap)"]
See Also
Reference
Mesh Class
Rhino.Geometry Namespace