RhinoCommon API
Point3d.GreaterThan Operator
 Determines whether the first specified point comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool operator >(
	Point3d a,
	Point3d b
)
Public Shared Operator > (
	a As Point3d,
	b As Point3d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point3d
The first point.
b
Type: Rhino.Geometry.Point3d
The second point.
Return Value
Type: Boolean
true if a.X is larger than b.X, or a.X == b.X and a.Y is larger than b.Y, or a.X == b.X and a.Y == b.Y and a.Z is larger than b.Z; otherwise, false.
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace