RhinoCommon API
Triangle3d.Transform Method
 Transform this triangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Triangle3d Transform(
	Transform transform
)
Public Function Transform (
	transform As Transform
) As Triangle3d
Parameters
transform
Type: Rhino.Geometry.Transform
[Missing <param name="transform"/> documentation for "M:Rhino.Geometry.Triangle3d.Transform(Rhino.Geometry.Transform)"]
Return Value
Type: Triangle3d
[Missing <returns> documentation for "M:Rhino.Geometry.Triangle3d.Transform(Rhino.Geometry.Transform)"]
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace