RhinoCommon API
DisplayPipeline.DrawCurve Method (Curve, DisplayPen)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawCurve(Rhino.Geometry.Curve,Rhino.Display.DisplayPen)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void DrawCurve(
	Curve curve,
	DisplayPen pen
)
Public Sub DrawCurve (
	curve As Curve,
	pen As DisplayPen
)
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawCurve(Rhino.Geometry.Curve,Rhino.Display.DisplayPen)"]
pen
Type: Rhino.Display.DisplayPen
[Missing <param name="pen"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawCurve(Rhino.Geometry.Curve,Rhino.Display.DisplayPen)"]
See Also
Reference
DisplayPipeline Class
DrawCurve Overload
Rhino.Display Namespace