RhinoCommon API
FileGHS.Read Method
Read a Ghs file into a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	FileGHSReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As FileGHSReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.FileGHSReadOptions
options used for importing the Ai file
Return Value
Type: Boolean
true on success
See Also
Reference
FileGHS Class
Rhino.FileIO Namespace