RhinoCommon API
ToolbarFile.GetToolbar Method
 Gets a toolbar.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Toolbar GetToolbar(
	int index
)
Public Function GetToolbar (
	index As Integer
) As Toolbar
Parameters
index
Type: System.Int32
The index of the toolbar.
Return Value
Type: Toolbar
The toolbar if successful, null otherwise.
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace