RhinoCommon API
DisplayEngine Constructor
Initializes a new instance of the DisplayEngine class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected DisplayEngine()
Protected Sub New
See Also
Reference
DisplayEngine Class
Rhino.Display Namespace