RhinoCommon API
Plane.IsCoplanar Method (Plane, Double)
 Test if this plane is co-planar with a another plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsCoplanar(
	Plane plane,
	double tolerance
)
Public Function IsCoplanar (
	plane As Plane,
	tolerance As Double
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
The plane to test.
tolerance
Type: System.Double
Testing tolerance.
Return Value
Type: Boolean
True if this plane is co-planar with the test plane, false otherwise.
See Also
Reference
Plane Structure
IsCoplanar Overload
Rhino.Geometry Namespace