RhinoCommon API
ObjectTable.Select Method (IEnumerable<Guid>, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Select or deselect a colletion of objects.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Select(
	IEnumerable<Guid> objectIds,
	bool select,
	bool syncHighlight,
	bool persistentSelect,
	bool ignoreGripsState,
	bool ignoreLayerLocking,
	bool ignoreLayerVisibility
)
Public Function Select (
	objectIds As IEnumerable(Of Guid),
	select As Boolean,
	syncHighlight As Boolean,
	persistentSelect As Boolean,
	ignoreGripsState As Boolean,
	ignoreLayerLocking As Boolean,
	ignoreLayerVisibility As Boolean
) As Integer
Parameters
objectIds
Type: System.Collections.Generic.IEnumerable<Guid>
[Missing <param name="objectIds"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Select(System.Collections.Generic.IEnumerable{System.Guid},System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
select
Type: System.Boolean
If true, the object will be selected, if false, it will be deselected.
syncHighlight
Type: System.Boolean
 If true, then the object is highlighted if it is selected and unhighlighted if is not selected.
persistentSelect
Type: System.Boolean
 Objects that are persistently selected stay selected when a command terminates.
ignoreGripsState
Type: System.Boolean
 If true, then objects with grips on can be selected. If false, then the value returned by the object's IsSelectableWithGripsOn() function decides if the object can be selected when it has grips turned on.
ignoreLayerLocking
Type: System.Boolean
 If true, then objects on locked layers can be selected.
ignoreLayerVisibility
Type: System.Boolean
 If true, then objects on hidden layers can be selectable.
Return Value
Type: Int32
Number of objects successfully selected or deselected.
See Also
Reference
ObjectTable Class
Select Overload
Rhino.DocObjects.Tables Namespace