RhinoCommon API
RhinoMath.Integrate Method (Func<Object, Int32, Double, Double, Double>, Object, Interval, Interval, Double, Double, CancellationToken, Double)
[Missing <summary> documentation for "M:Rhino.RhinoMath.Integrate(System.Func{System.Object,System.Int32,System.Double,System.Double,System.Double},System.Object,Rhino.Geometry.Interval,Rhino.Geometry.Interval,System.Double,System.Double,System.Threading.CancellationToken,System.Double@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static double Integrate(
	Func<Object, int, double, double, double> integrandFunction,
	Object context,
	Interval limits1,
	Interval limits2,
	double relativeTolerance,
	double absoluteTolerance,
	CancellationToken cancellationToken,
	out double errorBound
)
Public Shared Function Integrate (
	integrandFunction As Func(Of Object, Integer, Double, Double, Double),
	context As Object,
	limits1 As Interval,
	limits2 As Interval,
	relativeTolerance As Double,
	absoluteTolerance As Double,
	cancellationToken As CancellationToken,
	<OutAttribute> ByRef errorBound As Double
) As Double
Parameters
integrandFunction
Type: System.Func<Object, Int32, Double, Double, Double>
context
Type: System.Object
limits1
Type: Rhino.Geometry.Interval
limits2
Type: Rhino.Geometry.Interval
relativeTolerance
Type: System.Double
absoluteTolerance
Type: System.Double
cancellationToken
Type: System.Threading.CancellationToken
 Token used to cancel the calculation. Cancellation is cooperative: it is checked each time the integrand is evaluated, and a canceled calculation returns double.NaN.
errorBound
Type: System.Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.RhinoMath.Integrate(System.Func{System.Object,System.Int32,System.Double,System.Double,System.Double},System.Object,Rhino.Geometry.Interval,Rhino.Geometry.Interval,System.Double,System.Double,System.Threading.CancellationToken,System.Double@)"]
See Also
Reference
RhinoMath Class
Integrate Overload
Rhino Namespace