RhinoCommon API
LayerTable.Delete Method (Int32, Boolean)
Deletes layer.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Delete(
	int layerIndex,
	bool quiet
)
Public Function Delete (
	layerIndex As Integer,
	quiet As Boolean
) As Boolean
Parameters
layerIndex
Type: System.Int32
 zero based index of layer to delete. This must be in the range 0 <= layerIndex < LayerTable.Count.
quiet
Type: System.Boolean
 If true, no warning message box appears if a layer the layer cannot be deleted because it is the current layer or it contains active geometry.
Return Value
Type: Boolean
 true if successful. false if layerIndex is out of range or the layer cannot be deleted because it is the current layer or because it layer contains active geometry.
See Also
Reference
LayerTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace