RhinoCommon API
PersistentSettings.GetStringDictionary Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetStringDictionary(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public KeyValuePair<string, string>[] GetStringDictionary(
	string key
)
Public Function GetStringDictionary (
	key As String
) As KeyValuePair(Of String, String)()
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetStringDictionary(System.String)"]
Return Value
Type: KeyValuePair<String, String>[]
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetStringDictionary(System.String)"]
See Also
Reference
PersistentSettings Class
GetStringDictionary Overload
Rhino Namespace