RhinoCommon API
SubDEdgeSharpness.Equals Method (Object)
 Determines whether an object is a sharpness with the same end values as this one.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
The object to compare with.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgeSharpness.Equals(System.Object)"]
See Also
Reference
SubDEdgeSharpness Structure
Equals Overload
Rhino.Geometry Namespace