RhinoCommon API
Field.ValueAsString Method
 Get field value as a string.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected string ValueAsString()
Protected Function ValueAsString As String
Return Value
Type: String
Returns the field value as a string if possible.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace