RhinoCommon API
FileIgsWriteOptions Constructor
Initializes a new instance of the FileIgsWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileIgsWriteOptions()
Public Sub New
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace