RhinoCommon API
SubDEdgeSharpness.Equality Operator
 Determines whether two sharpnesses have the same end values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static bool operator ==(
	SubDEdgeSharpness a,
	SubDEdgeSharpness b
)
Public Shared Operator = (
	a As SubDEdgeSharpness,
	b As SubDEdgeSharpness
) As Boolean
Parameters
a
Type: Rhino.Geometry.SubDEdgeSharpness
The first sharpness.
b
Type: Rhino.Geometry.SubDEdgeSharpness
The second sharpness.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgeSharpness.op_Equality(Rhino.Geometry.SubDEdgeSharpness,Rhino.Geometry.SubDEdgeSharpness)"]
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace