RhinoCommon API
LightTable.FindName Method
 Finds the LightObject with a given name.
Deleted lights have no name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LightObject FindName(
	string name
)
Public Function FindName (
	name As String
) As LightObject
Parameters
name
Type: System.String
Name to search.
Return Value
Type: LightObject
 A layer. If no layer is found, null is returned.
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace