RhinoCommon API
SupportOptions.CombineEditors Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.CombineEditors"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool CombineEditors()
Public Shared Function CombineEditors As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.CombineEditors"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace