RhinoCommon API
MeshCageMorph.MorphPoint Method
Morphs an Euclidean point.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public override Point3d MorphPoint(
	Point3d point
)
Public Overrides Function MorphPoint (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point that will be morphed by this object.
Return Value
Type: Point3d
Resulting morphed point.
See Also
Reference
MeshCageMorph Class
Rhino.Geometry.Morphs Namespace