RhinoCommon API
DisplayPipelineAttributes.SetSurfaceIsoColorUsage Method
 Helper function for setting SurfaceIsoColorsUsed and SurfaceIsoSingleColor
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public void SetSurfaceIsoColorUsage(
	DisplayPipelineAttributes.SurfaceIsoColorUse use
)
Public Sub SetSurfaceIsoColorUsage (
	use As DisplayPipelineAttributes.SurfaceIsoColorUse
)
Parameters
use
Type: Rhino.Display.DisplayPipelineAttributes.SurfaceIsoColorUse
[Missing <param name="use"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.SetSurfaceIsoColorUsage(Rhino.Display.DisplayPipelineAttributes.SurfaceIsoColorUse)"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace