RhinoCommon API
Localization.GetLanguages Method
[Missing <summary> documentation for "M:Rhino.UI.Localization.GetLanguages(Rhino.Runtime.InteropWrappers.SimpleArrayInt@,Rhino.Runtime.InteropWrappers.ClassArrayString@)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool GetLanguages(
	out SimpleArrayInt ids,
	out ClassArrayString names
)
Public Shared Function GetLanguages (
	<OutAttribute> ByRef ids As SimpleArrayInt,
	<OutAttribute> ByRef names As ClassArrayString
) As Boolean
Parameters
ids
Type: Rhino.Runtime.InteropWrappers.SimpleArrayInt
[Missing <param name="ids"/> documentation for "M:Rhino.UI.Localization.GetLanguages(Rhino.Runtime.InteropWrappers.SimpleArrayInt@,Rhino.Runtime.InteropWrappers.ClassArrayString@)"]
names
Type: Rhino.Runtime.InteropWrappers.ClassArrayString
[Missing <param name="names"/> documentation for "M:Rhino.UI.Localization.GetLanguages(Rhino.Runtime.InteropWrappers.SimpleArrayInt@,Rhino.Runtime.InteropWrappers.ClassArrayString@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Localization.GetLanguages(Rhino.Runtime.InteropWrappers.SimpleArrayInt@,Rhino.Runtime.InteropWrappers.ClassArrayString@)"]
See Also
Reference
Localization Class
Rhino.UI Namespace