RhinoCommon API
PersistentSettings.GetInteger Method (String, Int32, Int32, Int32)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Int32,System.Int32)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int GetInteger(
	string key,
	int defaultValue,
	int lowerBound,
	int upperBound
)
Public Function GetInteger (
	key As String,
	defaultValue As Integer,
	lowerBound As Integer,
	upperBound As Integer
) As Integer
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Int32,System.Int32)"]
defaultValue
Type: System.Int32
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Int32,System.Int32)"]
lowerBound
Type: System.Int32
[Missing <param name="lowerBound"/> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Int32,System.Int32)"]
upperBound
Type: System.Int32
[Missing <param name="upperBound"/> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Int32,System.Int32)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Int32,System.Int32)"]
See Also
Reference
PersistentSettings Class
GetInteger Overload
Rhino Namespace