RhinoCommon API
DisplayModeDescription.Dispose Method
Releases all resources used by the DisplayModeDescription
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
DisplayModeDescription Class
Dispose Overload
Rhino.Display Namespace