RhinoCommon API
RhinoCore Constructor (String[])
 Initializes a new instance of the RhinoCore class.
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RhinoCore(
	string[] args
)
Public Sub New (
	args As String()
)
Parameters
args
Type: System.String[]
Rhino command line parameters
Remarks
For args documentation see "https://developer.rhino3d.com/guides/cpp/running-rhino-from-command-line/"
See Also
Reference
RhinoCore Class
RhinoCore Overload
Rhino.Runtime.InProcess Namespace