RhinoCommon API
HatchLine.Dispose Method
 Actively releases the unmanaged object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
HatchLine Class
Dispose Overload
Rhino.DocObjects Namespace