RhinoCommon API
NurbsSurface.CopyFrom Method
 Copies this NURBS surface from another NURBS surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void CopyFrom(
	NurbsSurface other
)
Public Sub CopyFrom (
	other As NurbsSurface
)
Parameters
other
Type: Rhino.Geometry.NurbsSurface
The other NURBS surface to use as source.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace