RhinoCommon API
SnapShotsClient.Name Method
 The client's name.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract string Name()
Public MustOverride Function Name As String
Return Value
Type: String
The client's name.
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace