RhinoCommon API
SubD.CreateFromLoft Method
 Creates a SubD lofted through shape curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static SubD CreateFromLoft(
	IEnumerable<NurbsCurve> curves,
	bool closed,
	bool addCorners,
	bool addCreases,
	int divisions
)
Public Shared Function CreateFromLoft (
	curves As IEnumerable(Of NurbsCurve),
	closed As Boolean,
	addCorners As Boolean,
	addCreases As Boolean,
	divisions As Integer
) As SubD
Parameters
curves
Type: System.Collections.Generic.IEnumerable<NurbsCurve>
An enumeration of SubD-friendly NURBS curves to loft through.
closed
Type: System.Boolean
Creates a SubD that is closed in the lofting direction. Must have three or more shape curves.
addCorners
Type: System.Boolean
With open curves, adds creased vertices to the SubD at both ends of the first and last curves.
addCreases
Type: System.Boolean
With kinked curves, adds creased edges to the SubD along the kinks.
divisions
Type: System.Int32
The segment number between adjacent input curves.
Return Value
Type: SubD
A new SubD if successful, or null on failure.
Remarks
 Shape curves must be in the proper order and orientation and have point counts for the desired surface. Shape curves must be either all open or all closed.
See Also
Reference
SubD Class
Rhino.Geometry Namespace