RhinoCommon API
ScaleValue.IsUnset Method
 Test IsUnset
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsUnset()
Public Function IsUnset As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.ScaleValue.IsUnset"]
See Also
Reference
ScaleValue Class
Rhino Namespace