RhinoCommon API
Brep.MergeCoplanarFaces Method (Int32, Double, Double)
 Merges coplanar faces adjacent to Brep face into a single face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.19
Syntax
public bool MergeCoplanarFaces(
	int faceIndex,
	double tolerance,
	double angleTolerance
)
Public Function MergeCoplanarFaces (
	faceIndex As Integer,
	tolerance As Double,
	angleTolerance As Double
) As Boolean
Parameters
faceIndex
Type: System.Int32
The index of the Brep face to search.
tolerance
Type: System.Double
 Tolerance for determining when edges are adjacent. When in doubt, use the document's ModelAbsoluteTolerance property.
angleTolerance
Type: System.Double
 Angle tolerance, in radians, for determining when faces are parallel. When in doubt, use the document's ModelAngleToleranceRadians property.
Return Value
Type: Boolean
true if faces were merged, false if no faces were merged.
See Also
Reference
Brep Class
MergeCoplanarFaces Overload
Rhino.Geometry Namespace