RhinoCommon API
FileSettings.DefaultTemplateFolderForLanguageID Method
 Returns the default template folder for a given language id.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string DefaultTemplateFolderForLanguageID(
	int languageID
)
Public Shared Function DefaultTemplateFolderForLanguageID (
	languageID As Integer
) As String
Parameters
languageID
Type: System.Int32
[Missing <param name="languageID"/> documentation for "M:Rhino.ApplicationSettings.FileSettings.DefaultTemplateFolderForLanguageID(System.Int32)"]
Return Value
Type: String
The default template folder as string.
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace