RhinoCommon API
Box.Contains Method (Box, Boolean)
 Determines whether a Box is inside this Box (strict inclusion, if strict is true). Invalid boxes contain nothing. Invalid boxes are never contained.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Contains(
	Box box,
	bool strict
)
Public Function Contains (
	box As Box,
	strict As Boolean
) As Boolean
Parameters
box
Type: Rhino.Geometry.Box
Box to test.
strict
Type: System.Boolean
 If true, the tested Box needs to be strictly inside this Box, i.e. all corners of the BoundingBox are strictly inside this Box. If false, the tested Box can be touching this Box's boundary, i.e. all corners of the BoundingBox are non-strictly inside this Box.
Return Value
Type: Boolean
true if the box is (strictly) on the inside of this Box. false if this Box or the tested Box are invalid.
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace