RhinoCommon API
LinetypeTable.Delete Method (Linetype)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LinetypeTable.Delete(Rhino.DocObjects.Linetype)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override bool Delete(
	Linetype item
)
Public Overrides Function Delete (
	item As Linetype
) As Boolean
Parameters
item
Type: Rhino.DocObjects.Linetype
[Missing <param name="item"/> documentation for "M:Rhino.DocObjects.Tables.LinetypeTable.Delete(Rhino.DocObjects.Linetype)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LinetypeTable.Delete(Rhino.DocObjects.Linetype)"]
See Also
Reference
LinetypeTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace