RhinoCommon API
TextureGraphInfo Constructor
Initializes a new instance of the TextureGraphInfo class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public TextureGraphInfo()
Public Sub New
See Also
Reference
TextureGraphInfo Class
Rhino.Render Namespace