RhinoCommon API
RhinoList.Point2fKNeighbors Method
 Finds a certain amour of points in a list of single-precision 2D points that are the k-closest to a test point. This method searches needlePoints by computing all distances from each point cloud point and keeping a "short list".
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static IEnumerable<int[]> Point2fKNeighbors(
	IEnumerable<Point2f> hayPoints,
	IEnumerable<Point2f> needlePoints,
	int amount
)
Public Shared Function Point2fKNeighbors (
	hayPoints As IEnumerable(Of Point2f),
	needlePoints As IEnumerable(Of Point2f),
	amount As Integer
) As IEnumerable(Of Integer())
Parameters
hayPoints
Type: System.Collections.Generic.IEnumerable<Point2f>
A point cloud to be searched.
needlePoints
Type: System.Collections.Generic.IEnumerable<Point2f>
Points to search for.
amount
Type: System.Int32
The required amount of closest neighbors to find.
Return Value
Type: IEnumerable<Int32[]>
An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
See Also
Reference
RhinoList Class
Rhino.Collections Namespace
RTree.Point3dKNeighbors(IEnumerable<Point3d>, IEnumerable<Point3d>, Int32)