RhinoCommon API
Transform2d.Equals Method (Object)
 Determines if another object is a Transform2d and its value equals this transform value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
Another object.
Return Value
Type: Boolean
true if obj is a Transform2d and has the same value as this transform; otherwise, false.
See Also
Reference
Transform2d Structure
Equals Overload
Rhino.Geometry Namespace