RhinoCommon API
WorksessionFileLayerOverride Constructor
Creates a layer override with default values.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFileLayerOverride()
Public Sub New
See Also
Reference
WorksessionFileLayerOverride Class
WorksessionFileLayerOverride Overload
Rhino.FileIO Namespace