RhinoCommon API
RenderPipeline.RenderWindow Method
 Call this function to render the scene in a view window. The function returns when rendering is complete (or cancelled).
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RenderPipeline.RenderReturnCode RenderWindow(
	RhinoView view,
	Rectangle rect,
	bool inWindow
)
Public Function RenderWindow (
	view As RhinoView,
	rect As Rectangle,
	inWindow As Boolean
) As RenderPipeline.RenderReturnCode
Parameters
view
Type: Rhino.Display.RhinoView
the view that the user selected a rectangle in.
rect
Type: System.Drawing.Rectangle
rectangle that the user selected.
inWindow
Type: System.Boolean
true to render directly into the view window.
Return Value
Type: RenderPipeline.RenderReturnCode
A code that explains how rendering completed.
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace