RhinoCommon API
Curve.ToPolyline Method (Double, Double, Double, Double)
 Gets a polyline approximation of a curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PolylineCurve ToPolyline(
	double tolerance,
	double angleTolerance,
	double minimumLength,
	double maximumLength
)
Public Function ToPolyline (
	tolerance As Double,
	angleTolerance As Double,
	minimumLength As Double,
	maximumLength As Double
) As PolylineCurve
Parameters
tolerance
Type: System.Double
The tolerance. This is the maximum deviation from line midpoints to the curve. When in doubt, use the document's model space absolute tolerance.
angleTolerance
Type: System.Double
The angle tolerance in radians. This is the maximum deviation of the line directions. When in doubt, use the document's model space angle tolerance.
minimumLength
Type: System.Double
The minimum segment length.
maximumLength
Type: System.Double
The maximum segment length.
Return Value
Type: PolylineCurve
PolyCurve on success, null on error.
See Also
Reference
Curve Class
ToPolyline Overload
Rhino.Geometry Namespace