RhinoCommon API
Point3f Explicit Conversion (Point3f to Vector3f)
 Converts a single-precision point in a single-precision vector. Needs explicit casting to help retain precision.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static explicit operator Vector3f (
	Point3f point
)
Public Shared Narrowing Operator CType (
	point As Point3f
) As Vector3f
Parameters
point
Type: Rhino.Geometry.Point3f
A point.
Return Value
Type: Vector3f
The resulting point.
See Also
Reference
Point3f Structure
Explicit Overload
Rhino.Geometry Namespace