RhinoCommon API
PersistentSettings.TryGetChild Method
 Call this method to get a nested settings PersistentSettings instance, will return true if the key exists and value was set otherwise; will return false and value will be set to null.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetChild(
	string key,
	out PersistentSettings value
)
Public Function TryGetChild (
	key As String,
	<OutAttribute> ByRef value As PersistentSettings
) As Boolean
Parameters
key
Type: System.String
[in] Key name
value
Type: Rhino.PersistentSettings
 [out] Will be set the child settings if the key is valid otherwise it will be null.
Return Value
Type: Boolean
 Returns true if the key exists and value was set otherwise; returns false.
See Also
Reference
PersistentSettings Class
Rhino Namespace