RhinoCommon API
RenderMeshProvider.Progress Method
 Provides details on the progress of custom render meshes for a document or collection of objects
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public virtual RenderMeshProviderProgress Progress(
	RhinoDoc doc,
	Guid[] optional_objectIds
)
Public Overridable Function Progress (
	doc As RhinoDoc,
	optional_objectIds As Guid()
) As RenderMeshProviderProgress
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Progress(Rhino.RhinoDoc,System.Guid[])"]
optional_objectIds
Type: System.Guid[]
[Missing <param name="optional_objectIds"/> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Progress(Rhino.RhinoDoc,System.Guid[])"]
Return Value
Type: RenderMeshProviderProgress
[Missing <returns> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Progress(Rhino.RhinoDoc,System.Guid[])"]
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace