RhinoCommon API
Mesh.WithShutLining Method
 Constructs new mesh from the current one, with shut lining applied to it.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Mesh WithShutLining(
	bool faceted,
	double tolerance,
	IEnumerable<ShutLiningCurveInfo> curves
)
Public Function WithShutLining (
	faceted As Boolean,
	tolerance As Double,
	curves As IEnumerable(Of ShutLiningCurveInfo)
) As Mesh
Parameters
faceted
Type: System.Boolean
Specifies whether the shutline is faceted.
tolerance
Type: System.Double
The tolerance of the shutline.
curves
Type: System.Collections.Generic.IEnumerable<ShutLiningCurveInfo>
A collection of curve arguments.
Return Value
Type: Mesh
A new mesh with shutlining. Null on failure.
Exceptions
Exception | Condition
ArgumentNullException | If curves is null.
InvalidOperationException | If displacement failed because of an error. The exception message specifies the error.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace