RhinoCommon API
StringWrapper.SetStringOnPointer Method
 Set contents of an ON_wString*
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void SetStringOnPointer(
	IntPtr pON_wString,
	string s
)
Public Shared Sub SetStringOnPointer (
	pON_wString As IntPtr,
	s As String
)
Parameters
pON_wString
Type: System.IntPtr
[Missing <param name="pON_wString"/> documentation for "M:Rhino.Runtime.InteropWrappers.StringWrapper.SetStringOnPointer(System.IntPtr,System.String)"]
s
Type: System.String
[Missing <param name="s"/> documentation for "M:Rhino.Runtime.InteropWrappers.StringWrapper.SetStringOnPointer(System.IntPtr,System.String)"]
See Also
Reference
StringWrapper Class
Rhino.Runtime.InteropWrappers Namespace