RhinoCommon API
FileTypeList Constructor
Initializes a new instance of the FileTypeList class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public FileTypeList()
Public Sub New
See Also
Reference
FileTypeList Class
FileTypeList Overload
Rhino.PlugIns Namespace