RhinoCommon API
RenderTexture.NewBitmapTexture Method (SimulatedTexture, RhinoDoc)
 Constructs a new basic texture from a SimulatedTexture.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public static RenderTexture NewBitmapTexture(
	SimulatedTexture texture,
	RhinoDoc doc
)
Public Shared Function NewBitmapTexture (
	texture As SimulatedTexture,
	doc As RhinoDoc
) As RenderTexture
Parameters
texture
Type: Rhino.Render.SimulatedTexture
The texture to create the basic texture from.
doc
Type: Rhino.RhinoDoc
The document to associate the texture with.
Return Value
Type: RenderTexture
A new render texture.
See Also
Reference
RenderTexture Class
NewBitmapTexture Overload
Rhino.Render Namespace