RhinoCommon API
ScaleValue.Finalize Method
passively reclaim native allocated ON_ScaleValue*
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
ScaleValue Class
Rhino Namespace