RhinoCommon API
FileReference Constructor
 Constructs a new instance of the FileReference class, given a fullPath, a relativePath a content hash and a status value.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public FileReference(
	string fullPath,
	string relativePath,
	ContentHash hash,
	FileReferenceStatus status
)
Public Sub New (
	fullPath As String,
	relativePath As String,
	hash As ContentHash,
	status As FileReferenceStatus
)
Parameters
fullPath
Type: System.String
[Missing <param name="fullPath"/> documentation for "M:Rhino.FileIO.FileReference.#ctor(System.String,System.String,Rhino.FileIO.ContentHash,Rhino.FileIO.FileReferenceStatus)"]
relativePath
Type: System.String
[Missing <param name="relativePath"/> documentation for "M:Rhino.FileIO.FileReference.#ctor(System.String,System.String,Rhino.FileIO.ContentHash,Rhino.FileIO.FileReferenceStatus)"]
hash
Type: Rhino.FileIO.ContentHash
[Missing <param name="hash"/> documentation for "M:Rhino.FileIO.FileReference.#ctor(System.String,System.String,Rhino.FileIO.ContentHash,Rhino.FileIO.FileReferenceStatus)"]
status
Type: Rhino.FileIO.FileReferenceStatus
[Missing <param name="status"/> documentation for "M:Rhino.FileIO.FileReference.#ctor(System.String,System.String,Rhino.FileIO.ContentHash,Rhino.FileIO.FileReferenceStatus)"]
See Also
Reference
FileReference Class
Rhino.FileIO Namespace