RhinoCommon API
Silhouette.Compute Method (GeometryBase, SilhouetteType, ViewportInfo, Double, Double)
 Compute silhouettes of a shape for a specified projection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Silhouette[] Compute(
	GeometryBase geometry,
	SilhouetteType silhouetteType,
	ViewportInfo viewport,
	double tolerance,
	double angleToleranceRadians
)
Public Shared Function Compute (
	geometry As GeometryBase,
	silhouetteType As SilhouetteType,
	viewport As ViewportInfo,
	tolerance As Double,
	angleToleranceRadians As Double
) As Silhouette()
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
Geometry whose silhouettes need to be computed. Can be Brep, BrepFace, Mesh, or Extrusion.
silhouetteType
Type: Rhino.Geometry.SilhouetteType
Types of silhouette to compute.
viewport
Type: Rhino.DocObjects.ViewportInfo
Projection.
tolerance
Type: System.Double
Tolerance to use for determining projecting relationships. Surfaces and curves that are closer than tolerance, may be treated as projecting. When in doubt use RhinoDoc.ModelAbsoluteTolerance.
angleToleranceRadians
Type: System.Double
Angular tolerance to use for determining projecting relationships. A surface normal N that satisfies N o cameraDirection < Sin(angleToleranceRadians) may be considered projecting. When in doubt use RhinoDoc.ModelAngleToleranceRadians.
Return Value
Type: Silhouette[]
Array of silhouette curves.
See Also
Reference
Silhouette Class
Compute Overload
Rhino.Geometry Namespace