RhinoCommon API
BinaryArchiveWriter.WriteGuidArray Method
 Writes a list, an array, or any enumerable of Guid to the archive.
The return will always be an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteGuidArray(
	IEnumerable<Guid> value
)
Public Sub WriteGuidArray (
	value As IEnumerable(Of Guid)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<Guid>
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace