RhinoCommon API
Mesh.CreateFromExtrusion Method
 Constructs a mesh from a brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public static Mesh CreateFromExtrusion(
	Extrusion extrusion,
	MeshingParameters meshingParameters
)
Public Shared Function CreateFromExtrusion (
	extrusion As Extrusion,
	meshingParameters As MeshingParameters
) As Mesh
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
Brep to approximate.
meshingParameters
Type: Rhino.Geometry.MeshingParameters
Parameters to use during meshing.
Return Value
Type: Mesh
A mesh.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace