RhinoCommon API
AnnotationBase.SetOverrideDimStyle Method
 Set a style including overrides for this annotation object. The DimensionStyle OverrideStyle must have the override fields marked as overridden and must have it's Id set to nil. Use DimensionStyle.SetFieldOverride(Field field) and related functions to manage override settings. To override a field, the field value must be set and the field must be marked as an override. The DimensionStyle passed in here must not be in the dimstyle table
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SetOverrideDimStyle(
	DimensionStyle OverrideStyle
)
Public Function SetOverrideDimStyle (
	OverrideStyle As DimensionStyle
) As Boolean
Parameters
OverrideStyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="OverrideStyle"/> documentation for "M:Rhino.Geometry.AnnotationBase.SetOverrideDimStyle(Rhino.DocObjects.DimensionStyle)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.SetOverrideDimStyle(Rhino.DocObjects.DimensionStyle)"]
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace