RhinoCommon API
RealtimeDisplayMode.SetUseDrawOpenGl Method
 During run-time change whether to use OpenGL drawing of results or not. For instance offline rendering (viewcapture* with different resolution than viewport) could use RenderWindow instead of direct OpenGL drawing.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual void SetUseDrawOpenGl(
	bool use
)
Public Overridable Sub SetUseDrawOpenGl (
	use As Boolean
)
Parameters
use
Type: System.Boolean
Set to true if OpenGL drawing is wanted, set to false if RenderWindow method is needed.
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace