RhinoCommon API
LightManagerSupport.RenderEngineId Method
 The Guid of the render engine
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract Guid RenderEngineId()
Public MustOverride Function RenderEngineId As Guid
Return Value
Type: Guid
Returns the Guid of the render engine that is associated with this light manager
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace