RhinoCommon API
PointCloud.Insert Method (Int32, Point3d, Color)
 Inserts a new point into the point list.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Insert(
	int index,
	Point3d point,
	Color color
)
Public Sub Insert (
	index As Integer,
	point As Point3d,
	color As Color
)
Parameters
index
Type: System.Int32
Insertion index.
point
Type: Rhino.Geometry.Point3d
Point to append.
color
Type: System.Drawing.Color
Color of new point.
See Also
Reference
PointCloud Class
Insert Overload
Rhino.Geometry Namespace