RhinoCommon API
MeshingParameters.SubDDisplayParameters Method
 Gets the SubD display parameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public SubDDisplayParameters SubDDisplayParameters()
Public Function SubDDisplayParameters As SubDDisplayParameters
Return Value
Type: SubDDisplayParameters
The SubD display parameters.
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace