RhinoCommon API
SpaceMorph.Morph Method (GeometryBase)
Apply the space morph to geometry.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Morph(
	GeometryBase geometry
)
Public Function Morph (
	geometry As GeometryBase
) As Boolean
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
Geometry to morph.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
SpaceMorph Class
Morph Overload
Rhino.Geometry Namespace