RhinoCommon API
IStackedDialogPageService.RedrawPageControl Method
 Redraw the specified control.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void RedrawPageControl(
	Object pageControl
)
Sub RedrawPageControl (
	pageControl As Object
)
Parameters
pageControl
Type: System.Object
 Control to redraw
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace