RhinoCommon API
DocumentOrFreeFloatingBase.BeginChange Method
[Missing <summary> documentation for "M:Rhino.Render.DocumentOrFreeFloatingBase.BeginChange(Rhino.Render.RenderContent.ChangeContexts)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void BeginChange(
	RenderContent.ChangeContexts cc
)
Public Sub BeginChange (
	cc As RenderContent.ChangeContexts
)
Parameters
cc
Type: Rhino.Render.RenderContent.ChangeContexts
[Missing <param name="cc"/> documentation for "M:Rhino.Render.DocumentOrFreeFloatingBase.BeginChange(Rhino.Render.RenderContent.ChangeContexts)"]
See Also
Reference
DocumentOrFreeFloatingBase Class
Rhino.Render Namespace