RhinoCommon API
Brep.CreateFromSweepSegmented Method (Curve, IEnumerable<Curve>, Point3d, Point3d, SweepFrame, Vector3d, Boolean, SweepBlend, SweepMiter, Double, SweepRebuild, Int32, Double)
 Sweep1 function that fits a surface through a series of profile curves that define the surface cross-sections and one curve that defines a surface edge. The Segmented version breaks the rail at curvature kinks and sweeps each piece separately, then put the results together into a Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Brep[] CreateFromSweepSegmented(
	Curve rail,
	IEnumerable<Curve> shapes,
	Point3d startPoint,
	Point3d endPoint,
	SweepFrame frameType,
	Vector3d roadlikeNormal,
	bool closed,
	SweepBlend blendType,
	SweepMiter miterType,
	double tolerance,
	SweepRebuild rebuildType,
	int rebuildPointCount,
	double refitTolerance
)
Public Shared Function CreateFromSweepSegmented (
	rail As Curve,
	shapes As IEnumerable(Of Curve),
	startPoint As Point3d,
	endPoint As Point3d,
	frameType As SweepFrame,
	roadlikeNormal As Vector3d,
	closed As Boolean,
	blendType As SweepBlend,
	miterType As SweepMiter,
	tolerance As Double,
	rebuildType As SweepRebuild,
	rebuildPointCount As Integer,
	refitTolerance As Double
) As Brep()
Parameters
rail
Type: Rhino.Geometry.Curve
Rail to sweep shapes along.
shapes
Type: System.Collections.Generic.IEnumerable<Curve>
Shape curves.
startPoint
Type: Rhino.Geometry.Point3d
Optional starting point of sweep. Use Point3d.Unset if you do not want to include a start point.
endPoint
Type: Rhino.Geometry.Point3d
Optional ending point of sweep. Use Point3d.Unset if you do not want to include an end point.
frameType
Type: Rhino.Geometry.SweepFrame
The frame type.
roadlikeNormal
Type: Rhino.Geometry.Vector3d
The roadlike normal directoion. Use Vector3d.Unset if the frame type is not set to roadlike.
closed
Type: System.Boolean
Only matters if shapes are closed.
blendType
Type: Rhino.Geometry.SweepBlend
The shape blending type.
miterType
Type: Rhino.Geometry.SweepMiter
The mitering type.
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.Brep.CreateFromSweepSegmented(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.SweepFrame,Rhino.Geometry.Vector3d,System.Boolean,Rhino.Geometry.SweepBlend,Rhino.Geometry.SweepMiter,System.Double,Rhino.Geometry.SweepRebuild,System.Int32,System.Double)"]
rebuildType
Type: Rhino.Geometry.SweepRebuild
The rebuild style.
rebuildPointCount
Type: System.Int32
If rebuild == SweepRebuild.Rebuild, the number of points. Otherwise specify 0.
refitTolerance
Type: System.Double
If rebuild == SweepRebuild.Refit, the refit tolerance. Otherwise, specify 0.0
Return Value
Type: Brep[]
Array of Brep sweep results.
Remarks
Rhino's Sweep1 command uses this when the "refit rail" option is disabled (false).
See Also
Reference
Brep Class
CreateFromSweepSegmented Overload
Rhino.Geometry Namespace