RhinoCommon API
SimpleArrayMeshPointer.ToNonConstArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Mesh[] ToNonConstArray()
Public Function ToNonConstArray As Mesh()
Return Value
Type: Mesh[]
The managed array.
See Also
Reference
SimpleArrayMeshPointer Class
Rhino.Runtime.InteropWrappers Namespace