RhinoCommon API
StackedDialogPage.OnSizeParent Method
 Called when the parent window has been resized
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual void OnSizeParent(
	int width,
	int height
)
Public Overridable Sub OnSizeParent (
	width As Integer,
	height As Integer
)
Parameters
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.UI.StackedDialogPage.OnSizeParent(System.Int32,System.Int32)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.UI.StackedDialogPage.OnSizeParent(System.Int32,System.Int32)"]
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace