RhinoCommon API
Brep.CreateFilletEdges Method (Brep, IEnumerable<Int32>, IEnumerable<Double>, IEnumerable<Double>, BlendType, RailType, Boolean, Double, Double)
 Fillets, chamfers, or blends the edges of a brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public static Brep[] CreateFilletEdges(
	Brep brep,
	IEnumerable<int> edgeIndices,
	IEnumerable<double> startRadii,
	IEnumerable<double> endRadii,
	BlendType blendType,
	RailType railType,
	bool setbackFillets,
	double tolerance,
	double angleTolerance
)
Public Shared Function CreateFilletEdges (
	brep As Brep,
	edgeIndices As IEnumerable(Of Integer),
	startRadii As IEnumerable(Of Double),
	endRadii As IEnumerable(Of Double),
	blendType As BlendType,
	railType As RailType,
	setbackFillets As Boolean,
	tolerance As Double,
	angleTolerance As Double
) As Brep()
Parameters
brep
Type: Rhino.Geometry.Brep
The brep to fillet, chamfer, or blend edges.
edgeIndices
Type: System.Collections.Generic.IEnumerable<Int32>
An array of one or more edge indices where the fillet, chamfer, or blend will occur.
startRadii
Type: System.Collections.Generic.IEnumerable<Double>
An array of starting fillet, chamfer, or blend radaii, one for each edge index.
endRadii
Type: System.Collections.Generic.IEnumerable<Double>
An array of ending fillet, chamfer, or blend radaii, one for each edge index.
blendType
Type: Rhino.Geometry.BlendType
The blend type.
railType
Type: Rhino.Geometry.RailType
The rail type.
setbackFillets
Type: System.Boolean
Use setback fillets (not used with blendType=Chamfer)
tolerance
Type: System.Double
The tolerance to be used to perform calculations.
angleTolerance
Type: System.Double
Angle tolerance to be used to perform calculations [radians]. If unsure, use Math.PI/180.0 (one degree)
Return Value
Type: Brep[]
Array of Breps if successful.
See Also
Reference
Brep Class
CreateFilletEdges Overload
Rhino.Geometry Namespace