RhinoCommon API
NurbsCurveFitParameters.SetPointCountRange Method (Int32, Int32)
 Set the point count range and tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetPointCountRange(
	int minimum,
	int maximum
)
Public Sub SetPointCountRange (
	minimum As Integer,
	maximum As Integer
)
Parameters
minimum
Type: System.Int32
[Missing <param name="minimum"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.SetPointCountRange(System.Int32,System.Int32)"]
maximum
Type: System.Int32
[Missing <param name="maximum"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.SetPointCountRange(System.Int32,System.Int32)"]
See Also
Reference
NurbsCurveFitParameters Class
SetPointCountRange Overload
Rhino.Geometry Namespace