RhinoCommon API
Matrix.SwapColumns Method
 Exchanges two columns.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SwapColumns(
	int columnA,
	int columnB
)
Public Function SwapColumns (
	columnA As Integer,
	columnB As Integer
) As Boolean
Parameters
columnA
Type: System.Int32
A first column.
columnB
Type: System.Int32
Another column.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
See Also
Reference
Matrix Class
Rhino.Geometry Namespace