RhinoCommon API
NurbsCurvePointList.GetPoint Method (Int32, Point3d)
 Gets a world 3-D, or Euclidean, control point at the given index. The 4-D representation is (x, y, z, 1.0).
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GetPoint(
	int index,
	out Point3d point
)
Public Function GetPoint (
	index As Integer,
	<OutAttribute> ByRef point As Point3d
) As Boolean
Parameters
index
Type: System.Int32
Index of control point to get.
point
Type: Rhino.Geometry.Point3d
Coordinate of control point.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsCurvePointList Class
GetPoint Overload
Rhino.Geometry.Collections Namespace