RhinoCommon API
TextFields.PageName Method (String)
 Return the page name for the specified View ID
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string PageName(
	string id
)
Public Shared Function PageName (
	id As String
) As String
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.PageName(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.PageName(System.String)"]
See Also
Reference
TextFields Class
PageName Overload
Rhino.Runtime Namespace