RhinoCommon API
Vector3d.PerpendicularTo Method (Vector3d)
 Sets this vector to be perpendicular to another vector. Result is not unitized.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool PerpendicularTo(
	Vector3d other
)
Public Function PerpendicularTo (
	other As Vector3d
) As Boolean
Parameters
other
Type: Rhino.Geometry.Vector3d
Vector to use as guide.
Return Value
Type: Boolean
true on success, false if input vector is zero or invalid.
See Also
Reference
Vector3d Structure
PerpendicularTo Overload
Rhino.Geometry Namespace