RhinoCommon API
PythonScript.GetVariableNames Method
 Retrieves all variable names in the script.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public abstract IEnumerable<string> GetVariableNames()
Public MustOverride Function GetVariableNames As IEnumerable(Of String)
Return Value
Type: IEnumerable<String>
An enumerable set with all names of the variables.
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace