RhinoCommon API
RTree.CreatePointCloudTree Method
 Constructs a new tree with an element for each point cloud point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static RTree CreatePointCloudTree(
	PointCloud cloud
)
Public Shared Function CreatePointCloudTree (
	cloud As PointCloud
) As RTree
Parameters
cloud
Type: Rhino.Geometry.PointCloud
A point cloud.
Return Value
Type: RTree
A new tree, or null on error.
See Also
Reference
RTree Class
Rhino.Geometry Namespace