RhinoCommon API
TaskCompleteEventArgs Constructor
Initializes a new instance of the TaskCompleteEventArgs class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TaskCompleteEventArgs(
	Task task,
	RhinoDoc doc
)
Public Sub New (
	task As Task,
	doc As RhinoDoc
)
Parameters
task
Type: System.Threading.Tasks.Task
[Missing <param name="task"/> documentation for "M:Rhino.Input.Custom.TaskCompleteEventArgs.#ctor(System.Threading.Tasks.Task,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Input.Custom.TaskCompleteEventArgs.#ctor(System.Threading.Tasks.Task,Rhino.RhinoDoc)"]
See Also
Reference
TaskCompleteEventArgs Class
Rhino.Input.Custom Namespace