RhinoCommon API
File3dmObject.GetTextureMapping Method
 Gets the texture mapping from the File3dmObject object.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public TextureMapping GetTextureMapping(
	int mappingChannelId,
	out Transform xform
)
Public Function GetTextureMapping (
	mappingChannelId As Integer,
	<OutAttribute> ByRef xform As Transform
) As TextureMapping
Parameters
mappingChannelId
Type: System.Int32
The mapping channel id to search for.
xform
Type: Rhino.Geometry.Transform
The transformation that was applied to the mapping.
Return Value
Type: TextureMapping
The texture mapping if found, null otherwise.
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace