RhinoCommon API
GeometryBase.OnSwitchToNonConst Method
 Is called when a non-constant operation occurs.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void OnSwitchToNonConst()
Protected Overrides Sub OnSwitchToNonConst
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace