RhinoCommon API
RenderContent.GenerateRenderContentPreview Method
 Generate a render content preview
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public static Bitmap GenerateRenderContentPreview(
	LinearWorkflow lwf,
	RenderContent c,
	int width,
	int height,
	bool bSuppressLocalMapping,
	PreviewJobSignature pjs,
	PreviewAppearance pa,
	ref Utilities.PreviewRenderResult result
)
Public Shared Function GenerateRenderContentPreview (
	lwf As LinearWorkflow,
	c As RenderContent,
	width As Integer,
	height As Integer,
	bSuppressLocalMapping As Boolean,
	pjs As PreviewJobSignature,
	pa As PreviewAppearance,
	ByRef result As Utilities.PreviewRenderResult
) As Bitmap
Parameters
lwf
Type: Rhino.Render.LinearWorkflow
Linear Workflow
c
Type: Rhino.Render.RenderContent
Render Content
width
Type: System.Int32
Image width
height
Type: System.Int32
Image height
bSuppressLocalMapping
Type: System.Boolean
Suppress Local Mapping
pjs
Type: Rhino.Render.PreviewJobSignature
Preivew Job Signature
pa
Type: Rhino.Render.PreviewAppearance
Preivew Appearance
result
Type: Rhino.Render.Utilities.PreviewRenderResult
Reference to PreviewRenderResult value
Return Value
Type: Bitmap
The Bitmap of the render content preview
See Also
Reference
RenderContent Class
Rhino.Render Namespace