RhinoCommon API
SnapShotsClient.ExtendBoundingBoxForDocumentAnimation Method
 Called once at the start of an animation. This can be used to extend the scene bounding box to avoid clipping.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract void ExtendBoundingBoxForDocumentAnimation(
	RhinoDoc doc,
	BinaryArchiveReader archive_start,
	BinaryArchiveReader archive_stop,
	ref BoundingBox bbox
)
Public MustOverride Sub ExtendBoundingBoxForDocumentAnimation (
	doc As RhinoDoc,
	archive_start As BinaryArchiveReader,
	archive_stop As BinaryArchiveReader,
	ByRef bbox As BoundingBox
)
Parameters
doc
Type: Rhino.RhinoDoc
doc is the current document.
archive_start
Type: Rhino.FileIO.BinaryArchiveReader
archive_start is a archive to the data of the starting position.
archive_stop
Type: Rhino.FileIO.BinaryArchiveReader
archive_stop is a archive to the data of the ending position.
bbox
Type: Rhino.Geometry.BoundingBox
bbox is the current scene bounding box.
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace