RhinoCommon API
ChangeQueue Constructor (Guid, UInt32, ViewInfo, Boolean)
Note: This API is now obsolete.
 Construct a new ChangeQueue from the given document
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute]
protected ChangeQueue(
	Guid pluginId,
	uint docRuntimeSerialNumber,
	ViewInfo viewinfo,
	bool bRespectDisplayPipelineAttributes
)
<ObsoleteAttribute>
Protected Sub New (
	pluginId As Guid,
	docRuntimeSerialNumber As UInteger,
	viewinfo As ViewInfo,
	bRespectDisplayPipelineAttributes As Boolean
)
Parameters
pluginId
Type: System.Guid
Id of plugin instantiating ChangeQueue
docRuntimeSerialNumber
Type: System.UInt32
[Missing <param name="docRuntimeSerialNumber"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.#ctor(System.Guid,System.UInt32,Rhino.DocObjects.ViewInfo,System.Boolean)"]
viewinfo
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="viewinfo"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.#ctor(System.Guid,System.UInt32,Rhino.DocObjects.ViewInfo,System.Boolean)"]
bRespectDisplayPipelineAttributes
Type: System.Boolean
Determines whether the display pipeline attributes for this viewport should be taken into account when supplying data. If you are using this queue to populate a scene for the "Render" command, set this to false. If you are using it to draw a realtime preview, you will probably want to set it to true.
See Also
Reference
ChangeQueue Class
ChangeQueue Overload
Rhino.Render.ChangeQueue Namespace