RhinoCommon API
Intersection.MeshCurve Method (Mesh, Curve, Double)
 Intersects a curve and a mesh, returning certified hits sorted by curve parameter.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static MeshCurveIntersection[] MeshCurve(
	Mesh mesh,
	Curve curve,
	double tolerance
)
Public Shared Function MeshCurve (
	mesh As Mesh,
	curve As Curve,
	tolerance As Double
) As MeshCurveIntersection()
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to intersect.
curve
Type: Rhino.Geometry.Curve
Curve to intersect.
tolerance
Type: System.Double
Post-process merge tolerance in 3D model space. Consecutive intersection events whose 3D endpoints are within this distance are fused into a single event. Must be a positive finite value (use the document absolute tolerance as a starting point). The internal calculation tolerance is a fixed value independent of this parameter.
Return Value
Type: MeshCurveIntersection[]
Array of intersection events sorted by curve parameter. Empty on failure or no intersection.
Remarks
Every overlap is reported as two Point events at the overlap's endpoints plus one Overlap event for the in-plane span. This overload always includes the Overlap events; use the MeshCurve(Mesh, Curve, Double, Boolean) overload to drop them while still reporting the endpoint Points.
See Also
Reference
Intersection Class
MeshCurve Overload
Rhino.Geometry.Intersect Namespace