RhinoCommon API
SimpleArrayLinetypePointer.ToNonConstArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.6
Syntax
public Linetype[] ToNonConstArray()
Public Function ToNonConstArray As Linetype()
Return Value
Type: Linetype[]
The managed array.
See Also
Reference
SimpleArrayLinetypePointer Class
Rhino.Runtime.InteropWrappers Namespace