RhinoCommon API
Mesh.ShrinkWrap Method (IEnumerable<GeometryBase>, ShrinkWrapParameters, MeshingParameters, CancellationToken)
 Creates a unified ShrinkWrap mesh from a collection of GeometryBase objects. returns null or error on failure Supports cancellation during volumetric calculations. geometryBase mesh creation is not cancellable
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public static Mesh ShrinkWrap(
	IEnumerable<GeometryBase> geometryBases,
	ShrinkWrapParameters parameters,
	MeshingParameters meshingParameters,
	CancellationToken token
)
Public Shared Function ShrinkWrap (
	geometryBases As IEnumerable(Of GeometryBase),
	parameters As ShrinkWrapParameters,
	meshingParameters As MeshingParameters,
	token As CancellationToken
) As Mesh
Parameters
geometryBases
Type: System.Collections.Generic.IEnumerable<GeometryBase>
[Missing <param name="geometryBases"/> documentation for "M:Rhino.Geometry.Mesh.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.ShrinkWrapParameters,Rhino.Geometry.MeshingParameters,System.Threading.CancellationToken)"]
parameters
Type: Rhino.Geometry.ShrinkWrapParameters
A ShrinkWrapParameters object that specifies the configuration settings for the ShrinkWrap process.
meshingParameters
Type: Rhino.Geometry.MeshingParameters
GeometryBase objects are converted to meshes first using the MeshingParameters provided. Those meshes are then used in the ShrinkWrap process.
token
Type: System.Threading.CancellationToken
Supports cancellation during volumetric calculations. geometryBase mesh creation is not cancellable
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.ShrinkWrapParameters,Rhino.Geometry.MeshingParameters,System.Threading.CancellationToken)"]
See Also
Reference
Mesh Class
ShrinkWrap Overload
Rhino.Geometry Namespace