RhinoCommon API
Dialogs.ShowLineTypes Method (String, String, RhinoDoc, Guid)
[Missing <summary> documentation for "M:Rhino.UI.Dialogs.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc,System.Guid)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Guid ShowLineTypes(
	string title,
	string message,
	RhinoDoc doc,
	Guid selectedLineTypeId
)
Public Shared Function ShowLineTypes (
	title As String,
	message As String,
	doc As RhinoDoc,
	selectedLineTypeId As Guid
) As Guid
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.Dialogs.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc,System.Guid)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.Dialogs.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc,System.Guid)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.UI.Dialogs.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc,System.Guid)"]
selectedLineTypeId
Type: System.Guid
[Missing <param name="selectedLineTypeId"/> documentation for "M:Rhino.UI.Dialogs.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc,System.Guid)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.Dialogs.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc,System.Guid)"]
See Also
Reference
Dialogs Class
ShowLineTypes Overload
Rhino.UI Namespace