RhinoCommon API
HostUtils.GetCurrentProcessInfo Method
 Returns information about the current process. If Rhino is the top level process, processName is "Rhino". Otherwise, processName is the name, without extension, of the main module that is executing. For example, "compute.backend" or "Revit". processVersion is the System.Version of the running process. It is the FileVersion of the executable.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public static void GetCurrentProcessInfo(
	out string processName,
	out Version processVersion
)
Public Shared Sub GetCurrentProcessInfo (
	<OutAttribute> ByRef processName As String,
	<OutAttribute> ByRef processVersion As Version
)
Parameters
processName
Type: System.String
[Missing <param name="processName"/> documentation for "M:Rhino.Runtime.HostUtils.GetCurrentProcessInfo(System.String@,System.Version@)"]
processVersion
Type: System.Version
[Missing <param name="processVersion"/> documentation for "M:Rhino.Runtime.HostUtils.GetCurrentProcessInfo(System.String@,System.Version@)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace