RhinoCommon API
RhinoList<T>.InsertRange Method
 Inserts the elements of a collection into the List at the specified index.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void InsertRange(
	int index,
	IEnumerable<T> collection
)
Public Sub InsertRange (
	index As Integer,
	collection As IEnumerable(Of T)
)
Parameters
index
Type: System.Int32
The zero-based index at which the new elements should be inserted.
collection
Type: System.Collections.Generic.IEnumerable<T>
The collection whose elements should be inserted into the List. The collection itself cannot be a null reference (Nothing in Visual Basic), but it can contain elements that are a null reference (Nothing in Visual Basic), if type T is a reference type.
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace