RhinoCommon API
FileCsvDocument.ToString Method
 Returns the full CSV content of the document as a string.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.FileIO.FileCsvDocument.ToString"]
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace