RhinoCommon API
DrawingUtilities.ImageFromResource Method
 Load a Image from an embedded resource.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Image ImageFromResource(
	string resourceName,
	Assembly assembly = null
)
Public Shared Function ImageFromResource (
	resourceName As String,
	Optional assembly As Assembly = Nothing
) As Image
Parameters
resourceName
Type: System.String
 The case-sensitive name of the image manifest resource being requested.
assembly (Optional)
Type: System.Reflection.Assembly
 The assembly containing the manifest resource, will use the calling assembly if null.
Return Value
Type: Image
 The Image resource if found and loaded otherwise null.
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace