RhinoCommon API
ArchivableDictionary.TryGetInteger Method
 Get value as int, will only succeed if value was created using Set(string key, int value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetInteger(
	string key,
	out int value
)
Public Function TryGetInteger (
	key As String,
	<OutAttribute> ByRef value As Integer
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetInteger(System.String,System.Int32@)"]
value
Type: System.Int32
[Missing <param name="value"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetInteger(System.String,System.Int32@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetInteger(System.String,System.Int32@)"]
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace