RhinoCommon API
Matrix.Duplicate Method
 Create a duplicate of this matrix.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Matrix Duplicate()
Public Function Duplicate As Matrix
Return Value
Type: Matrix
An exact duplicate of this matrix.
See Also
Reference
Matrix Class
Rhino.Geometry Namespace