RhinoCommon API
RenderContent.Factory Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.Factory"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public ContentFactory Factory()
Public Function Factory As ContentFactory
Return Value
Type: ContentFactory
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.Factory"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace