RhinoCommon API
GetBaseClass.PickRectangle Method
 If the get was a GetObjects() and the mouse was used to select the objects, then the returned rectangle has left < right and top < bottom. This rectangle is the Windows GDI screen coordinates of the picking rectangle. RhinoViewport.GetPickXform( pick_rect, pick_xform ) will calculate the picking transformation that was used. In all other cases, left=right=top=bottom=0;
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Rectangle PickRectangle()
Public Function PickRectangle As Rectangle
Return Value
Type: Rectangle
The picking rectangle; or 0 in the specified cases.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace