RhinoCommon API
ReplayHistoryResult.UpdateToSubD Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSubD(Rhino.Geometry.SubD,Rhino.DocObjects.ObjectAttributes)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public bool UpdateToSubD(
	SubD subD,
	ObjectAttributes attributes
)
Public Function UpdateToSubD (
	subD As SubD,
	attributes As ObjectAttributes
) As Boolean
Parameters
subD
Type: Rhino.Geometry.SubD
[Missing <param name="subD"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSubD(Rhino.Geometry.SubD,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSubD(Rhino.Geometry.SubD,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSubD(Rhino.Geometry.SubD,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace