RhinoCommon API
StringParser.ParseLengthExpession Method (String, StringParserSettings, UnitSystem, Double)
 Parse a string for a length value. Expression can include complex expressions Simplest version of Length parsing
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static int ParseLengthExpession(
	string expression,
	StringParserSettings parse_settings_in,
	UnitSystem output_unit_system,
	out double value_out
)
Public Shared Function ParseLengthExpession (
	expression As String,
	parse_settings_in As StringParserSettings,
	output_unit_system As UnitSystem,
	<OutAttribute> ByRef value_out As Double
) As Integer
Parameters
expression
Type: System.String
 [In] The string to parse
parse_settings_in
Type: Rhino.Input.StringParserSettings
 [In] Determines what input will be parsed
output_unit_system
Type: Rhino.UnitSystem
 [In] Output value is in this unit system
value_out
Type: System.Double
 [Out] The length value result
Return Value
Type: Int32
 Count of characters parsed or 0 for failure
See Also
Reference
StringParser Class
ParseLengthExpession Overload
Rhino.Input Namespace