RhinoCommon API
TextFields.DocumentText Method
 Return document user string for a given key
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string DocumentText(
	string key
)
Public Shared Function DocumentText (
	key As String
) As String
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Runtime.TextFields.DocumentText(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.DocumentText(System.String)"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace