RhinoCommon API
PersistentSettings.GetGuid Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetGuid(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid GetGuid(
	string key
)
Public Function GetGuid (
	key As String
) As Guid
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetGuid(System.String)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetGuid(System.String)"]
See Also
Reference
PersistentSettings Class
GetGuid Overload
Rhino Namespace