RhinoCommon API
RenderPrimitiveList.TryGetCone Method
 Call this method to get a box at the specified index.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool TryGetCone(
	int index,
	out Cone cone,
	out Plane truncation
)
Public Function TryGetCone (
	index As Integer,
	<OutAttribute> ByRef cone As Cone,
	<OutAttribute> ByRef truncation As Plane
) As Boolean
Parameters
index
Type: System.Int32
 The zero based index of the item in the list. Valid values are greater than or equal to 0 and less than Count.
cone
Type: Rhino.Geometry.Cone
 Will contain the cone at the requested index if the index is in range and the primitive at the requested index is a box.
truncation
Type: Rhino.Geometry.Plane
[Missing <param name="truncation"/> documentation for "M:Rhino.Render.RenderPrimitiveList.TryGetCone(System.Int32,Rhino.Geometry.Cone@,Rhino.Geometry.Plane@)"]
Return Value
Type: Boolean
 Return true if the index is in range and the primitive at the requested index is a box otherwise returns false.
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace