RhinoCommon API
File3dmObjectTable.AddPoint Method (Point3f)
Adds a point object to the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddPoint(
	Point3f point
)
Public Function AddPoint (
	point As Point3f
) As Guid
Parameters
point
Type: Rhino.Geometry.Point3f
location of point.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddPoint Overload
Rhino.FileIO Namespace