RhinoCommon API
ManifestTable.FindIndex<T> Method (Int32)
 Uses the index to find a model component. The index is the value that is stored in the .Index property.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public T FindIndex<T>(
	int index
)
where T : ModelComponent
Public Function FindIndex(Of T As ModelComponent) (
	index As Integer
) As T
Parameters
index
Type: System.Int32
Index of model component to search for.
Type Parameters
T
The type, derived from ModelComponent. Cannot be ModelComponent itself.
Return Value
Type: T
Reference to the rhino object or null if no such object could be found.
See Also
Reference
ManifestTable Class
FindIndex Overload
Rhino.FileIO Namespace