RhinoCommon API
InstanceObject.SubObjectFromComponentIndex Method
 Get a RhinoObject in this block
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RhinoObject SubObjectFromComponentIndex(
	ComponentIndex ci
)
Public Function SubObjectFromComponentIndex (
	ci As ComponentIndex
) As RhinoObject
Parameters
ci
Type: Rhino.Geometry.ComponentIndex
[Missing <param name="ci"/> documentation for "M:Rhino.DocObjects.InstanceObject.SubObjectFromComponentIndex(Rhino.Geometry.ComponentIndex)"]
Return Value
Type: RhinoObject
[Missing <returns> documentation for "M:Rhino.DocObjects.InstanceObject.SubObjectFromComponentIndex(Rhino.Geometry.ComponentIndex)"]
See Also
Reference
InstanceObject Class
Rhino.DocObjects Namespace