RhinoCommon API
BinaryArchiveWriter.WriteInt Method
 Writes a Int32 value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteInt(
	int value
)
Public Sub WriteInt (
	value As Integer
)
Parameters
value
Type: System.Int32
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace