RhinoCommon API
RenderContent.Create Method (RhinoDoc, Guid)
 Constructs a new content of the specified type and attaches it to a document. This function cannot be used to create temporary content that you delete after use. Content created by this function is owned by RDK and appears in the content editor. To create a temporary content which is owned by you, call RenderContentType.NewContentFromTypeId().
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public static RenderContent Create(
	RhinoDoc doc,
	Guid type
)
Public Shared Function Create (
	doc As RhinoDoc,
	type As Guid
) As RenderContent
Parameters
doc
Type: Rhino.RhinoDoc
The Rhino document to attach the new render content to.
type
Type: System.Guid
The type of the content to create.
Return Value
Type: RenderContent
A new document-resident render content.
See Also
Reference
RenderContent Class
Create Overload
Rhino.Render Namespace