RhinoCommon API
ObjectTable.AddLeader Method (Leader)
 Adds a Leader object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid AddLeader(
	Leader leader
)
Public Function AddLeader (
	leader As Leader
) As Guid
Parameters
leader
Type: Rhino.Geometry.Leader
The leader object.
Return Value
Type: Guid
The Id of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddLeader Overload
Rhino.DocObjects.Tables Namespace