RhinoCommon API
TextDot Constructor (String, Point3d)
 Initializes a new text dot based on the text and the location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public TextDot(
	string text,
	Point3d location
)
Public Sub New (
	text As String,
	location As Point3d
)
Parameters
text
Type: System.String
Text.
location
Type: Rhino.Geometry.Point3d
A position.
See Also
Reference
TextDot Class
TextDot Overload
Rhino.Geometry Namespace