RhinoCommon API
RhinoObject.SelectSubObject Method (ComponentIndex, Boolean, Boolean, Boolean)
Reports if an object can be selected.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int SelectSubObject(
	ComponentIndex componentIndex,
	bool select,
	bool syncHighlight,
	bool persistentSelect
)
Public Function SelectSubObject (
	componentIndex As ComponentIndex,
	select As Boolean,
	syncHighlight As Boolean,
	persistentSelect As Boolean
) As Integer
Parameters
componentIndex
Type: Rhino.Geometry.ComponentIndex
Index of sub-object to check.
select
Type: System.Boolean
The new selection state; true activates selection.
syncHighlight
Type: System.Boolean
 (default=true) If true, then the object is highlighted if it is selected and unhighlighted if is not selected.
persistentSelect
Type: System.Boolean
When true, selection persists even after the current command terminates.
Return Value
Type: Int32
0: object is not selected
1: object is selected
2: object is selected persistently.
Remarks
 Objects that are locked, hidden, or on locked or hidden layers cannot be selected. If IsSelectableWithGripsOn() returns false, then an that object is not selectable if it has grips turned on.
See Also
Reference
RhinoObject Class
SelectSubObject Overload
Rhino.DocObjects Namespace