RhinoCommon API
AnnotationBase.ClearPropertyOverrides Method
 Clears all overridden properties for this annotation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ClearPropertyOverrides()
Public Function ClearPropertyOverrides As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.ClearPropertyOverrides"]
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace