RhinoCommon API
FieldDictionary.Add Method (String, Color, String)
 Add a new Color4fField to the dictionary.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Color4fField Add(
	string key,
	Color value,
	string prompt
)
Public Function Add (
	key As String,
	value As Color,
	prompt As String
) As Color4fField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: System.Drawing.Color
Initial value for this field.
prompt
Type: System.String
 Prompt to display in the user interface (Content Browsers) if this is null or an empty string the this field is a data only field and will not appear in the user interface.
Return Value
Type: Color4fField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Drawing.Color,System.String)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace