RhinoCommon API
ManifestTable.FindId<T> Method (Guid)
 Uses the guid to find a model component. Deleted objects cannot be found by id. The guid is the value that is stored in the .Id property. In a single document, no two active objects have the same guid. If an object is replaced with a new object, then the guid persists. For example, if the _Move command moves an object, then the moved object inherits its guid from the starting object. If the Copy command copies an object, then the copy gets a new guid. This guid persists through file saving/opening operations. This function will not find grip objects.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public T FindId<T>(
	Guid id
)
where T : ModelComponent
Public Function FindId(Of T As ModelComponent) (
	id As Guid
) As T
Parameters
id
Type: System.Guid
Index of model component to search for.
Type Parameters
T
The type, derived from ModelComponent or ModelComponent itself.
Return Value
Type: T
Reference to the rhino object or null if no such object could be found.
See Also
Reference
ManifestTable Class
FindId Overload
Rhino.FileIO Namespace