RhinoCommon API
RenderPrimitiveList.Add Method (PlaneSurface, RenderMaterial)
 Add primitive plane and material.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public void Add(
	PlaneSurface plane,
	RenderMaterial material
)
Public Sub Add (
	plane As PlaneSurface,
	material As RenderMaterial
)
Parameters
plane
Type: Rhino.Geometry.PlaneSurface
Plane to add.
material
Type: Rhino.Render.RenderMaterial
 Material to add, may be null if not needed.
See Also
Reference
RenderPrimitiveList Class
Add Overload
Rhino.Render Namespace