RhinoCommon API
UndoRecord.Finalize Method
 UndoRecord Destructor
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
UndoRecord Class
Rhino.UI.Controls Namespace