RhinoCommon API
PersistentSettings.GetUnsignedInteger Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetUnsignedInteger(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public uint GetUnsignedInteger(
	string key
)
Public Function GetUnsignedInteger (
	key As String
) As UInteger
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetUnsignedInteger(System.String)"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetUnsignedInteger(System.String)"]
See Also
Reference
PersistentSettings Class
GetUnsignedInteger Overload
Rhino Namespace