RhinoCommon API
ViewCaptureWriter.DrawGradientHatch Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawGradientHatch(Rhino.Display.DisplayPipeline,Rhino.Geometry.Hatch,Rhino.DocObjects.HatchPattern,System.Drawing.Color[],System.Single[],Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Drawing.Color,System.Double,System.Double)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract void DrawGradientHatch(
	DisplayPipeline pipeline,
	Hatch hatch,
	HatchPattern pattern,
	Color[] gradientColors,
	float[] gradientStops,
	Point3d gradientPoint1,
	Point3d gradientPoint2,
	bool linearGradient,
	Color boundaryColor,
	double pointScale,
	double effectiveHatchScale
)
Protected MustOverride Sub DrawGradientHatch (
	pipeline As DisplayPipeline,
	hatch As Hatch,
	pattern As HatchPattern,
	gradientColors As Color(),
	gradientStops As Single(),
	gradientPoint1 As Point3d,
	gradientPoint2 As Point3d,
	linearGradient As Boolean,
	boundaryColor As Color,
	pointScale As Double,
	effectiveHatchScale As Double
)
Parameters
pipeline
Type: Rhino.Display.DisplayPipeline
[Missing <param name="pipeline"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawGradientHatch(Rhino.Display.DisplayPipeline,Rhino.Geometry.Hatch,Rhino.DocObjects.HatchPattern,System.Drawing.Color[],System.Single[],Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Drawing.Color,System.Double,System.Double)"]
hatch
Type: Rhino.Geometry.Hatch
[Missing <param name="hatch"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawGradientHatch(Rhino.Display.DisplayPipeline,Rhino.Geometry.Hatch,Rhino.DocObjects.HatchPattern,System.Drawing.Color[],System.Single[],Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Drawing.Color,System.Double,System.Double)"]
pattern
Type: Rhino.DocObjects.HatchPattern
[Missing <param name="pattern"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawGradientHatch(Rhino.Display.DisplayPipeline,Rhino.Geometry.Hatch,Rhino.DocObjects.HatchPattern,System.Drawing.Color[],System.Single[],Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Drawing.Color,System.Double,System.Double)"]
gradientColors
Type: System.Drawing.Color[]
[Missing <param name="gradientColors"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawGradientHatch(Rhino.Display.DisplayPipeline,Rhino.Geometry.Hatch,Rhino.DocObjects.HatchPattern,System.Drawing.Color[],System.Single[],Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Drawing.Color,System.Double,System.Double)"]
gradientStops
Type: System.Single[]
[Missing <param name="gradientStops"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawGradientHatch(Rhino.Display.DisplayPipeline,Rhino.Geometry.Hatch,Rhino.DocObjects.HatchPattern,System.Drawing.Color[],System.Single[],Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Drawing.Color,System.Double,System.Double)"]
gradientPoint1
Type: Rhino.Geometry.Point3d
[Missing <param name="gradientPoint1"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawGradientHatch(Rhino.Display.DisplayPipeline,Rhino.Geometry.Hatch,Rhino.DocObjects.HatchPattern,System.Drawing.Color[],System.Single[],Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Drawing.Color,System.Double,System.Double)"]
gradientPoint2
Type: Rhino.Geometry.Point3d
[Missing <param name="gradientPoint2"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawGradientHatch(Rhino.Display.DisplayPipeline,Rhino.Geometry.Hatch,Rhino.DocObjects.HatchPattern,System.Drawing.Color[],System.Single[],Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Drawing.Color,System.Double,System.Double)"]
linearGradient
Type: System.Boolean
[Missing <param name="linearGradient"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawGradientHatch(Rhino.Display.DisplayPipeline,Rhino.Geometry.Hatch,Rhino.DocObjects.HatchPattern,System.Drawing.Color[],System.Single[],Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Drawing.Color,System.Double,System.Double)"]
boundaryColor
Type: System.Drawing.Color
[Missing <param name="boundaryColor"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawGradientHatch(Rhino.Display.DisplayPipeline,Rhino.Geometry.Hatch,Rhino.DocObjects.HatchPattern,System.Drawing.Color[],System.Single[],Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Drawing.Color,System.Double,System.Double)"]
pointScale
Type: System.Double
[Missing <param name="pointScale"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawGradientHatch(Rhino.Display.DisplayPipeline,Rhino.Geometry.Hatch,Rhino.DocObjects.HatchPattern,System.Drawing.Color[],System.Single[],Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Drawing.Color,System.Double,System.Double)"]
effectiveHatchScale
Type: System.Double
[Missing <param name="effectiveHatchScale"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawGradientHatch(Rhino.Display.DisplayPipeline,Rhino.Geometry.Hatch,Rhino.DocObjects.HatchPattern,System.Drawing.Color[],System.Single[],Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Drawing.Color,System.Double,System.Double)"]
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace