RhinoCommon API
DracoCompression.Compress Method (Mesh, DracoCompressionOptions)
 Compress a mesh
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static DracoCompression Compress(
	Mesh mesh,
	DracoCompressionOptions options
)
Public Shared Function Compress (
	mesh As Mesh,
	options As DracoCompressionOptions
) As DracoCompression
Parameters
mesh
Type: Rhino.Geometry.Mesh
mesh to compress
options
Type: Rhino.FileIO.DracoCompressionOptions
options used to determine how the compression will occur
Return Value
Type: DracoCompression
instance of class representing the compressed data
See Also
Reference
DracoCompression Class
Compress Overload
Rhino.FileIO Namespace