RhinoCommon API
FileGHSReadOptions.ToDictionary Method
[Missing <summary> documentation for "M:Rhino.FileIO.FileGHSReadOptions.ToDictionary"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Since: 8.0
Syntax
public ArchivableDictionary ToDictionary()
Public Function ToDictionary As ArchivableDictionary
Return Value
Type: ArchivableDictionary
[Missing <returns> documentation for "M:Rhino.FileIO.FileGHSReadOptions.ToDictionary"]
See Also
Reference
FileGHSReadOptions Class
Rhino.FileIO Namespace