RhinoCommon API
GetBaseClass Constructor
Initializes a new instance of the GetBaseClass class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected GetBaseClass()
Protected Sub New
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace