RhinoCommon API
RhinoList<T> Constructor (Int32)
 Initializes an empty list with a certain capacity.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoList(
	int initialCapacity
)
Public Sub New (
	initialCapacity As Integer
)
Parameters
initialCapacity
Type: System.Int32
Number of items this list can store without resizing.
See Also
Reference
RhinoList<T> Class
RhinoList<T> Overload
Rhino.Collections Namespace