RhinoCommon API
Cylinder.LineAt Method
 Compute the line at the given angle parameter. This line will be degenerate if the cylinder is infinite.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Line LineAt(
	double angularParameter
)
Public Function LineAt (
	angularParameter As Double
) As Line
Parameters
angularParameter
Type: System.Double
Angle parameter for line section.
Return Value
Type: Line
[Missing <returns> documentation for "M:Rhino.Geometry.Cylinder.LineAt(System.Double)"]
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace