RhinoCommon API
HermiteSurface.PointAt Method
 Gets the interpolation point at the u,v parameter location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Point3d PointAt(
	int uIndex,
	int vIndex
)
Public Function PointAt (
	uIndex As Integer,
	vIndex As Integer
) As Point3d
Parameters
uIndex
Type: System.Int32
The "u" index.
vIndex
Type: System.Int32
The "v" index.
Return Value
Type: Point3d
The point location.
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace