RhinoCommon API
PointCloud.AddRange Method (IEnumerable<Point3d>, IEnumerable<Vector3d>, IEnumerable<Color>, IEnumerable<Double>)
 Appends a collection of points, normal vectors, colors, and extra values to this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public void AddRange(
	IEnumerable<Point3d> points,
	IEnumerable<Vector3d> normals,
	IEnumerable<Color> colors,
	IEnumerable<double> values
)
Public Sub AddRange (
	points As IEnumerable(Of Point3d),
	normals As IEnumerable(Of Vector3d),
	colors As IEnumerable(Of Color),
	values As IEnumerable(Of Double)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to append.
normals
Type: System.Collections.Generic.IEnumerable<Vector3d>
Normal Vectors to append.
colors
Type: System.Collections.Generic.IEnumerable<Color>
Colors to append.
values
Type: System.Collections.Generic.IEnumerable<Double>
 Exta point values to append. Extra values can be used to store a user-defined values, such as intensity.
See Also
Reference
PointCloud Class
AddRange Overload
Rhino.Geometry Namespace