RhinoCommon API
DocumentOrFreeFloatingBase.EndChange Method
[Missing <summary> documentation for "M:Rhino.Render.DocumentOrFreeFloatingBase.EndChange"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool EndChange()
Public Function EndChange As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.DocumentOrFreeFloatingBase.EndChange"]
See Also
Reference
DocumentOrFreeFloatingBase Class
Rhino.Render Namespace