RhinoCommon API
NamedParametersEventArgs.Finalize Method
 Finalizer in case Dispose wasn't called
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace