RhinoCommon API
File3dmObjectTable.AddTextDot Method (TextDot, ObjectAttributes)
Adds a text dot object to the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddTextDot(
	TextDot dot,
	ObjectAttributes attributes
)
Public Function AddTextDot (
	dot As TextDot,
	attributes As ObjectAttributes
) As Guid
Parameters
dot
Type: Rhino.Geometry.TextDot
The text dot.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to link with text dot.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddTextDot Overload
Rhino.FileIO Namespace