RhinoCommon API
LinearWorkflow.CopyFrom Method
 Copy from another linear workflow object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override void CopyFrom(
	FreeFloatingBase src
)
Public Overrides Sub CopyFrom (
	src As FreeFloatingBase
)
Parameters
src
Type: Rhino.Render.FreeFloatingBase
[Missing <param name="src"/> documentation for "M:Rhino.Render.LinearWorkflow.CopyFrom(Rhino.Render.FreeFloatingBase)"]
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace