RhinoCommon API
Intersection.RayShoot Method (IEnumerable<GeometryBase>, Ray3d, Int32, Boolean)
 Computes point intersections that occur when shooting a ray to a collection of surfaces and Breps.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static RayShootEvent[] RayShoot(
	IEnumerable<GeometryBase> geometry,
	Ray3d ray,
	int maxReflections,
	bool honorTrims
)
Public Shared Function RayShoot (
	geometry As IEnumerable(Of GeometryBase),
	ray As Ray3d,
	maxReflections As Integer,
	honorTrims As Boolean
) As RayShootEvent()
Parameters
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
The collection of surfaces and Breps to intersect.
ray
Type: Rhino.Geometry.Ray3d
A ray used in intersection.
maxReflections
Type: System.Int32
The maximum number of reflections. This value should be any value between 1 and 1000, inclusive.
honorTrims
Type: System.Boolean
 When true, hits that land outside a Brep face's trimming loops are skipped and the ray continues. When false, Breps are treated as their untrimmed surfaces, which is what Rhino 8 and earlier did.
Return Value
Type: RayShootEvent[]
An array of RayShootEvent structs if successful, or an empty array on failure.
Exceptions
Exception | Condition
ArgumentNullException | geometry is null.
ArgumentOutOfRangeException | maxReflections is strictly outside the [1-1000] range.
See Also
Reference
Intersection Class
RayShoot Overload
Rhino.Geometry.Intersect Namespace