RhinoCommon API
SubD.ComponentFromComponentIndex Method
 Returns a SubDComponent, either a SubDEdge, SubDFace, or SubDVertex, from a component index.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public SubDComponent ComponentFromComponentIndex(
	ComponentIndex componentIndex
)
Public Function ComponentFromComponentIndex (
	componentIndex As ComponentIndex
) As SubDComponent
Parameters
componentIndex
Type: Rhino.Geometry.ComponentIndex
The component index.
Return Value
Type: SubDComponent
The SubDComponent if successful, null otherwise.
See Also
Reference
SubD Class
Rhino.Geometry Namespace