RhinoCommon API
ContentFactories.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.ContentFactories.Finalize"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
ContentFactories Class
Rhino.Render.DataSources Namespace