RhinoCommon API
BinaryArchiveWriter.WriteMeshingParameters Method
 Writes a MeshingParameters value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteMeshingParameters(
	MeshingParameters value
)
Public Sub WriteMeshingParameters (
	value As MeshingParameters
)
Parameters
value
Type: Rhino.Geometry.MeshingParameters
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace