RhinoCommon API
ToolbarFile.GetSvg Method
 Gets the SVG string for an image in this toolbar file.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string GetSvg(
	Guid imageId,
	bool darkMode
)
Public Function GetSvg (
	imageId As Guid,
	darkMode As Boolean
) As String
Parameters
imageId
Type: System.Guid
The id of the image. This is the same id returned for a macro's bitmap.
darkMode
Type: System.Boolean
 Set to true to get the dark-mode SVG. When the image only has a light SVG, its custom dark-mode attributes are applied to produce the result.
Return Value
Type: String
The SVG string, or an empty string if the image was not found or has no SVG representation.
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace