RhinoCommon API
HostUtils.LogDebugEvent Method
 Logs a debug event. The function will log the filename and line number from where this function is called, in addition to the input message.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public static void LogDebugEvent(
	string message
)
Public Shared Sub LogDebugEvent (
	message As String
)
Parameters
message
Type: System.String
The event message.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace