RhinoCommon API
LightManagerSupport.LightsInSoloStorage Method
 Returns the number of lights in solo storage - any number other than 0 means "in solo mode"
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual int LightsInSoloStorage(
	RhinoDoc doc
)
Public Overridable Function LightsInSoloStorage (
	doc As RhinoDoc
) As Integer
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.LightManagerSupport.LightsInSoloStorage(Rhino.RhinoDoc)"]
Return Value
Type: Int32
Returns the number of lights in solo storage - any number other than 0 means "in solo mode"
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace