RhinoCommon API
ChangeQueue.ApplyEnvironmentChanges Method
 Override this when you want to handle environment changes
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplyEnvironmentChanges(
	RenderEnvironment.Usage usage
)
Protected Overridable Sub ApplyEnvironmentChanges (
	usage As RenderEnvironment.Usage
)
Parameters
usage
Type: Rhino.Render.RenderEnvironment.Usage
[Missing <param name="usage"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyEnvironmentChanges(Rhino.Render.RenderEnvironment.Usage)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace