RhinoCommon API
Squisher.SquishBack2dMarks Method
 Maps 2D geometry from the squished surface or mesh back to the original 3D surface or mesh
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public static IEnumerable<GeometryBase> SquishBack2dMarks(
	GeometryBase squishedGeometry,
	IEnumerable<GeometryBase> marks
)
Public Shared Function SquishBack2dMarks (
	squishedGeometry As GeometryBase,
	marks As IEnumerable(Of GeometryBase)
) As IEnumerable(Of GeometryBase)
Parameters
squishedGeometry
Type: Rhino.Geometry.GeometryBase
The squished surface or mesh
marks
Type: System.Collections.Generic.IEnumerable<GeometryBase>
The input 2D geometry
Return Value
Type: IEnumerable<GeometryBase>
An enumeratd list of squished marks. Individual marks that fail to squish are null in this list. Returns null on complete failure.
See Also
Reference
Squisher Class
Rhino.Geometry Namespace