RhinoCommon API
LightManagerSupportClient.GetLightFromId Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupportClient.GetLightFromId(System.Guid)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Light GetLightFromId(
	Guid uuid
)
Public Function GetLightFromId (
	uuid As Guid
) As Light
Parameters
uuid
Type: System.Guid
[Missing <param name="uuid"/> documentation for "M:Rhino.Render.LightManagerSupportClient.GetLightFromId(System.Guid)"]
Return Value
Type: Light
[Missing <returns> documentation for "M:Rhino.Render.LightManagerSupportClient.GetLightFromId(System.Guid)"]
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace