RhinoCommon API
FileSettings.FindFile Method
 Searches for a file using Rhino's search imagePath. Rhino will look for a file in the following locations: 1. The current document's folder. 2. Folder's specified in Options dialog, File tab. 3. Rhino's System folders.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string FindFile(
	string fileName
)
Public Shared Function FindFile (
	fileName As String
) As String
Parameters
fileName
Type: System.String
short file name to search for.
Return Value
Type: String
 full imagePath on success; null on error.
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace