RhinoCommon API
Intersection.MeshCurve Method (Mesh, Curve, Double, Boolean)
 Same as MeshCurve(Mesh, Curve, Double) with a flag controlling the Overlap span events.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static MeshCurveIntersection[] MeshCurve(
	Mesh mesh,
	Curve curve,
	double tolerance,
	bool includeOverlaps
)
Public Shared Function MeshCurve (
	mesh As Mesh,
	curve As Curve,
	tolerance As Double,
	includeOverlaps As Boolean
) As MeshCurveIntersection()
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.Geometry.Intersect.Intersection.MeshCurve(Rhino.Geometry.Mesh,Rhino.Geometry.Curve,System.Double,System.Boolean)"]
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.Geometry.Intersect.Intersection.MeshCurve(Rhino.Geometry.Mesh,Rhino.Geometry.Curve,System.Double,System.Boolean)"]
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.Intersect.Intersection.MeshCurve(Rhino.Geometry.Mesh,Rhino.Geometry.Curve,System.Double,System.Boolean)"]
includeOverlaps
Type: System.Boolean
[Missing <param name="includeOverlaps"/> documentation for "M:Rhino.Geometry.Intersect.Intersection.MeshCurve(Rhino.Geometry.Mesh,Rhino.Geometry.Curve,System.Double,System.Boolean)"]
Return Value
Type: MeshCurveIntersection[]
[Missing <returns> documentation for "M:Rhino.Geometry.Intersect.Intersection.MeshCurve(Rhino.Geometry.Mesh,Rhino.Geometry.Curve,System.Double,System.Boolean)"]
Remarks
 Every overlap is reported as two Point events at the overlap's endpoints plus one Overlap event for the in-plane span. The two endpoint Points are emitted in both modes; includeOverlaps controls only the span event. Pass false to drop the Overlap span events while still reporting the endpoint crossings as Point events — it does not reduce the result to transversal crossings only.
See Also
Reference
Intersection Class
MeshCurve Overload
Rhino.Geometry.Intersect Namespace