RhinoCommon API
ObjectTable.AddInstanceObject Method (Int32, Transform, ObjectAttributes)
 Adds an instance object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddInstanceObject(
	int instanceDefinitionIndex,
	Transform instanceXform,
	ObjectAttributes attributes
)
Public Function AddInstanceObject (
	instanceDefinitionIndex As Integer,
	instanceXform As Transform,
	attributes As ObjectAttributes
) As Guid
Parameters
instanceDefinitionIndex
Type: System.Int32
The index of the instance definition.
instanceXform
Type: Rhino.Geometry.Transform
The instance transformation.
attributes
Type: Rhino.DocObjects.ObjectAttributes
The attributes to apply to the instance object.
Return Value
Type: Guid
A unique identifier for the object if successful. Guid.Empty it not successful.
See Also
Reference
ObjectTable Class
AddInstanceObject Overload
Rhino.DocObjects.Tables Namespace