RhinoCommon API
Curve.MaxCurvaturePoints Method
 Returns a curve's maximum curvature points. The maximum curvature points identify where the curvature starts to decrease in both directions from the points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Point3d[] MaxCurvaturePoints()
Public Function MaxCurvaturePoints As Point3d()
Return Value
Type: Point3d[]
An array of points if successful, null if not successful or on error.
See Also
Reference
Curve Class
MaxCurvaturePoints Overload
Rhino.Geometry Namespace