RhinoCommon API
ObjRef Constructor (RhinoDoc, Guid, ComponentIndex)
 Initializes a new object reference from a guid and component index. The component index is used to specify a "piece" of the geometry
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public ObjRef(
	RhinoDoc doc,
	Guid id,
	ComponentIndex ci
)
Public Sub New (
	doc As RhinoDoc,
	id As Guid,
	ci As ComponentIndex
)
Parameters
doc
Type: Rhino.RhinoDoc
The Rhino document
id
Type: System.Guid
The object's Id
ci
Type: Rhino.Geometry.ComponentIndex
a portion of the object
See Also
Reference
ObjRef Class
ObjRef Overload
Rhino.DocObjects Namespace