RhinoCommon API
FileStpWriteOptions Constructor
Initializes a new instance of the FileStpWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileStpWriteOptions()
Public Sub New
See Also
Reference
FileStpWriteOptions Class
Rhino.FileIO Namespace