RhinoCommon API
RenderPipeline.Render Method
 Call this function to render the scene normally. The function returns when rendering is complete (or cancelled).
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RenderPipeline.RenderReturnCode Render()
Public Function Render As RenderPipeline.RenderReturnCode
Return Value
Type: RenderPipeline.RenderReturnCode
A code that explains how rendering completed.
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace