RhinoCommon API
Box.Contains Method (BoundingBox, Boolean)
 Determines whether a BoundingBox is inside this Box (strict inclusion, if strict is true). Invalid boxes contain nothing. Invalid bounding boxes are never contained.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Contains(
	BoundingBox box,
	bool strict
)
Public Function Contains (
	box As BoundingBox,
	strict As Boolean
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
BoundingBox to test.
strict
Type: System.Boolean
 If true, the BoundingBox needs to be strictly inside this Box, i.e. all corners of the BoundingBox are strictly inside this Box. If false, the BoundingBox can be touching this Box's boundary, i.e. all corners of the BoundingBox are non-strictly inside this Box.
Return Value
Type: Boolean
true if the box is (strictly, if strict is true) inside this Box. false if this Box or the BoundingBox are invalid.
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace