RhinoCommon API
ParticleSystem.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.Geometry.ParticleSystem.GetEnumerator"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IEnumerator<Particle> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Particle)
Return Value
Type: IEnumerator<Particle>
[Missing <returns> documentation for "M:Rhino.Geometry.ParticleSystem.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace