RhinoCommon API
HostUtils.GetAbsolutePath Method
 Call this method to convert a relative path to an absolute path relative to the specified path.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool GetAbsolutePath(
	string relativePath,
	bool bRelativePathisFileName,
	string relativeTo,
	bool bRelativeToIsFileName,
	out string pathOut
)
Public Shared Function GetAbsolutePath (
	relativePath As String,
	bRelativePathisFileName As Boolean,
	relativeTo As String,
	bRelativeToIsFileName As Boolean,
	<OutAttribute> ByRef pathOut As String
) As Boolean
Parameters
relativePath
Type: System.String
 Relative path to convert to an absolute path
bRelativePathisFileName
Type: System.Boolean
 If true then lpsFrom is treated as a file name otherwise it is treated as a directory name
relativeTo
Type: System.String
 File or folder the path is relative to
bRelativeToIsFileName
Type: System.Boolean
 If true then lpsFrom is treated as a file name otherwise it is treated as a directory name
pathOut
Type: System.String
 Reference to string which will receive the computed absolute path
Return Value
Type: Boolean
 Returns true if parameters are valid and lpsRelativePath is indeed relative to lpsRelativeTo otherwise returns false
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace