RhinoCommon API
File3dmInstanceDefinitionTable.Add Method (String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Adds an instance definition to the instance definition table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public int Add(
	string name,
	string description,
	Point3d basePoint,
	IEnumerable<GeometryBase> geometry,
	IEnumerable<ObjectAttributes> attributes
)
Public Function Add (
	name As String,
	description As String,
	basePoint As Point3d,
	geometry As IEnumerable(Of GeometryBase),
	attributes As IEnumerable(Of ObjectAttributes)
) As Integer
Parameters
name
Type: System.String
The definition name.
description
Type: System.String
The definition description.
basePoint
Type: Rhino.Geometry.Point3d
A base point.
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
An array, a list or any enumerable set of geometry.
attributes
Type: System.Collections.Generic.IEnumerable<ObjectAttributes>
An array, a list or any enumerable set of attributes.
Return Value
Type: Int32
 >=0 index of instance definition in the instance definition table. -1 on failure.
See Also
Reference
File3dmInstanceDefinitionTable Class
Add Overload
Rhino.FileIO Namespace