RhinoCommon API
AppearanceSettings.GetWidgetColor Method
 Gets the .Net library color that is currently associated with a widget color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Color GetWidgetColor(
	WidgetColor whichColor
)
Public Shared Function GetWidgetColor (
	whichColor As WidgetColor
) As Color
Parameters
whichColor
Type: Rhino.ApplicationSettings.WidgetColor
A color association.
Return Value
Type: Color
A .Net library color.
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace