RhinoCommon API
MeshInstance.AncestryRecord Constructor
Initializes a new instance of the MeshInstance.AncestryRecord class
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public AncestryRecord()
Public Sub New
See Also
Reference
MeshInstance.AncestryRecord Class
Rhino.Render.ChangeQueue Namespace