RhinoCommon API
RhinoObject.GetActiveVisualAnalysisModes Method
 Gets a list of currently enabled analysis modes for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public VisualAnalysisMode[] GetActiveVisualAnalysisModes()
Public Function GetActiveVisualAnalysisModes As VisualAnalysisMode()
Return Value
Type: VisualAnalysisMode[]
An array of visual analysis modes. The array can be empty, but not null.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace