RhinoCommon API
SimpleArrayInterval Constructor (IEnumerable<Interval>)
 Create an array of intervals
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SimpleArrayInterval(
	IEnumerable<Interval> intervals
)
Public Sub New (
	intervals As IEnumerable(Of Interval)
)
Parameters
intervals
Type: System.Collections.Generic.IEnumerable<Interval>
[Missing <param name="intervals"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayInterval.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Interval})"]
See Also
Reference
SimpleArrayInterval Class
SimpleArrayInterval Overload
Rhino.Runtime.InteropWrappers Namespace