RhinoCommon API
MetaDataProxy Constructor
 Constructor for MetaDataProxy
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public MetaDataProxy()
Public Sub New
See Also
Reference
MetaDataProxy Class
Rhino.Render Namespace