RhinoCommon API
LightManagerSupport.GroupLights Method
 Creates a new group with the lights
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract void GroupLights(
	RhinoDoc doc,
	ref LightArray light_array
)
Public MustOverride Sub GroupLights (
	doc As RhinoDoc,
	ByRef light_array As LightArray
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.LightManagerSupport.GroupLights(Rhino.RhinoDoc,Rhino.Render.LightArray@)"]
light_array
Type: Rhino.Render.LightArray
[Missing <param name="light_array"/> documentation for "M:Rhino.Render.LightManagerSupport.GroupLights(Rhino.RhinoDoc,Rhino.Render.LightArray@)"]
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace