RhinoCommon API
BrepFaceList.SplitFaceAtTangents Method (Int32, Boolean)
 Splits the face of a Brep at tangent locations. The face surface will be split at locations of curvature discontinuities with constant tangents.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SplitFaceAtTangents(
	int faceIndex,
	bool aggressiveMode
)
Public Function SplitFaceAtTangents (
	faceIndex As Integer,
	aggressiveMode As Boolean
) As Boolean
Parameters
faceIndex
Type: System.Int32
The index of the face to split.
aggressiveMode
Type: System.Boolean
 If aggressive mode is true, the face surface will be split at locations of curvature discontinuities with constant tangents. If aggressive mode is false, only split when the curvature change is from no curvature to some curvature or when the curvature vector directions are opposite.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
BrepFaceList Class
SplitFaceAtTangents Overload
Rhino.Geometry.Collections Namespace