RhinoCommon API
Squisher.GetMesh3dEdges Method
 Gets lines at the position of the mesh edges and diagonals that were constrained during the squish, in the 3d mesh. The line at any index here corresponds to the same line in GetLengthConstrained2dLines.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public Line[] GetMesh3dEdges()
Public Function GetMesh3dEdges As Line()
Return Value
Type: Line[]
An array of lines representing the length constraints
Remarks
Renamed to GetLengthConstrained3dLines.
See Also
Reference
Squisher Class
Rhino.Geometry Namespace