RhinoCommon API
NurbsSurface.FindClosestIsoCurve Method
 Find the closest isoparamentric curve, given a test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IsoStatus FindClosestIsoCurve(
	Point3d testPoint
)
Public Function FindClosestIsoCurve (
	testPoint As Point3d
) As IsoStatus
Parameters
testPoint
Type: Rhino.Geometry.Point3d
The test point.
Return Value
Type: IsoStatus
The enumeration.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace