RhinoCommon API
PlugIn.SetLicenseCapabilities Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.SetLicenseCapabilities(System.String,Rhino.PlugIns.LicenseCapabilities,System.Guid)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected void SetLicenseCapabilities(
	string textMask,
	LicenseCapabilities capabilities,
	Guid licenseId
)
Protected Sub SetLicenseCapabilities (
	textMask As String,
	capabilities As LicenseCapabilities,
	licenseId As Guid
)
Parameters
textMask
Type: System.String
[Missing <param name="textMask"/> documentation for "M:Rhino.PlugIns.PlugIn.SetLicenseCapabilities(System.String,Rhino.PlugIns.LicenseCapabilities,System.Guid)"]
capabilities
Type: Rhino.PlugIns.LicenseCapabilities
[Missing <param name="capabilities"/> documentation for "M:Rhino.PlugIns.PlugIn.SetLicenseCapabilities(System.String,Rhino.PlugIns.LicenseCapabilities,System.Guid)"]
licenseId
Type: System.Guid
[Missing <param name="licenseId"/> documentation for "M:Rhino.PlugIns.PlugIn.SetLicenseCapabilities(System.String,Rhino.PlugIns.LicenseCapabilities,System.Guid)"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace