RhinoCommon API
RenderWindow.FromSessionId Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.FromSessionId(System.Guid)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public static RenderWindow FromSessionId(
	Guid sessionId
)
Public Shared Function FromSessionId (
	sessionId As Guid
) As RenderWindow
Parameters
sessionId
Type: System.Guid
[Missing <param name="sessionId"/> documentation for "M:Rhino.Render.RenderWindow.FromSessionId(System.Guid)"]
Return Value
Type: RenderWindow
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.FromSessionId(System.Guid)"]
See Also
Reference
RenderWindow Class
Rhino.Render Namespace