RhinoCommon API
Transform2d.Scale Method (Point2d, Double, Double)
 Constructs a new non-uniform scaling transformation with a specified anchor point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d Scale(
	Point2d anchor,
	double xScaleFactor,
	double yScaleFactor
)
Public Shared Function Scale (
	anchor As Point2d,
	xScaleFactor As Double,
	yScaleFactor As Double
) As Transform2d
Parameters
anchor
Type: Rhino.Geometry.Point2d
The fixed point of the scaling.
xScaleFactor
Type: System.Double
The scaling factor along the world X axis.
yScaleFactor
Type: System.Double
The scaling factor along the world Y axis.
Return Value
Type: Transform2d
A transform matrix which scales geometry around the anchor point.
See Also
Reference
Transform2d Structure
Scale Overload
Rhino.Geometry Namespace