RhinoCommon API
MarkupTable.Add Method
 Adds a new markup with specified definition to the table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Add(
	Markup markup
)
Public Function Add (
	markup As Markup
) As Integer
Parameters
markup
Type: Rhino.DocObjects.Markup
 Definition of new markup. The information in markup is copied. If markup.Name is empty then a unique name of the form "Markup 01" will be automatically created.
Return Value
Type: Int32
 Index of new markup type or -1 on error.
See Also
Reference
MarkupTable Class
Rhino.DocObjects.Tables Namespace