RhinoCommon API
RenderContentType.Dispose Method (Boolean)
Releases the unmanaged resources used by the RenderContentType and optionally releases the managed resources
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool isDisposing
)
Protected Overridable Sub Dispose (
	isDisposing As Boolean
)
Parameters
isDisposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
RenderContentType Class
Dispose Overload
Rhino.Render Namespace