RhinoCommon API
Brep.CreatePlanarBreps Method (Curve)
Note: This API is now obsolete.
 Constructs a set of planar breps as outlines by the loops.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use version that takes tolerance as input")]
public static Brep[] CreatePlanarBreps(
	Curve inputLoop
)
<ObsoleteAttribute("Use version that takes tolerance as input")>
Public Shared Function CreatePlanarBreps (
	inputLoop As Curve
) As Brep()
Parameters
inputLoop
Type: Rhino.Geometry.Curve
A curve that should form the boundaries of the surfaces or polysurfaces.
Return Value
Type: Brep[]
An array of Planar Breps.
See Also
Reference
Brep Class
CreatePlanarBreps Overload
Rhino.Geometry Namespace