RhinoCommon API
ClippingPlaneSurface.AddClipViewportId Method
 Adds a viewport id to the list of viewports that this clipping plane clips.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public bool AddClipViewportId(
	Guid viewportId
)
Public Function AddClipViewportId (
	viewportId As Guid
) As Boolean
Parameters
viewportId
Type: System.Guid
The id of the RhinoViewport to add.
Return Value
Type: Boolean
true if the viewport was added, false if the viewport is already in the list.
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace