RhinoCommon API
HiddenLineDrawingParameters.AddGeometryAndPlanes Method (GeometryBase, Transform, Object, Boolean, List<Plane>)
 Add geometry and its active clipping planes to be included in the calculation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AddGeometryAndPlanes(
	GeometryBase geometry,
	Transform xform,
	Object tag,
	bool occluding_sections,
	List<Plane> clips
)
Public Function AddGeometryAndPlanes (
	geometry As GeometryBase,
	xform As Transform,
	tag As Object,
	occluding_sections As Boolean,
	clips As List(Of Plane)
) As Boolean
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
 Currently only points, point clouds, curves, meshes, breps, surfaces, and extrusions are supported
xform
Type: Rhino.Geometry.Transform
[Missing <param name="xform"/> documentation for "M:Rhino.Geometry.HiddenLineDrawingParameters.AddGeometryAndPlanes(Rhino.Geometry.GeometryBase,Rhino.Geometry.Transform,System.Object,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Plane})"]
tag
Type: System.Object
arbitrary data to be associated with this geometry
occluding_sections
Type: System.Boolean
sections of this geometry occlude
clips
Type: System.Collections.Generic.List<Plane>
Active clipping planes for this object
Return Value
Type: Boolean
 true if the type of geometry can be added for calculations. Currently only points, point clouds, curves, meshes, breps, surfaces, and extrusions are supported
See Also
Reference
HiddenLineDrawingParameters Class
AddGeometryAndPlanes Overload
Rhino.Geometry Namespace