RhinoCommon API
SmartTrackSettings.UpdateFromState Method
 Updates from a particular setting state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void UpdateFromState(
	SmartTrackSettingsState state
)
Public Shared Sub UpdateFromState (
	state As SmartTrackSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.SmartTrackSettingsState
The new state that will be set.
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace