RhinoCommon API
RenderContent.ModifyRenderContentStyles Method
 ModifyRenderContentStyles
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected void ModifyRenderContentStyles(
	RenderContentStyles stylesToAdd,
	RenderContentStyles stylesToRemove
)
Protected Sub ModifyRenderContentStyles (
	stylesToAdd As RenderContentStyles,
	stylesToRemove As RenderContentStyles
)
Parameters
stylesToAdd
Type: Rhino.Render.RenderContentStyles
[Missing <param name="stylesToAdd"/> documentation for "M:Rhino.Render.RenderContent.ModifyRenderContentStyles(Rhino.Render.RenderContentStyles,Rhino.Render.RenderContentStyles)"]
stylesToRemove
Type: Rhino.Render.RenderContentStyles
[Missing <param name="stylesToRemove"/> documentation for "M:Rhino.Render.RenderContent.ModifyRenderContentStyles(Rhino.Render.RenderContentStyles,Rhino.Render.RenderContentStyles)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace