RhinoCommon API
RenderContent.BeginCreateDynamicFields Method
 Automatic Dynamic Field support. Dynamic fields are typically created in the constructor of RenderContent and they are therefore created automatically whenever the content is created. However, some advanced users require the fields to be created in response to some user action which occurs much later. This creates the problem that the fields do not exist by default and therefore cannot be loaded when the document is loaded. These methods are provided to solve that problem by making it possible to automatically create the dynamic fields on loading if they don't already exist. Dynamic fields that have this auto-create-on-load behavior are referred to as automatic dynamic fields. Dynamic fields that do not require the advanced automatic feature can still be created by using these methods (recommended), or they can be created manually (legacy usage). You must call this before creating any dynamic fields. Calls to this method are counted; you must call EndCreateDynamicFields() once for every call to BeginCreateDynamicFields().
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public void BeginCreateDynamicFields(
	bool automatic
)
Public Sub BeginCreateDynamicFields (
	automatic As Boolean
)
Parameters
automatic
Type: System.Boolean
 automatic specifies if the dynamic fields are automatic. If so, they will be created automatically during loading of the document.
See Also
Reference
RenderContent Class
Rhino.Render Namespace