RhinoCommon API
EdgeAnalysisSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static EdgeAnalysisSettingsState GetCurrentState()
Public Shared Function GetCurrentState As EdgeAnalysisSettingsState
Return Value
Type: EdgeAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.EdgeAnalysisSettings.GetCurrentState"]
See Also
Reference
EdgeAnalysisSettings Class
Rhino.ApplicationSettings Namespace