RhinoCommon API
InstanceDefinitionTable.MakeSourcePathRelative Method
Note: This API is now obsolete.
 Obsolete method that always returns false. Marks the source path for a linked instance definition as relative or absolute.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Source paths are always absolute at runtime. They cannot be changed.")]
public bool MakeSourcePathRelative(
	InstanceDefinition idef,
	bool relative,
	bool quiet
)
<ObsoleteAttribute("Source paths are always absolute at runtime. They cannot be changed.")>
Public Function MakeSourcePathRelative (
	idef As InstanceDefinition,
	relative As Boolean,
	quiet As Boolean
) As Boolean
Parameters
idef
Type: Rhino.DocObjects.InstanceDefinition
The instance definition to be marked.
relative
Type: System.Boolean
If true, the path should be considered as relative.
If false, the path should be considered as absolute.
quiet
Type: System.Boolean
If true, then message boxes about erroneous parameters will not be shown.
Return Value
Type: Boolean
 true if the instance definition could be modified.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace