RhinoCommon API
RhinoPageView.GetDetailViews Method
 Gets a list of the detail view objects associated with this layout.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DetailViewObject[] GetDetailViews()
Public Function GetDetailViews As DetailViewObject()
Return Value
Type: DetailViewObject[]
An array of detail view objects if successful, an empty array if the layout has no details.
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace