RhinoCommon API
GripUserInterfaceObject.Constrain Method (Arc)
[Missing <summary> documentation for "M:Rhino.UI.GripUserInterfaceObject.Constrain(Rhino.Geometry.Arc)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Constrain(
	Arc arc
)
Public Sub Constrain (
	arc As Arc
)
Parameters
arc
Type: Rhino.Geometry.Arc
[Missing <param name="arc"/> documentation for "M:Rhino.UI.GripUserInterfaceObject.Constrain(Rhino.Geometry.Arc)"]
See Also
Reference
GripUserInterfaceObject Class
Constrain Overload
Rhino.UI Namespace