RhinoCommon API
NamedParametersEventArgs.TryGetPoints Method
 Gets a point array for the specified key
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool TryGetPoints(
	string name,
	out Point3d[] pts
)
Public Function TryGetPoints (
	name As String,
	<OutAttribute> ByRef pts As Point3d()
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetPoints(System.String,Rhino.Geometry.Point3d[]@)"]
pts
Type: Rhino.Geometry.Point3d[]
[Missing <param name="pts"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetPoints(System.String,Rhino.Geometry.Point3d[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetPoints(System.String,Rhino.Geometry.Point3d[]@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace