RhinoCommon API
ContentHash.Inequality Operator
 Determines if two ContentHash instances are different by value.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool operator !=(
	ContentHash left,
	ContentHash right
)
Public Shared Operator <> (
	left As ContentHash,
	right As ContentHash
) As Boolean
Parameters
left
Type: Rhino.FileIO.ContentHash
The first hash.
right
Type: Rhino.FileIO.ContentHash
The second hash.
Return Value
Type: Boolean
True if they are different by value, otherwise false.
See Also
Reference
ContentHash Class
Rhino.FileIO Namespace