RhinoCommon API
SubDDisplayParameters.ToEncodedString Method
 Returns a encoded string that represents the MeshingParameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string ToEncodedString()
Public Function ToEncodedString As String
Return Value
Type: String
 A encoded string that represents the MeshingParameters.
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace