RhinoCommon API
RealtimeDisplayMode.InitFramebufferEventArgs Constructor
Initializes a new instance of the RealtimeDisplayMode.InitFramebufferEventArgs class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public InitFramebufferEventArgs(
	DisplayPipeline dp
)
Public Sub New (
	dp As DisplayPipeline
)
Parameters
dp
Type: Rhino.Display.DisplayPipeline
[Missing <param name="dp"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.InitFramebufferEventArgs.#ctor(Rhino.Display.DisplayPipeline)"]
See Also
Reference
RealtimeDisplayMode.InitFramebufferEventArgs Class
Rhino.Render Namespace