RhinoCommon API
BitmapExtensions.IsNormalMap Method
 Call this method to see if the DIB appears to be a normal map.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public static bool IsNormalMap(
	this Bitmap bitmap,
	bool bLossyCompressionSource,
	out bool bPositiveZComponent
)
<ExtensionAttribute>
Public Shared Function IsNormalMap (
	bitmap As Bitmap,
	bLossyCompressionSource As Boolean,
	<OutAttribute> ByRef bPositiveZComponent As Boolean
) As Boolean
Parameters
bitmap
Type: System.Drawing.Bitmap
[Missing <param name="bitmap"/> documentation for "M:Rhino.BitmapExtensions.IsNormalMap(System.Drawing.Bitmap,System.Boolean,System.Boolean@)"]
bLossyCompressionSource
Type: System.Boolean
True if the source of the bitmap is an image with lossy compression (e.g. jpg). False otherwise. The check will be less strict if the image can contain errors due to lossy compression.
bPositiveZComponent
Type: System.Boolean
True if the image is a normal map with the z-component mapped to the range 0 .. +1. False if the image is a normal map with the z-component mapped to the range -1 .. +1.
Return Value
Type: Boolean
Returns true if the bitmap appears to be a normal map. False otherwise.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Bitmap. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BitmapExtensions Class
Rhino Namespace