RhinoCommon API
RhinoMath.UnitScale Method (UnitSystem, UnitSystem)
 Computes the scale factor for changing the measurements unit systems.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static double UnitScale(
	UnitSystem from,
	UnitSystem to
)
Public Shared Function UnitScale (
	from As UnitSystem,
	to As UnitSystem
) As Double
Parameters
from
Type: Rhino.UnitSystem
The system to convert from.
to
Type: Rhino.UnitSystem
The system to convert measurements into.
Return Value
Type: Double
A scale multiplier.
See Also
Reference
RhinoMath Class
UnitScale Overload
Rhino Namespace