RhinoCommon API
SubDEdgeSharpness.Subdivided Method
 Gets the sharpness this edge would have after one subdivision.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDEdgeSharpness Subdivided(
	int endIndex
)
Public Function Subdivided (
	endIndex As Integer
) As SubDEdgeSharpness
Parameters
endIndex
Type: System.Int32
0 for the start of the edge, 1 for the end.
Return Value
Type: SubDEdgeSharpness
 The subdivided sharpness, or Smooth if endIndex is out of range.
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace