RhinoCommon API
Brep.CreateBaseballSphere Method
 Creates a brep representation of the sphere with two similar trimmed NURBS surfaces, and no singularities.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep CreateBaseballSphere(
	Point3d center,
	double radius,
	double tolerance
)
Public Shared Function CreateBaseballSphere (
	center As Point3d,
	radius As Double,
	tolerance As Double
) As Brep
Parameters
center
Type: Rhino.Geometry.Point3d
The center of the sphere.
radius
Type: System.Double
The radius of the sphere.
tolerance
Type: System.Double
 Used in computing 2d trimming curves. If >= 0.0, then the max of ON_0.0001 * radius and RhinoMath.ZeroTolerance will be used.
Return Value
Type: Brep
A new brep, or null on error.
See Also
Reference
Brep Class
Rhino.Geometry Namespace