RhinoCommon API
SimpleArrayExtrusionPointer Constructor
 Initializes a new SimpleArrayExtrusionPointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public SimpleArrayExtrusionPointer()
Public Sub New
See Also
Reference
SimpleArrayExtrusionPointer Class
Rhino.Runtime.InteropWrappers Namespace