RhinoCommon API
GetPoint.PointOnBrep Method
 Use to determine if point was on a Brep face. If the point was on a Brep face, then the (u,v) are the face parameters for the point.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public BrepFace PointOnBrep(
	out double u,
	out double v
)
Public Function PointOnBrep (
	<OutAttribute> ByRef u As Double,
	<OutAttribute> ByRef v As Double
) As BrepFace
Parameters
u
Type: System.Double
If the point was on a Brep face, then the u parameter.
v
Type: System.Double
If the point was on a Brep face, then the v parameter.
Return Value
Type: BrepFace
The Brep face or null if the point was not on a Brep face.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace