RhinoCommon API
Squisher.SquishTextDot Method
 Maps a TextDot on or near a previously squished 3d surface to the resulting 2d surface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public TextDot SquishTextDot(
	TextDot textDot
)
Public Function SquishTextDot (
	textDot As TextDot
) As TextDot
Parameters
textDot
Type: Rhino.Geometry.TextDot
The text dot to squish
Return Value
Type: TextDot
The resulting textDot
See Also
Reference
Squisher Class
Rhino.Geometry Namespace