RhinoCommon API
Mesh.CreateFromPatchSingleFace Method
 Creates a single mesh face from the given input.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Mesh CreateFromPatchSingleFace(
	Mesh mesh,
	IEnumerable<ComponentIndex> components
)
Public Shared Function CreateFromPatchSingleFace (
	mesh As Mesh,
	components As IEnumerable(Of ComponentIndex)
) As Mesh
Parameters
mesh
Type: Rhino.Geometry.Mesh
The input mesh.
components
Type: System.Collections.Generic.IEnumerable<ComponentIndex>
An enumeration of component indexes from the input mesh. This can be one following combinations: 1 vertex (MeshVertex or MeshTopologyVertex) and 1 edge (MeshTopologyEdge), 2 edges (MeshTopologyEdge), or 3 vertices (MeshVertex or MeshTopologyVertex).
Return Value
Type: Mesh
A new mesh if successful, null otherwise.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace