RhinoCommon API
DisplayPipeline.EnableColorWriting Method
 Enable or disable the ColorWriting behavior of the engine.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void EnableColorWriting(
	bool enable
)
Public Sub EnableColorWriting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true to enable ColorWriting, false to disable.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace