RhinoCommon API
DraftAngleAnalysisSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static DraftAngleAnalysisSettingsState GetCurrentState()
Public Shared Function GetCurrentState As DraftAngleAnalysisSettingsState
Return Value
Type: DraftAngleAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.DraftAngleAnalysisSettings.GetCurrentState"]
See Also
Reference
DraftAngleAnalysisSettings Class
Rhino.ApplicationSettings Namespace