RhinoCommon API
LightManagerSupport.OnCustomLightEvent Method
 Generates LightMangerSupportCustomEvent: light_added, light_deleted, light_undeleted, light_modified, light_sorted, The event triggers a Light table event that the rdk lightmanager listens too
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void OnCustomLightEvent(
	RhinoDoc doc,
	LightMangerSupportCustomEvent le,
	ref Light light
)
Public Sub OnCustomLightEvent (
	doc As RhinoDoc,
	le As LightMangerSupportCustomEvent,
	ByRef light As Light
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.LightManagerSupport.OnCustomLightEvent(Rhino.RhinoDoc,Rhino.Render.LightMangerSupportCustomEvent,Rhino.Geometry.Light@)"]
le
Type: Rhino.Render.LightMangerSupportCustomEvent
[Missing <param name="le"/> documentation for "M:Rhino.Render.LightManagerSupport.OnCustomLightEvent(Rhino.RhinoDoc,Rhino.Render.LightMangerSupportCustomEvent,Rhino.Geometry.Light@)"]
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.LightManagerSupport.OnCustomLightEvent(Rhino.RhinoDoc,Rhino.Render.LightMangerSupportCustomEvent,Rhino.Geometry.Light@)"]
Return Value
Type:
Returns the string representation of the light description
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace