RhinoCommon API
DisplayModeDescription.AddDisplayMode Method (String)
 Adds a new display mode. Note that this only registers the mode in memory; call UpdateDisplayMode to persist it to disk.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public static Guid AddDisplayMode(
	string name
)
Public Shared Function AddDisplayMode (
	name As String
) As Guid
Parameters
name
Type: System.String
The name of the new display mode.
Return Value
Type: Guid
The id of the new display mode if successful. Guid.Empty on error.
See Also
Reference
DisplayModeDescription Class
AddDisplayMode Overload
Rhino.Display Namespace