RhinoCommon API
SimpleArrayBrepPointer Constructor
 Initializes a new SimpleArrayBrepPointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SimpleArrayBrepPointer()
Public Sub New
See Also
Reference
SimpleArrayBrepPointer Class
Rhino.Runtime.InteropWrappers Namespace