RhinoCommon API
File3dmObjectTable.FindByGroup Method
 Finds all File3dmObject that are in a given group.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.20
Syntax
public File3dmObject[] FindByGroup(
	Group group
)
Public Function FindByGroup (
	group As Group
) As File3dmObject()
Parameters
group
Type: Rhino.DocObjects.Group
A group instance.
Return Value
Type: File3dmObject[]
Array of objects that belong to the specified group or empty array if no objects could be found.
Exceptions
Exception | Condition
ArgumentNullException | If group is null.
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace