RhinoCommon API
PostEffectChannel.Clone Method
 Return a clone of this channel.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PostEffectChannel Clone()
Public Function Clone As PostEffectChannel
Return Value
Type: PostEffectChannel
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectChannel.Clone"]
See Also
Reference
PostEffectChannel Class
Rhino.Render.PostEffects Namespace