RhinoCommon API
MeshFace.IsValid Method (Point3d[])
 Gets a value indicating whether or not this mesh face is considered to be valid. Unlike the simple IsValid function, this function takes actual point locations into account.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsValid(
	Point3d[] points
)
Public Function IsValid (
	points As Point3d()
) As Boolean
Parameters
points
Type: Rhino.Geometry.Point3d[]
Array of vertices with which to validate the face.
Return Value
Type: Boolean
true if the face is considered valid, false if not.
See Also
Reference
MeshFace Structure
IsValid Overload
Rhino.Geometry Namespace