RhinoCommon API
PointCloud.AddRange Method (IEnumerable<Point3d>, IEnumerable<Vector3d>)
 Appends a collection of points and normal vectors to this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void AddRange(
	IEnumerable<Point3d> points,
	IEnumerable<Vector3d> normals
)
Public Sub AddRange (
	points As IEnumerable(Of Point3d),
	normals As IEnumerable(Of Vector3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to append.
normals
Type: System.Collections.Generic.IEnumerable<Vector3d>
Normal Vectors to append.
Exceptions
Exception | Condition
ArgumentException | thrown if points and normals have differing numbers of elements
See Also
Reference
PointCloud Class
AddRange Overload
Rhino.Geometry Namespace