RhinoCommon API
UserInterfaceGrid.SetColumnContentAlignment Method
 How the controls in a column sit in their cells. The default is Stretch / Center, which makes a control fill the column width and center itself in the row. Any horizontal setting other than Stretch gives the control the width it reports from its computed size.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetColumnContentAlignment(
	int column,
	ControlHorizontalAlignment horizontal,
	ControlVerticalAlignment vertical
)
Public Sub SetColumnContentAlignment (
	column As Integer,
	horizontal As ControlHorizontalAlignment,
	vertical As ControlVerticalAlignment
)
Parameters
column
Type: System.Int32
[Missing <param name="column"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetColumnContentAlignment(System.Int32,Rhino.UI.ControlHorizontalAlignment,Rhino.UI.ControlVerticalAlignment)"]
horizontal
Type: Rhino.UI.ControlHorizontalAlignment
[Missing <param name="horizontal"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetColumnContentAlignment(System.Int32,Rhino.UI.ControlHorizontalAlignment,Rhino.UI.ControlVerticalAlignment)"]
vertical
Type: Rhino.UI.ControlVerticalAlignment
[Missing <param name="vertical"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetColumnContentAlignment(System.Int32,Rhino.UI.ControlHorizontalAlignment,Rhino.UI.ControlVerticalAlignment)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace