RhinoCommon API
HostUtils.ExecuteNamedCallback Method
 Execute a named callback
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool ExecuteNamedCallback(
	string name,
	NamedParametersEventArgs args
)
Public Shared Function ExecuteNamedCallback (
	name As String,
	args As NamedParametersEventArgs
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.HostUtils.ExecuteNamedCallback(System.String,Rhino.Runtime.NamedParametersEventArgs)"]
args
Type: Rhino.Runtime.NamedParametersEventArgs
[Missing <param name="args"/> documentation for "M:Rhino.Runtime.HostUtils.ExecuteNamedCallback(System.String,Rhino.Runtime.NamedParametersEventArgs)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.ExecuteNamedCallback(System.String,Rhino.Runtime.NamedParametersEventArgs)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace