RhinoCommon API
RenderPipeline.RenderExitModalLoop Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.RenderExitModalLoop"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool RenderExitModalLoop()
Protected Overridable Function RenderExitModalLoop As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.RenderExitModalLoop"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace