RhinoCommon API
InstanceDefinition.UsesLayer Method
 Returns true if some object in the instance definition is on the layer with the specified layer index.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public bool UsesLayer(
	int layerIndex
)
Public Function UsesLayer (
	layerIndex As Integer
) As Boolean
Parameters
layerIndex
Type: System.Int32
The index of layer to search for.
Return Value
Type: Boolean
 True if there is an object in the instance definition that is on the layer.
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace