RhinoCommon API
FileLwoWriteOptions Constructor
Initializes a new instance of the FileLwoWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileLwoWriteOptions()
Public Sub New
See Also
Reference
FileLwoWriteOptions Class
Rhino.FileIO Namespace