RhinoCommon API
Arc.Trim Method
 Sets the arc's angle domain (in radians) to the specified interval, provided it is increasing and its length does not exceed 2.0 * Math.PI (plus a small tolerance). If the interval length exceeds 2.0 * Math.PI it will be clamped to exactly 2.0 * Math.PI. Returns true if the domain was set successfully, false otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Trim(
	Interval domain
)
Public Function Trim (
	domain As Interval
) As Boolean
Parameters
domain
Type: Rhino.Geometry.Interval
 The desired angle domain in radians. Must satisfy domain[0] < domain[1] and domain[1] - domain[0] <= 2.0 * Math.PI + tolerance.
Return Value
Type: Boolean
 True if the domain was set successfully; false if the interval is not increasing or exceeds the allowed length.
See Also
Reference
Arc Structure
Rhino.Geometry Namespace