RhinoCommon API
UserInterfaceTextBox.OnTextCommitted Method
 Called when Enter is pressed, and when the box loses focus with the text changed from what it started with. This is where you do something about the new text. The default implementation raises the TextCommitted event.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnTextCommitted()
Protected Overridable Sub OnTextCommitted
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace