RhinoCommon API
SectionStyle Constructor
Create a new instance of a SectionStyle
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public SectionStyle()
Public Sub New
See Also
Reference
SectionStyle Class
SectionStyle Overload
Rhino.DocObjects Namespace