RhinoCommon API
CurveList Constructor
 Initializes a new empty list of curves.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public CurveList()
Public Sub New
See Also
Reference
CurveList Class
CurveList Overload
Rhino.Collections Namespace