RhinoCommon API
Dimension.GetTextTransform Method
 Get the transform for this text object's text geometry
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Transform GetTextTransform(
	ViewportInfo viewport,
	DimensionStyle style,
	double textScale,
	bool drawForward
)
Public Function GetTextTransform (
	viewport As ViewportInfo,
	style As DimensionStyle,
	textScale As Double,
	drawForward As Boolean
) As Transform
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
Viewport where text is being used
style
Type: Rhino.DocObjects.DimensionStyle
Dimension's DimensionStyle
textScale
Type: System.Double
Scale to apply to text
drawForward
Type: System.Boolean
Draw text front-facing
Return Value
Type: Transform
[Missing <returns> documentation for "M:Rhino.Geometry.Dimension.GetTextTransform(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.DimensionStyle,System.Double,System.Boolean)"]
See Also
Reference
Dimension Class
Rhino.Geometry Namespace