RhinoCommon API
TransformObjectList.Dispose Method (Boolean)
Releases the unmanaged resources used by the TransformObjectList and optionally releases the managed resources
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
TransformObjectList Class
Dispose Overload
Rhino.Collections Namespace