RhinoCommon API
FileCsvDocument.TryGetString Method (Int32, Int32, String)
 Retrieves the value of a cell as a string.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetString(
	int column,
	int row,
	out string value
)
Public Function TryGetString (
	column As Integer,
	row As Integer,
	<OutAttribute> ByRef value As String
) As Boolean
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.String
The value of the cell, or null if the cell does not exist.
Return Value
Type: Boolean
true if the cell exists; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetString Overload
Rhino.FileIO Namespace