RhinoCommon API
PersistentSettings.SetEnumValue<T> Method (String, T)
 Set an enumerated value in the settings using a custom key
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public void SetEnumValue<T>(
	string key,
	T value
)
where T : struct, new(), IConvertible
Public Sub SetEnumValue(Of T As {Structure, New, IConvertible}) (
	key As String,
	value As T
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetEnumValue``1(System.String,``0)"]
value
Type: T
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetEnumValue``1(System.String,``0)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.PersistentSettings.SetEnumValue``1(System.String,``0)"]
See Also
Reference
PersistentSettings Class
SetEnumValue Overload
Rhino Namespace