RhinoCommon API
AngularDimension.Create Method (DimensionStyle, Plane, Vector3d, Point3d, Point3d, Point3d, Point3d)
 Creates an angular dimension with extension lines starting at plane origin (arc center).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static AngularDimension Create(
	DimensionStyle dimStyle,
	Plane plane,
	Vector3d horizontal,
	Point3d centerpoint,
	Point3d defpoint1,
	Point3d defpoint2,
	Point3d dimlinepoint
)
Public Shared Function Create (
	dimStyle As DimensionStyle,
	plane As Plane,
	horizontal As Vector3d,
	centerpoint As Point3d,
	defpoint1 As Point3d,
	defpoint2 As Point3d,
	dimlinepoint As Point3d
) As AngularDimension
Parameters
dimStyle
Type: Rhino.DocObjects.DimensionStyle
Dimension's dimension style
plane
Type: Rhino.Geometry.Plane
Dimension's plane.
horizontal
Type: Rhino.Geometry.Vector3d
Horizontal reference direction.
centerpoint
Type: Rhino.Geometry.Point3d
Dimension center point.
defpoint1
Type: Rhino.Geometry.Point3d
Point on first extension line.
defpoint2
Type: Rhino.Geometry.Point3d
Point on second extension line.
dimlinepoint
Type: Rhino.Geometry.Point3d
Point on dimension arc.
Return Value
Type: AngularDimension
The angular dimension if successful, null otherwise.
See Also
Reference
AngularDimension Class
Create Overload
Rhino.Geometry Namespace