RhinoCommon API
FileSkp.Write Method
Write a Skp file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string filename,
	RhinoDoc doc,
	FileSkpWriteOptions options
)
Public Shared Function Write (
	filename As String,
	doc As RhinoDoc,
	options As FileSkpWriteOptions
) As Boolean
Parameters
filename
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileSkpWriteOptions
options used for generating the Skp file
Return Value
Type: Boolean
true on success
See Also
Reference
FileSkp Class
Rhino.FileIO Namespace