RhinoCommon API
IZooClientUtilities.AskUserForLicense Method
[Missing <summary> documentation for "M:Rhino.Runtime.IZooClientUtilities.AskUserForLicense(System.Object,Rhino.Runtime.ZooClientParameters)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool AskUserForLicense(
	Object verify,
	ZooClientParameters parameters
)
Function AskUserForLicense (
	verify As Object,
	parameters As ZooClientParameters
) As Boolean
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.AskUserForLicense(System.Object,Rhino.Runtime.ZooClientParameters)"]
parameters
Type: Rhino.Runtime.ZooClientParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.AskUserForLicense(System.Object,Rhino.Runtime.ZooClientParameters)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.AskUserForLicense(System.Object,Rhino.Runtime.ZooClientParameters)"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace