RhinoCommon API
LightManagerSupportClient.OnEditLight Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupportClient.OnEditLight(Rhino.Render.LightArray)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void OnEditLight(
	LightArray lights
)
Public Sub OnEditLight (
	lights As LightArray
)
Parameters
lights
Type: Rhino.Render.LightArray
[Missing <param name="lights"/> documentation for "M:Rhino.Render.LightManagerSupportClient.OnEditLight(Rhino.Render.LightArray)"]
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace