RhinoCommon API
Material.MaterialChannelIdFromIndex Method
 Finds id of the material channel at given index.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.26
Syntax
public Guid MaterialChannelIdFromIndex(
	int material_channel_index
)
Public Function MaterialChannelIdFromIndex (
	material_channel_index As Integer
) As Guid
Parameters
material_channel_index
Type: System.Int32
Index
Return Value
Type: Guid
Id of the material channel
See Also
Reference
Material Class
Rhino.DocObjects Namespace