RhinoCommon API
RhinoDoc.PurgeObjectHistory Method (IEnumerable<RhinoObject>)
 Purges the history records of a list of objects.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PurgeObjectHistory(
	IEnumerable<RhinoObject> objects
)
Public Function PurgeObjectHistory (
	objects As IEnumerable(Of RhinoObject)
) As Integer
Parameters
objects
Type: System.Collections.Generic.IEnumerable<RhinoObject>
 The objects whose history records are to be purged. Objects that have no history record are skipped.
Return Value
Type: Int32
The number of objects that had a history record purged.
See Also
Reference
RhinoDoc Class
PurgeObjectHistory Overload
Rhino Namespace