RhinoCommon API
DimStyleTable.Modify Method (DimensionStyle, Guid, Boolean)
Modifies dimension style settings.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Modify(
	DimensionStyle newSettings,
	Guid dimstyleId,
	bool quiet
)
Public Function Modify (
	newSettings As DimensionStyle,
	dimstyleId As Guid,
	quiet As Boolean
) As Boolean
Parameters
newSettings
Type: Rhino.DocObjects.DimensionStyle
This information is copied.
dimstyleId
Type: System.Guid
 Id of dimension style
quiet
Type: System.Boolean
if true, information message boxes pop up when illegal changes are attempted.
Return Value
Type: Boolean
 true if successful. false if Id is not already in table
See Also
Reference
DimStyleTable Class
Modify Overload
Rhino.DocObjects.Tables Namespace