RhinoCommon API
Polyline.IsConvexLoop Method
 Determines if a polyline is convex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.28
Syntax
public bool IsConvexLoop(
	bool strictlyConvex
)
Public Function IsConvexLoop (
	strictlyConvex As Boolean
) As Boolean
Parameters
strictlyConvex
Type: System.Boolean
If false, collinear segments are considered convex.
Return Value
Type: Boolean
True if the polyline is a closed, convex loop.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace