RhinoCommon API
RenderPlugIn.IsTextureSupported Method
 Returns true if this renderer can render the texture natively without needing it to be baked into a bitmap, false otherwise. By default, returns false for all textures.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool IsTextureSupported(
	RenderTexture texture
)
Public Overridable Function IsTextureSupported (
	texture As RenderTexture
) As Boolean
Parameters
texture
Type: Rhino.Render.RenderTexture
[Missing <param name="texture"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.IsTextureSupported(Rhino.Render.RenderTexture)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.RenderPlugIn.IsTextureSupported(Rhino.Render.RenderTexture)"]
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace