RhinoCommon API
RhinoObject.CopyHistoryOnReplace Method
 Gets the setting of the CopyOnReplace field in this object's history
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool CopyHistoryOnReplace()
Public Function CopyHistoryOnReplace As Boolean
Return Value
Type: Boolean
 true if this object has history and the field is set false otherwise
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace