RhinoCommon API
PersistentSettings.GetSettingType Method
 Gets the type of the last value passed to Set... or Get... for the specified setting.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Type GetSettingType(
	string key
)
Public Function GetSettingType (
	key As String
) As Type
Parameters
key
Type: System.String
 Key name for which to search.
Return Value
Type: Type
 Type of the last value passed to Set... or Get... for the specified setting.
Exceptions
Exception | Condition
KeyNotFoundException |  A KeyNotFoundException exception is thrown if the key is not found in the settings dictionary.
See Also
Reference
PersistentSettings Class
Rhino Namespace