RhinoCommon API
AnimationProperties Constructor (AnimationProperties)
 Initialize new instance of the AnimationProperties class.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public AnimationProperties(
	AnimationProperties source
)
Public Sub New (
	source As AnimationProperties
)
Parameters
source
Type: Rhino.DocObjects.AnimationProperties
If not null, settings are copied from source
See Also
Reference
AnimationProperties Class
AnimationProperties Overload
Rhino.DocObjects Namespace