RhinoCommon API
RenderPipeline.ContinueModal Method
 Frequently called during a rendering by the frame work in order to determine if the rendering should continue.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract bool ContinueModal()
Protected MustOverride Function ContinueModal As Boolean
Return Value
Type: Boolean
Returns true if the rendering should continue.
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace