RhinoCommon API
SimpleArray2dex.ToArray Method
 Returns the managed counterpart of the unmanaged array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IndexPair[] ToArray()
Public Function ToArray As IndexPair()
Return Value
Type: IndexPair[]
The managed array.
See Also
Reference
SimpleArray2dex Class
Rhino.Runtime.InteropWrappers Namespace