RhinoCommon API
Instance.Dispose Method
 Dispose method
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
Instance Class
Dispose Overload
Rhino.Render.CustomRenderMeshes Namespace