RhinoCommon API
Transform2d Constructor (Double)
 Initializes a new transform matrix with a specified value along the diagonal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Transform2d(
	double diagonalValue
)
Public Sub New (
	diagonalValue As Double
)
Parameters
diagonalValue
Type: System.Double
Value to assign to M00 and M11. The translation is zero.
See Also
Reference
Transform2d Structure
Transform2d Overload
Rhino.Geometry Namespace