RhinoCommon API
ManifestTable.FindNameHash<T> Method (NameHash)
 Uses the hash of the name to find a model component. Deleted objects have no name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public T FindNameHash<T>(
	NameHash nameHash
)
where T : ModelComponent
Public Function FindNameHash(Of T As ModelComponent) (
	nameHash As NameHash
) As T
Parameters
nameHash
Type: Rhino.FileIO.NameHash
Name hash of model component to search for.
Type Parameters
T
The type, derived from ModelComponent.
Return Value
Type: T
[Missing <returns> documentation for "M:Rhino.FileIO.ManifestTable.FindNameHash``1(Rhino.FileIO.NameHash)"]
See Also
Reference
ManifestTable Class
FindNameHash Overload
Rhino.FileIO Namespace