RhinoCommon API
Brep.CurveConstraint Constructor (Curve)
 Constructor, use curve as positional constraint
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public CurveConstraint(
	Curve curve
)
Public Sub New (
	curve As Curve
)
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.Geometry.Brep.CurveConstraint.#ctor(Rhino.Geometry.Curve)"]
See Also
Reference
Brep.CurveConstraint Class
Brep.CurveConstraint Overload
Rhino.Geometry Namespace