RhinoCommon API
CommandAliasList.ToDictionary Method
 Constructs a new dictionary that contains: as keys all names and as values all macros.
Modifications to this dictionary do not affect any Rhino command alias.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Dictionary<string, string> ToDictionary()
Public Shared Function ToDictionary As Dictionary(Of String, String)
Return Value
Type: Dictionary<String, String>
The new dictionary.
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace