RhinoCommon API
RenderPlugIn.UiContentTypes Method
 Override this method to provide the UUIDs of all content types that should be presented to the user in the types combo box or the[+] button types menu.The default implementation adds only RDK's built-in types. Rhino automatically adds types in the most efficient way to minimize the list length. If you override this method, you may call the base class first to add the built-in types, a separator will be inserted at the end of the standard list followed by your own types. You may omit the base class call and only chosen types yourself, followed by a separator and your own types. A 'More Types...' item is automatically added when needed by Rhino. Specify a separator by adding uuidUiContentType_Separator.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual List<Guid> UiContentTypes()
Protected Overridable Function UiContentTypes As List(Of Guid)
Return Value
Type: List<Guid>
 Return a Id list of content types to display in content browsers
Remarks
 You should add \e all types you would want to appear in any context, regardless of their content kind. Rhino ensures that only types that make sense will actually be presented to the user in a given context.
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace