RhinoCommon API
Sun.SetPosition Method (DateTime, Double, Double)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.Sun.SetPosition(System.DateTime,System.Double,System.Double)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use SetDateTime() and Latitude / Longitude properties instead")]
public void SetPosition(
	DateTime when,
	double latitudeDegrees,
	double longitudeDegrees
)
<ObsoleteAttribute("Use SetDateTime() and Latitude / Longitude properties instead")>
Public Sub SetPosition (
	when As DateTime,
	latitudeDegrees As Double,
	longitudeDegrees As Double
)
Parameters
when
Type: System.DateTime
[Missing <param name="when"/> documentation for "M:Rhino.Render.Sun.SetPosition(System.DateTime,System.Double,System.Double)"]
latitudeDegrees
Type: System.Double
[Missing <param name="latitudeDegrees"/> documentation for "M:Rhino.Render.Sun.SetPosition(System.DateTime,System.Double,System.Double)"]
longitudeDegrees
Type: System.Double
[Missing <param name="longitudeDegrees"/> documentation for "M:Rhino.Render.Sun.SetPosition(System.DateTime,System.Double,System.Double)"]
See Also
Reference
Sun Class
SetPosition Overload
Rhino.Render Namespace