RhinoCommon API
RenderEnvironment.NewBasicEnvironment Method (SimulatedEnvironment, RhinoDoc)
[Missing <summary> documentation for "M:Rhino.Render.RenderEnvironment.NewBasicEnvironment(Rhino.Render.SimulatedEnvironment,Rhino.RhinoDoc)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public static RenderEnvironment NewBasicEnvironment(
	SimulatedEnvironment environment,
	RhinoDoc doc
)
Public Shared Function NewBasicEnvironment (
	environment As SimulatedEnvironment,
	doc As RhinoDoc
) As RenderEnvironment
Parameters
environment
Type: Rhino.Render.SimulatedEnvironment
[Missing <param name="environment"/> documentation for "M:Rhino.Render.RenderEnvironment.NewBasicEnvironment(Rhino.Render.SimulatedEnvironment,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.RenderEnvironment.NewBasicEnvironment(Rhino.Render.SimulatedEnvironment,Rhino.RhinoDoc)"]
Return Value
Type: RenderEnvironment
[Missing <returns> documentation for "M:Rhino.Render.RenderEnvironment.NewBasicEnvironment(Rhino.Render.SimulatedEnvironment,Rhino.RhinoDoc)"]
See Also
Reference
RenderEnvironment Class
NewBasicEnvironment Overload
Rhino.Render Namespace