RhinoCommon API
Curve.MaxCurvaturePoints Method (Double[])
 Returns a curve's maximum curvature points. The maximum curvature points identify where the curvature starts to decrease in both directions from the points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public Point3d[] MaxCurvaturePoints(
	out double[] curveParameters
)
Public Function MaxCurvaturePoints (
	<OutAttribute> ByRef curveParameters As Double()
) As Point3d()
Parameters
curveParameters
Type: System.Double[]
An array of curve parameters at the maximum curvature points.
Return Value
Type: Point3d[]
An array of points if successful, null if not successful or on error.
See Also
Reference
Curve Class
MaxCurvaturePoints Overload
Rhino.Geometry Namespace