RhinoCommon API
RhinoViewport.DeleteUserString Method
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.DeleteUserString(System.String)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public bool DeleteUserString(
	string key
)
Public Function DeleteUserString (
	key As String
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Display.RhinoViewport.DeleteUserString(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.DeleteUserString(System.String)"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace