RhinoCommon API
NamedParametersEventArgs.TryGetDouble Method
 Try to get a double value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public bool TryGetDouble(
	string name,
	out double value
)
Public Function TryGetDouble (
	name As String,
	<OutAttribute> ByRef value As Double
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetDouble(System.String,System.Double@)"]
value
Type: System.Double
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetDouble(System.String,System.Double@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetDouble(System.String,System.Double@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace