RhinoCommon API
PageViewGroupTable.UndoModify Method (Int32)
 If the page view group has been modified and the modification can be undone, then this will restore the page view group to its previous state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UndoModify(
	int index
)
Public Function UndoModify (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
Zero-based index of page view group.
Return Value
Type: Boolean
>true if successful, false otherwise.
See Also
Reference
PageViewGroupTable Class
UndoModify Overload
Rhino.DocObjects.Tables Namespace