RhinoCommon API
Field Constructor (RenderContent, String)
Initializes a new instance of the Field class
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Field(
	RenderContent renderContent,
	string name
)
Protected Sub New (
	renderContent As RenderContent,
	name As String
)
Parameters
renderContent
Type: Rhino.Render.RenderContent
[Missing <param name="renderContent"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.String)"]
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.String)"]
See Also
Reference
Field Class
Field Overload
Rhino.Render.Fields Namespace