RhinoCommon API
File3dm.Write Method (String, Int32)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Write(
	string path,
	int version
)
Public Function Write (
	path As String,
	version As Integer
) As Boolean
Parameters
path
Type: System.String
The file name to use for writing.
version
Type: System.Int32
 Version of the openNURBS archive to write. Must be [2; current version]. Rhino can read its current version, plus earlier file versions except 1. Use latest version when possible.
Alternatively, 0 is a placeholder for the last valid version.
Return Value
Type: Boolean
 true if archive is written with no error. false if errors occur.
See Also
Reference
File3dm Class
Write Overload
Rhino.FileIO Namespace