RhinoCommon API
RebuildCurveOptions.CalculateInitialPreview Method
 When the rebuild options are presented in a dialog, the initial rebuild calculation is deferred so that the dialog appears immediately instead of after that calculation finishes. The dialog calls this one time, after it is on the screen, and the initial calculation and the first dynamic preview happen then. The dialog must update itself from these options when this returns. The calculation fills in the current output properties and it can increase the point count when kink splitting needs more points than the current settings specify. Calling this when no initial calculation is pending does nothing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void CalculateInitialPreview()
Public Sub CalculateInitialPreview
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace