RhinoCommon API
SubD.Subdivide Method
 Apply the Catmull-Clark subdivision algorithm and save the results in this SubD.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Subdivide()
Public Function Subdivide As Boolean
Return Value
Type: Boolean
true on success
See Also
Reference
SubD Class
Subdivide Overload
Rhino.Geometry Namespace