RhinoCommon API
AngularDimension.Get3dPoints Method
 Get locations of dimension's 3d points
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Get3dPoints(
	out Point3d centerpoint,
	out Point3d defpoint1,
	out Point3d defpoint2,
	out Point3d arrowpoint1,
	out Point3d arrowpoint2,
	out Point3d dimlinepoint,
	out Point3d textpoint
)
Public Function Get3dPoints (
	<OutAttribute> ByRef centerpoint As Point3d,
	<OutAttribute> ByRef defpoint1 As Point3d,
	<OutAttribute> ByRef defpoint2 As Point3d,
	<OutAttribute> ByRef arrowpoint1 As Point3d,
	<OutAttribute> ByRef arrowpoint2 As Point3d,
	<OutAttribute> ByRef dimlinepoint As Point3d,
	<OutAttribute> ByRef textpoint As Point3d
) As Boolean
Parameters
centerpoint
Type: Rhino.Geometry.Point3d
Dimension's center point
defpoint1
Type: Rhino.Geometry.Point3d
First definition point
defpoint2
Type: Rhino.Geometry.Point3d
Second definition point
arrowpoint1
Type: Rhino.Geometry.Point3d
First arrow point
arrowpoint2
Type: Rhino.Geometry.Point3d
Second arrow point
dimlinepoint
Type: Rhino.Geometry.Point3d
Point on dimension line
textpoint
Type: Rhino.Geometry.Point3d
Text location point
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AngularDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)"]
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace