RhinoCommon API
Utilities.ExpandEnvVarsInFileName Method
[Missing <summary> documentation for "M:Rhino.Render.Utilities.ExpandEnvVarsInFileName(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static string ExpandEnvVarsInFileName(
	string filename
)
Public Shared Function ExpandEnvVarsInFileName (
	filename As String
) As String
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.Render.Utilities.ExpandEnvVarsInFileName(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.Utilities.ExpandEnvVarsInFileName(System.String)"]
See Also
Reference
Utilities Class
Rhino.Render Namespace