RhinoCommon API
PersistentSettings.GetDouble Method (String, Double)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetDouble(System.String,System.Double)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double GetDouble(
	string key,
	double defaultValue
)
Public Function GetDouble (
	key As String,
	defaultValue As Double
) As Double
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetDouble(System.String,System.Double)"]
defaultValue
Type: System.Double
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetDouble(System.String,System.Double)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetDouble(System.String,System.Double)"]
See Also
Reference
PersistentSettings Class
GetDouble Overload
Rhino Namespace