RhinoCommon API
MeshFaceList.MergeAdjacentFaces Method
 Merges two triangular mesh faces that share an edge into one quadrangular face.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public bool MergeAdjacentFaces(
	int edgeIndex
)
Public Function MergeAdjacentFaces (
	edgeIndex As Integer
) As Boolean
Parameters
edgeIndex
Type: System.Int32
The common topological edge index.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace