RhinoCommon API
Hatch.SetGradientFill Method
[Missing <summary> documentation for "M:Rhino.Geometry.Hatch.SetGradientFill(Rhino.Display.ColorGradient)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SetGradientFill(
	ColorGradient fill
)
Public Sub SetGradientFill (
	fill As ColorGradient
)
Parameters
fill
Type: Rhino.Display.ColorGradient
[Missing <param name="fill"/> documentation for "M:Rhino.Geometry.Hatch.SetGradientFill(Rhino.Display.ColorGradient)"]
See Also
Reference
Hatch Class
Rhino.Geometry Namespace