RhinoCommon API
Surface.CreateTweenSurfacesWithSampling Method
 Create tween surfaces that gradually transition between two bounding surfaces using point sampling.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public static Surface[] CreateTweenSurfacesWithSampling(
	Surface surface0,
	Surface surface1,
	int numSurfaces,
	int numSamples,
	double tolerance
)
Public Shared Function CreateTweenSurfacesWithSampling (
	surface0 As Surface,
	surface1 As Surface,
	numSurfaces As Integer,
	numSamples As Integer,
	tolerance As Double
) As Surface()
Parameters
surface0
Type: Rhino.Geometry.Surface
The first, or starting, surface.
surface1
Type: Rhino.Geometry.Surface
The second, or ending, curve.
numSurfaces
Type: System.Int32
Number of tween surfaces to create.
numSamples
Type: System.Int32
Number of sample points along input surfaces.
tolerance
Type: System.Double
The tolerance. When in doubt, use the document's model absolute tolerance.
Return Value
Type: Surface[]
>An array of tween surfaces if successful, an empty array on error.
See Also
Reference
Surface Class
Rhino.Geometry Namespace