RhinoCommon API
ModelComponent.ModelComponentTypeIncludesParent Method
 Informs the developer if a particular model component type will include the hash of the parent.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool ModelComponentTypeIncludesParent(
	ModelComponentType type
)
Public Shared Function ModelComponentTypeIncludesParent (
	type As ModelComponentType
) As Boolean
Parameters
type
Type: Rhino.DocObjects.ModelComponentType
True if the component includes parent hash.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ModelComponent.ModelComponentTypeIncludesParent(Rhino.DocObjects.ModelComponentType)"]
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace