RhinoCommon API
SectionStyleTable.GetUnusedSectionStyleName Method
 Gets unused section style name used as default when creating new section styles.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string GetUnusedSectionStyleName()
Public Function GetUnusedSectionStyleName As String
Return Value
Type: String
The unused name.
See Also
Reference
SectionStyleTable Class
Rhino.DocObjects.Tables Namespace