RhinoCommon API
WorksessionFileModel Constructor (String)
Creates a reference model for a model file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFileModel(
	string fullPath
)
Public Sub New (
	fullPath As String
)
Parameters
fullPath
Type: System.String
Full path of the model file.
See Also
Reference
WorksessionFileModel Class
WorksessionFileModel Overload
Rhino.FileIO Namespace