RhinoCommon API
Decals.Clear Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.Decals.Clear"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
[ObsoleteAttribute("Use RemoveAllDecals")]
public void Clear()
<ObsoleteAttribute("Use RemoveAllDecals")>
Public Sub Clear
See Also
Reference
Decals Class
Rhino.Render Namespace