RhinoCommon API
Intersection.BrepPlane Method (Brep, Plane, Double, Boolean, Curve[], Point3d[])
 Intersects a Brep with an (infinite) plane.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.27
Syntax
public static bool BrepPlane(
	Brep brep,
	Plane plane,
	double tolerance,
	bool joinCurves,
	out Curve[] intersectionCurves,
	out Point3d[] intersectionPoints
)
Public Shared Function BrepPlane (
	brep As Brep,
	plane As Plane,
	tolerance As Double,
	joinCurves As Boolean,
	<OutAttribute> ByRef intersectionCurves As Curve(),
	<OutAttribute> ByRef intersectionPoints As Point3d()
) As Boolean
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to intersect.
plane
Type: Rhino.Geometry.Plane
Plane to intersect with.
tolerance
Type: System.Double
Tolerance to use for intersections.
joinCurves
Type: System.Boolean
If true, join the resulting curves where possible.
intersectionCurves
Type: Rhino.Geometry.Curve[]
The intersection curves will be returned here.
intersectionPoints
Type: Rhino.Geometry.Point3d[]
The intersection points will be returned here.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Intersection Class
BrepPlane Overload
Rhino.Geometry.Intersect Namespace