RhinoCommon API
NurbsSurfacePointList.ValidateSpacing Method
 Simple check of distance between adjacent control points
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ValidateSpacing(
	double closeTolerance,
	double stackTolerance,
	out IndexPair[] closeIndices,
	out IndexPair[] stackedIndices
)
Public Function ValidateSpacing (
	closeTolerance As Double,
	stackTolerance As Double,
	<OutAttribute> ByRef closeIndices As IndexPair(),
	<OutAttribute> ByRef stackedIndices As IndexPair()
) As Boolean
Parameters
closeTolerance
Type: System.Double
[Missing <param name="closeTolerance"/> documentation for "M:Rhino.Geometry.Collections.NurbsSurfacePointList.ValidateSpacing(System.Double,System.Double,Rhino.IndexPair[]@,Rhino.IndexPair[]@)"]
stackTolerance
Type: System.Double
[Missing <param name="stackTolerance"/> documentation for "M:Rhino.Geometry.Collections.NurbsSurfacePointList.ValidateSpacing(System.Double,System.Double,Rhino.IndexPair[]@,Rhino.IndexPair[]@)"]
closeIndices
Type: Rhino.IndexPair[]
[Missing <param name="closeIndices"/> documentation for "M:Rhino.Geometry.Collections.NurbsSurfacePointList.ValidateSpacing(System.Double,System.Double,Rhino.IndexPair[]@,Rhino.IndexPair[]@)"]
stackedIndices
Type: Rhino.IndexPair[]
[Missing <param name="stackedIndices"/> documentation for "M:Rhino.Geometry.Collections.NurbsSurfacePointList.ValidateSpacing(System.Double,System.Double,Rhino.IndexPair[]@,Rhino.IndexPair[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.NurbsSurfacePointList.ValidateSpacing(System.Double,System.Double,Rhino.IndexPair[]@,Rhino.IndexPair[]@)"]
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace