RhinoCommon API
GripObject.GetSurfaceCVIndices Method
 Retrieves the NURBS surface control point indices of this GripObject from the surface it is associated with.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public int GetSurfaceCVIndices(
	out Tuple<int, int>[] cvIndices
)
Public Function GetSurfaceCVIndices (
	<OutAttribute> ByRef cvIndices As Tuple(Of Integer, Integer)()
) As Integer
Parameters
cvIndices
Type: System.Tuple<Int32, Int32>[]
The NURBS surface control point indices as tuples.
Return Value
Type: Int32
 The number of NURBS surface control points managed by this grip. If the grip is not a surface control point, zero is returned.
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace