RhinoCommon API
Point3d.Multiply Method (Point3d, Double)
 Multiplies a Point3d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Point3d Multiply(
	Point3d point,
	double t
)
Public Shared Function Multiply (
	point As Point3d,
	t As Double
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
t
Type: System.Double
A number.
Return Value
Type: Point3d
A new point that is coordinate-wise multiplied by t.
See Also
Reference
Point3d Structure
Multiply Overload
Rhino.Geometry Namespace