RhinoCommon API
InstanceObject.Explode Method (Boolean, Guid, Boolean, RhinoObject[], ObjectAttributes[], Transform[])
 Explodes the instance reference into pieces.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public void Explode(
	bool skipHiddenPieces,
	Guid viewportId,
	bool explodeNestedInstances,
	out RhinoObject[] pieces,
	out ObjectAttributes[] pieceAttributes,
	out Transform[] pieceTransforms
)
Public Sub Explode (
	skipHiddenPieces As Boolean,
	viewportId As Guid,
	explodeNestedInstances As Boolean,
	<OutAttribute> ByRef pieces As RhinoObject(),
	<OutAttribute> ByRef pieceAttributes As ObjectAttributes(),
	<OutAttribute> ByRef pieceTransforms As Transform()
)
Parameters
skipHiddenPieces
Type: System.Boolean
 If true, pieces that are not visible will not be appended to the pieces out parameter.
viewportId
Type: System.Guid
 If skipHiddenPieces is false, then viewportId is ignored. If bSkipHiddenPieces is true and viewportId is not Guid.Empty, then layer and object per viewport visibility settings are used. If bSkipHiddenPieces is true and viewport_id is Guid.Empty, then layer and object global visibility settings are used.
explodeNestedInstances
Type: System.Boolean
 If true, then nested instance references are recursively exploded into pieces until actual geometry is found. If false, an InstanceObject is added to the pieces out parameter when this InstanceObject has nested references.
pieces
Type: Rhino.DocObjects.RhinoObject[]
An array of Rhino objects will be assigned to this out parameter during this call.
pieceAttributes
Type: Rhino.DocObjects.ObjectAttributes[]
An array of object attributes will be assigned to this out parameter during this call.
pieceTransforms
Type: Rhino.Geometry.Transform[]
An array of the previously applied transform matrices will be assigned to this out parameter during this call.
See Also
Reference
InstanceObject Class
Explode Overload
Rhino.DocObjects Namespace