RhinoCommon API
File3dmRenderTexture.ToTexture Method
 Get a simulated texture that approximates this texture's appearance.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Texture ToTexture()
Public Function ToTexture As Texture
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderTexture.ToTexture"]
See Also
Reference
File3dmRenderTexture Class
Rhino.FileIO Namespace