RhinoCommon API
FileCsvDocument.TryGetInt Method (Int32, Int32, Int32)
 Retrieves the value of a cell as a 32-bit integer, parsed using the invariant culture.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetInt(
	int column,
	int row,
	out int value
)
Public Function TryGetInt (
	column As Integer,
	row As Integer,
	<OutAttribute> ByRef value As Integer
) As Boolean
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.Int32
The parsed value, or 0 if the cell does not exist or cannot be parsed.
Return Value
Type: Boolean
true if the cell exists and was parsed; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetInt Overload
Rhino.FileIO Namespace