RhinoCommon API
SubDFace.ClearSavedSubdivisionPoints Method
 Discards the cached subdivision and surface points for this face, so they are recomputed on next use.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public void ClearSavedSubdivisionPoints(
	bool clearNeighborhood
)
Public Sub ClearSavedSubdivisionPoints (
	clearNeighborhood As Boolean
)
Parameters
clearNeighborhood
Type: System.Boolean
 If true, the cached points of the neighboring components are discarded too. Moving a control net point changes the surface around it, not just at it, so pass true after an edit unless you know only this face is affected.
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace