RhinoCommon API
SupportOptions.SetShowDetailsPanel Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetShowDetailsPanel(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void SetShowDetailsPanel(
	bool b
)
Public Shared Sub SetShowDetailsPanel (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetShowDetailsPanel(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace