RhinoCommon API
Mesh.CreateFromCurvePipe Method
 Constructs a new mesh pipe from a curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Mesh CreateFromCurvePipe(
	Curve curve,
	double radius,
	int segments,
	int accuracy,
	MeshPipeCapStyle capType,
	bool faceted,
	IEnumerable<Interval> intervals = null
)
Public Shared Function CreateFromCurvePipe (
	curve As Curve,
	radius As Double,
	segments As Integer,
	accuracy As Integer,
	capType As MeshPipeCapStyle,
	faceted As Boolean,
	Optional intervals As IEnumerable(Of Interval) = Nothing
) As Mesh
Parameters
curve
Type: Rhino.Geometry.Curve
A curve to pipe.
radius
Type: System.Double
The radius of the pipe, a measure from the curve to the surface of the mesh pipe.
segments
Type: System.Int32
The number of mesh faces that surround the curve. For example with three segments, the cross-section of the pipe looks like an equilateral triangle. The more segments there are, the rounder the pipe is.
accuracy
Type: System.Int32
The accuracy of the pipe. Changes the visual fidelity of the pipe along the curve. Higher value means that the center of the pipe is closer to the curve. By increasing the accuracy, the mesh will get more faces along the curve.
capType
Type: Rhino.Geometry.MeshPipeCapStyle
The type of cap to be created at the end of the pipe.
faceted
Type: System.Boolean
Specifies whether the pipe is faceted, or not. This setting only affects the normals of the pipe mesh.
intervals (Optional)
Type: System.Collections.Generic.IEnumerable<Interval>
A series of intervals to pipe, or null to pipe the entire curve.
Return Value
Type: Mesh
A new mesh if successful, or null on failure.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace