RhinoCommon API
FieldDictionary.AddTextured Method (String, Point4d, String)
 Add a new Point4dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public Point4dField AddTextured(
	string key,
	Point4d value,
	string prompt
)
Public Function AddTextured (
	key As String,
	value As Point4d,
	prompt As String
) As Point4dField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: Rhino.Geometry.Point4d
Initial value for this field.
prompt
Type: System.String
 Prompt to display in the user interface (Content Browsers) if this is null or an empty string the this field is a data only field and will not appear in the user interface.
Return Value
Type: Point4dField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Geometry.Point4d,System.String)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
AddTextured Overload
Rhino.Render.Fields Namespace