RhinoCommon API
LicenseData.IsValid Method (LicenseData)
 Indicates whether a LicenseData object is not null and valid.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool IsValid(
	LicenseData data
)
Public Shared Function IsValid (
	data As LicenseData
) As Boolean
Parameters
data
Type: Rhino.PlugIns.LicenseData
[Missing <param name="data"/> documentation for "M:Rhino.PlugIns.LicenseData.IsValid(Rhino.PlugIns.LicenseData)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseData.IsValid(Rhino.PlugIns.LicenseData)"]
See Also
Reference
LicenseData Class
IsValid Overload
Rhino.PlugIns Namespace