RhinoCommon API
ColorRGBA Constructor (ColorRGBA, Double)
Initializes a new instance of the ColorRGBA class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public ColorRGBA(
	ColorRGBA color,
	double alpha
)
Public Sub New (
	color As ColorRGBA,
	alpha As Double
)
Parameters
color
Type: Rhino.Display.ColorRGBA
[Missing <param name="color"/> documentation for "M:Rhino.Display.ColorRGBA.#ctor(Rhino.Display.ColorRGBA,System.Double)"]
alpha
Type: System.Double
[Missing <param name="alpha"/> documentation for "M:Rhino.Display.ColorRGBA.#ctor(Rhino.Display.ColorRGBA,System.Double)"]
See Also
Reference
ColorRGBA Structure
ColorRGBA Overload
Rhino.Display Namespace