RhinoCommon API
PersistentSettings.FromPlugInId Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.FromPlugInId(System.Guid)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static PersistentSettings FromPlugInId(
	Guid pluginId
)
Public Shared Function FromPlugInId (
	pluginId As Guid
) As PersistentSettings
Parameters
pluginId
Type: System.Guid
[Missing <param name="pluginId"/> documentation for "M:Rhino.PersistentSettings.FromPlugInId(System.Guid)"]
Return Value
Type: PersistentSettings
[Missing <returns> documentation for "M:Rhino.PersistentSettings.FromPlugInId(System.Guid)"]
See Also
Reference
PersistentSettings Class
Rhino Namespace