RhinoCommon API
ObjectTable.Replace Method (ObjRef, TextDot)
Replaces one object with new text dot object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Replace(
	ObjRef objref,
	TextDot dot
)
Public Function Replace (
	objref As ObjRef,
	dot As TextDot
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
dot
Type: Rhino.Geometry.TextDot
new text dot to be added. The text dot is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace