RhinoCommon API
BoundingBox.Contains Method (BoundingBox, Boolean)
 Determines whether this bounding box contains another bounding box.
The user can choose how to treat bounding boxes with coincident surfaces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Contains(
	BoundingBox box,
	bool strict
)
Public Function Contains (
	box As BoundingBox,
	strict As Boolean
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to test.
strict
Type: System.Boolean
If true, the box needs to be fully on the inside of the bounding box. I.e. coincident boxes will be considered 'outside'.
Return Value
Type: Boolean
true if the box is (strictly) on the inside of this BoundingBox.
See Also
Reference
BoundingBox Structure
Contains Overload
Rhino.Geometry Namespace