RhinoCommon API
BrepFaceList.ShrinkFaces Method
 Shrinks all the underlying surfaces in this Brep. Sometimes the surfaces extend far beyond the trimming boundaries of the Brep Face. This function will remove those portions of the surfaces that are not used.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ShrinkFaces()
Public Function ShrinkFaces As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace