RhinoCommon API
SupportOptions.DarkPreviewCheckerColor Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.DarkPreviewCheckerColor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static int DarkPreviewCheckerColor()
Public Shared Function DarkPreviewCheckerColor As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.DarkPreviewCheckerColor"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace