RhinoCommon API
RenderPrimitiveList.TryGetSphere Method
 Call this method to get a box at the specified index.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool TryGetSphere(
	int index,
	out Sphere sphere
)
Public Function TryGetSphere (
	index As Integer,
	<OutAttribute> ByRef sphere As Sphere
) As Boolean
Parameters
index
Type: System.Int32
 The zero based index of the item in the list. Valid values are greater than or equal to 0 and less than Count.
sphere
Type: Rhino.Geometry.Sphere
 Will contain the sphere at the requested index if the index is in range and the primitive at the requested index is a box.
Return Value
Type: Boolean
 Return true if the index is in range and the primitive at the requested index is a box otherwise returns false.
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace