RhinoCommon API
ControlPoint Constructor (Double, Double, Double, Double)
 Constructs a new homogeneous control point, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ControlPoint(
	double x,
	double y,
	double z,
	double weight
)
Public Sub New (
	x As Double,
	y As Double,
	z As Double,
	weight As Double
)
Parameters
x
Type: System.Double
X coordinate of the control point.
y
Type: System.Double
Y coordinate of the control point.
z
Type: System.Double
Z coordinate of the control point.
weight
Type: System.Double
Weight factor of the control point. You should not use weights less than or equal to zero.
Remarks
 For expert use only. If you do not understand homogeneous coordinates, then use an override that accepts world 3-D, or Euclidean, coordinates as input.
See Also
Reference
ControlPoint Structure
ControlPoint Overload
Rhino.Geometry Namespace