RhinoCommon API
NodeInCodeTable.TryInvokeMember Method
 Dynamically invokes a member of the table.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override bool TryInvokeMember(
	InvokeMemberBinder binder,
	Object[] args,
	out Object result
)
Public Overrides Function TryInvokeMember (
	binder As InvokeMemberBinder,
	args As Object(),
	<OutAttribute> ByRef result As Object
) As Boolean
Parameters
binder
Type: System.Dynamic.InvokeMemberBinder
The binder.
args
Type: System.Object[]
The arguments.
result
Type: System.Object
The result.
Return Value
Type: Boolean
True on success.
See Also
Reference
NodeInCodeTable Class
Rhino.NodeInCode Namespace