RhinoCommon API
DisplayPipeline.SetupDisplayMaterial Method (RhinoDoc, RhinoObject, ObjectAttributes)
 Sets up a display material.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public DisplayMaterial SetupDisplayMaterial(
	RhinoDoc doc,
	RhinoObject rhinoObject,
	ObjectAttributes attributes
)
Public Function SetupDisplayMaterial (
	doc As RhinoDoc,
	rhinoObject As RhinoObject,
	attributes As ObjectAttributes
) As DisplayMaterial
Parameters
doc
Type: Rhino.RhinoDoc
The active document.
rhinoObject
Type: Rhino.DocObjects.RhinoObject
The Rhino object.
attributes
Type: Rhino.DocObjects.ObjectAttributes
The object attributes.
Return Value
Type: DisplayMaterial
A display material if successful, null otherwise.
See Also
Reference
DisplayPipeline Class
SetupDisplayMaterial Overload
Rhino.Display Namespace