RhinoCommon API
NurbsSurface.CreateCurveOnSurface Method
 Fit a sequence of 2d points on a surface to make a curve on the surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static NurbsCurve CreateCurveOnSurface(
	Surface surface,
	IEnumerable<Point2d> points,
	double tolerance,
	bool periodic
)
Public Shared Function CreateCurveOnSurface (
	surface As Surface,
	points As IEnumerable(Of Point2d),
	tolerance As Double,
	periodic As Boolean
) As NurbsCurve
Parameters
surface
Type: Rhino.Geometry.Surface
Surface on which to construct curve.
points
Type: System.Collections.Generic.IEnumerable<Point2d>
Parameter space coordinates of the points to interpolate.
tolerance
Type: System.Double
Curve should be within tolerance of surface and points.
periodic
Type: System.Boolean
When true make a periodic curve.
Return Value
Type: NurbsCurve
A curve interpolating the points if successful, null on error.
Remarks
 To produce the input points, use Surface.CreateCurveOnSurfacePoints.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace