RhinoCommon API
Font Constructor (String)
Initializes a new instance of the Font class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Font(
	string familyName
)
Public Sub New (
	familyName As String
)
Parameters
familyName
Type: System.String
[Missing <param name="familyName"/> documentation for "M:Rhino.DocObjects.Font.#ctor(System.String)"]
See Also
Reference
Font Class
Font Overload
Rhino.DocObjects Namespace