RhinoCommon API
TextureGraphInfo.SetActiveChannel Method
[Missing <summary> documentation for "M:Rhino.Render.TextureGraphInfo.SetActiveChannel(Rhino.Render.TextureGraphInfo.Channel)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public void SetActiveChannel(
	TextureGraphInfo.Channel channel
)
Public Sub SetActiveChannel (
	channel As TextureGraphInfo.Channel
)
Parameters
channel
Type: Rhino.Render.TextureGraphInfo.Channel
[Missing <param name="channel"/> documentation for "M:Rhino.Render.TextureGraphInfo.SetActiveChannel(Rhino.Render.TextureGraphInfo.Channel)"]
See Also
Reference
TextureGraphInfo Class
Rhino.Render Namespace