RhinoCommon API
CustomDisplay.AddArc Method (Arc, Color)
 Adds a new, colored arc to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void AddArc(
	Arc arc,
	Color color
)
Public Sub AddArc (
	arc As Arc,
	color As Color
)
Parameters
arc
Type: Rhino.Geometry.Arc
Arc to add.
color
Type: System.Drawing.Color
Color of arc.
See Also
Reference
CustomDisplay Class
AddArc Overload
Rhino.Display Namespace