RhinoCommon API
Interval.Reverse Method
 Changes interval to [-T1, -T0].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Reverse()
Public Sub Reverse
See Also
Reference
Interval Structure
Rhino.Geometry Namespace