RhinoCommon API
ArchivableDictionary.SetEnumValue<T> Method (String, T)
 Set an enum value in the dictionary with a custom key.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public bool SetEnumValue<T>(
	string key,
	T enumValue
)
where T : struct, new(), IConvertible
Public Function SetEnumValue(Of T As {Structure, New, IConvertible}) (
	key As String,
	enumValue As T
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.SetEnumValue``1(System.String,``0)"]
enumValue
Type: T
[Missing <param name="enumValue"/> documentation for "M:Rhino.Collections.ArchivableDictionary.SetEnumValue``1(System.String,``0)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.Collections.ArchivableDictionary.SetEnumValue``1(System.String,``0)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.SetEnumValue``1(System.String,``0)"]
See Also
Reference
ArchivableDictionary Class
SetEnumValue Overload
Rhino.Collections Namespace