RhinoCommon API
ObjRef.Edge Method
 Gets the edge if this reference geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BrepEdge Edge()
Public Function Edge As BrepEdge
Return Value
Type: BrepEdge
A boundary representation edge; or null on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace