RhinoCommon API
IPanelsService.CreateDockBar Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.CreateDockBar(System.Object)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
bool CreateDockBar(
	Object options
)
Function CreateDockBar (
	options As Object
) As Boolean
Parameters
options
Type: System.Object
[Missing <param name="options"/> documentation for "M:Rhino.UI.IPanelsService.CreateDockBar(System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.CreateDockBar(System.Object)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace