RhinoCommon API
LightManagerSupport.DeleteLight Method
 Delete light
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool DeleteLight(
	RhinoDoc doc,
	Light light,
	bool bUndelete
)
Public MustOverride Function DeleteLight (
	doc As RhinoDoc,
	light As Light,
	bUndelete As Boolean
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.LightManagerSupport.DeleteLight(Rhino.RhinoDoc,Rhino.Geometry.Light,System.Boolean)"]
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.LightManagerSupport.DeleteLight(Rhino.RhinoDoc,Rhino.Geometry.Light,System.Boolean)"]
bUndelete
Type: System.Boolean
[Missing <param name="bUndelete"/> documentation for "M:Rhino.Render.LightManagerSupport.DeleteLight(Rhino.RhinoDoc,Rhino.Geometry.Light,System.Boolean)"]
Return Value
Type: Boolean
If delete is successful, then return true, else return false
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace