RhinoCommon API
FileTypeList.AddFileType Method (String, String, String)
[Missing <summary> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String,System.String)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int AddFileType(
	string description,
	string extension1,
	string extension2
)
Public Function AddFileType (
	description As String,
	extension1 As String,
	extension2 As String
) As Integer
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String,System.String)"]
extension1
Type: System.String
[Missing <param name="extension1"/> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String,System.String)"]
extension2
Type: System.String
[Missing <param name="extension2"/> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String,System.String)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String,System.String)"]
See Also
Reference
FileTypeList Class
AddFileType Overload
Rhino.PlugIns Namespace