RhinoCommon API
GrasshopperDisplayMaterial Constructor
 Constructs a default material with an opaque white diffuse colour.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public GrasshopperDisplayMaterial()
Public Sub New
See Also
Reference
GrasshopperDisplayMaterial Class
GrasshopperDisplayMaterial Overload
Rhino.Display Namespace