RhinoCommon API
RhinoView.CaptureToBitmap Method
 Capture View contents to a bitmap.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Bitmap CaptureToBitmap()
Public Function CaptureToBitmap As Bitmap
Return Value
Type: Bitmap
The bitmap of the complete view.
See Also
Reference
RhinoView Class
CaptureToBitmap Overload
Rhino.Display Namespace