RhinoCommon API
FreeFloatingBase.CopyFrom Method
 Copy from another object
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract void CopyFrom(
	FreeFloatingBase src
)
Public MustOverride Sub CopyFrom (
	src As FreeFloatingBase
)
Parameters
src
Type: Rhino.Render.FreeFloatingBase
[Missing <param name="src"/> documentation for "M:Rhino.Render.FreeFloatingBase.CopyFrom(Rhino.Render.FreeFloatingBase)"]
See Also
Reference
FreeFloatingBase Class
Rhino.Render Namespace