RhinoCommon API
ArcCurve Constructor (Circle)
 Initializes a new ArcCurve instance, copying the shape of a Circle.
Parameterization will be [0;circle.Circumference]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ArcCurve(
	Circle circle
)
Public Sub New (
	circle As Circle
)
Parameters
circle
Type: Rhino.Geometry.Circle
The original circle.
See Also
Reference
ArcCurve Class
ArcCurve Overload
Rhino.Geometry Namespace