RhinoCommon API
ArchivableDictionary.GetVector3d Method (String)
 Get value as Vector3d, will only succeed if value was created using Set(string key, Vector3d value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d GetVector3d(
	string key
)
Public Function GetVector3d (
	key As String
) As Vector3d
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetVector3d(System.String)"]
Return Value
Type: Vector3d
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetVector3d(System.String)"]
See Also
Reference
ArchivableDictionary Class
GetVector3d Overload
Rhino.Collections Namespace