RhinoCommon API
SubDEdgeSharpness.ToString Method
 Returns a string that represents this sharpness as a percentage.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgeSharpness.ToString"]
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace