RhinoCommon API
UserInterfaceCheckBox Constructor (String)
Initializes a new instance of the UserInterfaceCheckBox class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceCheckBox(
	string text
)
Public Sub New (
	text As String
)
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.UI.UserInterfaceCheckBox.#ctor(System.String)"]
See Also
Reference
UserInterfaceCheckBox Class
UserInterfaceCheckBox Overload
Rhino.UI Namespace