RhinoCommon API
Linetype.SetTaper Method (Double, Point2d, Double)
 Set taper for this linetype width a single internal taper point
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetTaper(
	double startWidth,
	Point2d taperPoint,
	double endWidth
)
Public Sub SetTaper (
	startWidth As Double,
	taperPoint As Point2d,
	endWidth As Double
)
Parameters
startWidth
Type: System.Double
[Missing <param name="startWidth"/> documentation for "M:Rhino.DocObjects.Linetype.SetTaper(System.Double,Rhino.Geometry.Point2d,System.Double)"]
taperPoint
Type: Rhino.Geometry.Point2d
[Missing <param name="taperPoint"/> documentation for "M:Rhino.DocObjects.Linetype.SetTaper(System.Double,Rhino.Geometry.Point2d,System.Double)"]
endWidth
Type: System.Double
[Missing <param name="endWidth"/> documentation for "M:Rhino.DocObjects.Linetype.SetTaper(System.Double,Rhino.Geometry.Point2d,System.Double)"]
See Also
Reference
Linetype Class
SetTaper Overload
Rhino.DocObjects Namespace