RhinoCommon API
FileSettings.GetDataFolder Method
 Gets the data folder for machine or current user.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string GetDataFolder(
	bool currentUser
)
Public Shared Function GetDataFolder (
	currentUser As Boolean
) As String
Parameters
currentUser
Type: System.Boolean
true if the query relates to the current user.
Return Value
Type: String
A directory to user or machine data.
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace