RhinoCommon API
Mesh.CreateFromSurfaceControlNet Method
 Calculate a mesh representation of a surface's control net.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static Mesh CreateFromSurfaceControlNet(
	Surface surface
)
Public Shared Function CreateFromSurfaceControlNet (
	surface As Surface
) As Mesh
Parameters
surface
Type: Rhino.Geometry.Surface
The surface.
Return Value
Type: Mesh
Mesh representing the surface control net on success, null on failure
See Also
Reference
Mesh Class
Rhino.Geometry Namespace