RhinoCommon API
NamedViewTable.Restore Method (Int32, RhinoViewport)
 Sets the MainViewport of a standard RhinoView to a named views settings
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Restore(
	int index,
	RhinoViewport viewport
)
Public Function Restore (
	index As Integer,
	viewport As RhinoViewport
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoViewport)"]
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoViewport)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoViewport)"]
See Also
Reference
NamedViewTable Class
Restore Overload
Rhino.DocObjects.Tables Namespace