RhinoCommon API
AppearanceSettings.SetWidgetColor Method (WidgetColor, Color, Boolean)
 Sets the logical widget color association to a specific .Net library color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void SetWidgetColor(
	WidgetColor whichColor,
	Color c,
	bool forceUiUpdate
)
Public Shared Sub SetWidgetColor (
	whichColor As WidgetColor,
	c As Color,
	forceUiUpdate As Boolean
)
Parameters
whichColor
Type: Rhino.ApplicationSettings.WidgetColor
A logical color association.
c
Type: System.Drawing.Color
A .Net library color.
forceUiUpdate
Type: System.Boolean
true if the UI should be forced to update.
See Also
Reference
AppearanceSettings Class
SetWidgetColor Overload
Rhino.ApplicationSettings Namespace