RhinoCommon API
PreviewRenderedEventArgs Constructor
Initializes a new instance of the PreviewRenderedEventArgs class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PreviewRenderedEventArgs()
Public Sub New
See Also
Reference
PreviewRenderedEventArgs Class
Rhino.Render Namespace