RhinoCommon API
FileCsvDocument.GetRow Method
 Returns the fields of a row.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string[] GetRow(
	int row
)
Public Function GetRow (
	row As Integer
) As String()
Parameters
row
Type: System.Int32
The zero-based row index.
Return Value
Type: String[]
The fields of the row.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when row is out of range.
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace