RhinoCommon API
TextureMapping.Evaluate Method (Point3d, Vector3d, Point3d, Transform, Transform)
 Evaluate the mapping to get a texture coordinate
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.17
Syntax
public int Evaluate(
	Point3d p,
	Vector3d n,
	out Point3d t,
	Transform pXform,
	Transform nXform
)
Public Function Evaluate (
	p As Point3d,
	n As Vector3d,
	<OutAttribute> ByRef t As Point3d,
	pXform As Transform,
	nXform As Transform
) As Integer
Parameters
p
Type: Rhino.Geometry.Point3d
Vertex location
n
Type: Rhino.Geometry.Vector3d
If the mapping projection is ray_projection, then this is the vertex unit normal. Otherwise n is ignored.
t
Type: Rhino.Geometry.Point3d
Texture coordinate (u,v,w)
pXform
Type: Rhino.Geometry.Transform
 Transformation to be applied to P before performing the mapping calculation.
nXform
Type: Rhino.Geometry.Transform
 Transformation to be applied to N before performing the mapping calculation. One way to calculate nXxform is to use the call pXform::GetVectorTransform(nXform).
Return Value
Type: Int32
 Nonzero if evaluation is successful. When the mapping is a box or capped cylinder mapping, the value indicates which side was evaluated. Cylinder mapping: 1 = cylinder wall, 2 = bottom cap, 3 = top cap Box mapping: 1 = front, 2 = right, 3 = back, 4 = left, 5 = bottom, 6 = top
See Also
Reference
TextureMapping Class
Evaluate Overload
Rhino.Render Namespace