RhinoCommon API
RenderPipeline.OnRenderBegin Method
 Called by the framework when it is time to start rendering, the render window will be created at this point and it is safe to start
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract bool OnRenderBegin()
Protected MustOverride Function OnRenderBegin As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.OnRenderBegin"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace