RhinoCommon API
InstanceDefinition.Equals Method
 Equality is checked against InstanceDefinition.Id
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
Return Value
Type: Boolean
True if obj.Id equals Id
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace