RhinoCommon API
SimpleArrayBrepPointer.ToNonConstArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep[] ToNonConstArray()
Public Function ToNonConstArray As Brep()
Return Value
Type: Brep[]
The managed array.
See Also
Reference
SimpleArrayBrepPointer Class
Rhino.Runtime.InteropWrappers Namespace