RhinoCommon API
SimpleArrayPoint3d Constructor (IEnumerable<Point3d>)
 Initializes a new SimpleArrayPoint3d instance from a set of points
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public SimpleArrayPoint3d(
	IEnumerable<Point3d> pts
)
Public Sub New (
	pts As IEnumerable(Of Point3d)
)
Parameters
pts
Type: System.Collections.Generic.IEnumerable<Point3d>
See Also
Reference
SimpleArrayPoint3d Class
SimpleArrayPoint3d Overload
Rhino.Runtime.InteropWrappers Namespace