RhinoCommon API
Material.CommitChanges Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.CommitChanges"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool CommitChanges()
Public Function CommitChanges As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.CommitChanges"]
See Also
Reference
Material Class
Rhino.DocObjects Namespace