RhinoCommon API
GroupTable.Delete Method (Group)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.GroupTable.Delete(Rhino.DocObjects.Group)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override bool Delete(
	Group item
)
Public Overrides Function Delete (
	item As Group
) As Boolean
Parameters
item
Type: Rhino.DocObjects.Group
[Missing <param name="item"/> documentation for "M:Rhino.DocObjects.Tables.GroupTable.Delete(Rhino.DocObjects.Group)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.GroupTable.Delete(Rhino.DocObjects.Group)"]
See Also
Reference
GroupTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace