RhinoCommon API
Box.Contains Method (Point3d, Boolean)
 Determines whether a point is (strictly, if strict is true) inside this Box. Invalid boxes contain nothing. Invalid points are never contained.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Contains(
	Point3d point,
	bool strict
)
Public Function Contains (
	point As Point3d,
	strict As Boolean
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
Point to test.
strict
Type: System.Boolean
If true, the point needs to be strictly inside this Box. I.e. points on the boundary of this Box will be considered 'outside'.
Return Value
Type: Boolean
true if the point is (strictly, if strict is true) inside this Box. false if this Box or the Point are invalid.
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace