RhinoCommon API
Curve.Trim Method (Double, Double)
 Removes portions of the curve outside the specified interval.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Curve Trim(
	double t0,
	double t1
)
Public Function Trim (
	t0 As Double,
	t1 As Double
) As Curve
Parameters
t0
Type: System.Double
Start of the trimming interval.
t1
Type: System.Double
End of the trimming interval.
Return Value
Type: Curve
Trimmed portion of this curve is successful, null on failure.
Remarks
 If curve is open, then trimming interval must be an increasing interval. If curve is closed, and trimming interval is a decreasing interval, then the portion of the curve across the start/end is returned.
See Also
Reference
Curve Class
Trim Overload
Rhino.Geometry Namespace