RhinoCommon API
Mesh.WithEdgeSoftening Method
 Constructs new mesh from the current one, with edge softening applied to it.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Mesh WithEdgeSoftening(
	double softeningRadius,
	bool chamfer,
	bool faceted,
	bool force,
	double angleThreshold
)
Public Function WithEdgeSoftening (
	softeningRadius As Double,
	chamfer As Boolean,
	faceted As Boolean,
	force As Boolean,
	angleThreshold As Double
) As Mesh
Parameters
softeningRadius
Type: System.Double
The softening radius.
chamfer
Type: System.Boolean
Specifies whether to chamfer the edges.
faceted
Type: System.Boolean
Specifies whether the edges are faceted.
force
Type: System.Boolean
Specifies whether to soften edges despite too large a radius.
angleThreshold
Type: System.Double
Threshold angle (in degrees) which controls whether an edge is softened or not. The angle refers to the angles between the adjacent faces of an edge.
Return Value
Type: Mesh
A new mesh with soft edges.
Exceptions
Exception | Condition
InvalidOperationException | If displacement failed because of an error. The exception message specifies the error.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace