RhinoCommon API
RenderPanels.FromRenderSessionId Method
 Get the instance of a render panel associated with a specific render session, this is useful when it is necessary to update a control from a RenderPipeline
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public static Object FromRenderSessionId(
	PlugIn plugIn,
	Type panelType,
	Guid renderSessionId
)
Public Shared Function FromRenderSessionId (
	plugIn As PlugIn,
	panelType As Type,
	renderSessionId As Guid
) As Object
Parameters
plugIn
Type: Rhino.PlugIns.PlugIn
 The plug-in that registered the custom user interface
panelType
Type: System.Type
 The type of panel to return
renderSessionId
Type: System.Guid
 The RenderSessionId of a specific render session.
Return Value
Type: Object
 Returns the custom panel object if found; otherwise null is returned.
See Also
Reference
RenderPanels Class
Rhino.Render Namespace