RhinoCommon API
DisplayPipeline.DrawCone Method (Cone, Color)
 Draw a wireframe cone.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DrawCone(
	Cone cone,
	Color color
)
Public Sub DrawCone (
	cone As Cone,
	color As Color
)
Parameters
cone
Type: Rhino.Geometry.Cone
Cone to draw.
color
Type: System.Drawing.Color
Color to draw with.
See Also
Reference
DisplayPipeline Class
DrawCone Overload
Rhino.Display Namespace