RhinoCommon API
FontTable.FindOrCreate Method (String, Boolean, Boolean)
 Get a DimensionStyle with the specified characteristics the settings other than face, bold and italic are copied from the current style
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int FindOrCreate(
	string face,
	bool bold,
	bool italic
)
Public Function FindOrCreate (
	face As String,
	bold As Boolean,
	italic As Boolean
) As Integer
Parameters
face
Type: System.String
[Missing <param name="face"/> documentation for "M:Rhino.DocObjects.Tables.FontTable.FindOrCreate(System.String,System.Boolean,System.Boolean)"]
bold
Type: System.Boolean
[Missing <param name="bold"/> documentation for "M:Rhino.DocObjects.Tables.FontTable.FindOrCreate(System.String,System.Boolean,System.Boolean)"]
italic
Type: System.Boolean
[Missing <param name="italic"/> documentation for "M:Rhino.DocObjects.Tables.FontTable.FindOrCreate(System.String,System.Boolean,System.Boolean)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.FontTable.FindOrCreate(System.String,System.Boolean,System.Boolean)"]
Examples
using Rhino;
using Rhino.Commands;
using Rhino.Geometry;
namespace examples_cs
{
  public class TextJustifyCommand : Command
  {
    public override string EnglishName { get { return "csTextJustify"; } }
    protected override Result RunCommand(RhinoDoc doc, RunMode mode)
    {
      var text_entity = new TextEntity
      {
        Plane = Plane.WorldXY,
        PlainText = "Hello Rhino!",
        Justification = TextJustification.MiddleCenter,
        Font = doc.Fonts.FromQuartetProperties("Arial", false, false)
      };
      doc.Objects.AddText(text_entity);
      doc.Views.Redraw();
      return Result.Success;
    }
  }
}
Imports Rhino
Imports Rhino.Commands
Imports Rhino.Geometry
Namespace examples_vb
  Public Class TextJustifyCommand
    Inherits Command
    Public Overrides ReadOnly Property EnglishName() As String
      Get
        Return "vbTextJustify"
      End Get
    End Property
    Protected Overrides Function RunCommand(doc As RhinoDoc, mode As RunMode) As Result
      Dim text_entity = New TextEntity()
      text_entity.Plane = Plane.WorldXY
      text_entity.PlainText = "Hello Rhino!"
      text_entity.Justification = TextJustification.MiddleCenter
      text_entity.Font = doc.Fonts.FromQuartetProperties("Arial", False, False)
      doc.Objects.AddText(text_entity)
      doc.Views.Redraw()
      Return Result.Success
    End Function
  End Class
End Namespace
from scriptcontext import doc
from Rhino.Geometry import *
text_entity = TextEntity()
text_entity.Plane = Plane.WorldXY
text_entity.PlainText = "Hello Rhino!"
text_entity.Justification = TextJustification.MiddleCenter
text_entity.Font = doc.Fonts.FromQuartetProperties("Arial", False, False)
doc.Objects.AddText(text_entity)
doc.Views.Redraw()
See Also
Reference
FontTable Class
FindOrCreate Overload
Rhino.DocObjects.Tables Namespace