RhinoCommon API
FactoryBase.Register Method (PlugIn)
 Call this function during the startup of your plug-in to ensure that all classes that support factory creation are registed
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Type[] Register(
	PlugIn plugin
)
Public Shared Function Register (
	plugin As PlugIn
) As Type()
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.UI.Controls.FactoryBase.Register(Rhino.PlugIns.PlugIn)"]
Return Value
Type: Type[]
[Missing <returns> documentation for "M:Rhino.UI.Controls.FactoryBase.Register(Rhino.PlugIns.PlugIn)"]
See Also
Reference
FactoryBase Class
Register Overload
Rhino.UI.Controls Namespace