RhinoCommon API
Transform.TransformList Method
 Given a list, an array or any enumerable set of points, computes a new array of transformed points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d[] TransformList(
	IEnumerable<Point3d> points
)
Public Function TransformList (
	points As IEnumerable(Of Point3d)
) As Point3d()
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable set of points to be left untouched and copied.
Return Value
Type: Point3d[]
A new array.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace