RhinoCommon API
CustomRenderMeshProviderAttribute Constructor
 Constructor
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public CustomRenderMeshProviderAttribute(
	bool nonObjectIdsOnly = false
)
Public Sub New (
	Optional nonObjectIdsOnly As Boolean = false
)
Parameters
nonObjectIdsOnly (Optional)
Type: System.Boolean
[Missing <param name="nonObjectIdsOnly"/> documentation for "M:Rhino.Render.CustomRenderMeshes.CustomRenderMeshProviderAttribute.#ctor(System.Boolean)"]
See Also
Reference
CustomRenderMeshProviderAttribute Class
Rhino.Render.CustomRenderMeshes Namespace