RhinoCommon API
File3dmViewTable.FindName Method
 Finds a ViewInfo given its name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ViewInfo FindName(
	string name
)
Public Function FindName (
	name As String
) As ViewInfo
Parameters
name
Type: System.String
The name of the ViewInfo to be searched.
Return Value
Type: ViewInfo
An ViewInfo, or null on error.
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace