RhinoCommon API
StdVectorByte Constructor
 Initializes a new SimpleArrayByte class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.26
Syntax
public StdVectorByte()
Public Sub New
See Also
Reference
StdVectorByte Class
StdVectorByte Overload
Rhino.Runtime.InteropWrappers Namespace