RhinoCommon API
HostUtils.InitializeRhinoCommon Method
 Makes sure all static RhinoCommon components is set up correctly. This happens automatically when a plug-in is loaded, so you probably won't have to call this method.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void InitializeRhinoCommon()
Public Shared Sub InitializeRhinoCommon
Remarks
Subsequent calls to this method will be ignored.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace