RhinoCommon API
RhinoObject.SetHistory Method
 For expert use only. Sets the history record that describes how this object was created. This information is used to update this object when Rhino history is enabled and an input object changes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SetHistory(
	HistoryRecord history
)
Public Function SetHistory (
	history As HistoryRecord
) As Boolean
Parameters
history
Type: Rhino.DocObjects.HistoryRecord
The history record.
Return Value
Type: Boolean
true if successful, otherwise false.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace