RhinoCommon API
PersistentSettings.DeleteItem Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.DeleteItem(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DeleteItem(
	string key
)
Public Sub DeleteItem (
	key As String
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.DeleteItem(System.String)"]
See Also
Reference
PersistentSettings Class
Rhino Namespace