RhinoCommon API
NurbsCurveFitParameters.GetCurvatureBiasCoefficientFromIntensity Method
 Returns the Curvature bias coefficient that corresponds to a given NurbsCurveFitParameters.Intensity value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double GetCurvatureBiasCoefficientFromIntensity(
	NurbsCurveFitParameters.Intensity intensity
)
Public Function GetCurvatureBiasCoefficientFromIntensity (
	intensity As NurbsCurveFitParameters.Intensity
) As Double
Parameters
intensity
Type: Rhino.Geometry.NurbsCurveFitParameters.Intensity
[Missing <param name="intensity"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.GetCurvatureBiasCoefficientFromIntensity(Rhino.Geometry.NurbsCurveFitParameters.Intensity)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.GetCurvatureBiasCoefficientFromIntensity(Rhino.Geometry.NurbsCurveFitParameters.Intensity)"]
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace