RhinoCommon API
RenderContent.MakeCopy Method
 Create a copy of the render content. All content is the same, except for the instance Id.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderContent MakeCopy()
Public Function MakeCopy As RenderContent
Return Value
Type: RenderContent
The new RenderContent
See Also
Reference
RenderContent Class
Rhino.Render Namespace