RhinoCommon API
LocalizedStringHandler.AppendLiteral Method
[Missing <summary> documentation for "M:Rhino.UI.LocalizedStringHandler.AppendLiteral(System.String)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void AppendLiteral(
	string value
)
Public Sub AppendLiteral (
	value As String
)
Parameters
value
Type: System.String
[Missing <param name="value"/> documentation for "M:Rhino.UI.LocalizedStringHandler.AppendLiteral(System.String)"]
See Also
Reference
LocalizedStringHandler Structure
Rhino.UI Namespace