RhinoCommon API
PointCloud.GetUnsafeLock Method
 Allows the developer to obtain unsafe pointers to the underlying unmanaged data structures of the PointCloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public PointCloudUnsafeLock GetUnsafeLock(
	bool writable
)
Public Function GetUnsafeLock (
	writable As Boolean
) As PointCloudUnsafeLock
Parameters
writable
Type: System.Boolean
true if user will need to write onto the structure. false otherwise.
Return Value
Type: PointCloudUnsafeLock
A lock that needs to be released.
Remarks
The lock implements the IDisposable interface, and one call of its Dispose() or ReleaseUnsafeLock(PointCloudUnsafeLock) will update the data structure as required. This can be achieved with a using statement (Using in Vb.Net).
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace