RhinoCommon API
TextFields.DateModified Method (String)
 Date the document was last edited in a specified format
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string DateModified(
	string dateFormat
)
Public Shared Function DateModified (
	dateFormat As String
) As String
Parameters
dateFormat
Type: System.String
[Missing <param name="dateFormat"/> documentation for "M:Rhino.Runtime.TextFields.DateModified(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.DateModified(System.String)"]
See Also
Reference
TextFields Class
DateModified Overload
Rhino.Runtime Namespace