RhinoCommon API
SupportOptions.SupportSharedUIs Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SupportSharedUIs"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool SupportSharedUIs()
Public Shared Function SupportSharedUIs As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.SupportSharedUIs"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace