RhinoCommon API
BrepFace.FilletSurfaceToCurve Method
 Creates a constant-radius fillet surface between a surface and the curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool FilletSurfaceToCurve(
	Curve curve,
	double t,
	double u,
	double v,
	double radius,
	int alignToCurve,
	int railDegree,
	int arcDegree,
	IEnumerable<double> arcSliders,
	int numBezierSrfs,
	double tolerance,
	List<Brep> out_fillets,
	out double[] fitResults
)
Public Function FilletSurfaceToCurve (
	curve As Curve,
	t As Double,
	u As Double,
	v As Double,
	radius As Double,
	alignToCurve As Integer,
	railDegree As Integer,
	arcDegree As Integer,
	arcSliders As IEnumerable(Of Double),
	numBezierSrfs As Integer,
	tolerance As Double,
	out_fillets As List(Of Brep),
	<OutAttribute> ByRef fitResults As Double()
) As Boolean
Parameters
curve
Type: Rhino.Geometry.Curve
the curve to which this face is being filleted.
t
Type: System.Double
A parameter on the curve, indicating region of fillet.
u
Type: System.Double
A parameter in the u direction of the face indicating which side of the curve to fillet.
v
Type: System.Double
A parameter in the v direction of the face indicating which side of the curve to fillet.
radius
Type: System.Double
The radius of the constant-radius fillet desired. NOTE: using arcSliders will change the shape of the arcs themselves
alignToCurve
Type: System.Int32
Does the user want the fillet to align to the curve? 0 - No, ignore the curve's b-spline structure 1 - Yes, match the curves's degree, spans, CVs as much as possible 2 - Same as 1, but iterate to fit to tolerance Note that a value of 1 or 2 will cause nBezierSrfs to be ignored
railDegree
Type: System.Int32
Desired fillet degree (3 or 5) in the u-direction, along the curve
arcDegree
Type: System.Int32
Desired fillet degree (2, 3, 4, or 5) in the v-direction, along the fillet arcs.If 2, then the surface is rational in v
arcSliders
Type: System.Collections.Generic.IEnumerable<Double>
Array of 2 sliders to shape the fillet in the arc direction, used for arcDegree = 3, 4, or 5; input { 0.0, 0.0 } to ignore [0] (-1 to 1) slides tangent arms from base (-1) to theoretical(1) [1] (-1 to 1) slides inner CV(s) from base (-1) to theoretical(1)
numBezierSrfs
Type: System.Int32
If >0, this indicates the number of equally-spaced fillet surfaces to be output in the rail direction, each surface Bézier in u.
tolerance
Type: System.Double
The tolerance. In in doubt, the document's absolute tolerance.
out_fillets
Type: System.Collections.Generic.List<Brep>
he results of the fillet calculation.
fitResults
Type: System.Double[]
array of doubles indicating fitting results: [0] max 3d point deviation along curve [1] max 3d point deviation along face [2] max angle deviation along face(in degrees) [3] max angle deviation between Bézier surfaces(in degrees) [4] max curvature difference between Bézier surfaces
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace