RhinoCommon API
SubD.ClearEdgeSharpness Method
 Converts every sharp edge in this SubD to a smooth edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public uint ClearEdgeSharpness()
Public Function ClearEdgeSharpness As UInteger
Return Value
Type: UInt32
The number of edges that were changed.
See Also
Reference
SubD Class
Rhino.Geometry Namespace