RhinoCommon API
MeshPrincipalCurvatureList.Destroy Method
 Releases all memory allocated to store principal curvatures. The list capacity will be 0 after this call.
Subsequent calls can add new items.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Destroy()
Public Sub Destroy
See Also
Reference
MeshPrincipalCurvatureList Class
Rhino.Geometry.Collections Namespace