RhinoCommon API
CustomPostEffectAttribute Constructor
Initializes a new instance of the CustomPostEffectAttribute class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public CustomPostEffectAttribute(
	PostEffectType postEffectType,
	string name,
	PostEffectStyles styles = PostEffectStyles.ExecuteForProductionRendering|PostEffectStyles.ExecuteForRealtimeRendering|PostEffectStyles.DefaultOn,
	PostEffectExecuteWhileRenderingOptions executeWhileRenderingOption = PostEffectExecuteWhileRenderingOptions.Always,
	bool canDisplayHelp = false,
	int executeWhileRenderingDelay = 0
)
Public Sub New (
	postEffectType As PostEffectType,
	name As String,
	Optional styles As PostEffectStyles = PostEffectStyles.ExecuteForProductionRendering Or PostEffectStyles.ExecuteForRealtimeRendering Or PostEffectStyles.DefaultOn,
	Optional executeWhileRenderingOption As PostEffectExecuteWhileRenderingOptions = PostEffectExecuteWhileRenderingOptions.Always,
	Optional canDisplayHelp As Boolean = false,
	Optional executeWhileRenderingDelay As Integer = 0
)
Parameters
postEffectType
Type: Rhino.Render.PostEffects.PostEffectType
[Missing <param name="postEffectType"/> documentation for "M:Rhino.Render.PostEffects.CustomPostEffectAttribute.#ctor(Rhino.Render.PostEffects.PostEffectType,System.String,Rhino.Render.PostEffects.PostEffectStyles,Rhino.Render.PostEffects.PostEffectExecuteWhileRenderingOptions,System.Boolean,System.Int32)"]
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Render.PostEffects.CustomPostEffectAttribute.#ctor(Rhino.Render.PostEffects.PostEffectType,System.String,Rhino.Render.PostEffects.PostEffectStyles,Rhino.Render.PostEffects.PostEffectExecuteWhileRenderingOptions,System.Boolean,System.Int32)"]
styles (Optional)
Type: Rhino.Render.PostEffects.PostEffectStyles
[Missing <param name="styles"/> documentation for "M:Rhino.Render.PostEffects.CustomPostEffectAttribute.#ctor(Rhino.Render.PostEffects.PostEffectType,System.String,Rhino.Render.PostEffects.PostEffectStyles,Rhino.Render.PostEffects.PostEffectExecuteWhileRenderingOptions,System.Boolean,System.Int32)"]
executeWhileRenderingOption (Optional)
Type: Rhino.Render.PostEffects.PostEffectExecuteWhileRenderingOptions
[Missing <param name="executeWhileRenderingOption"/> documentation for "M:Rhino.Render.PostEffects.CustomPostEffectAttribute.#ctor(Rhino.Render.PostEffects.PostEffectType,System.String,Rhino.Render.PostEffects.PostEffectStyles,Rhino.Render.PostEffects.PostEffectExecuteWhileRenderingOptions,System.Boolean,System.Int32)"]
canDisplayHelp (Optional)
Type: System.Boolean
[Missing <param name="canDisplayHelp"/> documentation for "M:Rhino.Render.PostEffects.CustomPostEffectAttribute.#ctor(Rhino.Render.PostEffects.PostEffectType,System.String,Rhino.Render.PostEffects.PostEffectStyles,Rhino.Render.PostEffects.PostEffectExecuteWhileRenderingOptions,System.Boolean,System.Int32)"]
executeWhileRenderingDelay (Optional)
Type: System.Int32
[Missing <param name="executeWhileRenderingDelay"/> documentation for "M:Rhino.Render.PostEffects.CustomPostEffectAttribute.#ctor(Rhino.Render.PostEffects.PostEffectType,System.String,Rhino.Render.PostEffects.PostEffectStyles,Rhino.Render.PostEffects.PostEffectExecuteWhileRenderingOptions,System.Boolean,System.Int32)"]
See Also
Reference
CustomPostEffectAttribute Class
Rhino.Render.PostEffects Namespace