RhinoCommon API
MeshingParameters.GetHashCode Method
 Computes a hash number that represents the current MeshingParameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A hash code for MeshingParameters.
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace