RhinoCommon API
Mesh.SplitMesh Method
 Some file formats and rendering engines are only able to process small batches of triangles. Use this function to split the mesh into subsets of vertices and faces that those file formats and rendering engines can handle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.25
Syntax
public static Mesh[] SplitMesh(
	Mesh mesh,
	int maxCount,
	bool countSum,
	bool countTriangles
)
Public Shared Function SplitMesh (
	mesh As Mesh,
	maxCount As Integer,
	countSum As Boolean,
	countTriangles As Boolean
) As Mesh()
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to split.
maxCount
Type: System.Int32
Maximum count.
countSum
Type: System.Boolean
 If true, split if total vertices + faces is greater than maxCount. If false, split if either total vertices or faces is greater than maxCount.
countTriangles
Type: System.Boolean
 If true, count triangles. If false, count triangles and quads.
Return Value
Type: Mesh[]
An array of sub-meshes if successful, otherwise an empty array.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace