RhinoCommon API
DisplayPipeline.DrawPoint Method (Point3d, Color)
Draws a point with a given radius, style and color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DrawPoint(
	Point3d point,
	Color color
)
Public Sub DrawPoint (
	point As Point3d,
	color As Color
)
Parameters
point
Type: Rhino.Geometry.Point3d
Location of point in world coordinates.
color
Type: System.Drawing.Color
Color of point.
See Also
Reference
DisplayPipeline Class
DrawPoint Overload
Rhino.Display Namespace