RhinoCommon API
Mesh.Reduce Method (Int32, Boolean, Int32, Boolean, CancellationToken, IProgress<Double>, String)
Reduce polygon count
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Reduce(
	int desiredPolygonCount,
	bool allowDistortion,
	int accuracy,
	bool normalizeSize,
	CancellationToken cancelToken,
	IProgress<double> progress,
	out string problemDescription
)
Public Function Reduce (
	desiredPolygonCount As Integer,
	allowDistortion As Boolean,
	accuracy As Integer,
	normalizeSize As Boolean,
	cancelToken As CancellationToken,
	progress As IProgress(Of Double),
	<OutAttribute> ByRef problemDescription As String
) As Boolean
Parameters
desiredPolygonCount
Type: System.Int32
desired or target number of faces
allowDistortion
Type: System.Boolean
 If true, faces are removed until desiredPolygonCount is reached, distorting the shape as needed. If false, only flat (coplanar) regions are simplified, which leaves the shape unchanged and ignores desiredPolygonCount.
accuracy
Type: System.Int32
Integer from 1 to 10 telling how accurate reduction algorithm to use. Greater number gives more accurate results
normalizeSize
Type: System.Boolean
If true mesh is fitted to an axis aligned unit cube until reduction is complete
cancelToken
Type: System.Threading.CancellationToken
[Missing <param name="cancelToken"/> documentation for "M:Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean,System.Threading.CancellationToken,System.IProgress{System.Double},System.String@)"]
progress
Type: System.IProgress<Double>
[Missing <param name="progress"/> documentation for "M:Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean,System.Threading.CancellationToken,System.IProgress{System.Double},System.String@)"]
problemDescription
Type: System.String
[Missing <param name="problemDescription"/> documentation for "M:Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean,System.Threading.CancellationToken,System.IProgress{System.Double},System.String@)"]
Return Value
Type: Boolean
True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
See Also
Reference
Mesh Class
Reduce Overload
Rhino.Geometry Namespace