RhinoCommon API
MeshVertexList.Align Method (Double, Boolean, Boolean)
 Moves mesh vertices to neighboring vertices, within the specified distance.
This forces unaligned mesh vertices to the same location and is helpful to clean meshes for 3D printing.
See the
_AlignVertices
 Rhino command for more information.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Align(
	double distance,
	bool onlyNaked,
	bool average
)
Public Function Align (
	distance As Double,
	onlyNaked As Boolean,
	average As Boolean
) As Integer
Parameters
distance
Type: System.Double
Distance that should not be exceed when modifying the mesh.
onlyNaked
Type: System.Boolean
If true, only vertices that lie along naked edges are moved, and only such vertices are used as targets to align to.
average
Type: System.Boolean
If true, vertices that are candidates for one another are moved towards each other, rather than one of them being privileged and the others moved onto it.
Return Value
Type: Int32
If the operation succeeded, the number of mesh vertices that were moved, or -1 on error.
See Also
Reference
MeshVertexList Class
Align Overload
Rhino.Geometry.Collections Namespace