RhinoCommon API
TextFields.ObjectPageNumber Method
 Returns the layout page number the object resides on
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static int ObjectPageNumber(
	string id
)
Public Shared Function ObjectPageNumber (
	id As String
) As Integer
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.ObjectPageNumber(System.String)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.ObjectPageNumber(System.String)"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace