RhinoCommon API
Plane.CreateFromNormal Method
 Constructs a plane from a point and normal vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Plane CreateFromNormal(
	Point3d origin,
	Vector3d normal
)
Public Shared Function CreateFromNormal (
	origin As Point3d,
	normal As Vector3d
) As Plane
Parameters
origin
Type: Rhino.Geometry.Point3d
Point on the plane.
normal
Type: Rhino.Geometry.Vector3d
Non-zero normal to the plane.
Return Value
Type: Plane
A valid plane if successful, or Plane.Unset on failure.
See Also
Reference
Plane Structure
Rhino.Geometry Namespace