RhinoCommon API
SimpleArrayPoint3d.ToArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d[] ToArray()
Public Function ToArray As Point3d()
Return Value
Type: Point3d[]
The managed array.
See Also
Reference
SimpleArrayPoint3d Class
Rhino.Runtime.InteropWrappers Namespace