RhinoCommon API
Font Constructor (String, Font.FontWeight, Font.FontStyle, Boolean, Boolean)
Initializes a new instance of the Font class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Font(
	string familyName,
	Font.FontWeight weight,
	Font.FontStyle style,
	bool underlined,
	bool strikethrough
)
Public Sub New (
	familyName As String,
	weight As Font.FontWeight,
	style As Font.FontStyle,
	underlined As Boolean,
	strikethrough As Boolean
)
Parameters
familyName
Type: System.String
[Missing <param name="familyName"/> documentation for "M:Rhino.DocObjects.Font.#ctor(System.String,Rhino.DocObjects.Font.FontWeight,Rhino.DocObjects.Font.FontStyle,System.Boolean,System.Boolean)"]
weight
Type: Rhino.DocObjects.Font.FontWeight
[Missing <param name="weight"/> documentation for "M:Rhino.DocObjects.Font.#ctor(System.String,Rhino.DocObjects.Font.FontWeight,Rhino.DocObjects.Font.FontStyle,System.Boolean,System.Boolean)"]
style
Type: Rhino.DocObjects.Font.FontStyle
[Missing <param name="style"/> documentation for "M:Rhino.DocObjects.Font.#ctor(System.String,Rhino.DocObjects.Font.FontWeight,Rhino.DocObjects.Font.FontStyle,System.Boolean,System.Boolean)"]
underlined
Type: System.Boolean
[Missing <param name="underlined"/> documentation for "M:Rhino.DocObjects.Font.#ctor(System.String,Rhino.DocObjects.Font.FontWeight,Rhino.DocObjects.Font.FontStyle,System.Boolean,System.Boolean)"]
strikethrough
Type: System.Boolean
[Missing <param name="strikethrough"/> documentation for "M:Rhino.DocObjects.Font.#ctor(System.String,Rhino.DocObjects.Font.FontWeight,Rhino.DocObjects.Font.FontStyle,System.Boolean,System.Boolean)"]
See Also
Reference
Font Class
Font Overload
Rhino.DocObjects Namespace