RhinoCommon API
RdkSelectionNavigator Constructor
Initializes a new instance of the RdkSelectionNavigator class
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RdkSelectionNavigator(
	IntPtr pRhinoSettings
)
Public Sub New (
	pRhinoSettings As IntPtr
)
Parameters
pRhinoSettings
Type: System.IntPtr
[Missing <param name="pRhinoSettings"/> documentation for "M:Rhino.Render.DataSources.RdkSelectionNavigator.#ctor(System.IntPtr)"]
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace