RhinoCommon API
PersistentSettings.GetChild Method
 Call this method to get a nested settings PersistentSettings instance, will throw a KeyNotFoundException exception if the key does not exist.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PersistentSettings GetChild(
	string key
)
Public Function GetChild (
	key As String
) As PersistentSettings
Parameters
key
Type: System.String
Key name
Return Value
Type: PersistentSettings
 Returns persistent settings for the specified key or throws an exception if the key is invalid.
Exceptions
Exception | Condition
KeyNotFoundException | Thrown if the key does not exist.
See Also
Reference
PersistentSettings Class
Rhino Namespace