RhinoCommon API
File3dmShutLining.SetCurveIsBump Method
 Sets whether to create a bump instead of a dent for the given curve.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetCurveIsBump(
	Guid curve_id,
	bool b
)
Public Sub SetCurveIsBump (
	curve_id As Guid,
	b As Boolean
)
Parameters
curve_id
Type: System.Guid
[Missing <param name="curve_id"/> documentation for "M:Rhino.FileIO.File3dmShutLining.SetCurveIsBump(System.Guid,System.Boolean)"]
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.FileIO.File3dmShutLining.SetCurveIsBump(System.Guid,System.Boolean)"]
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace