RhinoCommon API
SubD.EvaluateCurvature Method (SubDComponentParameter, Point3d, Vector3d, Double, Double)
 Evaluates the principal curvatures of a point on this SubD's surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool EvaluateCurvature(
	SubDComponentParameter parameter,
	out Point3d point,
	out Vector3d normal,
	out double kappa1,
	out double kappa2
)
Public Function EvaluateCurvature (
	parameter As SubDComponentParameter,
	<OutAttribute> ByRef point As Point3d,
	<OutAttribute> ByRef normal As Vector3d,
	<OutAttribute> ByRef kappa1 As Double,
	<OutAttribute> ByRef kappa2 As Double
) As Boolean
Parameters
parameter
Type: Rhino.Geometry.SubDComponentParameter
The parameter to evaluate.
point
Type: Rhino.Geometry.Point3d
 The surface point is returned here, or Unset if this fails.
normal
Type: Rhino.Geometry.Vector3d
The unit surface normal is returned here.
kappa1
Type: System.Double
 The largest principal curvature, in absolute value, is returned here.
kappa2
Type: System.Double
 The smallest principal curvature, in absolute value, is returned here.
Return Value
Type: Boolean
True if the evaluation succeeded.
Remarks
 This needs second order surface derivatives. They are available throughout the corner quad of an extraordinary vertex, but not exactly on such a vertex: a SubD limit surface is C1 there but generally not C2, so it has no curvature. This returns false in that case, and kappa1 and kappa2 are NaN.
See Also
Reference
SubD Class
EvaluateCurvature Overload
Rhino.Geometry Namespace