RhinoCommon API
WorksessionFile.ReadFileVersion Method
 Reads only the version from the header of a worksession file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int ReadFileVersion(
	string path
)
Public Shared Function ReadFileVersion (
	path As String
) As Integer
Parameters
path
Type: System.String
The file to read.
Return Value
Type: Int32
 The file's version, or 0 if the file cannot be read or is not a worksession file. A version greater than CurrentVersion is from a newer version of Rhino.
Exceptions
Exception | Condition
ArgumentNullException | If path is null.
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace