RhinoCommon API
FileSettings.GetDefaultState Method
 Returns the default state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static FileSettingsState GetDefaultState()
Public Shared Function GetDefaultState As FileSettingsState
Return Value
Type: FileSettingsState
A new instance containing the default state.
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace