RhinoCommon API
ObjectTable.GetObjectsByType<T> Method
 Returns Rhino object by type.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IEnumerable<T> GetObjectsByType<T>()
where T : RhinoObject
Public Function GetObjectsByType(Of T As RhinoObject) As IEnumerable(Of T)
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1"]
Return Value
Type: IEnumerable<T>
The enumerable.
See Also
Reference
ObjectTable Class
GetObjectsByType Overload
Rhino.DocObjects.Tables Namespace