RhinoCommon API
NurbsSurfacePointList.SetControlPoint Method (Int32, Int32, Point3d)
Note: This API is now obsolete.
 Sets the control point at the given (u, v) index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use one of the SetPoint() overrides")]
public bool SetControlPoint(
	int u,
	int v,
	Point3d cp
)
<ObsoleteAttribute("Use one of the SetPoint() overrides")>
Public Function SetControlPoint (
	u As Integer,
	v As Integer,
	cp As Point3d
) As Boolean
Parameters
u
Type: System.Int32
Index of control point in the surface U direction.
v
Type: System.Int32
Index of control point in the surface V direction.
cp
Type: Rhino.Geometry.Point3d
The control point location to set (weight is assumed to be 1.0).
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsSurfacePointList Class
SetControlPoint Overload
Rhino.Geometry.Collections Namespace