RhinoCommon API
Transform.ChangeBasis Method (Plane, Plane)
 Gets a change of basis transformation. The change of basis transformation is not the same as the rotation transformation that rotates one orthonormal frame to another. If you have geometry defined with respect to planes, this method takes two planes and computes the transformation to change coordinates from one plane to another.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Transform ChangeBasis(
	Plane plane0,
	Plane plane1
)
Public Shared Function ChangeBasis (
	plane0 As Plane,
	plane1 As Plane
) As Transform
Parameters
plane0
Type: Rhino.Geometry.Plane
Coordinate system in which the geometry is currently described.
plane1
Type: Rhino.Geometry.Plane
Target coordinate system in which we want the geometry to be described.
Return Value
Type: Transform
 A change of basis transformation if success, on failure.
Remarks
 Change of basis transformations and rotation transformations are often confused. This is a change of basis transformation. If Q = P0 + a0*X0 + b0*Y0 + c0*Z0 = P1 + a1*X1 + b1*Y1 + c1*Z1, then this transform will map the coordinates (a0,b0,c0) to (a1,b1,c1).
See Also
Reference
Transform Structure
ChangeBasis Overload
Rhino.Geometry Namespace
Transform.Unset