RhinoCommon API
Mesh.GetMeshes Method
 Get a SimpleArrayMeshPointer containing all meshes for the related Mesh Since Rhino 8.0, this function only ever returns a single mesh. Use the Mesh property to get this single mesh.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Mesh[] GetMeshes()
Public Function GetMeshes As Mesh()
Return Value
Type: Mesh[]
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.Mesh.GetMeshes"]
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace
Mesh.SingleMesh