RhinoCommon API
PostEffect.Changed Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffect.Changed"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Changed()
Public Sub Changed
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace