RhinoCommon API
FileLwo.Read Method
Read a lwo file into a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	FileLwoReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As FileLwoReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.FileLwoReadOptions
options used for importing the Lwo file
Return Value
Type: Boolean
true on success
See Also
Reference
FileLwo Class
Rhino.FileIO Namespace