RhinoCommon API
LightArray Constructor
Initializes a new instance of the LightArray class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LightArray()
Public Sub New
See Also
Reference
LightArray Class
LightArray Overload
Rhino.Render Namespace