RhinoCommon API
Skylight.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.Skylight.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
Skylight Class
Rhino.Render Namespace