RhinoCommon API
NurbsCurve.CreateFromFitPoints Method (IEnumerable<Point3d>, Double, Int32, Boolean, Vector3d, Vector3d)
 Fits a NURBS curve to a dense, ordered set of points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static NurbsCurve CreateFromFitPoints(
	IEnumerable<Point3d> points,
	double tolerance,
	int degree,
	bool periodic,
	Vector3d startTangent,
	Vector3d endTangent
)
Public Shared Function CreateFromFitPoints (
	points As IEnumerable(Of Point3d),
	tolerance As Double,
	degree As Integer,
	periodic As Boolean,
	startTangent As Vector3d,
	endTangent As Vector3d
) As NurbsCurve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
An enumeration of 3D points.
tolerance
Type: System.Double
The fitting tolerance. When in doubt, use the document's model absolute tolerance.
degree
Type: System.Int32
The desired degree of the output curve.
periodic
Type: System.Boolean
Set true to create a periodic curve.
startTangent
Type: Rhino.Geometry.Vector3d
The tangent direction at the start of the curve. If unknown, set to Unset.
endTangent
Type: Rhino.Geometry.Vector3d
The tangent direction at the end of the curve. If unknown, set to Unset.
Return Value
Type: NurbsCurve
A NURBS curve if successful, or null on failure.
See Also
Reference
NurbsCurve Class
CreateFromFitPoints Overload
Rhino.Geometry Namespace