RhinoCommon API
LicenseData Constructor (String, String, String, LicenseBuildType, Int32)
 Public constructor
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public LicenseData(
	string productLicense,
	string serialNumber,
	string licenseTitle,
	LicenseBuildType buildType,
	int licenseCount
)
Public Sub New (
	productLicense As String,
	serialNumber As String,
	licenseTitle As String,
	buildType As LicenseBuildType,
	licenseCount As Integer
)
Parameters
productLicense
Type: System.String
License string to be saved by ZooClient
serialNumber
Type: System.String
Serial number to be displayed to end user
licenseTitle
Type: System.String
Title of license (Rhino 6.0 Evaluation)
buildType
Type: Rhino.PlugIns.LicenseBuildType
A LicenseBuildType value
licenseCount
Type: System.Int32
Number of licenses represented by this string. Allows the Zoo to hand out multiple license keys when greater than 1.
See Also
Reference
LicenseData Class
LicenseData Overload
Rhino.PlugIns Namespace