RhinoCommon API
IRdkViewModel.Commit Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRdkViewModel.Commit(System.Guid)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void Commit(
	Guid uuidDataType
)
Sub Commit (
	uuidDataType As Guid
)
Parameters
uuidDataType
Type: System.Guid
[Missing <param name="uuidDataType"/> documentation for "M:Rhino.UI.Controls.IRdkViewModel.Commit(System.Guid)"]
See Also
Reference
IRdkViewModel Interface
Rhino.UI.Controls Namespace