RhinoCommon API
Sun.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.Sun.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
Sun Class
Rhino.Render Namespace