RhinoCommon API
ObjectAttributes.GetCustomLinetype Method
 Get an optional custom linetype associated with these attributes. If null, then the attributes use the linetype index to determine it's linetype
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Linetype GetCustomLinetype()
Public Function GetCustomLinetype As Linetype
Return Value
Type: Linetype
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.GetCustomLinetype"]
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace