RhinoCommon API
Point3dList Constructor (IEnumerable<Point3d>)
 Initializes a new point list by copying the values from another set.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3dList(
	IEnumerable<Point3d> collection
)
Public Sub New (
	collection As IEnumerable(Of Point3d)
)
Parameters
collection
Type: System.Collections.Generic.IEnumerable<Point3d>
The collection to copy from.
See Also
Reference
Point3dList Class
Point3dList Overload
Rhino.Collections Namespace