RhinoCommon API
ColorGradient.SetColorStops Method
 Set color stops for the gradient
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SetColorStops(
	IEnumerable<ColorStop> stops
)
Public Sub SetColorStops (
	stops As IEnumerable(Of ColorStop)
)
Parameters
stops
Type: System.Collections.Generic.IEnumerable<ColorStop>
[Missing <param name="stops"/> documentation for "M:Rhino.Display.ColorGradient.SetColorStops(System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop})"]
See Also
Reference
ColorGradient Class
Rhino.Display Namespace