RhinoCommon API
Leader Constructor
 Constructor
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Leader()
Public Sub New
See Also
Reference
Leader Class
Leader Overload
Rhino.Geometry Namespace