RhinoCommon API
ConstructionPlaneGridDefaults Constructor
Initializes a new instance of the ConstructionPlaneGridDefaults class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ConstructionPlaneGridDefaults()
Public Sub New
See Also
Reference
ConstructionPlaneGridDefaults Class
Rhino.DocObjects Namespace