RhinoCommon API
File3dmShutLining.AddCurve Method
 Adds a new curve to the shut-lining. The curve will have an id of Guid.Empty. After adding a curve, you should set the id to that of a curve in the model that will be used to calculate the shut-lining.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid AddCurve()
Public Function AddCurve As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmShutLining.AddCurve"]
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace