RhinoCommon API
File3dmViewTable.Clear Method
 Removes all items from the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace