RhinoCommon API
IStackedDialogPageService.TryGetControlMinimumSize Method
 Get the minimum size associated with a control object
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
bool TryGetControlMinimumSize(
	Object controlObject,
	out SizeF size
)
Function TryGetControlMinimumSize (
	controlObject As Object,
	<OutAttribute> ByRef size As SizeF
) As Boolean
Parameters
controlObject
Type: System.Object
 The control object to check for minimum size.
size
Type: System.Drawing.SizeF
 The minimum size of the control if provided.
Return Value
Type: Boolean
 Returns true if get control minimum size found, false otherwise.
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace