RhinoCommon API
DisplayPipelineAttributes.SetCurveThicknessUsage Method
 Sets usage, pixel thickness (CurveThickness) or a scale thickness (CurveThicknessScale)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetCurveThicknessUsage(
	DisplayPipelineAttributes.CurveThicknessUse usage
)
Public Sub SetCurveThicknessUsage (
	usage As DisplayPipelineAttributes.CurveThicknessUse
)
Parameters
usage
Type: Rhino.Display.DisplayPipelineAttributes.CurveThicknessUse
[Missing <param name="usage"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.SetCurveThicknessUsage(Rhino.Display.DisplayPipelineAttributes.CurveThicknessUse)"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace