RhinoCommon API
RenderContent.GetParameter Method
 Query the content instance for the value of a given named parameter. If you do not support this parameter, call the base class.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual Object GetParameter(
	string parameterName
)
Public Overridable Function GetParameter (
	parameterName As String
) As Object
Parameters
parameterName
Type: System.String
Name of the parameter
Return Value
Type: Object
IConvertible. Note that you can't directly cast from object, instead you have to use the Convert mechanism.
See Also
Reference
RenderContent Class
Rhino.Render Namespace