RhinoCommon API
ViewTable.DefaultViewLayout Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ViewTable.DefaultViewLayout"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DefaultViewLayout()
Public Sub DefaultViewLayout
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace