RhinoCommon API
Interop.NativeNonConstPointer Method (DisplayPipeline)
 Get CRhinoDisplayPipeline* for a DisplayPipeline instance
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static IntPtr NativeNonConstPointer(
	DisplayPipeline pipeline
)
Public Shared Function NativeNonConstPointer (
	pipeline As DisplayPipeline
) As IntPtr
Parameters
pipeline
Type: Rhino.Display.DisplayPipeline
[Missing <param name="pipeline"/> documentation for "M:Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Display.DisplayPipeline)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Display.DisplayPipeline)"]
See Also
Reference
Interop Class
NativeNonConstPointer Overload
Rhino.Runtime Namespace