RhinoCommon API
PersistentSettingsConverter.TryParseEnum Method (Type, String, String)
 Converts an enumerated value string (integer as string) to a enumerated value name.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool TryParseEnum(
	Type type,
	string intValueAsString,
	out string value
)
Public Shared Function TryParseEnum (
	type As Type,
	intValueAsString As String,
	<OutAttribute> ByRef value As String
) As Boolean
Parameters
type
Type: System.Type
The enumerated type
intValueAsString
Type: System.String
enumerated integer value as string
value
Type: System.String
Output value, will be null on error
Return Value
Type: Boolean
 Returns true if the successfully converted or false if not.
See Also
Reference
PersistentSettingsConverter Class
TryParseEnum Overload
Rhino Namespace