RhinoCommon API
Particle Constructor
 Initializes a new instance of the Particle class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Particle()
Public Sub New
See Also
Reference
Particle Class
Rhino.Geometry Namespace