RhinoCommon API
PersistentSettings.TryGetSettingIsHiddenFromUserInterface Method (String, Boolean, IEnumerable<String>)
 Values read from all users settings files will be marked as read-only which will cause any future calls to Set... to fail.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetSettingIsHiddenFromUserInterface(
	string key,
	out bool value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetSettingIsHiddenFromUserInterface (
	key As String,
	<OutAttribute> ByRef value As Boolean,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
 Key name for which to search.
value
Type: System.Boolean
 Value will be true if the setting is read-only otherwise false. setting.
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetSettingIsHiddenFromUserInterface(System.String,System.Boolean@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetSettingIsHiddenFromUserInterface(System.String,System.Boolean@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetSettingIsHiddenFromUserInterface Overload
Rhino Namespace