RhinoCommon API
IZooClientUtilities.GetLicenseStatus Method
 Returns the current status of every license for ui purposes
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
LicenseStatus[] GetLicenseStatus(
	Object verify
)
Function GetLicenseStatus (
	verify As Object
) As LicenseStatus()
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.GetLicenseStatus(System.Object)"]
Return Value
Type: LicenseStatus[]
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.GetLicenseStatus(System.Object)"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace