RhinoCommon API
RhinoDoc.SupportsRenderPrimitiveList Method
Note: This API is now obsolete.
 Determines if custom render meshes will be built for this document (i.e. - GH meshes).
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.9
Syntax
[ObsoleteAttribute]
public bool SupportsRenderPrimitiveList(
	ViewportInfo viewport,
	DisplayPipelineAttributes attrs
)
<ObsoleteAttribute>
Public Function SupportsRenderPrimitiveList (
	viewport As ViewportInfo,
	attrs As DisplayPipelineAttributes
) As Boolean
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
attrs
Type: Rhino.Display.DisplayPipelineAttributes
 Type of mesh to build. If attrs is non-null then a smaller mesh may be generated in less time, false is meant when actually rendering.
Return Value
Type: Boolean
 Returns true if custom render mesh(es) will get built for this document.
See Also
Reference
RhinoDoc Class
Rhino Namespace