RhinoCommon API
SimpleArrayExtrusionPointer.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SimpleArrayExtrusionPointer Class
Dispose Overload
Rhino.Runtime.InteropWrappers Namespace