RhinoCommon API
EventWatcher.Finalize Method
Releases the native watcher if Dispose() was not called.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
EventWatcher Class
Rhino Namespace