RhinoCommon API
DisplayPipeline.DrawCurvaturePreview Method (Mesh, Color)
 Draws a Mesh in Curvature Analysis preview.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void DrawCurvaturePreview(
	Mesh mesh,
	Color color
)
Public Sub DrawCurvaturePreview (
	mesh As Mesh,
	color As Color
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to draw.
color
Type: System.Drawing.Color
Objct color.
See Also
Reference
DisplayPipeline Class
DrawCurvaturePreview Overload
Rhino.Display Namespace