RhinoCommon API
RhinoDoc.SaveAs Method (String, Int32, Boolean, Boolean, Boolean, Boolean, Boolean)
 Save doc as a 3dm to a specified path
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SaveAs(
	string file3dmPath,
	int version,
	bool saveSmall,
	bool saveTextures,
	bool saveGeometryOnly,
	bool savePluginData,
	bool useCompression
)
Public Function SaveAs (
	file3dmPath As String,
	version As Integer,
	saveSmall As Boolean,
	saveTextures As Boolean,
	saveGeometryOnly As Boolean,
	savePluginData As Boolean,
	useCompression As Boolean
) As Boolean
Parameters
file3dmPath
Type: System.String
[Missing <param name="file3dmPath"/> documentation for "M:Rhino.RhinoDoc.SaveAs(System.String,System.Int32,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
version
Type: System.Int32
Rhino file version
saveSmall
Type: System.Boolean
whether to inlcude render meshes and preview image
saveTextures
Type: System.Boolean
whether to include the bitmap table
saveGeometryOnly
Type: System.Boolean
whether to write enything besides geometry
savePluginData
Type: System.Boolean
whether to write plugin user data
useCompression
Type: System.Boolean
"whether to compress meshes and embedded files
Return Value
Type: Boolean
true on success
See Also
Reference
RhinoDoc Class
SaveAs Overload
Rhino Namespace