RhinoCommon API
ShortcutKeySettings.GetShortcuts Method
 Get all shortcuts registered with Rhino
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public static KeyboardShortcut[] GetShortcuts()
Public Shared Function GetShortcuts As KeyboardShortcut()
Return Value
Type: KeyboardShortcut[]
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.GetShortcuts"]
See Also
Reference
ShortcutKeySettings Class
Rhino.ApplicationSettings Namespace