RhinoCommon API
PersistentSettings.ContainsModifiedValues Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.ContainsModifiedValues(Rhino.PersistentSettings)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ContainsModifiedValues(
	PersistentSettings allUserSettings
)
Public Function ContainsModifiedValues (
	allUserSettings As PersistentSettings
) As Boolean
Parameters
allUserSettings
Type: Rhino.PersistentSettings
[Missing <param name="allUserSettings"/> documentation for "M:Rhino.PersistentSettings.ContainsModifiedValues(Rhino.PersistentSettings)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.ContainsModifiedValues(Rhino.PersistentSettings)"]
See Also
Reference
PersistentSettings Class
Rhino Namespace