RhinoCommon API
PersistentSettings.GetStringDictionary Method (String, KeyValuePair<String, String>[], IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[],System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public KeyValuePair<string, string>[] GetStringDictionary(
	string key,
	KeyValuePair<string, string>[] defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetStringDictionary (
	key As String,
	defaultValue As KeyValuePair(Of String, String)(),
	legacyKeyList As IEnumerable(Of String)
) As KeyValuePair(Of String, String)()
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[],System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.Collections.Generic.KeyValuePair<String, String>[]
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[],System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[],System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: KeyValuePair<String, String>[]
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[],System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetStringDictionary Overload
Rhino Namespace