RhinoCommon API
ChangeQueue.ApplyDynamicClippingPlaneChanges Method
 Override this when you want to handle dynamicclippingplane changes
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplyDynamicClippingPlaneChanges(
	List<ClippingPlane> changed
)
Protected Overridable Sub ApplyDynamicClippingPlaneChanges (
	changed As List(Of ClippingPlane)
)
Parameters
changed
Type: System.Collections.Generic.List<ClippingPlane>
[Missing <param name="changed"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyDynamicClippingPlaneChanges(System.Collections.Generic.List{Rhino.Render.ChangeQueue.ClippingPlane})"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace