RhinoCommon API
DisplayPipeline.DrawPoints Method (DisplayPointSet)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoints(Rhino.Display.DisplayPointSet)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void DrawPoints(
	DisplayPointSet points
)
Public Sub DrawPoints (
	points As DisplayPointSet
)
Parameters
points
Type: Rhino.Display.DisplayPointSet
[Missing <param name="points"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoints(Rhino.Display.DisplayPointSet)"]
See Also
Reference
DisplayPipeline Class
DrawPoints Overload
Rhino.Display Namespace