RhinoCommon API
RhinoDoc.SaveAsTemplate Method (String)
 Save this document as a template
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool SaveAsTemplate(
	string file3dmTemplatePath
)
Public Function SaveAsTemplate (
	file3dmTemplatePath As String
) As Boolean
Parameters
file3dmTemplatePath
Type: System.String
[Missing <param name="file3dmTemplatePath"/> documentation for "M:Rhino.RhinoDoc.SaveAsTemplate(System.String)"]
Return Value
Type: Boolean
true on success
See Also
Reference
RhinoDoc Class
SaveAsTemplate Overload
Rhino Namespace