RhinoCommon API
Decal.SetUVBounds Method
 Sets the UV bounds of the decal. Only used when mapping is UV.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetUVBounds(
	double min_u,
	double min_v,
	double max_u,
	double max_v
)
Public Sub SetUVBounds (
	min_u As Double,
	min_v As Double,
	max_u As Double,
	max_v As Double
)
Parameters
min_u
Type: System.Double
[Missing <param name="min_u"/> documentation for "M:Rhino.Render.Decal.SetUVBounds(System.Double,System.Double,System.Double,System.Double)"]
min_v
Type: System.Double
[Missing <param name="min_v"/> documentation for "M:Rhino.Render.Decal.SetUVBounds(System.Double,System.Double,System.Double,System.Double)"]
max_u
Type: System.Double
[Missing <param name="max_u"/> documentation for "M:Rhino.Render.Decal.SetUVBounds(System.Double,System.Double,System.Double,System.Double)"]
max_v
Type: System.Double
[Missing <param name="max_v"/> documentation for "M:Rhino.Render.Decal.SetUVBounds(System.Double,System.Double,System.Double,System.Double)"]
See Also
Reference
Decal Class
Rhino.Render Namespace