RhinoCommon API
DisplayPipeline.DrawTorus Method (Torus, Color)
 Draw a wireframe torus.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DrawTorus(
	Torus torus,
	Color color
)
Public Sub DrawTorus (
	torus As Torus,
	color As Color
)
Parameters
torus
Type: Rhino.Geometry.Torus
Torus to draw.
color
Type: System.Drawing.Color
Color to draw with.
See Also
Reference
DisplayPipeline Class
DrawTorus Overload
Rhino.Display Namespace