RhinoCommon API
ColorLCH.CreateFromCMYK Method
 Create the nearest LCH equivalent of a CMYK color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static ColorLCH CreateFromCMYK(
	ColorCMYK cmyk
)
Public Shared Function CreateFromCMYK (
	cmyk As ColorCMYK
) As ColorLCH
Parameters
cmyk
Type: Rhino.Display.ColorCMYK
Target color in CMYK space.
Return Value
Type: ColorLCH
The LCH equivalent of the CMYK color.
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace