RhinoCommon API
Quaternion.RotateTowards Method
 Returns the quaternion obtained by rotating a towards b, limiting the rotation by MaxRadians.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Quaternion RotateTowards(
	Quaternion a,
	Quaternion b,
	double maxRadians
)
Public Shared Function RotateTowards (
	a As Quaternion,
	b As Quaternion,
	maxRadians As Double
) As Quaternion
Parameters
a
Type: Rhino.Geometry.Quaternion
The first quaternion.
b
Type: Rhino.Geometry.Quaternion
The second quaternion.
maxRadians
Type: System.Double
The maximum rotation in radians.
Return Value
Type: Quaternion
The rotated quaternion.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace