RhinoCommon API
Brep.Split Method (Brep, Double)
 Splits a Brep into pieces using a Brep as a cutter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep[] Split(
	Brep cutter,
	double intersectionTolerance
)
Public Function Split (
	cutter As Brep,
	intersectionTolerance As Double
) As Brep()
Parameters
cutter
Type: Rhino.Geometry.Brep
The Brep to use as a cutter.
intersectionTolerance
Type: System.Double
The tolerance with which to compute intersections.
Return Value
Type: Brep[]
A new array of Breps. This array can be empty.
See Also
Reference
Brep Class
Split Overload
Rhino.Geometry Namespace