RhinoCommon API
Surface.TryGetCylinder Method (Cylinder, Double)
Tests a surface to see if it is a portion of a cylinder and return the infinite cylinder.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetCylinder(
	out Cylinder cylinder,
	double tolerance
)
Public Function TryGetCylinder (
	<OutAttribute> ByRef cylinder As Cylinder,
	tolerance As Double
) As Boolean
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
On success, the cylinder parameters are filled in.
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the surface is a portion of a cylinder.
Remarks
 If successful, an infinite cylinder is returned. When a surface has a cylindrical shape, even if its ends are not circles on the cylinder, it returns the axis and radius. You can detect infinite cylinders using Cylinder.IsFinite.
See Also
Reference
Surface Class
TryGetCylinder Overload
Rhino.Geometry Namespace