RhinoCommon API
RenderTexture.GetLocalMappingType Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetLocalMappingType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public RenderTexture.eLocalMappingType GetLocalMappingType()
Public Function GetLocalMappingType As RenderTexture.eLocalMappingType
Return Value
Type: RenderTexture.eLocalMappingType
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetLocalMappingType"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace