RhinoCommon API
SubDComponent.ToString Method
 Returns a string of the form "SubDEdge(+12)", naming the component type, the orientation it is referenced with, and its id.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Geometry.SubDComponent.ToString"]
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace