RhinoCommon API
NamedPositionTable.Objects Method (String)
Array of Rhino Objects related to a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoObject[] Objects(
	string name
)
Public Function Objects (
	name As String
) As RhinoObject()
Parameters
name
Type: System.String
 The name of the Named Position from which you want to retrieve the objects.
Return Value
Type: RhinoObject[]
 Array of Rhino Objects which are tracked by the Named Position if successful, null if no such Named Position exists.
See Also
Reference
NamedPositionTable Class
Objects Overload
Rhino.DocObjects.Tables Namespace