RhinoCommon API
RhinoSettings.SetRenderSettings Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RhinoSettings.SetRenderSettings(Rhino.Render.RenderSettings)"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetRenderSettings(
	RenderSettings renderSettings
)
Public Sub SetRenderSettings (
	renderSettings As RenderSettings
)
Parameters
renderSettings
Type: Rhino.Render.RenderSettings
[Missing <param name="renderSettings"/> documentation for "M:Rhino.Render.DataSources.RhinoSettings.SetRenderSettings(Rhino.Render.RenderSettings)"]
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace