RhinoCommon API
Vector3f.Equals Method (Vector3f)
 Determines whether the specified vector has the same values as the present vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Equals(
	Vector3f vector
)
Public Function Equals (
	vector As Vector3f
) As Boolean
Parameters
vector
Type: Rhino.Geometry.Vector3f
The specified vector.
Return Value
Type: Boolean
true if vector has the same components as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Vector3f Structure
Equals Overload
Rhino.Geometry Namespace