RhinoCommon API
Mesh.UnweldEdge Method
 Adds creases to a smooth mesh by creating coincident vertices along selected edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public bool UnweldEdge(
	IEnumerable<int> edgeIndices,
	bool modifyNormals
)
Public Function UnweldEdge (
	edgeIndices As IEnumerable(Of Integer),
	modifyNormals As Boolean
) As Boolean
Parameters
edgeIndices
Type: System.Collections.Generic.IEnumerable<Int32>
An array of mesh topology edge indices.
modifyNormals
Type: System.Boolean
 If true, the vertex normals on each side of the edge take the same value as the face to which they belong, giving the mesh a hard edge look. If false, each of the vertex normals on either side of the edge is assigned the same value as the original normal that the pair is replacing, keeping a smooth look.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace