RhinoCommon API
RenderWindow.StandardChannelForGuid Method
 Get the StandardChannels for the given Guid
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static RenderWindow.StandardChannels StandardChannelForGuid(
	Guid id
)
Public Shared Function StandardChannelForGuid (
	id As Guid
) As RenderWindow.StandardChannels
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Render.RenderWindow.StandardChannelForGuid(System.Guid)"]
Return Value
Type: RenderWindow.StandardChannels
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.StandardChannelForGuid(System.Guid)"]
See Also
Reference
RenderWindow Class
Rhino.Render Namespace