RhinoCommon API
RenderPrimitive.Dispose Method
Releases all resources used by the RenderPrimitive
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RenderPrimitive Class
Dispose Overload
Rhino.Render Namespace