RhinoCommon API
HatchLine.SetDashes Method
 Sets a new dash array.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetDashes(
	IEnumerable<double> dashes
)
Public Sub SetDashes (
	dashes As IEnumerable(Of Double)
)
Parameters
dashes
Type: System.Collections.Generic.IEnumerable<Double>
The dash enumeration.
See Also
Reference
HatchLine Class
Rhino.DocObjects Namespace