RhinoCommon API
DisplayPipelineAttributes.SetSurfaceNakedEdgeThicknessUsage Method
 This is a helper function that combines setting SurfaceNakeEdgeUseNormalThickness and SurfaceNakedEdgeThicknessUsageFlags settings to correspond to the behavor of the Settings page.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public void SetSurfaceNakedEdgeThicknessUsage(
	DisplayPipelineAttributes.SurfaceNakedEdgeThicknessUse use
)
Public Sub SetSurfaceNakedEdgeThicknessUsage (
	use As DisplayPipelineAttributes.SurfaceNakedEdgeThicknessUse
)
Parameters
use
Type: Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeThicknessUse
[Missing <param name="use"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.SetSurfaceNakedEdgeThicknessUsage(Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeThicknessUse)"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace