RhinoCommon API
RhinoList.PointCloudKNeighbors Method
 Finds a certain amount of points in a list of 3D points that are the k-closest to a test point. This method searches needlePoints by computing all distances from each point cloud point and keeping a short list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static IEnumerable<int[]> PointCloudKNeighbors(
	PointCloud pointcloud,
	IEnumerable<Point3d> needlePoints,
	int amount
)
Public Shared Function PointCloudKNeighbors (
	pointcloud As PointCloud,
	needlePoints As IEnumerable(Of Point3d),
	amount As Integer
) As IEnumerable(Of Integer())
Parameters
pointcloud
Type: Rhino.Geometry.PointCloud
A point cloud to be searched.
needlePoints
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to search for.
amount
Type: System.Int32
The required amount of closest neighbors to find.
Return Value
Type: IEnumerable<Int32[]>
An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
See Also
Reference
RhinoList Class
Rhino.Collections Namespace
RTree.PointCloudKNeighbors(PointCloud, IEnumerable<Point3d>, Int32)