RhinoCommon API
NodeInCodeTable.Contains Method
 Check whether node is registered in this table or not
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Contains(
	string fullName
)
Public Function Contains (
	fullName As String
) As Boolean
Parameters
fullName
Type: System.String
Full name of node
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.NodeInCode.NodeInCodeTable.Contains(System.String)"]
See Also
Reference
NodeInCodeTable Class
Rhino.NodeInCode Namespace