RhinoCommon API
ColorHSV.ToArgbColor Method
 Convert HSV color to an equivalent System.Drawing.Color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Color ToArgbColor()
Public Function ToArgbColor As Color
Return Value
Type: Color
A .Net framework library color value.
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace