RhinoCommon API
FileCsvDocument.TryGetInt Method (String, Int32, Int32)
 Retrieves the value of a cell as a 32-bit integer, addressing the column by header name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetInt(
	string column,
	int row,
	out int value
)
Public Function TryGetInt (
	column As String,
	row As Integer,
	<OutAttribute> ByRef value As Integer
) As Boolean
Parameters
column
Type: System.String
The header name of the column.
row
Type: System.Int32
The zero-based data-row index (y).
value
Type: System.Int32
The parsed value, or 0 if the column or cell does not exist or cannot be parsed.
Return Value
Type: Boolean
true if the column and cell exist and were parsed; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetInt Overload
Rhino.FileIO Namespace