RhinoCommon API
Fonts.GetUiFont Method
 GetUiFont provides access to a set of unmanaged fonts used by Rhino.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Font GetUiFont(
	Fonts.Style style,
	Fonts.Size size
)
Public Shared Function GetUiFont (
	style As Fonts.Style,
	size As Fonts.Size
) As Font
Parameters
style
Type: Rhino.UI.Fonts.Style
Normal, Bold, Italic
size
Type: Rhino.UI.Fonts.Size
One of several preset enumerable sizes
Return Value
Type: Font
[Missing <returns> documentation for "M:Rhino.UI.Fonts.GetUiFont(Rhino.UI.Fonts.Style,Rhino.UI.Fonts.Size)"]
See Also
Reference
Fonts Class
Rhino.UI Namespace