RhinoCommon API
SupportOptions.BlockContent_SetLastNavigatedLocation Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.BlockContent_SetLastNavigatedLocation(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void BlockContent_SetLastNavigatedLocation(
	string folder
)
Public Shared Sub BlockContent_SetLastNavigatedLocation (
	folder As String
)
Parameters
folder
Type: System.String
[Missing <param name="folder"/> documentation for "M:Rhino.Render.SupportOptions.BlockContent_SetLastNavigatedLocation(System.String)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace