RhinoCommon API
RhinoViewport.ChangeToTwoPointPerspectiveProjection Method (Double)
 Use this function to change projections of valid viewports to a two point perspective. It will make common additional adjustments to the frustum and camera location and direction so the resulting views are similar.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ChangeToTwoPointPerspectiveProjection(
	double lensLength
)
Public Function ChangeToTwoPointPerspectiveProjection (
	lensLength As Double
) As Boolean
Parameters
lensLength
Type: System.Double
 (pass 50.0 when in doubt) 35 mm lens length to use when changing from parallel to perspective projections. If the current projection is perspective or lens_length is <= 0.0, then this parameter is ignored.
Return Value
Type: Boolean
 If the current projection is perspective and bSymmetricFrustum, FrustumIsLeftRightSymmetric() and FrustumIsTopBottomSymmetric() are all equal, then no changes are made and true is returned.
See Also
Reference
RhinoViewport Class
ChangeToTwoPointPerspectiveProjection Overload
Rhino.Display Namespace