RhinoCommon API
RenderContent.RenderHashExclude Method (TextureRenderHashFlags, String)
 This method is deprecated in favor of the one that takes CrcRenderHashFlags.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint RenderHashExclude(
	TextureRenderHashFlags flags,
	string excludeParameterNames
)
Public Function RenderHashExclude (
	flags As TextureRenderHashFlags,
	excludeParameterNames As String
) As UInteger
Parameters
flags
Type: Rhino.Render.TextureRenderHashFlags
[Missing <param name="flags"/> documentation for "M:Rhino.Render.RenderContent.RenderHashExclude(Rhino.Render.TextureRenderHashFlags,System.String)"]
excludeParameterNames
Type: System.String
[Missing <param name="excludeParameterNames"/> documentation for "M:Rhino.Render.RenderContent.RenderHashExclude(Rhino.Render.TextureRenderHashFlags,System.String)"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.RenderHashExclude(Rhino.Render.TextureRenderHashFlags,System.String)"]
See Also
Reference
RenderContent Class
RenderHashExclude Overload
Rhino.Render Namespace