RhinoCommon API
RhinoObject.HasHistoryRecord Method
 Returns whether this object has a history record
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool HasHistoryRecord()
Public Function HasHistoryRecord As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.HasHistoryRecord"]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace