RhinoCommon API
ColorRGBA.CreateFromHSV Method
 Constructs the nearest RGBA equivalent of an HSL color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static ColorRGBA CreateFromHSV(
	ColorHSV hsv
)
Public Shared Function CreateFromHSV (
	hsv As ColorHSV
) As ColorRGBA
Parameters
hsv
Type: Rhino.Display.ColorHSV
Target color in HSL space.
Return Value
Type: ColorRGBA
The RGBA equivalent of the HSL color.
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace