RhinoCommon API
RhinoDoc.IsMetricUnitSystem Method
 Determines if a document unit system is a metric unit system.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public bool IsMetricUnitSystem(
	bool modelUnits
)
Public Function IsMetricUnitSystem (
	modelUnits As Boolean
) As Boolean
Parameters
modelUnits
Type: System.Boolean
True to query model units, false to query page units.
Return Value
Type: Boolean
Return true if the length unit is a metric unit system.
See Also
Reference
RhinoDoc Class
Rhino Namespace