RhinoCommon API
SurfaceObject.DuplicateSurfaceGeometry Method
 Constructs a new deep copy of the surface geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Surface DuplicateSurfaceGeometry()
Public Function DuplicateSurfaceGeometry As Surface
Return Value
Type: Surface
The copy of the geometry.
See Also
Reference
SurfaceObject Class
Rhino.DocObjects Namespace