RhinoCommon API
EarthAnchorPoint.EarthLocationIsSet Method
 Checks if the earth location is set or not.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool EarthLocationIsSet()
Public Function EarthLocationIsSet As Boolean
Return Value
Type: Boolean
Boolean value, true if set else false
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace