RhinoCommon API
NurbsCurveFitParameters Constructor (NurbsCurveFitParameters)
 Creates a new instance of the NurbsCurveFitParameters class as a copy of an existing instance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public NurbsCurveFitParameters(
	NurbsCurveFitParameters other
)
Public Sub New (
	other As NurbsCurveFitParameters
)
Parameters
other
Type: Rhino.Geometry.NurbsCurveFitParameters
The instance to copy
Exceptions
Exception | Condition
ArgumentNullException
See Also
Reference
NurbsCurveFitParameters Class
NurbsCurveFitParameters Overload
Rhino.Geometry Namespace