RhinoCommon API
Vector3f.Multiply Method (Vector3f, Vector3f)
 Multiplies two Vector3f together, returning the dot (internal) product of the two. This is not the cross product.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static double Multiply(
	Vector3f point1,
	Vector3f point2
)
Public Shared Function Multiply (
	point1 As Vector3f,
	point2 As Vector3f
) As Double
Parameters
point1
Type: Rhino.Geometry.Vector3f
The first point.
point2
Type: Rhino.Geometry.Vector3f
The second point.
Return Value
Type: Double
A value that results from the coordinate-wise multiplication of point1 and point2.
See Also
Reference
Vector3f Structure
Multiply Overload
Rhino.Geometry Namespace