RhinoCommon API
Localization.FormatNumber Method (Double, LengthUnit, DistanceDisplayMode, Int32, Boolean)
 Get a string version of a number in a given unit system / display mode.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static string FormatNumber(
	double x,
	LengthUnit units,
	DistanceDisplayMode mode,
	int precision,
	bool appendUnitSystemName
)
Public Shared Function FormatNumber (
	x As Double,
	units As LengthUnit,
	mode As DistanceDisplayMode,
	precision As Integer,
	appendUnitSystemName As Boolean
) As String
Parameters
x
Type: System.Double
The number to format into a string.
units
Type: Rhino.LengthUnit
The length unit for the number.
mode
Type: Rhino.UI.DistanceDisplayMode
How the number should be formatted.
precision
Type: System.Int32
The precision of the number.
appendUnitSystemName
Type: System.Boolean
Adds unit system name to the end of the number.
Return Value
Type: String
The formatted number.
See Also
Reference
Localization Class
FormatNumber Overload
Rhino.UI Namespace