RhinoCommon API
RhinoMath.EpsilonEquals Method (Double, Double, Double)
 Compare two doubles for equality within some "epsilon" range
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public static bool EpsilonEquals(
	double x,
	double y,
	double epsilon
)
Public Shared Function EpsilonEquals (
	x As Double,
	y As Double,
	epsilon As Double
) As Boolean
Parameters
x
Type: System.Double
y
Type: System.Double
epsilon
Type: System.Double
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoMath.EpsilonEquals(System.Double,System.Double,System.Double)"]
See Also
Reference
RhinoMath Class
EpsilonEquals Overload
Rhino Namespace