RhinoCommon API
StdVectorByte.ToArray Method
 Returns the managed counterpart of the unmanaged array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.26
Syntax
public byte[] ToArray()
Public Function ToArray As Byte()
Return Value
Type: Byte[]
The managed array.
See Also
Reference
StdVectorByte Class
Rhino.Runtime.InteropWrappers Namespace