RhinoCommon API
Box.Contains Method (Point3d)
 Determines whether a point is inside this Box, including its boundary. This is the same as calling Contains(point,false). Invalid boxes contain nothing. Invalid points are never contained.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Contains(
	Point3d point
)
Public Function Contains (
	point As Point3d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
Point to test.
Return Value
Type: Boolean
true if the point is in the inside or on the boundary of this Box. false if this Box or the Point are invalid.
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace