RhinoCommon API
InitFrameBufferEventArgs.SetFill Method (Color, Color)
[Missing <summary> documentation for "M:Rhino.Display.InitFrameBufferEventArgs.SetFill(System.Drawing.Color,System.Drawing.Color)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public void SetFill(
	Color top,
	Color bottom
)
Public Sub SetFill (
	top As Color,
	bottom As Color
)
Parameters
top
Type: System.Drawing.Color
[Missing <param name="top"/> documentation for "M:Rhino.Display.InitFrameBufferEventArgs.SetFill(System.Drawing.Color,System.Drawing.Color)"]
bottom
Type: System.Drawing.Color
[Missing <param name="bottom"/> documentation for "M:Rhino.Display.InitFrameBufferEventArgs.SetFill(System.Drawing.Color,System.Drawing.Color)"]
See Also
Reference
InitFrameBufferEventArgs Class
SetFill Overload
Rhino.Display Namespace