RhinoCommon API
RenderPipeline.RenderSize Method (RhinoDoc)
 Get the render size as specified in the ON_3dmRenderSettings. Will automatically return the correct size based on the ActiveView or custom settings.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Size RenderSize(
	RhinoDoc doc
)
Public Shared Function RenderSize (
	doc As RhinoDoc
) As Size
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.RenderPipeline.RenderSize(Rhino.RhinoDoc)"]
Return Value
Type: Size
The render size.
See Also
Reference
RenderPipeline Class
RenderSize Overload
Rhino.Render Namespace