RhinoCommon API
MarkupTable.Delete Method (Int32, Boolean)
 Deletes a markup.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Delete(
	int index,
	bool quiet
)
Public Function Delete (
	index As Integer,
	quiet As Boolean
) As Boolean
Parameters
index
Type: System.Int32
zero based index of markup to delete.
quiet
Type: System.Boolean
 If true, no warning message box appears if a markup is in use.
Return Value
Type: Boolean
 true if successful. false if index is out of range or the markup is referenced by active geometry.
See Also
Reference
MarkupTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace