RhinoCommon API
WorksessionFileModel.AddLayerOverride Method
Adds a copy of a layer override to the end of the list.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void AddLayerOverride(
	WorksessionFileLayerOverride layerOverride
)
Public Sub AddLayerOverride (
	layerOverride As WorksessionFileLayerOverride
)
Parameters
layerOverride
Type: Rhino.FileIO.WorksessionFileLayerOverride
The layer override to copy.
Exceptions
Exception | Condition
ArgumentNullException | If layerOverride is null.
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace