RhinoCommon API
RhinoCore.InvokeInHostContext Method (Action)
 Invokes action in Host context
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void InvokeInHostContext(
	Action action
)
Public Sub InvokeInHostContext (
	action As Action
)
Parameters
action
Type: System.Action
[Missing <param name="action"/> documentation for "M:Rhino.Runtime.InProcess.RhinoCore.InvokeInHostContext(System.Action)"]
See Also
Reference
RhinoCore Class
InvokeInHostContext Overload
Rhino.Runtime.InProcess Namespace