RhinoCommon API
PreviewAppearance.SetRotationType Method
 SetRotationType
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetRotationType(
	IRhRdkPreviewSceneServer_eRotationType type
)
Public Sub SetRotationType (
	type As IRhRdkPreviewSceneServer_eRotationType
)
Parameters
type
Type: Rhino.Render.IRhRdkPreviewSceneServer_eRotationType
[Missing <param name="type"/> documentation for "M:Rhino.Render.PreviewAppearance.SetRotationType(Rhino.Render.IRhRdkPreviewSceneServer_eRotationType)"]
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace