RhinoCommon API
ClassArrayString Constructor
 Initializes a new ClassArrayString instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ClassArrayString()
Public Sub New
See Also
Reference
ClassArrayString Class
Rhino.Runtime.InteropWrappers Namespace