RhinoCommon API
Interpolator Constructor (RhinoList<Double>)
 Copy all the numbers from an existing RhinoList.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Interpolator(
	RhinoList<double> list
)
Public Sub New (
	list As RhinoList(Of Double)
)
Parameters
list
Type: Rhino.Collections.RhinoList<Double>
List to mimic.
See Also
Reference
Interpolator Class
Interpolator Overload
Rhino.Geometry Namespace