RhinoCommon API
FileCsvDocument.TryGetDateTime Method (Int32, Int32, DateTime)
 Retrieves the value of a cell as a date and time, parsed with the invariant culture and RoundtripKind (so ISO 8601 values, including those written by Set(Int32, Int32, DateTime), round-trip).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetDateTime(
	int column,
	int row,
	out DateTime value
)
Public Function TryGetDateTime (
	column As Integer,
	row As Integer,
	<OutAttribute> ByRef value As DateTime
) As Boolean
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.DateTime
The parsed value, or MinValue if the cell does not exist or cannot be parsed.
Return Value
Type: Boolean
true if the cell exists and was parsed; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetDateTime Overload
Rhino.FileIO Namespace