RhinoCommon API
DisplayConduit.SetSelectionFilter Method
 The selection filter will make per-object conduit functions only be called for selected objects (when the filter is turned on)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SetSelectionFilter(
	bool on,
	bool checkSubObjects
)
Public Sub SetSelectionFilter (
	on As Boolean,
	checkSubObjects As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.DisplayConduit.SetSelectionFilter(System.Boolean,System.Boolean)"]
checkSubObjects
Type: System.Boolean
[Missing <param name="checkSubObjects"/> documentation for "M:Rhino.Display.DisplayConduit.SetSelectionFilter(System.Boolean,System.Boolean)"]
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace