RhinoCommon API
NurbsCurveFitParameters.Clone Method
 Supports the ICloneable inteface and creates a new NurbsCurveFitParameters object with the same property values as this instance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Object Clone()
Public Function Clone As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.Clone"]
Implements
ICloneable.Clone()
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace