RhinoCommon API
GumballSettings.UpdateFromState Method
 Sets all settings to a particular defined joined state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void UpdateFromState(
	GumballSettingsState state
)
Public Shared Sub UpdateFromState (
	state As GumballSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.GumballSettingsState
The particular state.
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace