RhinoCommon API
NurbsCurvePointList.MakeNonRational Method
 Converts the curve to a Non-rational NURBS curve. Non-rational curves have unweighted control points.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool MakeNonRational()
Public Function MakeNonRational As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace