RhinoCommon API
MeshVertexNormalList.Destroy Method
 Releases all memory allocated to store vertex normals. The list capacity will be 0 after this call.
Subsequent calls can add new items.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Destroy()
Public Sub Destroy
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace