RhinoCommon API
SimulatedTexture.Texture Method
[Missing <summary> documentation for "M:Rhino.Render.SimulatedTexture.Texture"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Texture Texture()
Public Function Texture As Texture
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.Render.SimulatedTexture.Texture"]
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace