RhinoCommon API
SubDSurfaceInterpolator.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SubDSurfaceInterpolator Class
Dispose Overload
Rhino.Geometry Namespace