RhinoCommon API
LicenseLeaseChangedEventArgs.Finalize Method
[Missing <summary> documentation for "M:Rhino.PlugIns.LicenseLeaseChangedEventArgs.Finalize"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
LicenseLeaseChangedEventArgs Class
Rhino.PlugIns Namespace