RhinoCommon API
DisplayPipeline.DrawEmapPreview Method (Mesh, Color)
 Draws a Mesh in Environment Map preview.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void DrawEmapPreview(
	Mesh mesh,
	Color color
)
Public Sub DrawEmapPreview (
	mesh As Mesh,
	color As Color
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to draw.
color
Type: System.Drawing.Color
Objct color.
See Also
Reference
DisplayPipeline Class
DrawEmapPreview Overload
Rhino.Display Namespace