RhinoCommon API
UserInterfaceObjectBase.OnMouseDoubleClick Method
 Called during a mouse double click event on this object
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnMouseDoubleClick(
	MouseState mouse
)
Protected Overridable Sub OnMouseDoubleClick (
	mouse As MouseState
)
Parameters
mouse
Type: Rhino.UI.MouseState
[Missing <param name="mouse"/> documentation for "M:Rhino.UI.UserInterfaceObjectBase.OnMouseDoubleClick(Rhino.UI.MouseState)"]
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace