RhinoCommon API
CommonObject.OnSwitchToNonConst Method
 Is called when a non-constant operation first occurs.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnSwitchToNonConst()
Protected Overridable Sub OnSwitchToNonConst
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace