RhinoCommon API
ChangeQueue.CreateWorld Method (Boolean)
 Signal the queue to do the initialisation of the queue, seeding it with the content currently available.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void CreateWorld(
	bool bFlushWhenReady
)
Public Sub CreateWorld (
	bFlushWhenReady As Boolean
)
Parameters
bFlushWhenReady
Type: System.Boolean
Set to true CreateWorld should automatically flush at the end. Note that the Flush called when true is passed doesn't apply changes.
See Also
Reference
ChangeQueue Class
CreateWorld Overload
Rhino.Render.ChangeQueue Namespace