RhinoCommon API
DisplayPipeline.DrawPolyline Method (IEnumerable<Point3d>, Color)
 Draws a single Polyline object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DrawPolyline(
	IEnumerable<Point3d> polyline,
	Color color
)
Public Sub DrawPolyline (
	polyline As IEnumerable(Of Point3d),
	color As Color
)
Parameters
polyline
Type: System.Collections.Generic.IEnumerable<Point3d>
Polyline to draw.
color
Type: System.Drawing.Color
Color to draw in.
See Also
Reference
DisplayPipeline Class
DrawPolyline Overload
Rhino.Display Namespace