RhinoCommon API
FileXamlWriteOptions Constructor
Initializes a new instance of the FileXamlWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileXamlWriteOptions()
Public Sub New
See Also
Reference
FileXamlWriteOptions Class
Rhino.FileIO Namespace