RhinoCommon API
StringWrapper.GetStringFromPointer Method
 Get string from an ON_wString*
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string GetStringFromPointer(
	IntPtr pConstON_wString
)
Public Shared Function GetStringFromPointer (
	pConstON_wString As IntPtr
) As String
Parameters
pConstON_wString
Type: System.IntPtr
[Missing <param name="pConstON_wString"/> documentation for "M:Rhino.Runtime.InteropWrappers.StringWrapper.GetStringFromPointer(System.IntPtr)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.InteropWrappers.StringWrapper.GetStringFromPointer(System.IntPtr)"]
See Also
Reference
StringWrapper Class
Rhino.Runtime.InteropWrappers Namespace