RhinoCommon API
FileObjReadOptions.GetTransform Method
 Calculates the YToZ transform.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Transform GetTransform()
Public Function GetTransform As Transform
Return Value
Type: Transform
[Missing <returns> documentation for "M:Rhino.FileIO.FileObjReadOptions.GetTransform"]
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace