RhinoCommon API
RenderContent.UngroupRecursive Method
 Remove this content and all its children from any instance groups they may be a member of. Does not record undo but does send the OnContentGroupIdChanged event.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.26
Syntax
public bool UngroupRecursive()
Public Function UngroupRecursive As Boolean
Return Value
Type: Boolean
true if a content was ungrouped, \e false if no content or child was part of a group.
See Also
Reference
RenderContent Class
Rhino.Render Namespace