RhinoCommon API
ChooseOneObjectSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static ChooseOneObjectSettingsState GetCurrentState()
Public Shared Function GetCurrentState As ChooseOneObjectSettingsState
Return Value
Type: ChooseOneObjectSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.ChooseOneObjectSettings.GetCurrentState"]
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace