RhinoCommon API
Notification.RemoveMetadata Method
 Removes metadata from this instance.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool RemoveMetadata(
	string key
)
Public Function RemoveMetadata (
	key As String
) As Boolean
Parameters
key
Type: System.String
The key of the metadata to remove.
Return Value
Type: Boolean
true if the metada was removed; otherwise false.
Exceptions
Exception | Condition
InvalidOperationException | Thrown if the calling assembly cannot modify this instance
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace