RhinoCommon API
PersistentSettings.TryGetDouble Method (String, Double)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetDouble(System.String,System.Double@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetDouble(
	string key,
	out double value
)
Public Function TryGetDouble (
	key As String,
	<OutAttribute> ByRef value As Double
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetDouble(System.String,System.Double@)"]
value
Type: System.Double
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetDouble(System.String,System.Double@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetDouble(System.String,System.Double@)"]
See Also
Reference
PersistentSettings Class
TryGetDouble Overload
Rhino Namespace