RhinoCommon API
Brep.FilletSurfaceSettings.CreateNonRationalSettings Method
 Create settings for non-rational approximated arc fillet surfaces
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Brep.FilletSurfaceSettings CreateNonRationalSettings(
	double radius,
	double tolerance,
	int degree,
	double tanSlider,
	double innerSlider,
	bool trim,
	bool extend
)
Public Shared Function CreateNonRationalSettings (
	radius As Double,
	tolerance As Double,
	degree As Integer,
	tanSlider As Double,
	innerSlider As Double,
	trim As Boolean,
	extend As Boolean
) As Brep.FilletSurfaceSettings
Parameters
radius
Type: System.Double
The fillet radius.
tolerance
Type: System.Double
The tolerance. When in doubt, use the document's model absolute tolerance.
degree
Type: System.Int32
Degree of the arc approxiation (3, 4, or 5)
tanSlider
Type: System.Double
A number between -0.95 and 0.95 indicating how far to push the tangent control points toward or away from the theoretical middle control point(s)
innerSlider
Type: System.Double
A number between -0.95 and 0.95 indicating how far to push the inner control point toward or away from the theoretical middle control point
trim
Type: System.Boolean
If true, the input faces will be trimmed, if false, the input faces will be split.
extend
Type: System.Boolean
If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
Return Value
Type: Brep.FilletSurfaceSettings
[Missing <returns> documentation for "M:Rhino.Geometry.Brep.FilletSurfaceSettings.CreateNonRationalSettings(System.Double,System.Double,System.Int32,System.Double,System.Double,System.Boolean,System.Boolean)"]
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace