RhinoCommon API
VisualAnalysisMode.DrawSubDObject Method
 Draws one SubD. Override this method to add your custom behavior.
The default implementation does nothing.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void DrawSubDObject(
	SubDObject subd,
	DisplayPipeline pipeline
)
Protected Overridable Sub DrawSubDObject (
	subd As SubDObject,
	pipeline As DisplayPipeline
)
Parameters
subd
Type: Rhino.DocObjects.SubDObject
A SubD object.
pipeline
Type: Rhino.Display.DisplayPipeline
The current display pipeline.
Remarks
 The default ObjectSupportsAnalysisMode(RhinoObject) does not accept SubD objects, so a mode that wants them must override that as well and return true for them.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace