RhinoCommon API
CustomGripObject.EvaluateCurveParameter Method
 The curve parameter of the control point this grip drives.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool EvaluateCurveParameter(
	out double t
)
Protected Overridable Function EvaluateCurveParameter (
	<OutAttribute> ByRef t As Double
) As Boolean
Parameters
t
Type: System.Double
The curve parameter.
Return Value
Type: Boolean
true on success. The default implementation returns false.
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace