RhinoCommon API
Point3f.Addition Operator
 Adds a point to another point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point3f operator +(
	Point3f point1,
	Point3f point2
)
Public Shared Operator + (
	point1 As Point3f,
	point2 As Point3f
) As Point3f
Parameters
point1
Type: Rhino.Geometry.Point3f
A point.
point2
Type: Rhino.Geometry.Point3f
Another point.
Return Value
Type: Point3f
A new vector that is the sum of point1 plus point2.
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace