RhinoCommon API
LayerTable.Duplicate Method (Int32, Boolean, Boolean)
 Duplicates, or copies, a layer. Duplicated layers are added to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public int[] Duplicate(
	int layerIndex,
	bool duplicateObjects,
	bool duplicateSublayers
)
Public Function Duplicate (
	layerIndex As Integer,
	duplicateObjects As Boolean,
	duplicateSublayers As Boolean
) As Integer()
Parameters
layerIndex
Type: System.Int32
The index of the layer to duplicate.
duplicateObjects
Type: System.Boolean
If true, then layer objects will also be duplicated and added to the document.
duplicateSublayers
Type: System.Boolean
If true, then all sub-layers of the layer will be duplicated.
Return Value
Type: Int32[]
The indices of the newly added layers if successful, an empty array on failure.
See Also
Reference
LayerTable Class
Duplicate Overload
Rhino.DocObjects.Tables Namespace