RhinoCommon API
RhinoDoc.SelectRenderContentInEditor Method
 Selects a collection of contents in any editors they appear in.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.20
Syntax
public void SelectRenderContentInEditor(
	RenderContentCollection collection,
	bool append
)
Public Sub SelectRenderContentInEditor (
	collection As RenderContentCollection,
	append As Boolean
)
Parameters
collection
Type: Rhino.Render.RenderContentCollection
A collection of RenderContents to select
append
Type: System.Boolean
Append to current selection
See Also
Reference
RhinoDoc Class
Rhino Namespace