RhinoCommon API
SubDEdgeSharpness.Union Method
 Gets the union of two sharpness ranges, ignoring the ones that are zero, a crease, or not valid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static SubDEdgeSharpness Union(
	SubDEdgeSharpness sharpness0,
	SubDEdgeSharpness sharpness1
)
Public Shared Function Union (
	sharpness0 As SubDEdgeSharpness,
	sharpness1 As SubDEdgeSharpness
) As SubDEdgeSharpness
Parameters
sharpness0
Type: Rhino.Geometry.SubDEdgeSharpness
The first sharpness.
sharpness1
Type: Rhino.Geometry.SubDEdgeSharpness
The second sharpness.
Return Value
Type: SubDEdgeSharpness
 The union of the nonzero valid inputs, or Smooth if there are none.
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace