RhinoCommon API
NodeInCodeTable.GetDynamicMembers Method
 Returns component info for all additional names in the table.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IEnumerable<ComponentFunctionInfo> GetDynamicMembers()
Public Function GetDynamicMembers As IEnumerable(Of ComponentFunctionInfo)
Return Value
Type: IEnumerable<ComponentFunctionInfo>
[Missing <returns> documentation for "M:Rhino.NodeInCode.NodeInCodeTable.GetDynamicMembers"]
See Also
Reference
NodeInCodeTable Class
Rhino.NodeInCode Namespace