RhinoCommon API
IHeaderButtonHandler.ButtonRect Method
 Implement this method to get the rectangle of a button on the header window.
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
Rectangle ButtonRect(
	int index,
	Rectangle rectHeader
)
Function ButtonRect (
	index As Integer,
	rectHeader As Rectangle
) As Rectangle
Parameters
index
Type: System.Int32
index is the index of the button.
rectHeader
Type: System.Drawing.Rectangle
rectHeader is the usable area of the header where the buttons can be placed.
Return Value
Type: Rectangle
The rectangle of the button.
See Also
Reference
IHeaderButtonHandler Interface
Rhino.UI.Controls Namespace