RhinoCommon API
Plane.CreateFromNormalYup Method
 Construct a plane from a point, a normal vector, and a vector that projects to the positive YAxis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Plane CreateFromNormalYup(
	Point3d origin,
	Vector3d normal,
	Vector3d yDirection
)
Public Shared Function CreateFromNormalYup (
	origin As Point3d,
	normal As Vector3d,
	yDirection As Vector3d
) As Plane
Parameters
origin
Type: Rhino.Geometry.Point3d
Point on the plane.
normal
Type: Rhino.Geometry.Vector3d
Non-zero normal to the plane.
yDirection
Type: Rhino.Geometry.Vector3d
Non-zero vector, linearly independent from normal, that projects to the positive YAxis of the plane.
Return Value
Type: Plane
A valid plane if successful, or Plane.Unset on failure.
See Also
Reference
Plane Structure
Rhino.Geometry Namespace