RhinoCommon API
MeshNgon.Equality Operator
 Determines whether two MeshNgon structures have equal values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool operator ==(
	MeshNgon a,
	MeshNgon b
)
Public Shared Operator = (
	a As MeshNgon,
	b As MeshNgon
) As Boolean
Parameters
a
Type: Rhino.Geometry.MeshNgon
The first MeshNgon.
b
Type: Rhino.Geometry.MeshNgon
The second MeshNgon.
Return Value
Type: Boolean
true if the vertex and face index lists are identical; otherwise false.
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace