RhinoCommon API
RTree.SearchOverlaps Method (Double, EventHandler<RTreeEventArgs>, Object)
 Searches for pairs of bounding boxes that overlap.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SearchOverlaps(
	double tolerance,
	EventHandler<RTreeEventArgs> callback,
	Object tag
)
Public Function SearchOverlaps (
	tolerance As Double,
	callback As EventHandler(Of RTreeEventArgs),
	tag As Object
) As Boolean
Parameters
tolerance
Type: System.Double
bounds used for searching.
callback
Type: System.EventHandler<RTreeEventArgs>
An event handler to be raised when items are found.
tag
Type: System.Object
State to be passed inside the RTreeEventArgs Tag property.
Return Value
Type: Boolean
 true if entire tree was searched. It is possible no results were found.
Remarks
 Do not modify the tree while a Search() is in progress. Doing so can have unintended consequences, including corruption and crashes.If you need to modify the tree, collect the results during the search and modify the tree once the search is completed.
See Also
Reference
RTree Class
SearchOverlaps Overload
Rhino.Geometry Namespace