RhinoCommon API
GetPoint.ClearSnapPoints Method
 Remove all snap points.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void ClearSnapPoints()
Public Sub ClearSnapPoints
Remarks
 When point osnap is enabled, GetPoint will snap to points in the Rhino model. If you want the user to be able to snap to additional points, then use GetPoint::AddSnapPoints to specify the locations of these additional points.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace