RhinoCommon API
ArchivableDictionary.RemoveEnumValue<T> Method
 Remove an enum value from the dictionary.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public bool RemoveEnumValue<T>()
where T : struct, new(), IConvertible
Public Function RemoveEnumValue(Of T As {Structure, New, IConvertible}) As Boolean
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.Collections.ArchivableDictionary.RemoveEnumValue``1"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.RemoveEnumValue``1"]
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace