RhinoCommon API
ContentUI.IsShown Method
 Returns true if the UI is being shown, else false
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public virtual bool IsShown()
Public Overridable Function IsShown As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.ContentUI.IsShown"]
See Also
Reference
ContentUI Class
Rhino.UI.Controls Namespace