RhinoCommon API
IRhinoDocObserver.ActiveRhinoDocChanged Method
 In Windows Rhino this will mean a new document has been created or opened. In Mac Rhino this can mean the same thing as well it can indicate switching from one active open document to another.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void ActiveRhinoDocChanged(
	RhinoDocObserverArgs e
)
Sub ActiveRhinoDocChanged (
	e As RhinoDocObserverArgs
)
Parameters
e
Type: Rhino.RhinoDocObserverArgs
[Missing <param name="e"/> documentation for "M:Rhino.IRhinoDocObserver.ActiveRhinoDocChanged(Rhino.RhinoDocObserverArgs)"]
See Also
Reference
IRhinoDocObserver Interface
Rhino Namespace