RhinoCommon API
PageViewGroupTable.Add Method (IEnumerable<RhinoPageView>)
 Adds a new page view group to the table, and adds page views to the group. The new page view group will be given a unique name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Add(
	IEnumerable<RhinoPageView> groupMembers
)
Public Function Add (
	groupMembers As IEnumerable(Of RhinoPageView)
) As Integer
Parameters
groupMembers
Type: System.Collections.Generic.IEnumerable<RhinoPageView>
An enumeration of page views.
Return Value
Type: Int32
Index of new page view group if successful, -1 otherwise.
See Also
Reference
PageViewGroupTable Class
Add Overload
Rhino.DocObjects.Tables Namespace