RhinoCommon API
WorldMapDayNight.Map Method
[Missing <summary> documentation for "M:Rhino.Render.UI.WorldMapDayNight.Map"]
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Image Map()
Public Function Map As Image
Return Value
Type: Image
[Missing <returns> documentation for "M:Rhino.Render.UI.WorldMapDayNight.Map"]
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace