RhinoCommon API
WorksessionFileLayerOverride.SetFileValues Method
Replaces the file values with a copy of values.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetFileValues(
	WorksessionFileLayerValues values
)
Public Sub SetFileValues (
	values As WorksessionFileLayerValues
)
Parameters
values
Type: Rhino.FileIO.WorksessionFileLayerValues
The settings to copy.
Exceptions
Exception | Condition
ArgumentNullException | If values is null.
See Also
Reference
WorksessionFileLayerOverride Class
Rhino.FileIO Namespace