RhinoCommon API
SubDComponent.Equals Method (SubDComponent)
 Determines whether this component and another refer to the same component, with the same orientation, in the same SubD.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool Equals(
	SubDComponent other
)
Public Function Equals (
	other As SubDComponent
) As Boolean
Parameters
other
Type: Rhino.Geometry.SubDComponent
The component to compare with.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDComponent.Equals(Rhino.Geometry.SubDComponent)"]
Implements
IEquatable<T>.Equals(T)
See Also
Reference
SubDComponent Class
Equals Overload
Rhino.Geometry Namespace