RhinoCommon API
BinaryArchiveReader.ReadDouble Method
 Reads a Double from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ReadDouble()
Public Function ReadDouble As Double
Return Value
Type: Double
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace