RhinoCommon API
SuspendCollectionChangedNotifications<T> Constructor
 Constructor. Notifications will be suspended until this object is disposed.
 Namespace: Rhino.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SuspendCollectionChangedNotifications(
	TrulyObservableOrderedSet<T> set,
	bool fireOnResume = true
)
Public Sub New (
	set As TrulyObservableOrderedSet(Of T),
	Optional fireOnResume As Boolean = true
)
Parameters
set
Type: Rhino.Runtime.Notifications.TrulyObservableOrderedSet<T>
The collection to suspend notifications for
fireOnResume (Optional)
Type: System.Boolean
If true (=default), upon resuming notifications one Reset event will be fired if the collection was modified during the suspension.
See Also
Reference
SuspendCollectionChangedNotifications<T> Class
Rhino.Notifications Namespace