RhinoCommon API
FilePdf.PdfDocumentImplementation Method
 Get actual implementation of PdfDocument class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract Object PdfDocumentImplementation()
Public MustOverride Function PdfDocumentImplementation As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.FileIO.FilePdf.PdfDocumentImplementation"]
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace