RhinoCommon API
RenderWindow.ChannelGPU.Height Method
 Return the channel height.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int Height()
Public Function Height As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.Height"]
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace