RhinoCommon API
LinetypeTable.LoadDefaultLinetypes Method (Boolean)
 Fills in the linetype table with any default linetypes not already included.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int LoadDefaultLinetypes(
	bool ignoreDeleted
)
Public Function LoadDefaultLinetypes (
	ignoreDeleted As Boolean
) As Integer
Parameters
ignoreDeleted
Type: System.Boolean
Ignore default linetypes that have been deleted.
Return Value
Type: Int32
The number of default linetypes added to the linetype table.
Remarks
 New documents only contain the continuous linetype. Other default linetypes are added, on demand, when the user needs them. Calling this function ensures that the linetype table is populated with the default linetypes.
See Also
Reference
LinetypeTable Class
LoadDefaultLinetypes Overload
Rhino.DocObjects.Tables Namespace