RhinoCommon API
SupportOptions.Libraries_SetInitialLocation Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.Libraries_SetInitialLocation(Rhino.Render.SupportOptions.RdkInitialLocation)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void Libraries_SetInitialLocation(
	SupportOptions.RdkInitialLocation l
)
Public Shared Sub Libraries_SetInitialLocation (
	l As SupportOptions.RdkInitialLocation
)
Parameters
l
Type: Rhino.Render.SupportOptions.RdkInitialLocation
[Missing <param name="l"/> documentation for "M:Rhino.Render.SupportOptions.Libraries_SetInitialLocation(Rhino.Render.SupportOptions.RdkInitialLocation)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace