RhinoCommon API
RealtimeDisplayMode.RegisterDisplayModes Method (PlugIn)
 Find and register classes that derive from RealtimeDisplayMode from the given plug-in.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RealtimeDisplayModeClassInfo[] RegisterDisplayModes(
	PlugIn plugin
)
Public Shared Function RegisterDisplayModes (
	plugin As PlugIn
) As RealtimeDisplayModeClassInfo()
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.RegisterDisplayModes(Rhino.PlugIns.PlugIn)"]
Return Value
Type: RealtimeDisplayModeClassInfo[]
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.RegisterDisplayModes(Rhino.PlugIns.PlugIn)"]
See Also
Reference
RealtimeDisplayMode Class
RegisterDisplayModes Overload
Rhino.Render Namespace