RhinoCommon API
LengthMassProperties.Compute Method (IEnumerable<Curve>)
 Calculates the length mass properties of an enumeration of curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public static LengthMassProperties Compute(
	IEnumerable<Curve> curves
)
Public Shared Function Compute (
	curves As IEnumerable(Of Curve)
) As LengthMassProperties
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
[Missing <param name="curves"/> documentation for "M:Rhino.Geometry.LengthMassProperties.Compute(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})"]
Return Value
Type: LengthMassProperties
The LengthMassProperties for the given enumeration of curves, or null on failure.
See Also
Reference
LengthMassProperties Class
Compute Overload
Rhino.Geometry Namespace