RhinoCommon API
DimStyleTable.FindRoot Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.FindRoot(System.Guid,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle FindRoot(
	Guid styleId,
	bool ignoreDeleted
)
Public Function FindRoot (
	styleId As Guid,
	ignoreDeleted As Boolean
) As DimensionStyle
Parameters
styleId
Type: System.Guid
[Missing <param name="styleId"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.FindRoot(System.Guid,System.Boolean)"]
ignoreDeleted
Type: System.Boolean
[Missing <param name="ignoreDeleted"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.FindRoot(System.Guid,System.Boolean)"]
Return Value
Type: DimensionStyle
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.FindRoot(System.Guid,System.Boolean)"]
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace