RhinoCommon API
Vector3d.Multiply Operator (Vector3d, Double)
 Multiplies a vector by a number, having the effect of scaling it.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector3d operator *(
	Vector3d vector,
	double t
)
Public Shared Operator * (
	vector As Vector3d,
	t As Double
) As Vector3d
Parameters
vector
Type: Rhino.Geometry.Vector3d
A vector.
t
Type: System.Double
A number.
Return Value
Type: Vector3d
A new vector that is the original vector coordinate-wise multiplied by t.
See Also
Reference
Vector3d Structure
Multiply Overload
Rhino.Geometry Namespace