RhinoCommon API
Skin.OnEndLoadAtStartPlugIns Method
Is called after all of the load at start plug-ins have been loaded.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnEndLoadAtStartPlugIns()
Protected Overridable Sub OnEndLoadAtStartPlugIns
See Also
Reference
Skin Class
Rhino.Runtime Namespace