RhinoCommon API
SupportOptions.SetCustomPaths Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetCustomPaths(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_SetCustomPathList' instead")]
public static void SetCustomPaths(
	string path
)
<ObsoleteAttribute("Use 'Libraries_SetCustomPathList' instead")>
Public Shared Sub SetCustomPaths (
	path As String
)
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.Render.SupportOptions.SetCustomPaths(System.String)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace