RhinoCommon API
LightManagerSupport.SetLightSolo Method
 First checks to see if we are in "solo mode" - which means that there are any lights that respond "true" to IsInSoloStorage. If in solo mode: If bSolo = true Sets this light on. If bSolo = false If this is the last light "on", forces all lights out of solo mode. If there are other lights on, turns this light off. If not in solo mode: If bSolo = true Forces all lights into solo storage and sets this light on. If bSolo = false This shouldn't happen. Will cause an ASSERT
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool SetLightSolo(
	RhinoDoc doc,
	Guid uuid_light,
	bool bSolo
)
Public Overridable Function SetLightSolo (
	doc As RhinoDoc,
	uuid_light As Guid,
	bSolo As Boolean
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.LightManagerSupport.SetLightSolo(Rhino.RhinoDoc,System.Guid,System.Boolean)"]
uuid_light
Type: System.Guid
[Missing <param name="uuid_light"/> documentation for "M:Rhino.Render.LightManagerSupport.SetLightSolo(Rhino.RhinoDoc,System.Guid,System.Boolean)"]
bSolo
Type: System.Boolean
[Missing <param name="bSolo"/> documentation for "M:Rhino.Render.LightManagerSupport.SetLightSolo(Rhino.RhinoDoc,System.Guid,System.Boolean)"]
Return Value
Type: Boolean
Returns true if action is successful
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace