RhinoCommon API
ObjRef Constructor (ObjRef)
 Copy constructor
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public ObjRef(
	ObjRef other
)
Public Sub New (
	other As ObjRef
)
Parameters
other
Type: Rhino.DocObjects.ObjRef
[Missing <param name="other"/> documentation for "M:Rhino.DocObjects.ObjRef.#ctor(Rhino.DocObjects.ObjRef)"]
See Also
Reference
ObjRef Class
ObjRef Overload
Rhino.DocObjects Namespace