RhinoCommon API
RhinoDoc.ExportSelected Method (String)
 Export selected geometry to a file. All file formats that Rhino can export to are supported by this function.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool ExportSelected(
	string filePath
)
Public Function ExportSelected (
	filePath As String
) As Boolean
Parameters
filePath
Type: System.String
[Missing <param name="filePath"/> documentation for "M:Rhino.RhinoDoc.ExportSelected(System.String)"]
Return Value
Type: Boolean
true on success
See Also
Reference
RhinoDoc Class
ExportSelected Overload
Rhino Namespace