RhinoCommon API
PageViewGroupTable.FindName Method
 Finds a page view group given its name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PageViewGroup FindName(
	string name
)
Public Function FindName (
	name As String
) As PageViewGroup
Parameters
name
Type: System.String
The name of the page view group.
Return Value
Type: PageViewGroup
An page view group, or null if not found or on error.
See Also
Reference
PageViewGroupTable Class
Rhino.DocObjects.Tables Namespace