RhinoCommon API
SurfaceCurvature Constructor
 Default constructs a new surface curvature object. Both kappa1 and kappa2 are zero.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SurfaceCurvature()
Public Sub New
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace