RhinoCommon API
UserInterfaceGrid Constructor (Int32)
Initializes a new instance of the UserInterfaceGrid class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceGrid(
	int columnCount
)
Public Sub New (
	columnCount As Integer
)
Parameters
columnCount
Type: System.Int32
[Missing <param name="columnCount"/> documentation for "M:Rhino.UI.UserInterfaceGrid.#ctor(System.Int32)"]
See Also
Reference
UserInterfaceGrid Class
UserInterfaceGrid Overload
Rhino.UI Namespace