RhinoCommon API
MaterialTable.FindIndex Method
 Retrieves a Material object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Material FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As Material
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: Material
A Material object, or null if none was found.
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace