RhinoCommon API
MeshVertexStatusList.CopyTo Method
 Copies to an array, starting at an index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void CopyTo(
	bool[] array,
	int arrayIndex
)
Public Sub CopyTo (
	array As Boolean(),
	arrayIndex As Integer
)
Parameters
array
Type: System.Boolean[]
The array to be copied into.
arrayIndex
Type: System.Int32
The starting index in the array.
Implements
ICollection<T>.CopyTo(T[], Int32)
See Also
Reference
MeshVertexStatusList Class
Rhino.Geometry.Collections Namespace