RhinoCommon API
RhinoList<T>.FindIndex Method (Int32, Int32, Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the first occurrence within the range of elements in the List that extends from the specified index to the last element.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FindIndex(
	int startIndex,
	int count,
	Predicate<T> match
)
Public Function FindIndex (
	startIndex As Integer,
	count As Integer,
	match As Predicate(Of T)
) As Integer
Parameters
startIndex
Type: System.Int32
The zero-based starting index of the search.
count
Type: System.Int32
The number of elements in the section to search.
match
Type: System.Predicate<T>
The Predicate(T) delegate that defines the conditions of the element to search for.
Return Value
Type: Int32
The zero-based index of the first occurrence of an element that matches the conditions defined by match, if found; otherwise, -1.
See Also
Reference
RhinoList<T> Class
FindIndex Overload
Rhino.Collections Namespace