RhinoCommon API
WorldMapDayNight.MakeMapBitmap Method
[Missing <summary> documentation for "M:Rhino.Render.UI.WorldMapDayNight.MakeMapBitmap"]
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void MakeMapBitmap()
Public Sub MakeMapBitmap
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace