RhinoCommon API
RenderMaterial.HandleTexturedValue<T> Method
 Handle a textured content field. Values will be read into an instance of TexturedColor
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public bool HandleTexturedValue<T>(
	string slotname,
	TexturedValue<T> tc
)
Public Function HandleTexturedValue(Of T) (
	slotname As String,
	tc As TexturedValue(Of T)
) As Boolean
Parameters
slotname
Type: System.String
[Missing <param name="slotname"/> documentation for "M:Rhino.Render.RenderMaterial.HandleTexturedValue``1(System.String,Rhino.Render.TexturedValue{``0})"]
tc
Type: Rhino.Render.TexturedValue<T>
[Missing <param name="tc"/> documentation for "M:Rhino.Render.RenderMaterial.HandleTexturedValue``1(System.String,Rhino.Render.TexturedValue{``0})"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.Render.RenderMaterial.HandleTexturedValue``1(System.String,Rhino.Render.TexturedValue{``0})"]
Return Value
Type: Boolean
true if reading the base value succeeded
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace