RhinoCommon API
SupportOptions.FileExplorer_InitialLocationCustomFolder Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.FileExplorer_InitialLocationCustomFolder"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string FileExplorer_InitialLocationCustomFolder()
Public Shared Function FileExplorer_InitialLocationCustomFolder As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.FileExplorer_InitialLocationCustomFolder"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace