RhinoCommon API
DisplayPipelineAttributes.GetSurfaceIsoApplyPattern Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipelineAttributes.GetSurfaceIsoApplyPattern(System.Boolean@,System.Boolean@,System.Boolean@)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public void GetSurfaceIsoApplyPattern(
	out bool u,
	out bool v,
	out bool w
)
Public Sub GetSurfaceIsoApplyPattern (
	<OutAttribute> ByRef u As Boolean,
	<OutAttribute> ByRef v As Boolean,
	<OutAttribute> ByRef w As Boolean
)
Parameters
u
Type: System.Boolean
Gets mode in the u direction
v
Type: System.Boolean
Gets mode in the v direction
w
Type: System.Boolean
Gets mode in the w direction
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace