RhinoCommon API
WorksessionFileModel.SetParentLayerValues Method
Replaces the parent layer settings with a copy of values.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetParentLayerValues(
	WorksessionFileLayerValues values
)
Public Sub SetParentLayerValues (
	values As WorksessionFileLayerValues
)
Parameters
values
Type: Rhino.FileIO.WorksessionFileLayerValues
The settings to copy.
Exceptions
Exception | Condition
ArgumentNullException | If values is null.
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace