RhinoCommon API
TextDotUserInterfaceObject Constructor
 Create a text dot styled user interface object at a defined location and text
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public TextDotUserInterfaceObject(
	Point3d location,
	string text
)
Public Sub New (
	location As Point3d,
	text As String
)
Parameters
location
Type: Rhino.Geometry.Point3d
Location of object
text
Type: System.String
Text content for dot
See Also
Reference
TextDotUserInterfaceObject Class
Rhino.UI Namespace