RhinoCommon API
DimStyleTable.PurgeUnused Method
 Purges any unused dimension styles.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PurgeUnused()
Public Function PurgeUnused As Integer
Return Value
Type: Int32
The number of unused dimension styles that were purged.
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace