RhinoCommon API
SurfaceCurvature.Equals Method (Object)
 Indicates whether the current object is equal to another object of the same type.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public override bool Equals(
	Object other
)
Public Overrides Function Equals (
	other As Object
) As Boolean
Parameters
other
Type: System.Object
 An object to compare with this object.
Return Value
Type: Boolean
true if the current object is equal to the other parameter; otherwise, false.
See Also
Reference
SurfaceCurvature Class
Equals Overload
Rhino.Geometry Namespace