RhinoCommon API
PreviewJobSignature Constructor (Int32, Int32, UInt32)
Note: This API is now obsolete.
 Preview Job Signature constructor
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
[ObsoleteAttribute]
public PreviewJobSignature(
	int width,
	int height,
	uint sig
)
<ObsoleteAttribute>
Public Sub New (
	width As Integer,
	height As Integer,
	sig As UInteger
)
Parameters
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.Render.PreviewJobSignature.#ctor(System.Int32,System.Int32,System.UInt32)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.Render.PreviewJobSignature.#ctor(System.Int32,System.Int32,System.UInt32)"]
sig
Type: System.UInt32
[Missing <param name="sig"/> documentation for "M:Rhino.Render.PreviewJobSignature.#ctor(System.Int32,System.Int32,System.UInt32)"]
See Also
Reference
PreviewJobSignature Class
PreviewJobSignature Overload
Rhino.Render Namespace