RhinoCommon API
RenderContent.GetUnderlyingInstances Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.GetUnderlyingInstances(Rhino.Render.RenderContentCollection)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool GetUnderlyingInstances(
	RenderContentCollection collection
)
Public Function GetUnderlyingInstances (
	collection As RenderContentCollection
) As Boolean
Parameters
collection
Type: Rhino.Render.RenderContentCollection
[Missing <param name="collection"/> documentation for "M:Rhino.Render.RenderContent.GetUnderlyingInstances(Rhino.Render.RenderContentCollection)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.GetUnderlyingInstances(Rhino.Render.RenderContentCollection)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace