RhinoCommon API
IPanel.PanelHidden Method
[Missing <summary> documentation for "M:Rhino.UI.IPanel.PanelHidden(System.UInt32,Rhino.UI.ShowPanelReason)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void PanelHidden(
	uint documentSerialNumber,
	ShowPanelReason reason
)
Sub PanelHidden (
	documentSerialNumber As UInteger,
	reason As ShowPanelReason
)
Parameters
documentSerialNumber
Type: System.UInt32
[Missing <param name="documentSerialNumber"/> documentation for "M:Rhino.UI.IPanel.PanelHidden(System.UInt32,Rhino.UI.ShowPanelReason)"]
reason
Type: Rhino.UI.ShowPanelReason
[Missing <param name="reason"/> documentation for "M:Rhino.UI.IPanel.PanelHidden(System.UInt32,Rhino.UI.ShowPanelReason)"]
See Also
Reference
IPanel Interface
Rhino.UI Namespace