RhinoCommon API
LicenseUtils.ShowBuyLicenseUi Method
[Missing <summary> documentation for "M:Rhino.PlugIns.LicenseUtils.ShowBuyLicenseUi(System.Guid)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.5
Syntax
public static void ShowBuyLicenseUi(
	Guid productId
)
Public Shared Sub ShowBuyLicenseUi (
	productId As Guid
)
Parameters
productId
Type: System.Guid
[Missing <param name="productId"/> documentation for "M:Rhino.PlugIns.LicenseUtils.ShowBuyLicenseUi(System.Guid)"]
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace