RhinoCommon API
BinaryArchiveWriter.WriteVector3f Method
 Writes a Vector3f value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteVector3f(
	Vector3f value
)
Public Sub WriteVector3f (
	value As Vector3f
)
Parameters
value
Type: Rhino.Geometry.Vector3f
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace