RhinoCommon API
RenderPipeline.NeedToProcessLightTable Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.NeedToProcessLightTable"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool NeedToProcessLightTable()
Protected Overridable Function NeedToProcessLightTable As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.NeedToProcessLightTable"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace