RhinoCommon API
ColorHSL.CreateFromRGBA Method
 Create the nearest HSL equivalent of a RGBA color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static ColorHSL CreateFromRGBA(
	ColorRGBA rgba
)
Public Shared Function CreateFromRGBA (
	rgba As ColorRGBA
) As ColorHSL
Parameters
rgba
Type: Rhino.Display.ColorRGBA
Target color in RGBA space.
Return Value
Type: ColorHSL
The HSL equivalent of the RGBA color.
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace