RhinoCommon API
RhinoPageView.AddToPageViewGroup Method
 Add this page view to a page view group.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void AddToPageViewGroup(
	int pageViewGroupIndex
)
Public Sub AddToPageViewGroup (
	pageViewGroupIndex As Integer
)
Parameters
pageViewGroupIndex
Type: System.Int32
Zero-based index of the page view group.
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace