RhinoCommon API
CurveKinkDefinition.IsCurvatureKink Method (Curve, Double)
 True if there is a curvature discontinuity at curve(t) that passes the curvature kink test.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsCurvatureKink(
	Curve curve,
	double t
)
Public Function IsCurvatureKink (
	curve As Curve,
	t As Double
) As Boolean
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.Geometry.CurveKinkDefinition.IsCurvatureKink(Rhino.Geometry.Curve,System.Double)"]
t
Type: System.Double
[Missing <param name="t"/> documentation for "M:Rhino.Geometry.CurveKinkDefinition.IsCurvatureKink(Rhino.Geometry.Curve,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.CurveKinkDefinition.IsCurvatureKink(Rhino.Geometry.Curve,System.Double)"]
See Also
Reference
CurveKinkDefinition Class
IsCurvatureKink Overload
Rhino.Geometry Namespace