RhinoCommon API
NurbsCurveKnotList.KnotMultiplicity Method
Get knot multiplicity.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int KnotMultiplicity(
	int index
)
Public Function KnotMultiplicity (
	index As Integer
) As Integer
Parameters
index
Type: System.Int32
Index of knot to query.
Return Value
Type: Int32
The multiplicity (valence) of the knot.
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace