RhinoCommon API
PostEffectData.Dispose Method (Boolean)
Releases the unmanaged resources used by the PostEffectData and optionally releases the managed resources
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
PostEffectData Class
Dispose Overload
Rhino.Render.PostEffects Namespace