RhinoCommon API
Panels.GetPanels<T> Method (UInt32)
 Gets the panels.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static T[] GetPanels<T>(
	uint documentRuntimeSerialNumber
)
where T : class
Public Shared Function GetPanels(Of T As Class) (
	documentRuntimeSerialNumber As UInteger
) As T()
Parameters
documentRuntimeSerialNumber
Type: System.UInt32
Document runtime serial number.
Type Parameters
T
The 1st type parameter.
Return Value
Type: T[]
The panels.
See Also
Reference
Panels Class
GetPanels Overload
Rhino.UI Namespace