RhinoCommon API
FileStpReadOptions Constructor
Initializes a new instance of the FileStpReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileStpReadOptions()
Public Sub New
See Also
Reference
FileStpReadOptions Class
Rhino.FileIO Namespace