RhinoCommon API
NamedParametersEventArgs.Set Method (String, IEnumerable<Guid>)
 Set a list of UUIDs as a value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Set(
	string name,
	IEnumerable<Guid> guidList
)
Public Sub Set (
	name As String,
	guidList As IEnumerable(Of Guid)
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{System.Guid})"]
guidList
Type: System.Collections.Generic.IEnumerable<Guid>
[Missing <param name="guidList"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{System.Guid})"]
See Also
Reference
NamedParametersEventArgs Class
Set Overload
Rhino.Runtime Namespace