RhinoCommon API
ArcCurve Constructor
 Initializes a new ArcCurve instance.
Radius is set to 1, position to Origin and Domain to full span (circle).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ArcCurve()
Public Sub New
See Also
Reference
ArcCurve Class
ArcCurve Overload
Rhino.Geometry Namespace