RhinoCommon API
ObjectTable.Hide Method (RhinoObject, Boolean, String)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Hide(Rhino.DocObjects.RhinoObject,System.Boolean,System.String)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.32
Syntax
public bool Hide(
	RhinoObject obj,
	bool ignoreLayerMode,
	string hideGroup
)
Public Function Hide (
	obj As RhinoObject,
	ignoreLayerMode As Boolean,
	hideGroup As String
) As Boolean
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="obj"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Hide(Rhino.DocObjects.RhinoObject,System.Boolean,System.String)"]
ignoreLayerMode
Type: System.Boolean
[Missing <param name="ignoreLayerMode"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Hide(Rhino.DocObjects.RhinoObject,System.Boolean,System.String)"]
hideGroup
Type: System.String
[Missing <param name="hideGroup"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Hide(Rhino.DocObjects.RhinoObject,System.Boolean,System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Hide(Rhino.DocObjects.RhinoObject,System.Boolean,System.String)"]
See Also
Reference
ObjectTable Class
Hide Overload
Rhino.DocObjects.Tables Namespace