RhinoCommon API
FieldDictionary.AddTextured Method (String, String, Boolean)
 Add a new NullField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public NullField AddTextured(
	string key,
	string prompt,
	bool treatAsLinear
)
Public Function AddTextured (
	key As String,
	prompt As String,
	treatAsLinear As Boolean
) As NullField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
prompt
Type: System.String
 Prompt to display in the user interface (Content Browsers) if this is null or an empty string the this field is a data only field and will not appear in the user interface.
treatAsLinear
Type: System.Boolean
Determines whether the texture in this slot will be treated as linear by rendering engines (ie - not gamma packed).
Return Value
Type: NullField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.String,System.Boolean)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
AddTextured Overload
Rhino.Render.Fields Namespace