RhinoCommon API
CustomObjectGrips Constructor (ObjectGripsType)
 Creates grips that present themselves to Rhino as gripsType.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CustomObjectGrips(
	ObjectGripsType gripsType
)
Protected Sub New (
	gripsType As ObjectGripsType
)
Parameters
gripsType
Type: Rhino.DocObjects.Custom.ObjectGripsType
 What the grips control. Fixed for the life of the object.
See Also
Reference
CustomObjectGrips Class
CustomObjectGrips Overload
Rhino.DocObjects.Custom Namespace