RhinoCommon API
RhinoGet.GetPointOnMesh Method (RhinoDoc, MeshObject, String, Boolean, Point3d)
 Gets a point constrained to an existing mesh in the document.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public static Result GetPointOnMesh(
	RhinoDoc doc,
	MeshObject meshObject,
	string prompt,
	bool acceptNothing,
	out Point3d point
)
Public Shared Function GetPointOnMesh (
	doc As RhinoDoc,
	meshObject As MeshObject,
	prompt As String,
	acceptNothing As Boolean,
	<OutAttribute> ByRef point As Point3d
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
The Rhino document
meshObject
Type: Rhino.DocObjects.MeshObject
An mesh object in the document.
prompt
Type: System.String
Text prompt.
acceptNothing
Type: System.Boolean
true if nothing else should be accepted.
point
Type: Rhino.Geometry.Point3d
A point value will be assigned to this out parameter during this call.
Return Value
Type: Result
The command result based on user choice.
See Also
Reference
RhinoGet Class
GetPointOnMesh Overload
Rhino.Input Namespace