RhinoCommon API
RhinoObject.DestroyMeshes Method
 Destroys cached meshes of type meshType
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public virtual void DestroyMeshes(
	MeshType meshType
)
Public Overridable Sub DestroyMeshes (
	meshType As MeshType
)
Parameters
meshType
Type: Rhino.Geometry.MeshType
type of meshes to create
Return Value
Type:
number of meshes created
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace