RhinoCommon API
SubDEdgeChain.Clear Method
 Removes every edge from the chain.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace