RhinoCommon API
UserInterfaceLabel Constructor (String)
Initializes a new instance of the UserInterfaceLabel class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceLabel(
	string text
)
Public Sub New (
	text As String
)
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.UI.UserInterfaceLabel.#ctor(System.String)"]
See Also
Reference
UserInterfaceLabel Class
UserInterfaceLabel Overload
Rhino.UI Namespace