RhinoCommon API
File3dmInstanceDefinitionTable.Add Method (String, String, Point3d, GeometryBase, ObjectAttributes)
 Adds an instance definition to the instance definition table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public int Add(
	string name,
	string description,
	Point3d basePoint,
	GeometryBase geometry,
	ObjectAttributes attributes
)
Public Function Add (
	name As String,
	description As String,
	basePoint As Point3d,
	geometry As GeometryBase,
	attributes As ObjectAttributes
) As Integer
Parameters
name
Type: System.String
The definition name.
description
Type: System.String
The definition description.
basePoint
Type: Rhino.Geometry.Point3d
A base point.
geometry
Type: Rhino.Geometry.GeometryBase
An element.
attributes
Type: Rhino.DocObjects.ObjectAttributes
An attribute.
Return Value
Type: Int32
 >=0 index of instance definition in the instance definition table. -1 on failure.
See Also
Reference
File3dmInstanceDefinitionTable Class
Add Overload
Rhino.FileIO Namespace