RhinoCommon API
RhinoObject.SetObjectFrame Method (Plane)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.DocObjects.RhinoObject.SetObjectFrame(Rhino.Geometry.Plane)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
[ObsoleteAttribute("Use Attributes.SetObjectFrame instead")]
public void SetObjectFrame(
	Plane plane
)
<ObsoleteAttribute("Use Attributes.SetObjectFrame instead")>
Public Sub SetObjectFrame (
	plane As Plane
)
Parameters
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.DocObjects.RhinoObject.SetObjectFrame(Rhino.Geometry.Plane)"]
See Also
Reference
RhinoObject Class
SetObjectFrame Overload
Rhino.DocObjects Namespace