RhinoCommon API
ChangeQueue.AreViewsEqual Method
 Compare to ViewInfo instances and decide whether they are equal or not. If you need to change the way the comparison is done you can override this function and implement your custom comparison.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool AreViewsEqual(
	ViewInfo aView,
	ViewInfo bView
)
Public Overridable Function AreViewsEqual (
	aView As ViewInfo,
	bView As ViewInfo
) As Boolean
Parameters
aView
Type: Rhino.DocObjects.ViewInfo
First ViewInfo to compare
bView
Type: Rhino.DocObjects.ViewInfo
Second ViewInfo to compare
Return Value
Type: Boolean
true if the views are considered equal
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace