RhinoCommon API
SupportOptions.Libraries_SetShowDocuments Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.Libraries_SetShowDocuments(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void Libraries_SetShowDocuments(
	bool b
)
Public Shared Sub Libraries_SetShowDocuments (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.Libraries_SetShowDocuments(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace