RhinoCommon API
UserInterfaceGrid.SetColumnMinimumWidth Method
 Width a column never goes below, in logical pixels. The default is 0.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetColumnMinimumWidth(
	int column,
	double minimumWidth
)
Public Sub SetColumnMinimumWidth (
	column As Integer,
	minimumWidth As Double
)
Parameters
column
Type: System.Int32
[Missing <param name="column"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetColumnMinimumWidth(System.Int32,System.Double)"]
minimumWidth
Type: System.Double
[Missing <param name="minimumWidth"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetColumnMinimumWidth(System.Int32,System.Double)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace