RhinoCommon API
FieldDictionary.AddFilename Method
 Add a new StringField to the dictionary which will reference a filename. A file watcher will automatically be attached to the referenced file, and the content will be considered changed when the file is changed on disk.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
public StringField AddFilename(
	string key,
	string value,
	string prompt,
	int sectionId
)
Public Function AddFilename (
	key As String,
	value As String,
	prompt As String,
	sectionId As Integer
) As StringField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: System.String
Initial value for this field.
prompt
Type: System.String
 Prompt to display in the user interface (Content Browsers) if this is null or an empty string the this field is a data only field and will not appear in the user interface.
sectionId
Type: System.Int32
The id of the section containing the field
Return Value
Type: StringField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddFilename(System.String,System.String,System.String,System.Int32)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Rhino.Render.Fields Namespace