RhinoCommon API
RhinoDoc.SaveAs Method (String, Int32)
 Save doc as a 3dm to a specified path
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool SaveAs(
	string file3dmPath,
	int version
)
Public Function SaveAs (
	file3dmPath As String,
	version As Integer
) As Boolean
Parameters
file3dmPath
Type: System.String
[Missing <param name="file3dmPath"/> documentation for "M:Rhino.RhinoDoc.SaveAs(System.String,System.Int32)"]
version
Type: System.Int32
Rhino file version
Return Value
Type: Boolean
true on success
See Also
Reference
RhinoDoc Class
SaveAs Overload
Rhino Namespace