RhinoCommon API
Point3dList.SetAllY Method
 Set all the Y values for the points to a single value
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public void SetAllY(
	double yValue
)
Public Sub SetAllY (
	yValue As Double
)
Parameters
yValue
Type: System.Double
See Also
Reference
Point3dList Class
Rhino.Collections Namespace