RhinoCommon API
SubD.DuplicateEdgeCurves Method (Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Gets Nurbs form of edges in this SubD. NB: Does not update the SubD evaluation cache before getting the edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public Curve[] DuplicateEdgeCurves(
	bool boundaryOnly,
	bool interiorOnly,
	bool smoothOnly,
	bool sharpOnly,
	bool creaseOnly,
	bool clampEnds
)
Public Function DuplicateEdgeCurves (
	boundaryOnly As Boolean,
	interiorOnly As Boolean,
	smoothOnly As Boolean,
	sharpOnly As Boolean,
	creaseOnly As Boolean,
	clampEnds As Boolean
) As Curve()
Parameters
boundaryOnly
Type: System.Boolean
 If true, then only the boundary edges are duplicated. If false, then all edges are duplicated. If both boundaryOnly and interiorOnly are true, an empty array is returned.
interiorOnly
Type: System.Boolean
 If true, then only the interior edges are duplicated. If false, then all edges are duplicated. Note: interior edges with faces of different orientations are also returned. If both boundaryOnly and interiorOnly are true, an empty array is returned.
smoothOnly
Type: System.Boolean
 If true, then only the smooth (and not sharp) edges are duplicated. If false, then all edges are duplicated. If both smoothOnly and sharpOnly and creaseOnly are true, an empty array is returned.
sharpOnly
Type: System.Boolean
 If true, then only the sharp edges are duplicated. If false, then all edges are duplicated. If both smoothOnly and sharpOnly and creaseOnly are true, an empty array is returned.
creaseOnly
Type: System.Boolean
 If true, then only the creased edges are duplicated. If false, then all edges are duplicated. If both smoothOnly and sharpOnly and creaseOnly are true, an empty array is returned.
clampEnds
Type: System.Boolean
 If true, the end knots are clamped. Otherwise the end knots are(-2,-1,0,...., k1, k1+1, k1+2).
Return Value
Type: Curve[]
Array of edge curves on success.
See Also
Reference
SubD Class
DuplicateEdgeCurves Overload
Rhino.Geometry Namespace
SubD.UpdateSurfaceMeshCache(Boolean)