RhinoCommon API
Linetype.DeleteUserString Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Linetype.DeleteUserString(System.String)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public bool DeleteUserString(
	string key
)
Public Function DeleteUserString (
	key As String
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.DocObjects.Linetype.DeleteUserString(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Linetype.DeleteUserString(System.String)"]
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace