RhinoCommon API
FieldDictionary.Add Method (String, Guid)
 Add a new GuidField to the dictionary. This will be a data only field and not show up in the content browsers.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public GuidField Add(
	string key,
	Guid value
)
Public Function Add (
	key As String,
	value As Guid
) As GuidField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: System.Guid
Initial value for this field.
Return Value
Type: GuidField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Guid)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace