RhinoCommon API
NamedLayerStateTable.Save Method (String, Guid)
 Saves or updates a named layer state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public int Save(
	string name,
	Guid viewportId
)
Public Function Save (
	name As String,
	viewportId As Guid
) As Integer
Parameters
name
Type: System.String
The name of the layer state. If the named layer state already exists, it will be updated.
viewportId
Type: System.Guid
The id of the layout or detail viewport, required to save per viewport layer state properties.
Return Value
Type: Int32
The index of the newly added, or updated, layer state.
See Also
Reference
NamedLayerStateTable Class
Save Overload
Rhino.DocObjects.Tables Namespace