RhinoCommon API
LightManagerSupport.OnEditLight Method
 The default implementation of OnEditLight selects the lights and opens the Lights Properties page
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool OnEditLight(
	RhinoDoc doc,
	ref LightArray light_array
)
Public MustOverride Function OnEditLight (
	doc As RhinoDoc,
	ByRef light_array As LightArray
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.LightManagerSupport.OnEditLight(Rhino.RhinoDoc,Rhino.Render.LightArray@)"]
light_array
Type: Rhino.Render.LightArray
[Missing <param name="light_array"/> documentation for "M:Rhino.Render.LightManagerSupport.OnEditLight(Rhino.RhinoDoc,Rhino.Render.LightArray@)"]
Return Value
Type: Boolean
Returns true if successful, else false
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace