RhinoCommon API
SubD.JoinSubDs Method (IEnumerable<SubD>, Double, Boolean)
 Joins an enumeration of SubDs to form as few as possible resulting SubDs. There may be more than one SubD in the result array.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public static SubD[] JoinSubDs(
	IEnumerable<SubD> subdsToJoin,
	double tolerance,
	bool joinedEdgesAreCreases
)
Public Shared Function JoinSubDs (
	subdsToJoin As IEnumerable(Of SubD),
	tolerance As Double,
	joinedEdgesAreCreases As Boolean
) As SubD()
Parameters
subdsToJoin
Type: System.Collections.Generic.IEnumerable<SubD>
An enumeration of SubDs to join.
tolerance
Type: System.Double
The join tolerance.
joinedEdgesAreCreases
Type: System.Boolean
 If true, merged boundary edges will be creases. If false, merged boundary edges will be smooth.
Return Value
Type: SubD[]
[Missing <returns> documentation for "M:Rhino.Geometry.SubD.JoinSubDs(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubD},System.Double,System.Boolean)"]
Remarks
 NOTE: All of the input SubDs are copied and added to the result array in one form or another. NOTE: Symmetry information is removed from newly joined SubDs.See also comments in SubD.JoinSubDs with the bPreserveSymmetry parameter.
See Also
Reference
SubD Class
JoinSubDs Overload
Rhino.Geometry Namespace