RhinoCommon API
RenderPlugIn.InitializeDecalProperties Method
 Initialize your custom decal properties here. The input list will be empty - add your default named property values and return.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void InitializeDecalProperties(
	ref List<NamedValue> properties
)
Protected Overridable Sub InitializeDecalProperties (
	ByRef properties As List(Of NamedValue)
)
Parameters
properties
Type: System.Collections.Generic.List<NamedValue>
A list of named values that will be stored on the object the input values are the current ones, you should modify the values after the dialog closes.
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace