RhinoCommon API
Triangle3d.TrySmallestEnclosingTriangle Method
 Attempt to create the smallest triangle containing a set of planar points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static bool TrySmallestEnclosingTriangle(
	IEnumerable<Point2d> points,
	double tolerance,
	out Triangle3d triangle
)
Public Shared Function TrySmallestEnclosingTriangle (
	points As IEnumerable(Of Point2d),
	tolerance As Double,
	<OutAttribute> ByRef triangle As Triangle3d
) As Boolean
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point2d>
The points to enclose.
tolerance
Type: System.Double
The tolerance to use
triangle
Type: Rhino.Geometry.Triangle3d
The resulting triangle on success.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace