RhinoCommon API
RenderPipeline.LocalizeRenderReturnCode Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.LocalizeRenderReturnCode(Rhino.Render.RenderPipeline.RenderReturnCode)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public static string LocalizeRenderReturnCode(
	RenderPipeline.RenderReturnCode rc
)
Public Shared Function LocalizeRenderReturnCode (
	rc As RenderPipeline.RenderReturnCode
) As String
Parameters
rc
Type: Rhino.Render.RenderPipeline.RenderReturnCode
[Missing <param name="rc"/> documentation for "M:Rhino.Render.RenderPipeline.LocalizeRenderReturnCode(Rhino.Render.RenderPipeline.RenderReturnCode)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.LocalizeRenderReturnCode(Rhino.Render.RenderPipeline.RenderReturnCode)"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace