RhinoCommon API
Mesh.ExtendSelectionByEdgeRidge Method
 Suggests an extension of a selection set by using information related with topology and alignment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int[] ExtendSelectionByEdgeRidge(
	int[] preselectedEdges,
	int newEdge,
	bool iterative = true
)
Public Function ExtendSelectionByEdgeRidge (
	preselectedEdges As Integer(),
	newEdge As Integer,
	Optional iterative As Boolean = true
) As Integer()
Parameters
preselectedEdges
Type: System.Int32[]
An array of edges that were already selected.
newEdge
Type: System.Int32
A new edge index.
iterative (Optional)
Type: System.Boolean
[Missing <param name="iterative"/> documentation for "M:Rhino.Geometry.Mesh.ExtendSelectionByEdgeRidge(System.Int32[],System.Int32,System.Boolean)"]
Return Value
Type: Int32[]
An array of edges that are in a visual relationship with newEdge.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If newEdge is less than 0 or larger than the topology edge count.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace