RhinoCommon API
AsyncRenderContext.JoinRenderThread Method
 Join the render thread, then set to null;
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void JoinRenderThread()
Public Sub JoinRenderThread
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace