RhinoCommon API
BinaryArchiveReader.ReadCompressedBuffer Method
 Reads an array of compressed Byte information from the archive and uncompresses it.
An array is returned even if the input was another enumerable type.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public byte[] ReadCompressedBuffer()
Public Function ReadCompressedBuffer As Byte()
Return Value
Type: Byte[]
The array that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace