RhinoCommon API
ObjectTable.FindGeometry Method
 Same as FindId, but returns the Geometry property directly, if it exists.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public GeometryBase FindGeometry(
	Guid id
)
Public Function FindGeometry (
	id As Guid
) As GeometryBase
Parameters
id
Type: System.Guid
ID of object to search for.
Return Value
Type: GeometryBase
Reference to the geometry in the rhino object with the objectId or null if no such object could be found.
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace