RhinoCommon API
Worksession.Detach Method (UInt32)
 Detaches a reference model from this worksession.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Detach(
	uint modelSerialNumber
)
Public Function Detach (
	modelSerialNumber As UInteger
) As Boolean
Parameters
modelSerialNumber
Type: System.UInt32
 The reference model's serial number, from SerialNumber.
Return Value
Type: Boolean
True if the model was detached, false otherwise.
Remarks
 The active model - serial number 0 - cannot be detached.
See Also
Reference
Worksession Class
Detach Overload
Rhino.DocObjects Namespace