RhinoCommon API
DisplayDeviceInfo.GpuNames Method
 Get a list with the names of all GPUs on this machine.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public static List<string> GpuNames()
Public Shared Function GpuNames As List(Of String)
Return Value
Type: List<String>
List of strings
See Also
Reference
DisplayDeviceInfo Class
Rhino Namespace