RhinoCommon API
LightManagerSupportClient.LightsInSoloStorage Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupportClient.LightsInSoloStorage"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int LightsInSoloStorage()
Public Function LightsInSoloStorage As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.LightManagerSupportClient.LightsInSoloStorage"]
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace