RhinoCommon API
MeshTextureCoordinateList.TransposeTextureCoordinates Method
 Transposes texture coordinates.
The region of the bitmap the texture uses does not change. All texture coordinates rows (Us) become columns (Vs), and vice versa.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TransposeTextureCoordinates()
Public Function TransposeTextureCoordinates As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace