RhinoCommon API
SupportOptions.AlwaysShowSunPreview Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.AlwaysShowSunPreview"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool AlwaysShowSunPreview()
Public Shared Function AlwaysShowSunPreview As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.AlwaysShowSunPreview"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace