RhinoCommon API
RhinoObject.CreateSections Method
 Generate section curves by intersecting a plane with an object of type Brep, Extrusion, SubD ,Mesh or Block Instance.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public GeometryBase[] CreateSections(
	Plane plane,
	string name,
	double tolerance,
	out ObjectAttributes[] objectAttributes
)
Public Function CreateSections (
	plane As Plane,
	name As String,
	tolerance As Double,
	<OutAttribute> ByRef objectAttributes As ObjectAttributes()
) As GeometryBase()
Parameters
plane
Type: Rhino.Geometry.Plane
Intersecting plane.
name
Type: System.String
Name for section of objects.
tolerance
Type: System.Double
The intersection tolerance. When in doubt, use the document's model absolute tolerance.
objectAttributes
Type: Rhino.DocObjects.ObjectAttributes[]
Object attributes, one for each returned geometry item.
Return Value
Type: GeometryBase[]
Section geometry in the form of Breps, Extrusions, Meshes, and Curves if successful. An empty array if unsuccessful.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace