RhinoCommon API
VisualAnalysisMode.CurvatureColorAutoRange Method
 Adjusts the auto range values for curvature analysis.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void CurvatureColorAutoRange()
Public Shared Sub CurvatureColorAutoRange
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace