RhinoCommon API
RenderEnvironmentTable.Find Method
[Missing <summary> documentation for "M:Rhino.Render.RenderEnvironmentTable.Find(System.Guid)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RenderEnvironment Find(
	Guid id
)
Public Function Find (
	id As Guid
) As RenderEnvironment
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Render.RenderEnvironmentTable.Find(System.Guid)"]
Return Value
Type: RenderEnvironment
[Missing <returns> documentation for "M:Rhino.Render.RenderEnvironmentTable.Find(System.Guid)"]
See Also
Reference
RenderEnvironmentTable Class
Rhino.Render Namespace