RhinoCommon API
Box.Clone Method
 Returns a deep copy of this instance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Box Clone()
Public Function Clone As Box
Return Value
Type: Box
A plane with the same values as this item.
See Also
Reference
Box Structure
Rhino.Geometry Namespace