RhinoCommon API
File3dmObjectTable.AddInstanceObject Method (InstanceReferenceGeometry, ObjectAttributes)
 Adds an instance reference geometry object to the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public Guid AddInstanceObject(
	InstanceReferenceGeometry instanceReference,
	ObjectAttributes attributes
)
Public Function AddInstanceObject (
	instanceReference As InstanceReferenceGeometry,
	attributes As ObjectAttributes
) As Guid
Parameters
instanceReference
Type: Rhino.Geometry.InstanceReferenceGeometry
The instance reference geometry object.
attributes
Type: Rhino.DocObjects.ObjectAttributes
The attributes to link with the object.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddInstanceObject Overload
Rhino.FileIO Namespace