RhinoCommon API
Mesh.QuadRemeshBrep Method (Brep, QuadRemeshParameters, IEnumerable<Curve>)
 Create Quad Remesh from a Brep
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Mesh QuadRemeshBrep(
	Brep brep,
	QuadRemeshParameters parameters,
	IEnumerable<Curve> guideCurves
)
Public Shared Function QuadRemeshBrep (
	brep As Brep,
	parameters As QuadRemeshParameters,
	guideCurves As IEnumerable(Of Curve)
) As Mesh
Parameters
brep
Type: Rhino.Geometry.Brep
 Set Brep Face Mode by setting QuadRemeshParameters.PreserveMeshArrayEdgesMode
parameters
Type: Rhino.Geometry.QuadRemeshParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshBrep(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})"]
guideCurves
Type: System.Collections.Generic.IEnumerable<Curve>
 A curve array used to influence mesh face layout The curves should touch the input mesh Set Guide Curve Influence by using QuadRemeshParameters.GuideCurveInfluence
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshBrep(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})"]
See Also
Reference
Mesh Class
QuadRemeshBrep Overload
Rhino.Geometry Namespace