RhinoCommon API
NodeInCodeTable.GetDynamicMemberNames Method
 Returns all additional names in the table.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override IEnumerable<string> GetDynamicMemberNames()
Public Overrides Function GetDynamicMemberNames As IEnumerable(Of String)
Return Value
Type: IEnumerable<String>
[Missing <returns> documentation for "M:Rhino.NodeInCode.NodeInCodeTable.GetDynamicMemberNames"]
See Also
Reference
NodeInCodeTable Class
Rhino.NodeInCode Namespace