RhinoCommon API
FileDwgWriteOptions.SetNamedParameters Method
 Add these options to a NamedParametersEventArgs, used in the dotnet version of the acad export UI.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetNamedParameters(
	NamedParametersEventArgs args
)
Public Sub SetNamedParameters (
	args As NamedParametersEventArgs
)
Parameters
args
Type: Rhino.Runtime.NamedParametersEventArgs
[Missing <param name="args"/> documentation for "M:Rhino.FileIO.FileDwgWriteOptions.SetNamedParameters(Rhino.Runtime.NamedParametersEventArgs)"]
Return Value
Type:
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace