RhinoCommon API
Ellipse.TryFitEllipseToPoints Method
 Attempt to fit an ellipse through a set of points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool TryFitEllipseToPoints(
	IEnumerable<Point3d> points,
	out Ellipse ellipse
)
Public Shared Function TryFitEllipseToPoints (
	points As IEnumerable(Of Point3d),
	<OutAttribute> ByRef ellipse As Ellipse
) As Boolean
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
The points through which to fit.
ellipse
Type: Rhino.Geometry.Ellipse
The resulting ellipse on success.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace