RhinoCommon API
PointCloud.Add Method (Point3d, Color)
 Append a new point to the end of the list.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Add(
	Point3d point,
	Color color
)
Public Sub Add (
	point As Point3d,
	color As Color
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to append.
color
Type: System.Drawing.Color
Color of new point.
See Also
Reference
PointCloud Class
Add Overload
Rhino.Geometry Namespace