RhinoCommon API
CustomRenderMeshProvider.DocumentBasedMeshesChanged Method
[Missing <summary> documentation for "M:Rhino.Render.CustomRenderMeshProvider.DocumentBasedMeshesChanged(Rhino.RhinoDoc)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void DocumentBasedMeshesChanged(
	RhinoDoc doc
)
Public Shared Sub DocumentBasedMeshesChanged (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider.DocumentBasedMeshesChanged(Rhino.RhinoDoc)"]
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace