RhinoCommon API
SubDSurfaceInterpolator.CreateFromMarkedVertices Method
 Create an interpolator where all the marked vertices (unmarked if interpolatedVerticesMark is false) in the SubD are free vertices in the linear system used for interpolation, and the unmarked (marked if interpolatedVerticesMark is false) are fixed to their initial positions. Free vertices are can move as a result of the interpolation, and can receive an interpolation target location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static SubDSurfaceInterpolator CreateFromMarkedVertices(
	SubD subd,
	bool interpolatedVerticesMark,
	out uint freeVertexCount
)
Public Shared Function CreateFromMarkedVertices (
	subd As SubD,
	interpolatedVerticesMark As Boolean,
	<OutAttribute> ByRef freeVertexCount As UInteger
) As SubDSurfaceInterpolator
Parameters
subd
Type: Rhino.Geometry.SubD
The SubD to use for interpolation
interpolatedVerticesMark
Type: System.Boolean
If True, marked vertices will be considered free, and unmarked vertices will be fixed.
freeVertexCount
Type: System.UInt32
The number of free vertices in the system
Return Value
Type: SubDSurfaceInterpolator
A new SubDSurfaceInterpolator
Remarks
 Sets ContextId to the Guid of the Rhino SubD object for subd.
See Also
Reference
SubDSurfaceInterpolator Class
Rhino.Geometry Namespace