RhinoCommon API
ConstructionPlane Constructor
 Initializes a new instance of ConstructionPlane.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ConstructionPlane()
Public Sub New
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace