RhinoCommon API
TextureCache.Remove Method
 Removes the texture registered under the given name and frees its pixels.
 Anything still pointing at the name falls back to looking for an image file called that, so remove a name only once nothing is drawing it.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool Remove(
	string name
)
Public Shared Function Remove (
	name As String
) As Boolean
Parameters
name
Type: System.String
The name to remove.
Return Value
Type: Boolean
true if a texture was registered under this name and has been removed.
See Also
Reference
TextureCache Class
Rhino.Display Namespace