RhinoCommon API
ArchivableDictionary.GetObjectData Method
 Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public virtual void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
Public Overridable Sub GetObjectData (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
The System.Runtime.Serialization.SerializationInfo to populate with data.
context
Type: System.Runtime.Serialization.StreamingContext
The destination (see System.Runtime.Serialization.StreamingContext) for this serialization.
Implements
ISerializable.GetObjectData(SerializationInfo, StreamingContext)
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace