RhinoCommon API
ContentHash Constructor
 Constructs a copy of a content hash.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected ContentHash(
	ContentHash other
)
Protected Sub New (
	other As ContentHash
)
Parameters
other
Type: Rhino.FileIO.ContentHash
The other content hash to copy.
See Also
Reference
ContentHash Class
Rhino.FileIO Namespace