RhinoCommon API
NurbsCurve.CreateSubDFriendly Method (Curve, Int32, Boolean)
 Create a NURBS curve, that is suitable for calculations like lofting SubD objects, from an existing curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static NurbsCurve CreateSubDFriendly(
	Curve curve,
	int pointCount,
	bool periodicClosedCurve
)
Public Shared Function CreateSubDFriendly (
	curve As Curve,
	pointCount As Integer,
	periodicClosedCurve As Boolean
) As NurbsCurve
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to rebuild as a SubD friendly curve.
pointCount
Type: System.Int32
 Desired number of control points. If periodicClosedCurve is true, the number must be >= 6, otherwise the number must be >= 4.
periodicClosedCurve
Type: System.Boolean
True if the SubD friendly curve should be closed and periodic. False in all other cases.
Return Value
Type: NurbsCurve
A SubD friendly NURBS curve is successful, null otherwise.
See Also
Reference
NurbsCurve Class
CreateSubDFriendly Overload
Rhino.Geometry Namespace