RhinoCommon API
DisplayPipeline.DrawCurvaturePreview Method (Brep, Color)
 Draws a Brep in Curvature Analysis preview.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void DrawCurvaturePreview(
	Brep brep,
	Color color
)
Public Sub DrawCurvaturePreview (
	brep As Brep,
	color As Color
)
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to draw.
color
Type: System.Drawing.Color
Objct color.
See Also
Reference
DisplayPipeline Class
DrawCurvaturePreview Overload
Rhino.Display Namespace