RhinoCommon API
LicenseUtils.LogoutOfCloudZoo Method
[Missing <summary> documentation for "M:Rhino.PlugIns.LicenseUtils.LogoutOfCloudZoo"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool LogoutOfCloudZoo()
Public Shared Function LogoutOfCloudZoo As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.LogoutOfCloudZoo"]
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace