RhinoCommon API
ICollapsibleSectionHolder.SectionAt Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.SectionAt(System.Int32)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
ICollapsibleSection SectionAt(
	int index
)
Function SectionAt (
	index As Integer
) As ICollapsibleSection
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.SectionAt(System.Int32)"]
Return Value
Type: ICollapsibleSection
[Missing <returns> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.SectionAt(System.Int32)"]
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace