RhinoCommon API
SimpleArrayIntPtr.NonConstPointer Method
 Gets the non-constant pointer (for modification) of this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IntPtr NonConstPointer()
Public Function NonConstPointer As IntPtr
Return Value
Type: IntPtr
The non-constant pointer.
See Also
Reference
SimpleArrayIntPtr Class
Rhino.Runtime.InteropWrappers Namespace