RhinoCommon API
SimpleArrayClippingPlaneObjectPointer Constructor
 Initializes a new SimpleArrayClippingPlaneObjectPointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public SimpleArrayClippingPlaneObjectPointer()
Public Sub New
See Also
Reference
SimpleArrayClippingPlaneObjectPointer Class
Rhino.Runtime.InteropWrappers Namespace