RhinoCommon API
LayerTable.AddPath Method (String)
 Adds all of the layer in the specified layer path, beginning with the root. Layer paths contain one or more valid layers names, with each name separated by NamePathSeparator. For example, "Grandfather::Father::Son".
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int AddPath(
	string layerPath
)
Public Function AddPath (
	layerPath As String
) As Integer
Parameters
layerPath
Type: System.String
The layer path.
Return Value
Type: Int32
The index of the last layer created if successful, UnsetIntIndex on failure.
See Also
Reference
LayerTable Class
AddPath Overload
Rhino.DocObjects.Tables Namespace