RhinoCommon API
Linetype.SetTaper Method (Double, Double)
 Set taper to a simple start width / end width
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetTaper(
	double startWidth,
	double endWidth
)
Public Sub SetTaper (
	startWidth As Double,
	endWidth As Double
)
Parameters
startWidth
Type: System.Double
[Missing <param name="startWidth"/> documentation for "M:Rhino.DocObjects.Linetype.SetTaper(System.Double,System.Double)"]
endWidth
Type: System.Double
[Missing <param name="endWidth"/> documentation for "M:Rhino.DocObjects.Linetype.SetTaper(System.Double,System.Double)"]
See Also
Reference
Linetype Class
SetTaper Overload
Rhino.DocObjects Namespace