RhinoCommon API
RhinoAccoountsProgressInfo Constructor
 Creates a new instance.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoAccoountsProgressInfo(
	ProgressState state,
	Dictionary<Object, Object> metadata = null,
	string customDescription = null
)
Public Sub New (
	state As ProgressState,
	Optional metadata As Dictionary(Of Object, Object) = Nothing,
	Optional customDescription As String = Nothing
)
Parameters
state
Type: Rhino.Runtime.RhinoAccounts.ProgressState
The state to report.
metadata (Optional)
Type: System.Collections.Generic.Dictionary<Object, Object>
Optional. Any metadata of interest that may be used by the caller of a task.
customDescription (Optional)
Type: System.String
Optional. If a non-null value is passed, it will override the default description of the instance.
See Also
Reference
RhinoAccoountsProgressInfo Class
Rhino.Runtime.RhinoAccounts Namespace