RhinoCommon API
Mesh.GetSelfIntersections Method
 Gets the intersections of this mesh with itself.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool GetSelfIntersections(
	double tolerance,
	out Polyline[] perforations,
	bool overlapsPolylines,
	out Polyline[] overlapsPolylinesResult,
	bool overlapsMesh,
	out Mesh overlapsMeshResult,
	TextLog textLog,
	CancellationToken cancel,
	IProgress<double> progress
)
Public Function GetSelfIntersections (
	tolerance As Double,
	<OutAttribute> ByRef perforations As Polyline(),
	overlapsPolylines As Boolean,
	<OutAttribute> ByRef overlapsPolylinesResult As Polyline(),
	overlapsMesh As Boolean,
	<OutAttribute> ByRef overlapsMeshResult As Mesh,
	textLog As TextLog,
	cancel As CancellationToken,
	progress As IProgress(Of Double)
) As Boolean
Parameters
tolerance
Type: System.Double
A tolerance value. If negative, the positive value will be used. WARNING! Good tolerance values are in the magnitude of 10^-7, or RhinoMath.SqrtEpsilon*10.
perforations
Type: Rhino.Geometry.Polyline[]
The array of perforations.
overlapsPolylines
Type: System.Boolean
If true, the next argument is computed.
overlapsPolylinesResult
Type: Rhino.Geometry.Polyline[]
The array of overlaps, in terms of polylines.
overlapsMesh
Type: System.Boolean
If true, the next argument is computed.
overlapsMeshResult
Type: Rhino.Geometry.Mesh
A mesh that represents the overlaps in terms of surfaces.
textLog
Type: Rhino.FileIO.TextLog
A report of the outcome.
cancel
Type: System.Threading.CancellationToken
A cancellation token.
progress
Type: System.IProgress<Double>
A progress reporter.
Return Value
Type: Boolean
An array of intersection and overlaps polylines.
Return Value
Type: Boolean
True on success, false on failure and cancellation.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace