RhinoCommon API
StdVectorFloat.ToArray Method
 Returns the managed counterpart of the unmanaged array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.26
Syntax
public float[] ToArray()
Public Function ToArray As Single()
Return Value
Type: Single[]
The managed array.
See Also
Reference
StdVectorFloat Class
Rhino.Runtime.InteropWrappers Namespace