RhinoCommon API
GripUserInterfaceObject.SetSnapPoints Method
[Missing <summary> documentation for "M:Rhino.UI.GripUserInterfaceObject.SetSnapPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetSnapPoints(
	IEnumerable<Point3d> points
)
Public Sub SetSnapPoints (
	points As IEnumerable(Of Point3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
[Missing <param name="points"/> documentation for "M:Rhino.UI.GripUserInterfaceObject.SetSnapPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
See Also
Reference
GripUserInterfaceObject Class
Rhino.UI Namespace