RhinoCommon API
IZooClientUtilities.ReturnLicense Method (Object, String, Guid)
[Missing <summary> documentation for "M:Rhino.Runtime.IZooClientUtilities.ReturnLicense(System.Object,System.String,System.Guid)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool ReturnLicense(
	Object verify,
	string productPath,
	Guid productId
)
Function ReturnLicense (
	verify As Object,
	productPath As String,
	productId As Guid
) As Boolean
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.ReturnLicense(System.Object,System.String,System.Guid)"]
productPath
Type: System.String
[Missing <param name="productPath"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.ReturnLicense(System.Object,System.String,System.Guid)"]
productId
Type: System.Guid
[Missing <param name="productId"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.ReturnLicense(System.Object,System.String,System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.ReturnLicense(System.Object,System.String,System.Guid)"]
See Also
Reference
IZooClientUtilities Interface
ReturnLicense Overload
Rhino.Runtime Namespace