RhinoCommon API
ObjectTable.ReplaceInstanceObject Method (ObjRef, Int32)
 Replaces the underlying instance definition of an instance object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public bool ReplaceInstanceObject(
	ObjRef objref,
	int instanceDefinitionIndex
)
Public Function ReplaceInstanceObject (
	objref As ObjRef,
	instanceDefinitionIndex As Integer
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
Reference to the instance object to be replaced. The objref.Object() will be deleted.
instanceDefinitionIndex
Type: System.Int32
The index of the new instance definition to use.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
ReplaceInstanceObject Overload
Rhino.DocObjects.Tables Namespace