RhinoCommon API
Vector3d.Decompose Method
 Find scalars x and y so that the component of v in the plane of a and b is x*a + y*b
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool Decompose(
	Vector3d v,
	Vector3d a,
	Vector3d b,
	out double x,
	out double y
)
Public Shared Function Decompose (
	v As Vector3d,
	a As Vector3d,
	b As Vector3d,
	<OutAttribute> ByRef x As Double,
	<OutAttribute> ByRef y As Double
) As Boolean
Parameters
v
Type: Rhino.Geometry.Vector3d
a
Type: Rhino.Geometry.Vector3d
non-zero and not parallel to b
b
Type: Rhino.Geometry.Vector3d
non-zero and not parallel to a
x
Type: System.Double
y
Type: System.Double
Return Value
Type: Boolean
true if the decomposition is successful.
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace