RhinoCommon API
Brep.PushPullExtend Method
 If the brep.Faces[faceIndex] is planar, and all the adjacent faces are planar, this function transforms brep.Faces[faceIndex] with the transform parameter and recomputes the adjacent faces. See the PushPull commands extend mode.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.16
Syntax
public Brep PushPullExtend(
	int faceIndex,
	Transform transform,
	double tolerance
)
Public Function PushPullExtend (
	faceIndex As Integer,
	transform As Transform,
	tolerance As Double
) As Brep
Parameters
faceIndex
Type: System.Int32
The index of the face being transformed
transform
Type: Rhino.Geometry.Transform
The transformation
tolerance
Type: System.Double
The tolerance for planarity checks. When in doubt, use the document's absolute tolerance.
Return Value
Type: Brep
The brep with the transformed face on success. Null on error.
See Also
Reference
Brep Class
Rhino.Geometry Namespace