RhinoCommon API
ViewCaptureSettings.Load Method
[Missing <summary> documentation for "M:Rhino.Display.ViewCaptureSettings.Load(System.String,Rhino.PersistentSettings)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.1
Syntax
public bool Load(
	string name,
	PersistentSettings settings
)
Public Function Load (
	name As String,
	settings As PersistentSettings
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Display.ViewCaptureSettings.Load(System.String,Rhino.PersistentSettings)"]
settings
Type: Rhino.PersistentSettings
[Missing <param name="settings"/> documentation for "M:Rhino.Display.ViewCaptureSettings.Load(System.String,Rhino.PersistentSettings)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.ViewCaptureSettings.Load(System.String,Rhino.PersistentSettings)"]
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace