RhinoCommon API
LightTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LightTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override IEnumerator<LightObject> GetEnumerator()
Public Overrides Function GetEnumerator As IEnumerator(Of LightObject)
Return Value
Type: IEnumerator<LightObject>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LightTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace