RhinoCommon API
PersistentSettings.TryGetUnsignedInteger Method (String, UInt32)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetUnsignedInteger(System.String,System.UInt32@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetUnsignedInteger(
	string key,
	out uint value
)
Public Function TryGetUnsignedInteger (
	key As String,
	<OutAttribute> ByRef value As UInteger
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetUnsignedInteger(System.String,System.UInt32@)"]
value
Type: System.UInt32
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetUnsignedInteger(System.String,System.UInt32@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetUnsignedInteger(System.String,System.UInt32@)"]
See Also
Reference
PersistentSettings Class
TryGetUnsignedInteger Overload
Rhino Namespace