RhinoCommon API
DirectionAnalysisSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static DirectionAnalysisSettingsState GetDefaultState()
Public Shared Function GetDefaultState As DirectionAnalysisSettingsState
Return Value
Type: DirectionAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.DirectionAnalysisSettings.GetDefaultState"]
See Also
Reference
DirectionAnalysisSettings Class
Rhino.ApplicationSettings Namespace