RhinoCommon API
PreviewAppearance.Dispose Method
 Dispose for previewappearance
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace