RhinoCommon API
File3dmViewTable.Add Method
 Adds a
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Add(
	ViewInfo item
)
Public Sub Add (
	item As ViewInfo
)
Parameters
item
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="item"/> documentation for "M:Rhino.FileIO.File3dmViewTable.Add(Rhino.DocObjects.ViewInfo)"]
Implements
ICollection<T>.Add(T)
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace