RhinoCommon API
Markup.WriteToFile Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Markup.WriteToFile"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void WriteToFile()
Public Sub WriteToFile
See Also
Reference
Markup Class
Rhino.DocObjects Namespace