RhinoCommon API
RenderContent.Uninitialize Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.Uninitialize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
[ObsoleteAttribute("This method should not be called.")]
public void Uninitialize()
<ObsoleteAttribute("This method should not be called.")>
Public Sub Uninitialize
See Also
Reference
RenderContent Class
Rhino.Render Namespace