RhinoCommon API
SurfaceCurvature.Equals Method (SurfaceCurvature)
 Indicates whether the current object is equal to another object of the same type.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Equals(
	SurfaceCurvature other
)
Public Function Equals (
	other As SurfaceCurvature
) As Boolean
Parameters
other
Type: Rhino.Geometry.SurfaceCurvature
 An object to compare with this object.
Return Value
Type: Boolean
true if the current object is equal to the other parameter; otherwise, false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
SurfaceCurvature Class
Equals Overload
Rhino.Geometry Namespace