RhinoCommon API
GetBaseClass.Option Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetBaseClass.Option"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public CommandLineOption Option()
Public Function Option As CommandLineOption
Return Value
Type: CommandLineOption
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetBaseClass.Option"]
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace