RhinoCommon API
DisplayModeDescription.SaveDisplayModes Method
 Saves all display modes to disk.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void SaveDisplayModes()
Public Shared Sub SaveDisplayModes
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace