RhinoCommon API
Markup.ReadRevisionHistory Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Markup.ReadRevisionHistory(System.String@,System.String@,System.Int32@,System.DateTime@,System.DateTime@)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ReadRevisionHistory(
	out string createdBy,
	out string lastEditedBy,
	out int revision,
	out DateTime createdOn,
	out DateTime lastEditedOn
)
Public Function ReadRevisionHistory (
	<OutAttribute> ByRef createdBy As String,
	<OutAttribute> ByRef lastEditedBy As String,
	<OutAttribute> ByRef revision As Integer,
	<OutAttribute> ByRef createdOn As DateTime,
	<OutAttribute> ByRef lastEditedOn As DateTime
) As Boolean
Parameters
createdBy
Type: System.String
[Missing <param name="createdBy"/> documentation for "M:Rhino.DocObjects.Markup.ReadRevisionHistory(System.String@,System.String@,System.Int32@,System.DateTime@,System.DateTime@)"]
lastEditedBy
Type: System.String
[Missing <param name="lastEditedBy"/> documentation for "M:Rhino.DocObjects.Markup.ReadRevisionHistory(System.String@,System.String@,System.Int32@,System.DateTime@,System.DateTime@)"]
revision
Type: System.Int32
[Missing <param name="revision"/> documentation for "M:Rhino.DocObjects.Markup.ReadRevisionHistory(System.String@,System.String@,System.Int32@,System.DateTime@,System.DateTime@)"]
createdOn
Type: System.DateTime
[Missing <param name="createdOn"/> documentation for "M:Rhino.DocObjects.Markup.ReadRevisionHistory(System.String@,System.String@,System.Int32@,System.DateTime@,System.DateTime@)"]
lastEditedOn
Type: System.DateTime
[Missing <param name="lastEditedOn"/> documentation for "M:Rhino.DocObjects.Markup.ReadRevisionHistory(System.String@,System.String@,System.Int32@,System.DateTime@,System.DateTime@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Markup.ReadRevisionHistory(System.String@,System.String@,System.Int32@,System.DateTime@,System.DateTime@)"]
See Also
Reference
Markup Class
Rhino.DocObjects Namespace