RhinoCommon API
RenderTexture.GetMappingChannel Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetMappingChannel"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual int GetMappingChannel()
Public Overridable Function GetMappingChannel As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetMappingChannel"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace