RhinoCommon API
Panels.RegisterPanel Method (PlugIn, Type, String, Icon, PanelType)
 Call once to register a panel type which will get dynamically created and embedded in a Rhino docking/floating location.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public static void RegisterPanel(
	PlugIn plugIn,
	Type type,
	string caption,
	Icon icon,
	PanelType panelType
)
Public Shared Sub RegisterPanel (
	plugIn As PlugIn,
	type As Type,
	caption As String,
	icon As Icon,
	panelType As PanelType
)
Parameters
plugIn
Type: Rhino.PlugIns.PlugIn
 Plug-in restringing the panel
type
Type: System.Type
 Type of the control object to be displayed in the panel
caption
Type: System.String
 Panel caption also used as a tool-tip. On Windows the panel may be displayed using the icon, caption or both. On Mac the icon will be used and the caption will be the tool-tip.
icon
Type: System.Drawing.Icon
 The panel icon. On Windows the panel may be displayed using the icon, caption or both. On Mac the icon will be used and the caption will be the tool-tip.
panelType
Type: Rhino.UI.PanelType
 See PanelType
See Also
Reference
Panels Class
RegisterPanel Overload
Rhino.UI Namespace