RhinoCommon API
Group.DeleteAllUserStrings Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Group.DeleteAllUserStrings"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public void DeleteAllUserStrings()
Public Sub DeleteAllUserStrings
See Also
Reference
Group Class
Rhino.DocObjects Namespace