RhinoCommon API
PersistentSettings.GetSize Method (String, Size, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetSize(System.String,System.Drawing.Size,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Size GetSize(
	string key,
	Size defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetSize (
	key As String,
	defaultValue As Size,
	legacyKeyList As IEnumerable(Of String)
) As Size
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetSize(System.String,System.Drawing.Size,System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.Drawing.Size
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetSize(System.String,System.Drawing.Size,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetSize(System.String,System.Drawing.Size,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Size
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetSize(System.String,System.Drawing.Size,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetSize Overload
Rhino Namespace