RhinoCommon API
MeshCheckParameters.Defaults Method
 Gets the default mesh check parameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static MeshCheckParameters Defaults()
Public Shared Function Defaults As MeshCheckParameters
Return Value
Type: MeshCheckParameters
The default mesh check parameters.
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace