RhinoCommon API
UserInterfaceObjectBase.OnMouseUp Method
 Called when the mouse is released on this object
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnMouseUp(
	MouseState mouse
)
Protected Overridable Sub OnMouseUp (
	mouse As MouseState
)
Parameters
mouse
Type: Rhino.UI.MouseState
[Missing <param name="mouse"/> documentation for "M:Rhino.UI.UserInterfaceObjectBase.OnMouseUp(Rhino.UI.MouseState)"]
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace