RhinoCommon API
Plane.DistanceTo Method (BoundingBox, Double, Double)
 Returns the signed minimum and maximum distances from bounding box to this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DistanceTo(
	BoundingBox bbox,
	out double min,
	out double max
)
Public Function DistanceTo (
	bbox As BoundingBox,
	<OutAttribute> ByRef min As Double,
	<OutAttribute> ByRef max As Double
) As Boolean
Parameters
bbox
Type: Rhino.Geometry.BoundingBox
bounding box to get distances from
min
Type: System.Double
minimum signed distance from plane to box
max
Type: System.Double
maximum signed distance from plane to box
Return Value
Type: Boolean
false if plane has zero length normal
See Also
Reference
Plane Structure
DistanceTo Overload
Rhino.Geometry Namespace