RhinoCommon API
WorksessionFile.Finalize Method
Releases the native worksession.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace