RhinoCommon API
CursorTooltipSettings.GetCurrentState Method
 Gets the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static CursorTooltipSettingsState GetCurrentState()
Public Shared Function GetCurrentState As CursorTooltipSettingsState
Return Value
Type: CursorTooltipSettingsState
A new cursor tooltip state with current settings.
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace