RhinoCommon API
HistoryRecord.SetHistoryVersion Method
 Specifies a non-zero integer that identifies the version of this history record. The virtual ReplayHistory() functions can check this version to avoid replaying history using information created by earlier versions of the command.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SetHistoryVersion(
	int historyVersion
)
Public Function SetHistoryVersion (
	historyVersion As Integer
) As Boolean
Parameters
historyVersion
Type: System.Int32
Any non-zero integer. It is strongly suggested that something like YYYYMMDD be used.
Return Value
Type: Boolean
True if successful.
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace