RhinoCommon API
FieldDictionary.RemoveField Method
[Missing <summary> documentation for "M:Rhino.Render.Fields.FieldDictionary.RemoveField(System.String)"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void RemoveField(
	string fieldName
)
Public Sub RemoveField (
	fieldName As String
)
Parameters
fieldName
Type: System.String
[Missing <param name="fieldName"/> documentation for "M:Rhino.Render.Fields.FieldDictionary.RemoveField(System.String)"]
See Also
Reference
FieldDictionary Class
Rhino.Render.Fields Namespace