RhinoCommon API
Brep.CreatePlanarBrepsWithIndexMap Method
 Constructs a set of planar Breps as outlines by the loops, reporting which input curves bounded each Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Brep[] CreatePlanarBrepsWithIndexMap(
	IEnumerable<Curve> inputLoops,
	double tolerance,
	out int[][] indexMap
)
Public Shared Function CreatePlanarBrepsWithIndexMap (
	inputLoops As IEnumerable(Of Curve),
	tolerance As Double,
	<OutAttribute> ByRef indexMap As Integer()()
) As Brep()
Parameters
inputLoops
Type: System.Collections.Generic.IEnumerable<Curve>
Curve loops that delineate the planar boundaries.
tolerance
Type: System.Double
Tolerance to use when sorting and building the loops.
indexMap
Type: System.Int32[][]
 One entry per returned Brep, in the same order. Entry i lists, ascending, the positions in inputLoops of the curves sorted onto Brep i. Null when this method returns null.
Return Value
Type: Brep[]
An array of planar Breps, or null on failure.
Remarks
 A curve that closes an outer loop and a curve that closes a hole in the same face are both listed for that face, and a hole rejected while the Brep is built still leaves its curves listed. The entries are not a partition of inputLoops. A self-intersecting input is split into regions, and a curve bounding several of them is listed for each. A curve the merge dropped, one sorted onto no face, and one whose face failed to produce a valid Brep are listed nowhere. A null element in inputLoops throws ArgumentException, because the reported indices are positions in that sequence. The other CreatePlanarBreps overloads drop nulls silently and renumber what follows.
See Also
Reference
Brep Class
Rhino.Geometry Namespace