RhinoCommon API
Hatch.Create Method (Plane, Curve, IEnumerable<Curve>, Int32, Double, Double)
 Create a hatch with a given set of outer and inner loops
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static Hatch Create(
	Plane hatchPlane,
	Curve outerLoop,
	IEnumerable<Curve> innerLoops,
	int hatchPatternIndex,
	double rotationRadians,
	double scale
)
Public Shared Function Create (
	hatchPlane As Plane,
	outerLoop As Curve,
	innerLoops As IEnumerable(Of Curve),
	hatchPatternIndex As Integer,
	rotationRadians As Double,
	scale As Double
) As Hatch
Parameters
hatchPlane
Type: Rhino.Geometry.Plane
[Missing <param name="hatchPlane"/> documentation for "M:Rhino.Geometry.Hatch.Create(Rhino.Geometry.Plane,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Double,System.Double)"]
outerLoop
Type: Rhino.Geometry.Curve
2d closed curve representing outer boundary of hatch
innerLoops
Type: System.Collections.Generic.IEnumerable<Curve>
2d closed curves for inner boundaries
hatchPatternIndex
Type: System.Int32
[Missing <param name="hatchPatternIndex"/> documentation for "M:Rhino.Geometry.Hatch.Create(Rhino.Geometry.Plane,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Double,System.Double)"]
rotationRadians
Type: System.Double
[Missing <param name="rotationRadians"/> documentation for "M:Rhino.Geometry.Hatch.Create(Rhino.Geometry.Plane,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Double,System.Double)"]
scale
Type: System.Double
[Missing <param name="scale"/> documentation for "M:Rhino.Geometry.Hatch.Create(Rhino.Geometry.Plane,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Double,System.Double)"]
Return Value
Type: Hatch
[Missing <returns> documentation for "M:Rhino.Geometry.Hatch.Create(Rhino.Geometry.Plane,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Double,System.Double)"]
See Also
Reference
Hatch Class
Create Overload
Rhino.Geometry Namespace