RhinoCommon API
PythonScript.CreateTextEditorControl Method
 Creates a control where the user is able to type Python code.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public abstract Object CreateTextEditorControl(
	string script,
	Action<string> helpcallback
)
Public MustOverride Function CreateTextEditorControl (
	script As String,
	helpcallback As Action(Of String)
) As Object
Parameters
script
Type: System.String
A starting script.
helpcallback
Type: System.Action<String>
A method that is called when help is shown for a function, a class or a method.
Return Value
Type: Object
A Windows Forms control.
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace