RhinoCommon API
SnapShotsClient.AnimateObject Method
 Called for each frame. Starting at 0.0.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool AnimateObject(
	RhinoDoc doc,
	RhinoObject doc_object,
	ref Transform transform,
	double dPos,
	BinaryArchiveReader archive_start,
	BinaryArchiveReader archive_stop
)
Public MustOverride Function AnimateObject (
	doc As RhinoDoc,
	doc_object As RhinoObject,
	ByRef transform As Transform,
	dPos As Double,
	archive_start As BinaryArchiveReader,
	archive_stop As BinaryArchiveReader
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
doc is the current document.
doc_object
Type: Rhino.DocObjects.RhinoObject
doc_obj is the current object.
transform
Type: Rhino.Geometry.Transform
transform is a transformation matrix. The matrix is set to identity the first time an object is associated with a snapshot. After that the matrix is updated when the object is transformed(scale, rotate etc.).
dPos
Type: System.Double
dPos is the current frame. Starting at 0.0.
archive_start
Type: Rhino.FileIO.BinaryArchiveReader
archive_start is a archive to the data of the starting position.
archive_stop
Type: Rhino.FileIO.BinaryArchiveReader
archive_stop is a archive to the data of the ending position.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.AnimateObject(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform@,System.Double,Rhino.FileIO.BinaryArchiveReader,Rhino.FileIO.BinaryArchiveReader)"]
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace