RhinoCommon API
TextFields.Volume Method (String)
 Returns the volume for the selected object id open objects return 0 volume
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static double Volume(
	string id
)
Public Shared Function Volume (
	id As String
) As Double
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String)"]
See Also
Reference
TextFields Class
Volume Overload
Rhino.Runtime Namespace