RhinoCommon API
RenderContentKindList.Add Method
 Add a kind to a kind list.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public void Add(
	RenderContentKind kind
)
Public Sub Add (
	kind As RenderContentKind
)
Parameters
kind
Type: Rhino.Render.RenderContentKind
The RenderContent kind to add.
See Also
Reference
RenderContentKindList Class
Rhino.Render Namespace