RhinoCommon API
Font.GetSubstituteFont Method
 If this font is not installed on the system, try to find a substitute
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public Font GetSubstituteFont()
Public Function GetSubstituteFont As Font
Return Value
Type: Font
[Missing <returns> documentation for "M:Rhino.DocObjects.Font.GetSubstituteFont"]
See Also
Reference
Font Class
Rhino.DocObjects Namespace