RhinoCommon API
BrepFace.TryGetInteriorPoint Method
 Tries to get a 3-D point that is comfortably in the interior of this face, which is useful for face labeling and for face classification.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetInteriorPoint(
	out Point3d point
)
Public Function TryGetInteriorPoint (
	<OutAttribute> ByRef point As Point3d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
The interior point if successful.
Return Value
Type: Boolean
true if successful, false otherwise.
Remarks
 The returned point is not necessarily the point on the face that is furthest away from the face's boundary. It is just a point that is relatively far away from all of the face's trimming curves.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace