RhinoCommon API
RTree.SearchOverlaps Method (RTree, RTree, Double, EventHandler<RTreeEventArgs>)
 Searches two R-trees for all pairs elements whose bounding boxes overlap.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool SearchOverlaps(
	RTree treeA,
	RTree treeB,
	double tolerance,
	EventHandler<RTreeEventArgs> callback
)
Public Shared Function SearchOverlaps (
	treeA As RTree,
	treeB As RTree,
	tolerance As Double,
	callback As EventHandler(Of RTreeEventArgs)
) As Boolean
Parameters
treeA
Type: Rhino.Geometry.RTree
A first tree.
treeB
Type: Rhino.Geometry.RTree
A second tree.
tolerance
Type: System.Double
 If the distance between a pair of bounding boxes is less than tolerance, then callback is called.
callback
Type: System.EventHandler<RTreeEventArgs>
A callback event handler.
Return Value
Type: Boolean
 true if entire tree was searched. It is possible no results were found.
Remarks
 Do not modify the tree while a Search() is in progress. Doing so can have unintended consequences, including corruption and crashes.If you need to modify the tree, collect the results during the search and modify the tree once the search is completed.
See Also
Reference
RTree Class
SearchOverlaps Overload
Rhino.Geometry Namespace