RhinoCommon API
DimStyleTable.Add Method (DimensionStyle, Boolean)
 Adds a new DimensionStyle to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Add(
	DimensionStyle dimstyle,
	bool reference
)
Public Function Add (
	dimstyle As DimensionStyle,
	reference As Boolean
) As Integer
Parameters
dimstyle
Type: Rhino.DocObjects.DimensionStyle
The dimension style to add
reference
Type: System.Boolean
if true the dimstyle will not be saved in files.
Return Value
Type: Int32
index of new AnnotationStyle.
See Also
Reference
DimStyleTable Class
Add Overload
Rhino.DocObjects.Tables Namespace