RhinoCommon API
ObjectTable.TryFindPoint Method
 Finds the location of a point, if a point exists in the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryFindPoint(
	Guid id,
	out Point3d point
)
Public Function TryFindPoint (
	id As Guid,
	<OutAttribute> ByRef point As Point3d
) As Boolean
Parameters
id
Type: System.Guid
ID of point object to search for.
point
Type: Rhino.Geometry.Point3d
The point will be passed here.
Return Value
Type: Boolean
true on success; false if point was not found, id represented another geometry type, or on error.
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace