RhinoCommon API
RibbonOffsetParameters Constructor
Initializes a new instance of the RibbonOffsetParameters class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RibbonOffsetParameters()
Public Sub New
See Also
Reference
RibbonOffsetParameters Class
Rhino.Geometry Namespace