RhinoCommon API
Brep.CreateQuadSphere Method
 Constructs a Brep definition of a quad sphere.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep CreateQuadSphere(
	Sphere sphere
)
Public Shared Function CreateQuadSphere (
	sphere As Sphere
) As Brep
Parameters
sphere
Type: Rhino.Geometry.Sphere
The input sphere provides the orienting plane and radius.
Return Value
Type: Brep
A Brep if successful, null on error.
See Also
Reference
Brep Class
Rhino.Geometry Namespace