RhinoCommon API
CommonObject.FromJSON Method (Dictionary<String, String>)
 Create a CommonObject instance from a JSON dictionary
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static CommonObject FromJSON(
	Dictionary<string, string> jsonDictionary
)
Public Shared Function FromJSON (
	jsonDictionary As Dictionary(Of String, String)
) As CommonObject
Parameters
jsonDictionary
Type: System.Collections.Generic.Dictionary<String, String>
[Missing <param name="jsonDictionary"/> documentation for "M:Rhino.Runtime.CommonObject.FromJSON(System.Collections.Generic.Dictionary{System.String,System.String})"]
Return Value
Type: CommonObject
[Missing <returns> documentation for "M:Rhino.Runtime.CommonObject.FromJSON(System.Collections.Generic.Dictionary{System.String,System.String})"]
See Also
Reference
CommonObject Class
FromJSON Overload
Rhino.Runtime Namespace