RhinoCommon API
RhinoApp.InvokeOnUiThread Method
 Execute a function on the main UI thread.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void InvokeOnUiThread(
	Delegate method,
	params Object[] args
)
Public Shared Sub InvokeOnUiThread (
	method As Delegate,
	ParamArray args As Object()
)
Parameters
method
Type: System.Delegate
function to execute
args
Type: System.Object[]
parameters to pass to the function
See Also
Reference
RhinoApp Class
Rhino Namespace