RhinoCommon API
Brep.IsOrientedManifold Method
 Test a Brep to see if it is an oriented manifold. Non manifold Breps have at least one edge that is shared among three or more faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.26
Syntax
public bool IsOrientedManifold(
	out bool isOriented,
	out bool hasBoundary
)
Public Function IsOrientedManifold (
	<OutAttribute> ByRef isOriented As Boolean,
	<OutAttribute> ByRef hasBoundary As Boolean
) As Boolean
Parameters
isOriented
Type: System.Boolean
 Set to true if the Brep is an oriented manifold, or false if the Brep is not an oriented manifold.
hasBoundary
Type: System.Boolean
 Set to true if the Brep has a boundary edge, or false if the Brep does not have a boundary edge.
Return Value
Type: Boolean
 If the Brep is a manifold, true is returned. Otherwise false is returned.
See Also
Reference
Brep Class
Rhino.Geometry Namespace