RhinoCommon API
HostUtils.IsManagedDll Method
 Inspects a dll to see if it is compiled as native code or as a .NET assembly
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool IsManagedDll(
	string path
)
Public Shared Function IsManagedDll (
	path As String
) As Boolean
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.Runtime.HostUtils.IsManagedDll(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.IsManagedDll(System.String)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace