RhinoCommon API
UserInterfaceTextBox.OnTextChanged Method
 Called every time the text changes, once per keystroke. The default implementation raises the TextChanged event.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnTextChanged()
Protected Overridable Sub OnTextChanged
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace