RhinoCommon API
BezierSurface.MakeNonRational Method
Make bezier non-rational
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool MakeNonRational()
Public Function MakeNonRational As Boolean
Return Value
Type: Boolean
true if successful
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace