RhinoCommon API
FileSatWriteOptions Constructor
Initializes a new instance of the FileSatWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileSatWriteOptions()
Public Sub New
See Also
Reference
FileSatWriteOptions Class
Rhino.FileIO Namespace