RhinoCommon API
RealtimeDisplayMode.OpenGlVersion Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.OpenGlVersion"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int OpenGlVersion()
Public Function OpenGlVersion As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.OpenGlVersion"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace