RhinoCommon API
File3dm.IsValid Method (TextLog)
Note: This API is now obsolete.
 The File3dm object is kept consistent during its creation. Therefore, this function now returns only true.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
[ObsoleteAttribute("IsValid now returns always true.")]
public bool IsValid(
	TextLog errors
)
<ObsoleteAttribute("IsValid now returns always true.")>
Public Function IsValid (
	errors As TextLog
) As Boolean
Parameters
errors
Type: Rhino.FileIO.TextLog
 No errors are found.
Return Value
Type: Boolean
>true in any case.
See Also
Reference
File3dm Class
IsValid Overload
Rhino.FileIO Namespace