RhinoCommon API
RenderPlugIn.EnableCreateMaterialButton Method
 Called to enable/disable the "New" button located on the "Material" in the Properties and Layer dialog boxes. The default return value is false which will disable the button. If the button is disabled then the OnEditMaterial function is never called.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.12
Syntax
public virtual bool EnableCreateMaterialButton()
Public Overridable Function EnableCreateMaterialButton As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.RenderPlugIn.EnableCreateMaterialButton"]
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace