RhinoCommon API
HermiteSurface.UParameterAt Method
 Gets the "u" parameter at an index. These parameters are strictly increasing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double UParameterAt(
	int index
)
Public Function UParameterAt (
	index As Integer
) As Double
Parameters
index
Type: System.Int32
The index.
Return Value
Type: Double
The parameter.
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace