RhinoCommon API
NamedPositionTable.Append Method (Guid, IEnumerable<RhinoObject>)
Append objects to a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Append(
	Guid id,
	IEnumerable<RhinoObject> objects
)
Public Function Append (
	id As Guid,
	objects As IEnumerable(Of RhinoObject)
) As Boolean
Parameters
id
Type: System.Guid
 Guid of the Named Position which you want to append to.
objects
Type: System.Collections.Generic.IEnumerable<RhinoObject>
 Collection of Rhino Objects to be included in this Named Position.
Return Value
Type: Boolean
 True or False depending on whether the Append was successful.
See Also
Reference
NamedPositionTable Class
Append Overload
Rhino.DocObjects.Tables Namespace