RhinoCommon API
SurfaceFilletBase Constructor (BrepFace, Point2d, Curve, Double, Double, Double)
Initializes a new instance of the SurfaceFilletBase class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected SurfaceFilletBase(
	BrepFace face,
	Point2d uv,
	Curve rail3d,
	double u,
	double radius,
	double tolerance
)
Protected Sub New (
	face As BrepFace,
	uv As Point2d,
	rail3d As Curve,
	u As Double,
	radius As Double,
	tolerance As Double
)
Parameters
face
Type: Rhino.Geometry.BrepFace
[Missing <param name="face"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.Curve,System.Double,System.Double,System.Double)"]
uv
Type: Rhino.Geometry.Point2d
[Missing <param name="uv"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.Curve,System.Double,System.Double,System.Double)"]
rail3d
Type: Rhino.Geometry.Curve
[Missing <param name="rail3d"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.Curve,System.Double,System.Double,System.Double)"]
u
Type: System.Double
[Missing <param name="u"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.Curve,System.Double,System.Double,System.Double)"]
radius
Type: System.Double
[Missing <param name="radius"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.Curve,System.Double,System.Double,System.Double)"]
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.Curve,System.Double,System.Double,System.Double)"]
Exceptions
Exception | Condition
NullReferenceException
See Also
Reference
SurfaceFilletBase Class
SurfaceFilletBase Overload
Rhino.Geometry Namespace