RhinoCommon API
BrepFaceList.GetEnumerator Method
 Gets an enumerators that yields BrepFace objects.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IEnumerator<BrepFace> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepFace)
Return Value
Type: IEnumerator<BrepFace>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace