RhinoCommon API
File3dmShutLining.CurveRadius Method
 Returns the radius of the pipe used to create the shut-line for the given curve.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double CurveRadius(
	Guid curve_id
)
Public Function CurveRadius (
	curve_id As Guid
) As Double
Parameters
curve_id
Type: System.Guid
[Missing <param name="curve_id"/> documentation for "M:Rhino.FileIO.File3dmShutLining.CurveRadius(System.Guid)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmShutLining.CurveRadius(System.Guid)"]
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace