RhinoCommon API
ScaleValue.RightLengthValue Method
 Get the Right LengthValue from Scale
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LengthValue RightLengthValue()
Public Function RightLengthValue As LengthValue
Return Value
Type: LengthValue
[Missing <returns> documentation for "M:Rhino.ScaleValue.RightLengthValue"]
See Also
Reference
ScaleValue Class
Rhino Namespace