RhinoCommon API
FileAmfWriteOptions Constructor
Initializes a new instance of the FileAmfWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileAmfWriteOptions()
Public Sub New
See Also
Reference
FileAmfWriteOptions Class
Rhino.FileIO Namespace