RhinoCommon API
LinetypeTable.Find Method (Guid, Boolean)
Finds a linetype with a matching ID.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Find(
	Guid id,
	bool ignoreDeletedLinetypes
)
Public Function Find (
	id As Guid,
	ignoreDeletedLinetypes As Boolean
) As Integer
Parameters
id
Type: System.Guid
The ID of the line type to be found.
ignoreDeletedLinetypes
Type: System.Boolean
If true, deleted linetypes are not checked.
Return Value
Type: Int32
 If the linetype was found, the linetype index, >=0, is returned. If the linetype was not found, -1 is returned. Note, the linetype index of -1 denotes the default, or "Continuous" linetype.
See Also
Reference
LinetypeTable Class
Find Overload
Rhino.DocObjects.Tables Namespace