RhinoCommon API
Triangle3d.ClosestParameterOnBoundary Method
 Gets the parameter on the triangle boundary closest to a test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public double ClosestParameterOnBoundary(
	Point3d point
)
Public Function ClosestParameterOnBoundary (
	point As Point3d
) As Double
Parameters
point
Type: Rhino.Geometry.Point3d
[Missing <param name="point"/> documentation for "M:Rhino.Geometry.Triangle3d.ClosestParameterOnBoundary(Rhino.Geometry.Point3d)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Geometry.Triangle3d.ClosestParameterOnBoundary(Rhino.Geometry.Point3d)"]
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace