RhinoCommon API
ShortcutKeySettings.SetMacro Method (ShortcutKey, String)
 Set macro associated with a keyboard shortcut
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void SetMacro(
	ShortcutKey key,
	string macro
)
Public Shared Sub SetMacro (
	key As ShortcutKey,
	macro As String
)
Parameters
key
Type: Rhino.ApplicationSettings.ShortcutKey
[Missing <param name="key"/> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.SetMacro(Rhino.ApplicationSettings.ShortcutKey,System.String)"]
macro
Type: System.String
[Missing <param name="macro"/> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.SetMacro(Rhino.ApplicationSettings.ShortcutKey,System.String)"]
See Also
Reference
ShortcutKeySettings Class
SetMacro Overload
Rhino.ApplicationSettings Namespace