RhinoCommon API
AppearanceSettings.GetDefaultState Method (Boolean)
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static AppearanceSettingsState GetDefaultState(
	bool darkMode
)
Public Shared Function GetDefaultState (
	darkMode As Boolean
) As AppearanceSettingsState
Parameters
darkMode
Type: System.Boolean
[Missing <param name="darkMode"/> documentation for "M:Rhino.ApplicationSettings.AppearanceSettings.GetDefaultState(System.Boolean)"]
Return Value
Type: AppearanceSettingsState
An instance of a class that represents all the default settings joined together.
See Also
Reference
AppearanceSettings Class
GetDefaultState Overload
Rhino.ApplicationSettings Namespace