RhinoCommon API
CurveKinkDefinition.IsCurvatureKink Method (Vector3d, Vector3d)
 True if the angle between curvature_from_below and curvature_from_above is > KinkAngleDegrees or the ratio min/max < CurvatureKinkRadiusRatio, where min and max are the minimum and maximum lengths of curvatureFromBelow and v. Both of these tests are scale independent. If an input curvature vector has length <= CurvatureKinkZeroTolerance, then that curvature is treated as zero. When is CurvatureKinkZeroTolerance > 0, the test is scale dependent. The default value is chosen to work reasonably well for most models at most scales.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsCurvatureKink(
	Vector3d curvatureFromBelow,
	Vector3d curvatureFromAbove
)
Public Function IsCurvatureKink (
	curvatureFromBelow As Vector3d,
	curvatureFromAbove As Vector3d
) As Boolean
Parameters
curvatureFromBelow
Type: Rhino.Geometry.Vector3d
curvatureFromAbove
Type: Rhino.Geometry.Vector3d
Return Value
Type: Boolean
 True if either curvature vector is not valid or if, based on the tests described above, they are different enough to be considered a "curvature kink."
See Also
Reference
CurveKinkDefinition Class
IsCurvatureKink Overload
Rhino.Geometry Namespace