RhinoCommon API
RhinoApp.GetInstallDirectory Method
 Directory where all of Rhino is installed
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static DirectoryInfo GetInstallDirectory()
Public Shared Function GetInstallDirectory As DirectoryInfo
Return Value
Type: DirectoryInfo
[Missing <returns> documentation for "M:Rhino.RhinoApp.GetInstallDirectory"]
See Also
Reference
RhinoApp Class
Rhino Namespace