RhinoCommon API
File3dmPlugInDataTable.Dump Method
Prepares a text dump of table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Dump()
Public Function Dump As String
Return Value
Type: String
A string containing the dump.
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace