RhinoCommon API
PersistentSettings.GetRectangle Method (String, Rectangle)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetRectangle(System.String,System.Drawing.Rectangle)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Rectangle GetRectangle(
	string key,
	Rectangle defaultValue
)
Public Function GetRectangle (
	key As String,
	defaultValue As Rectangle
) As Rectangle
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetRectangle(System.String,System.Drawing.Rectangle)"]
defaultValue
Type: System.Drawing.Rectangle
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetRectangle(System.String,System.Drawing.Rectangle)"]
Return Value
Type: Rectangle
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetRectangle(System.String,System.Drawing.Rectangle)"]
See Also
Reference
PersistentSettings Class
GetRectangle Overload
Rhino Namespace