RhinoCommon API
Point3f.ToString Method (String, IFormatProvider)
Formats the value of the current instance using the specified format.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string ToString(
	string format,
	IFormatProvider formatProvider
)
Public Function ToString (
	format As String,
	formatProvider As IFormatProvider
) As String
Parameters
format
Type: System.String
The format to use. -or- A null reference (null in Visual Basic) to use the default format defined for the type of the IFormattable implementation.
formatProvider
Type: System.IFormatProvider
The provider to use to format the value. -or- A null reference (null in Visual Basic) to obtain the numeric format information from the current locale setting of the operating system.
Return Value
Type: String
The value of the current instance in the specified format.
Implements
IFormattable.ToString(String, IFormatProvider)
See Also
Reference
Point3f Structure
ToString Overload
Rhino.Geometry Namespace