RhinoCommon API
SupportOptions.LibrariesInitialLocationCustomFolder Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.LibrariesInitialLocationCustomFolder"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_InitialLocationCustomFolder' instead")]
public static string LibrariesInitialLocationCustomFolder()
<ObsoleteAttribute("Use 'Libraries_InitialLocationCustomFolder' instead")>
Public Shared Function LibrariesInitialLocationCustomFolder As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.LibrariesInitialLocationCustomFolder"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace