RhinoCommon API
NurbsCurveFitParameters Constructor
 Initializes a new instance of the NurbsCurveFitParameters class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public NurbsCurveFitParameters()
Public Sub New
See Also
Reference
NurbsCurveFitParameters Class
NurbsCurveFitParameters Overload
Rhino.Geometry Namespace