RhinoCommon API
PlugIn.Find Method (Assembly)
 Finds the plug-in instance that was loaded from a given assembly.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static PlugIn Find(
	Assembly pluginAssembly
)
Public Shared Function Find (
	pluginAssembly As Assembly
) As PlugIn
Parameters
pluginAssembly
Type: System.Reflection.Assembly
The plug-in assembly.
You can get the assembly instance at runtime with the Assembly instance property.
Return Value
Type: PlugIn
The assembly plug-in instance if successful. Otherwise, null.
See Also
Reference
PlugIn Class
Find Overload
Rhino.PlugIns Namespace