RhinoCommon API
File3dm.ReadSettings Method
 Reads only the start section, properties, and settings from a 3dm file at a specified location. The rest of the model (objects, layers, and other tables) is not read.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static File3dm ReadSettings(
	string path
)
Public Shared Function ReadSettings (
	path As String
) As File3dm
Parameters
path
Type: System.String
The file to read.
Return Value
Type: File3dm
new File3dm on success, null on error.
Exceptions
Exception | Condition
FileNotFoundException | If path does not exist.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace