RhinoCommon API
Quaternion.Subtraction Operator
 Subtracts a quaternion from another one.
This computes the difference of each quaternion coefficient with its correspondent and returns a new result quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Quaternion operator -(
	Quaternion a,
	Quaternion b
)
Public Shared Operator - (
	a As Quaternion,
	b As Quaternion
) As Quaternion
Parameters
a
Type: Rhino.Geometry.Quaternion
A quaternion.
b
Type: Rhino.Geometry.Quaternion
Another quaternion.
Return Value
Type: Quaternion
A new quaternion.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace