RhinoCommon API
ObjectTable.GetSelectedObjectCount Method
 Compute the current number of selected objects
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public uint GetSelectedObjectCount(
	bool checkSubObjects
)
Public Function GetSelectedObjectCount (
	checkSubObjects As Boolean
) As UInteger
Parameters
checkSubObjects
Type: System.Boolean
Check to see if subobjects are selected
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetSelectedObjectCount(System.Boolean)"]
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace