RhinoCommon API
FileExportPlugIn.DisplayOptionsDialog Method
[Missing <summary> documentation for "M:Rhino.PlugIns.FileExportPlugIn.DisplayOptionsDialog(System.IntPtr,System.String,System.String)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void DisplayOptionsDialog(
	IntPtr parent,
	string description,
	string extension
)
Protected Overridable Sub DisplayOptionsDialog (
	parent As IntPtr,
	description As String,
	extension As String
)
Parameters
parent
Type: System.IntPtr
[Missing <param name="parent"/> documentation for "M:Rhino.PlugIns.FileExportPlugIn.DisplayOptionsDialog(System.IntPtr,System.String,System.String)"]
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.PlugIns.FileExportPlugIn.DisplayOptionsDialog(System.IntPtr,System.String,System.String)"]
extension
Type: System.String
[Missing <param name="extension"/> documentation for "M:Rhino.PlugIns.FileExportPlugIn.DisplayOptionsDialog(System.IntPtr,System.String,System.String)"]
See Also
Reference
FileExportPlugIn Class
Rhino.PlugIns Namespace