RhinoCommon API
NamedColor Constructor
 Initializes a new instance of the ColorListEntry with the specified name and color.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public NamedColor(
	string name,
	Color color
)
Public Sub New (
	name As String,
	color As Color
)
Parameters
name
Type: System.String
Name of this color
color
Type: System.Drawing.Color
Color value
See Also
Reference
NamedColor Class
Rhino.UI Namespace