RhinoCommon API
ContentFactory.Dispose Method
Releases all resources used by the ContentFactory
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ContentFactory Class
Rhino.Render.DataSources Namespace