RhinoCommon API
DracoCompression.DecompressFile Method
 Read compressed data from disk and decompress to RhinoCommon geometry
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static GeometryBase DecompressFile(
	string path
)
Public Shared Function DecompressFile (
	path As String
) As GeometryBase
Parameters
path
Type: System.String
path to read from
Return Value
Type: GeometryBase
Mesh or point cloud on success. null on failure
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace