RhinoCommon API
MeshIntersectionCache.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
MeshIntersectionCache Class
Dispose Overload
Rhino.Geometry.Intersect Namespace