RhinoCommon API
FileFbxReadOptions Constructor
Initializes a new instance of the FileFbxReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileFbxReadOptions()
Public Sub New
See Also
Reference
FileFbxReadOptions Class
Rhino.FileIO Namespace