RhinoCommon API
ViewCapture.SendToPrinter Method (String, ViewCaptureSettings[], Int32)
 Send a list of view capture settings to a printer. Each setting represents a single page.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool SendToPrinter(
	string printerName,
	ViewCaptureSettings[] settings,
	int copies
)
Public Shared Function SendToPrinter (
	printerName As String,
	settings As ViewCaptureSettings(),
	copies As Integer
) As Boolean
Parameters
printerName
Type: System.String
[Missing <param name="printerName"/> documentation for "M:Rhino.Display.ViewCapture.SendToPrinter(System.String,Rhino.Display.ViewCaptureSettings[],System.Int32)"]
settings
Type: Rhino.Display.ViewCaptureSettings[]
[Missing <param name="settings"/> documentation for "M:Rhino.Display.ViewCapture.SendToPrinter(System.String,Rhino.Display.ViewCaptureSettings[],System.Int32)"]
copies
Type: System.Int32
number of copies to print
Return Value
Type: Boolean
true on success
See Also
Reference
ViewCapture Class
SendToPrinter Overload
Rhino.Display Namespace