RhinoCommon API
Surface.IsoCurve Method (IsoStatus, Double)
 Gets isoparametric curve. None is not supported, and X and Y need valid t-values in the U- or V-domain respectively.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Curve IsoCurve(
	IsoStatus iso,
	double t
)
Public Function IsoCurve (
	iso As IsoStatus,
	t As Double
) As Curve
Parameters
iso
Type: Rhino.Geometry.IsoStatus
North returns the curve where U varies and V is V_max (paramter t is ignored) East returns the curve where V varies and U is U_max (paramter t is ignored) South returns the curve where U varies and V is V_min (paramter t is ignored) West returns the curve where V varies and U is U_min (paramter t is ignored) X returns the curve where V varies and U is t (if t is inside the U-domain) Y returns the curve where U varies and V is t (if t is inside the V-domain)
t
Type: System.Double
the parameter used if iso is X or Y.
Return Value
Type: Curve
An isoparametric curve or null on error.
See Also
Reference
Surface Class
IsoCurve Overload
Rhino.Geometry Namespace