RhinoCommon API
File3dmObjectTable.Add Method (GeometryBase, ObjectAttributes)
 Duplicates the object, then adds a copy of the object to the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid Add(
	GeometryBase item,
	ObjectAttributes attributes
)
Public Function Add (
	item As GeometryBase,
	attributes As ObjectAttributes
) As Guid
Parameters
item
Type: Rhino.Geometry.GeometryBase
The item to duplicate and add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
The attributes to link with geometry.
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmObjectTable.Add(Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
File3dmObjectTable Class
Add Overload
Rhino.FileIO Namespace