RhinoCommon API
RenderContent.OnGetDefaultsInteractive Method
 Override this method to prompt user for information necessary to create a new content object. For example, if you are created a textured material you may prompt the user for a bitmap file name prior to creating the textured material.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool OnGetDefaultsInteractive()
Protected Overridable Function OnGetDefaultsInteractive As Boolean
Return Value
Type: Boolean
 If true is returned the content is created otherwise the creation is aborted.
See Also
Reference
RenderContent Class
Rhino.Render Namespace