RhinoCommon API
SubDDisplayParameters.AbsoluteDisplayDensityFromSubDFaceCount Method
Note: This API is now obsolete.
 Gets the absolute SubD display density for SubD with subdFaceCount faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
[ObsoleteAttribute("Use AbsoluteDisplayDensityFromSubD")]
public static uint AbsoluteDisplayDensityFromSubDFaceCount(
	uint adaptiveSubDDisplayDensity,
	uint subDFaceCount
)
<ObsoleteAttribute("Use AbsoluteDisplayDensityFromSubD")>
Public Shared Function AbsoluteDisplayDensityFromSubDFaceCount (
	adaptiveSubDDisplayDensity As UInteger,
	subDFaceCount As UInteger
) As UInteger
Parameters
adaptiveSubDDisplayDensity
Type: System.UInt32
 A value <= SubDDisplayParameters.Density.MaximumDensity. When in doubt, pass SubDDisplayParameters.Density.DefaultDensity.
subDFaceCount
Type: System.UInt32
Number of SubD faces.
Return Value
Type: UInt32
 The absolute SubD display density is <= adaptiveSubDDisplayDensity and <= SubDDisplayParameters.Density.MaximumDensity.
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace