RhinoCommon API
Panels.ClosePanel Method (Type, RhinoDoc)
 Will close or hide the specified panel type, in Windows Rhino, if it is the only visible tab the tab dock bar will be closed as well. In Mac Rhino it will always close the modeless dialog hosting the panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public static void ClosePanel(
	Type panelType,
	RhinoDoc doc
)
Public Shared Sub ClosePanel (
	panelType As Type,
	doc As RhinoDoc
)
Parameters
panelType
Type: System.Type
 Class type of the panel to close.
doc
Type: Rhino.RhinoDoc
 Document associated with panel you wish to close.
See Also
Reference
Panels Class
ClosePanel Overload
Rhino.UI Namespace