RhinoCommon API
TextFields.BlockDescription Method
 Returns a block definition description
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string BlockDescription(
	string definitionNameOrId
)
Public Shared Function BlockDescription (
	definitionNameOrId As String
) As String
Parameters
definitionNameOrId
Type: System.String
[Missing <param name="definitionNameOrId"/> documentation for "M:Rhino.Runtime.TextFields.BlockDescription(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.BlockDescription(System.String)"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace