RhinoCommon API
SubDEdgeSharpness.FromIntervalPercentage Method (Double, Double)
 Creates a sharpness that varies from one end of the edge to the other, from percentages. This is useful in user interface code that expresses sharpness as a percentage.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static SubDEdgeSharpness FromIntervalPercentage(
	double percentage0,
	double percentage1
)
Public Shared Function FromIntervalPercentage (
	percentage0 As Double,
	percentage1 As Double
) As SubDEdgeSharpness
Parameters
percentage0
Type: System.Double
 Percentage at the start of the edge, between 0.0 and 100.0, or MaxValue for a crease.
percentage1
Type: System.Double
 Percentage at the end of the edge, between 0.0 and 100.0, or MaxValue for a crease.
Return Value
Type: SubDEdgeSharpness
 A sharpness running from (percentage0 * MaximumValue / 100.0) to (percentage1 * MaximumValue / 100.0), Crease if both percentages are MaxValue, or Nan otherwise. An edge is either a crease or it is not, so mixing MaxValue with a percentage gives Nan.
See Also
Reference
SubDEdgeSharpness Structure
FromIntervalPercentage Overload
Rhino.Geometry Namespace