RhinoCommon API
FileCsvDocument.TryGetGuid Method (String, Int32, Guid)
 Retrieves the value of a cell as a globally unique identifier, addressing the column by header name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetGuid(
	string column,
	int row,
	out Guid value
)
Public Function TryGetGuid (
	column As String,
	row As Integer,
	<OutAttribute> ByRef value As Guid
) As Boolean
Parameters
column
Type: System.String
The header name of the column.
row
Type: System.Int32
The zero-based data-row index (y).
value
Type: System.Guid
The parsed value, or Empty if the column or cell does not exist or cannot be parsed.
Return Value
Type: Boolean
true if the column and cell exist and were parsed; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetGuid Overload
Rhino.FileIO Namespace