RhinoCommon API
FileStpReadOptions.ToDictionary Method
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Import function
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public ArchivableDictionary ToDictionary()
Public Function ToDictionary As ArchivableDictionary
Return Value
Type: ArchivableDictionary
[Missing <returns> documentation for "M:Rhino.FileIO.FileStpReadOptions.ToDictionary"]
See Also
Reference
FileStpReadOptions Class
Rhino.FileIO Namespace