RhinoCommon API
FieldDictionary.AddTextured Method (String, Point2d, String, Boolean)
 Add a new Point2dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Point2dField AddTextured(
	string key,
	Point2d value,
	string prompt,
	bool treatAsLinear
)
Public Function AddTextured (
	key As String,
	value As Point2d,
	prompt As String,
	treatAsLinear As Boolean
) As Point2dField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: Rhino.Geometry.Point2d
Initial value for this field.
prompt
Type: System.String
 Prompt to display in the user interface (Content Browsers) if this is null or an empty string the this field is a data only field and will not appear in the user interface.
treatAsLinear
Type: System.Boolean
Determines whether the texture in this slot will be treated as linear by rendering engines (ie - not gamma packed).
Return Value
Type: Point2dField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Geometry.Point2d,System.String,System.Boolean)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
AddTextured Overload
Rhino.Render.Fields Namespace