RhinoCommon API
FileSwReadOptions Constructor
Initializes a new instance of the FileSwReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileSwReadOptions()
Public Sub New
See Also
Reference
FileSwReadOptions Class
Rhino.FileIO Namespace