RhinoCommon API
DimensionStyle.Duplicate Method (String, Guid, Guid)
 Construct a deep (full) copy of this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle Duplicate(
	string newName,
	Guid newId,
	Guid newParentId
)
Public Function Duplicate (
	newName As String,
	newId As Guid,
	newParentId As Guid
) As DimensionStyle
Parameters
newName
Type: System.String
[Missing <param name="newName"/> documentation for "M:Rhino.DocObjects.DimensionStyle.Duplicate(System.String,System.Guid,System.Guid)"]
newId
Type: System.Guid
[Missing <param name="newId"/> documentation for "M:Rhino.DocObjects.DimensionStyle.Duplicate(System.String,System.Guid,System.Guid)"]
newParentId
Type: System.Guid
[Missing <param name="newParentId"/> documentation for "M:Rhino.DocObjects.DimensionStyle.Duplicate(System.String,System.Guid,System.Guid)"]
Return Value
Type: DimensionStyle
An object of the same type as this, with the same properties and behavior.
See Also
Reference
DimensionStyle Class
Duplicate Overload
Rhino.DocObjects Namespace