RhinoCommon API
SurfaceCurvature.Direction Method
 Gets the principal curvature direction vector at the u,v parameter where the surface curvature was evaluated..
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d Direction(
	int direction
)
Public Function Direction (
	direction As Integer
) As Vector3d
Parameters
direction
Type: System.Int32
Direction index, valid values are 0 and 1.
Return Value
Type: Vector3d
The specified direction vector.
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace