RhinoCommon API
RenderContent.SetParameter Method (String, Object)
 Set the named parameter value for this content instance. If you do not support this parameter, call the base class.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool SetParameter(
	string parameterName,
	Object value
)
Public Overridable Function SetParameter (
	parameterName As String,
	value As Object
) As Boolean
Parameters
parameterName
Type: System.String
[Missing <param name="parameterName"/> documentation for "M:Rhino.Render.RenderContent.SetParameter(System.String,System.Object)"]
value
Type: System.Object
[Missing <param name="value"/> documentation for "M:Rhino.Render.RenderContent.SetParameter(System.String,System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.SetParameter(System.String,System.Object)"]
See Also
Reference
RenderContent Class
SetParameter Overload
Rhino.Render Namespace