RhinoCommon API
Field.ValueAsTransform Method
 Return field as a Rhino.Geometry.Transform color value.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Transform ValueAsTransform()
Protected Function ValueAsTransform As Transform
Return Value
Type: Transform
Return field as a Rhino.Geometry.Transform color value.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace