RhinoCommon API
Transform.Mirror Method (Plane)
 Constructs a new Mirror transformation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Transform Mirror(
	Plane mirrorPlane
)
Public Shared Function Mirror (
	mirrorPlane As Plane
) As Transform
Parameters
mirrorPlane
Type: Rhino.Geometry.Plane
Plane that defines the mirror orientation and position.
Return Value
Type: Transform
A transformation matrix which mirrors geometry in a specified plane.
See Also
Reference
Transform Structure
Mirror Overload
Rhino.Geometry Namespace