RhinoCommon API
HatchPattern.WriteToFile Method (String, IEnumerable<HatchPattern>)
 Writes one or more hatch pattern defintions to a file.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public static bool WriteToFile(
	string filename,
	IEnumerable<HatchPattern> hatchPatterns
)
Public Shared Function WriteToFile (
	filename As String,
	hatchPatterns As IEnumerable(Of HatchPattern)
) As Boolean
Parameters
filename
Type: System.String
Name of file to create. If file exists, it will be overwritten.
hatchPatterns
Type: System.Collections.Generic.IEnumerable<HatchPattern>
The enumeration of hatch patterns to write.
Return Value
Type: Boolean
True if successful, false otherwise.
Remarks
Output file is in AutoCAD .PAT format.
See Also
Reference
HatchPattern Class
WriteToFile Overload
Rhino.DocObjects Namespace