RhinoCommon API
SupportOptions.BlockContent_SetShowDocuments Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.BlockContent_SetShowDocuments(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void BlockContent_SetShowDocuments(
	bool b
)
Public Shared Sub BlockContent_SetShowDocuments (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.BlockContent_SetShowDocuments(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace