RhinoCommon API
Brep.CreateDevelopableLoft Method (Curve, Curve, Boolean, Boolean, Int32)
 Creates a single developable surface between two curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public static Brep[] CreateDevelopableLoft(
	Curve crv0,
	Curve crv1,
	bool reverse0,
	bool reverse1,
	int density
)
Public Shared Function CreateDevelopableLoft (
	crv0 As Curve,
	crv1 As Curve,
	reverse0 As Boolean,
	reverse1 As Boolean,
	density As Integer
) As Brep()
Parameters
crv0
Type: Rhino.Geometry.Curve
The first rail curve.
crv1
Type: Rhino.Geometry.Curve
The second rail curve.
reverse0
Type: System.Boolean
Reverse the first rail curve.
reverse1
Type: System.Boolean
Reverse the second rail curve
density
Type: System.Int32
The number of rulings across the surface.
Return Value
Type: Brep[]
The output Breps if successful, otherwise an empty array.
See Also
Reference
Brep Class
CreateDevelopableLoft Overload
Rhino.Geometry Namespace