RhinoCommon API
NamedParametersEventArgs Constructor
 Construct a new named parameter even args. You should dispose this class when you are done with it
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public NamedParametersEventArgs()
Public Sub New
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace