RhinoCommon API
FileIgs.Write Method
Write a Igs file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	FileIgsWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As FileIgsWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileIgsWriteOptions
options used for generating the Igs file
Return Value
Type: Boolean
true on success
See Also
Reference
FileIgs Class
Rhino.FileIO Namespace