RhinoCommon API
DisplayPipeline.DrawBoxCorners Method (BoundingBox, Color)
 Draws corner widgets of a world aligned bounding box. Widget size will be 5% of the Box diagonal.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DrawBoxCorners(
	BoundingBox box,
	Color color
)
Public Sub DrawBoxCorners (
	box As BoundingBox,
	color As Color
)
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to draw.
color
Type: System.Drawing.Color
Color to draw with.
See Also
Reference
DisplayPipeline Class
DrawBoxCorners Overload
Rhino.Display Namespace