RhinoCommon API
IShrinkWrapService.ShrinkWrap Method (IEnumerable<Mesh>, ShrinkWrapParameters)
 Create mesh from input meshes. Null on error or incompatible settings
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
Mesh ShrinkWrap(
	IEnumerable<Mesh> meshes,
	ShrinkWrapParameters parameters
)
Function ShrinkWrap (
	meshes As IEnumerable(Of Mesh),
	parameters As ShrinkWrapParameters
) As Mesh
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
[Missing <param name="meshes"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters)"]
parameters
Type: Rhino.Geometry.ShrinkWrapParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters)"]
See Also
Reference
IShrinkWrapService Interface
ShrinkWrap Overload
Rhino.Runtime Namespace