RhinoCommon API
RdkSelectionNavigator.GoForwards Method
 Navigate forwards if possible
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GoForwards(
	ref RenderContentCollection selectedContentArray
)
Public Function GoForwards (
	ByRef selectedContentArray As RenderContentCollection
) As Boolean
Parameters
selectedContentArray
Type: Rhino.Render.RenderContentCollection
selectedContentArray is the new selection after navigating forwards
Return Value
Type: Boolean
true on success, else false
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace