RhinoCommon API
ObjectPropertiesPage.UpdatePage Method
 Called on the active page after the selected objects list has changed to notify the page to initialize its content to reflect the new object list.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual void UpdatePage(
	ObjectPropertiesPageEventArgs e
)
Public Overridable Sub UpdatePage (
	e As ObjectPropertiesPageEventArgs
)
Parameters
e
Type: Rhino.UI.ObjectPropertiesPageEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.UpdatePage(Rhino.UI.ObjectPropertiesPageEventArgs)"]
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace