RhinoCommon API
ViewTable.ImportPageView Method
 Imports a page view, or layout, from a Rhino file into this document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ImportPageView(
	string filename,
	Guid mainViewportId,
	string pageName
)
Public Function ImportPageView (
	filename As String,
	mainViewportId As Guid,
	pageName As String
) As Boolean
Parameters
filename
Type: System.String
The name of Rhino file to read from.
mainViewportId
Type: System.Guid
The id of the page view on the Rhino file.
pageName
Type: System.String
The name to give the newly imported page view.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ViewTable.ImportPageView(System.String,System.Guid,System.String)"]
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace