RhinoCommon API
SupportOptions.FileExplorer_UseDefaultLocation Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.FileExplorer_UseDefaultLocation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool FileExplorer_UseDefaultLocation()
Public Shared Function FileExplorer_UseDefaultLocation As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.FileExplorer_UseDefaultLocation"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace