RhinoCommon API
FileCsvDocument.Set Method (Int32, Int32, String)
 Sets the value of a cell, addressed by column and row. Rows are added as needed (any intervening rows are created and filled with empty fields), but the column count is fixed.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Set(
	int column,
	int row,
	string value
)
Public Sub Set (
	column As Integer,
	row As Integer,
	value As String
)
Parameters
column
Type: System.Int32
The zero-based column index (x). Must be less than ColumnCount.
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.String
The value to store. A null value is stored as an empty field.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when row is negative, or column is negative or not less than ColumnCount.
See Also
Reference
FileCsvDocument Class
Set Overload
Rhino.FileIO Namespace