RhinoCommon API
RhinoApp.SetFocusToMainWindow Method (RhinoDoc)
 Sets the focus to the main windows for a given document
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.16
Syntax
public static void SetFocusToMainWindow(
	RhinoDoc doc
)
Public Shared Sub SetFocusToMainWindow (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
 the document to use for determining a "main window"
See Also
Reference
RhinoApp Class
SetFocusToMainWindow Overload
Rhino Namespace