RhinoCommon API
SurfaceCurvature.CompareTo Method
 Compares the current instance with another object of the same type and returns an integer that indicates whether the current instance precedes, follows, or occurs in the same position in the sort order as the other object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int CompareTo(
	SurfaceCurvature other
)
Public Function CompareTo (
	other As SurfaceCurvature
) As Integer
Parameters
other
Type: Rhino.Geometry.SurfaceCurvature
An object to compare with this instance.
Return Value
Type: Int32
 A value that indicates the relative order of the objects being compared. The return value has these meanings: Less than zero - this instance precedes other in the sort order. Zero - this instance occurs in the same position in the sort order as other. Greater than zero - this instance follows other in the sort order.
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace