RhinoCommon API
ColorGradient.Duplicate Method
 Create a duplicate of this color gradient.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public ColorGradient Duplicate()
Public Function Duplicate As ColorGradient
Return Value
Type: ColorGradient
An exact duplicate of this color gradient.
See Also
Reference
ColorGradient Class
Rhino.Display Namespace