RhinoCommon API
RenderMeshProvider.HasCustomRenderMeshes Method
 Determine if custom render primitives will be supplied for a particular object.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public abstract bool HasCustomRenderMeshes(
	MeshType mt,
	ViewportInfo vp,
	RhinoDoc doc,
	Guid objectId,
	ref RenderMeshProvider.Flags flags,
	PlugIn plugin,
	DisplayPipelineAttributes attrs
)
Public MustOverride Function HasCustomRenderMeshes (
	mt As MeshType,
	vp As ViewportInfo,
	doc As RhinoDoc,
	objectId As Guid,
	ByRef flags As RenderMeshProvider.Flags,
	plugin As PlugIn,
	attrs As DisplayPipelineAttributes
) As Boolean
Parameters
mt
Type: Rhino.Geometry.MeshType
The mesh type to provide meshes for
vp
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered
doc
Type: Rhino.RhinoDoc
The Rhino document associated with the objectId
objectId
Type: System.Guid
The objectId for which the primitives should be supplied.
flags
Type: Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags
See RenderMeshProvider.Flags. This is an in/out parameter: set Incomplete on return if the meshes supplied are provisional because asynchronous work has not finished.
plugin
Type: Rhino.PlugIns.PlugIn
The requesting plug-in - typically the render plug-in requesting the primitives.
attrs
Type: Rhino.Display.DisplayPipelineAttributes
The display attributes currently being used - nullptr if this is production rendering.
Return Value
Type: Boolean
True if RenderMeshes will return a set of primitives, otherwise false. RenderMeshes may still return an empty collection - in case of cancelation something similar.
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace