RhinoCommon API
SubDEdge.ToNurbsCurve Method
 Get a cubic, uniform, non-rational, NURBS curve that is on the edge's limit curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public NurbsCurve ToNurbsCurve(
	bool clampEnds
)
Public Function ToNurbsCurve (
	clampEnds As Boolean
) As NurbsCurve
Parameters
clampEnds
Type: System.Boolean
 If true, the end knots are clamped. Otherwise the end knots are(-2,-1,0,...., k1, k1+1, k1+2).
Return Value
Type: NurbsCurve
The Nurbs form of this edge.
Remarks
 If some edges in your SubD are not able to be converted to NURBS, you might need to run UpdateSurfaceMeshCache(Boolean).
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace
SubD.UpdateSurfaceMeshCache(Boolean)