RhinoCommon API
RenderMaterial.AssignTo Method (IEnumerable<ObjRef>, RenderMaterial.AssignToSubFaceChoices, RenderMaterial.AssignToBlockChoices, Boolean)
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.AssignTo(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef},Rhino.Render.RenderMaterial.AssignToSubFaceChoices,Rhino.Render.RenderMaterial.AssignToBlockChoices,System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.13
Syntax
public bool AssignTo(
	IEnumerable<ObjRef> objrefs,
	RenderMaterial.AssignToSubFaceChoices sfc,
	RenderMaterial.AssignToBlockChoices bc,
	bool bInteractive
)
Public Function AssignTo (
	objrefs As IEnumerable(Of ObjRef),
	sfc As RenderMaterial.AssignToSubFaceChoices,
	bc As RenderMaterial.AssignToBlockChoices,
	bInteractive As Boolean
) As Boolean
Parameters
objrefs
Type: System.Collections.Generic.IEnumerable<ObjRef>
[Missing <param name="objrefs"/> documentation for "M:Rhino.Render.RenderMaterial.AssignTo(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef},Rhino.Render.RenderMaterial.AssignToSubFaceChoices,Rhino.Render.RenderMaterial.AssignToBlockChoices,System.Boolean)"]
sfc
Type: Rhino.Render.RenderMaterial.AssignToSubFaceChoices
[Missing <param name="sfc"/> documentation for "M:Rhino.Render.RenderMaterial.AssignTo(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef},Rhino.Render.RenderMaterial.AssignToSubFaceChoices,Rhino.Render.RenderMaterial.AssignToBlockChoices,System.Boolean)"]
bc
Type: Rhino.Render.RenderMaterial.AssignToBlockChoices
[Missing <param name="bc"/> documentation for "M:Rhino.Render.RenderMaterial.AssignTo(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef},Rhino.Render.RenderMaterial.AssignToSubFaceChoices,Rhino.Render.RenderMaterial.AssignToBlockChoices,System.Boolean)"]
bInteractive
Type: System.Boolean
[Missing <param name="bInteractive"/> documentation for "M:Rhino.Render.RenderMaterial.AssignTo(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef},Rhino.Render.RenderMaterial.AssignToSubFaceChoices,Rhino.Render.RenderMaterial.AssignToBlockChoices,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.AssignTo(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef},Rhino.Render.RenderMaterial.AssignToSubFaceChoices,Rhino.Render.RenderMaterial.AssignToBlockChoices,System.Boolean)"]
See Also
Reference
RenderMaterial Class
AssignTo Overload
Rhino.Render Namespace