RhinoCommon API
PersistentSettings.SetDefault Method (String, KeyValuePair<String, String>[])
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[])"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDefault(
	string key,
	KeyValuePair<string, string>[] value
)
Public Sub SetDefault (
	key As String,
	value As KeyValuePair(Of String, String)()
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[])"]
value
Type: System.Collections.Generic.KeyValuePair<String, String>[]
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[])"]
See Also
Reference
PersistentSettings Class
SetDefault Overload
Rhino Namespace