RhinoCommon API
DisplayPipeline.PushModelTransform Method
 Push a model transformation on the engine's model transform stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void PushModelTransform(
	Transform xform
)
Public Sub PushModelTransform (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to push.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace