RhinoCommon API
RenderContentCollection.GetForcedVaries Method
 See SetForcedVaries
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.9
Syntax
public bool GetForcedVaries()
Public Function GetForcedVaries As Boolean
Return Value
Type: Boolean
Forced varies
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace