RhinoCommon API
Mesh.MergeAllCoplanarFaces Method (Double, Double)
 Merges adjacent coplanar faces into single faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public bool MergeAllCoplanarFaces(
	double tolerance,
	double angleTolerance
)
Public Function MergeAllCoplanarFaces (
	tolerance As Double,
	angleTolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
 Tolerance for determining when edges are adjacent. When in doubt, use the document's ModelAbsoluteTolerance property.
angleTolerance
Type: System.Double
 Angle tolerance, in radians, for determining when faces are parallel. When in doubt, use the document's ModelAngleToleranceRadians property.
Return Value
Type: Boolean
true if faces were merged, false if no faces were merged.
See Also
Reference
Mesh Class
MergeAllCoplanarFaces Overload
Rhino.Geometry Namespace