RhinoCommon API
RenderContent.Initialize Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.Initialize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
[ObsoleteAttribute("This method should not be called.")]
public bool Initialize()
<ObsoleteAttribute("This method should not be called.")>
Public Function Initialize As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.Initialize"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace