RhinoCommon API
ColorLAB.CreateFromCMYK Method
 Create the nearest LAB equivalent of a CMYK color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static ColorLAB CreateFromCMYK(
	ColorCMYK cmyk
)
Public Shared Function CreateFromCMYK (
	cmyk As ColorCMYK
) As ColorLAB
Parameters
cmyk
Type: Rhino.Display.ColorCMYK
Target color in CMYK space.
Return Value
Type: ColorLAB
The LAB equivalent of the CMYK color.
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace