RhinoCommon API
ObjectTable.GetObjectIdList Method
 Returns an enumerable based on a ObjectEnumeratorSettings filter.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.25
Syntax
public IEnumerable<Guid> GetObjectIdList(
	ObjectEnumeratorSettings settings
)
Public Function GetObjectIdList (
	settings As ObjectEnumeratorSettings
) As IEnumerable(Of Guid)
Parameters
settings
Type: Rhino.DocObjects.ObjectEnumeratorSettings
The ObjectEnumeratorSettings settings.
Return Value
Type: IEnumerable<Guid>
The enumerable.
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace