RhinoCommon API
HostUtils.CreateCommands Method (IntPtr, Assembly)
 Parses a plugin and create all the commands defined therein.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int CreateCommands(
	IntPtr pPlugIn,
	Assembly pluginAssembly
)
Public Shared Function CreateCommands (
	pPlugIn As IntPtr,
	pluginAssembly As Assembly
) As Integer
Parameters
pPlugIn
Type: System.IntPtr
Plugin to harvest for commands.
pluginAssembly
Type: System.Reflection.Assembly
Assembly associated with the plugin.
Return Value
Type: Int32
The number of newly created commands.
See Also
Reference
HostUtils Class
CreateCommands Overload
Rhino.Runtime Namespace