RhinoCommon API
NurbsSurface.MakeRational Method
 Makes this surface rational.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool MakeRational()
Public Function MakeRational As Boolean
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace