RhinoCommon API
IShrinkWrapService.ShrinkWrap Method (Mesh, ShrinkWrapParameters, CancellationToken)
 Create a shrinkwrap from a single mesh Null on error or incompatible settings
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
Mesh ShrinkWrap(
	Mesh mesh,
	ShrinkWrapParameters parameters,
	CancellationToken cancellationToken
)
Function ShrinkWrap (
	mesh As Mesh,
	parameters As ShrinkWrapParameters,
	cancellationToken As CancellationToken
) As Mesh
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.Mesh,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
parameters
Type: Rhino.Geometry.ShrinkWrapParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.Mesh,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
cancellationToken
Type: System.Threading.CancellationToken
[Missing <param name="cancellationToken"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.Mesh,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.Mesh,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
See Also
Reference
IShrinkWrapService Interface
ShrinkWrap Overload
Rhino.Runtime Namespace