RhinoCommon API
ViewTable.AddPageView Method (String)
 Constructs a new page view with a given title and, at the same time, adds it to the list. On Windows the new page view becomes the active view; on Mac the active view does not change. Use the overload with a setActive parameter for behavior that is consistent across platforms.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoPageView AddPageView(
	string title
)
Public Function AddPageView (
	title As String
) As RhinoPageView
Parameters
title
Type: System.String
 If null or empty, a name will be generated as "Page #" where # is the largest page number.
Return Value
Type: RhinoPageView
The newly created page view on success; or null on error.
See Also
Reference
ViewTable Class
AddPageView Overload
Rhino.DocObjects.Tables Namespace