RhinoCommon API
Transform.Linearize Method
 Affinitize() and replaces the last column with (0 0 0 1)^T, discarding any translation part of this transform.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public void Linearize()
Public Sub Linearize
See Also
Reference
Transform Structure
Rhino.Geometry Namespace