RhinoCommon API
Mesh.Unweld Method
 Makes sure that faces sharing an edge and having a difference of normal greater than or equal to angleToleranceRadians have unique vertices along that edge, adding vertices if necessary.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Unweld(
	double angleToleranceRadians,
	bool modifyNormals
)
Public Sub Unweld (
	angleToleranceRadians As Double,
	modifyNormals As Boolean
)
Parameters
angleToleranceRadians
Type: System.Double
Angle at which to make unique vertices.
modifyNormals
Type: System.Boolean
 Determines whether new vertex normals will have the same vertex normal as the original (false) or vertex normals made from the corresponding face normals (true)
See Also
Reference
Mesh Class
Rhino.Geometry Namespace