RhinoCommon API
PointCloudUnsafeLock.Release Method
 Releases the lock and updates the underlying unmanaged data structures.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Release()
Public Sub Release
See Also
Reference
PointCloudUnsafeLock Class
Rhino.Geometry Namespace