RhinoCommon API
File3dmObjectTable.AddOrdinateDimension Method (OrdinateDimension, ObjectAttributes)
 Adds an ordinate dimension object to the 3dm file object table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.32
Syntax
public Guid AddOrdinateDimension(
	OrdinateDimension dimension,
	ObjectAttributes attributes
)
Public Function AddOrdinateDimension (
	dimension As OrdinateDimension,
	attributes As ObjectAttributes
) As Guid
Parameters
dimension
Type: Rhino.Geometry.OrdinateDimension
Dimension object to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to dimension.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddOrdinateDimension Overload
Rhino.FileIO Namespace