RhinoCommon API
ExpandableContentUI.AddSection Method (ICollapsibleSection, IRdkViewModel)
 Add a section to the UI with a custom controller. Called \e before Create().
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public virtual void AddSection(
	ICollapsibleSection pSection,
	IRdkViewModel vm
)
Public Overridable Sub AddSection (
	pSection As ICollapsibleSection,
	vm As IRdkViewModel
)
Parameters
pSection
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="pSection"/> documentation for "M:Rhino.UI.Controls.ExpandableContentUI.AddSection(Rhino.UI.Controls.ICollapsibleSection,Rhino.UI.Controls.IRdkViewModel)"]
vm
Type: Rhino.UI.Controls.IRdkViewModel
[Missing <param name="vm"/> documentation for "M:Rhino.UI.Controls.ExpandableContentUI.AddSection(Rhino.UI.Controls.ICollapsibleSection,Rhino.UI.Controls.IRdkViewModel)"]
See Also
Reference
ExpandableContentUI Class
AddSection Overload
Rhino.UI.Controls Namespace