RhinoCommon API
SectionStyleTable.InUse Method
 Returns true if a section style is use by an object, layer, or instance definition.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool InUse(
	int index,
	out int instanceDefinitionCount,
	out int objectCount,
	out int layerCount
)
Public Function InUse (
	index As Integer,
	<OutAttribute> ByRef instanceDefinitionCount As Integer,
	<OutAttribute> ByRef objectCount As Integer,
	<OutAttribute> ByRef layerCount As Integer
) As Boolean
Parameters
index
Type: System.Int32
The index of the section style to query.
instanceDefinitionCount
Type: System.Int32
The number of instance definitions using this section style.
objectCount
Type: System.Int32
The number of Rhino objects using this section style.
layerCount
Type: System.Int32
The number of layers using this section style.
Return Value
Type: Boolean
True if the section style is in use, false otherwise.
See Also
Reference
SectionStyleTable Class
Rhino.DocObjects.Tables Namespace