RhinoCommon API
MeshingParameters Constructor (Double, Double)
 Initializes a new instance with simple values, similar to that of Rhino's meshing slider interface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public MeshingParameters(
	double density,
	double minimumEdgeLength
)
Public Sub New (
	density As Double,
	minimumEdgeLength As Double
)
Parameters
density
Type: System.Double
 The density and number of mesh polygons, where 0.0 <= density <= 1.0, where 0 quickly creates coarse meshes, and 1 slowly creates dense meshes.
minimumEdgeLength
Type: System.Double
The minimum allowed mesh edge length.
See Also
Reference
MeshingParameters Class
MeshingParameters Overload
Rhino.Geometry Namespace