RhinoCommon API
SurfaceCurvature.CreateFromSubD Method (SubD, SubDComponentParameter)
 Create a SurfaceCurvature by evaluating a SubD's surface (its limit surface) at a surface parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static SurfaceCurvature CreateFromSubD(
	SubD subd,
	SubDComponentParameter parameter
)
Public Shared Function CreateFromSubD (
	subd As SubD,
	parameter As SubDComponentParameter
) As SurfaceCurvature
Parameters
subd
Type: Rhino.Geometry.SubD
The SubD to evaluate.
parameter
Type: Rhino.Geometry.SubDComponentParameter
The surface parameter to evaluate.
Return Value
Type: SurfaceCurvature
A SurfaceCurvature if successful, null otherwise.
Remarks
 A SubD limit surface is C1 but generally not C2 exactly on an extraordinary vertex, so it has no curvature there and this returns null. Everywhere else, including throughout the corner quad of an extraordinary vertex, the curvature exists. Use the overload that takes a SubD.ExtraordinaryVertexCurvature to get an estimate at those vertices instead of nothing. UVPoint is the face corner parameter, since that is what parameterizes a SubD surface. See FaceCornerParameters.
See Also
Reference
SurfaceCurvature Class
CreateFromSubD Overload
Rhino.Geometry Namespace