RhinoCommon API
Mesh.CreateFromSubDControlNetWithTextureCoordinates Method
Create a mesh from a SubD control net including texture coordinates
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public static Mesh CreateFromSubDControlNetWithTextureCoordinates(
	SubD subd
)
Public Shared Function CreateFromSubDControlNetWithTextureCoordinates (
	subd As SubD
) As Mesh
Parameters
subd
Type: Rhino.Geometry.SubD
[Missing <param name="subd"/> documentation for "M:Rhino.Geometry.Mesh.CreateFromSubDControlNetWithTextureCoordinates(Rhino.Geometry.SubD)"]
Return Value
Type: Mesh
mesh representing control net on success, null on failure
See Also
Reference
Mesh Class
Rhino.Geometry Namespace