RhinoCommon API
FileReference.CreateFromFullAndRelativePaths Method
 Returns a new file reference. This returns a new instance even if the path does not exist.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static FileReference CreateFromFullAndRelativePaths(
	string fullPath,
	string relativePath
)
Public Shared Function CreateFromFullAndRelativePaths (
	fullPath As String,
	relativePath As String
) As FileReference
Parameters
fullPath
Type: System.String
A full path. This parameter cannot be null.
relativePath
Type: System.String
A relative path. This parameter can be null.
Return Value
Type: FileReference
A file reference to the specified paths.
See Also
Reference
FileReference Class
Rhino.FileIO Namespace