RhinoCommon API
SubDEdgeChain.TrimToRange Method
 Trims the chain down to the run of edges between firstEdge and lastEdge, removing everything before firstEdge and everything after lastEdge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public uint TrimToRange(
	SubDEdge firstEdge,
	SubDEdge lastEdge
)
Public Function TrimToRange (
	firstEdge As SubDEdge,
	lastEdge As SubDEdge
) As UInteger
Parameters
firstEdge
Type: Rhino.Geometry.SubDEdge
 The edge to keep as the new start of the chain. Pass null to keep the current start.
lastEdge
Type: Rhino.Geometry.SubDEdge
 The edge to keep as the new end of the chain. Pass null to keep the current end.
Return Value
Type: UInt32
The number of edges that were removed.
Remarks
 This wraps ON_SubDEdgeChain::RemoveEdges, whose name reads as though the given range is what gets removed. It is the other way round: the range is what survives. Passing null for both edges therefore removes nothing and returns 0; use Clear() to empty the chain.
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace