RhinoCommon API
RenderWindow.GetRequestedRenderChannelsAsStandardChannels Method
 Get array of StandardChannels enum values representing the channels requested by the post effect pipeline for this RenderWindow.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RenderWindow.StandardChannels[] GetRequestedRenderChannelsAsStandardChannels()
Public Function GetRequestedRenderChannelsAsStandardChannels As RenderWindow.StandardChannels()
Return Value
Type: RenderWindow.StandardChannels[]
Array of StandardChannels
See Also
Reference
RenderWindow Class
Rhino.Render Namespace