RhinoCommon API
File3dmRenderTextures.Find Method
 Finds a texture by its id, if possible. Returns null on failure.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmRenderTexture Find(
	Guid g
)
Public Function Find (
	g As Guid
) As File3dmRenderTexture
Parameters
g
Type: System.Guid
[Missing <param name="g"/> documentation for "M:Rhino.FileIO.File3dmRenderTextures.Find(System.Guid)"]
Return Value
Type: File3dmRenderTexture
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderTextures.Find(System.Guid)"]
See Also
Reference
File3dmRenderTextures Class
Rhino.FileIO Namespace