RhinoCommon API
PreviewJobSignature.ImageHeight Method
 The Height of the rendered preview image
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public int ImageHeight()
Public Function ImageHeight As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.PreviewJobSignature.ImageHeight"]
See Also
Reference
PreviewJobSignature Class
Rhino.Render Namespace