RhinoCommon API
StringHolder.Dispose Method
 IDispose implementation
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
StringHolder Class
Dispose Overload
Rhino.Runtime.InteropWrappers Namespace