RhinoCommon API
ViewCaptureSettings.GetModelScale Method
 Returns the model scale factor.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.21
Syntax
public double GetModelScale(
	UnitSystem pageUnits,
	UnitSystem modelUnits
)
Public Function GetModelScale (
	pageUnits As UnitSystem,
	modelUnits As UnitSystem
) As Double
Parameters
pageUnits
Type: Rhino.UnitSystem
The current page units.
modelUnits
Type: Rhino.UnitSystem
The current model units.
Return Value
Type: Double
The model scale factor.
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace