RhinoCommon API
Curve.Contains Method (Point3d)
Note: This API is now obsolete.
 Computes the relationship between a point and a closed curve region. This curve must be closed or the return value will be Unset. Both curve and point are projected to the World XY plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use version that takes a tolerance")]
public PointContainment Contains(
	Point3d testPoint
)
<ObsoleteAttribute("Use version that takes a tolerance")>
Public Function Contains (
	testPoint As Point3d
) As PointContainment
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to test.
Return Value
Type: PointContainment
Relationship between point and curve region.
See Also
Reference
Curve Class
Contains Overload
Rhino.Geometry Namespace