RhinoCommon API
PersistentSettings.TryGetDefault Method (String, DateTime)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.DateTime@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetDefault(
	string key,
	out DateTime value
)
Public Function TryGetDefault (
	key As String,
	<OutAttribute> ByRef value As DateTime
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.DateTime@)"]
value
Type: System.DateTime
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.DateTime@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.DateTime@)"]
See Also
Reference
PersistentSettings Class
TryGetDefault Overload
Rhino Namespace