RhinoCommon API
Vector2f.PerpendicularTo Method
 Sets this vector to be perpendicular to another vector. Result is not unitized.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public bool PerpendicularTo(
	Vector2f other
)
Public Function PerpendicularTo (
	other As Vector2f
) As Boolean
Parameters
other
Type: Rhino.Geometry.Vector2f
Vector to use as guide.
Return Value
Type: Boolean
true on success, false if input vector is zero or invalid.
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace