RhinoCommon API
ObjectAttributes.DrawColor Method (RhinoDoc, Guid)
 Gets an object's draw color, which is based on the object's color source
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color DrawColor(
	RhinoDoc document,
	Guid viewportId
)
Public Function DrawColor (
	document As RhinoDoc,
	viewportId As Guid
) As Color
Parameters
document
Type: Rhino.RhinoDoc
The object's documnt.
viewportId
Type: System.Guid
The id of the viewport.
Return Value
Type: Color
The draw color.
See Also
Reference
ObjectAttributes Class
DrawColor Overload
Rhino.DocObjects Namespace