RhinoCommon API
FileCsvDocument.Set Method (Int32, Point3d)
 Sets a row from a 3-D point. This is only valid when ColumnCount is 3: the point's X, Y, and Z are written to columns 0, 1, and 2 with the general ("G") format specifier and the invariant culture.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Set(
	int row,
	Point3d point
)
Public Sub Set (
	row As Integer,
	point As Point3d
)
Parameters
row
Type: System.Int32
The zero-based row index (y).
point
Type: Rhino.Geometry.Point3d
The point to store.
Exceptions
Exception | Condition
InvalidOperationException | Thrown when ColumnCount is not 3.
ArgumentOutOfRangeException | Thrown when row is negative.
See Also
Reference
FileCsvDocument Class
Set Overload
Rhino.FileIO Namespace