RhinoCommon API
SubDEdgeSharpness.ToPercentageText Method (Boolean)
 Describes this sharpness as a percentage, for user interface code. A constant sharpness gives a single percentage, a variable one gives a range, and an invalid one gives a warning sign.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public string ToPercentageText(
	bool orderMinToMax
)
Public Function ToPercentageText (
	orderMinToMax As Boolean
) As String
Parameters
orderMinToMax
Type: System.Boolean
 If true, a variable sharpness is formatted as min%-max%. If false, it is formatted as EndSharpness(0)%-EndSharpness(1)%.
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgeSharpness.ToPercentageText(System.Boolean)"]
See Also
Reference
SubDEdgeSharpness Structure
ToPercentageText Overload
Rhino.Geometry Namespace