RhinoCommon API
PreviewSceneServer.Dispose Method
 Dispose for PreviewSceneServer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PreviewSceneServer Class
Dispose Overload
Rhino.Render Namespace