RhinoCommon API
MeshClash.FindDetail Method (RhinoObject, RhinoObject, Double)
 Finds all of the mesh faces on each of two Rhino objects that interfere within a clash distance. This function uses the object's mesh to calculate the interferences. Acceptable object types include: BrepObject, ExtrusionObject, MeshObject, and SubDObject.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Mesh[] FindDetail(
	RhinoObject objA,
	RhinoObject objB,
	double distance
)
Public Shared Function FindDetail (
	objA As RhinoObject,
	objB As RhinoObject,
	distance As Double
) As Mesh()
Parameters
objA
Type: Rhino.DocObjects.RhinoObject
The first Rhino object.
objB
Type: Rhino.DocObjects.RhinoObject
The second Rhino object.
distance
Type: System.Double
The largest distance at which a clash can occur.
Return Value
Type: Mesh[]
The resulting meshes are sub-meshes of the input meshes if successful, or an empty array on error.
See Also
Reference
MeshClash Class
FindDetail Overload
Rhino.Geometry.Intersect Namespace