RhinoCommon API
SurfaceDirectionIndicators Constructor (NurbsSurface, Point2d)
 Construct for a Nurbs surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SurfaceDirectionIndicators(
	NurbsSurface surface,
	Point2d origin
)
Public Sub New (
	surface As NurbsSurface,
	origin As Point2d
)
Parameters
surface
Type: Rhino.Geometry.NurbsSurface
origin
Type: Rhino.Geometry.Point2d
Use Unset to place the arrows at the default location.
See Also
Reference
SurfaceDirectionIndicators Class
SurfaceDirectionIndicators Overload
Rhino.Geometry Namespace