RhinoCommon API
Hatch.Create Method (IEnumerable<Curve>, Int32, Double, Double)
Note: This API is now obsolete.
 Constructs an array of hatches from a set of curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use version that takes a tolerance parameter instead")]
public static Hatch[] Create(
	IEnumerable<Curve> curves,
	int hatchPatternIndex,
	double rotationRadians,
	double scale
)
<ObsoleteAttribute("Use version that takes a tolerance parameter instead")>
Public Shared Function Create (
	curves As IEnumerable(Of Curve),
	hatchPatternIndex As Integer,
	rotationRadians As Double,
	scale As Double
) As Hatch()
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
An array, a list or any enumerable set of Curve.
hatchPatternIndex
Type: System.Int32
The index of the hatch pattern in the document hatch pattern table.
rotationRadians
Type: System.Double
The relative rotation of the pattern.
scale
Type: System.Double
A scaling factor.
Return Value
Type: Hatch[]
An array of hatches. The array might be empty on error.
Exceptions
Exception | Condition
ArgumentNullException | If curves is null.
See Also
Reference
Hatch Class
Create Overload
Rhino.Geometry Namespace