RhinoCommon API
PersistentSettings.GetChar Method (String, Char, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetChar(System.String,System.Char,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public char GetChar(
	string key,
	char defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetChar (
	key As String,
	defaultValue As Char,
	legacyKeyList As IEnumerable(Of String)
) As Char
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetChar(System.String,System.Char,System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.Char
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetChar(System.String,System.Char,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetChar(System.String,System.Char,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Char
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetChar(System.String,System.Char,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetChar Overload
Rhino Namespace