RhinoCommon API
NamedLayerStateTable.Restore Method (String, RestoreLayerProperties)
 Restores a named layer state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public bool Restore(
	string name,
	RestoreLayerProperties properties
)
Public Function Restore (
	name As String,
	properties As RestoreLayerProperties
) As Boolean
Parameters
name
Type: System.String
The name of the layer state.
properties
Type: Rhino.DocObjects.Tables.RestoreLayerProperties
The layer properties to restore.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
NamedLayerStateTable Class
Restore Overload
Rhino.DocObjects.Tables Namespace