RhinoCommon API
ViewCaptureSettings.GetViewport Method
 Get RhinoViewport that this view capture settings is targeting
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RhinoViewport GetViewport()
Public Function GetViewport As RhinoViewport
Return Value
Type: RhinoViewport
[Missing <returns> documentation for "M:Rhino.Display.ViewCaptureSettings.GetViewport"]
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace