RhinoCommon API
ColorRGBA Constructor (Color)
 Constructs a new instance of ColorRGBA that is equivalent to an ARGB color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public ColorRGBA(
	Color color
)
Public Sub New (
	color As Color
)
Parameters
color
Type: System.Drawing.Color
ARGB color to mimic.
See Also
Reference
ColorRGBA Structure
ColorRGBA Overload
Rhino.Display Namespace