RhinoCommon API
GetBaseClass.AddOption Method (String, String, Boolean)
 Adds a command line option.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.9
Syntax
public int AddOption(
	string englishOption,
	string englishOptionValue,
	bool hiddenOption
)
Public Function AddOption (
	englishOption As String,
	englishOptionValue As String,
	hiddenOption As Boolean
) As Integer
Parameters
englishOption
Type: System.String
Must only consist of letters and numbers (no characters list periods, spaces, or dashes).
englishOptionValue
Type: System.String
The option value in English, visualized after an equality sign.
hiddenOption
Type: System.Boolean
If true, the option is not displayed on the command line and the full option name must be typed in order to activate the option.
Return Value
Type: Int32
Option index value (>0) or 0 if option cannot be added.
See Also
Reference
GetBaseClass Class
AddOption Overload
Rhino.Input.Custom Namespace