RhinoCommon API
SectionStyleTable.FindIndex Method
 Retrieves a section style based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SectionStyle FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As SectionStyle
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: SectionStyle
A SectionStyle object, or null if none was found.
See Also
Reference
SectionStyleTable Class
Rhino.DocObjects.Tables Namespace