RhinoCommon API
RealtimeDisplayModeClassInfo Constructor
Initializes a new instance of the RealtimeDisplayModeClassInfo class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected RealtimeDisplayModeClassInfo()
Protected Sub New
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace