RhinoCommon API
UserInterfaceGrid.Cell Method
 Control in a cell by row and column, or null when that cell is empty. The grid has to have been added to a document for this to find anything, since it is the native grid that knows which cell a child ended up in.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceControl Cell(
	int row,
	int column
)
Public Function Cell (
	row As Integer,
	column As Integer
) As UserInterfaceControl
Parameters
row
Type: System.Int32
[Missing <param name="row"/> documentation for "M:Rhino.UI.UserInterfaceGrid.Cell(System.Int32,System.Int32)"]
column
Type: System.Int32
[Missing <param name="column"/> documentation for "M:Rhino.UI.UserInterfaceGrid.Cell(System.Int32,System.Int32)"]
Return Value
Type: UserInterfaceControl
[Missing <returns> documentation for "M:Rhino.UI.UserInterfaceGrid.Cell(System.Int32,System.Int32)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace