RhinoCommon API
Mesh.QuadRemesh Method (QuadRemeshParameters, IEnumerable<Curve>)
 Quad remesh this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Mesh QuadRemesh(
	QuadRemeshParameters parameters,
	IEnumerable<Curve> guideCurves
)
Public Function QuadRemesh (
	parameters As QuadRemeshParameters,
	guideCurves As IEnumerable(Of Curve)
) As Mesh
Parameters
parameters
Type: Rhino.Geometry.QuadRemeshParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemesh(Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})"]
guideCurves
Type: System.Collections.Generic.IEnumerable<Curve>
 A curve array used to influence mesh face layout The curves should touch the input mesh Set Guide Curve Influence by using QuadRemeshParameters.GuideCurveInfluence
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.QuadRemesh(Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})"]
See Also
Reference
Mesh Class
QuadRemesh Overload
Rhino.Geometry Namespace