RhinoCommon API
PointCloud.AppendNew Method
 Appends a new PointCloudItem to the end of this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PointCloudItem AppendNew()
Public Function AppendNew As PointCloudItem
Return Value
Type: PointCloudItem
The newly appended item.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace