RhinoCommon API
NullField.ValueAsObject Method
[Missing <summary> documentation for "M:Rhino.Render.Fields.NullField.ValueAsObject"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public override Object ValueAsObject()
Public Overrides Function ValueAsObject As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.Render.Fields.NullField.ValueAsObject"]
See Also
Reference
NullField Class
Rhino.Render.Fields Namespace