RhinoCommon API
Point2f Explicit Conversion (Point2d to Point2f)
 Converts a double-precision point in a single-precision point. Needs explicit casting to help retain precision.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static explicit operator Point2f (
	Point2d point
)
Public Shared Narrowing Operator CType (
	point As Point2d
) As Point2f
Parameters
point
Type: Rhino.Geometry.Point2d
A point.
Return Value
Type: Point2f
The resulting point.
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace