RhinoCommon API
RhinoApp.InFullScreen Method
 Verifies that Rhino is running in full screen mode.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool InFullScreen()
Public Shared Function InFullScreen As Boolean
Return Value
Type: Boolean
true if Rhino is running full screen, false otherwise.
See Also
Reference
RhinoApp Class
Rhino Namespace