RhinoCommon API
TextFields.BlockInstanceName Method
 Returns the block definition name of a block instance Use BlockName Instead
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string BlockInstanceName(
	string blockId
)
Public Shared Function BlockInstanceName (
	blockId As String
) As String
Parameters
blockId
Type: System.String
[Missing <param name="blockId"/> documentation for "M:Rhino.Runtime.TextFields.BlockInstanceName(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.BlockInstanceName(System.String)"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace