RhinoCommon API
DisplayPipeline.DrawMeshShaded Method (Mesh, DisplayMaterial, IEnumerable<Int32>)
 Draws the shaded faces of a given mesh.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.20
Syntax
public void DrawMeshShaded(
	Mesh mesh,
	DisplayMaterial material,
	IEnumerable<int> faceIndices
)
Public Sub DrawMeshShaded (
	mesh As Mesh,
	material As DisplayMaterial,
	faceIndices As IEnumerable(Of Integer)
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to draw.
material
Type: Rhino.Display.DisplayMaterial
Material to draw faces with.
faceIndices
Type: System.Collections.Generic.IEnumerable<Int32>
An enumeration of the indices of specific faces to draw.
See Also
Reference
DisplayPipeline Class
DrawMeshShaded Overload
Rhino.Display Namespace