RhinoCommon API
RenderWindow.ChannelGPU.TextureHandleMetal Method
 Return the channel's Metal texture handle (id<MTLTexture>) as an IntPtr. If there isn't one, IntPtr.Zero will be returned. The ChannelGPU.DisplayTechnology property will indicate which type of texture is stored in the channel. The IntPtr can be turned back into an Objective-C id<MTLTexture> using id<MTLTexture> texture = CFBridgingRelease(ptr);
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IntPtr TextureHandleMetal()
Public Function TextureHandleMetal As IntPtr
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.TextureHandleMetal"]
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace