RhinoCommon API
Polyline.TriangulateClosedPolyline Method
 Attempts to create a list of triangles which represent a triangulation of a closed polyline
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public MeshFace[] TriangulateClosedPolyline()
Public Function TriangulateClosedPolyline As MeshFace()
Return Value
Type: MeshFace[]
[Missing <returns> documentation for "M:Rhino.Geometry.Polyline.TriangulateClosedPolyline"]
See Also
Reference
Polyline Class
Rhino.Geometry Namespace