RhinoCommon API
GroundPlane.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.GroundPlane.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
GroundPlane Class
Rhino.Render Namespace