RhinoCommon API
PersistentSettings.GetDouble Method (String, Double, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetDouble(System.String,System.Double,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double GetDouble(
	string key,
	double defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetDouble (
	key As String,
	defaultValue As Double,
	legacyKeyList As IEnumerable(Of String)
) As Double
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetDouble(System.String,System.Double,System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.Double
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetDouble(System.String,System.Double,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetDouble(System.String,System.Double,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetDouble(System.String,System.Double,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetDouble Overload
Rhino Namespace