RhinoCommon API
File3ds.Write Method
Write a 3ds file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	File3dsWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As File3dsWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.File3dsWriteOptions
options used for generating the 3ds file
Return Value
Type: Boolean
true on success
See Also
Reference
File3ds Class
Rhino.FileIO Namespace