RhinoCommon API
File3dmObjectTable.AddRadialDimension Method (RadialDimension)
 Adds a radial dimension object to the 3dm file object table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.32
Syntax
public Guid AddRadialDimension(
	RadialDimension dimension
)
Public Function AddRadialDimension (
	dimension As RadialDimension
) As Guid
Parameters
dimension
Type: Rhino.Geometry.RadialDimension
Dimension object to add.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddRadialDimension Overload
Rhino.FileIO Namespace