RhinoCommon API
Brep.SplitDisjointPieces Method (Brep)
 Separates, or splits, a disjoint Brep into separate Breps.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public static Brep[] SplitDisjointPieces(
	Brep brep
)
Public Shared Function SplitDisjointPieces (
	brep As Brep
) As Brep()
Parameters
brep
Type: Rhino.Geometry.Brep
The disjoint Brep to separate.
Return Value
Type: Brep[]
An array of Brep pieces if successful, otherwise an empty array if the Brep is not disjoint or on error.
See Also
Reference
Brep Class
SplitDisjointPieces Overload
Rhino.Geometry Namespace