RhinoCommon API
UserInterfaceSection.GetContentList Method
 Returns a list of currently selected content items to be edited.
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public RenderContent[] GetContentList()
Public Function GetContentList As RenderContent()
Return Value
Type: RenderContent[]
Returns a list of currently selected content items to be edited.
See Also
Reference
UserInterfaceSection Class
Rhino.Render.UI Namespace