RhinoCommon API
AppearanceSettings.GetPaintColor Method (PaintColor, Boolean)
 Gat a paint color. This overload provides a compute option for cases where colors are computed when they are "unset" colors.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public static Color GetPaintColor(
	PaintColor whichColor,
	bool compute
)
Public Shared Function GetPaintColor (
	whichColor As PaintColor,
	compute As Boolean
) As Color
Parameters
whichColor
Type: Rhino.ApplicationSettings.PaintColor
[Missing <param name="whichColor"/> documentation for "M:Rhino.ApplicationSettings.AppearanceSettings.GetPaintColor(Rhino.ApplicationSettings.PaintColor,System.Boolean)"]
compute
Type: System.Boolean
if true, a color is computed in some cases
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.AppearanceSettings.GetPaintColor(Rhino.ApplicationSettings.PaintColor,System.Boolean)"]
See Also
Reference
AppearanceSettings Class
GetPaintColor Overload
Rhino.ApplicationSettings Namespace