RhinoCommon API
FieldDictionary.SetTag Method
Note: This API is now obsolete.
 Sets an object that contains data to associate with the field. THIS IS NOW OBSOLETE - if you were using this, please email andy@mcneel.com and let me know why.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
[ObsoleteAttribute]
public bool SetTag(
	string key,
	Object tag
)
<ObsoleteAttribute>
Public Function SetTag (
	key As String,
	tag As Object
) As Boolean
Parameters
key
Type: System.String
Key name for the field to tag.
tag
Type: System.Object
Data to associate with the field.
Return Value
Type: Boolean
True if the field is found and the tag was set otherwise false is returned.
See Also
Reference
FieldDictionary Class
Rhino.Render.Fields Namespace