RhinoCommon API
RhinoViewport.MouseAdjustLensLength Method
 Adjusts the camera lens length.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool MouseAdjustLensLength(
	Point mousePreviousPoint,
	Point mouseCurrentPoint,
	bool moveTarget
)
Public Function MouseAdjustLensLength (
	mousePreviousPoint As Point,
	mouseCurrentPoint As Point,
	moveTarget As Boolean
) As Boolean
Parameters
mousePreviousPoint
Type: System.Drawing.Point
The mouse previous point.
mouseCurrentPoint
Type: System.Drawing.Point
The mouse current point.
moveTarget
Type: System.Boolean
Should this operation move the target?
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.MouseAdjustLensLength(System.Drawing.Point,System.Drawing.Point,System.Boolean)"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace