RhinoCommon API
UserInterfaceTextBox.OnEditCanceled Method
 Called when Escape is pressed. The text has already been put back to what it was when the box took focus. The default implementation raises the EditCanceled event.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnEditCanceled()
Protected Overridable Sub OnEditCanceled
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace