RhinoCommon API
HostUtils.RemoveNamedCallback Method
 Remove a named callback from the dictionary of callbacks
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static void RemoveNamedCallback(
	string name
)
Public Shared Sub RemoveNamedCallback (
	name As String
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.HostUtils.RemoveNamedCallback(System.String)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace