RhinoCommon API
PersistentSettings.GetInteger Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int GetInteger(
	string key
)
Public Function GetInteger (
	key As String
) As Integer
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String)"]
See Also
Reference
PersistentSettings Class
GetInteger Overload
Rhino Namespace