RhinoCommon API
RenderPlugIn.GetRenderSettingsSections Method
 This function returns a list of Guids for the render settings pages that should be displayed.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.17
Syntax
public List<Guid> GetRenderSettingsSections()
Public Function GetRenderSettingsSections As List(Of Guid)
Return Value
Type: List<Guid>
 Return a Id list of the Render settings sections that will be displayed
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace