RhinoCommon API
PersistentSettings.GetEnumValue<T> Method (T)
 Get a stored enumerated value, or return default value if not found
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public T GetEnumValue<T>(
	T defaultValue
)
where T : struct, new(), IConvertible
Public Function GetEnumValue(Of T As {Structure, New, IConvertible}) (
	defaultValue As T
) As T
Parameters
defaultValue
Type: T
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetEnumValue``1(``0)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.PersistentSettings.GetEnumValue``1(``0)"]
Return Value
Type: T
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetEnumValue``1(``0)"]
See Also
Reference
PersistentSettings Class
GetEnumValue Overload
Rhino Namespace