RhinoCommon API
WorldMapDayNight.HasMapForCurrentSettings Method
[Missing <summary> documentation for "M:Rhino.Render.UI.WorldMapDayNight.HasMapForCurrentSettings"]
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool HasMapForCurrentSettings()
Public Function HasMapForCurrentSettings As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.UI.WorldMapDayNight.HasMapForCurrentSettings"]
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace