RhinoCommon API
RhinoDoc.TimeoutActiveGet Method
 Exit the active get operation with a timeout
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void TimeoutActiveGet()
Public Sub TimeoutActiveGet
See Also
Reference
RhinoDoc Class
Rhino Namespace