RhinoCommon API
Panels.FloatPanel Method (Type, Panels.FloatPanelMode)
 Mac support: Display the specified panel in a floating window on Mac, the floating window will only contain the specified panel. Windows support: On Windows this will show or hide the floating container containing the specified panel. If the tab is docked with other tabs it will be floated in a new container.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public static bool FloatPanel(
	Type panelType,
	Panels.FloatPanelMode mode
)
Public Shared Function FloatPanel (
	panelType As Type,
	mode As Panels.FloatPanelMode
) As Boolean
Parameters
panelType
Type: System.Type
 Panel type to show/hide.
mode
Type: Rhino.UI.Panels.FloatPanelMode
 Show, hide or toggle the visibility state of the specified panel
Return Value
Type: Boolean
 Return true if the panel visibility state was changed, false otherwise.
See Also
Reference
Panels Class
FloatPanel Overload
Rhino.UI Namespace