RhinoCommon API
PersistentSettings.GetString Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetString(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string GetString(
	string key
)
Public Function GetString (
	key As String
) As String
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetString(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetString(System.String)"]
See Also
Reference
PersistentSettings Class
GetString Overload
Rhino Namespace