RhinoCommon API
Field.ValueAsColor4f Method
 Return field as a Rhino.Display.Color4f color value.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Color4f ValueAsColor4f()
Protected Function ValueAsColor4f As Color4f
Return Value
Type: Color4f
Return field as a Rhino.Display.Color4f color value.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace