RhinoCommon API
FileTypeList.AddFileType Method (String, String)
[Missing <summary> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int AddFileType(
	string description,
	string extension
)
Public Function AddFileType (
	description As String,
	extension As String
) As Integer
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String)"]
extension
Type: System.String
[Missing <param name="extension"/> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String)"]
See Also
Reference
FileTypeList Class
AddFileType Overload
Rhino.PlugIns Namespace