RhinoCommon API
MeshDisplacementInfo Constructor
 Constructs a displacement information instance with default values. Users of this class should not rely on default values to stay constant across service releases.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public MeshDisplacementInfo(
	RenderTexture texture,
	TextureMapping mapping
)
Public Sub New (
	texture As RenderTexture,
	mapping As TextureMapping
)
Parameters
texture
Type: Rhino.Render.RenderTexture
[Missing <param name="texture"/> documentation for "M:Rhino.Geometry.MeshDisplacementInfo.#ctor(Rhino.Render.RenderTexture,Rhino.Render.TextureMapping)"]
mapping
Type: Rhino.Render.TextureMapping
[Missing <param name="mapping"/> documentation for "M:Rhino.Geometry.MeshDisplacementInfo.#ctor(Rhino.Render.RenderTexture,Rhino.Render.TextureMapping)"]
Exceptions
Exception | Condition
ArgumentNullException | If texture or mapping is null.
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace