RhinoCommon API
UserInterfaceSlider Constructor
Initializes a new instance of the UserInterfaceSlider class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UserInterfaceSlider()
Public Sub New
See Also
Reference
UserInterfaceSlider Class
Rhino.UI Namespace