RhinoCommon API
RenderPipeline.Dispose Method
Releases all resources used by the RenderPipeline
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RenderPipeline Class
Dispose Overload
Rhino.Render Namespace