RhinoCommon API
Box.Union Method
 Constructs a union between this Box and the given point. This grows the box in directions so it contains the point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Union(
	Point3d point
)
Public Sub Union (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to include.
Remarks
If this box is invalid, it becomes the box containing only the point, with the same orientation or the WorldXY's orientation if the orientation was invalid. If point is invalid or can't be projected, this box is unchanged.
See Also
Reference
Box Structure
Rhino.Geometry Namespace