RhinoCommon API
ObjectTable.ReplaceInstanceObject Method (Guid, Int32)
 Replaces the underlying instance definition of an instance object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public bool ReplaceInstanceObject(
	Guid objectId,
	int instanceDefinitionIndex
)
Public Function ReplaceInstanceObject (
	objectId As Guid,
	instanceDefinitionIndex As Integer
) As Boolean
Parameters
objectId
Type: System.Guid
Id of the instance object to be replaced.
instanceDefinitionIndex
Type: System.Int32
The index of the new instance definition to use.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
ReplaceInstanceObject Overload
Rhino.DocObjects.Tables Namespace