RhinoCommon API
RenderPlugIn.RenderSettingsCustomSections Method
 Override this function to provide custom sections for the render settings panel that are displayed when your plug-in is the current render plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual void RenderSettingsCustomSections(
	List<ICollapsibleSection> sections
)
Public Overridable Sub RenderSettingsCustomSections (
	sections As List(Of ICollapsibleSection)
)
Parameters
sections
Type: System.Collections.Generic.List<ICollapsibleSection>
Create your sections and return a list of them
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace