RhinoCommon API
Squisher.GetMesh2dEdges Method
 Gets lines at the position of the mesh edges and diagonals that were constrained during the squish, in the 2d mesh. The line at any index here corresponds to the same line in GetLengthConstrained3dLines.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public Line[] GetMesh2dEdges()
Public Function GetMesh2dEdges As Line()
Return Value
Type: Line[]
An array of lines representing the length constraints
Remarks
Renamed to GetLengthConstrained2dLines.
See Also
Reference
Squisher Class
Rhino.Geometry Namespace