RhinoCommon API
PointCloud.ClearHiddenFlags Method
 Destroys the hidden flag information in this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void ClearHiddenFlags()
Public Sub ClearHiddenFlags
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace