RhinoCommon API
ObjectTable.FindByFilter Method
 Same as GetObjectList but converts the result to an array.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoObject[] FindByFilter(
	ObjectEnumeratorSettings filter
)
Public Function FindByFilter (
	filter As ObjectEnumeratorSettings
) As RhinoObject()
Parameters
filter
Type: Rhino.DocObjects.ObjectEnumeratorSettings
The ObjectEnumeratorSettings filter to customize inclusion requirements.
Return Value
Type: RhinoObject[]
A Rhino object array. This array can be empty but not null.
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace