RhinoCommon API
Aligner.SuggestDistance Method
 Suggests a distance for AlignVertices(IEnumerable<GeometryBase>, Double, Boolean, Boolean) from the geometry itself, so the gaps do not have to be measured first.
A vertex whose nearest neighbour of all belongs to another object was meant to be shared with it. The largest of those gaps closes every one of them, and is smaller than the spacing each object has of its own at those places.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static double SuggestDistance(
	IEnumerable<GeometryBase> geometry
)
Public Shared Function SuggestDistance (
	geometry As IEnumerable(Of GeometryBase)
) As Double
Parameters
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
The geometry that would be aligned.
Return Value
Type: Double
A distance greater than zero, or zero when no vertex is nearer to another object than to its own.
See Also
Reference
Aligner Class
Rhino.Geometry Namespace