RhinoCommon API
ColorRGBA Constructor (ColorRGBA)
Initializes a new instance of the ColorRGBA class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public ColorRGBA(
	ColorRGBA color
)
Public Sub New (
	color As ColorRGBA
)
Parameters
color
Type: Rhino.Display.ColorRGBA
[Missing <param name="color"/> documentation for "M:Rhino.Display.ColorRGBA.#ctor(Rhino.Display.ColorRGBA)"]
See Also
Reference
ColorRGBA Structure
ColorRGBA Overload
Rhino.Display Namespace