RhinoCommon API
ClippingPlaneSurface.SetClipParticipation Method
 Set a list of specific object ids and layers that this clipping plane surface clips.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetClipParticipation(
	IEnumerable<Guid> objectIds,
	IEnumerable<int> layerIndices,
	bool isExclusionList
)
Public Sub SetClipParticipation (
	objectIds As IEnumerable(Of Guid),
	layerIndices As IEnumerable(Of Integer),
	isExclusionList As Boolean
)
Parameters
objectIds
Type: System.Collections.Generic.IEnumerable<Guid>
[Missing <param name="objectIds"/> documentation for "M:Rhino.Geometry.ClippingPlaneSurface.SetClipParticipation(System.Collections.Generic.IEnumerable{System.Guid},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)"]
layerIndices
Type: System.Collections.Generic.IEnumerable<Int32>
[Missing <param name="layerIndices"/> documentation for "M:Rhino.Geometry.ClippingPlaneSurface.SetClipParticipation(System.Collections.Generic.IEnumerable{System.Guid},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)"]
isExclusionList
Type: System.Boolean
Is the list a set of ids to not clip or a set to clip
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace