RhinoCommon API
RenderContent.GenerateQuickContentPreview Method (RenderContent, Int32, Int32, PreviewSceneServer, Boolean, Int32, Result)
 Generate a quick render content preview
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public static Bitmap GenerateQuickContentPreview(
	RenderContent c,
	int width,
	int height,
	PreviewSceneServer psc,
	bool bSuppressLocalMapping,
	int reason,
	ref Result result
)
Public Shared Function GenerateQuickContentPreview (
	c As RenderContent,
	width As Integer,
	height As Integer,
	psc As PreviewSceneServer,
	bSuppressLocalMapping As Boolean,
	reason As Integer,
	ByRef result As Result
) As Bitmap
Parameters
c
Type: Rhino.Render.RenderContent
Render Content
width
Type: System.Int32
Image width
height
Type: System.Int32
Image height
psc
Type: Rhino.Render.PreviewSceneServer
PreviewSceneServer
bSuppressLocalMapping
Type: System.Boolean
SuppressLocalMapping
reason
Type: System.Int32
 ContentChanged = 0, ViewChanged = 1, RefreshDisplay = 2, Other = 99
result
Type: Rhino.Commands.Result
Rhino.Command.Result value for successfull quick image creation
Return Value
Type: Bitmap
The Bitmap of the quick render content preview
See Also
Reference
RenderContent Class
GenerateQuickContentPreview Overload
Rhino.Render Namespace