RhinoCommon API
TextFields.GetInstanceAttributeFields Method (TextObject)
 Gets an array of block attribute definitions associated with a TextObject.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static TextFields.InstanceAttributeField[] GetInstanceAttributeFields(
	TextObject text
)
Public Shared Function GetInstanceAttributeFields (
	text As TextObject
) As TextFields.InstanceAttributeField()
Parameters
text
Type: Rhino.DocObjects.TextObject
 TextObject to check for block attribute definitions
Return Value
Type: TextFields.InstanceAttributeField[]
 Will return a empty array if text is null or there is no attributes otherwise; returns a list of one or more attribute definitions embedded in the text string.
See Also
Reference
TextFields Class
GetInstanceAttributeFields Overload
Rhino.Runtime Namespace