RhinoCommon API
File3dmShutLining.SetCurveEnabled Method
 Sets whether shut-line is created for the given curve.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetCurveEnabled(
	Guid curve_id,
	bool enabled
)
Public Sub SetCurveEnabled (
	curve_id As Guid,
	enabled As Boolean
)
Parameters
curve_id
Type: System.Guid
[Missing <param name="curve_id"/> documentation for "M:Rhino.FileIO.File3dmShutLining.SetCurveEnabled(System.Guid,System.Boolean)"]
enabled
Type: System.Boolean
[Missing <param name="enabled"/> documentation for "M:Rhino.FileIO.File3dmShutLining.SetCurveEnabled(System.Guid,System.Boolean)"]
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace