RhinoCommon API
ViewCaptureSettings.Dispose Method
Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace