RhinoCommon API
Decal.TextureRenderHash Method (CrcRenderHashFlags)
Note: This API is now obsolete.
 Get the texture render hash for the referenced texture using the specified CrcRenderHashFlags.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
[ObsoleteAttribute("Do not use")]
public uint TextureRenderHash(
	CrcRenderHashFlags flags
)
<ObsoleteAttribute("Do not use")>
Public Function TextureRenderHash (
	flags As CrcRenderHashFlags
) As UInteger
Parameters
flags
Type: Rhino.Render.CrcRenderHashFlags
[Missing <param name="flags"/> documentation for "M:Rhino.Render.Decal.TextureRenderHash(Rhino.Render.CrcRenderHashFlags)"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.Decal.TextureRenderHash(Rhino.Render.CrcRenderHashFlags)"]
See Also
Reference
Decal Class
TextureRenderHash Overload
Rhino.Render Namespace