RhinoCommon API
FilePovWriteOptions Constructor
Initializes a new instance of the FilePovWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FilePovWriteOptions()
Public Sub New
See Also
Reference
FilePovWriteOptions Class
Rhino.FileIO Namespace