RhinoCommon API
RenderTabs.RegisterTab Method (PlugIn, Type, Guid, String, Icon)
[Missing <summary> documentation for "M:Rhino.Render.RenderTabs.RegisterTab(Rhino.PlugIns.PlugIn,System.Type,System.Guid,System.String,System.Drawing.Icon)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void RegisterTab(
	PlugIn plugin,
	Type tabType,
	Guid renderEngineId,
	string caption,
	Icon icon
)
Public Sub RegisterTab (
	plugin As PlugIn,
	tabType As Type,
	renderEngineId As Guid,
	caption As String,
	icon As Icon
)
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.RenderTabs.RegisterTab(Rhino.PlugIns.PlugIn,System.Type,System.Guid,System.String,System.Drawing.Icon)"]
tabType
Type: System.Type
[Missing <param name="tabType"/> documentation for "M:Rhino.Render.RenderTabs.RegisterTab(Rhino.PlugIns.PlugIn,System.Type,System.Guid,System.String,System.Drawing.Icon)"]
renderEngineId
Type: System.Guid
[Missing <param name="renderEngineId"/> documentation for "M:Rhino.Render.RenderTabs.RegisterTab(Rhino.PlugIns.PlugIn,System.Type,System.Guid,System.String,System.Drawing.Icon)"]
caption
Type: System.String
[Missing <param name="caption"/> documentation for "M:Rhino.Render.RenderTabs.RegisterTab(Rhino.PlugIns.PlugIn,System.Type,System.Guid,System.String,System.Drawing.Icon)"]
icon
Type: System.Drawing.Icon
[Missing <param name="icon"/> documentation for "M:Rhino.Render.RenderTabs.RegisterTab(Rhino.PlugIns.PlugIn,System.Type,System.Guid,System.String,System.Drawing.Icon)"]
See Also
Reference
RenderTabs Class
RegisterTab Overload
Rhino.Render Namespace