RhinoCommon API
RenderPlugIn.CreateTexture2dPreview Method
 Creates the preview bitmap that will appear in the content editor's thumbnail display when previewing textures in 2d (UV) mode. If this function is not overridden or the PreviewImage is not set on the arguments, then the internal OpenGL renderer will generate a simulation.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void CreateTexture2dPreview(
	CreateTexture2dPreviewEventArgs args
)
Protected Overridable Sub CreateTexture2dPreview (
	args As CreateTexture2dPreviewEventArgs
)
Parameters
args
Type: Rhino.Render.CreateTexture2dPreviewEventArgs
Event argument with several preview option state properties.
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace