RhinoCommon API
FileAiWriteOptions Constructor
Initializes a new instance of the FileAiWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileAiWriteOptions()
Public Sub New
See Also
Reference
FileAiWriteOptions Class
Rhino.FileIO Namespace