RhinoCommon API
ShortcutKeySettings.GetMacro Method
 Get macro associated with a given keyboard shortcut
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string GetMacro(
	ShortcutKey key
)
Public Shared Function GetMacro (
	key As ShortcutKey
) As String
Parameters
key
Type: Rhino.ApplicationSettings.ShortcutKey
[Missing <param name="key"/> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.GetMacro(Rhino.ApplicationSettings.ShortcutKey)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.GetMacro(Rhino.ApplicationSettings.ShortcutKey)"]
See Also
Reference
ShortcutKeySettings Class
Rhino.ApplicationSettings Namespace