RhinoCommon API
RhinoList<T>.LastIndexOf Method (T, Int32, Int32)
 Searches for the specified object and returns the zero-based index of the last occurrence within the range of elements in the List that contains the specified number of elements and ends at the specified index.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int LastIndexOf(
	T item,
	int index,
	int count
)
Public Function LastIndexOf (
	item As T,
	index As Integer,
	count As Integer
) As Integer
Parameters
item
Type: T
The object to locate in the List. The value can be a null reference (Nothing in Visual Basic) for reference types.
index
Type: System.Int32
The zero-based starting index of the backward search.
count
Type: System.Int32
The number of elements in the section to search.
Return Value
Type: Int32
The zero-based index of the last occurrence of item within the entire the List, if found; otherwise, -1.
See Also
Reference
RhinoList<T> Class
LastIndexOf Overload
Rhino.Collections Namespace