RhinoCommon API
FileCsvDocument.Read Method (String, Boolean)
 Reads a CSV file from disk.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static FileCsvDocument Read(
	string path,
	bool hasHeader
)
Public Shared Function Read (
	path As String,
	hasHeader As Boolean
) As FileCsvDocument
Parameters
path
Type: System.String
The path of the file to read.
hasHeader
Type: System.Boolean
When true, the first row is taken as the column-name header and is not counted as a data row.
Return Value
Type: FileCsvDocument
A new document populated with the contents of the file.
See Also
Reference
FileCsvDocument Class
Read Overload
Rhino.FileIO Namespace