RhinoCommon API
SweepTwoRail.PerformSweep Method (Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep[] PerformSweep(
	Curve rail1,
	Curve rail2,
	IEnumerable<Curve> crossSections,
	IEnumerable<double> crossSectionParameters1,
	IEnumerable<double> crossSectionParameters2
)
Public Function PerformSweep (
	rail1 As Curve,
	rail2 As Curve,
	crossSections As IEnumerable(Of Curve),
	crossSectionParameters1 As IEnumerable(Of Double),
	crossSectionParameters2 As IEnumerable(Of Double)
) As Brep()
Parameters
rail1
Type: Rhino.Geometry.Curve
Rail to sweep shapes along.
rail2
Type: Rhino.Geometry.Curve
Rail to sweep shapes along.
crossSections
Type: System.Collections.Generic.IEnumerable<Curve>
Cross section curves.
crossSectionParameters1
Type: System.Collections.Generic.IEnumerable<Double>
Curve parameters on first rail curve. Unused if is true.
crossSectionParameters2
Type: System.Collections.Generic.IEnumerable<Double>
Curve parameters on second rail curve. Unused if is true.
Return Value
Type: Brep[]
Array of Brep sweep results.
See Also
Reference
SweepTwoRail Class
PerformSweep Overload
Rhino.Geometry Namespace
SweepTwoRail.UseLegacySweeper
SweepTwoRail.UseLegacySweeper