RhinoCommon API
TexturedFloat Constructor
Initializes a new instance of the TexturedFloat class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public TexturedFloat(
	string name,
	float value,
	bool on,
	float amount
)
Public Sub New (
	name As String,
	value As Single,
	on As Boolean,
	amount As Single
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Render.TexturedFloat.#ctor(System.String,System.Single,System.Boolean,System.Single)"]
value
Type: System.Single
[Missing <param name="value"/> documentation for "M:Rhino.Render.TexturedFloat.#ctor(System.String,System.Single,System.Boolean,System.Single)"]
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Render.TexturedFloat.#ctor(System.String,System.Single,System.Boolean,System.Single)"]
amount
Type: System.Single
[Missing <param name="amount"/> documentation for "M:Rhino.Render.TexturedFloat.#ctor(System.String,System.Single,System.Boolean,System.Single)"]
See Also
Reference
TexturedFloat Class
Rhino.Render Namespace