RhinoCommon API
SubDComponentParameter.CreateVertexParameter Method
 Creates a parameter that identifies the surface point at a SubD vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static SubDComponentParameter CreateVertexParameter(
	uint vertexId,
	uint activeFaceId
)
Public Shared Function CreateVertexParameter (
	vertexId As UInteger,
	activeFaceId As UInteger
) As SubDComponentParameter
Parameters
vertexId
Type: System.UInt32
The id of a SubD vertex.
activeFaceId
Type: System.UInt32
 The id of a face attached to the vertex, or 0 to let the SubD choose one. A vertex where several faces meet with a crease has a different surface normal in each sector, so evaluation needs to know which face is meant.
Return Value
Type: SubDComponentParameter
[Missing <returns> documentation for "M:Rhino.Geometry.SubDComponentParameter.CreateVertexParameter(System.UInt32,System.UInt32)"]
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace