RhinoCommon API
Mesh.IsManifold Method (Boolean, Boolean, Boolean)
 Gets a value indicating whether or not the mesh is manifold. A manifold mesh does not have any edge that borders more than two faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsManifold(
	bool topologicalTest,
	out bool isOriented,
	out bool hasBoundary
)
Public Function IsManifold (
	topologicalTest As Boolean,
	<OutAttribute> ByRef isOriented As Boolean,
	<OutAttribute> ByRef hasBoundary As Boolean
) As Boolean
Parameters
topologicalTest
Type: System.Boolean
 If true, the query treats coincident vertices as the same.
isOriented
Type: System.Boolean
 isOriented will be set to true if the mesh is a manifold and adjacent faces have compatible face normals.
hasBoundary
Type: System.Boolean
 hasBoundary will be set to true if the mesh is a manifold and there is at least one "edge" with no more than one adjacent face.
Return Value
Type: Boolean
true if every mesh "edge" has at most two adjacent faces.
See Also
Reference
Mesh Class
IsManifold Overload
Rhino.Geometry Namespace