RhinoCommon API
PythonScript.Compile Method
 Compiles a class in a quick-to-execute proxy.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public abstract PythonCompiledCode Compile(
	string script
)
Public MustOverride Function Compile (
	script As String
) As PythonCompiledCode
Parameters
script
Type: System.String
A string text.
Return Value
Type: PythonCompiledCode
A Python compiled code instance.
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace