RhinoCommon API
SubDEdgeSharpness.VertexSharpness Method
 Calculates the sharpness of a vertex from the sharp edges attached to it. Vertices tagged as corners always have a sharpness of 0.0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static double VertexSharpness(
	SubDVertexTag vertexTag,
	double interiorCreaseVertexSharpness,
	uint sharpEdgeEndCount,
	double maximumEdgeEndSharpness
)
Public Shared Function VertexSharpness (
	vertexTag As SubDVertexTag,
	interiorCreaseVertexSharpness As Double,
	sharpEdgeEndCount As UInteger,
	maximumEdgeEndSharpness As Double
) As Double
Parameters
vertexTag
Type: Rhino.Geometry.SubDVertexTag
The vertex tag.
interiorCreaseVertexSharpness
Type: System.Double
 Only meaningful for an interior crease vertex, where it is the largest sharpness at this vertex over the smooth edges of both sectors. This matters in low level SubD evaluation code that only has information about one sector. When in doubt, pass 0.0.
sharpEdgeEndCount
Type: System.UInt32
 The number of sharp edges at the vertex whose sharpness at this vertex is nonzero.
maximumEdgeEndSharpness
Type: System.Double
 The largest sharp edge end sharpness at the vertex.
Return Value
Type: Double
The sharpness to use when subdividing the vertex.
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace