RhinoCommon API
PersistentSettings.TryGetDefault Method (String, Int32)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Int32@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetDefault(
	string key,
	out int value
)
Public Function TryGetDefault (
	key As String,
	<OutAttribute> ByRef value As Integer
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Int32@)"]
value
Type: System.Int32
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Int32@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Int32@)"]
See Also
Reference
PersistentSettings Class
TryGetDefault Overload
Rhino Namespace