RhinoCommon API
GroundPlane Constructor (GroundPlane)
 Create a utility object not associated with any document from another object
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public GroundPlane(
	GroundPlane g
)
Public Sub New (
	g As GroundPlane
)
Parameters
g
Type: Rhino.Render.GroundPlane
See Also
Reference
GroundPlane Class
GroundPlane Overload
Rhino.Render Namespace