RhinoCommon API
CurveIntersections.GetEnumerator Method
 Returns an enumerator that is capable of yielding all IntersectionEvents in the collection.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IEnumerator<IntersectionEvent> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of IntersectionEvent)
Return Value
Type: IEnumerator<IntersectionEvent>
The constructed enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
CurveIntersections Class
Rhino.Geometry.Intersect Namespace