RhinoCommon API
DisplayPipelineAttributes.SetSurfaceIsoThicknessUsage Method
 This is a helper function that combines setting IsoThicknessUsed and SurfaceNakedEdgeThicknessUsageFlags settings to correspond to the behavor of the Settings page.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public void SetSurfaceIsoThicknessUsage(
	DisplayPipelineAttributes.SurfaceIsoThicknessUse value
)
Public Sub SetSurfaceIsoThicknessUsage (
	value As DisplayPipelineAttributes.SurfaceIsoThicknessUse
)
Parameters
value
Type: Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThicknessUse
[Missing <param name="value"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.SetSurfaceIsoThicknessUsage(Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThicknessUse)"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace