RhinoCommon API
PageViewGroup.GetUserStrings Method
 Gets a copy of all (user key string, user value string) pairs attached to this component.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public NameValueCollection GetUserStrings()
Public Function GetUserStrings As NameValueCollection
Return Value
Type: NameValueCollection
A new collection.
See Also
Reference
PageViewGroup Class
Rhino.DocObjects Namespace