RhinoCommon API
ObjectAttributes.SetObjectFrame Method (Plane)
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.SetObjectFrame(Rhino.Geometry.Plane)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetObjectFrame(
	Plane plane
)
Public Sub SetObjectFrame (
	plane As Plane
)
Parameters
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.SetObjectFrame(Rhino.Geometry.Plane)"]
See Also
Reference
ObjectAttributes Class
SetObjectFrame Overload
Rhino.DocObjects Namespace