RhinoCommon API
SubD.CreateGlobeSphere Method
 Creates a SubD sphere made from polar triangle fans and bands of quads. The result resembles a globe with triangle fans at the poles and the edges forming latitude parallels and longitude meridians.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static SubD CreateGlobeSphere(
	Sphere sphere,
	SubDComponentLocation vertexLocation,
	uint axialFaceCount,
	uint equatorialFaceCount
)
Public Shared Function CreateGlobeSphere (
	sphere As Sphere,
	vertexLocation As SubDComponentLocation,
	axialFaceCount As UInteger,
	equatorialFaceCount As UInteger
) As SubD
Parameters
sphere
Type: Rhino.Geometry.Sphere
Location, size and orientation of the sphere.
vertexLocation
Type: Rhino.Geometry.SubDComponentLocation
 If vertexLocation = SubDComponentLocation::ControlNet, then the control net points will be on the surface of the sphere. Otherwise the limit surface points will be on the sphere.
axialFaceCount
Type: System.UInt32
 Number of faces along the sphere's meridians. (axialFaceCount >= 2) For example, if you wanted each face to span 30 degrees of latitude, you would pass 6 (=180 degrees/30 degrees) for axialFaceCount.
equatorialFaceCount
Type: System.UInt32
 Number of faces around the sphere's parallels. (equatorialFaceCount >= 3) For example, if you wanted each face to span 30 degrees of longitude, you would pass 12 (=360 degrees/30 degrees) for equatorialFaceCount.
Return Value
Type: SubD
 If the input parameters are valid, a SubD globe sphere is returned. Otherwise null is returned.
See Also
Reference
SubD Class
Rhino.Geometry Namespace