RhinoCommon API
HatchPattern Constructor
Initializes a new instance of the HatchPattern class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public HatchPattern()
Public Sub New
See Also
Reference
HatchPattern Class
HatchPattern Overload
Rhino.DocObjects Namespace