RhinoCommon API
PlugIn.GetInstalledPlugIns Method
 Get a list of all registered plug-in's regardless of if they are loaded or not.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Dictionary<Guid, string> GetInstalledPlugIns()
Public Shared Function GetInstalledPlugIns As Dictionary(Of Guid, String)
Return Value
Type: Dictionary<Guid, String>
 Dictionary with plug-in ID as key and localized plug-in name as value
See Also
Reference
PlugIn Class
GetInstalledPlugIns Overload
Rhino.PlugIns Namespace