RhinoCommon API
Brep.Flip Method
 Reverses entire brep orientation of all faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Flip()
Public Sub Flip
See Also
Reference
Brep Class
Rhino.Geometry Namespace