RhinoCommon API
PlugIn.IdFromName Method
 Gets the id of an installed plug-in giving the plug-in's name.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.5
Syntax
public static Guid IdFromName(
	string pluginName
)
Public Shared Function IdFromName (
	pluginName As String
) As Guid
Parameters
pluginName
Type: System.String
The name of the installed plug-in.
Return Value
Type: Guid
The id if successful.
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace