RhinoCommon API
ObjectTable.Replace Method (Guid, Extrusion)
Replaces one object with new extrusion object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Replace(
	Guid objectId,
	Extrusion extrusion
)
Public Function Replace (
	objectId As Guid,
	extrusion As Extrusion
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
extrusion
Type: Rhino.Geometry.Extrusion
New extrusion to be added. A duplicate of the extrusion is added to the Rhino model.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace