RhinoCommon API
PageViewGroupTable.Delete Method (Guid, Boolean)
 Deletes a page view group.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Delete(
	Guid id,
	bool quiet
)
Public Function Delete (
	id As Guid,
	quiet As Boolean
) As Boolean
Parameters
id
Type: System.Guid
Id of page view group.
quiet
Type: System.Boolean
true to disable any warning or error messages.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
PageViewGroupTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace