RhinoCommon API
ClassArrayOnObjRef.ToNonConstArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public ObjRef[] ToNonConstArray()
Public Function ToNonConstArray As ObjRef()
Return Value
Type: ObjRef[]
The managed array.
See Also
Reference
ClassArrayOnObjRef Class
ToNonConstArray Overload
Rhino.Runtime.InteropWrappers Namespace