RhinoCommon API
ToolbarFileCollection.FindByPath Method
 Gets an open toolbar by full path.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ToolbarFile FindByPath(
	string path
)
Public Function FindByPath (
	path As String
) As ToolbarFile
Parameters
path
Type: System.String
The full path to the toolbar file.
Return Value
Type: ToolbarFile
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFileCollection.FindByPath(System.String)"]
Return Value
Type: ToolbarFile
The toolbar if successful, null otherwise.
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace