RhinoCommon API
File3dm.ToByteArray Method (File3dmWriteOptions)
 Write to an in-memory byte[]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public byte[] ToByteArray(
	File3dmWriteOptions options
)
Public Function ToByteArray (
	options As File3dmWriteOptions
) As Byte()
Parameters
options
Type: Rhino.FileIO.File3dmWriteOptions
[Missing <param name="options"/> documentation for "M:Rhino.FileIO.File3dm.ToByteArray(Rhino.FileIO.File3dmWriteOptions)"]
Return Value
Type: Byte[]
[Missing <returns> documentation for "M:Rhino.FileIO.File3dm.ToByteArray(Rhino.FileIO.File3dmWriteOptions)"]
See Also
Reference
File3dm Class
ToByteArray Overload
Rhino.FileIO Namespace