RhinoCommon API
RdkSelectionNavigator.Add Method
 Add a selection of contents at the current position. Clears the navigator ahead of the current position.
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Add(
	RenderContentCollection selectedContentArray
)
Public Sub Add (
	selectedContentArray As RenderContentCollection
)
Parameters
selectedContentArray
Type: Rhino.Render.RenderContentCollection
The selected content
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace