RhinoCommon API
DisplayPipeline.DrawHatch Method (Hatch, Color, DisplayPen, Color)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawHatch(Rhino.Geometry.Hatch,System.Drawing.Color,Rhino.Display.DisplayPen,System.Drawing.Color)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void DrawHatch(
	Hatch hatch,
	Color hatchColor,
	DisplayPen boundary,
	Color backgroundFillColor
)
Public Sub DrawHatch (
	hatch As Hatch,
	hatchColor As Color,
	boundary As DisplayPen,
	backgroundFillColor As Color
)
Parameters
hatch
Type: Rhino.Geometry.Hatch
[Missing <param name="hatch"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawHatch(Rhino.Geometry.Hatch,System.Drawing.Color,Rhino.Display.DisplayPen,System.Drawing.Color)"]
hatchColor
Type: System.Drawing.Color
[Missing <param name="hatchColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawHatch(Rhino.Geometry.Hatch,System.Drawing.Color,Rhino.Display.DisplayPen,System.Drawing.Color)"]
boundary
Type: Rhino.Display.DisplayPen
[Missing <param name="boundary"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawHatch(Rhino.Geometry.Hatch,System.Drawing.Color,Rhino.Display.DisplayPen,System.Drawing.Color)"]
backgroundFillColor
Type: System.Drawing.Color
[Missing <param name="backgroundFillColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawHatch(Rhino.Geometry.Hatch,System.Drawing.Color,Rhino.Display.DisplayPen,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
DrawHatch Overload
Rhino.Display Namespace