RhinoCommon API
RenderTabs.FromRenderSessionId Method
 Get the instance of a render tab associated with a specific render session, this is useful when it is necessary to update a control from a RenderPipeline
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public static Object FromRenderSessionId(
	PlugIn plugIn,
	Type tabType,
	Guid renderSessionId
)
Public Shared Function FromRenderSessionId (
	plugIn As PlugIn,
	tabType As Type,
	renderSessionId As Guid
) As Object
Parameters
plugIn
Type: Rhino.PlugIns.PlugIn
 The plug-in that registered the custom user interface
tabType
Type: System.Type
 The type of tab to return
renderSessionId
Type: System.Guid
 The RenderSessionId of a specific render session.
Return Value
Type: Object
 Returns the custom tab object if found; otherwise null is returned.
See Also
Reference
RenderTabs Class
Rhino.Render Namespace