RhinoCommon API
PrintedPageDefinition Constructor
Initializes a new instance of the PrintedPageDefinition class
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PrintedPageDefinition()
Public Sub New
See Also
Reference
PrintedPageDefinition Class
Rhino Namespace