RhinoCommon API
RenderPrimitiveList.TryGetPlane Method
 Call this method to get a box at the specified index.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool TryGetPlane(
	int index,
	out PlaneSurface plane
)
Public Function TryGetPlane (
	index As Integer,
	<OutAttribute> ByRef plane As PlaneSurface
) As Boolean
Parameters
index
Type: System.Int32
 The zero based index of the item in the list. Valid values are greater than or equal to 0 and less than Count.
plane
Type: Rhino.Geometry.PlaneSurface
 Will contain the plane at the requested index if the index is in range and the primitive at the requested index is a plane.
Return Value
Type: Boolean
 Return true if the index is in range and the primitive at the requested index is a plane otherwise returns false.
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace