RhinoCommon API
RhinoViewport.LastLensLength Method
 Returns the lens length of this viewport the last time it was using perspective projection in this session.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double LastLensLength()
Public Function LastLensLength As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.LastLensLength"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace