RhinoCommon API
LicenseData Constructor
 Public constructor.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public LicenseData()
Public Sub New
See Also
Reference
LicenseData Class
LicenseData Overload
Rhino.PlugIns Namespace