RhinoCommon API
Torus.ToNurbsSurface Method
 Converts this torus to its NURBS surface representation. This is synonymous with calling CreateFromTorus(Torus).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public NurbsSurface ToNurbsSurface()
Public Function ToNurbsSurface As NurbsSurface
Return Value
Type: NurbsSurface
A NURBS surface representation of this torus, or null on error.
See Also
Reference
Torus Structure
Rhino.Geometry Namespace