RhinoCommon API
FieldDictionary.Set Method (String, Color, RenderContent.ChangeContexts)
Note: This API is now obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
[ObsoleteAttribute("Use version without ChangeContexts")]
public void Set(
	string key,
	Color value,
	RenderContent.ChangeContexts changeContext
)
<ObsoleteAttribute("Use version without ChangeContexts")>
Public Sub Set (
	key As String,
	value As Color,
	changeContext As RenderContent.ChangeContexts
)
Parameters
key
Type: System.String
Key name for the field value to change. See important note above.
value
Type: System.Drawing.Color
New value for this field.
changeContext
Type: Rhino.Render.RenderContent.ChangeContexts
The reason why the value is changing.
See Also
Reference
FieldDictionary Class
Set Overload
Rhino.Render.Fields Namespace