RhinoCommon API
Localization.LogicalSort Method
 Compares two strings. Digits in the strings are considered as numerical content rather than text. This test is not case-sensitive.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.32
Syntax
public static int LogicalSort(
	string string1,
	string string2
)
Public Shared Function LogicalSort (
	string1 As String,
	string2 As String
) As Integer
Parameters
string1
Type: System.String
First string to be compared.
string2
Type: System.String
Second string to be compared.
Return Value
Type: Int32
 Returns zero if the strings are identical. Returns 1 if string1 has a greater value than string2. Returns -1 if string1 has a lesser value than string2.
Exceptions
Exception | Condition
ArgumentNullException
See Also
Reference
Localization Class
Rhino.UI Namespace