RhinoCommon API
RenderContentCollection.GetFilterContentByUsage Method
 Gets usage filter type for collection
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.9
Syntax
public FilterContentByUsage GetFilterContentByUsage()
Public Function GetFilterContentByUsage As FilterContentByUsage
Return Value
Type: FilterContentByUsage
Usage filter type for collection
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace