RhinoCommon API
Squisher.Get3dMesh Method
 Get the 3d mesh that was used for squish operation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public Mesh Get3dMesh()
Public Function Get3dMesh As Mesh
Return Value
Type: Mesh
Returns the squished 2d mesh
See Also
Reference
Squisher Class
Rhino.Geometry Namespace