RhinoCommon API
PythonScript.GetSearchPaths Method
Protected helper function for static SearchPaths
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract string[] GetSearchPaths()
Protected MustOverride Function GetSearchPaths As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.Runtime.PythonScript.GetSearchPaths"]
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace