RhinoCommon API
ScaleValue.LeftLengthValue Method
 Get the Left LengthValue from Scale
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LengthValue LeftLengthValue()
Public Function LeftLengthValue As LengthValue
Return Value
Type: LengthValue
[Missing <returns> documentation for "M:Rhino.ScaleValue.LeftLengthValue"]
See Also
Reference
ScaleValue Class
Rhino Namespace