RhinoCommon API
RhinoPageView.GetPageViewGroupList Method
 Gets an array of page view group indices this page view belongs to.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int[] GetPageViewGroupList()
Public Function GetPageViewGroupList As Integer()
Return Value
Type: Int32[]
An array of page view group indices if successful, otherwise an empty array.
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace