RhinoCommon API
DisplayPipeline.MakeDefaultOpenGLContextCurrent Method
 Make a "default" OpenGL context current
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool MakeDefaultOpenGLContextCurrent()
Public Shared Function MakeDefaultOpenGLContextCurrent As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipeline.MakeDefaultOpenGLContextCurrent"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace