RhinoCommon API
PlaneSurface.GetExtents Method
 Gets the extents of the plane surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Interval GetExtents(
	int direction
)
Public Function GetExtents (
	direction As Integer
) As Interval
Parameters
direction
Type: System.Int32
 The direction, where 0 gets plane surface's x coordinate extents and 1 gets plane surface's y coordinate extents.
Return Value
Type: Interval
An increasing interval.
See Also
Reference
PlaneSurface Class
Rhino.Geometry Namespace