RhinoCommon API
ArchivableDictionary.GetPlane Method (String)
 Get value as Plane, will return defaultValue unless value was created using Set(string key, Plane value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public Plane GetPlane(
	string key
)
Public Function GetPlane (
	key As String
) As Plane
Parameters
key
Type: System.String
The key.
Return Value
Type: Plane
The value as Plane.
See Also
Reference
ArchivableDictionary Class
GetPlane Overload
Rhino.Collections Namespace