RhinoCommon API
DisplayPipeline.DrawAnnotation Method (AnnotationBase, Color)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawAnnotation(Rhino.Geometry.AnnotationBase,System.Drawing.Color)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawAnnotation(
	AnnotationBase annotation,
	Color color
)
Public Sub DrawAnnotation (
	annotation As AnnotationBase,
	color As Color
)
Parameters
annotation
Type: Rhino.Geometry.AnnotationBase
[Missing <param name="annotation"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawAnnotation(Rhino.Geometry.AnnotationBase,System.Drawing.Color)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawAnnotation(Rhino.Geometry.AnnotationBase,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
DrawAnnotation Overload
Rhino.Display Namespace