RhinoCommon API
PostEffectState.SetValue<T> Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffectState.SetValue``1(System.String,``0)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool SetValue<T>(
	string name,
	T vValue
)
Public Function SetValue(Of T) (
	name As String,
	vValue As T
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Render.PostEffects.PostEffectState.SetValue``1(System.String,``0)"]
vValue
Type: T
[Missing <param name="vValue"/> documentation for "M:Rhino.Render.PostEffects.PostEffectState.SetValue``1(System.String,``0)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.Render.PostEffects.PostEffectState.SetValue``1(System.String,``0)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectState.SetValue``1(System.String,``0)"]
See Also
Reference
PostEffectState Class
Rhino.Render.PostEffects Namespace