RhinoCommon API
SimpleArrayPoint3d Constructor
 Initializes a new empty SimpleArrayPoint3d instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SimpleArrayPoint3d()
Public Sub New
See Also
Reference
SimpleArrayPoint3d Class
SimpleArrayPoint3d Overload
Rhino.Runtime.InteropWrappers Namespace