RhinoCommon API
Polyline Constructor (IEnumerable<Point3d>)
 Initializes a new polyline from a collection of points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Polyline(
	IEnumerable<Point3d> collection
)
Public Sub New (
	collection As IEnumerable(Of Point3d)
)
Parameters
collection
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to copy into the local vertex array.
See Also
Reference
Polyline Class
Polyline Overload
Rhino.Geometry Namespace