RhinoCommon API
ModelAidSettings.GetDefaultState Method
 Gets the factory settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static ModelAidSettingsState GetDefaultState()
Public Shared Function GetDefaultState As ModelAidSettingsState
Return Value
Type: ModelAidSettingsState
A new model aid state with factory settings.
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace