RhinoCommon API
SectionStyleTable.Find Method (String)
Finds the section style with a given name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Find(
	string name
)
Public Function Find (
	name As String
) As Integer
Parameters
name
Type: System.String
 The name of the section style to find. The search ignores case.
Return Value
Type: Int32
 If the section style was found, the section style index, >=0, is returned. If the section style was not found, -1 is returned.
See Also
Reference
SectionStyleTable Class
Find Overload
Rhino.DocObjects.Tables Namespace