RhinoCommon API
RhinoObject.SetCopyHistoryOnReplace Method
 If this object has a history record, the CopyOnReplace field is set When an object is replaced in a document and the old object has a history record with this field set, the history record is copied and attached to the new object. That allows a descendant object to continue the history linkage after it is edited.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public void SetCopyHistoryOnReplace(
	bool bCopy
)
Public Sub SetCopyHistoryOnReplace (
	bCopy As Boolean
)
Parameters
bCopy
Type: System.Boolean
[Missing <param name="bCopy"/> documentation for "M:Rhino.DocObjects.RhinoObject.SetCopyHistoryOnReplace(System.Boolean)"]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace