RhinoCommon API
ArchivableDictionary.TryGetValue Method
 Gets the value associated with the specified key.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetValue(
	string key,
	out Object value
)
Public Function TryGetValue (
	key As String,
	<OutAttribute> ByRef value As Object
) As Boolean
Parameters
key
Type: System.String
The key of the value to get.
value
Type: System.Object
When this method returns and if the key is found, contains the value associated with the specified key; otherwise, null. This parameter is passed uninitialized.
Return Value
Type: Boolean
true if the dictionary contains an element with the specified key; otherwise, false.
Implements
IDictionary<TKey, TValue>.TryGetValue(TKey, TValue)
Exceptions
Exception | Condition
ArgumentNullException | Key is null.
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace