RhinoCommon API
PythonCompiledCode.Execute Method
 Executes the script in a specific scope.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public abstract void Execute(
	PythonScript scope
)
Public MustOverride Sub Execute (
	scope As PythonScript
)
Parameters
scope
Type: Rhino.Runtime.PythonScript
The scope where the script should be executed.
See Also
Reference
PythonCompiledCode Class
Rhino.Runtime Namespace