RhinoCommon API
RenderContentCollection.Add Method
 Add an array of non-const contents to the collection.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Add(
	RenderContentCollection collection
)
Public Sub Add (
	collection As RenderContentCollection
)
Parameters
collection
Type: Rhino.Render.RenderContentCollection
The array of contents to add
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace