RhinoCommon API
SubDDisplayParameters Constructor (SerializationInfo, StreamingContext)
 Called by BinaryFormatter.Deserialize to create a new MeshParamaters object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public SubDDisplayParameters(
	SerializationInfo info,
	StreamingContext context
)
Public Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
[Missing <param name="info"/> documentation for "M:Rhino.Geometry.SubDDisplayParameters.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
context
Type: System.Runtime.Serialization.StreamingContext
[Missing <param name="context"/> documentation for "M:Rhino.Geometry.SubDDisplayParameters.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
See Also
Reference
SubDDisplayParameters Class
SubDDisplayParameters Overload
Rhino.Geometry Namespace