RhinoCommon API
ObjectAttributes.DrawColor Method (RhinoDoc)
 Gets an object's draw color, which is based on the object's color source
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color DrawColor(
	RhinoDoc document
)
Public Function DrawColor (
	document As RhinoDoc
) As Color
Parameters
document
Type: Rhino.RhinoDoc
The object's documnt.
Return Value
Type: Color
The draw color.
See Also
Reference
ObjectAttributes Class
DrawColor Overload
Rhino.DocObjects Namespace