RhinoCommon API
FileObjReadOptions Constructor
Initializes a new instance of the FileObjReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public FileObjReadOptions(
	FileReadOptions readOptions
)
Public Sub New (
	readOptions As FileReadOptions
)
Parameters
readOptions
Type: Rhino.FileIO.FileReadOptions
[Missing <param name="readOptions"/> documentation for "M:Rhino.FileIO.FileObjReadOptions.#ctor(Rhino.FileIO.FileReadOptions)"]
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace