RhinoCommon API
RhinoDoc.GetEmbeddedFilesList Method
[Missing <summary> documentation for "M:Rhino.RhinoDoc.GetEmbeddedFilesList(System.Boolean)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string[] GetEmbeddedFilesList(
	bool missingOnly
)
Public Function GetEmbeddedFilesList (
	missingOnly As Boolean
) As String()
Parameters
missingOnly
Type: System.Boolean
[Missing <param name="missingOnly"/> documentation for "M:Rhino.RhinoDoc.GetEmbeddedFilesList(System.Boolean)"]
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.RhinoDoc.GetEmbeddedFilesList(System.Boolean)"]
See Also
Reference
RhinoDoc Class
Rhino Namespace