RhinoCommon API
Point2d.Add Method (Point2d, Vector2d)
 Adds a point with a vector.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Point2d Add(
	Point2d point,
	Vector2d vector
)
Public Shared Function Add (
	point As Point2d,
	vector As Vector2d
) As Point2d
Parameters
point
Type: Rhino.Geometry.Point2d
A point.
vector
Type: Rhino.Geometry.Vector2d
A vector.
Return Value
Type: Point2d
A new point that is coordinate-wise summed with the vector.
See Also
Reference
Point2d Structure
Add Overload
Rhino.Geometry Namespace