RhinoCommon API
SimulatedTexture.SetMappingChannelAndProjectionMode Method
[Missing <summary> documentation for "M:Rhino.Render.SimulatedTexture.SetMappingChannelAndProjectionMode(Rhino.Render.SimulatedTexture.ProjectionModes,System.Int32,Rhino.Render.SimulatedTexture.EnvironmentMappingModes)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetMappingChannelAndProjectionMode(
	SimulatedTexture.ProjectionModes pm,
	int mappingChannel,
	SimulatedTexture.EnvironmentMappingModes emm
)
Public Sub SetMappingChannelAndProjectionMode (
	pm As SimulatedTexture.ProjectionModes,
	mappingChannel As Integer,
	emm As SimulatedTexture.EnvironmentMappingModes
)
Parameters
pm
Type: Rhino.Render.SimulatedTexture.ProjectionModes
[Missing <param name="pm"/> documentation for "M:Rhino.Render.SimulatedTexture.SetMappingChannelAndProjectionMode(Rhino.Render.SimulatedTexture.ProjectionModes,System.Int32,Rhino.Render.SimulatedTexture.EnvironmentMappingModes)"]
mappingChannel
Type: System.Int32
[Missing <param name="mappingChannel"/> documentation for "M:Rhino.Render.SimulatedTexture.SetMappingChannelAndProjectionMode(Rhino.Render.SimulatedTexture.ProjectionModes,System.Int32,Rhino.Render.SimulatedTexture.EnvironmentMappingModes)"]
emm
Type: Rhino.Render.SimulatedTexture.EnvironmentMappingModes
[Missing <param name="emm"/> documentation for "M:Rhino.Render.SimulatedTexture.SetMappingChannelAndProjectionMode(Rhino.Render.SimulatedTexture.ProjectionModes,System.Int32,Rhino.Render.SimulatedTexture.EnvironmentMappingModes)"]
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace