RhinoCommon API
Layer.GetCustomSectionStyle Method
 Get an optional custom section style associated with these attributes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public SectionStyle GetCustomSectionStyle()
Public Function GetCustomSectionStyle As SectionStyle
Return Value
Type: SectionStyle
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.GetCustomSectionStyle"]
See Also
Reference
Layer Class
Rhino.DocObjects Namespace