RhinoCommon API
TextObject.GetTextCorners Method
 Gets the world 3D corner points of the whole text object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.21
Syntax
public Point3d[] GetTextCorners(
	RhinoViewport viewport
)
Public Function GetTextCorners (
	viewport As RhinoViewport
) As Point3d()
Parameters
viewport
Type: Rhino.Display.RhinoViewport
The viewport in which to make the calculation.
Return Value
Type: Point3d[]
The four corner points if successful, an empty array on failure.
Exceptions
Exception | Condition
ArgumentNullException
See Also
Reference
TextObject Class
Rhino.DocObjects Namespace