RhinoCommon API
TextFields.DateModified Method (String, String)
 Date the document was last edited in a specific format and language in local time
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string DateModified(
	string dateFormat,
	string languageId
)
Public Shared Function DateModified (
	dateFormat As String,
	languageId As String
) As String
Parameters
dateFormat
Type: System.String
[Missing <param name="dateFormat"/> documentation for "M:Rhino.Runtime.TextFields.DateModified(System.String,System.String)"]
languageId
Type: System.String
[Missing <param name="languageId"/> documentation for "M:Rhino.Runtime.TextFields.DateModified(System.String,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.DateModified(System.String,System.String)"]
See Also
Reference
TextFields Class
DateModified Overload
Rhino.Runtime Namespace