RhinoCommon API
ThumbnailViewModelFactory.Get Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.ThumbnailViewModelFactory.Get(System.Guid)"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override IntPtr Get(
	Guid id
)
Public Overrides Function Get (
	id As Guid
) As IntPtr
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.ThumbnailViewModelFactory.Get(System.Guid)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.ThumbnailViewModelFactory.Get(System.Guid)"]
See Also
Reference
ThumbnailViewModelFactory Class
Rhino.UI.Controls.ThumbnailUI Namespace