RhinoCommon API
BoundingBox.MinimumDistanceTo Method
 Finds the shortest distance between this bounding box and a test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double MinimumDistanceTo(
	Point3d testPoint
)
Public Function MinimumDistanceTo (
	testPoint As Point3d
) As Double
Parameters
testPoint
Type: Rhino.Geometry.Point3d
A point to test.
Return Value
Type: Double
The minimum distance.
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace