RhinoCommon API
ViewInfo.GetConstructionPlane Method
 Gets the view's construction plane, including its grid settings: grid and snap spacing, grid line count, thick-line frequency, and depth buffering.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.35
Syntax
public ConstructionPlane GetConstructionPlane()
Public Function GetConstructionPlane As ConstructionPlane
Return Value
Type: ConstructionPlane
A copy of the view's construction plane.
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace