RhinoCommon API
DisplayDeviceInfo Constructor
Initializes a new instance of the DisplayDeviceInfo class
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayDeviceInfo()
Public Sub New
See Also
Reference
DisplayDeviceInfo Class
Rhino Namespace