RhinoCommon API
RhinoDoc.AdjustLengthUnits Method
[Missing <summary> documentation for "M:Rhino.RhinoDoc.AdjustLengthUnits(System.Boolean,Rhino.LengthUnit,System.Boolean)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool AdjustLengthUnits(
	bool modelUnits,
	LengthUnit units,
	bool scale
)
Public Function AdjustLengthUnits (
	modelUnits As Boolean,
	units As LengthUnit,
	scale As Boolean
) As Boolean
Parameters
modelUnits
Type: System.Boolean
[Missing <param name="modelUnits"/> documentation for "M:Rhino.RhinoDoc.AdjustLengthUnits(System.Boolean,Rhino.LengthUnit,System.Boolean)"]
units
Type: Rhino.LengthUnit
[Missing <param name="units"/> documentation for "M:Rhino.RhinoDoc.AdjustLengthUnits(System.Boolean,Rhino.LengthUnit,System.Boolean)"]
scale
Type: System.Boolean
[Missing <param name="scale"/> documentation for "M:Rhino.RhinoDoc.AdjustLengthUnits(System.Boolean,Rhino.LengthUnit,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoDoc.AdjustLengthUnits(System.Boolean,Rhino.LengthUnit,System.Boolean)"]
See Also
Reference
RhinoDoc Class
Rhino Namespace