RhinoCommon API
PersistentSettings.GetPoint Method (String, Point, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetPoint(System.String,System.Drawing.Point,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point GetPoint(
	string key,
	Point defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetPoint (
	key As String,
	defaultValue As Point,
	legacyKeyList As IEnumerable(Of String)
) As Point
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetPoint(System.String,System.Drawing.Point,System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.Drawing.Point
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetPoint(System.String,System.Drawing.Point,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetPoint(System.String,System.Drawing.Point,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Point
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetPoint(System.String,System.Drawing.Point,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetPoint Overload
Rhino Namespace