RhinoCommon API
UserInterfaceControl.ComputedRectangle Method
[Missing <summary> documentation for "M:Rhino.UI.UserInterfaceControl.ComputedRectangle(Rhino.Display.RhinoView,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RectangleF ComputedRectangle(
	RhinoView view,
	bool logicalPixels
)
Public Function ComputedRectangle (
	view As RhinoView,
	logicalPixels As Boolean
) As RectangleF
Parameters
view
Type: Rhino.Display.RhinoView
[Missing <param name="view"/> documentation for "M:Rhino.UI.UserInterfaceControl.ComputedRectangle(Rhino.Display.RhinoView,System.Boolean)"]
logicalPixels
Type: System.Boolean
[Missing <param name="logicalPixels"/> documentation for "M:Rhino.UI.UserInterfaceControl.ComputedRectangle(Rhino.Display.RhinoView,System.Boolean)"]
Return Value
Type: RectangleF
[Missing <returns> documentation for "M:Rhino.UI.UserInterfaceControl.ComputedRectangle(Rhino.Display.RhinoView,System.Boolean)"]
See Also
Reference
UserInterfaceControl Class
Rhino.UI Namespace