RhinoCommon API
RenderMeshProvider.RenderMeshes Method
 Returns a complete set of custom render primitives for a given ObjectId.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public abstract RenderMeshes RenderMeshes(
	MeshType mt,
	ViewportInfo vp,
	RhinoDoc doc,
	Guid objectId,
	List<InstanceObject> ancestry,
	ref RenderMeshProvider.Flags flags,
	RenderMeshes previousPrimitives,
	PlugIn plugin,
	DisplayPipelineAttributes attrs
)
Public MustOverride Function RenderMeshes (
	mt As MeshType,
	vp As ViewportInfo,
	doc As RhinoDoc,
	objectId As Guid,
	ancestry As List(Of InstanceObject),
	ByRef flags As RenderMeshProvider.Flags,
	previousPrimitives As RenderMeshes,
	plugin As PlugIn,
	attrs As DisplayPipelineAttributes
) As RenderMeshes
Parameters
mt
Type: Rhino.Geometry.MeshType
The mesh type to provide meshes for
vp
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered
doc
Type: Rhino.RhinoDoc
The Rhino document associated with the objectId
objectId
Type: System.Guid
The objectId for which the primitives should be supplied.
ancestry
Type: System.Collections.Generic.List<InstanceObject>
The ancestry of the object - ie, block references referring to this definition. This is only used to handle ByParent attributes, and should not be used to transform geometry.
flags
Type: Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags
See RenderMeshProvider.Flags. This is an in/out parameter: set Incomplete on return if the meshes supplied are provisional because asynchronous work has not finished.
previousPrimitives
Type: Rhino.Render.CustomRenderMeshes.RenderMeshes
Optionally a custom set of initial primitives. If this parameter is empty, the standard render primitives for the object will be used, or an empty set of primitives will be used where they are not available. This is typically used in meshing exporters, which produce specific meshes for the output rather than using the render primitives.
plugin
Type: Rhino.PlugIns.PlugIn
The requesting plug-in - typically the render plug-in requesting the meshes.
attrs
Type: Rhino.Display.DisplayPipelineAttributes
The display attributes currently being used - nullptr if this is production rendering.
Return Value
Type: RenderMeshes
[Missing <returns> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshProvider.RenderMeshes(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,Rhino.RhinoDoc,System.Guid,System.Collections.Generic.List{Rhino.DocObjects.InstanceObject},Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.Render.CustomRenderMeshes.RenderMeshes,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes)"]
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace