RhinoCommon API
ViewTable.AddPageView Method (String, Boolean)
 Constructs a new page view with a given title and, at the same time, adds it to the list.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RhinoPageView AddPageView(
	string title,
	bool setActive
)
Public Function AddPageView (
	title As String,
	setActive As Boolean
) As RhinoPageView
Parameters
title
Type: System.String
 If null or empty, a name will be generated as "Page #" where # is the largest page number.
setActive
Type: System.Boolean
 If true, the new page view becomes the active view. If false, the view that was active before this call remains the active view.
Return Value
Type: RhinoPageView
The newly created page view on success; or null on error.
Remarks
 On Mac, building a page view's window is main-thread work. If setActive is true and this is called from another thread, the page view is created but may not have become the active view by the time this returns.
See Also
Reference
ViewTable Class
AddPageView Overload
Rhino.DocObjects.Tables Namespace