RhinoCommon API
Quaternion.CreateFromRotationZYX Method
 Constructs a quaternion defined by Tait-Byran angles, also loosely known as Euler angles.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Quaternion CreateFromRotationZYX(
	double yaw,
	double pitch,
	double roll
)
Public Shared Function CreateFromRotationZYX (
	yaw As Double,
	pitch As Double,
	roll As Double
) As Quaternion
Parameters
yaw
Type: System.Double
Angle, in radians, to rotate about the ZAxis.
pitch
Type: System.Double
Angle, in radians, to rotate about the YAxis.
roll
Type: System.Double
Angle, in radians, to rotate about the XAxis.
Return Value
Type: Quaternion
The quaternion.
Remarks
 CreateFromRotationZYX(yaw, pitch, roll) = R_z(yaw) * R_y(pitch) * R_x(roll), where R_*(angle) is rotation of angle radians about the corresponding world coordinate axis.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace