RhinoCommon API
CommandAliasList.GetNames Method
Returns a list of command alias names.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string[] GetNames()
Public Shared Function GetNames As String()
Return Value
Type: String[]
An array of strings. This can be empty.
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace