RhinoCommon API
SpaceMorph.MorphPoint Method
Morphs an Euclidean point.
This method is abstract.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public abstract Point3d MorphPoint(
	Point3d point
)
Public MustOverride Function MorphPoint (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point that will be morphed by this function.
Return Value
Type: Point3d
Resulting morphed point.
See Also
Reference
SpaceMorph Class
Rhino.Geometry Namespace