RhinoCommon API
ClippingPlaneObject.AddClipViewport Method
 Adds a viewport to the list of viewports that this clipping plane clips.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public bool AddClipViewport(
	RhinoViewport viewport,
	bool commit
)
Public Function AddClipViewport (
	viewport As RhinoViewport,
	commit As Boolean
) As Boolean
Parameters
viewport
Type: Rhino.Display.RhinoViewport
The viewport to add.
commit
Type: System.Boolean
Commit the change. When in doubt, set this parameter to true.
Return Value
Type: Boolean
true if the viewport was added, false if the viewport is already in the list.
See Also
Reference
ClippingPlaneObject Class
Rhino.DocObjects Namespace