RhinoCommon API
RadialDimension Constructor (AnnotationType, Plane, Point3d, Point3d, Point3d)
 Constructs a radial dimension from parameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RadialDimension(
	AnnotationType dimtype,
	Plane plane,
	Point3d centerpoint,
	Point3d radiuspoint,
	Point3d dimlinepoint
)
Public Sub New (
	dimtype As AnnotationType,
	plane As Plane,
	centerpoint As Point3d,
	radiuspoint As Point3d,
	dimlinepoint As Point3d
)
Parameters
dimtype
Type: Rhino.Geometry.AnnotationType
AnnotationType.Diameter or AnnotationType.Radius
plane
Type: Rhino.Geometry.Plane
Dimension's plane
centerpoint
Type: Rhino.Geometry.Point3d
Dimension's center point
radiuspoint
Type: Rhino.Geometry.Point3d
Point on dimension radius
dimlinepoint
Type: Rhino.Geometry.Point3d
Point on dimension line
See Also
Reference
RadialDimension Class
RadialDimension Overload
Rhino.Geometry Namespace