RhinoCommon API
SubD.Evaluate Method (SubDComponentParameter, Point3d, Vector3d, Vector3d, Vector3d)
 Evaluates the location, first derivatives and unit normal of a point on this SubD's surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Evaluate(
	SubDComponentParameter parameter,
	out Point3d point,
	out Vector3d ds,
	out Vector3d dt,
	out Vector3d normal
)
Public Function Evaluate (
	parameter As SubDComponentParameter,
	<OutAttribute> ByRef point As Point3d,
	<OutAttribute> ByRef ds As Vector3d,
	<OutAttribute> ByRef dt As Vector3d,
	<OutAttribute> ByRef normal As Vector3d
) As Boolean
Parameters
parameter
Type: Rhino.Geometry.SubDComponentParameter
The parameter to evaluate.
point
Type: Rhino.Geometry.Point3d
 The surface point is returned here, or Unset if this fails.
ds
Type: Rhino.Geometry.Vector3d
 The first derivative in the direction of the first face corner parameter is returned here.
dt
Type: Rhino.Geometry.Vector3d
 The first derivative in the direction of the second face corner parameter is returned here.
normal
Type: Rhino.Geometry.Vector3d
 The unit surface normal is returned here. It is parallel to the cross product of ds and dt.
Return Value
Type: Boolean
True if the evaluation succeeded.
See Also
Reference
SubD Class
Evaluate Overload
Rhino.Geometry Namespace