RhinoCommon API
Thumbnail.Id Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.Id"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid Id()
Public Function Id As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.Id"]
Implements
IRhRdkThumbnail.Id()
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace