RhinoCommon API
Brep.CreateBooleanDifferenceWithIndexMap Method
 Compute the solid difference between two sets of Breps.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Brep[] CreateBooleanDifferenceWithIndexMap(
	IEnumerable<Brep> firstSet,
	IEnumerable<Brep> secondSet,
	double tolerance,
	bool manifoldOnly,
	out int[] indexMap
)
Public Shared Function CreateBooleanDifferenceWithIndexMap (
	firstSet As IEnumerable(Of Brep),
	secondSet As IEnumerable(Of Brep),
	tolerance As Double,
	manifoldOnly As Boolean,
	<OutAttribute> ByRef indexMap As Integer()
) As Brep()
Parameters
firstSet
Type: System.Collections.Generic.IEnumerable<Brep>
The set to be differenced from.
secondSet
Type: System.Collections.Generic.IEnumerable<Brep>
The set to difference with.
tolerance
Type: System.Double
Tolerance to use for the boolean operation.
manifoldOnly
Type: System.Boolean
If true, non-manifold input breps are ignored.
indexMap
Type: System.Int32[]
results[i] is the result if subtracting something from firstSet[indexMap[i]].
Return Value
Type: Brep[]
An array of Brep results or null on failure. May be empty if all of the firstSet is differenced away.
Remarks
 Breps that have never been added to a document may need preparing first, or this method can fail, or return an unexpected result. See PrepareForBooleans().
See Also
Reference
Brep Class
Rhino.Geometry Namespace
Brep.PrepareForBooleans()