RhinoCommon API
MeshNgonList.SetNgon Method
 Set an ngon in this list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetNgon(
	int index,
	MeshNgon ngon
)
Public Sub SetNgon (
	index As Integer,
	ngon As MeshNgon
)
Parameters
index
Type: System.Int32
An ngon index.
ngon
Type: Rhino.Geometry.MeshNgon
An ngon.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If index is negative or >= Count.
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace