RhinoCommon API
BrepFaceList.SplitFaceAtTangents Method (Int32)
 Splits the face of a Brep at tangent locations. The face surface will be split at locations of curvature discontinuities with constant tangents.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SplitFaceAtTangents(
	int faceIndex
)
Public Function SplitFaceAtTangents (
	faceIndex As Integer
) As Boolean
Parameters
faceIndex
Type: System.Int32
The index of the face to split.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
BrepFaceList Class
SplitFaceAtTangents Overload
Rhino.Geometry.Collections Namespace