RhinoCommon API
SubDEdgeChain Constructor (SubD, SubDEdge)
 Creates a chain containing a single starting edge. Grow it with AddAllNeighbors(ChainDirection, SubDChainType) or AddOneNeighbor(ChainDirection, SubDChainType).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDEdgeChain(
	SubD subd,
	SubDEdge startEdge
)
Public Sub New (
	subd As SubD,
	startEdge As SubDEdge
)
Parameters
subd
Type: Rhino.Geometry.SubD
The SubD the chain runs through.
startEdge
Type: Rhino.Geometry.SubDEdge
The edge to start from.
See Also
Reference
SubDEdgeChain Class
SubDEdgeChain Overload
Rhino.Geometry Namespace