RhinoCommon API
ZBufferCapture.ShowCurves Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowCurves(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public void ShowCurves(
	bool on
)
Public Sub ShowCurves (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowCurves(System.Boolean)"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace