RhinoCommon API
GetTransform.GetXform Method
 Gets the Transformation.
Call this after having set up options and so on.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GetResult GetXform()
Public Function GetXform As GetResult
Return Value
Type: GetResult
The result based on user choice.
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace