RhinoCommon API
Worksession.UpdateAll Method
 Re-reads every reference model in this worksession whose file has changed on disk.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UpdateAll()
Public Function UpdateAll As Boolean
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace