RhinoCommon API
BrepSurfaceList.GetEnumerator Method
 Gets an enumerator that visits all surfaces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public IEnumerator<Surface> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Surface)
Return Value
Type: IEnumerator<Surface>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
BrepSurfaceList Class
Rhino.Geometry.Collections Namespace