RhinoCommon API
PersistentSettings.TryGetSettingIsHiddenFromUserInterface Method (String, Boolean)
 Values read from all users settings files will be marked as read-only which will cause any future calls to Set... to fail.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetSettingIsHiddenFromUserInterface(
	string key,
	out bool value
)
Public Function TryGetSettingIsHiddenFromUserInterface (
	key As String,
	<OutAttribute> ByRef value As Boolean
) As Boolean
Parameters
key
Type: System.String
 Key name for which to search.
value
Type: System.Boolean
 Value will be true if the setting is read-only otherwise false. setting.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetSettingIsHiddenFromUserInterface(System.String,System.Boolean@)"]
See Also
Reference
PersistentSettings Class
TryGetSettingIsHiddenFromUserInterface Overload
Rhino Namespace