RhinoCommon API
ModelComponent.ClearIndex Method
 Resets the HasIndex property of the model component to false, if possible.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void ClearIndex()
Public Sub ClearIndex
Exceptions
Exception | Condition
InvalidOperationException | If the index is locked.
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace