RhinoCommon API
TransformObjectList.Dispose Method
Releases all resources used by the TransformObjectList
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
TransformObjectList Class
Dispose Overload
Rhino.Collections Namespace