RhinoCommon API
RhinoApp.CommandLineTextWriter.Write Method (Char)
 Writes a char to the command line.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override void Write(
	char value
)
Public Overrides Sub Write (
	value As Char
)
Parameters
value
Type: System.Char
[Missing <param name="value"/> documentation for "M:Rhino.RhinoApp.CommandLineTextWriter.Write(System.Char)"]
See Also
Reference
RhinoApp.CommandLineTextWriter Class
Write Overload
Rhino Namespace