RhinoCommon API
PointCloud.AddRange Method (IEnumerable<Point3d>, IEnumerable<Vector3d>, IEnumerable<Color>)
 Appends a collection of points, normal vectors, and colors to this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void AddRange(
	IEnumerable<Point3d> points,
	IEnumerable<Vector3d> normals,
	IEnumerable<Color> colors
)
Public Sub AddRange (
	points As IEnumerable(Of Point3d),
	normals As IEnumerable(Of Vector3d),
	colors As IEnumerable(Of Color)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to append.
normals
Type: System.Collections.Generic.IEnumerable<Vector3d>
Normal Vectors to append.
colors
Type: System.Collections.Generic.IEnumerable<Color>
Colors to append.
See Also
Reference
PointCloud Class
AddRange Overload
Rhino.Geometry Namespace