RhinoCommon API
Utilities.ShowContentChooser Method (RhinoDoc, Guid, Guid, RenderContentKind, Utilities.ContentChooserFlags, String, IEnumerable<String>, IEnumerable<Guid>, Guid[])
Note: This API is now obsolete.
 Shows the Content New / Existing Browser to allow the user to select a new or existing content, or multiple contents.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
[ObsoleteAttribute("Since 9.0: Use ShowContentNewExistingBrowser() instead")]
public static Utilities.ShowContentChooserResults ShowContentChooser(
	RhinoDoc doc,
	Guid defaultType,
	Guid defaultInstanceId,
	RenderContentKind kinds,
	Utilities.ContentChooserFlags flags,
	string presetCategory,
	IEnumerable<string> categories,
	IEnumerable<Guid> types,
	out Guid[] instanceIdsOut
)
<ObsoleteAttribute("Since 9.0: Use ShowContentNewExistingBrowser() instead")>
Public Shared Function ShowContentChooser (
	doc As RhinoDoc,
	defaultType As Guid,
	defaultInstanceId As Guid,
	kinds As RenderContentKind,
	flags As Utilities.ContentChooserFlags,
	presetCategory As String,
	categories As IEnumerable(Of String),
	types As IEnumerable(Of Guid),
	<OutAttribute> ByRef instanceIdsOut As Guid()
) As Utilities.ShowContentChooserResults
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.Utilities.ContentChooserFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)"]
defaultType
Type: System.Guid
[Missing <param name="defaultType"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.Utilities.ContentChooserFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)"]
defaultInstanceId
Type: System.Guid
[Missing <param name="defaultInstanceId"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.Utilities.ContentChooserFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)"]
kinds
Type: Rhino.Render.RenderContentKind
[Missing <param name="kinds"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.Utilities.ContentChooserFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)"]
flags
Type: Rhino.Render.Utilities.ContentChooserFlags
[Missing <param name="flags"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.Utilities.ContentChooserFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)"]
presetCategory
Type: System.String
[Missing <param name="presetCategory"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.Utilities.ContentChooserFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)"]
categories
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="categories"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.Utilities.ContentChooserFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)"]
types
Type: System.Collections.Generic.IEnumerable<Guid>
[Missing <param name="types"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.Utilities.ContentChooserFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)"]
instanceIdsOut
Type: System.Guid[]
[Missing <param name="instanceIdsOut"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.Utilities.ContentChooserFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)"]
Return Value
Type: Utilities.ShowContentChooserResults
[Missing <returns> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.Utilities.ContentChooserFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)"]
See Also
Reference
Utilities Class
ShowContentChooser Overload
Rhino.Render Namespace