RhinoCommon API
ComponentStatus.WithStates Method
 Activates any information flag described in any of the two input component statuses and returns a new ComponentStatus with those flags checked.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ComponentStatus WithStates(
	ComponentStatus additionalStatus
)
Public Function WithStates (
	additionalStatus As ComponentStatus
) As ComponentStatus
Parameters
additionalStatus
Type: Rhino.Geometry.ComponentStatus
To be used for adding status values.
Return Value
Type: ComponentStatus
[Missing <returns> documentation for "M:Rhino.Geometry.ComponentStatus.WithStates(Rhino.Geometry.ComponentStatus)"]
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace