RhinoCommon API
SupportOptions.SetPreviewCustomRenderMeshes Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetPreviewCustomRenderMeshes(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void SetPreviewCustomRenderMeshes(
	bool b
)
Public Shared Sub SetPreviewCustomRenderMeshes (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetPreviewCustomRenderMeshes(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace