RhinoCommon API
RealtimeDisplayMode.HudShowMaxPasses Method
 Override to show maximum passes in HUD. By default disabled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool HudShowMaxPasses()
Public Overridable Function HudShowMaxPasses As Boolean
Return Value
Type: Boolean
Return true to show maximum passes.
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace