RhinoCommon API
TextureMapping.Decompose Method
 Gets the same decomposition of the texture mapping transforms as is used in the UI.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Decompose(
	Transform localTransform,
	out Vector3d xyz_position,
	out Vector3d xyz_scale,
	out Vector3d xyz_rotation,
	out Vector3d uvw_offset,
	out Vector3d uvw_repeat,
	out Vector3d uvw_rotation
)
Public Sub Decompose (
	localTransform As Transform,
	<OutAttribute> ByRef xyz_position As Vector3d,
	<OutAttribute> ByRef xyz_scale As Vector3d,
	<OutAttribute> ByRef xyz_rotation As Vector3d,
	<OutAttribute> ByRef uvw_offset As Vector3d,
	<OutAttribute> ByRef uvw_repeat As Vector3d,
	<OutAttribute> ByRef uvw_rotation As Vector3d
)
Parameters
localTransform
Type: Rhino.Geometry.Transform
[Missing <param name="localTransform"/> documentation for "M:Rhino.Render.TextureMapping.Decompose(Rhino.Geometry.Transform,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)"]
xyz_position
Type: Rhino.Geometry.Vector3d
[Missing <param name="xyz_position"/> documentation for "M:Rhino.Render.TextureMapping.Decompose(Rhino.Geometry.Transform,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)"]
xyz_scale
Type: Rhino.Geometry.Vector3d
[Missing <param name="xyz_scale"/> documentation for "M:Rhino.Render.TextureMapping.Decompose(Rhino.Geometry.Transform,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)"]
xyz_rotation
Type: Rhino.Geometry.Vector3d
[Missing <param name="xyz_rotation"/> documentation for "M:Rhino.Render.TextureMapping.Decompose(Rhino.Geometry.Transform,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)"]
uvw_offset
Type: Rhino.Geometry.Vector3d
[Missing <param name="uvw_offset"/> documentation for "M:Rhino.Render.TextureMapping.Decompose(Rhino.Geometry.Transform,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)"]
uvw_repeat
Type: Rhino.Geometry.Vector3d
[Missing <param name="uvw_repeat"/> documentation for "M:Rhino.Render.TextureMapping.Decompose(Rhino.Geometry.Transform,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)"]
uvw_rotation
Type: Rhino.Geometry.Vector3d
[Missing <param name="uvw_rotation"/> documentation for "M:Rhino.Render.TextureMapping.Decompose(Rhino.Geometry.Transform,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)"]
See Also
Reference
TextureMapping Class
Rhino.Render Namespace