RhinoCommon API
RenderWindow.ChannelGPU.Close Method
 Close the channel.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Close()
Public Sub Close
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace