RhinoCommon API
Brep.WireCut Method (IEnumerable<Curve>, Vector3d, Double, Boolean, Double, Boolean, Brep[], Brep[])
 Cuts this solid brep with extrusions of closed planar curves
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool WireCut(
	IEnumerable<Curve> closedCurves,
	Vector3d direction,
	double depth,
	bool bothSides,
	double tolerance,
	bool splitKinkyFaces,
	out Brep[] keptPieces,
	out Brep[] cutAwayPieces
)
Public Function WireCut (
	closedCurves As IEnumerable(Of Curve),
	direction As Vector3d,
	depth As Double,
	bothSides As Boolean,
	tolerance As Double,
	splitKinkyFaces As Boolean,
	<OutAttribute> ByRef keptPieces As Brep(),
	<OutAttribute> ByRef cutAwayPieces As Brep()
) As Boolean
Parameters
closedCurves
Type: System.Collections.Generic.IEnumerable<Curve>
Closed cutting curves. All are extruded along the same direction.
direction
Type: Rhino.Geometry.Vector3d
Extrusion direction of the cutters.
depth
Type: System.Double
Extrusion depth. RhinoMath.UnsetValue or a value <= 0 cuts all the way through.
bothSides
Type: System.Boolean
Extrude the cutters to both sides of the curves. Ignored when cutting through.
tolerance
Type: System.Double
Intersection and boolean tolerance, typically the document absolute tolerance.
splitKinkyFaces
Type: System.Boolean
Split output pieces along creases.
keptPieces
Type: Rhino.Geometry.Brep[]
Pieces that remain after the cut (boolean difference side).
cutAwayPieces
Type: Rhino.Geometry.Brep[]
The cut-away pieces (boolean intersection side).
Return Value
Type: Boolean
true if successful.
See Also
Reference
Brep Class
WireCut Overload
Rhino.Geometry Namespace