RhinoCommon API
FileAiReadOptions Constructor
Initializes a new instance of the FileAiReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileAiReadOptions()
Public Sub New
See Also
Reference
FileAiReadOptions Class
Rhino.FileIO Namespace