RhinoCommon API
Rectangle3d.RecenterPlane Method (Point3d)
 Re-centers the base plane on a new origin.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void RecenterPlane(
	Point3d origin
)
Public Sub RecenterPlane (
	origin As Point3d
)
Parameters
origin
Type: Rhino.Geometry.Point3d
New origin for plane.
See Also
Reference
Rectangle3d Structure
RecenterPlane Overload
Rhino.Geometry Namespace