RhinoCommon API
Mesh.SplitNon2Manifolds Method
 Split a mesh where at non-2 manifolds boundaries.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Mesh[] SplitNon2Manifolds()
Public Function SplitNon2Manifolds As Mesh()
Return Value
Type: Mesh[]
An array of mesh parts representing the split result, or null: when no mesh split, or if a cancel stopped the computation.
See Also
Reference
Mesh Class
SplitNon2Manifolds Overload
Rhino.Geometry Namespace