RhinoCommon API
FilePdf.Write Method (Stream)
 Write PDF to a stream
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract void Write(
	Stream stream
)
Public MustOverride Sub Write (
	stream As Stream
)
Parameters
stream
Type: System.IO.Stream
[Missing <param name="stream"/> documentation for "M:Rhino.FileIO.FilePdf.Write(System.IO.Stream)"]
See Also
Reference
FilePdf Class
Write Overload
Rhino.FileIO Namespace