RhinoCommon API
TextEntity.Create Method
 Create Text geometry or null if input is invalid
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static TextEntity Create(
	string text,
	Plane plane,
	DimensionStyle style,
	bool wrapped,
	double rectWidth,
	double rotationRadians
)
Public Shared Function Create (
	text As String,
	plane As Plane,
	style As DimensionStyle,
	wrapped As Boolean,
	rectWidth As Double,
	rotationRadians As Double
) As TextEntity
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.Geometry.TextEntity.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.TextEntity.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)"]
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.TextEntity.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)"]
wrapped
Type: System.Boolean
[Missing <param name="wrapped"/> documentation for "M:Rhino.Geometry.TextEntity.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)"]
rectWidth
Type: System.Double
[Missing <param name="rectWidth"/> documentation for "M:Rhino.Geometry.TextEntity.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)"]
rotationRadians
Type: System.Double
[Missing <param name="rotationRadians"/> documentation for "M:Rhino.Geometry.TextEntity.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)"]
Return Value
Type: TextEntity
[Missing <returns> documentation for "M:Rhino.Geometry.TextEntity.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)"]
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace