RhinoCommon API
FileAmf.Write Method
Write a amf file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	FileAmfWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As FileAmfWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileAmfWriteOptions
options used for generating the amf file
Return Value
Type: Boolean
true on success
See Also
Reference
FileAmf Class
Rhino.FileIO Namespace