RhinoCommon API
TexturedValue<T> Constructor
Initializes a new instance of the TexturedValue<T> class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TexturedValue(
	string name,
	T value,
	bool on,
	float amount
)
Public Sub New (
	name As String,
	value As T,
	on As Boolean,
	amount As Single
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Render.TexturedValue`1.#ctor(System.String,`0,System.Boolean,System.Single)"]
value
Type: T
[Missing <param name="value"/> documentation for "M:Rhino.Render.TexturedValue`1.#ctor(System.String,`0,System.Boolean,System.Single)"]
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Render.TexturedValue`1.#ctor(System.String,`0,System.Boolean,System.Single)"]
amount
Type: System.Single
[Missing <param name="amount"/> documentation for "M:Rhino.Render.TexturedValue`1.#ctor(System.String,`0,System.Boolean,System.Single)"]
See Also
Reference
TexturedValue<T> Class
Rhino.Render Namespace