RhinoCommon API
SnapShotsClient.AnimateDocument Method
 Called for each frame. Starting at 0.0.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool AnimateDocument(
	RhinoDoc doc,
	double dPos,
	BinaryArchiveReader archive_start,
	BinaryArchiveReader archive_stop
)
Public MustOverride Function AnimateDocument (
	doc As RhinoDoc,
	dPos As Double,
	archive_start As BinaryArchiveReader,
	archive_stop As BinaryArchiveReader
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
doc is the current document.
dPos
Type: System.Double
dPos is the current frame. Starting at 0.0.
archive_start
Type: Rhino.FileIO.BinaryArchiveReader
archive_start is a archive to the data of the starting position.
archive_stop
Type: Rhino.FileIO.BinaryArchiveReader
archive_stop is a archive to the data of the ending position.
Return Value
Type: Boolean
true if successful, otherwise false.
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace