RhinoCommon API
LayerTable.Delete Method (Guid, Boolean)
Deletes layer.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Delete(
	Guid layerId,
	bool quiet
)
Public Function Delete (
	layerId As Guid,
	quiet As Boolean
) As Boolean
Parameters
layerId
Type: System.Guid
 Id of the layer to be deleted.
quiet
Type: System.Boolean
 If true, no warning message box appears if a layer the layer cannot be deleted because it is the current layer or it contains active geometry.
Return Value
Type: Boolean
 true if successful. false if layerIndex is out of range or the layer cannot be deleted because it is the current layer or because it layer contains active geometry.
See Also
Reference
LayerTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace