RhinoCommon API
Mesh.CreateFromCylinder Method (Cylinder, Int32, Int32)
Constructs a capped mesh cylinder.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Mesh CreateFromCylinder(
	Cylinder cylinder,
	int vertical,
	int around
)
Public Shared Function CreateFromCylinder (
	cylinder As Cylinder,
	vertical As Integer,
	around As Integer
) As Mesh
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
[Missing <param name="cylinder"/> documentation for "M:Rhino.Geometry.Mesh.CreateFromCylinder(Rhino.Geometry.Cylinder,System.Int32,System.Int32)"]
vertical
Type: System.Int32
Number of faces in the top-to-bottom direction.
around
Type: System.Int32
Number of faces around the cylinder.
Return Value
Type: Mesh
Returns a mesh cylinder if successful, null otherwise.
Exceptions
Exception | Condition
ArgumentException | Thrown when cylinder is invalid.
See Also
Reference
Mesh Class
CreateFromCylinder Overload
Rhino.Geometry Namespace