RhinoCommon API
CustomObjectGrips.Dragging Method
 Determines if grips are currently being dragged.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool Dragging()
Public Shared Function Dragging As Boolean
Return Value
Type: Boolean
true if grips are dragged.
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace