RhinoCommon API
PersistentSettings.TryGetDefault Method (String, Byte)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Byte@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetDefault(
	string key,
	out byte value
)
Public Function TryGetDefault (
	key As String,
	<OutAttribute> ByRef value As Byte
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Byte@)"]
value
Type: System.Byte
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Byte@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Byte@)"]
See Also
Reference
PersistentSettings Class
TryGetDefault Overload
Rhino Namespace