RhinoCommon API
DisplayPipeline.DrawInstanceDefinitionShaded Method (InstanceDefinition, DisplayMaterial, Transform)
 Draws a shaded InstanceDefinition.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.15
Syntax
public void DrawInstanceDefinitionShaded(
	InstanceDefinition instanceDefinition,
	DisplayMaterial material,
	Transform xform
)
Public Sub DrawInstanceDefinitionShaded (
	instanceDefinition As InstanceDefinition,
	material As DisplayMaterial,
	xform As Transform
)
Parameters
instanceDefinition
Type: Rhino.DocObjects.InstanceDefinition
The instance definition.
material
Type: Rhino.Display.DisplayMaterial
Material to draw faces with.
xform
Type: Rhino.Geometry.Transform
The transformation.
See Also
Reference
DisplayPipeline Class
DrawInstanceDefinitionShaded Overload
Rhino.Display Namespace