RhinoCommon API
PolylineCurve Constructor (PolylineCurve)
 Initializes a new polyline curve by copying its content from another polyline curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PolylineCurve(
	PolylineCurve other
)
Public Sub New (
	other As PolylineCurve
)
Parameters
other
Type: Rhino.Geometry.PolylineCurve
Another polyline curve.
See Also
Reference
PolylineCurve Class
PolylineCurve Overload
Rhino.Geometry Namespace