RhinoCommon API
ObjectTable.AddRhinoObject Method (CustomCurveObject, HistoryRecord)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomCurveObject,Rhino.DocObjects.HistoryRecord)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public void AddRhinoObject(
	CustomCurveObject curveObject,
	HistoryRecord history
)
Public Sub AddRhinoObject (
	curveObject As CustomCurveObject,
	history As HistoryRecord
)
Parameters
curveObject
Type: Rhino.DocObjects.Custom.CustomCurveObject
[Missing <param name="curveObject"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomCurveObject,Rhino.DocObjects.HistoryRecord)"]
history
Type: Rhino.DocObjects.HistoryRecord
[Missing <param name="history"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomCurveObject,Rhino.DocObjects.HistoryRecord)"]
See Also
Reference
ObjectTable Class
AddRhinoObject Overload
Rhino.DocObjects.Tables Namespace