RhinoCommon API
FileExportPlugIn Constructor
Initializes a new instance of the FileExportPlugIn class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected FileExportPlugIn()
Protected Sub New
See Also
Reference
FileExportPlugIn Class
Rhino.PlugIns Namespace