RhinoCommon API
SupportOptions.SetShowCustom Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetShowCustom(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_SetShowCustom' instead")]
public static void SetShowCustom(
	bool b
)
<ObsoleteAttribute("Use 'Libraries_SetShowCustom' instead")>
Public Shared Sub SetShowCustom (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetShowCustom(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace