RhinoCommon API
FileDgn.Read Method
Read a dgn file into a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	FileDgnReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As FileDgnReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.FileDgnReadOptions
options used for importing the dgn file
Return Value
Type: Boolean
true on success
See Also
Reference
FileDgn Class
Rhino.FileIO Namespace