RhinoCommon API
ViewCaptureSettings.MatchViewportAspectRatio Method
 Adjust crop rectangle to match the aspect ratio of the original viewport that these settings reference
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public bool MatchViewportAspectRatio()
Public Function MatchViewportAspectRatio As Boolean
Return Value
Type: Boolean
true on success
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace