RhinoCommon API
Brep.CreateOffsetBrep Method (Brep, Double, Boolean, Boolean, Double, Brep[], Brep[])
 Offsets a Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep[] CreateOffsetBrep(
	Brep brep,
	double distance,
	bool solid,
	bool extend,
	double tolerance,
	out Brep[] outBlends,
	out Brep[] outWalls
)
Public Shared Function CreateOffsetBrep (
	brep As Brep,
	distance As Double,
	solid As Boolean,
	extend As Boolean,
	tolerance As Double,
	<OutAttribute> ByRef outBlends As Brep(),
	<OutAttribute> ByRef outWalls As Brep()
) As Brep()
Parameters
brep
Type: Rhino.Geometry.Brep
The Brep to offset.
distance
Type: System.Double
 The distance to offset. This is a signed distance value with respect to face normals and flipped faces.
solid
Type: System.Boolean
 If true, then the function makes a closed solid from the input and offset surfaces by lofting a ruled surface between all of the matching edges.
extend
Type: System.Boolean
 If true, then the function maintains the sharp corners when the original surfaces have sharps corner. If False, then the function creates fillets at sharp corners in the original surfaces.
tolerance
Type: System.Double
The offset tolerance.
outBlends
Type: Rhino.Geometry.Brep[]
The results of the calculation.
outWalls
Type: Rhino.Geometry.Brep[]
The results of the calculation.
Return Value
Type: Brep[]
 Array of Breps if successful. If the function succeeds in offsetting, a single Brep will be returned. Otherwise, the array will contain the offset surfaces, outBlends will contain the set of blends used to fill in gaps (if extend is false), and outWalls will contain the set of wall surfaces that was supposed to join the offset to the original (if solid is true).
See Also
Reference
Brep Class
CreateOffsetBrep Overload
Rhino.Geometry Namespace