RhinoCommon API
CollapsibleSectionImpl.GetSibling Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.GetSibling(Rhino.UI.Controls.ICollapsibleSection,System.Guid)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ICollapsibleSection GetSibling(
	ICollapsibleSection section,
	Guid siblingSectionId
)
Public Shared Function GetSibling (
	section As ICollapsibleSection,
	siblingSectionId As Guid
) As ICollapsibleSection
Parameters
section
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="section"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.GetSibling(Rhino.UI.Controls.ICollapsibleSection,System.Guid)"]
siblingSectionId
Type: System.Guid
[Missing <param name="siblingSectionId"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.GetSibling(Rhino.UI.Controls.ICollapsibleSection,System.Guid)"]
Return Value
Type: ICollapsibleSection
[Missing <returns> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.GetSibling(Rhino.UI.Controls.ICollapsibleSection,System.Guid)"]
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace