RhinoCommon API
BinaryArchiveReader.ReadObjRef Method
 Reads a ObjRef from the archive
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public ObjRef ReadObjRef()
Public Function ReadObjRef As ObjRef
Return Value
Type: ObjRef
the element that was read
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace