RhinoCommon API
RenderSettings.Duplicate Method
 Makes a free-floating copy of the object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RenderSettings Duplicate()
Public Function Duplicate As RenderSettings
Return Value
Type: RenderSettings
[Missing <returns> documentation for "M:Rhino.Render.RenderSettings.Duplicate"]
See Also
Reference
RenderSettings Class
Rhino.Render Namespace