RhinoCommon API
MeshFaceNormalList.Clear Method
 Clears the Face Normal list on the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
IList.Clear()
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace