RhinoCommon API
SimulatedTexture.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.SimulatedTexture.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace