RhinoCommon API
SubDVertex.ComponentIndex Method
 Gets the component index of this vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.30
Syntax
public ComponentIndex ComponentIndex()
Public Function ComponentIndex As ComponentIndex
Return Value
Type: ComponentIndex
The component index.
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace