RhinoCommon API
LengthMassProperties.WeightedSum Method
 Sum a list of mass properties together to get an aggregate mass, weighting each by a density factor.Ignores existing mass properties in this object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static LengthMassProperties WeightedSum(
	IEnumerable<LengthMassProperties> summands,
	IEnumerable<double> weights
)
Public Shared Function WeightedSum (
	summands As IEnumerable(Of LengthMassProperties),
	weights As IEnumerable(Of Double)
) As LengthMassProperties
Parameters
summands
Type: System.Collections.Generic.IEnumerable<LengthMassProperties>
An array of mass properties to add.
weights
Type: System.Collections.Generic.IEnumerable<Double>
An array of non-negative densities, of the same length as summands.
Return Value
Type: LengthMassProperties
An LengthMassProperties containing the result if successful, null if a failure occurs.
Exceptions
Exception | Condition
ArgumentNullException | When summands or weights is null.
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace