RhinoCommon API
RhinoObject.GetMaterial Method (Boolean)
 Gets material that this object uses based on it's attributes and the document that the object is associated with. In the rare case that a document is not associated with this object, null will be returned.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Material GetMaterial(
	bool frontMaterial
)
Public Function GetMaterial (
	frontMaterial As Boolean
) As Material
Parameters
frontMaterial
Type: System.Boolean
 If true, gets the material used to render the object's front side
Return Value
Type: Material
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.GetMaterial(System.Boolean)"]
See Also
Reference
RhinoObject Class
GetMaterial Overload
Rhino.DocObjects Namespace