RhinoCommon API
Plane.CreateFromPoints Method
 Construct a plane from three non-collinear points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Plane CreateFromPoints(
	Point3d origin,
	Point3d xPoint,
	Point3d yPoint
)
Public Shared Function CreateFromPoints (
	origin As Point3d,
	xPoint As Point3d,
	yPoint As Point3d
) As Plane
Parameters
origin
Type: Rhino.Geometry.Point3d
Point on the plane.
xPoint
Type: Rhino.Geometry.Point3d
Second point in the plane. XAxis will be parallel to xPoint-origin.
yPoint
Type: Rhino.Geometry.Point3d
 Third point on the plane that is not collinear with the first two points, where YAxis*(yPoint-origin) will be > 0.
Return Value
Type: Plane
A valid plane if successful, or Plane.Unset on failure.
See Also
Reference
Plane Structure
Rhino.Geometry Namespace