RhinoCommon API
SubDVertexList.SetVertexTags Method (IEnumerable<SubDVertex>, SubDVertexTag)
 Set vertex tags for a list of vertices. Useful for adding creases to SubDs
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.30
Syntax
public void SetVertexTags(
	IEnumerable<SubDVertex> vertices,
	SubDVertexTag tag
)
Public Sub SetVertexTags (
	vertices As IEnumerable(Of SubDVertex),
	tag As SubDVertexTag
)
Parameters
vertices
Type: System.Collections.Generic.IEnumerable<SubDVertex>
list of vertices to set a specific tag on
tag
Type: Rhino.Geometry.SubDVertexTag
The type of vertex tag
See Also
Reference
SubDVertexList Class
SetVertexTags Overload
Rhino.Geometry.Collections Namespace