RhinoCommon API
ArchivableDictionary.Set Method (String, Int32)
 Sets a Int32.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Set(
	string key,
	int val
)
Public Function Set (
	key As String,
	val As Integer
) As Boolean
Parameters
key
Type: System.String
The text key.
val
Type: System.Int32
A Int32.
Because Int32 has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
true if set operation succeeded, otherwise false.
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace