RhinoCommon API
MarkupTable.Delete Method (Markup)
 Deletes a markup.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public override bool Delete(
	Markup item
)
Public Overrides Function Delete (
	item As Markup
) As Boolean
Parameters
item
Type: Rhino.DocObjects.Markup
The markup to delete.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
MarkupTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace