RhinoCommon API
Curve.DuplicateSegments Method
 Duplicates curve segments. Explodes polylines, polycurves and G1 discontinuous NURBS curves. Single segment curves, such as lines, arcs, unkinked NURBS curves, are duplicated.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Curve[] DuplicateSegments()
Public Function DuplicateSegments As Curve()
Return Value
Type: Curve[]
 An array of all the segments that make up this curve.
Remarks
 Unlike , this method produces results based on the curve's data structure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace
Curve.GetSubCurves()