RhinoCommon API
FieldDictionary.Add Method (String, Int32)
 Add a new IntField to the dictionary. This will be a data only field and not show up in the content browsers.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public IntField Add(
	string key,
	int value
)
Public Function Add (
	key As String,
	value As Integer
) As IntField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: System.Int32
Initial value for this field.
Return Value
Type: IntField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Int32)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace