RhinoCommon API
InstanceDefinitionTable.ModifyInsertionPlane Method
 Modifies the insertion plane of an instance definition. The definition's geometry is re-origined so that the supplied plane becomes the new insertion plane - its origin is the new insertion point and its axes become the definition's axes. Existing instance references are not modified, so they will appear to move. Only embedded instance definitions are supported; the function returns false for linked definitions.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ModifyInsertionPlane(
	int idefIndex,
	Plane plane
)
Public Function ModifyInsertionPlane (
	idefIndex As Integer,
	plane As Plane
) As Boolean
Parameters
idefIndex
Type: System.Int32
The index of the instance definition to be modified.
plane
Type: Rhino.Geometry.Plane
The new insertion plane, in the definition's current coordinates.
Return Value
Type: Boolean
true if operation succeeded.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace