RhinoCommon API
FileReadOptions Constructor
Initializes a new instance of the FileReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public FileReadOptions()
Public Sub New
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace