RhinoCommon API
EndAnalysisSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static EndAnalysisSettingsState GetCurrentState()
Public Shared Function GetCurrentState As EndAnalysisSettingsState
Return Value
Type: EndAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.EndAnalysisSettings.GetCurrentState"]
See Also
Reference
EndAnalysisSettings Class
Rhino.ApplicationSettings Namespace