RhinoCommon API
NamedParametersEventArgs.TryGetVector Method
 Try to get a Vector3d value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool TryGetVector(
	string name,
	out Vector3d value
)
Public Function TryGetVector (
	name As String,
	<OutAttribute> ByRef value As Vector3d
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetVector(System.String,Rhino.Geometry.Vector3d@)"]
value
Type: Rhino.Geometry.Vector3d
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetVector(System.String,Rhino.Geometry.Vector3d@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetVector(System.String,Rhino.Geometry.Vector3d@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace