RhinoCommon API
BezierSurface.ControlVertexCount Method
 Number of control vertices in this surface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public int ControlVertexCount(
	int direction
)
Public Function ControlVertexCount (
	direction As Integer
) As Integer
Parameters
direction
Type: System.Int32
 0 for first parameter's domain, 1 for second parameter's domain.
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Geometry.BezierSurface.ControlVertexCount(System.Int32)"]
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace