RhinoCommon API
Color4f Constructor (Int32)
Initializes a new instance of the Color4f class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Color4f(
	int argb
)
Public Sub New (
	argb As Integer
)
Parameters
argb
Type: System.Int32
[Missing <param name="argb"/> documentation for "M:Rhino.Display.Color4f.#ctor(System.Int32)"]
See Also
Reference
Color4f Structure
Color4f Overload
Rhino.Display Namespace