RhinoCommon API
ChangeQueue.OriginalInstanceIdsFromEnvironmentId Method
 Return the collection of original document instance ids assocaited with the Environment id.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.23
Syntax
public Guid[] OriginalInstanceIdsFromEnvironmentId(
	uint crc
)
Public Function OriginalInstanceIdsFromEnvironmentId (
	crc As UInteger
) As Guid()
Parameters
crc
Type: System.UInt32
The Environment id
Return Value
Type: Guid[]
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.OriginalInstanceIdsFromEnvironmentId(System.UInt32)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace