RhinoCommon API
MarkupTable.FindName Method
Finds the markup with a given name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Markup FindName(
	string name
)
Public Function FindName (
	name As String
) As Markup
Parameters
name
Type: System.String
The name of the markup to find.
Return Value
Type: Markup
 The markup if found; otherwise null.
See Also
Reference
MarkupTable Class
Rhino.DocObjects.Tables Namespace