RhinoCommon API
PointCloud.GetRandomSubsample Method (UInt32)
 Returns a random subsample of a point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public PointCloud GetRandomSubsample(
	uint numberOfPoints
)
Public Function GetRandomSubsample (
	numberOfPoints As UInteger
) As PointCloud
Parameters
numberOfPoints
Type: System.UInt32
The number of points the new point cloud should contain.
Return Value
Type: PointCloud
A subsample of this point cloud if success, null otherwise.
See Also
Reference
PointCloud Class
GetRandomSubsample Overload
Rhino.Geometry Namespace