RhinoCommon API
FontQuartet Constructor
Initializes a new instance of the FontQuartet class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.26
Syntax
public FontQuartet(
	string name,
	bool supportsRegular,
	bool supportsBold,
	bool supportsItalic,
	bool supportsBoldItalic
)
Public Sub New (
	name As String,
	supportsRegular As Boolean,
	supportsBold As Boolean,
	supportsItalic As Boolean,
	supportsBoldItalic As Boolean
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.DocObjects.FontQuartet.#ctor(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
supportsRegular
Type: System.Boolean
[Missing <param name="supportsRegular"/> documentation for "M:Rhino.DocObjects.FontQuartet.#ctor(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
supportsBold
Type: System.Boolean
[Missing <param name="supportsBold"/> documentation for "M:Rhino.DocObjects.FontQuartet.#ctor(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
supportsItalic
Type: System.Boolean
[Missing <param name="supportsItalic"/> documentation for "M:Rhino.DocObjects.FontQuartet.#ctor(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
supportsBoldItalic
Type: System.Boolean
[Missing <param name="supportsBoldItalic"/> documentation for "M:Rhino.DocObjects.FontQuartet.#ctor(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
See Also
Reference
FontQuartet Class
Rhino.DocObjects Namespace