RhinoCommon API
File3dmDisplacement.DeleteAllSubItems Method
 Deletes all the sub-items from the displacement.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void DeleteAllSubItems()
Public Sub DeleteAllSubItems
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace