RhinoCommon API
BoundingBox.Contains Method (Point3d)
 Tests a point for bounding box inclusion. This is the same as calling Contains(point, false)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Contains(
	Point3d point
)
Public Function Contains (
	point As Point3d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
Point to test.
Return Value
Type: Boolean
true if the point is on the inside of or coincident with this bounding box; otherwise false.
See Also
Reference
BoundingBox Structure
Contains Overload
Rhino.Geometry Namespace