RhinoCommon API
GetBaseClass.IsValidOptionValueName Method
 Test a string to see if it can be used as an option value name in the AddOption, AddOptionToggle, AddOptionList functions.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.24
Syntax
public static bool IsValidOptionValueName(
	string optionValueName
)
Public Shared Function IsValidOptionValueName (
	optionValueName As String
) As Boolean
Parameters
optionValueName
Type: System.String
[Missing <param name="optionValueName"/> documentation for "M:Rhino.Input.Custom.GetBaseClass.IsValidOptionValueName(System.String)"]
Return Value
Type: Boolean
True if string can be used as an option value.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace