RhinoCommon API
File3dmWriteOptions.EnableRenderMeshes Method
 Activates saving of render meshes for specific types of objects. If you do not specify the state for an object type, its default is used. Specifically, currently SubD mesh saving is disabled by default, while Brep and Extrusion is on.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void EnableRenderMeshes(
	ObjectType objectType,
	bool enable
)
Public Sub EnableRenderMeshes (
	objectType As ObjectType,
	enable As Boolean
)
Parameters
objectType
Type: Rhino.DocObjects.ObjectType
The object type. Mostly brep, extrusion and SubD (or their flag combinations) make sense here.
DO NOT specify a 'filter' or sub-object type.
enable
Type: System.Boolean
If false, disables saving for this object type.
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace