RhinoCommon API
ObjectTable.AddClippingPlaneSurface Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddClippingPlaneSurface(Rhino.Geometry.ClippingPlaneSurface,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public Guid AddClippingPlaneSurface(
	ClippingPlaneSurface clippingPlane,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddClippingPlaneSurface (
	clippingPlane As ClippingPlaneSurface,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
clippingPlane
Type: Rhino.Geometry.ClippingPlaneSurface
[Missing <param name="clippingPlane"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddClippingPlaneSurface(Rhino.Geometry.ClippingPlaneSurface,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddClippingPlaneSurface(Rhino.Geometry.ClippingPlaneSurface,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
history
Type: Rhino.DocObjects.HistoryRecord
[Missing <param name="history"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddClippingPlaneSurface(Rhino.Geometry.ClippingPlaneSurface,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
reference
Type: System.Boolean
[Missing <param name="reference"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddClippingPlaneSurface(Rhino.Geometry.ClippingPlaneSurface,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddClippingPlaneSurface(Rhino.Geometry.ClippingPlaneSurface,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace