RhinoCommon API
DisplayPipelineAttributes.GetDiagonalHatchEffect Method
 Get the current diagonal hatch strength and width in pixels.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void GetDiagonalHatchEffect(
	out float hatchStrength,
	out float hatchWidth
)
Public Sub GetDiagonalHatchEffect (
	<OutAttribute> ByRef hatchStrength As Single,
	<OutAttribute> ByRef hatchWidth As Single
)
Parameters
hatchStrength
Type: System.Single
The strength of the hatch effect.
hatchWidth
Type: System.Single
The width of the diagonal hatch in pixels.
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace