RhinoCommon API
Surface.VariableOffset Method (Double, Double, Double, Double, Double)
 Copies a surface so that all locations at the corners of the copied surface are specified distances from the original surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.13
Syntax
public Surface VariableOffset(
	double uMinvMin,
	double uMinvMax,
	double uMaxvMin,
	double uMaxvMax,
	double tolerance
)
Public Function VariableOffset (
	uMinvMin As Double,
	uMinvMax As Double,
	uMaxvMin As Double,
	uMaxvMax As Double,
	tolerance As Double
) As Surface
Parameters
uMinvMin
Type: System.Double
Offset distance at Domain(0).Min, Domain(1).Min.
uMinvMax
Type: System.Double
Offset distance at Domain(0).Min, Domain(1).Max.
uMaxvMin
Type: System.Double
Offset distance at Domain(0).Max, Domain(1).Min.
uMaxvMax
Type: System.Double
Offset distance at Domain(0).Max, Domain(1).Max.
tolerance
Type: System.Double
The offset tolerance.
Return Value
Type: Surface
The offset surface if successful, null otherwise.
See Also
Reference
Surface Class
VariableOffset Overload
Rhino.Geometry Namespace