RhinoCommon API
ViewCaptureWriter.PopClipPath Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.PopClipPath"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected void PopClipPath()
Protected Sub PopClipPath
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace