RhinoCommon API
SubDFace.ComponentIndex Method
 Gets the component index of this face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public ComponentIndex ComponentIndex()
Public Function ComponentIndex As ComponentIndex
Return Value
Type: ComponentIndex
The component index.
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace