RhinoCommon API
PolylineCurve.Parameter Method
 Gets a parameter at a specified index in the polyline curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Parameter(
	int index
)
Public Function Parameter (
	index As Integer
) As Double
Parameters
index
Type: System.Int32
An index.
Return Value
Type: Double
A parameter.
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace