RhinoCommon API
Rectangle3d.MakeIncreasing Method
 Ensures the X and Y dimensions are increasing or singleton intervals.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void MakeIncreasing()
Public Sub MakeIncreasing
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace