RhinoCommon API
Plane.ToString Method
 Constructs the string representation of this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
Text.
See Also
Reference
Plane Structure
ToString Overload
Rhino.Geometry Namespace