RhinoCommon API
File3dmRenderEnvironments.Find Method
 Finds an environment by its id, if possible. Returns null on failure.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmRenderEnvironment Find(
	Guid g
)
Public Function Find (
	g As Guid
) As File3dmRenderEnvironment
Parameters
g
Type: System.Guid
[Missing <param name="g"/> documentation for "M:Rhino.FileIO.File3dmRenderEnvironments.Find(System.Guid)"]
Return Value
Type: File3dmRenderEnvironment
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderEnvironments.Find(System.Guid)"]
See Also
Reference
File3dmRenderEnvironments Class
Rhino.FileIO Namespace