RhinoCommon API
UserInterfaceGrid.GetChildColumnSpan Method
[Missing <summary> documentation for "M:Rhino.UI.UserInterfaceGrid.GetChildColumnSpan(System.Int32)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int GetChildColumnSpan(
	int index
)
Public Function GetChildColumnSpan (
	index As Integer
) As Integer
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.UserInterfaceGrid.GetChildColumnSpan(System.Int32)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.UI.UserInterfaceGrid.GetChildColumnSpan(System.Int32)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace