RhinoCommon API
PostEffectPipeline.GetEndTimeInMilliseconds Method
 Get the end time of the rendering expressed in milliseconds since some unspecified epoch. Do not make assumptions about what the epoch is; it might be different on different platforms.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public ulong GetEndTimeInMilliseconds()
Public Function GetEndTimeInMilliseconds As ULong
Return Value
Type: UInt64
milliseconds
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace