RhinoCommon API
Layer.CopyAttributesFrom Method
 Copy typical attributes from another layer
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void CopyAttributesFrom(
	Layer otherLayer
)
Public Sub CopyAttributesFrom (
	otherLayer As Layer
)
Parameters
otherLayer
Type: Rhino.DocObjects.Layer
[Missing <param name="otherLayer"/> documentation for "M:Rhino.DocObjects.Layer.CopyAttributesFrom(Rhino.DocObjects.Layer)"]
See Also
Reference
Layer Class
Rhino.DocObjects Namespace