RhinoCommon API
Mesh.CreateFromSubD Method (SubD, SubDDisplayParameters.Density)
 Create a mesh from a SubD limit surface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Mesh CreateFromSubD(
	SubD subd,
	SubDDisplayParameters.Density displayDensity
)
Public Shared Function CreateFromSubD (
	subd As SubD,
	displayDensity As SubDDisplayParameters.Density
) As Mesh
Parameters
subd
Type: Rhino.Geometry.SubD
SubD to mesh
displayDensity
Type: Rhino.Geometry.SubDDisplayParameters.Density
 Adaptive display density value to use. If in doubt, pass DefaultDensity: this is what the cache uses.
Return Value
Type: Mesh
New mesh representing the SubD
See Also
Reference
Mesh Class
CreateFromSubD Overload
Rhino.Geometry Namespace
SubD.UpdateSurfaceMeshCache(Boolean)