RhinoCommon API
RiskyAction.Dispose Method
 IDisposable implementation
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RiskyAction Class
Rhino.Runtime Namespace