RhinoCommon API
File3dmShutLining.CurveEnabled Method
 Return whether shut-line is created for the given curve.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool CurveEnabled(
	Guid curve_id
)
Public Function CurveEnabled (
	curve_id As Guid
) As Boolean
Parameters
curve_id
Type: System.Guid
[Missing <param name="curve_id"/> documentation for "M:Rhino.FileIO.File3dmShutLining.CurveEnabled(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmShutLining.CurveEnabled(System.Guid)"]
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace