RhinoCommon API
SubDFace.EdgeDirectionMatchesFaceOrientation Method
 Check if a given edge in this face has the same direction as the face orientation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool EdgeDirectionMatchesFaceOrientation(
	int index
)
Public Function EdgeDirectionMatchesFaceOrientation (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Geometry.SubDFace.EdgeDirectionMatchesFaceOrientation(System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDFace.EdgeDirectionMatchesFaceOrientation(System.Int32)"]
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace