RhinoCommon API
VisualAnalysisMode Constructor
Initializes a new instance of the VisualAnalysisMode class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected VisualAnalysisMode()
Protected Sub New
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace