RhinoCommon API
Curve.CreateBooleanDifference Method (Curve, IEnumerable<Curve>)
Note: This API is now obsolete.
 Calculates the boolean difference between a closed planar curve, and a list of closed planar curves. Note, curves must be co-planar.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use version that takes tolerance as input")]
public static Curve[] CreateBooleanDifference(
	Curve curveA,
	IEnumerable<Curve> subtractors
)
<ObsoleteAttribute("Use version that takes tolerance as input")>
Public Shared Function CreateBooleanDifference (
	curveA As Curve,
	subtractors As IEnumerable(Of Curve)
) As Curve()
Parameters
curveA
Type: Rhino.Geometry.Curve
The first closed, planar curve.
subtractors
Type: System.Collections.Generic.IEnumerable<Curve>
curves to subtract from the first closed curve.
Return Value
Type: Curve[]
Result curves on success, empty array if no difference could be calculated.
See Also
Reference
Curve Class
CreateBooleanDifference Overload
Rhino.Geometry Namespace