RhinoCommon API
RTree.Search Method (BoundingBox, EventHandler<RTreeEventArgs>, Object)
 Searches for items in a bounding box.
The bounding box can be singular and contain exactly one single point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Search(
	BoundingBox box,
	EventHandler<RTreeEventArgs> callback,
	Object tag
)
Public Function Search (
	box As BoundingBox,
	callback As EventHandler(Of RTreeEventArgs),
	tag As Object
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
A bounding box.
callback
Type: System.EventHandler<RTreeEventArgs>
An event handler to be raised when items are found.
tag
Type: System.Object
State to be passed inside the RTreeEventArgs Tag property.
Return Value
Type: Boolean
 true if entire tree was searched. It is possible no results were found.
Remarks
 Do not modify the tree while a Search() is in progress. Doing so can have unintended consequences, including corruption and crashes.If you need to modify the tree, collect the results during the search and modify the tree once the search is completed.
See Also
Reference
RTree Class
Search Overload
Rhino.Geometry Namespace