RhinoCommon API
ObjectTable.ObjectCount Method
 Returns the number objects that pass a filter.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ObjectCount(
	ObjectEnumeratorSettings filter
)
Public Function ObjectCount (
	filter As ObjectEnumeratorSettings
) As Integer
Parameters
filter
Type: Rhino.DocObjects.ObjectEnumeratorSettings
The ObjectEnumeratorSettings filter.
Return Value
Type: Int32
The number of objects that pass the filter.
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace