RhinoCommon API
NurbsCurve.CreateHSpline Method (IEnumerable<Point3d>, Vector3d, Vector3d)
 Construct an H-spline from a sequence of interpolation points and optional start and end derivative information
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static NurbsCurve CreateHSpline(
	IEnumerable<Point3d> points,
	Vector3d startTangent,
	Vector3d endTangent
)
Public Shared Function CreateHSpline (
	points As IEnumerable(Of Point3d),
	startTangent As Vector3d,
	endTangent As Vector3d
) As NurbsCurve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to interpolate
startTangent
Type: Rhino.Geometry.Vector3d
Unit tangent vector or Unset
endTangent
Type: Rhino.Geometry.Vector3d
Unit tangent vector or Unset
Return Value
Type: NurbsCurve
NURBS curve approximation of an arc on success
See Also
Reference
NurbsCurve Class
CreateHSpline Overload
Rhino.Geometry Namespace