RhinoCommon API
ObjectTable.AddRadialDimension Method (RadialDimension, ObjectAttributes, HistoryRecord, Boolean)
 Adds a radial dimension object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddRadialDimension(
	RadialDimension dimension,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddRadialDimension (
	dimension As RadialDimension,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
dimension
Type: Rhino.Geometry.RadialDimension
Dimension object to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to dimension.
history
Type: Rhino.DocObjects.HistoryRecord
Object history to save.
reference
Type: System.Boolean
If reference, then object will not be saved into the 3dm file.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddRadialDimension Overload
Rhino.DocObjects.Tables Namespace