RhinoCommon API
RhinoObject.InVisualAnalysisMode Method
 Reports if any visual analysis mode is currently active for an object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool InVisualAnalysisMode()
Public Function InVisualAnalysisMode As Boolean
Return Value
Type: Boolean
true if an analysis mode is active; otherwise false.
See Also
Reference
RhinoObject Class
InVisualAnalysisMode Overload
Rhino.DocObjects Namespace