RhinoCommon API
ViewCaptureWriter.DrawBitmap Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawBitmap(System.Drawing.Bitmap,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract void DrawBitmap(
	Bitmap bitmap,
	double m11,
	double m12,
	double m21,
	double m22,
	double dx,
	double dy
)
Protected MustOverride Sub DrawBitmap (
	bitmap As Bitmap,
	m11 As Double,
	m12 As Double,
	m21 As Double,
	m22 As Double,
	dx As Double,
	dy As Double
)
Parameters
bitmap
Type: System.Drawing.Bitmap
[Missing <param name="bitmap"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawBitmap(System.Drawing.Bitmap,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)"]
m11
Type: System.Double
[Missing <param name="m11"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawBitmap(System.Drawing.Bitmap,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)"]
m12
Type: System.Double
[Missing <param name="m12"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawBitmap(System.Drawing.Bitmap,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)"]
m21
Type: System.Double
[Missing <param name="m21"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawBitmap(System.Drawing.Bitmap,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)"]
m22
Type: System.Double
[Missing <param name="m22"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawBitmap(System.Drawing.Bitmap,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)"]
dx
Type: System.Double
[Missing <param name="dx"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawBitmap(System.Drawing.Bitmap,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)"]
dy
Type: System.Double
[Missing <param name="dy"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawBitmap(System.Drawing.Bitmap,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)"]
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace