RhinoCommon API
IStackedDialogPageService.GetNativePageWindow Method (Object, Boolean, Boolean, Object)
 Get the unmanaged pointer associated with the pages content control
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
IntPtr GetNativePageWindow(
	Object nativeWindowObject,
	bool isRhinoPanel,
	bool applyPanelStyles,
	out Object host
)
Function GetNativePageWindow (
	nativeWindowObject As Object,
	isRhinoPanel As Boolean,
	applyPanelStyles As Boolean,
	<OutAttribute> ByRef host As Object
) As IntPtr
Parameters
nativeWindowObject
Type: System.Object
[Missing <param name="nativeWindowObject"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Boolean,System.Boolean,System.Object@)"]
isRhinoPanel
Type: System.Boolean
[Missing <param name="isRhinoPanel"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Boolean,System.Boolean,System.Object@)"]
applyPanelStyles
Type: System.Boolean
[Missing <param name="applyPanelStyles"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Boolean,System.Boolean,System.Object@)"]
host
Type: System.Object
[Missing <param name="host"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Boolean,System.Boolean,System.Object@)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Boolean,System.Boolean,System.Object@)"]
See Also
Reference
IStackedDialogPageService Interface
GetNativePageWindow Overload
Rhino.UI Namespace