RhinoCommon API
PointCloud.Add Method (Point3d, Vector3d, Color, Double)
 Append a new point to the end of the list.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public void Add(
	Point3d point,
	Vector3d normal,
	Color color,
	double value
)
Public Sub Add (
	point As Point3d,
	normal As Vector3d,
	color As Color,
	value As Double
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to append.
normal
Type: Rhino.Geometry.Vector3d
Normal vector of new point.
color
Type: System.Drawing.Color
Color of new point.
value
Type: System.Double
 Extra value of new point. An extra value can be used to store a user-defined value, such as intensity.
See Also
Reference
PointCloud Class
Add Overload
Rhino.Geometry Namespace