RhinoCommon API
InstanceDefinitionTable.GetUnusedInstanceDefinitionName Method
 Gets unused instance definition name used as default when creating new instance definitions.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string GetUnusedInstanceDefinitionName()
Public Function GetUnusedInstanceDefinitionName As String
Return Value
Type: String
An unused instance definition name string.
See Also
Reference
InstanceDefinitionTable Class
GetUnusedInstanceDefinitionName Overload
Rhino.DocObjects.Tables Namespace