RhinoCommon API
PostEffect.SetParam Method
 Set a parameter.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public abstract bool SetParam(
	string param,
	Object v
)
Public MustOverride Function SetParam (
	param As String,
	v As Object
) As Boolean
Parameters
param
Type: System.String
is the name of the parameter to set.
v
Type: System.Object
specifies the type and value to set.
Return Value
Type: Boolean
Return true if successful or false if the parameter could not be set.
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace