RhinoCommon API
Mesh.CreateFromSubDControlNet Method
Create a mesh from a SubD control net
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Mesh CreateFromSubDControlNet(
	SubD subd
)
Public Shared Function CreateFromSubDControlNet (
	subd As SubD
) As Mesh
Parameters
subd
Type: Rhino.Geometry.SubD
[Missing <param name="subd"/> documentation for "M:Rhino.Geometry.Mesh.CreateFromSubDControlNet(Rhino.Geometry.SubD)"]
Return Value
Type: Mesh
mesh representing control net on success, null on failure
See Also
Reference
Mesh Class
Rhino.Geometry Namespace