RhinoCommon API
LineCurve Constructor
 Initializes a new instance of the LineCurve class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public LineCurve()
Public Sub New
See Also
Reference
LineCurve Class
LineCurve Overload
Rhino.Geometry Namespace