RhinoCommon API
DracoCompression.Compress Method (PointCloud, DracoCompressionOptions)
 Compress a point cloud
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static DracoCompression Compress(
	PointCloud pointCloud,
	DracoCompressionOptions options
)
Public Shared Function Compress (
	pointCloud As PointCloud,
	options As DracoCompressionOptions
) As DracoCompression
Parameters
pointCloud
Type: Rhino.Geometry.PointCloud
point cloud to compress
options
Type: Rhino.FileIO.DracoCompressionOptions
options used to determine how the compression will occur
Return Value
Type: DracoCompression
instance of class representing the compressed data
See Also
Reference
DracoCompression Class
Compress Overload
Rhino.FileIO Namespace