RhinoCommon API
NamedPositionTable.Append Method (String, IEnumerable<Guid>)
Append objects to a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Append(
	string name,
	IEnumerable<Guid> objectIds
)
Public Function Append (
	name As String,
	objectIds As IEnumerable(Of Guid)
) As Boolean
Parameters
name
Type: System.String
 Name of the Named Position which you want to append to.
objectIds
Type: System.Collections.Generic.IEnumerable<Guid>
 New object Guids to be included in this Named Position.
Return Value
Type: Boolean
 True or False depending on whether the Append was successful.
See Also
Reference
NamedPositionTable Class
Append Overload
Rhino.DocObjects.Tables Namespace