RhinoCommon API
RenderContent.SetName Method
 Set instance name for this content
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SetName(
	string name,
	bool renameEvents,
	bool ensureNameUnique
)
Public Sub SetName (
	name As String,
	renameEvents As Boolean,
	ensureNameUnique As Boolean
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Render.RenderContent.SetName(System.String,System.Boolean,System.Boolean)"]
renameEvents
Type: System.Boolean
[Missing <param name="renameEvents"/> documentation for "M:Rhino.Render.RenderContent.SetName(System.String,System.Boolean,System.Boolean)"]
ensureNameUnique
Type: System.Boolean
[Missing <param name="ensureNameUnique"/> documentation for "M:Rhino.Render.RenderContent.SetName(System.String,System.Boolean,System.Boolean)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace