RhinoCommon API
Transform2d.GetAffineElements Method
 Gets the six coefficients used by the traditional 2d drawing APIs. See the remarks on ToAffineElements().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void GetAffineElements(
	out double a,
	out double b,
	out double c,
	out double d,
	out double tx,
	out double ty
)
Public Sub GetAffineElements (
	<OutAttribute> ByRef a As Double,
	<OutAttribute> ByRef b As Double,
	<OutAttribute> ByRef c As Double,
	<OutAttribute> ByRef d As Double,
	<OutAttribute> ByRef tx As Double,
	<OutAttribute> ByRef ty As Double
)
Parameters
a
Type: System.Double
M00.
b
Type: System.Double
M10.
c
Type: System.Double
M01.
d
Type: System.Double
M11.
tx
Type: System.Double
M02, the X translation.
ty
Type: System.Double
M12, the Y translation.
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace