RhinoCommon API
ArchivableDictionary.GetString Method (String)
 Get value as string, will only succeed if value was created using Set(string key, string value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string GetString(
	string key
)
Public Function GetString (
	key As String
) As String
Parameters
key
Type: System.String
The key which points to the string
Return Value
Type: String
The string
See Also
Reference
ArchivableDictionary Class
GetString Overload
Rhino.Collections Namespace