RhinoCommon API
Brep.MergeCoplanarFaces Method (Int32, Int32, Double, Double)
 Merges two coplanar, adjacent Brep faces into a single face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.19
Syntax
public bool MergeCoplanarFaces(
	int faceIndex0,
	int faceIndex1,
	double tolerance,
	double angleTolerance
)
Public Function MergeCoplanarFaces (
	faceIndex0 As Integer,
	faceIndex1 As Integer,
	tolerance As Double,
	angleTolerance As Double
) As Boolean
Parameters
faceIndex0
Type: System.Int32
The index of the first Brep face.
faceIndex1
Type: System.Int32
The index of the second Brep face.
tolerance
Type: System.Double
 Tolerance for determining when edges are adjacent. When in doubt, use the document's ModelAbsoluteTolerance property.
angleTolerance
Type: System.Double
 Angle tolerance, in radians, for determining when faces are parallel. When in doubt, use the document's ModelAngleToleranceRadians property.
Return Value
Type: Boolean
true if faces were merged, false if no faces were merged.
See Also
Reference
Brep Class
MergeCoplanarFaces Overload
Rhino.Geometry Namespace