RhinoCommon API
WorldMapDayNight.LocationToMap Method
[Missing <summary> documentation for "M:Rhino.Render.UI.WorldMapDayNight.LocationToMap(Rhino.Geometry.Point2d)"]
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point LocationToMap(
	Point2d latlong
)
Public Function LocationToMap (
	latlong As Point2d
) As Point
Parameters
latlong
Type: Rhino.Geometry.Point2d
[Missing <param name="latlong"/> documentation for "M:Rhino.Render.UI.WorldMapDayNight.LocationToMap(Rhino.Geometry.Point2d)"]
Return Value
Type: Point
[Missing <returns> documentation for "M:Rhino.Render.UI.WorldMapDayNight.LocationToMap(Rhino.Geometry.Point2d)"]
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace