RhinoCommon API
SafeFrame Constructor
 Create a utility object not associated with any document
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public SafeFrame()
Public Sub New
See Also
Reference
SafeFrame Class
SafeFrame Overload
Rhino.Render Namespace