RhinoCommon API
RhinoList<T>.AsReadOnly Method
 Constructs a read-only wrapper of this class.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ReadOnlyCollection<T> AsReadOnly()
Public Function AsReadOnly As ReadOnlyCollection(Of T)
Return Value
Type: ReadOnlyCollection<T>
A wrapper.
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace