RhinoCommon API
Dialogs.ShowPropertyListBox Method (String, String, IList, IList<String>)
 Displays Rhino's property list box.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string[] ShowPropertyListBox(
	string title,
	string message,
	IList items,
	IList<string> values
)
Public Shared Function ShowPropertyListBox (
	title As String,
	message As String,
	items As IList,
	values As IList(Of String)
) As String()
Parameters
title
Type: System.String
The dialog title.
message
Type: System.String
The dialog message.
items
Type: System.Collections.IList
A list of property names.
values
Type: System.Collections.Generic.IList<String>
A list of property values.
Return Value
Type: String[]
A list of property values if successful, null otherwise.
See Also
Reference
Dialogs Class
ShowPropertyListBox Overload
Rhino.UI Namespace