RhinoCommon API
PlugInInfo.Icon Method
 Returns the plug-in's icon in bitmap form.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Bitmap Icon(
	Size size
)
Public Function Icon (
	size As Size
) As Bitmap
Parameters
size
Type: System.Drawing.Size
[Missing <param name="size"/> documentation for "M:Rhino.PlugIns.PlugInInfo.Icon(System.Drawing.Size)"]
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugInInfo.Icon(System.Drawing.Size)"]
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace