RhinoCommon API
Mesh.QuadRemeshAsync Method (QuadRemeshParameters, IEnumerable<Curve>, IProgress<Int32>, CancellationToken)
 Quad remesh this mesh asynchronously.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Task<Mesh> QuadRemeshAsync(
	QuadRemeshParameters parameters,
	IEnumerable<Curve> guideCurves,
	IProgress<int> progress,
	CancellationToken cancelToken
)
Public Function QuadRemeshAsync (
	parameters As QuadRemeshParameters,
	guideCurves As IEnumerable(Of Curve),
	progress As IProgress(Of Integer),
	cancelToken As CancellationToken
) As Task(Of Mesh)
Parameters
parameters
Type: Rhino.Geometry.QuadRemeshParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshAsync(Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)"]
guideCurves
Type: System.Collections.Generic.IEnumerable<Curve>
 A curve array used to influence mesh face layout The curves should touch the input mesh Set Guide Curve Influence by using QuadRemeshParameters.GuideCurveInfluence
progress
Type: System.IProgress<Int32>
[Missing <param name="progress"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshAsync(Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)"]
cancelToken
Type: System.Threading.CancellationToken
[Missing <param name="cancelToken"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshAsync(Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)"]
Return Value
Type: Task<Mesh>
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshAsync(Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)"]
See Also
Reference
Mesh Class
QuadRemeshAsync Overload
Rhino.Geometry Namespace