RhinoCommon API
GetInteger.Number Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetInteger.Number"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Number()
Public Function Number As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetInteger.Number"]
See Also
Reference
GetInteger Class
Rhino.Input.Custom Namespace