RhinoCommon API
Aligner.SupportsGeometry Method
 Tests whether a piece of geometry can have its vertices aligned.
Meshes, SubDs, point clouds and degree 1 curves are supported.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool SupportsGeometry(
	GeometryBase geometry
)
Public Shared Function SupportsGeometry (
	geometry As GeometryBase
) As Boolean
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
The geometry to test. Can be null.
Return Value
Type: Boolean
True if AlignVertices(IEnumerable<GeometryBase>, Double, Boolean, Boolean) accepts this geometry.
See Also
Reference
Aligner Class
Rhino.Geometry Namespace