RhinoCommon API
File3dmPlugInDataTable.Clear Method
 Remove all entries from this table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace