RhinoCommon API
Layer.SetPerViewportColor Method
 Sets the display color for this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetPerViewportColor(
	Guid viewportId,
	Color color
)
Public Sub SetPerViewportColor (
	viewportId As Guid,
	color As Color
)
Parameters
viewportId
Type: System.Guid
If not Guid.Empty, then the setting applies only to the viewport with the specified id.
color
Type: System.Drawing.Color
The display color.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace