RhinoCommon API
ModelComponent.LockIndex Method
 Locks the component Index property.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void LockIndex()
Public Sub LockIndex
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace