RhinoCommon API
HatchPattern.WriteToFile Method (String, HatchPattern)
 Writes a hatch pattern defintion to a file.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public static bool WriteToFile(
	string filename,
	HatchPattern hatchPattern
)
Public Shared Function WriteToFile (
	filename As String,
	hatchPattern As HatchPattern
) As Boolean
Parameters
filename
Type: System.String
Name of file to create. If file exists, it will be overwritten.
hatchPattern
Type: Rhino.DocObjects.HatchPattern
The hatch pattern to write.
Return Value
Type: Boolean
True if successful, false otherwise.
Remarks
Output file is in AutoCAD .PAT format.
See Also
Reference
HatchPattern Class
WriteToFile Overload
Rhino.DocObjects Namespace