RhinoCommon API
ClassArrayOnObjRef Constructor
 Initializes a new ClassArrayOnObjRef instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public ClassArrayOnObjRef()
Public Sub New
See Also
Reference
ClassArrayOnObjRef Class
ClassArrayOnObjRef Overload
Rhino.Runtime.InteropWrappers Namespace