RhinoCommon API
NurbsCurveFitParameters.GetPointCountRange Method
 Get the point count range and tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void GetPointCountRange(
	out int minimum,
	out int maximum,
	out double tolerance
)
Public Sub GetPointCountRange (
	<OutAttribute> ByRef minimum As Integer,
	<OutAttribute> ByRef maximum As Integer,
	<OutAttribute> ByRef tolerance As Double
)
Parameters
minimum
Type: System.Int32
[Missing <param name="minimum"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.GetPointCountRange(System.Int32@,System.Int32@,System.Double@)"]
maximum
Type: System.Int32
[Missing <param name="maximum"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.GetPointCountRange(System.Int32@,System.Int32@,System.Double@)"]
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.GetPointCountRange(System.Int32@,System.Int32@,System.Double@)"]
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace