RhinoCommon API
RenderPlugIn.SupportsFeature Method
 Determines if your renderer supports a specific feature.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool SupportsFeature(
	RenderPlugIn.RenderFeature feature
)
Protected Overridable Function SupportsFeature (
	feature As RenderPlugIn.RenderFeature
) As Boolean
Parameters
feature
Type: Rhino.PlugIns.RenderPlugIn.RenderFeature
A feature to be controlled.
Return Value
Type: Boolean
true if the renderer indeed supports the feature.
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace