RhinoCommon API
SurfaceFilletBase Constructor (BrepFace, Curve, BrepFace, Point2d, Double)
Initializes a new instance of the SurfaceFilletBase class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected SurfaceFilletBase(
	BrepFace RailFace,
	Curve Rail3d,
	BrepFace Face,
	Point2d uv,
	double tolerance
)
Protected Sub New (
	RailFace As BrepFace,
	Rail3d As Curve,
	Face As BrepFace,
	uv As Point2d,
	tolerance As Double
)
Parameters
RailFace
Type: Rhino.Geometry.BrepFace
[Missing <param name="RailFace"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Curve,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double)"]
Rail3d
Type: Rhino.Geometry.Curve
[Missing <param name="Rail3d"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Curve,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double)"]
Face
Type: Rhino.Geometry.BrepFace
[Missing <param name="Face"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Curve,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double)"]
uv
Type: Rhino.Geometry.Point2d
[Missing <param name="uv"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Curve,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double)"]
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Curve,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double)"]
Exceptions
Exception | Condition
NullReferenceException
See Also
Reference
SurfaceFilletBase Class
SurfaceFilletBase Overload
Rhino.Geometry Namespace