RhinoCommon API
Curve.CreateFilletCornersCurve Method
 Rounds the corners of a kinked curve with arcs of a single, specified radius.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Curve CreateFilletCornersCurve(
	Curve curve,
	double radius,
	double tolerance,
	double angleTolerance
)
Public Shared Function CreateFilletCornersCurve (
	curve As Curve,
	radius As Double,
	tolerance As Double,
	angleTolerance As Double
) As Curve
Parameters
curve
Type: Rhino.Geometry.Curve
The curve to fillet.
radius
Type: System.Double
The fillet radius.
tolerance
Type: System.Double
The tolerance. When in doubt, use the document's model space absolute tolerance.
angleTolerance
Type: System.Double
The angle tolerance in radians. When in doubt, use the document's model space angle tolerance.
Return Value
Type: Curve
The filleted curve if successful. null on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace