RhinoCommon API
Cylinder.Transform Method
 Transforms this cylinder. Note that non-similarity preserving transformations cannot be applied to a cylinder.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation matrix to apply.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace