RhinoCommon API
IPanelsService.SetF1Hook Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.SetF1Hook(System.Object,System.EventHandler)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
void SetF1Hook(
	Object nativeObject,
	EventHandler hook
)
Sub SetF1Hook (
	nativeObject As Object,
	hook As EventHandler
)
Parameters
nativeObject
Type: System.Object
[Missing <param name="nativeObject"/> documentation for "M:Rhino.UI.IPanelsService.SetF1Hook(System.Object,System.EventHandler)"]
hook
Type: System.EventHandler
[Missing <param name="hook"/> documentation for "M:Rhino.UI.IPanelsService.SetF1Hook(System.Object,System.EventHandler)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace