RhinoCommon API
Brep.MergeCoplanarFaces Method (Double)
 Merges adjacent coplanar faces into single faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool MergeCoplanarFaces(
	double tolerance
)
Public Function MergeCoplanarFaces (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
 Tolerance for determining when edges are adjacent. When in doubt, use the document's ModelAbsoluteTolerance property.
Return Value
Type: Boolean
true if faces were merged, false if no faces were merged.
See Also
Reference
Brep Class
MergeCoplanarFaces Overload
Rhino.Geometry Namespace