RhinoCommon API
SubDDisplayParameters.CreateFromAbsoluteDisplayDensity Method
 Use of absolute display density is strongly discouraged. SubDs can have a single face or millions of faces. Adaptive display meshing produces more desirable results in almost all cases.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static SubDDisplayParameters CreateFromAbsoluteDisplayDensity(
	uint absoluteSubDDisplayDensity
)
Public Shared Function CreateFromAbsoluteDisplayDensity (
	absoluteSubDDisplayDensity As UInteger
) As SubDDisplayParameters
Parameters
absoluteSubDDisplayDensity
Type: System.UInt32
 A value <= SubDDisplayParameters.Density.MaximumDensity. When in doubt, pass SubDDisplayParameters.Density.DefaultDensity.
Return Value
Type: SubDDisplayParameters
The SubD display parameters.
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace