RhinoCommon API
RenderMeshProvider.ProgressForAll Method
 Returns a complete list of progress reports for all providers for either the document or a collection of objects
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static RenderMeshProviderProgress[] ProgressForAll(
	RhinoDoc doc,
	Guid[] optional_objectIds
)
Public Shared Function ProgressForAll (
	doc As RhinoDoc,
	optional_objectIds As Guid()
) As RenderMeshProviderProgress()
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshProvider.ProgressForAll(Rhino.RhinoDoc,System.Guid[])"]
optional_objectIds
Type: System.Guid[]
[Missing <param name="optional_objectIds"/> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshProvider.ProgressForAll(Rhino.RhinoDoc,System.Guid[])"]
Return Value
Type: RenderMeshProviderProgress[]
[Missing <returns> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshProvider.ProgressForAll(Rhino.RhinoDoc,System.Guid[])"]
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace