RhinoCommon API
RdkSelectionNavigator.Dispose Method
Releases all resources used by the RdkSelectionNavigator
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace