RhinoCommon API
IRhRdkContentThumbnail.TopLevelContent Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnail.TopLevelContent"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
RenderContent TopLevelContent()
Function TopLevelContent As RenderContent
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnail.TopLevelContent"]
See Also
Reference
IRhRdkContentThumbnail Interface
Rhino.UI.Controls.ThumbnailUI Namespace