RhinoCommon API
ArchivableDictionary.GetPlane Method (String, Plane)
 Get value as Plane, will return defaultValue unless value was created using Set(string key, Plane value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public Plane GetPlane(
	string key,
	Plane defaultValue
)
Public Function GetPlane (
	key As String,
	defaultValue As Plane
) As Plane
Parameters
key
Type: System.String
The key.
defaultValue
Type: Rhino.Geometry.Plane
The default value.
Return Value
Type: Plane
The value as Plane.
See Also
Reference
ArchivableDictionary Class
GetPlane Overload
Rhino.Collections Namespace