RhinoCommon API
VolumeMassProperties.CentroidCoordinatesPrincipalMomentsOfInertia Method
 Calculates the principal moments of inertia and principal axes with respect to centroid coordinates.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public bool CentroidCoordinatesPrincipalMomentsOfInertia(
	out double x,
	out Vector3d xaxis,
	out double y,
	out Vector3d yaxis,
	out double z,
	out Vector3d zaxis
)
Public Function CentroidCoordinatesPrincipalMomentsOfInertia (
	<OutAttribute> ByRef x As Double,
	<OutAttribute> ByRef xaxis As Vector3d,
	<OutAttribute> ByRef y As Double,
	<OutAttribute> ByRef yaxis As Vector3d,
	<OutAttribute> ByRef z As Double,
	<OutAttribute> ByRef zaxis As Vector3d
) As Boolean
Parameters
x
Type: System.Double
Principal moment.
xaxis
Type: Rhino.Geometry.Vector3d
Principal axis for x.
y
Type: System.Double
Principal moment.
yaxis
Type: Rhino.Geometry.Vector3d
Principal axis for y.
z
Type: System.Double
Principal moment.
zaxis
Type: Rhino.Geometry.Vector3d
Principal axis for z.
Return Value
Type: Boolean
true if successful.
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace