RhinoCommon API
Transform2d.FromAffineElements Method (Double, Double, Double, Double, Double, Double)
 Creates a transform from the six coefficients used by the traditional 2d drawing APIs. See the remarks on ToAffineElements().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d FromAffineElements(
	double a,
	double b,
	double c,
	double d,
	double tx,
	double ty
)
Public Shared Function FromAffineElements (
	a As Double,
	b As Double,
	c As Double,
	d As Double,
	tx As Double,
	ty As Double
) As Transform2d
Parameters
a
Type: System.Double
Becomes M00.
b
Type: System.Double
Becomes M10.
c
Type: System.Double
Becomes M01.
d
Type: System.Double
Becomes M11.
tx
Type: System.Double
Becomes M02, the X translation.
ty
Type: System.Double
Becomes M12, the Y translation.
Return Value
Type: Transform2d
The equivalent transform.
See Also
Reference
Transform2d Structure
FromAffineElements Overload
Rhino.Geometry Namespace