RhinoCommon API
BrepFace.IsPointOnFace Method (Double, Double)
 Tests if a parameter space point is in the active region of a face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PointFaceRelation IsPointOnFace(
	double u,
	double v
)
Public Function IsPointOnFace (
	u As Double,
	v As Double
) As PointFaceRelation
Parameters
u
Type: System.Double
Parameter space point U value.
v
Type: System.Double
Parameter space point V value.
Return Value
Type: PointFaceRelation
A value describing the relationship between the point and the face.
See Also
Reference
BrepFace Class
IsPointOnFace Overload
Rhino.Geometry Namespace