RhinoCommon API
RhinoAccountsCannotListenException Constructor (Exception)
 Generates a new instance of the exception.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RhinoAccountsCannotListenException(
	Exception innerException = null
)
Public Sub New (
	Optional innerException As Exception = Nothing
)
Parameters
innerException (Optional)
Type: System.Exception
The inner exception.
See Also
Reference
RhinoAccountsCannotListenException Class
RhinoAccountsCannotListenException Overload
Rhino.Runtime.RhinoAccounts Namespace