RhinoCommon API
Interop.CommandLineOptionFromNativePointer Method
 Create a command line option for a native pointer. Do not hold onto this class as it does not control the lifetime of the underlying pointer
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static CommandLineOption CommandLineOptionFromNativePointer(
	IntPtr ptrCommandLineOption
)
Public Shared Function CommandLineOptionFromNativePointer (
	ptrCommandLineOption As IntPtr
) As CommandLineOption
Parameters
ptrCommandLineOption
Type: System.IntPtr
[Missing <param name="ptrCommandLineOption"/> documentation for "M:Rhino.Runtime.Interop.CommandLineOptionFromNativePointer(System.IntPtr)"]
Return Value
Type: CommandLineOption
[Missing <returns> documentation for "M:Rhino.Runtime.Interop.CommandLineOptionFromNativePointer(System.IntPtr)"]
See Also
Reference
Interop Class
Rhino.Runtime Namespace