RhinoCommon API
Vector3d.AreOrthonormal Method
 Test whether three vectors describe an orthogonal, unit axis system. All vectors must be mutually perpendicular and have unit length for this to be the case.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public static bool AreOrthonormal(
	Vector3d x,
	Vector3d y,
	Vector3d z
)
Public Shared Function AreOrthonormal (
	x As Vector3d,
	y As Vector3d,
	z As Vector3d
) As Boolean
Parameters
x
Type: Rhino.Geometry.Vector3d
X axis vector.
y
Type: Rhino.Geometry.Vector3d
Y axis vector.
z
Type: Rhino.Geometry.Vector3d
Z axis vector.
Return Value
Type: Boolean
True if all vectors are non-zero and mutually perpendicular.
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace