RhinoCommon API
ViewCapture.CaptureToBitmap Method (RhinoView)
[Missing <summary> documentation for "M:Rhino.Display.ViewCapture.CaptureToBitmap(Rhino.Display.RhinoView)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Bitmap CaptureToBitmap(
	RhinoView sourceView
)
Public Function CaptureToBitmap (
	sourceView As RhinoView
) As Bitmap
Parameters
sourceView
Type: Rhino.Display.RhinoView
[Missing <param name="sourceView"/> documentation for "M:Rhino.Display.ViewCapture.CaptureToBitmap(Rhino.Display.RhinoView)"]
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.Display.ViewCapture.CaptureToBitmap(Rhino.Display.RhinoView)"]
See Also
Reference
ViewCapture Class
CaptureToBitmap Overload
Rhino.Display Namespace