RhinoCommon API
FileCsvDocument.Set Method (Int32, Int32, DateTime, String)
 Sets the value of a cell to a date and time, formatted with the specified .NET date/time format string and the invariant culture.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Set(
	int column,
	int row,
	DateTime value,
	string format
)
Public Sub Set (
	column As Integer,
	row As Integer,
	value As DateTime,
	format As String
)
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.DateTime
The value to store.
format
Type: System.String
A standard or custom date/time format string, for example "yyyy-MM-dd".
See Also
Reference
FileCsvDocument Class
Set Overload
Rhino.FileIO Namespace