RhinoCommon API
WorksessionFile.SetModel Method
Replaces a model with a copy of another.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetModel(
	int index,
	WorksessionFileModel model
)
Public Sub SetModel (
	index As Integer,
	model As WorksessionFileModel
)
Parameters
index
Type: System.Int32
Index of the model to replace.
model
Type: Rhino.FileIO.WorksessionFileModel
The model to copy.
Exceptions
Exception | Condition
ArgumentNullException | If model is null.
ArgumentOutOfRangeException | If index is out of range.
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace