RhinoCommon API
PostEffectPipeline.GetChannelForWrite Method
 Get a channel for writing. A post effect will use this to get channel(s) to write the output of its processing to. Input will usually come from existing channels, although a post effect is free to read its own output channels if needed. See GetChannelForRead() You are allowed to create one new channel with the same identifier as an existing channel, in which case IChannel::Commit() will replace the existing channel with the new one in the pipeline.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PostEffectChannel GetChannelForWrite(
	Guid id
)
Public Function GetChannelForWrite (
	id As Guid
) As PostEffectChannel
Parameters
id
Type: System.Guid
The channel identifier.
Return Value
Type: PostEffectChannel
A pointer to the new channel or null if the channel could not be created.
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace