RhinoCommon API
Brep.CullUnused2dCurves Method
Culls 3d curves not referenced by an edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool CullUnused2dCurves()
Public Function CullUnused2dCurves As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace