RhinoCommon API
Triangle3d Constructor
 Instantiates a new triangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Triangle3d(
	Point3d a,
	Point3d b,
	Point3d c
)
Public Sub New (
	a As Point3d,
	b As Point3d,
	c As Point3d
)
Parameters
a
Type: Rhino.Geometry.Point3d
First point.
b
Type: Rhino.Geometry.Point3d
Second point.
c
Type: Rhino.Geometry.Point3d
Third point.
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace