RhinoCommon API
RenderPlugIn.SupportedOutputTypes Method
 Returns a list of output types which your renderer can write.
The default implementation returns BMP, JPG, PNG, TIF, TGA, HDR, EXR and RIMAGE.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual List<FileType> SupportedOutputTypes()
Protected Overridable Function SupportedOutputTypes As List(Of FileType)
Return Value
Type: List<FileType>
A list of file types.
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace