RhinoCommon API
Brep.PointConstraint Constructor
 Constructor for a given location
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PointConstraint(
	Point3d point
)
Public Sub New (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
[Missing <param name="point"/> documentation for "M:Rhino.Geometry.Brep.PointConstraint.#ctor(Rhino.Geometry.Point3d)"]
See Also
Reference
Brep.PointConstraint Class
Rhino.Geometry Namespace