RhinoCommon API
Curve.JoinCurves Method (IEnumerable<Curve>, Double, Boolean, Int32[])
 Joins a collection of curve segments together.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static Curve[] JoinCurves(
	IEnumerable<Curve> inputCurves,
	double joinTolerance,
	bool preserveDirection,
	out int[] key
)
Public Shared Function JoinCurves (
	inputCurves As IEnumerable(Of Curve),
	joinTolerance As Double,
	preserveDirection As Boolean,
	<OutAttribute> ByRef key As Integer()
) As Curve()
Parameters
inputCurves
Type: System.Collections.Generic.IEnumerable<Curve>
An array, a list or any enumerable set of curve segments to join.
joinTolerance
Type: System.Double
Joining tolerance, i.e. the distance between segment end-points that is allowed.
preserveDirection
Type: System.Boolean
If true, curve endpoints will be compared to curve start points.
If false, all start and endpoints will be compared and copies of input curves may be reversed in output.
key
Type: System.Int32[]
inputCurves[i] is part of returnValue[key[i]]
Return Value
Type: Curve[]
An array of joined curves. This array can be empty.
Exceptions
Exception | Condition
ArgumentNullException | If inputCurves is null.
See Also
Reference
Curve Class
JoinCurves Overload
Rhino.Geometry Namespace