RhinoCommon API
SubDEdgeChain.Finalize Method
 Finalizer.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace