RhinoCommon API
Dialogs.ShowSelectMultipleLayersDialog Method
[Missing <summary> documentation for "M:Rhino.UI.Dialogs.ShowSelectMultipleLayersDialog(System.Collections.Generic.IEnumerable{System.Int32},System.String,System.Boolean,System.Int32[]@)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public static bool ShowSelectMultipleLayersDialog(
	IEnumerable<int> defaultLayerIndices,
	string dialogTitle,
	bool showNewLayerButton,
	out int[] layerIndices
)
Public Shared Function ShowSelectMultipleLayersDialog (
	defaultLayerIndices As IEnumerable(Of Integer),
	dialogTitle As String,
	showNewLayerButton As Boolean,
	<OutAttribute> ByRef layerIndices As Integer()
) As Boolean
Parameters
defaultLayerIndices
Type: System.Collections.Generic.IEnumerable<Int32>
[Missing <param name="defaultLayerIndices"/> documentation for "M:Rhino.UI.Dialogs.ShowSelectMultipleLayersDialog(System.Collections.Generic.IEnumerable{System.Int32},System.String,System.Boolean,System.Int32[]@)"]
dialogTitle
Type: System.String
[Missing <param name="dialogTitle"/> documentation for "M:Rhino.UI.Dialogs.ShowSelectMultipleLayersDialog(System.Collections.Generic.IEnumerable{System.Int32},System.String,System.Boolean,System.Int32[]@)"]
showNewLayerButton
Type: System.Boolean
[Missing <param name="showNewLayerButton"/> documentation for "M:Rhino.UI.Dialogs.ShowSelectMultipleLayersDialog(System.Collections.Generic.IEnumerable{System.Int32},System.String,System.Boolean,System.Int32[]@)"]
layerIndices
Type: System.Int32[]
[Missing <param name="layerIndices"/> documentation for "M:Rhino.UI.Dialogs.ShowSelectMultipleLayersDialog(System.Collections.Generic.IEnumerable{System.Int32},System.String,System.Boolean,System.Int32[]@)"]
Return Value
Type: Boolean
 True if the dialog was closed with the OK button. False if the dialog was closed with escape.
See Also
Reference
Dialogs Class
Rhino.UI Namespace