RhinoCommon API
Transform.Rotation Method (Double, Double, Vector3d, Point3d)
 Constructs a new rotation transformation with specified angle, rotation center and rotation axis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Transform Rotation(
	double sinAngle,
	double cosAngle,
	Vector3d rotationAxis,
	Point3d rotationCenter
)
Public Shared Function Rotation (
	sinAngle As Double,
	cosAngle As Double,
	rotationAxis As Vector3d,
	rotationCenter As Point3d
) As Transform
Parameters
sinAngle
Type: System.Double
Sine of the rotation angle.
cosAngle
Type: System.Double
Cosine of the rotation angle.
rotationAxis
Type: Rhino.Geometry.Vector3d
3D unit axis of rotation.
rotationCenter
Type: Rhino.Geometry.Point3d
3D center of rotation.
Return Value
Type: Transform
A rotation transformation matrix.
See Also
Reference
Transform Structure
Rotation Overload
Rhino.Geometry Namespace