RhinoCommon API
Transform.Rotation Method (Vector3d, Vector3d, Vector3d, Vector3d, Vector3d, Vector3d)
 Constructs a transformation that maps X0 to X1, Y0 to Y1, Z0 to Z1. The frames should be right hand orthonormal frames (unit vectors with Z = X x Y). The resulting rotation fixes the origin (0,0,0), maps initial X to final X, initial Y to final Y, and initial Z to final Z.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Transform Rotation(
	Vector3d x0,
	Vector3d y0,
	Vector3d z0,
	Vector3d x1,
	Vector3d y1,
	Vector3d z1
)
Public Shared Function Rotation (
	x0 As Vector3d,
	y0 As Vector3d,
	z0 As Vector3d,
	x1 As Vector3d,
	y1 As Vector3d,
	z1 As Vector3d
) As Transform
Parameters
x0
Type: Rhino.Geometry.Vector3d
Initial frame X.
y0
Type: Rhino.Geometry.Vector3d
Initial frame Y.
z0
Type: Rhino.Geometry.Vector3d
Initial frame Z.
x1
Type: Rhino.Geometry.Vector3d
Final frame X.
y1
Type: Rhino.Geometry.Vector3d
Final frame Y.
z1
Type: Rhino.Geometry.Vector3d
Final frame Z.
Return Value
Type: Transform
A rotation transformation matrix.
See Also
Reference
Transform Structure
Rotation Overload
Rhino.Geometry Namespace