RhinoCommon API
Layer.GetLeafName Method (Layer)
 Get a layer name's "leaf" level name
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string GetLeafName(
	Layer layer
)
Public Shared Function GetLeafName (
	layer As Layer
) As String
Parameters
layer
Type: Rhino.DocObjects.Layer
[Missing <param name="layer"/> documentation for "M:Rhino.DocObjects.Layer.GetLeafName(Rhino.DocObjects.Layer)"]
Return Value
Type: String
 leaf name or String.Empty if fullPath does not contain a leaf
See Also
Reference
Layer Class
GetLeafName Overload
Rhino.DocObjects Namespace