RhinoCommon API
GripUserInterfaceObject Constructor
Initializes a new instance of the GripUserInterfaceObject class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected GripUserInterfaceObject()
Protected Sub New
See Also
Reference
GripUserInterfaceObject Class
GripUserInterfaceObject Overload
Rhino.UI Namespace