RhinoCommon API
ArchivableDictionary.TryGetPlane Method
 Get value as Plane, will only succeed if value was created using Set(string key, Plane value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public bool TryGetPlane(
	string key,
	out Plane value
)
Public Function TryGetPlane (
	key As String,
	<OutAttribute> ByRef value As Plane
) As Boolean
Parameters
key
Type: System.String
The key.
value
Type: Rhino.Geometry.Plane
The value.
Return Value
Type: Boolean
The value as Plane.
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace