RhinoCommon API
DisplayPipeline.DrawMeshShaded Method (Mesh, Color, IsoDrawEffect)
 Draws shaded mesh with isodraw settings applied (zebra)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void DrawMeshShaded(
	Mesh mesh,
	Color diffuseMaterialColor,
	IsoDrawEffect zebraSettings
)
Public Sub DrawMeshShaded (
	mesh As Mesh,
	diffuseMaterialColor As Color,
	zebraSettings As IsoDrawEffect
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawMeshShaded(Rhino.Geometry.Mesh,System.Drawing.Color,Rhino.Display.IsoDrawEffect)"]
diffuseMaterialColor
Type: System.Drawing.Color
[Missing <param name="diffuseMaterialColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawMeshShaded(Rhino.Geometry.Mesh,System.Drawing.Color,Rhino.Display.IsoDrawEffect)"]
zebraSettings
Type: Rhino.Display.IsoDrawEffect
[Missing <param name="zebraSettings"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawMeshShaded(Rhino.Geometry.Mesh,System.Drawing.Color,Rhino.Display.IsoDrawEffect)"]
See Also
Reference
DisplayPipeline Class
DrawMeshShaded Overload
Rhino.Display Namespace