RhinoCommon API
SnapShotsClient.RenderingCategory Method
 Predefined rendering category
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string RenderingCategory()
Public Shared Function RenderingCategory As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.RenderingCategory"]
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace