RhinoCommon API
RhinoApp.PostCancelEvent Method
 Post a cancel event to the command line
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void PostCancelEvent(
	uint runtimeDocSerialNumber
)
Public Shared Sub PostCancelEvent (
	runtimeDocSerialNumber As UInteger
)
Parameters
runtimeDocSerialNumber
Type: System.UInt32
Unique serialNumber for the document to post the event to.
See Also
Reference
RhinoApp Class
Rhino Namespace