RhinoCommon API
TrulyObservableOrderedSet<T>.Insert Method
 Inserts an element at the specified index.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Insert(
	int index,
	T item
)
Public Sub Insert (
	index As Integer,
	item As T
)
Parameters
index
Type: System.Int32
The index to insert the element at.
item
Type: T
The item to insert.
Implements
IList<T>.Insert(Int32, T)
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown if the index passed is out of bounds.
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace