RhinoCommon API
DisplayPen.Duplicate Method
 Create a duplicate of this display pen.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public DisplayPen Duplicate()
Public Function Duplicate As DisplayPen
Return Value
Type: DisplayPen
An exact duplicate of this display pen.
See Also
Reference
DisplayPen Class
Rhino.Display Namespace