RhinoCommon API
AngularDimension.AdjustFromPoints Method (Plane, Point3d, Point3d, Point3d, Point3d)
 Updates dimension geometry from point locations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AdjustFromPoints(
	Plane plane,
	Point3d centerpoint,
	Point3d defpoint1,
	Point3d defpoint2,
	Point3d dimlinepoint
)
Public Function AdjustFromPoints (
	plane As Plane,
	centerpoint As Point3d,
	defpoint1 As Point3d,
	defpoint2 As Point3d,
	dimlinepoint As Point3d
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
Dimension's plane
centerpoint
Type: Rhino.Geometry.Point3d
Dimension's center point
defpoint1
Type: Rhino.Geometry.Point3d
Point on first extension line.
defpoint2
Type: Rhino.Geometry.Point3d
Point on second extension line.
dimlinepoint
Type: Rhino.Geometry.Point3d
Point on dimension arc.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
AngularDimension Class
AdjustFromPoints Overload
Rhino.Geometry Namespace