RhinoCommon API
CustomRenderMeshProvider.AllObjectsChanged Method
Note: This API is now obsolete.
 Call this method if your render meshes change.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
[ObsoleteAttribute("Use version that requires a document")]
public static void AllObjectsChanged()
<ObsoleteAttribute("Use version that requires a document")>
Public Shared Sub AllObjectsChanged
See Also
Reference
CustomRenderMeshProvider Class
AllObjectsChanged Overload
Rhino.Render Namespace