RhinoCommon API
LicenseUtils.Echo Method
 Test connectivity with the Zoo.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string Echo(
	string message
)
Public Shared Function Echo (
	message As String
) As String
Parameters
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.PlugIns.LicenseUtils.Echo(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.Echo(System.String)"]
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace