RhinoCommon API
UserInterfaceControl.SetSvg Method
[Missing <summary> documentation for "M:Rhino.UI.UserInterfaceControl.SetSvg(System.String)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetSvg(
	string svg
)
Public Sub SetSvg (
	svg As String
)
Parameters
svg
Type: System.String
[Missing <param name="svg"/> documentation for "M:Rhino.UI.UserInterfaceControl.SetSvg(System.String)"]
See Also
Reference
UserInterfaceControl Class
Rhino.UI Namespace