RhinoCommon API
RenderPlugIn Constructor
Initializes a new instance of the RenderPlugIn class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected RenderPlugIn()
Protected Sub New
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace