RhinoCommon API
PersistentSettings.SetString Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetString(System.String,System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetString(
	string key,
	string value
)
Public Sub SetString (
	key As String,
	value As String
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetString(System.String,System.String)"]
value
Type: System.String
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetString(System.String,System.String)"]
See Also
Reference
PersistentSettings Class
Rhino Namespace