RhinoCommon API
ComponentFunctionInfo Constructor
 Instantiates a new instance of the function class. This is not meant for public consumption.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected ComponentFunctionInfo(
	string name,
	string namespace,
	string description,
	IReadOnlyList<string> inputNames,
	IReadOnlyList<string> inputDescriptions,
	IReadOnlyList<string> inputTypeNames,
	IReadOnlyList<bool> inputsOptional,
	IReadOnlyList<string> outputNames,
	IReadOnlyList<string> outputDescriptions,
	IReadOnlyList<string> outputTypeNames,
	Guid componentGuid
)
Protected Sub New (
	name As String,
	namespace As String,
	description As String,
	inputNames As IReadOnlyList(Of String),
	inputDescriptions As IReadOnlyList(Of String),
	inputTypeNames As IReadOnlyList(Of String),
	inputsOptional As IReadOnlyList(Of Boolean),
	outputNames As IReadOnlyList(Of String),
	outputDescriptions As IReadOnlyList(Of String),
	outputTypeNames As IReadOnlyList(Of String),
	componentGuid As Guid
)
Parameters
name
Type: System.String
Name.
namespace
Type: System.String
Namespace.
description
Type: System.String
Description.
inputNames
Type: System.Collections.Generic.IReadOnlyList<String>
Input parameter names.
inputDescriptions
Type: System.Collections.Generic.IReadOnlyList<String>
Input parameter descriptions.
inputTypeNames
Type: System.Collections.Generic.IReadOnlyList<String>
Input parameter type names.
inputsOptional
Type: System.Collections.Generic.IReadOnlyList<Boolean>
Indications for optional inputs.
outputNames
Type: System.Collections.Generic.IReadOnlyList<String>
Output names.
outputDescriptions
Type: System.Collections.Generic.IReadOnlyList<String>
Output descriptions.
outputTypeNames
Type: System.Collections.Generic.IReadOnlyList<String>
Output type names.
componentGuid
Type: System.Guid
Component guid.
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace