RhinoCommon API
LightManagerSupportClient Constructor
Initializes a new instance of the LightManagerSupportClient class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LightManagerSupportClient(
	uint doc_uuid
)
Public Sub New (
	doc_uuid As UInteger
)
Parameters
doc_uuid
Type: System.UInt32
[Missing <param name="doc_uuid"/> documentation for "M:Rhino.Render.LightManagerSupportClient.#ctor(System.UInt32)"]
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace