RhinoCommon API
Layer.DeleteAllUserStrings Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.DeleteAllUserStrings"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public void DeleteAllUserStrings()
Public Sub DeleteAllUserStrings
See Also
Reference
Layer Class
Rhino.DocObjects Namespace