RhinoCommon API
Intersection.GeometryPlane Method (GeometryBase, Plane, Double, Boolean, RhinoDoc, Curve[], Point3d[])
 Intersects geometry with an (infinite) plane.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool GeometryPlane(
	GeometryBase geometry,
	Plane plane,
	double tolerance,
	bool joinCurves,
	RhinoDoc doc,
	out Curve[] intersectionCurves,
	out Point3d[] intersectionPoints
)
Public Shared Function GeometryPlane (
	geometry As GeometryBase,
	plane As Plane,
	tolerance As Double,
	joinCurves As Boolean,
	doc As RhinoDoc,
	<OutAttribute> ByRef intersectionCurves As Curve(),
	<OutAttribute> ByRef intersectionPoints As Point3d()
) As Boolean
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
GeometryBase object to intersect.
plane
Type: Rhino.Geometry.Plane
Plane to intersect with.
tolerance
Type: System.Double
Tolerance to use for intersections.
joinCurves
Type: System.Boolean
If true, join the resulting curves of each object where possible, for every geometry type. Curves of different objects, such as the objects of an instance definition, are never joined.
doc
Type: Rhino.RhinoDoc
The document that has the instance definition when geometry is an InstanceReferenceGeometry. Can be null for other geometry.
intersectionCurves
Type: Rhino.Geometry.Curve[]
The intersection curves will be returned here.
intersectionPoints
Type: Rhino.Geometry.Point3d[]
The intersection points will be returned here.
Return Value
Type: Boolean
 true if the intersection was computed, including when the plane misses the geometry. For an InstanceReferenceGeometry, true if it was computed for any object in the instance definition. false if the plane is not valid, tolerance is negative or not a number, the geometry type is not supported or the intersection failed. Curves and points found before a failure are still returned.
Remarks
 The curves and points are projected onto the plane. Curves that are not valid after the projection are not returned. For an InstanceReferenceGeometry, curves are fitted inside the instance definition with tolerance divided by the largest scale factor of the transform, so they are within tolerance in world coordinates, also for non-uniform scale. Points are tested with their distance to the plane in world coordinates. With non-uniform scale, overlaps of curves with the plane are detected with the stricter curve tolerance, so a curve closer than tolerance to the plane can be missed as an overlap. When joinCurves is true, the open curves of each object are joined: they can be reversed, very short curves can be dropped, and joined curves are PolyCurve. For point clouds, the points within tolerance of the plane are returned as one polyline in intersectionCurves, or in intersectionPoints when there is only one. Points closer together than tolerance are merged. The objects of an instance definition that are not visible are skipped, as the Contour command does.
See Also
Reference
Intersection Class
GeometryPlane Overload
Rhino.Geometry.Intersect Namespace