RhinoCommon API
StdVectorFloat Constructor (UInt64)
 Initializes a new StdVectorFloat class. Initial size of the array - all values are set to zero.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public StdVectorFloat(
	ulong initialSize
)
Public Sub New (
	initialSize As ULong
)
Parameters
initialSize
Type: System.UInt64
[Missing <param name="initialSize"/> documentation for "M:Rhino.Runtime.InteropWrappers.StdVectorFloat.#ctor(System.UInt64)"]
See Also
Reference
StdVectorFloat Class
StdVectorFloat Overload
Rhino.Runtime.InteropWrappers Namespace