RhinoCommon API
DisplayPipeline.DrawPatternedPolyline Method
 Draws a set of connected lines (polyline) with specified pattern.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawPatternedPolyline(
	IEnumerable<Point3d> points,
	Color color,
	int pattern,
	int thickness,
	bool close
)
Public Sub DrawPatternedPolyline (
	points As IEnumerable(Of Point3d),
	color As Color,
	pattern As Integer,
	thickness As Integer,
	close As Boolean
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
End points of each line segment.
color
Type: System.Drawing.Color
Color of polyline.
pattern
Type: System.Int32
Pattern to use for the line (like 0x00001111 for dotted).
thickness
Type: System.Int32
Thickness (in pixels) of lines.
close
Type: System.Boolean
Draw a line between the first and last points.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace