RhinoCommon API
DracoCompression.ToByteArray Method
 Gets the Draco compressed data as a byte array
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public byte[] ToByteArray()
Public Function ToByteArray As Byte()
Return Value
Type: Byte[]
[Missing <returns> documentation for "M:Rhino.FileIO.DracoCompression.ToByteArray"]
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace