RhinoCommon API
RenderContentKindList Constructor (RenderContentKindList)
 Construct a kind list from another.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public RenderContentKindList(
	RenderContentKindList kind_list
)
Public Sub New (
	kind_list As RenderContentKindList
)
Parameters
kind_list
Type: Rhino.Render.RenderContentKindList
Kind list to copy
See Also
Reference
RenderContentKindList Class
RenderContentKindList Overload
Rhino.Render Namespace