RhinoCommon API
RealtimeDisplayMode.HudShow Method
 Override if you want to hide the HUD. Shown by default
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool HudShow()
Public Overridable Function HudShow As Boolean
Return Value
Type: Boolean
Return false to hide the HUD.
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace