RhinoCommon API
ViewInfo.GetPageSettings Method
 Gets the paper size and margins of this view. Only meaningful when ViewType is PageView.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public PageSettings GetPageSettings()
Public Function GetPageSettings As PageSettings
Return Value
Type: PageSettings
[Missing <returns> documentation for "M:Rhino.DocObjects.ViewInfo.GetPageSettings"]
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace