RhinoCommon API
Curve.OffsetNormalToSurface Method
 Finds a curve by offsetting an existing curve normal to a surface. The caller is responsible for ensuring that the curve lies on the input surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Curve OffsetNormalToSurface(
	Surface surface,
	double height
)
Public Function OffsetNormalToSurface (
	surface As Surface,
	height As Double
) As Curve
Parameters
surface
Type: Rhino.Geometry.Surface
Surface from which normals are calculated.
height
Type: System.Double
Offset distance.
Return Value
Type: Curve
 Curve offset normal to the surface, if successful, null otherwise. The offset curve is interpolated through a small number of points so if the surface is irregular or complicated, the result will not be a very accurate offset.
See Also
Reference
Curve Class
Rhino.Geometry Namespace