RhinoCommon API
ColorLCH Constructor (Color)
 Constructs a new instance of ColorLCH that is equivalent to an ARGB color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ColorLCH(
	Color rgb
)
Public Sub New (
	rgb As Color
)
Parameters
rgb
Type: System.Drawing.Color
ARGB color to mimic.
Remarks
Exact conversions between color spaces are often not possible.
See Also
Reference
ColorLCH Structure
ColorLCH Overload
Rhino.Display Namespace