RhinoCommon API
Panels.GetPanel<T> Method (UInt32)
 Return an instance of a .Net panel
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static T GetPanel<T>(
	uint documentSerialNumber
)
where T : class
Public Shared Function GetPanel(Of T As Class) (
	documentSerialNumber As UInteger
) As T
Parameters
documentSerialNumber
Type: System.UInt32
 Runtime document Id associated with the requested panel.
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.UI.Panels.GetPanel``1(System.UInt32)"]
Return Value
Type: T
[Missing <returns> documentation for "M:Rhino.UI.Panels.GetPanel``1(System.UInt32)"]
See Also
Reference
Panels Class
GetPanel Overload
Rhino.UI Namespace