RhinoCommon API
SubD.TransformComponents Method
 Transforms an enumerable of SubD components.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public uint TransformComponents(
	IEnumerable<ComponentIndex> components,
	Transform xform,
	SubDComponentLocation componentLocation
)
Public Function TransformComponents (
	components As IEnumerable(Of ComponentIndex),
	xform As Transform,
	componentLocation As SubDComponentLocation
) As UInteger
Parameters
components
Type: System.Collections.Generic.IEnumerable<ComponentIndex>
The SubD components to transform.
xform
Type: Rhino.Geometry.Transform
The transformation to apply.
componentLocation
Type: Rhino.Geometry.SubDComponentLocation
 Select between applying the transform to the control net (faster) or the surface points (slower).
Return Value
Type: UInt32
The number of vertex locations that changed.
Remarks
 This method does not clear the evaluation cache.
See Also
Reference
SubD Class
Rhino.Geometry Namespace