RhinoCommon API
RhinoDoc.OpenDocuments Method (Boolean)
 Returns a list of currently open Rhino documents
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.2
Syntax
public static RhinoDoc[] OpenDocuments(
	bool includeHeadless
)
Public Shared Function OpenDocuments (
	includeHeadless As Boolean
) As RhinoDoc()
Parameters
includeHeadless
Type: System.Boolean
pass true to include headless docs in the list
Return Value
Type: RhinoDoc[]
[Missing <returns> documentation for "M:Rhino.RhinoDoc.OpenDocuments(System.Boolean)"]
See Also
Reference
RhinoDoc Class
OpenDocuments Overload
Rhino Namespace