RhinoCommon API
Command.GetCommandContextHelpUrl Method
 Returns a command's context help url.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.18
Syntax
public static string GetCommandContextHelpUrl(
	Guid commandId
)
Public Shared Function GetCommandContextHelpUrl (
	commandId As Guid
) As String
Parameters
commandId
Type: System.Guid
A command ID.
Return Value
Type: String
The command's context url if provided.
See Also
Reference
Command Class
Rhino.Commands Namespace