RhinoCommon API
DevelopableSrf.GetLocalDevopableRuling Method
 Finds minimum twist ruling between 2 curves at local domains
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static int GetLocalDevopableRuling(
	NurbsCurve rail0,
	double t0,
	Interval dom0,
	NurbsCurve rail1,
	double t1,
	Interval dom1,
	ref double t0_out,
	ref double t1_out
)
Public Shared Function GetLocalDevopableRuling (
	rail0 As NurbsCurve,
	t0 As Double,
	dom0 As Interval,
	rail1 As NurbsCurve,
	t1 As Double,
	dom1 As Interval,
	ByRef t0_out As Double,
	ByRef t1_out As Double
) As Integer
Parameters
rail0
Type: Rhino.Geometry.NurbsCurve
 First rail
t0
Type: System.Double
 Seed parameter on first rail
dom0
Type: Rhino.Geometry.Interval
 Parameter sub-domain to adjust in on first rail
rail1
Type: Rhino.Geometry.NurbsCurve
 Second rail
t1
Type: System.Double
 Seed parameter on second rail
dom1
Type: Rhino.Geometry.Interval
 Parameter sub-domain to adjust in on second rail
t0_out
Type: System.Double
 Result ruling on first rail
t1_out
Type: System.Double
 Result ruling on second rail
Return Value
Type: Int32
 -1: Error 0: Exact non-twisting ruling found between t0_out and t1_out 1: Ruling found between t0_out and t1_out that has less twist the ruling between t0 and t1
See Also
Reference
DevelopableSrf Class
Rhino.Geometry Namespace