RhinoCommon API
RhinoCore.Run Method
 Runs RhinoApp Message loop
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int Run()
Public Function Run As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Runtime.InProcess.RhinoCore.Run"]
See Also
Reference
RhinoCore Class
Rhino.Runtime.InProcess Namespace