RhinoCommon API
NurbsSurfacePointList.GetGrevillePoint Method
 Gets the 2-D Greville point associated with the control point at the given (u, v) index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point2d GetGrevillePoint(
	int u,
	int v
)
Public Function GetGrevillePoint (
	u As Integer,
	v As Integer
) As Point2d
Parameters
u
Type: System.Int32
Index of control point in the surface U direction.
v
Type: System.Int32
Index of control point in the surface V direction.
Return Value
Type: Point2d
A Surface UV coordinate on success, Point2d.Unset on failure.
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace