RhinoCommon API
LengthUnit.GreaterThanOrEqual Operator
Greater than or equal operator.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool operator >=(
	 in LengthUnit left,
	 in LengthUnit right
)
Public Shared Operator >= (
	 ByRef left As LengthUnit,
	 ByRef right As LengthUnit
) As Boolean
Parameters
left
Type: Rhino.LengthUnit
[Missing <param name="left"/> documentation for "M:Rhino.LengthUnit.op_GreaterThanOrEqual(Rhino.LengthUnit@,Rhino.LengthUnit@)"]
right
Type: Rhino.LengthUnit
[Missing <param name="right"/> documentation for "M:Rhino.LengthUnit.op_GreaterThanOrEqual(Rhino.LengthUnit@,Rhino.LengthUnit@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.LengthUnit.op_GreaterThanOrEqual(Rhino.LengthUnit@,Rhino.LengthUnit@)"]
See Also
Reference
LengthUnit Structure
Rhino Namespace