RhinoCommon API
PreviewAppearance.Finalize Method
 Destructor for previewappearance
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace