RhinoCommon API
Skin.DismissBootSplash Method
 Tells the platform's boot splash to dismiss, if one is up. Call this from a Skin subclass once its own window is on screen. No-op on platforms that have no boot splash.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
protected static void DismissBootSplash()
Protected Shared Sub DismissBootSplash
See Also
Reference
Skin Class
Rhino.Runtime Namespace