RhinoCommon API
RenderContent.ChildSlotNameFromParamName Method
 A "child slot" is the specific "slot" that a child (usually a texture) occupies. This is generally the "use" of the child - in other words, the thing the child operates on. Some examples are "color", "transparency".
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public string ChildSlotNameFromParamName(
	string paramName
)
Public Function ChildSlotNameFromParamName (
	paramName As String
) As String
Parameters
paramName
Type: System.String
The name of a parameter field. Since child textures will usually correspond with some parameter (they generally either replace or modify a parameter over UV space) these functions are used to specify which parameter corresponded with child slot. If there is no correspondence, return the empty string.
Return Value
Type: String
 The default behavior for these functions is to return the input string. Sub-classes may (in the future) override these functions to provide different mappings.
See Also
Reference
RenderContent Class
Rhino.Render Namespace