RhinoCommon API
BezierCurve Constructor (IEnumerable<Point4d>)
 Create bezier curve with controls defined by a list of 4d points
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BezierCurve(
	IEnumerable<Point4d> controlPoints
)
Public Sub New (
	controlPoints As IEnumerable(Of Point4d)
)
Parameters
controlPoints
Type: System.Collections.Generic.IEnumerable<Point4d>
See Also
Reference
BezierCurve Class
BezierCurve Overload
Rhino.Geometry Namespace