RhinoCommon API
RenderContentCollection.NextTag Method
 Call FirstTag first - this gets the next tag
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.13
Syntax
public string NextTag()
Public Function NextTag As String
Return Value
Type: String
The next tag
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace