RhinoCommon API
Mesh.GetUnsafeLock Method
 Allows to obtain unsafe pointers to the underlying unmanaged data structures of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public MeshUnsafeLock GetUnsafeLock(
	bool writable
)
Public Function GetUnsafeLock (
	writable As Boolean
) As MeshUnsafeLock
Parameters
writable
Type: System.Boolean
true if user will need to write onto the structure. false otherwise.
Return Value
Type: MeshUnsafeLock
A lock that needs to be released.
Remarks
The lock implements the IDisposable interface, and one call of its Dispose() or ReleaseUnsafeLock(MeshUnsafeLock) will update the data structure as required. This can be achieved with a using statement (Using in Vb.Net).
See Also
Reference
Mesh Class
Rhino.Geometry Namespace