RhinoCommon API
SubDVertexList.SetVertexTags Method (IEnumerable<Int32>, SubDVertexTag)
 Set vertex tags for a list of vertices. Useful for adding creases to SubDs
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.30
Syntax
public void SetVertexTags(
	IEnumerable<int> vertexIndices,
	SubDVertexTag tag
)
Public Sub SetVertexTags (
	vertexIndices As IEnumerable(Of Integer),
	tag As SubDVertexTag
)
Parameters
vertexIndices
Type: System.Collections.Generic.IEnumerable<Int32>
list of indices for the vertices to set tags on
tag
Type: Rhino.Geometry.SubDVertexTag
The type of vertex tag
See Also
Reference
SubDVertexList Class
SetVertexTags Overload
Rhino.Geometry.Collections Namespace