RhinoCommon API
DisplayMaterial Constructor (DisplayMaterial)
 Duplicate another material.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DisplayMaterial(
	DisplayMaterial other
)
Public Sub New (
	other As DisplayMaterial
)
Parameters
other
Type: Rhino.Display.DisplayMaterial
[Missing <param name="other"/> documentation for "M:Rhino.Display.DisplayMaterial.#ctor(Rhino.Display.DisplayMaterial)"]
See Also
Reference
DisplayMaterial Class
DisplayMaterial Overload
Rhino.Display Namespace