RhinoCommon API
CursorTooltipSettingsState Constructor
Initializes a new instance of the CursorTooltipSettingsState class
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CursorTooltipSettingsState()
Public Sub New
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace