RhinoCommon API
LicenseUtils.GetLicense Method (ValidateProductKeyDelegate, OnLeaseChangedDelegate, VerifyLicenseKeyDelegate, VerifyPreviousVersionLicenseDelegate, Int32, Int32, String, String, String, Guid, Guid)
[Missing <summary> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool GetLicense(
	ValidateProductKeyDelegate validateProductKeyDelegate,
	OnLeaseChangedDelegate leaseChangedDelegate,
	VerifyLicenseKeyDelegate verifyLicenseKeyDelegate,
	VerifyPreviousVersionLicenseDelegate verifyPreviousVersionLicenseKeyDelegate,
	int product_type,
	int capabilities,
	string textMask,
	string product_path,
	string product_title,
	Guid pluginId,
	Guid licenseId
)
Public Shared Function GetLicense (
	validateProductKeyDelegate As ValidateProductKeyDelegate,
	leaseChangedDelegate As OnLeaseChangedDelegate,
	verifyLicenseKeyDelegate As VerifyLicenseKeyDelegate,
	verifyPreviousVersionLicenseKeyDelegate As VerifyPreviousVersionLicenseDelegate,
	product_type As Integer,
	capabilities As Integer,
	textMask As String,
	product_path As String,
	product_title As String,
	pluginId As Guid,
	licenseId As Guid
) As Boolean
Parameters
validateProductKeyDelegate
Type: Rhino.PlugIns.ValidateProductKeyDelegate
[Missing <param name="validateProductKeyDelegate"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)"]
leaseChangedDelegate
Type: Rhino.PlugIns.OnLeaseChangedDelegate
[Missing <param name="leaseChangedDelegate"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)"]
verifyLicenseKeyDelegate
Type: Rhino.PlugIns.VerifyLicenseKeyDelegate
[Missing <param name="verifyLicenseKeyDelegate"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)"]
verifyPreviousVersionLicenseKeyDelegate
Type: Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate
[Missing <param name="verifyPreviousVersionLicenseKeyDelegate"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)"]
product_type
Type: System.Int32
[Missing <param name="product_type"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)"]
capabilities
Type: System.Int32
[Missing <param name="capabilities"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)"]
textMask
Type: System.String
[Missing <param name="textMask"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)"]
product_path
Type: System.String
[Missing <param name="product_path"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)"]
product_title
Type: System.String
[Missing <param name="product_title"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)"]
pluginId
Type: System.Guid
[Missing <param name="pluginId"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)"]
licenseId
Type: System.Guid
[Missing <param name="licenseId"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)"]
See Also
Reference
LicenseUtils Class
GetLicense Overload
Rhino.PlugIns Namespace