RhinoCommon API
RhinoDoc.AdjustModelUnitSystem Method
[Missing <summary> documentation for "M:Rhino.RhinoDoc.AdjustModelUnitSystem(Rhino.UnitSystem,System.Boolean)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void AdjustModelUnitSystem(
	UnitSystem newUnitSystem,
	bool scale
)
Public Sub AdjustModelUnitSystem (
	newUnitSystem As UnitSystem,
	scale As Boolean
)
Parameters
newUnitSystem
Type: Rhino.UnitSystem
[Missing <param name="newUnitSystem"/> documentation for "M:Rhino.RhinoDoc.AdjustModelUnitSystem(Rhino.UnitSystem,System.Boolean)"]
scale
Type: System.Boolean
[Missing <param name="scale"/> documentation for "M:Rhino.RhinoDoc.AdjustModelUnitSystem(Rhino.UnitSystem,System.Boolean)"]
See Also
Reference
RhinoDoc Class
Rhino Namespace