RhinoCommon API
RhinoObject.EnableGrips Method
 Turns on grips of one particular kind, replacing grips of any other kind.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool EnableGrips(
	Guid gripsId
)
Public Function EnableGrips (
	gripsId As Guid
) As Boolean
Parameters
gripsId
Type: System.Guid
 Id of a grips enabler registered with RegisterGripsEnabler(TurnOnGripsEventHandler, Type). Empty means no custom grips: the object's own default grips, which is what the PointsOn command turns on. For edit points call EnableEditPointGrips() rather than naming a kind here; curves and SubDs use different ones and it picks between them.
Return Value
Type: Boolean
 true if the object has grips of the requested kind when this returns. false if nothing is registered for gripsId, if the object has no grips of that kind (a polysurface has no default grips), or if the grips already on refused to turn off, which they do while they are being dragged.
Remarks
Grips that were on are put back when the requested kind cannot be made, so a false return leaves the object with the grips it had.
Except when the requested kind is already on, the grips are new objects afterwards and a GripObject held across this call is stale.
Grips this turns on are not subject to Automatic Points On. They stay on until something turns them off, as with PointsOn and EditPtOn.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace