RhinoCommon API
UserInterfaceGrid.RemoveAllChildren Method
 Empty the grid.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void RemoveAllChildren()
Public Sub RemoveAllChildren
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace