RhinoCommon API
IRhinoUiDialogService.ShowMultiListBox Method
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowMultiListBox(System.Collections.Generic.IList{System.String},System.String,System.String,System.Collections.Generic.IList{System.String})"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
string[] ShowMultiListBox(
	IList<string> items,
	string message,
	string title,
	IList<string> defaults
)
Function ShowMultiListBox (
	items As IList(Of String),
	message As String,
	title As String,
	defaults As IList(Of String)
) As String()
Parameters
items
Type: System.Collections.Generic.IList<String>
[Missing <param name="items"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowMultiListBox(System.Collections.Generic.IList{System.String},System.String,System.String,System.Collections.Generic.IList{System.String})"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowMultiListBox(System.Collections.Generic.IList{System.String},System.String,System.String,System.Collections.Generic.IList{System.String})"]
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowMultiListBox(System.Collections.Generic.IList{System.String},System.String,System.String,System.Collections.Generic.IList{System.String})"]
defaults
Type: System.Collections.Generic.IList<String>
[Missing <param name="defaults"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowMultiListBox(System.Collections.Generic.IList{System.String},System.String,System.String,System.Collections.Generic.IList{System.String})"]
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowMultiListBox(System.Collections.Generic.IList{System.String},System.String,System.String,System.Collections.Generic.IList{System.String})"]
See Also
Reference
IRhinoUiDialogService Interface
Rhino.UI Namespace