RhinoCommon API
Point3dList.SetAllZ Method
 Set all the Z values for the points to a single value
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public void SetAllZ(
	double zValue
)
Public Sub SetAllZ (
	zValue As Double
)
Parameters
zValue
Type: System.Double
See Also
Reference
Point3dList Class
Rhino.Collections Namespace