RhinoCommon API
ExtensionMethods.ToTextureProjectionMode Method
[Missing <summary> documentation for "M:Rhino.Render.ExtensionMethods.ToTextureProjectionMode(Rhino.Render.SimulatedTexture.ProjectionModes)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public static TextureProjectionMode ToTextureProjectionMode(
	this SimulatedTexture.ProjectionModes e
)
<ExtensionAttribute>
Public Shared Function ToTextureProjectionMode (
	e As SimulatedTexture.ProjectionModes
) As TextureProjectionMode
Parameters
e
Type: Rhino.Render.SimulatedTexture.ProjectionModes
[Missing <param name="e"/> documentation for "M:Rhino.Render.ExtensionMethods.ToTextureProjectionMode(Rhino.Render.SimulatedTexture.ProjectionModes)"]
Return Value
Type: TextureProjectionMode
[Missing <returns> documentation for "M:Rhino.Render.ExtensionMethods.ToTextureProjectionMode(Rhino.Render.SimulatedTexture.ProjectionModes)"]
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type SimulatedTexture.ProjectionModes. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ExtensionMethods Class
Rhino.Render Namespace