RhinoCommon API
FileCsvDocument.Set Method (Int32, Int32, Boolean)
 Sets the value of a cell to a boolean, written as "1" (true) or "0" (false).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Set(
	int column,
	int row,
	bool value
)
Public Sub Set (
	column As Integer,
	row As Integer,
	value As Boolean
)
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.Boolean
The value to store.
See Also
Reference
FileCsvDocument Class
Set Overload
Rhino.FileIO Namespace