RhinoCommon API
FileCdWriteOptions Constructor
Initializes a new instance of the FileCdWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileCdWriteOptions()
Public Sub New
See Also
Reference
FileCdWriteOptions Class
Rhino.FileIO Namespace