RhinoCommon API
Brep.IsExtrusion Method
Determines if the Brep is a portion of an extrusion within RhinoMath.ZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsExtrusion()
Public Function IsExtrusion As Boolean
Return Value
Type: Boolean
true if the Brep is an extrusion.
See Also
Reference
Brep Class
IsExtrusion Overload
Rhino.Geometry Namespace