RhinoCommon API
DimensionStyle.DimensionLengthDisplayUnit Method
[Missing <summary> documentation for "M:Rhino.DocObjects.DimensionStyle.DimensionLengthDisplayUnit(System.UInt32)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public UnitSystem DimensionLengthDisplayUnit(
	uint model_serial_number
)
Public Function DimensionLengthDisplayUnit (
	model_serial_number As UInteger
) As UnitSystem
Parameters
model_serial_number
Type: System.UInt32
[Missing <param name="model_serial_number"/> documentation for "M:Rhino.DocObjects.DimensionStyle.DimensionLengthDisplayUnit(System.UInt32)"]
Return Value
Type: UnitSystem
[Missing <returns> documentation for "M:Rhino.DocObjects.DimensionStyle.DimensionLengthDisplayUnit(System.UInt32)"]
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace