RhinoCommon API
PersistentSettings.GetSize Method (String, Size)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetSize(System.String,System.Drawing.Size)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Size GetSize(
	string key,
	Size defaultValue
)
Public Function GetSize (
	key As String,
	defaultValue As Size
) As Size
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetSize(System.String,System.Drawing.Size)"]
defaultValue
Type: System.Drawing.Size
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetSize(System.String,System.Drawing.Size)"]
Return Value
Type: Size
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetSize(System.String,System.Drawing.Size)"]
See Also
Reference
PersistentSettings Class
GetSize Overload
Rhino Namespace