RhinoCommon API
PostEffectJob.Execute Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffectJob.Execute(System.Drawing.Rectangle,Rhino.Render.PostEffects.PostEffectJobChannels)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public abstract bool Execute(
	Rectangle rect,
	PostEffectJobChannels access
)
Public MustOverride Function Execute (
	rect As Rectangle,
	access As PostEffectJobChannels
) As Boolean
Parameters
rect
Type: System.Drawing.Rectangle
[Missing <param name="rect"/> documentation for "M:Rhino.Render.PostEffects.PostEffectJob.Execute(System.Drawing.Rectangle,Rhino.Render.PostEffects.PostEffectJobChannels)"]
access
Type: Rhino.Render.PostEffects.PostEffectJobChannels
[Missing <param name="access"/> documentation for "M:Rhino.Render.PostEffects.PostEffectJob.Execute(System.Drawing.Rectangle,Rhino.Render.PostEffects.PostEffectJobChannels)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectJob.Execute(System.Drawing.Rectangle,Rhino.Render.PostEffects.PostEffectJobChannels)"]
See Also
Reference
PostEffectJob Class
Rhino.Render.PostEffects Namespace