RhinoCommon API
Silhouette.Compute Method (GeometryBase, SilhouetteType, Point3d, Double, Double, IEnumerable<Plane>, CancellationToken)
 Compute silhouettes of a shape for a perspective projection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Silhouette[] Compute(
	GeometryBase geometry,
	SilhouetteType silhouetteType,
	Point3d perspectiveCameraLocation,
	double tolerance,
	double angleToleranceRadians,
	IEnumerable<Plane> clippingPlanes,
	CancellationToken cancelToken
)
Public Shared Function Compute (
	geometry As GeometryBase,
	silhouetteType As SilhouetteType,
	perspectiveCameraLocation As Point3d,
	tolerance As Double,
	angleToleranceRadians As Double,
	clippingPlanes As IEnumerable(Of Plane),
	cancelToken As CancellationToken
) As Silhouette()
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
Geometry whose silhouettes need to be computed. Can be Brep, BrepFace, Mesh, or Extrusion.
silhouetteType
Type: Rhino.Geometry.SilhouetteType
Types of silhouette to compute.
perspectiveCameraLocation
Type: Rhino.Geometry.Point3d
Location of perspective camera.
tolerance
Type: System.Double
Tolerance to use for determining projecting relationships. Surfaces and curves that are closer than tolerance, may be treated as projecting. When in doubt use RhinoDoc.ModelAbsoluteTolerance.
angleToleranceRadians
Type: System.Double
Angular tolerance to use for determining projecting relationships. A surface normal N that satisfies N o cameraDirection < Sin(angleToleranceRadians) may be considered projecting. When in doubt use RhinoDoc.ModelAngleToleranceRadians.
clippingPlanes
Type: System.Collections.Generic.IEnumerable<Plane>
Optional collection of clipping planes.
cancelToken
Type: System.Threading.CancellationToken
Computation cancellation token.
Return Value
Type: Silhouette[]
Array of silhouette curves.
See Also
Reference
Silhouette Class
Compute Overload
Rhino.Geometry Namespace