RhinoCommon API
PreviewAppearance.RotationX Method
 RotationX
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double RotationX()
Public Function RotationX As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.RotationX"]
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace