RhinoCommon API
LocalizedStringHandler.AppendFormatted<T> Method (T, String)
[Missing <summary> documentation for "M:Rhino.UI.LocalizedStringHandler.AppendFormatted``1(``0,System.String)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void AppendFormatted<T>(
	T value,
	string format
)
Public Sub AppendFormatted(Of T) (
	value As T,
	format As String
)
Parameters
value
Type: T
[Missing <param name="value"/> documentation for "M:Rhino.UI.LocalizedStringHandler.AppendFormatted``1(``0,System.String)"]
format
Type: System.String
[Missing <param name="format"/> documentation for "M:Rhino.UI.LocalizedStringHandler.AppendFormatted``1(``0,System.String)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.UI.LocalizedStringHandler.AppendFormatted``1(``0,System.String)"]
See Also
Reference
LocalizedStringHandler Structure
AppendFormatted Overload
Rhino.UI Namespace