RhinoCommon API
LayerTable.SortByLayerName Method
 Sort layers, in the layer table, by their name in either ascending or descending order. This function sorts layers in the same manner as Rhino's Layers panel.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
public void SortByLayerName(
	bool bAscending
)
Public Sub SortByLayerName (
	bAscending As Boolean
)
Parameters
bAscending
Type: System.Boolean
Sort in ascending (true) or descending (false) order.
Remarks
 This function changes the value of SortIndex. It does not change the index order of layers in the layer table.
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace