RhinoCommon API
DrawingUtilities.LoadBitmapWithScaleDown Method
 Loads an icon from an embedded resource and converts it to a bitmap. If the icon is not a standard size, this function scales down a larger image.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Bitmap LoadBitmapWithScaleDown(
	string iconName,
	int sizeDesired,
	Assembly assembly = null
)
Public Shared Function LoadBitmapWithScaleDown (
	iconName As String,
	sizeDesired As Integer,
	Optional assembly As Assembly = Nothing
) As Bitmap
Parameters
iconName
Type: System.String
 The case-sensitive name of the icon manifest resource being requested.
sizeDesired
Type: System.Int32
 The desired size, in pixels, of the icon.
assembly (Optional)
Type: System.Reflection.Assembly
 The assembly containing the manifest resource.
Return Value
Type: Bitmap
 The icon converted to a bitmap if successful, null otherwise.
Exceptions
Exception | Condition
ArgumentException |  Thrown when iconName is not found as an embedded resource in the specified assembly.
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace