RhinoCommon API
RdkModalEditContentBucket.Dispose Method
Releases all resources used by the RdkModalEditContentBucket
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RdkModalEditContentBucket Class
Rhino.Render.DataSources Namespace