RhinoCommon API
GetEllipse.Finalize Method
 Passively releases the unmanaged object.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
GetEllipse Class
Rhino.Input.Custom Namespace