RhinoCommon API
PlugIn.CommandSettings Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.CommandSettings(System.String)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PersistentSettings CommandSettings(
	string name
)
Public Function CommandSettings (
	name As String
) As PersistentSettings
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.PlugIns.PlugIn.CommandSettings(System.String)"]
Return Value
Type: PersistentSettings
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.CommandSettings(System.String)"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace