RhinoCommon API
SupportOptions.SetShowRenderContent Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetShowRenderContent(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_SetShowRenderContent' instead")]
public static void SetShowRenderContent(
	bool b
)
<ObsoleteAttribute("Use 'Libraries_SetShowRenderContent' instead")>
Public Shared Sub SetShowRenderContent (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetShowRenderContent(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace