RhinoCommon API
PersistentSettings.SetColor Method (String, Color)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetColor(System.String,System.Drawing.Color)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetColor(
	string key,
	Color value
)
Public Sub SetColor (
	key As String,
	value As Color
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetColor(System.String,System.Drawing.Color)"]
value
Type: System.Drawing.Color
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetColor(System.String,System.Drawing.Color)"]
See Also
Reference
PersistentSettings Class
SetColor Overload
Rhino Namespace