RhinoCommon API
Extrusion.Create Method (Curve, Double, Boolean)
 Creates an extrusion of a 3d curve (which must be planar) and a height.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public static Extrusion Create(
	Curve planarCurve,
	double height,
	bool cap
)
Public Shared Function Create (
	planarCurve As Curve,
	height As Double,
	cap As Boolean
) As Extrusion
Parameters
planarCurve
Type: Rhino.Geometry.Curve
 Planar curve used as profile
height
Type: System.Double
 If the height > 0, the bottom of the extrusion will be in plane and the top will be height units above the plane. If the height < 0, the top of the extrusion will be in plane and the bottom will be height units below the plane. The plane used is the one that is returned from the curve's TryGetPlane function.
cap
Type: System.Boolean
 If the curve is closed and cap is true, then the resulting extrusion is capped.
Return Value
Type: Extrusion
 If the input is valid, then a new extrusion is returned. Otherwise null is returned
See Also
Reference
Extrusion Class
Create Overload
Rhino.Geometry Namespace