RhinoCommon API
ClassArrayObjRef Constructor
 Initializes a new ClassArrayObjRef instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ClassArrayObjRef()
Public Sub New
See Also
Reference
ClassArrayObjRef Class
ClassArrayObjRef Overload
Rhino.Runtime.InteropWrappers Namespace