RhinoCommon API
RhinoDoc.RenderMeshes Method
 Returns a set of non-object custom render primitives for this document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RenderMeshes[] RenderMeshes(
	MeshType mt,
	ViewportInfo vp,
	ref RenderMeshProvider.Flags flags,
	PlugIn plugin,
	DisplayPipelineAttributes attrs
)
Public Function RenderMeshes (
	mt As MeshType,
	vp As ViewportInfo,
	ByRef flags As RenderMeshProvider.Flags,
	plugin As PlugIn,
	attrs As DisplayPipelineAttributes
) As RenderMeshes()
Parameters
mt
Type: Rhino.Geometry.MeshType
The mesh type requested (render or analysis).
vp
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered
flags
Type: Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags
See RenderMeshProvider.Flags. This is an in/out parameter: on return it also carries any status flags - including Incomplete when an asynchronous provider has not finished - so reset it before each call and test it afterwards.
plugin
Type: Rhino.PlugIns.PlugIn
The requesting plug-in (typically the calling plugin)
attrs
Type: Rhino.Display.DisplayPipelineAttributes
Display attributes for the caller - null if this is a full rendering.
Return Value
Type: RenderMeshes[]
 Returns a set of custom render primitives for this object
See Also
Reference
RhinoDoc Class
Rhino Namespace
RhinoDoc.HasCustomRenderMeshes(MeshType, ViewportInfo, RenderMeshProvider.Flags, PlugIn, DisplayPipelineAttributes)