RhinoCommon API
RhinoObject.GetRenderMeshParameters Method (Boolean)
 Returns the meshing parameters that this object uses for generating render meshes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public MeshingParameters GetRenderMeshParameters(
	bool returnDocumentParametersIfUnset
)
Public Function GetRenderMeshParameters (
	returnDocumentParametersIfUnset As Boolean
) As MeshingParameters
Parameters
returnDocumentParametersIfUnset
Type: System.Boolean
 If true, then return the per-object meshing parameters for this object. If this object does not have per-object meshing parameters, then the document's meshing parameters are returned. If false, then return the per-object meshing parameters for this object. If this object does not have per-object meshing parameters, then null is returned.
Return Value
Type: MeshingParameters
The render meshing parameters if successful, null otherwise.
See Also
Reference
RhinoObject Class
GetRenderMeshParameters Overload
Rhino.DocObjects Namespace