RhinoCommon API
SubDEdgeSharpness.SharpnessFromNormalizedValue Method
 Converts a normalized slider value to an edge end sharpness value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static double SharpnessFromNormalizedValue(
	double normalizedSliderValue
)
Public Shared Function SharpnessFromNormalizedValue (
	normalizedSliderValue As Double
) As Double
Parameters
normalizedSliderValue
Type: System.Double
Between 0.0 and 1.0.
Return Value
Type: Double
 normalizedSliderValue scaled to the range 0.0 to MaximumValue, or NaN if it is out of range.
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace