RhinoCommon API
Transform2d.TryGetTransform2d Method (Transform, Double, Transform2d)
 Attempts to get the 2d transformation defined by the x and y rows and columns of a 4x4 transformation. This succeeds when transform is affine and maps the world xy plane to itself.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool TryGetTransform2d(
	Transform transform,
	double zeroTolerance,
	out Transform2d transform2d
)
Public Shared Function TryGetTransform2d (
	transform As Transform,
	zeroTolerance As Double,
	<OutAttribute> ByRef transform2d As Transform2d
) As Boolean
Parameters
transform
Type: Rhino.Geometry.Transform
The 4x4 transformation to convert.
zeroTolerance
Type: System.Double
A value of transform is "zero" if its absolute value is at most zeroTolerance, and is "one" if it differs from 1.0 by at most zeroTolerance.
transform2d
Type: Rhino.Geometry.Transform2d
The 2d transformation. This out reference will be assigned during this call.
Return Value
Type: Boolean
true on success. On failure transform2d is set to Transform2d.Nan.
See Also
Reference
Transform2d Structure
TryGetTransform2d Overload
Rhino.Geometry Namespace