RhinoCommon API
Brep.SplitDisjointPieces Method (Brep, List<Int32[]>)
 Separates, or splits, a disjoint Brep into separate Breps.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public static Brep[] SplitDisjointPieces(
	Brep brep,
	out List<int[]> indexMap
)
Public Shared Function SplitDisjointPieces (
	brep As Brep,
	<OutAttribute> ByRef indexMap As List(Of Integer())
) As Brep()
Parameters
brep
Type: Rhino.Geometry.Brep
The disjoint Brep to separate.
indexMap
Type: System.Collections.Generic.List<Int32[]>
 List of integer arrays, one for each result, containing all input Brep face indices that went into making each result. Note, this can be null.
Return Value
Type: Brep[]
An array of Brep pieces if successful, otherwise an empty array if the Brep is not disjoint or on error.
See Also
Reference
Brep Class
SplitDisjointPieces Overload
Rhino.Geometry Namespace