RhinoCommon API
Plane.UpdateEquation Method
 Update Equations
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool UpdateEquation()
Public Function UpdateEquation As Boolean
Return Value
Type: Boolean
 bool
See Also
Reference
Plane Structure
Rhino.Geometry Namespace