RhinoCommon API
DisplayPipeline.Close Method
 Closes the pipeline.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Close()
Public Function Close As Boolean
Return Value
Type: Boolean
True if the pipeline was closed, false if it was already closed or failed to close.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace