RhinoCommon API
ViewCaptureSettings.Finalize Method
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace