RhinoCommon API
File3dmInstanceDefinitionTable.FindName Method
 Finds an InstanceDefinitionGeometry given its name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public InstanceDefinitionGeometry FindName(
	string name
)
Public Function FindName (
	name As String
) As InstanceDefinitionGeometry
Parameters
name
Type: System.String
The name of the InstanceDefinitionGeometry to be searched.
Return Value
Type: InstanceDefinitionGeometry
An InstanceDefinitionGeometry, or null on error.
See Also
Reference
File3dmInstanceDefinitionTable Class
Rhino.FileIO Namespace