RhinoCommon API
RenderMaterial.FromMaterial Method
 Constructs a new material from a Material.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public static RenderMaterial FromMaterial(
	Material material,
	RhinoDoc doc
)
Public Shared Function FromMaterial (
	material As Material,
	doc As RhinoDoc
) As RenderMaterial
Parameters
material
Type: Rhino.DocObjects.Material
(optional)The material to create the material from.
doc
Type: Rhino.RhinoDoc
The document to associate this material with.
Return Value
Type: RenderMaterial
A new material - either a "Custom" material or a "Physically Based" material depending on the return value of material.IsPhysicallyBased.
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace