RhinoCommon API
CollapsibleSectionViewModel.UndoHelper Method
 Helper function to ease the use of undo records
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public UndoRecord UndoHelper(
	string description
)
Public Function UndoHelper (
	description As String
) As UndoRecord
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionViewModel.UndoHelper(System.String)"]
Return Value
Type: UndoRecord
Return the undo record
See Also
Reference
CollapsibleSectionViewModel Class
Rhino.UI.Controls Namespace