RhinoCommon API
PostEffect.ReadState Method
 Read the state. If your post effect has no state, you must still return true for success.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public abstract bool ReadState(
	PostEffectState state
)
Public MustOverride Function ReadState (
	state As PostEffectState
) As Boolean
Parameters
state
Type: Rhino.Render.PostEffects.PostEffectState
PostEffectState
Return Value
Type: Boolean
 Return true if successful, else false.
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace