RhinoCommon API
RenderMeshes.Finalize Method
 Finalizer for this collection
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RenderMeshes Class
Rhino.Render.CustomRenderMeshes Namespace