RhinoCommon API
MeshNgonList.NgonBoundaryVertexList Method
 Get an ngon's boundary points.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point3d[] NgonBoundaryVertexList(
	MeshNgon ngon,
	bool bAppendStartPoint
)
Public Function NgonBoundaryVertexList (
	ngon As MeshNgon,
	bAppendStartPoint As Boolean
) As Point3d()
Parameters
ngon
Type: Rhino.Geometry.MeshNgon
ngon.
bAppendStartPoint
Type: System.Boolean
If true, the first point in the list is also appended to the end of the list to create a closed polyline.
Return Value
Type: Point3d[]
A list of ngon boundary points.
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace