RhinoCommon API
SupportOptions.SetLibrariesInitialLocationCustomFolder Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetLibrariesInitialLocationCustomFolder(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_SetInitialLocationCustomFolder' instead")]
public static void SetLibrariesInitialLocationCustomFolder(
	string path
)
<ObsoleteAttribute("Use 'Libraries_SetInitialLocationCustomFolder' instead")>
Public Shared Sub SetLibrariesInitialLocationCustomFolder (
	path As String
)
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.Render.SupportOptions.SetLibrariesInitialLocationCustomFolder(System.String)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace