RhinoCommon API
RTree.CreateFromPointArray Method
 Constructs a new tree with an element for each point cloud point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RTree CreateFromPointArray(
	IEnumerable<Point3d> points
)
Public Shared Function CreateFromPointArray (
	points As IEnumerable(Of Point3d)
) As RTree
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points.
Return Value
Type: RTree
A new tree, or null on error.
See Also
Reference
RTree Class
Rhino.Geometry Namespace