RhinoCommon API
RenderWindow.ChannelGPU.Clone Method
 Return a clone of the channel.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RenderWindow.ChannelGPU Clone()
Public Function Clone As RenderWindow.ChannelGPU
Return Value
Type: RenderWindow.ChannelGPU
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.Clone"]
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace