RhinoCommon API
ViewportInfo.ZoomToScreenRect Method (Int32, Int32, Int32, Int32)
 Zooms to a screen zone.
View changing from screen input points. Handy for using a mouse to manipulate a view. ZoomToScreenRect() may change camera and frustum settings.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ZoomToScreenRect(
	int left,
	int top,
	int right,
	int bottom
)
Public Function ZoomToScreenRect (
	left As Integer,
	top As Integer,
	right As Integer,
	bottom As Integer
) As Boolean
Parameters
left
Type: System.Int32
Screen coordinate.
top
Type: System.Int32
Screen coordinate.
right
Type: System.Int32
Screen coordinate.
bottom
Type: System.Int32
Screen coordinate.
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
ZoomToScreenRect Overload
Rhino.DocObjects Namespace