RhinoCommon API
Line Constructor (Point3d, Vector3d)
 Constructs a new line segment from start point and span vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Line(
	Point3d start,
	Vector3d span
)
Public Sub New (
	start As Point3d,
	span As Vector3d
)
Parameters
start
Type: Rhino.Geometry.Point3d
Start point of line segment.
span
Type: Rhino.Geometry.Vector3d
Direction and length of line segment.
See Also
Reference
Line Structure
Line Overload
Rhino.Geometry Namespace