RhinoCommon API
ViewInfo Constructor (RhinoViewport)
 Access to the ViewInfo for given RhinoViewport
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ViewInfo(
	RhinoViewport rhinoViewPort
)
Public Sub New (
	rhinoViewPort As RhinoViewport
)
Parameters
rhinoViewPort
Type: Rhino.Display.RhinoViewport
[Missing <param name="rhinoViewPort"/> documentation for "M:Rhino.DocObjects.ViewInfo.#ctor(Rhino.Display.RhinoViewport)"]
See Also
Reference
ViewInfo Class
ViewInfo Overload
Rhino.DocObjects Namespace