RhinoCommon API
Surface.GetSurfaceParameterFromNurbsFormParameter Method
 Translates a parameter from a value on the surface returned by ToNurbsSurface() to the current surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GetSurfaceParameterFromNurbsFormParameter(
	double nurbsS,
	double nurbsT,
	out double surfaceS,
	out double surfaceT
)
Public Function GetSurfaceParameterFromNurbsFormParameter (
	nurbsS As Double,
	nurbsT As Double,
	<OutAttribute> ByRef surfaceS As Double,
	<OutAttribute> ByRef surfaceT As Double
) As Boolean
Parameters
nurbsS
Type: System.Double
The parameter in the S, or sometimes U, direction of the NURBS form surface.
nurbsT
Type: System.Double
The parameter in the T, or sometimes V, direction of the NURBS form surface.
surfaceS
Type: System.Double
S on this surface.
surfaceT
Type: System.Double
T o n this surface.
Return Value
Type: Boolean
True if the operation succeeded; otherwise, false.
See Also
Reference
Surface Class
Rhino.Geometry Namespace