RhinoCommon API
CustomRenderMeshProvider2.WillBuildCustomMeshes Method (ViewportInfo, RhinoObject, Guid, Boolean)
[Missing <summary> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.WillBuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public override bool WillBuildCustomMeshes(
	ViewportInfo vp,
	RhinoObject obj,
	Guid requestingPlugIn,
	bool preview
)
Public Overrides Function WillBuildCustomMeshes (
	vp As ViewportInfo,
	obj As RhinoObject,
	requestingPlugIn As Guid,
	preview As Boolean
) As Boolean
Parameters
vp
Type: Rhino.DocObjects.ViewportInfo
[Missing <param name="vp"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.WillBuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,System.Boolean)"]
obj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="obj"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.WillBuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,System.Boolean)"]
requestingPlugIn
Type: System.Guid
[Missing <param name="requestingPlugIn"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.WillBuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,System.Boolean)"]
preview
Type: System.Boolean
[Missing <param name="preview"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.WillBuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.WillBuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,System.Boolean)"]
See Also
Reference
CustomRenderMeshProvider2 Class
WillBuildCustomMeshes Overload
Rhino.Render Namespace