RhinoCommon API
SimpleArrayFloat Constructor (IEnumerable<Single>)
 Initializes a new SimpleArrayFloat class
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SimpleArrayFloat(
	IEnumerable<float> values
)
Public Sub New (
	values As IEnumerable(Of Single)
)
Parameters
values
Type: System.Collections.Generic.IEnumerable<Single>
initial set of integers to add to the array
See Also
Reference
SimpleArrayFloat Class
SimpleArrayFloat Overload
Rhino.Runtime.InteropWrappers Namespace