RhinoCommon API
IZooClientUtilities.GetOneLicenseStatus Method
 Returns the current status of a license for ui purposes
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
LicenseStatus GetOneLicenseStatus(
	Object verify,
	Guid productId
)
Function GetOneLicenseStatus (
	verify As Object,
	productId As Guid
) As LicenseStatus
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.GetOneLicenseStatus(System.Object,System.Guid)"]
productId
Type: System.Guid
[Missing <param name="productId"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.GetOneLicenseStatus(System.Object,System.Guid)"]
Return Value
Type: LicenseStatus
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.GetOneLicenseStatus(System.Object,System.Guid)"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace