RhinoCommon API
StringTable.SetString Method (String, String)
 Adds or sets a user data string to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string SetString(
	string key,
	string value
)
Public Function SetString (
	key As String,
	value As String
) As String
Parameters
key
Type: System.String
The key.
value
Type: System.String
The entry value.
Return Value
Type: String
 The previous value if successful and a previous value existed.
See Also
Reference
StringTable Class
SetString Overload
Rhino.DocObjects.Tables Namespace