RhinoCommon API
Arc Constructor (Point3d, Point3d, Point3d)
 Initializes a new arc through three points. If the points are coincident or co-linear, this will result in an Invalid arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Arc(
	Point3d startPoint,
	Point3d pointOnInterior,
	Point3d endPoint
)
Public Sub New (
	startPoint As Point3d,
	pointOnInterior As Point3d,
	endPoint As Point3d
)
Parameters
startPoint
Type: Rhino.Geometry.Point3d
Start point of arc.
pointOnInterior
Type: Rhino.Geometry.Point3d
Point on arc interior.
endPoint
Type: Rhino.Geometry.Point3d
End point of arc.
See Also
Reference
Arc Structure
Arc Overload
Rhino.Geometry Namespace