RhinoCommon API
RealtimeDisplayMode.HudRendererPaused Method
 Implement to support pausing and resuming in the viewport
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool HudRendererPaused()
Public Overridable Function HudRendererPaused As Boolean
Return Value
Type: Boolean
Return true if the render engine is paused.
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace