RhinoCommon API
FileReference.CreateFromFullPath Method
 Returns a new file reference. This returns a new instance even if the path does not exist.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static FileReference CreateFromFullPath(
	string fullPath
)
Public Shared Function CreateFromFullPath (
	fullPath As String
) As FileReference
Parameters
fullPath
Type: System.String
A full path.
Return Value
Type: FileReference
A file reference to the specified path.
See Also
Reference
FileReference Class
Rhino.FileIO Namespace