RhinoCommon API
Mesh.CreateQuickHull3D Method (PointCloud, List<Int32[]>)
 Attempts to create a 3d convex hull mesh from an input point cloud using the QuickHull algorithm, also returning the input points that make up each hull face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Mesh CreateQuickHull3D(
	PointCloud pointCloud,
	out List<int[]> indexMap
)
Public Shared Function CreateQuickHull3D (
	pointCloud As PointCloud,
	<OutAttribute> ByRef indexMap As List(Of Integer())
) As Mesh
Parameters
pointCloud
Type: Rhino.Geometry.PointCloud
The point cloud to be covered with the convex hull. At least four points are required, and they must not be coincident, colinear, or coplanar.
indexMap
Type: System.Collections.Generic.List<Int32[]>
 List of integer arrays, one for each hull face, containing the indices into the point cloud that make up that face. Note, this can be null.
Return Value
Type: Mesh
A valid mesh if successful. If there were too few input points, or the input was degenerate (coincident, colinear, or coplanar), the result is null.
See Also
Reference
Mesh Class
CreateQuickHull3D Overload
Rhino.Geometry Namespace