RhinoCommon API
HostUtils.DisplayOleAlerts Method
 Defines if Ole alerts ("Server busy") alerts should be visualized.
This function makes no sense on Mono.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void DisplayOleAlerts(
	bool display
)
Public Shared Sub DisplayOleAlerts (
	display As Boolean
)
Parameters
display
Type: System.Boolean
Whether alerts should be visible.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace