RhinoCommon API
GetPoint.GetPlanarConstraint Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetPoint.GetPlanarConstraint(Rhino.Display.RhinoViewport@,Rhino.Geometry.Plane@)"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GetPlanarConstraint(
	ref RhinoViewport vp,
	out Plane plane
)
Public Function GetPlanarConstraint (
	ByRef vp As RhinoViewport,
	<OutAttribute> ByRef plane As Plane
) As Boolean
Parameters
vp
Type: Rhino.Display.RhinoViewport
[Missing <param name="vp"/> documentation for "M:Rhino.Input.Custom.GetPoint.GetPlanarConstraint(Rhino.Display.RhinoViewport@,Rhino.Geometry.Plane@)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Input.Custom.GetPoint.GetPlanarConstraint(Rhino.Display.RhinoViewport@,Rhino.Geometry.Plane@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetPoint.GetPlanarConstraint(Rhino.Display.RhinoViewport@,Rhino.Geometry.Plane@)"]
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace