RhinoCommon API
File3dmNamedConstructionPlanes.FindName Method
 Finds a named construction plane given its name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ConstructionPlane FindName(
	string name
)
Public Function FindName (
	name As String
) As ConstructionPlane
Parameters
name
Type: System.String
The name of the construction plane to be searched.
Return Value
Type: ConstructionPlane
A ConstructionPlane, or null if not found.
See Also
Reference
File3dmNamedConstructionPlanes Class
Rhino.FileIO Namespace