RhinoCommon API
Intersection.CurveLine Method
 Intersects a curve and an infinite line.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static CurveIntersections CurveLine(
	Curve curve,
	Line line,
	double tolerance,
	double overlapTolerance
)
Public Shared Function CurveLine (
	curve As Curve,
	line As Line,
	tolerance As Double,
	overlapTolerance As Double
) As CurveIntersections
Parameters
curve
Type: Rhino.Geometry.Curve
Curve for intersection.
line
Type: Rhino.Geometry.Line
Infinite line to intersect.
tolerance
Type: System.Double
Intersection tolerance. If the curves approach each other to within tolerance, an intersection is assumed.
overlapTolerance
Type: System.Double
The tolerance with which the curves are tested.
Return Value
Type: CurveIntersections
A collection of intersection events.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace