RhinoCommon API
ArchivableDictionary.Remove Method
 Removes the value with the specified key from the dictionary.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Remove(
	string key
)
Public Function Remove (
	key As String
) As Boolean
Parameters
key
Type: System.String
The key of the element to remove.
Return Value
Type: Boolean
true if the element is successfully found and removed; otherwise, false. This method returns false if key is not found.
Implements
IDictionary<TKey, TValue>.Remove(TKey)
Exceptions
Exception | Condition
ArgumentNullException | Key is null.
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace