RhinoCommon API
UserInterfaceGrid.AddEmptyCell Method
 Append a cell with nothing in it. Use this to leave a hole in a row.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void AddEmptyCell()
Public Sub AddEmptyCell
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace