RhinoCommon API
SurfaceCurvature.KappaValue Method
 Calculate one of the four typical curvature values associated with the two principal curvatures and frequently used in false color curvature analysis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double KappaValue(
	CurvatureStyle curvatureStyle
)
Public Function KappaValue (
	curvatureStyle As CurvatureStyle
) As Double
Parameters
curvatureStyle
Type: Rhino.Geometry.CurvatureStyle
 Specifies which type curvature value to calculate from the principal curvatures. The Gausian curvature can be positive or negative. The other curvatures are unsigned.
Return Value
Type: Double
 If curvature style and the principal curvatures are valid, the specified type of curvature value is returned. Infinite radii are returned as RhinoMath.InfiniteRadius. Otherwise, the quiet NaN is returned.
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace