RhinoCommon API
MetaDataProxy.Finalize Method
 Destructor for MetaDataProxy
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
MetaDataProxy Class
Rhino.Render Namespace