RhinoCommon API
RhinoMath.EpsilonEquals Method (Single, Single, Single)
 Compare to floats for equality within some "epsilon" range
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public static bool EpsilonEquals(
	float x,
	float y,
	float epsilon
)
Public Shared Function EpsilonEquals (
	x As Single,
	y As Single,
	epsilon As Single
) As Boolean
Parameters
x
Type: System.Single
y
Type: System.Single
epsilon
Type: System.Single
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoMath.EpsilonEquals(System.Single,System.Single,System.Single)"]
See Also
Reference
RhinoMath Class
EpsilonEquals Overload
Rhino Namespace