RhinoCommon API
Material.Default Method
 Set material to default settings.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Default()
Public Sub Default
See Also
Reference
Material Class
Rhino.DocObjects Namespace