RhinoCommon API
PlugIn.OnShutdown Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.OnShutdown"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnShutdown()
Protected Overridable Sub OnShutdown
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace