RhinoCommon API
File3dmInstanceDefinitionTable.AddLinked Method
 Adds a linked instance definition to the instance definition table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.13
Syntax
public int AddLinked(
	string filename,
	string name,
	string description
)
Public Function AddLinked (
	filename As String,
	name As String,
	description As String
) As Integer
Parameters
filename
Type: System.String
Full path of the file to link.
name
Type: System.String
The definition name.
description
Type: System.String
The definition description.
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmInstanceDefinitionTable.AddLinked(System.String,System.String,System.String)"]
See Also
Reference
File3dmInstanceDefinitionTable Class
Rhino.FileIO Namespace