RhinoCommon API
WorksessionFileLayerOverride.GetWorksessionValues Method
Gets a copy of the layer's settings in the worksession.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFileLayerValues GetWorksessionValues()
Public Function GetWorksessionValues As WorksessionFileLayerValues
Return Value
Type: WorksessionFileLayerValues
A copy. Changes to it are kept only after SetWorksessionValues(WorksessionFileLayerValues).
See Also
Reference
WorksessionFileLayerOverride Class
Rhino.FileIO Namespace