RhinoCommon API
RenderMaterialTable.Find Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterialTable.Find(System.Guid)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RenderMaterial Find(
	Guid id
)
Public Function Find (
	id As Guid
) As RenderMaterial
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Render.RenderMaterialTable.Find(System.Guid)"]
Return Value
Type: RenderMaterial
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterialTable.Find(System.Guid)"]
See Also
Reference
RenderMaterialTable Class
Rhino.Render Namespace