RhinoCommon API
File3dm.ReadPreviewImage Method
 Attempts to read the preview image out of a 3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Bitmap ReadPreviewImage(
	string path
)
Public Shared Function ReadPreviewImage (
	path As String
) As Bitmap
Parameters
path
Type: System.String
The location of the file.
Return Value
Type: Bitmap
A bitmap, or null on failure.
Exceptions
Exception | Condition
FileNotFoundException | If the provided path is null, does not exist or cannot be accessed.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace