RhinoCommon API
Dialogs.ShowSelectLinetypeDialog Method
 Displays Rhino's single linetype selection dialog.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool ShowSelectLinetypeDialog(
	ref int linetypeIndex,
	bool displayByLayer
)
Public Shared Function ShowSelectLinetypeDialog (
	ByRef linetypeIndex As Integer,
	displayByLayer As Boolean
) As Boolean
Parameters
linetypeIndex
Type: System.Int32
 Initial linetype for the dialog, and will receive selected linetype if function returns true.
displayByLayer
Type: System.Boolean
Displays the "ByLayer" linetype in the list. Defaults to false.
Return Value
Type: Boolean
 True if the dialog was closed with the OK button. False if the dialog was closed with escape.
See Also
Reference
Dialogs Class
Rhino.UI Namespace