RhinoCommon API
FieldDictionary.Add Method (String, Color4f, String, Int32)
 Add a new Color4fField to the dictionary.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public Color4fField Add(
	string key,
	Color4f value,
	string prompt,
	int sectionId
)
Public Function Add (
	key As String,
	value As Color4f,
	prompt As String,
	sectionId As Integer
) As Color4fField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: Rhino.Display.Color4f
Initial value for this field.
prompt
Type: System.String
 Prompt to display in the user interface (Content Browsers) if this is null or an empty string the this field is a data only field and will not appear in the user interface.
sectionId
Type: System.Int32
The id of the section containing the field
Return Value
Type: Color4fField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Display.Color4f,System.String,System.Int32)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace