RhinoCommon API
Surface.IsExtrusion Method
Determines if the surface is a portion of an extrusion within RhinoMath.ZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsExtrusion()
Public Function IsExtrusion As Boolean
Return Value
Type: Boolean
true if the surface is an extrusion.
See Also
Reference
Surface Class
IsExtrusion Overload
Rhino.Geometry Namespace