RhinoCommon API
Extrusion.GetWireframe Method
 Constructs all the Wireframe curves for this Extrusion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public Curve[] GetWireframe()
Public Function GetWireframe As Curve()
Return Value
Type: Curve[]
An array of Wireframe curves.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace