RhinoCommon API
LightManagerSupport.PluginId Method
 The Guid of the plugin
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract Guid PluginId()
Public MustOverride Function PluginId As Guid
Return Value
Type: Guid
Returns the Guid of the plugin
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace