RhinoCommon API
FileCsvDocument.Set Method (Int32, Int32, Double, LengthUnit, DistanceDisplayMode, Int32)
 Sets the value of a cell to a double-precision number, formatted with FormatNumber(Double, LengthUnit, DistanceDisplayMode, Int32, Boolean). The unit system name is never appended to the field.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Set(
	int column,
	int row,
	double value,
	LengthUnit units,
	DistanceDisplayMode mode,
	int precision
)
Public Sub Set (
	column As Integer,
	row As Integer,
	value As Double,
	units As LengthUnit,
	mode As DistanceDisplayMode,
	precision As Integer
)
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.Double
The value to store.
units
Type: Rhino.LengthUnit
The length unit used to format the value.
mode
Type: Rhino.UI.DistanceDisplayMode
The distance display mode used to format the value.
precision
Type: System.Int32
The number of digits of precision.
See Also
Reference
FileCsvDocument Class
Set Overload
Rhino.FileIO Namespace