RhinoCommon API
Dialogs.ShowColorDialog Method (Object, Color4f, Boolean)
 Displays the standard modal color picker dialog for floating point colors.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool ShowColorDialog(
	Object parent,
	ref Color4f color,
	bool allowAlpha
)
Public Shared Function ShowColorDialog (
	parent As Object,
	ByRef color As Color4f,
	allowAlpha As Boolean
) As Boolean
Parameters
parent
Type: System.Object
Parent window for this dialog, should always pass this if calling from a form or user control.
color
Type: Rhino.Display.Color4f
The initial color to set the picker to and also accepts the user's choice.
allowAlpha
Type: System.Boolean
Specifies if the color picker should allow changes to the alpha channel or not.
Return Value
Type: Boolean
true if a color was picked, false if the user canceled the picker dialog.
See Also
Reference
Dialogs Class
ShowColorDialog Overload
Rhino.UI Namespace