RhinoCommon API
ObjRef.TextEntity Method
 Gets the text entity if the referenced geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public TextEntity TextEntity()
Public Function TextEntity As TextEntity
Return Value
Type: TextEntity
A text entity; or null if the referenced object is not a text entity, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace