RhinoCommon API
RhinoObject.GetTightBoundingBox Method (BoundingBox, Boolean, Transform)
 Get tight bounding box of this Rhino object. The Rhino object is not modified.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool GetTightBoundingBox(
	ref BoundingBox tightBox,
	bool growBox,
	Transform xform
)
Protected Overridable Function GetTightBoundingBox (
	ByRef tightBox As BoundingBox,
	growBox As Boolean,
	xform As Transform
) As Boolean
Parameters
tightBox
Type: Rhino.Geometry.BoundingBox
Beginning and resulting tight box
growBox
Type: System.Boolean
If true and the input tight_bbox is valid, then returned tight_bbox is the union of the input tight_bbox and the tight bounding box of this Rhino object.
xform
Type: Rhino.Geometry.Transform
 If useXform==true, the tight bounding box of the transformed Rhino object is calculated.
Return Value
Type: Boolean
true if the returned tight_bbox is set to a valid bounding box.
See Also
Reference
RhinoObject Class
GetTightBoundingBox Overload
Rhino.DocObjects Namespace