RhinoCommon API
RealtimeDisplayMode.GetRealtimeViewport Method (IntPtr)
 Retrieve RealtimeDisplayMode instance that the IntPtr refers to.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RealtimeDisplayMode GetRealtimeViewport(
	IntPtr realtimeViewport
)
Public Shared Function GetRealtimeViewport (
	realtimeViewport As IntPtr
) As RealtimeDisplayMode
Parameters
realtimeViewport
Type: System.IntPtr
IntPtr of the instance searched for. If the instance doesn't exist, a new one is created.
Return Value
Type: RealtimeDisplayMode
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetRealtimeViewport(System.IntPtr)"]
See Also
Reference
RealtimeDisplayMode Class
GetRealtimeViewport Overload
Rhino.Render Namespace