RhinoCommon API
Light Constructor
 Initializes a new light.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Light()
Public Sub New
See Also
Reference
Light Class
Light Overload
Rhino.Geometry Namespace