RhinoCommon API
FileReadOptions.Dispose Method
Releases all resources used by the FileReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
FileReadOptions Class
Dispose Overload
Rhino.FileIO Namespace