RhinoCommon API
RenderWindow.ChannelGPU.Dispose Method
 Dispose of the channel.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace