RhinoCommon API
PostEffectCollection Constructor (PostEffectCollection)
 Create a utility object not associated with any document from another object
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public PostEffectCollection(
	PostEffectCollection c
)
Public Sub New (
	c As PostEffectCollection
)
Parameters
c
Type: Rhino.Render.PostEffects.PostEffectCollection
The other collection.
See Also
Reference
PostEffectCollection Class
PostEffectCollection Overload
Rhino.Render.PostEffects Namespace