RhinoCommon API
PersistentSettings.GetColor Method (String, Color)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Drawing.Color)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color GetColor(
	string key,
	Color defaultValue
)
Public Function GetColor (
	key As String,
	defaultValue As Color
) As Color
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Drawing.Color)"]
defaultValue
Type: System.Drawing.Color
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Drawing.Color)"]
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Drawing.Color)"]
See Also
Reference
PersistentSettings Class
GetColor Overload
Rhino Namespace