RhinoCommon API
WorksessionFileLayerValues.Dispose Method
Releases the native layer settings.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
WorksessionFileLayerValues Class
Rhino.FileIO Namespace