RhinoCommon API
SimpleArrayPoint2d.NonConstPointer Method
 Gets the non-constant pointer (for modification) of this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public IntPtr NonConstPointer()
Public Function NonConstPointer As IntPtr
Return Value
Type: IntPtr
The non-constant pointer.
See Also
Reference
SimpleArrayPoint2d Class
Rhino.Runtime.InteropWrappers Namespace