RhinoCommon API
DisplayPipelineAttributes.SetFill Method (Color, Color, Color, Color)
 Set the fill mode to four color gradient and set the colors
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.23
Syntax
public void SetFill(
	Color gradientTopLeft,
	Color gradientBottomLeft,
	Color gradientTopRight,
	Color gradientBottomRight
)
Public Sub SetFill (
	gradientTopLeft As Color,
	gradientBottomLeft As Color,
	gradientTopRight As Color,
	gradientBottomRight As Color
)
Parameters
gradientTopLeft
Type: System.Drawing.Color
[Missing <param name="gradientTopLeft"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.SetFill(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)"]
gradientBottomLeft
Type: System.Drawing.Color
[Missing <param name="gradientBottomLeft"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.SetFill(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)"]
gradientTopRight
Type: System.Drawing.Color
[Missing <param name="gradientTopRight"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.SetFill(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)"]
gradientBottomRight
Type: System.Drawing.Color
[Missing <param name="gradientBottomRight"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.SetFill(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)"]
See Also
Reference
DisplayPipelineAttributes Class
SetFill Overload
Rhino.Display Namespace