RhinoCommon API
HatchPattern.GetDefaultHatchPatterns Method
 Gets Rhino default hatch patterns. These patterns are not in the document hatch pattern table.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static HatchPattern[] GetDefaultHatchPatterns()
Public Shared Function GetDefaultHatchPatterns As HatchPattern()
Return Value
Type: HatchPattern[]
An array of hatch patterns.
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace