RhinoCommon API
DisplayAttributeMaterial.SetTexture Method
 Assigns a texture, replacing any texture this material already has of the same type.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SetTexture(
	Texture texture,
	TextureType which
)
Public Function SetTexture (
	texture As Texture,
	which As TextureType
) As Boolean
Parameters
texture
Type: Rhino.DocObjects.Texture
The texture to assign.
which
Type: Rhino.DocObjects.TextureType
The texture type.
Return Value
Type: Boolean
true on success.
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace