RhinoCommon API
RdkEdit.Dispose Method
Releases all resources used by the RdkEdit
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RdkEdit Class
Rhino.Render.DataSources Namespace