RhinoCommon API
ContentUI.Dispose Method
Releases all resources used by the ContentUI
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ContentUI Class
Rhino.UI.Controls Namespace