RhinoCommon API
ViewTable.GetStandardRhinoViews Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ViewTable.GetStandardRhinoViews"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoView[] GetStandardRhinoViews()
Public Function GetStandardRhinoViews As RhinoView()
Return Value
Type: RhinoView[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ViewTable.GetStandardRhinoViews"]
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace