RhinoCommon API
RhinoGet.GetRectangleWithCounts Method (Int32, Int32, Int32, Int32, Boolean, Point3d[])
 Gets a 3d rectangle with prompts for counts in X and Y directions, and a SubDCorners option.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Result GetRectangleWithCounts(
	int xMin,
	ref int xCount,
	int yMin,
	ref int yCount,
	ref bool subDCorners,
	out Point3d[] corners
)
Public Shared Function GetRectangleWithCounts (
	xMin As Integer,
	ByRef xCount As Integer,
	yMin As Integer,
	ByRef yCount As Integer,
	ByRef subDCorners As Boolean,
	<OutAttribute> ByRef corners As Point3d()
) As Result
Parameters
xMin
Type: System.Int32
Minimum value allowed for count in the x direction.
xCount
Type: System.Int32
Count in the x direction.
yMin
Type: System.Int32
Minimum value allowed for count in the y direction.
yCount
Type: System.Int32
Count in the y direction.
subDCorners
Type: System.Boolean
Value of the SubDCorners option.
corners
Type: Rhino.Geometry.Point3d[]
corners of the rectangle in counter-clockwise order.
Return Value
Type: Result
Commands.Result.Success if successful.
See Also
Reference
RhinoGet Class
GetRectangleWithCounts Overload
Rhino.Input Namespace