RhinoCommon API
DisplayPipelineAttributes.SetDiagonalHatchEffect Method
 Set a diagonal hatch effect to make objects render with diagonal hatch with a given strength and width in pixels. The effect works by brightening and darkening pixels in a diagonal pattern.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetDiagonalHatchEffect(
	 in float hatchStrength,
	 in float hatchWidth
)
Public Sub SetDiagonalHatchEffect (
	 ByRef hatchStrength As Single,
	 ByRef hatchWidth As Single
)
Parameters
hatchStrength
Type: System.Single
The strength of the hatch effect (0..1).
hatchWidth
Type: System.Single
The width of the diagonal hatch in pixels (>= 0).
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace