RhinoCommon API
InstanceDefinitionGeometry Constructor
 Initializes a new block definition.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public InstanceDefinitionGeometry()
Public Sub New
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace