RhinoCommon API
InstanceDefinitionTable.PurgeUnused Method
 Purges any unused instance definitions.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PurgeUnused()
Public Function PurgeUnused As Integer
Return Value
Type: Int32
The number of unused instance definitions that were purged.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace