RhinoCommon API
Leader Constructor (SerializationInfo, StreamingContext)
 Protected serialization constructor for internal use.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Leader(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
Serialization data.
context
Type: System.Runtime.Serialization.StreamingContext
Serialization stream.
See Also
Reference
Leader Class
Leader Overload
Rhino.Geometry Namespace