RhinoCommon API
SubD.SharpEdgeCount Method (SubDEdgeSharpness)
 Gets the number of sharp edges in this SubD, and the range of sharpness values used.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public uint SharpEdgeCount(
	out SubDEdgeSharpness sharpnessRange
)
Public Function SharpEdgeCount (
	<OutAttribute> ByRef sharpnessRange As SubDEdgeSharpness
) As UInteger
Parameters
sharpnessRange
Type: Rhino.Geometry.SubDEdgeSharpness
 The smallest and largest sharpness found on the sharp edges. If there are no sharp edges, this is Smooth.
Return Value
Type: UInt32
The number of sharp edges.
See Also
Reference
SubD Class
SharpEdgeCount Overload
Rhino.Geometry Namespace