RhinoCommon API
StringParserSettings Constructor
Initializes a new instance of the StringParserSettings class
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public StringParserSettings()
Public Sub New
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace