RhinoCommon API
PostEffectCollection.Dispose Method
Releases all resources used by the PostEffectCollection
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PostEffectCollection Class
Rhino.Render.PostEffects Namespace