RhinoCommon API
UserInterfaceObjectBase.Unregister Method
 Unregister this object
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Unregister()
Public Sub Unregister
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace