RhinoCommon API
PostEffectExecutionControl.Dispose Method
Releases all resources used by the PostEffectExecutionControl
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PostEffectExecutionControl Class
Dispose Overload
Rhino.Render.PostEffects Namespace