RhinoCommon API
Surface.ShortPath Method
 Constructs a geodesic between 2 points, used by ShortPath command in Rhino.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Curve ShortPath(
	Point2d start,
	Point2d end,
	double tolerance
)
Public Function ShortPath (
	start As Point2d,
	end As Point2d,
	tolerance As Double
) As Curve
Parameters
start
Type: Rhino.Geometry.Point2d
start point of curve in parameter space. Points must be distinct in the domain of the surface.
end
Type: Rhino.Geometry.Point2d
end point of curve in parameter space. Points must be distinct in the domain of the surface.
tolerance
Type: System.Double
tolerance used in fitting discrete solution.
Return Value
Type: Curve
a geodesic curve on the surface on success. null on failure.
See Also
Reference
Surface Class
Rhino.Geometry Namespace