RhinoCommon API
AppearanceSettings.UsingDefaultDarkModeColors Method
 Determine if Rhino is running with default dark mode color settings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
public static bool UsingDefaultDarkModeColors()
Public Shared Function UsingDefaultDarkModeColors As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.AppearanceSettings.UsingDefaultDarkModeColors"]
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace