RhinoCommon API
RhinoViewport.MouseMagnify Method
 Moves the camera towards or away from the view.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool MouseMagnify(
	Point mousePreviousPoint,
	Point mouseCurrentPoint
)
Public Function MouseMagnify (
	mousePreviousPoint As Point,
	mouseCurrentPoint As Point
) As Boolean
Parameters
mousePreviousPoint
Type: System.Drawing.Point
The mouse previous point.
mouseCurrentPoint
Type: System.Drawing.Point
The mouse current point.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.MouseMagnify(System.Drawing.Point,System.Drawing.Point)"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace