RhinoCommon API
Decals.RemoveAllDecals Method
 Remove all the decals from the collection.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void RemoveAllDecals()
Public Sub RemoveAllDecals
See Also
Reference
Decals Class
Rhino.Render Namespace