RhinoCommon API
NotLicensedException Constructor
 Default constructor
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public NotLicensedException()
Public Sub New
See Also
Reference
NotLicensedException Class
NotLicensedException Overload
Rhino.Runtime Namespace