RhinoCommon API
GetBaseClass.SetOptionVaries Method
 Sets a command line option value to print "Varies" instead of the regular value.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetOptionVaries(
	int optionIndex,
	bool varies
)
Public Sub SetOptionVaries (
	optionIndex As Integer,
	varies As Boolean
)
Parameters
optionIndex
Type: System.Int32
The option index.
varies
Type: System.Boolean
True to print "Varies", false to print the option's current value.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace