RhinoCommon API
SubDDisplayParameters.AbsoluteDisplayDensityFromSubD Method
 Gets absolute SubD display density for subd.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static uint AbsoluteDisplayDensityFromSubD(
	uint adaptiveSubDDisplayDensity,
	SubD subd
)
Public Shared Function AbsoluteDisplayDensityFromSubD (
	adaptiveSubDDisplayDensity As UInteger,
	subd As SubD
) As UInteger
Parameters
adaptiveSubDDisplayDensity
Type: System.UInt32
 A value <= SubDDisplayParameters.Density.MaximumDensity. When in doubt, pass SubDDisplayParameters.Density.DefaultDensity.
subd
Type: Rhino.Geometry.SubD
 In the cases when the SubD in question is not available, like user interface code that applies in general and to unknown SubDs, pass SubD.Empty.
Return Value
Type: UInt32
 The absolute SubD display density is <= adaptiveSubDDisplayDensity and <= SubDDisplayParameters.Density.MaximumDensity.
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace