RhinoCommon API
MeshPrincipalCurvatureList.Clear Method
 Clears the principal curvature list on the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
IList.Clear()
See Also
Reference
MeshPrincipalCurvatureList Class
Rhino.Geometry.Collections Namespace