RhinoCommon API
PersistentSettingsConverter.IsStringList Method
 Determines if the string value is formatted as a string list.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool IsStringList(
	string s
)
Public Shared Function IsStringList (
	s As String
) As Boolean
Parameters
s
Type: System.String
String to check
Return Value
Type: Boolean
 Returns true if it is a XML string list otherwise return false.
See Also
Reference
PersistentSettingsConverter Class
Rhino Namespace