RhinoCommon API
GripUserInterfaceObject.Constrain Method (Circle)
[Missing <summary> documentation for "M:Rhino.UI.GripUserInterfaceObject.Constrain(Rhino.Geometry.Circle)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Constrain(
	Circle circle
)
Public Sub Constrain (
	circle As Circle
)
Parameters
circle
Type: Rhino.Geometry.Circle
[Missing <param name="circle"/> documentation for "M:Rhino.UI.GripUserInterfaceObject.Constrain(Rhino.Geometry.Circle)"]
See Also
Reference
GripUserInterfaceObject Class
Constrain Overload
Rhino.UI Namespace