RhinoCommon API
SupportOptions.MultithreadedTextureEvaluation Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.MultithreadedTextureEvaluation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool MultithreadedTextureEvaluation()
Public Shared Function MultithreadedTextureEvaluation As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.MultithreadedTextureEvaluation"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace