RhinoCommon API
ArchivableDictionary Constructor (SerializationInfo, StreamingContext)
 Protected constructor for internal use.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected ArchivableDictionary(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
Serialization data.
context
Type: System.Runtime.Serialization.StreamingContext
Serialization stream.
See Also
Reference
ArchivableDictionary Class
ArchivableDictionary Overload
Rhino.Collections Namespace