RhinoCommon API
Curve.FindLocalInflection Method
 Local minimization for point on a curve with tangent perpendicular to N.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool FindLocalInflection(
	Vector3d N,
	Interval subDomain,
	double seed,
	out double curveParameter,
	out double angleError
)
Public Function FindLocalInflection (
	N As Vector3d,
	subDomain As Interval,
	seed As Double,
	<OutAttribute> ByRef curveParameter As Double,
	<OutAttribute> ByRef angleError As Double
) As Boolean
Parameters
N
Type: Rhino.Geometry.Vector3d
 This vector and the curve tangent define a plane. In this plane, there is a vector V perpendicular to the tangent.
subDomain
Type: Rhino.Geometry.Interval
 Subdomain of curve to evaluate. This must not be empty.
seed
Type: System.Double
 A seed parameter, which must be included in the subdomain.
curveParameter
Type: System.Double
The parameter on the curve if successful, RhinoMath.UnsetValue if unsuccessful.
angleError
Type: System.Double
 The measure, in radians, of the angle between N and V. The angle will be zero when the result is an inflection.
Return Value
Type: Boolean
true if the minimization succeeds, regardless of angle_error, false if unsuccessful.
Remarks
 The algorithm minimizes the square of the dot product of N with the curve tangent. It is possible that the result will not be close to zero.
See Also
Reference
Curve Class
Rhino.Geometry Namespace