RhinoCommon API
Mesh.HealNakedEdges Method
 Attempts to "heal" naked edges in a mesh based on a given distance. First attempts to move vertices to neighboring vertices that are within that distance away. Then it finds edges that have a closest point to the vertex within the distance and splits the edge. When it finds one it splits the edge and makes two new edges using that point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool HealNakedEdges(
	double distance
)
Public Function HealNakedEdges (
	distance As Double
) As Boolean
Parameters
distance
Type: System.Double
Distance to not exceed when modifying the mesh.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace