RhinoCommon API
FileCsvDocument.TryGetBool Method (Int32, Int32, Boolean)
 Retrieves the value of a cell as a boolean. Recognizes "true"/"false", "yes"/"no", and "1"/"0" (case-insensitive, surrounding whitespace ignored).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetBool(
	int column,
	int row,
	out bool value
)
Public Function TryGetBool (
	column As Integer,
	row As Integer,
	<OutAttribute> ByRef value As Boolean
) As Boolean
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.Boolean
The parsed value, or false if the cell does not exist or cannot be parsed.
Return Value
Type: Boolean
true if the cell exists and was parsed; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetBool Overload
Rhino.FileIO Namespace