RhinoCommon API
BinaryArchiveWriter.WritePointF Method
 Writes a PointF value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WritePointF(
	PointF value
)
Public Sub WritePointF (
	value As PointF
)
Parameters
value
Type: System.Drawing.PointF
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace