RhinoCommon API
PostEffectCollection.PostEffectDataFromId Method
 Get a post effect data for an id.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public PostEffectData PostEffectDataFromId(
	Guid id
)
Public Function PostEffectDataFromId (
	id As Guid
) As PostEffectData
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.PostEffectDataFromId(System.Guid)"]
Return Value
Type: PostEffectData
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.PostEffectDataFromId(System.Guid)"]
See Also
Reference
PostEffectCollection Class
Rhino.Render.PostEffects Namespace