RhinoCommon API
PersistentSettings.SetPoint Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetPoint(System.String,System.Drawing.Point)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetPoint(
	string key,
	Point value
)
Public Sub SetPoint (
	key As String,
	value As Point
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetPoint(System.String,System.Drawing.Point)"]
value
Type: System.Drawing.Point
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetPoint(System.String,System.Drawing.Point)"]
See Also
Reference
PersistentSettings Class
Rhino Namespace