RhinoCommon API
PostEffectJob Constructor
Initializes a new instance of the PostEffectJob class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PostEffectJob()
Public Sub New
See Also
Reference
PostEffectJob Class
Rhino.Render.PostEffects Namespace