RhinoCommon API
RenderWindow.ChannelGPU.CopyTo Method
 Copy the channel to a 'CPU' channel.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void CopyTo(
	RenderWindow.Channel channel
)
Public Sub CopyTo (
	channel As RenderWindow.Channel
)
Parameters
channel
Type: Rhino.Render.RenderWindow.Channel
The channel to copy to.
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace