RhinoCommon API
LinetypeTable.Find Method (String)
Finds the linetype with a given name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Find(
	string name
)
Public Function Find (
	name As String
) As Integer
Parameters
name
Type: System.String
The name of the linetype to find. The search ignores case.
Return Value
Type: Int32
 If the linetype was found, the linetype index, >=0, is returned. If the linetype was not found, -1 is returned. Note, the linetype index of -1 denotes the default, or "Continuous" linetype.
See Also
Reference
LinetypeTable Class
Find Overload
Rhino.DocObjects.Tables Namespace