RhinoCommon API
RhinoApp.CommandLineTextWriter.Write Method (Char[], Int32, Int32)
 Writes a char buffer to the command line.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override void Write(
	char[] buffer,
	int index,
	int count
)
Public Overrides Sub Write (
	buffer As Char(),
	index As Integer,
	count As Integer
)
Parameters
buffer
Type: System.Char[]
[Missing <param name="buffer"/> documentation for "M:Rhino.RhinoApp.CommandLineTextWriter.Write(System.Char[],System.Int32,System.Int32)"]
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.RhinoApp.CommandLineTextWriter.Write(System.Char[],System.Int32,System.Int32)"]
count
Type: System.Int32
[Missing <param name="count"/> documentation for "M:Rhino.RhinoApp.CommandLineTextWriter.Write(System.Char[],System.Int32,System.Int32)"]
See Also
Reference
RhinoApp.CommandLineTextWriter Class
Write Overload
Rhino Namespace