RhinoCommon API
NurbsCurve.CreateNonRationalArcBezier Method
 Creates a non-rational approximation of a rational arc as a single bezier segment
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static NurbsCurve CreateNonRationalArcBezier(
	int degree,
	Point3d center,
	Point3d start,
	Point3d end,
	double radius,
	double tanSlider,
	double midSlider
)
Public Shared Function CreateNonRationalArcBezier (
	degree As Integer,
	center As Point3d,
	start As Point3d,
	end As Point3d,
	radius As Double,
	tanSlider As Double,
	midSlider As Double
) As NurbsCurve
Parameters
degree
Type: System.Int32
The degree of the non-rational approximation, can be either 3, 4, or 5
center
Type: Rhino.Geometry.Point3d
The arc center
start
Type: Rhino.Geometry.Point3d
A point in the direction of the start point of the arc
end
Type: Rhino.Geometry.Point3d
A point in the direction of the end point of the arc
radius
Type: System.Double
The radius of the arc
tanSlider
Type: System.Double
a number between zero and one which moves the tangent control point toward the mid control point of an equivalent quadratic rational arc
midSlider
Type: System.Double
a number between zero and one which moves the mid control points toward the mid control point of an equivalent quadratic rational arc
Return Value
Type: NurbsCurve
The approximated arc.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace