RhinoCommon API
AnnotationBase.GetBoundingBox Method (Transform)
 Aligned bounding box solver. Gets the world axis aligned bounding box for the transformed geometry.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public override BoundingBox GetBoundingBox(
	Transform xform
)
Public Overrides Function GetBoundingBox (
	xform As Transform
) As BoundingBox
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to apply to bounding box after calculation. The geometry is not modified.
Return Value
Type: BoundingBox
The bounding box of the transformed geometry in world coordinates or BoundingBox.Empty if not bounding box could be found.
See Also
Reference
AnnotationBase Class
GetBoundingBox Overload
Rhino.Geometry Namespace