RhinoCommon API
SnapShotsClient.ClientId Method
 The unique id of this client.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract Guid ClientId()
Public MustOverride Function ClientId As Guid
Return Value
Type: Guid
The unique id of this client.
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace