RhinoCommon API
RhinoDoc.GetUnitSystemName Method
[Missing <summary> documentation for "M:Rhino.RhinoDoc.GetUnitSystemName(System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetUnitSystemName(
	bool modelUnits,
	bool capitalize,
	bool singular,
	bool abbreviate
)
Public Function GetUnitSystemName (
	modelUnits As Boolean,
	capitalize As Boolean,
	singular As Boolean,
	abbreviate As Boolean
) As String
Parameters
modelUnits
Type: System.Boolean
[Missing <param name="modelUnits"/> documentation for "M:Rhino.RhinoDoc.GetUnitSystemName(System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
capitalize
Type: System.Boolean
[Missing <param name="capitalize"/> documentation for "M:Rhino.RhinoDoc.GetUnitSystemName(System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
singular
Type: System.Boolean
[Missing <param name="singular"/> documentation for "M:Rhino.RhinoDoc.GetUnitSystemName(System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
abbreviate
Type: System.Boolean
[Missing <param name="abbreviate"/> documentation for "M:Rhino.RhinoDoc.GetUnitSystemName(System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.RhinoDoc.GetUnitSystemName(System.Boolean,System.Boolean,System.Boolean,System.Boolean)"]
See Also
Reference
RhinoDoc Class
Rhino Namespace