RhinoCommon API
RhinoViewport.DeleteAllUserStrings Method
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.DeleteAllUserStrings"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public void DeleteAllUserStrings()
Public Sub DeleteAllUserStrings
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace