RhinoCommon API
Thumbnail.Label Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.Label"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Label()
Public Function Label As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.Label"]
Implements
IRhRdkThumbnail.Label()
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace