RhinoCommon API
CommandAliasList.Clear Method
Removes all aliases from the list.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void Clear()
Public Shared Sub Clear
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace