RhinoCommon API
RenderWindow.GetBitmap Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.GetBitmap"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Bitmap GetBitmap()
Public Function GetBitmap As Bitmap
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.GetBitmap"]
See Also
Reference
RenderWindow Class
Rhino.Render Namespace