RhinoCommon API
UserInterfaceObjectBase.OnDraw Method
 All user interface objects are drawn and can customize their look with the OnDraw function
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnDraw(
	DrawEventArgs args
)
Protected Overridable Sub OnDraw (
	args As DrawEventArgs
)
Parameters
args
Type: Rhino.Display.DrawEventArgs
[Missing <param name="args"/> documentation for "M:Rhino.UI.UserInterfaceObjectBase.OnDraw(Rhino.Display.DrawEventArgs)"]
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace