RhinoCommon API
BoundingBox.IsDisjoint Method (BoundingBox, Double)
 Determines whether this bounding box and another bounding box are disjoint, that is, whether they do not intersect, allowing a tolerance for the comparison.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsDisjoint(
	BoundingBox box,
	double tolerance
)
Public Function IsDisjoint (
	box As BoundingBox,
	tolerance As Double
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to test.
tolerance
Type: System.Double
Distance tolerance for the comparison.
When tolerance is positive, the boxes are considered to intersect (not disjoint) if the gap between them is less than or equal to tolerance. This is useful as a coarse pre-check when the boxes may be separated by numerical noise but the underlying geometry actually intersects within a working tolerance.
When tolerance is 0.0, the result is the same as IsDisjoint(box).
When tolerance is negative, the boxes must overlap by more than the absolute value of tolerance to be considered not disjoint.
Return Value
Type: Boolean
true if this bounding box and box are disjoint.
Remarks
 If either box is invalid, then true is returned.
See Also
Reference
BoundingBox Structure
IsDisjoint Overload
Rhino.Geometry Namespace