RhinoCommon API
ReplayHistoryResult.UpdateToInstanceReferenceGeometry Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToInstanceReferenceGeometry(Rhino.Geometry.InstanceReferenceGeometry,Rhino.DocObjects.ObjectAttributes)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.30
Syntax
public bool UpdateToInstanceReferenceGeometry(
	InstanceReferenceGeometry instanceReference,
	ObjectAttributes attributes
)
Public Function UpdateToInstanceReferenceGeometry (
	instanceReference As InstanceReferenceGeometry,
	attributes As ObjectAttributes
) As Boolean
Parameters
instanceReference
Type: Rhino.Geometry.InstanceReferenceGeometry
[Missing <param name="instanceReference"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToInstanceReferenceGeometry(Rhino.Geometry.InstanceReferenceGeometry,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToInstanceReferenceGeometry(Rhino.Geometry.InstanceReferenceGeometry,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToInstanceReferenceGeometry(Rhino.Geometry.InstanceReferenceGeometry,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace