RhinoCommon API
NurbsCurve.SetGrevillePoints Method
 Sets all Greville edit points for this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public bool SetGrevillePoints(
	IEnumerable<Point3d> points
)
Public Function SetGrevillePoints (
	points As IEnumerable(Of Point3d)
) As Boolean
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
 The new point locations. The number of points should match the number of point returned by NurbsCurve.GrevillePoints(false).
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace