RhinoCommon API
ClippingPlaneSurface.ViewportIds Method
 Returns the ids of RhinoViewport objects that are clipped by this clipping plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid[] ViewportIds()
Public Function ViewportIds As Guid()
Return Value
Type: Guid[]
The ids of RhinoViewport objects.
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace