RhinoCommon API
CurveKinkDefinition.IsKink Method
 True if there is a kink at curve(t).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsKink(
	Curve curve,
	double t
)
Public Function IsKink (
	curve As Curve,
	t As Double
) As Boolean
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.Geometry.CurveKinkDefinition.IsKink(Rhino.Geometry.Curve,System.Double)"]
t
Type: System.Double
[Missing <param name="t"/> documentation for "M:Rhino.Geometry.CurveKinkDefinition.IsKink(Rhino.Geometry.Curve,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.CurveKinkDefinition.IsKink(Rhino.Geometry.Curve,System.Double)"]
See Also
Reference
CurveKinkDefinition Class
Rhino.Geometry Namespace