RhinoCommon API
FileSettings.GetCurrentState Method
 Returns the current state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static FileSettingsState GetCurrentState()
Public Shared Function GetCurrentState As FileSettingsState
Return Value
Type: FileSettingsState
A new instance containing the current state.
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace