RhinoCommon API
OpenGLSettings.RestoreDefaults Method
 Updates from the default setting state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public static void RestoreDefaults()
Public Shared Sub RestoreDefaults
See Also
Reference
OpenGLSettings Class
Rhino.ApplicationSettings Namespace