RhinoCommon API
ArchivableDictionary.GetEnumValue<T> Method (String)
 Get an enum value from the dictionary using a custom key.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public T GetEnumValue<T>(
	string key
)
where T : struct, new(), IConvertible
Public Function GetEnumValue(Of T As {Structure, New, IConvertible}) (
	key As String
) As T
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetEnumValue``1(System.String)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetEnumValue``1(System.String)"]
Return Value
Type: T
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetEnumValue``1(System.String)"]
Exceptions
Exception | Condition
KeyNotFoundException | Thrown when the key is not found in the dictionary.
FormatException | Thrown when the string retrieved from the dictionary is not convertible to the enum type.
See Also
Reference
ArchivableDictionary Class
GetEnumValue Overload
Rhino.Collections Namespace