RhinoCommon API
LengthUnit.IsUnset Method
 Determines whether the specified value is Unset.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool IsUnset(
	 in LengthUnit unit
)
Public Shared Function IsUnset (
	 ByRef unit As LengthUnit
) As Boolean
Parameters
unit
Type: Rhino.LengthUnit
[Missing <param name="unit"/> documentation for "M:Rhino.LengthUnit.IsUnset(Rhino.LengthUnit@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.LengthUnit.IsUnset(Rhino.LengthUnit@)"]
See Also
Reference
LengthUnit Structure
Rhino Namespace