RhinoCommon API
Polyline Constructor
 Initializes a new empty polyline.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Polyline()
Public Sub New
See Also
Reference
Polyline Class
Polyline Overload
Rhino.Geometry Namespace