RhinoCommon API
RenderContentKindList Constructor
 Construct an empty kind list
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public RenderContentKindList()
Public Sub New
See Also
Reference
RenderContentKindList Class
RenderContentKindList Overload
Rhino.Render Namespace