RhinoCommon API
UserInterfaceGrid.SetColumnFlexibleWidth Method
 Have a column share the width the fixed and auto columns do not use. With one flexible column that column gets all of the remaining width; with more than one the remainder is divided in proportion to the weights.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetColumnFlexibleWidth(
	int column,
	double weight
)
Public Sub SetColumnFlexibleWidth (
	column As Integer,
	weight As Double
)
Parameters
column
Type: System.Int32
[Missing <param name="column"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetColumnFlexibleWidth(System.Int32,System.Double)"]
weight
Type: System.Double
[Missing <param name="weight"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetColumnFlexibleWidth(System.Int32,System.Double)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace