RhinoCommon API
Utilities.SafeFrameEnabled Method
 Queries whether or not the Safe Frame is visible.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool SafeFrameEnabled(
	RhinoDoc doc
)
Public Shared Function SafeFrameEnabled (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.Utilities.SafeFrameEnabled(Rhino.RhinoDoc)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.Utilities.SafeFrameEnabled(Rhino.RhinoDoc)"]
See Also
Reference
Utilities Class
Rhino.Render Namespace