RhinoCommon API
DisplayPipeline.DrawAnnotation Method (AnnotationBase, RhinoObject, Color)
 Draws an annotation geometry while evaluating any embedded text fields (e.g. %<Date>%, %<DocumentText("...")>%) against the supplied parent RhinoObject. Intended for preview conduits that draw a modified copy of an annotation's geometry while the user is editing it — the regular geometry-only overload skips field evaluation because it has no display cache to anchor to.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void DrawAnnotation(
	AnnotationBase annotation,
	RhinoObject parentObject,
	Color color
)
Public Sub DrawAnnotation (
	annotation As AnnotationBase,
	parentObject As RhinoObject,
	color As Color
)
Parameters
annotation
Type: Rhino.Geometry.AnnotationBase
[Missing <param name="annotation"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawAnnotation(Rhino.Geometry.AnnotationBase,Rhino.DocObjects.RhinoObject,System.Drawing.Color)"]
parentObject
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="parentObject"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawAnnotation(Rhino.Geometry.AnnotationBase,Rhino.DocObjects.RhinoObject,System.Drawing.Color)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawAnnotation(Rhino.Geometry.AnnotationBase,Rhino.DocObjects.RhinoObject,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
DrawAnnotation Overload
Rhino.Display Namespace