RhinoCommon API
ConvertibleExtensions.ToVector2d Method
[Missing <summary> documentation for "M:Rhino.Render.ConvertibleExtensions.ToVector2d(System.IConvertible)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Vector2d ToVector2d(
	this IConvertible variant
)
<ExtensionAttribute>
Public Shared Function ToVector2d (
	variant As IConvertible
) As Vector2d
Parameters
variant
Type: System.IConvertible
[Missing <param name="variant"/> documentation for "M:Rhino.Render.ConvertibleExtensions.ToVector2d(System.IConvertible)"]
Return Value
Type: Vector2d
[Missing <returns> documentation for "M:Rhino.Render.ConvertibleExtensions.ToVector2d(System.IConvertible)"]
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type IConvertible. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ConvertibleExtensions Class
Rhino.Render Namespace