RhinoCommon API
RhinoList<T>.GetEnumerator Method
 Constructs an enumerator that is capable of iterating over all items in this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<T> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of T)
Return Value
Type: IEnumerator<T>
The new enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace