RhinoCommon API
MeshVertexNormalList.UnitizeNormals Method
 Unitizes all vertex normals.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool UnitizeNormals()
Public Function UnitizeNormals As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace