RhinoCommon API
LinetypeTable.GetUnusedLinetypeName Method (Boolean)
Note: This API is now obsolete.
 Obsolete. Use the other overload. Gets unused linetype name used as default when creating new linetypes.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("ignoreDeleted is now ignored. Items are removed permanently now. Remove the second method argument.")]
public string GetUnusedLinetypeName(
	bool ignoreDeleted
)
<ObsoleteAttribute("ignoreDeleted is now ignored. Items are removed permanently now. Remove the second method argument.")>
Public Function GetUnusedLinetypeName (
	ignoreDeleted As Boolean
) As String
Parameters
ignoreDeleted
Type: System.Boolean
 If this is true then a name used by a deleted linetype is allowed.
Return Value
Type: String
The unused linetype name.
See Also
Reference
LinetypeTable Class
GetUnusedLinetypeName Overload
Rhino.DocObjects.Tables Namespace