RhinoCommon API
ObjectPropertiesPageEventArgs Constructor
 Used by ObjectPropertiesPage to notify the page when updating, modifying or determining if the page should be included in the navigation bar
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ObjectPropertiesPageEventArgs(
	ObjectPropertiesPage page
)
Public Sub New (
	page As ObjectPropertiesPage
)
Parameters
page
Type: Rhino.UI.ObjectPropertiesPage
 Page sending the message
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace