RhinoCommon API
SubD.DissolveOrDeleteComponents Method (IEnumerable<SubDComponent>)
 Dissolves the given edges and vertices, merging the faces around them, and deletes the given faces.
 This is the difference between removing an edge between two quads to get one bigger face, and removing the two quads to leave a hole. Use DeleteComponents(IEnumerable<SubDComponent>, Boolean) when a hole is what you want.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public uint DissolveOrDeleteComponents(
	IEnumerable<SubDComponent> components
)
Public Function DissolveOrDeleteComponents (
	components As IEnumerable(Of SubDComponent)
) As UInteger
Parameters
components
Type: System.Collections.Generic.IEnumerable<SubDComponent>
The vertices, edges and faces to dissolve or delete.
Return Value
Type: UInt32
The number of merged faces created by dissolving edges and vertices.
See Also
Reference
SubD Class
DissolveOrDeleteComponents Overload
Rhino.Geometry Namespace