RhinoCommon API
DisplayPoint Constructor
Initializes a new instance of the DisplayPoint class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public DisplayPoint(
	Point3d location
)
Public Sub New (
	location As Point3d
)
Parameters
location
Type: Rhino.Geometry.Point3d
[Missing <param name="location"/> documentation for "M:Rhino.Display.DisplayPoint.#ctor(Rhino.Geometry.Point3d)"]
See Also
Reference
DisplayPoint Class
Rhino.Display Namespace