RhinoCommon API
Curve.Repair Method
 Repairs a curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public bool Repair(
	double tolerance
)
Public Function Repair (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
The repair tolerance.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
Curve Class
Rhino.Geometry Namespace