RhinoCommon API
Linetype.AddShape Method (TextEntity, Double)
 Add text as a shape to this linetype definition
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool AddShape(
	TextEntity text,
	double offset
)
Public Function AddShape (
	text As TextEntity,
	offset As Double
) As Boolean
Parameters
text
Type: Rhino.Geometry.TextEntity
[Missing <param name="text"/> documentation for "M:Rhino.DocObjects.Linetype.AddShape(Rhino.Geometry.TextEntity,System.Double)"]
offset
Type: System.Double
[Missing <param name="offset"/> documentation for "M:Rhino.DocObjects.Linetype.AddShape(Rhino.Geometry.TextEntity,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Linetype.AddShape(Rhino.Geometry.TextEntity,System.Double)"]
See Also
Reference
Linetype Class
AddShape Overload
Rhino.DocObjects Namespace