RhinoCommon API
FileVda.Write Method
Write a Vda file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	FileVdaWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As FileVdaWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileVdaWriteOptions
options used for generating the Vda file
Return Value
Type: Boolean
true on success
See Also
Reference
FileVda Class
Rhino.FileIO Namespace