RhinoCommon API
File3dmShutLining.SetCurveProfile Method
 Sets the profile of the shut-line for the given curve.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetCurveProfile(
	Guid curve_id,
	int profile
)
Public Sub SetCurveProfile (
	curve_id As Guid,
	profile As Integer
)
Parameters
curve_id
Type: System.Guid
[Missing <param name="curve_id"/> documentation for "M:Rhino.FileIO.File3dmShutLining.SetCurveProfile(System.Guid,System.Int32)"]
profile
Type: System.Int32
[Missing <param name="profile"/> documentation for "M:Rhino.FileIO.File3dmShutLining.SetCurveProfile(System.Guid,System.Int32)"]
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace