RhinoCommon API
Curve.RebuildToMatchTemplateCurve Method
 Rebuilds this curve so it takes on the degree, knot vector, and control point count of a template curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public NurbsCurve RebuildToMatchTemplateCurve(
	Curve templateCurve,
	bool flipSourceDirection,
	bool preserveEndTangents,
	bool makeSubDFriendly,
	out Line maximumDeviation
)
Public Function RebuildToMatchTemplateCurve (
	templateCurve As Curve,
	flipSourceDirection As Boolean,
	preserveEndTangents As Boolean,
	makeSubDFriendly As Boolean,
	<OutAttribute> ByRef maximumDeviation As Line
) As NurbsCurve
Parameters
templateCurve
Type: Rhino.Geometry.Curve
The curve to match.
flipSourceDirection
Type: System.Boolean
 If true and this curve is open, its direction is flipped (reversed) before sampling. Set this when this curve runs opposite the template.
preserveEndTangents
Type: System.Boolean
 If true and the result is open with at least 4 control points, the interior end control points are adjusted so the result's end tangents match this curve's.
makeSubDFriendly
Type: System.Boolean
If true, the result is converted to a SubD friendly curve.
maximumDeviation
Type: Rhino.Geometry.Line
 A line from this curve to the rebuilt curve at the point of maximum separation (the "from" point is on this curve, the "to" point is on the rebuilt curve), or Line.Unset if it cannot be computed.
Return Value
Type: NurbsCurve
The rebuilt NURBS curve, or null if the template curve is unusable or the rebuild fails.
See Also
Reference
Curve Class
Rhino.Geometry Namespace