RhinoCommon API
Cylinder Constructor (Circle)
 Constructs a new cylinder with infinite height.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Cylinder(
	Circle baseCircle
)
Public Sub New (
	baseCircle As Circle
)
Parameters
baseCircle
Type: Rhino.Geometry.Circle
Base circle for infinite cylinder.
See Also
Reference
Cylinder Structure
Cylinder Overload
Rhino.Geometry Namespace