RhinoCommon API
UserInterfaceTextBox Constructor
Initializes a new instance of the UserInterfaceTextBox class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceTextBox()
Public Sub New
See Also
Reference
UserInterfaceTextBox Class
UserInterfaceTextBox Overload
Rhino.UI Namespace