RhinoCommon API
Interval.MakeIncreasing Method
 Ensures this Interval is either singleton or increasing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void MakeIncreasing()
Public Sub MakeIncreasing
See Also
Reference
Interval Structure
Rhino.Geometry Namespace