RhinoCommon API
HiddenLineDrawingParameters.AddGeometryAndPlanes Method (GeometryBase, Object, List<Plane>)
 Add geometry and its active clipping planes to be included in the calculation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AddGeometryAndPlanes(
	GeometryBase geometry,
	Object tag,
	List<Plane> clips
)
Public Function AddGeometryAndPlanes (
	geometry As GeometryBase,
	tag As Object,
	clips As List(Of Plane)
) As Boolean
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
 Currently only points, point clouds, curves, meshes, breps, surfaces, and extrusions are supported
tag
Type: System.Object
arbitrary data to be associated with this geometry
clips
Type: System.Collections.Generic.List<Plane>
Active clipping planes for this object
Return Value
Type: Boolean
 true if the type of geometry can be added for calculations. Currently only points, point clouds, curves, meshes, breps, surfaces, and extrusions are supported
See Also
Reference
HiddenLineDrawingParameters Class
AddGeometryAndPlanes Overload
Rhino.Geometry Namespace