RhinoCommon API
PageViewGroupTable.Add Method (PageViewGroup)
 Adds a new page view group to the table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Add(
	PageViewGroup group
)
Public Function Add (
	group As PageViewGroup
) As Integer
Parameters
group
Type: Rhino.DocObjects.PageViewGroup
 The page view group to add. The information in the page view group is copied. If group.Name is empty a unique name will be used.
Return Value
Type: Int32
Index of new page view group if successful, -1 otherwise.
See Also
Reference
PageViewGroupTable Class
Add Overload
Rhino.DocObjects.Tables Namespace