RhinoCommon API
IRhinoUiDialogService.ShowPropertyListBox Method (String, String, List<KeyValuePair<String, String>>)
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPropertyListBox(System.String,System.String,System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.String,System.String}})"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
string[] ShowPropertyListBox(
	string title,
	string message,
	List<KeyValuePair<string, string>> items
)
Function ShowPropertyListBox (
	title As String,
	message As String,
	items As List(Of KeyValuePair(Of String, String))
) As String()
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPropertyListBox(System.String,System.String,System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.String,System.String}})"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPropertyListBox(System.String,System.String,System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.String,System.String}})"]
items
Type: System.Collections.Generic.List<KeyValuePair<String, String>>
[Missing <param name="items"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPropertyListBox(System.String,System.String,System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.String,System.String}})"]
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPropertyListBox(System.String,System.String,System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.String,System.String}})"]
See Also
Reference
IRhinoUiDialogService Interface
ShowPropertyListBox Overload
Rhino.UI Namespace