RhinoCommon API
Extrusion Constructor
 Initializes a new instance of the Extrusion class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Extrusion()
Public Sub New
See Also
Reference
Extrusion Class
Extrusion Overload
Rhino.Geometry Namespace