RhinoCommon API
ToolbarFile.GetGroup Method (Int32)
 Gets a toolbar group.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ToolbarGroup GetGroup(
	int index
)
Public Function GetGroup (
	index As Integer
) As ToolbarGroup
Parameters
index
Type: System.Int32
The index of the toolbar group.
Return Value
Type: ToolbarGroup
The toolbar group if successful, null otherwise.
See Also
Reference
ToolbarFile Class
GetGroup Overload
Rhino.UI Namespace