RhinoCommon API
ChangeQueue.NotifyBeginUpdates Method
 Override this when you want to be notified of begin of changes
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void NotifyBeginUpdates()
Protected Overridable Sub NotifyBeginUpdates
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace