RhinoCommon API
ViewCaptureSettings.CreatePreviewSettings Method
 Create a ViewCaptureSettings based on this instance, but scaled to fit in a different sized area. Scaling is also performed on dpi. This is primarily used to for capturing images that are shown as print previews
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public ViewCaptureSettings CreatePreviewSettings(
	Size size
)
Public Function CreatePreviewSettings (
	size As Size
) As ViewCaptureSettings
Parameters
size
Type: System.Drawing.Size
[Missing <param name="size"/> documentation for "M:Rhino.Display.ViewCaptureSettings.CreatePreviewSettings(System.Drawing.Size)"]
Return Value
Type: ViewCaptureSettings
 new ViewCaptureSettings instance on success. Null on failure
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace