RhinoCommon API
SubD.EvaluateCurvature Method (SubDComponentParameter, SurfaceCurvature)
 Evaluates the curvature of a point on this SubD's surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool EvaluateCurvature(
	SubDComponentParameter parameter,
	out SurfaceCurvature curvature
)
Public Function EvaluateCurvature (
	parameter As SubDComponentParameter,
	<OutAttribute> ByRef curvature As SurfaceCurvature
) As Boolean
Parameters
parameter
Type: Rhino.Geometry.SubDComponentParameter
The parameter to evaluate.
curvature
Type: Rhino.Geometry.SurfaceCurvature
 The surface curvature is returned here, or null if this fails.
Return Value
Type: Boolean
True if the evaluation succeeded.
Remarks
 Unlike the overload that returns the two principal curvature values, this one also reports their directions. See CreateFromSubD(SubD, SubDComponentParameter) for when the curvature exists.
See Also
Reference
SubD Class
EvaluateCurvature Overload
Rhino.Geometry Namespace