RhinoCommon API
SubDEdgeChain.AddOneNeighbor Method
 Extends the chain by one edge at one or both ends.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public uint AddOneNeighbor(
	ChainDirection direction,
	SubDChainType chainType
)
Public Function AddOneNeighbor (
	direction As ChainDirection,
	chainType As SubDChainType
) As UInteger
Parameters
direction
Type: Rhino.Geometry.ChainDirection
Which end or ends to extend.
chainType
Type: Rhino.Geometry.SubDChainType
Which edges and vertices the chain is allowed through.
Return Value
Type: UInt32
The number of edges that were added.
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace