RhinoCommon API
Quaternion.Product Method
 The quaternion product of p and q. This is the same value as p*q.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Quaternion Product(
	Quaternion p,
	Quaternion q
)
Public Shared Function Product (
	p As Quaternion,
	q As Quaternion
) As Quaternion
Parameters
p
Type: Rhino.Geometry.Quaternion
The first transform.
q
Type: Rhino.Geometry.Quaternion
The second transform.
Return Value
Type: Quaternion
A transform value.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace