RhinoCommon API
ArchivableDictionary.GetFloat Method (String)
 Get value as float, will only succeed if value was created using Set(string key, float value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public float GetFloat(
	string key
)
Public Function GetFloat (
	key As String
) As Single
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetFloat(System.String)"]
Return Value
Type: Single
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetFloat(System.String)"]
See Also
Reference
ArchivableDictionary Class
GetFloat Overload
Rhino.Collections Namespace