RhinoCommon API
BrepVertex.EdgeIndices Method
 Gets the indices of all edges associated with this vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.12
Syntax
public int[] EdgeIndices()
Public Function EdgeIndices As Integer()
Return Value
Type: Int32[]
Empty array on failure.
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace