RhinoCommon API
SubDEdge.RelativeVertexAt Method
 Gets one of this edge's two vertices, relative to the direction this edge is referenced with.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDVertex RelativeVertexAt(
	int endIndex
)
Public Function RelativeVertexAt (
	endIndex As Integer
) As SubDVertex
Parameters
endIndex
Type: System.Int32
0 for the start of the edge, 1 for the end.
Return Value
Type: SubDVertex
The vertex, or null if endIndex is out of range.
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace