RhinoCommon API
HatchPattern.RemoveAllHatchLines Method
 Remove all of the hatch line from the pattern.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void RemoveAllHatchLines()
Public Sub RemoveAllHatchLines
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace