RhinoCommon API
SubDFaceList.Find Method (Int32)
 Find a face in this SubD with a given id
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDFace Find(
	int id
)
Public Function Find (
	id As Integer
) As SubDFace
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.Geometry.Collections.SubDFaceList.Find(System.Int32)"]
Return Value
Type: SubDFace
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDFaceList.Find(System.Int32)"]
See Also
Reference
SubDFaceList Class
Find Overload
Rhino.Geometry.Collections Namespace