RhinoCommon API
Analytics.Send Method (String, String, String)
 Sends a Google Analytics event using the Measurement Protocol. See https://developers.google.com/analytics/devguides/collection/protocol/v1/devguide#event for details.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Send(
	string Category,
	string Action,
	string Label
)
Public Sub Send (
	Category As String,
	Action As String,
	Label As String
)
Parameters
Category
Type: System.String
Event category. We use the feature or subsystem, such as "installer" or "app" or "document" or "loft". Maps to the Google Analytics parameter "ec".
Action
Type: System.String
Event action. A verb: "open" or "start" or "option" Maps to the Google Analytics parameter "ea".
Label
Type: System.String
Event label. Maps to the Google Analytics parameter "el".
See Also
Reference
Analytics Class
Send Overload
Rhino.Runtime Namespace