RhinoCommon API
Linetype.DeleteAllUserStrings Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Linetype.DeleteAllUserStrings"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public void DeleteAllUserStrings()
Public Sub DeleteAllUserStrings
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace