RhinoCommon API
SimpleArrayIntPtr Constructor
 Initializes a new SimpleArrayIntPtr class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public SimpleArrayIntPtr()
Public Sub New
See Also
Reference
SimpleArrayIntPtr Class
Rhino.Runtime.InteropWrappers Namespace