RhinoCommon API
PersistentSettings.GetColor Method (String, Nullable<Color>, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Nullable{System.Drawing.Color},System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color? GetColor(
	string key,
	Color? defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetColor (
	key As String,
	defaultValue As Color?,
	legacyKeyList As IEnumerable(Of String)
) As Color?
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Nullable{System.Drawing.Color},System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.Nullable<Color>
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Nullable{System.Drawing.Color},System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Nullable{System.Drawing.Color},System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Nullable<Color>
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Nullable{System.Drawing.Color},System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetColor Overload
Rhino Namespace