RhinoCommon API
HostUtils.GetSystemProcessorCount Method
 Get the processor count on this hardware. It supports querying on CPUs with more than 64 processors (Windows).
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
public static int GetSystemProcessorCount()
Public Shared Function GetSystemProcessorCount As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.GetSystemProcessorCount"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace