RhinoCommon API
ObjectAttributes.RemoveCustomSectionStyle Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.RemoveCustomSectionStyle"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void RemoveCustomSectionStyle()
Public Sub RemoveCustomSectionStyle
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace