RhinoCommon API
SubDEdge.ComponentIndex Method
 Gets the component index of this edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public ComponentIndex ComponentIndex()
Public Function ComponentIndex As ComponentIndex
Return Value
Type: ComponentIndex
The component index.
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace