RhinoCommon API
Transform.Rotation Method (Vector3d, Vector3d, Point3d)
 Constructs a new rotation transformation with start and end directions and rotation center.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Transform Rotation(
	Vector3d startDirection,
	Vector3d endDirection,
	Point3d rotationCenter
)
Public Shared Function Rotation (
	startDirection As Vector3d,
	endDirection As Vector3d,
	rotationCenter As Point3d
) As Transform
Parameters
startDirection
Type: Rhino.Geometry.Vector3d
A start direction.
endDirection
Type: Rhino.Geometry.Vector3d
An end direction.
rotationCenter
Type: Rhino.Geometry.Point3d
3D center of rotation.
Return Value
Type: Transform
A rotation transformation matrix.
See Also
Reference
Transform Structure
Rotation Overload
Rhino.Geometry Namespace