RhinoCommon API
ViewportInfo.DollyExtents Method (IEnumerable<GeometryBase>, Double)
 Dolly the camera location and so that the view frustum contains all of the document objects that can be seen in view. If the projection is perspective, the camera angle is not changed.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public bool DollyExtents(
	IEnumerable<GeometryBase> geometry,
	double border
)
Public Function DollyExtents (
	geometry As IEnumerable(Of GeometryBase),
	border As Double
) As Boolean
Parameters
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
[Missing <param name="geometry"/> documentation for "M:Rhino.DocObjects.ViewportInfo.DollyExtents(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Double)"]
border
Type: System.Double
 If border > 1.0, then the frustum is enlarged by this factor to provide a border around the view. If 0.0 < border < 1.0, then the frustum is shrunk by this factor and the objects will extend past the edges of the view. A border of 0.0 or 1.0 adds no border. 1.1 works well for parallel projections; 0.0 is suggested for perspective projections.
Return Value
Type: Boolean
True if successful.
See Also
Reference
ViewportInfo Class
DollyExtents Overload
Rhino.DocObjects Namespace