RhinoCommon API
PostEffectCollection.MovePostEffectBefore Method
 Move a post effect before another post effect in the list. Param 'id_move' is the id of the post effect to move. Param 'id_before' is the id of a post effect before which the post effect should be moved. If this is Guid.Empty, the post effect is moved to the end of the list. If the post effect identified by 'id_before' is not found, the method will fail. Returns true if successful, else false.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool MovePostEffectBefore(
	Guid id_move,
	Guid id_before
)
Public Function MovePostEffectBefore (
	id_move As Guid,
	id_before As Guid
) As Boolean
Parameters
id_move
Type: System.Guid
[Missing <param name="id_move"/> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.MovePostEffectBefore(System.Guid,System.Guid)"]
id_before
Type: System.Guid
[Missing <param name="id_before"/> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.MovePostEffectBefore(System.Guid,System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.MovePostEffectBefore(System.Guid,System.Guid)"]
See Also
Reference
PostEffectCollection Class
Rhino.Render.PostEffects Namespace