RhinoCommon API
TextFields.CurveLength Method (String, String)
 Get length of a curve given a string id in a specified unit system. UnitSystem enumeration as string
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static double CurveLength(
	string id,
	string unitSystem
)
Public Shared Function CurveLength (
	id As String,
	unitSystem As String
) As Double
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.CurveLength(System.String,System.String)"]
unitSystem
Type: System.String
[Missing <param name="unitSystem"/> documentation for "M:Rhino.Runtime.TextFields.CurveLength(System.String,System.String)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.CurveLength(System.String,System.String)"]
See Also
Reference
TextFields Class
CurveLength Overload
Rhino.Runtime Namespace