RhinoCommon API
Curve.CreateRevisionCloud Method (IEnumerable<Point3d>, Double, Boolean)
 Creates a revision cloud curve from points that make up a planar polyline.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static Curve CreateRevisionCloud(
	IEnumerable<Point3d> points,
	double angle,
	bool flip
)
Public Shared Function CreateRevisionCloud (
	points As IEnumerable(Of Point3d),
	angle As Double,
	flip As Boolean
) As Curve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
The input points.
angle
Type: System.Double
 The angle in radians, between PI/2.0 and PI radians (90 and 180 degrees). This angle indicates the amount of bulge in the segments.
flip
Type: System.Boolean
The arc segments in output revision cloud curve will be in the opposite direction to the input curve.
Return Value
Type: Curve
A revision cloud curve is successful, false otherwise.
See Also
Reference
Curve Class
CreateRevisionCloud Overload
Rhino.Geometry Namespace