RhinoCommon API
UserDataList.Add Method
 If the user-data is already in a different UserDataList, it will be removed from that list and added to this list.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Add(
	UserData userdata
)
Public Function Add (
	userdata As UserData
) As Boolean
Parameters
userdata
Type: Rhino.DocObjects.Custom.UserData
Data element.
Return Value
Type: Boolean
Whether this operation succeeded.
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace