RhinoCommon API
SupportOptions.SetLastNavigatedLocation Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetLastNavigatedLocation(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
[ObsoleteAttribute("Use Libraries_SetLastNavigatedLocation or FileExplorer_SetLastNavigatedLocation")]
public static void SetLastNavigatedLocation(
	string folder
)
<ObsoleteAttribute("Use Libraries_SetLastNavigatedLocation or FileExplorer_SetLastNavigatedLocation")>
Public Shared Sub SetLastNavigatedLocation (
	folder As String
)
Parameters
folder
Type: System.String
[Missing <param name="folder"/> documentation for "M:Rhino.Render.SupportOptions.SetLastNavigatedLocation(System.String)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace