RhinoCommon API
UserInterfaceCheckBox.OnCheckedChanged Method
 Called after a click has changed the state. A click turns an indeterminate check box on. The default implementation raises the CheckedChanged event.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnCheckedChanged()
Protected Overridable Sub OnCheckedChanged
See Also
Reference
UserInterfaceCheckBox Class
Rhino.UI Namespace