RhinoCommon API
UserInterfaceTextBox.TakeKeyboardFocus Method
 Give this text box keyboard focus, as clicking it does
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void TakeKeyboardFocus(
	RhinoDoc doc
)
Public Sub TakeKeyboardFocus (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
Document to redraw. This can be null.
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace