RhinoCommon API
DisplayPipeline.DrawEmapPreview Method (Brep, Color)
 Draws a Brep in Environment Map preview.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void DrawEmapPreview(
	Brep brep,
	Color color
)
Public Sub DrawEmapPreview (
	brep As Brep,
	color As Color
)
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to draw.
color
Type: System.Drawing.Color
Objct color.
See Also
Reference
DisplayPipeline Class
DrawEmapPreview Overload
Rhino.Display Namespace