RhinoCommon API
SectionStyle.SetBoundaryLinetype Method
[Missing <summary> documentation for "M:Rhino.DocObjects.SectionStyle.SetBoundaryLinetype(Rhino.DocObjects.Linetype)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetBoundaryLinetype(
	Linetype linetype
)
Public Sub SetBoundaryLinetype (
	linetype As Linetype
)
Parameters
linetype
Type: Rhino.DocObjects.Linetype
[Missing <param name="linetype"/> documentation for "M:Rhino.DocObjects.SectionStyle.SetBoundaryLinetype(Rhino.DocObjects.Linetype)"]
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace