RhinoCommon API
DisplayConduit.Bind Method
 Bind this conduit to a specific viewport
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Bind(
	RhinoViewport viewport
)
Public Sub Bind (
	viewport As RhinoViewport
)
Parameters
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.Display.DisplayConduit.Bind(Rhino.Display.RhinoViewport)"]
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace