RhinoCommon API
Torus.ToBrep Method
 Converts this torus to a Brep. This is synonymous with calling CreateFromTorus(Torus).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.1
Syntax
public Brep ToBrep()
Public Function ToBrep As Brep
Return Value
Type: Brep
A Brep representation of this torus, or null on error.
See Also
Reference
Torus Structure
Rhino.Geometry Namespace