RhinoCommon API
RenderContent.DeleteAllChildren Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.DeleteAllChildren(Rhino.Render.RenderContent.ChangeContexts)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public void DeleteAllChildren(
	RenderContent.ChangeContexts changeContexts
)
Public Sub DeleteAllChildren (
	changeContexts As RenderContent.ChangeContexts
)
Parameters
changeContexts
Type: Rhino.Render.RenderContent.ChangeContexts
[Missing <param name="changeContexts"/> documentation for "M:Rhino.Render.RenderContent.DeleteAllChildren(Rhino.Render.RenderContent.ChangeContexts)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace