RhinoCommon API
RhinoObject.SupportsRenderPrimitiveList Method (ViewportInfo, Boolean)
Note: This API is now obsolete.
 Determines if custom render meshes will be built for a particular object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
[ObsoleteAttribute("Use HasCustomRenderPrimitives instead")]
public bool SupportsRenderPrimitiveList(
	ViewportInfo viewport,
	bool preview
)
<ObsoleteAttribute("Use HasCustomRenderPrimitives instead")>
Public Function SupportsRenderPrimitiveList (
	viewport As ViewportInfo,
	preview As Boolean
) As Boolean
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
preview
Type: System.Boolean
 Type of mesh to build. If attributes is non-null then a smaller mesh may be generated in less time, false is meant when actually rendering.
Return Value
Type: Boolean
 Returns true if custom render mesh(es) will get built for this object.
See Also
Reference
RhinoObject Class
SupportsRenderPrimitiveList Overload
Rhino.DocObjects Namespace