RhinoCommon API
MeshCurvatureStats.CreateFromMeshes Method
 Gets curvature statistics from analysis meshes, and calculate total statistics.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static MeshCurvatureStats CreateFromMeshes(
	IEnumerable<Mesh> analysisMeshes,
	CurvatureStyle curvatureStyle
)
Public Shared Function CreateFromMeshes (
	analysisMeshes As IEnumerable(Of Mesh),
	curvatureStyle As CurvatureStyle
) As MeshCurvatureStats
Parameters
analysisMeshes
Type: System.Collections.Generic.IEnumerable<Mesh>
An enumeration of analysis meshes.
curvatureStyle
Type: Rhino.Geometry.CurvatureStyle
The curvature style.
Return Value
Type: MeshCurvatureStats
The curvature statistics.
Exceptions
Exception | Condition
ArgumentNullException
Remarks
 The meshes must carry principal curvatures. Set MeshingParameters.ComputeCurvature before meshing, or use Brep.CreateCurvatureAnalysisMesh. Meshes without them are skipped, and if none of them have any, the result is a zero range with Count 0 rather than an error. Mesh.HasPrincipalCurvatures reports whether a mesh qualifies.
See Also
Reference
MeshCurvatureStats Class
Rhino.Geometry Namespace