RhinoCommon API
Brep.CullUnusedLoops Method
Culls loops with m_loop_index == -1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool CullUnusedLoops()
Public Function CullUnusedLoops As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace