RhinoCommon API
KeyboardShortcut Constructor
Initializes a new instance of the KeyboardShortcut class
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public KeyboardShortcut()
Public Sub New
See Also
Reference
KeyboardShortcut Class
Rhino.ApplicationSettings Namespace