RhinoCommon API
PersistentSettingsConverter.ToString Method (KeyValuePair<String, String>[])
 Converts a key value string pair array to a properly formatted string dictionary XML string.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string ToString(
	KeyValuePair<string, string>[] value
)
Public Shared Function ToString (
	value As KeyValuePair(Of String, String)()
) As String
Parameters
value
Type: System.Collections.Generic.KeyValuePair<String, String>[]
 List of string pairs to turn into a dictionary XML string.
Return Value
Type: String
 Returns a properly formatted XML string that represents the string dictionary.
See Also
Reference
PersistentSettingsConverter Class
ToString Overload
Rhino Namespace