RhinoCommon API
RhinoViewport.ZoomBoundingBox Method
 Zooms the viewport to the given bounding box.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ZoomBoundingBox(
	BoundingBox box
)
Public Function ZoomBoundingBox (
	box As BoundingBox
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
The bounding box to zoom.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace