RhinoCommon API
LightTable.Add Method (Light)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LightTable.Add(Rhino.Geometry.Light)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Add(
	Light light
)
Public Function Add (
	light As Light
) As Integer
Parameters
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.DocObjects.Tables.LightTable.Add(Rhino.Geometry.Light)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LightTable.Add(Rhino.Geometry.Light)"]
See Also
Reference
LightTable Class
Add Overload
Rhino.DocObjects.Tables Namespace