RhinoCommon API
Surface.Smooth Method (Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths a surface by averaging the positions of control points in a specified region.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Surface Smooth(
	double smoothFactor,
	bool bXSmooth,
	bool bYSmooth,
	bool bZSmooth,
	bool bFixBoundaries,
	SmoothingCoordinateSystem coordinateSystem,
	Plane plane
)
Public Function Smooth (
	smoothFactor As Double,
	bXSmooth As Boolean,
	bYSmooth As Boolean,
	bZSmooth As Boolean,
	bFixBoundaries As Boolean,
	coordinateSystem As SmoothingCoordinateSystem,
	plane As Plane
) As Surface
Parameters
smoothFactor
Type: System.Double
The smoothing factor, which controls how much control points move towards the average of the neighboring control points.
bXSmooth
Type: System.Boolean
When true control points move in X axis direction.
bYSmooth
Type: System.Boolean
When true control points move in Y axis direction.
bZSmooth
Type: System.Boolean
When true control points move in Z axis direction.
bFixBoundaries
Type: System.Boolean
When true the surface edges don't move.
coordinateSystem
Type: Rhino.Geometry.SmoothingCoordinateSystem
The coordinates to determine the direction of the smoothing.
plane
Type: Rhino.Geometry.Plane
If SmoothingCoordinateSystem.CPlane specified, then the construction plane.
Return Value
Type: Surface
The smoothed surface if successful, null otherwise.
See Also
Reference
Surface Class
Smooth Overload
Rhino.Geometry Namespace