RhinoCommon API
RealtimeDisplayMode.IsRendererStarted Method
 Override to tell the started state of your render engine.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool IsRendererStarted()
Public MustOverride Function IsRendererStarted As Boolean
Return Value
Type: Boolean
true if render engine is ready and rendering
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace