RhinoCommon API
BinaryArchiveReader.ReadInt Method
 Reads a Int32 from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int ReadInt()
Public Function ReadInt As Integer
Return Value
Type: Int32
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace