RhinoCommon API
GeometryBase.DeleteAllUserStrings Method
[Missing <summary> documentation for "M:Rhino.Geometry.GeometryBase.DeleteAllUserStrings"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public void DeleteAllUserStrings()
Public Sub DeleteAllUserStrings
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace