RhinoCommon API
HatchPattern.RemoveHatchLine Method
 Remove a hatch line from the pattern.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool RemoveHatchLine(
	int hatchLineIndex
)
Public Function RemoveHatchLine (
	hatchLineIndex As Integer
) As Boolean
Parameters
hatchLineIndex
Type: System.Int32
The index of the hatch line to remove.
Return Value
Type: Boolean
True if successful, false if index is out of range.
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace