RhinoCommon API
NameHash Constructor (String, Guid, ModelComponentType)
 Creates a new NameHash, representing a piece of text.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public NameHash(
	string name,
	Guid parentId,
	ModelComponentType type
)
Public Sub New (
	name As String,
	parentId As Guid,
	type As ModelComponentType
)
Parameters
name
Type: System.String
A name. This can be null and can refer to a non-existing path.
parentId
Type: System.Guid
The id of the parent layer. This is only useful with layers.
type
Type: Rhino.DocObjects.ModelComponentType
Calls ModelComponentTypeIgnoresCase(ModelComponentType) to determine if case should be used in search.
Return Value
Type:
A new hash
See Also
Reference
NameHash Class
NameHash Overload
Rhino.FileIO Namespace