RhinoCommon API
Point3d.Addition Operator (Point3d, Vector3d)
 Sums up a point and a vector, and returns a new point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point3d operator +(
	Point3d point,
	Vector3d vector
)
Public Shared Operator + (
	point As Point3d,
	vector As Vector3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
vector
Type: Rhino.Geometry.Vector3d
A vector.
Return Value
Type: Point3d
A new point that results from the addition of point and vector.
See Also
Reference
Point3d Structure
Addition Overload
Rhino.Geometry Namespace