RhinoCommon API
AreaMassProperties.Compute Method (Brep, Boolean, Boolean, Boolean, Boolean)
 Compute the AreaMassProperties for a single Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static AreaMassProperties Compute(
	Brep brep,
	bool area,
	bool firstMoments,
	bool secondMoments,
	bool productMoments
)
Public Shared Function Compute (
	brep As Brep,
	area As Boolean,
	firstMoments As Boolean,
	secondMoments As Boolean,
	productMoments As Boolean
) As AreaMassProperties
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to measure.
area
Type: System.Boolean
true to calculate area.
firstMoments
Type: System.Boolean
true to calculate area first moments, area, and area centroid.
secondMoments
Type: System.Boolean
true to calculate area second moments.
productMoments
Type: System.Boolean
true to calculate area product moments.
Return Value
Type: AreaMassProperties
The AreaMassProperties for the given Brep or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When brep is null.
See Also
Reference
AreaMassProperties Class
Compute Overload
Rhino.Geometry Namespace