RhinoCommon API
Transform2d.Inequality Operator
 Determines if two transformations are different in value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool operator !=(
	Transform2d a,
	Transform2d b
)
Public Shared Operator <> (
	a As Transform2d,
	b As Transform2d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Transform2d
A transform.
b
Type: Rhino.Geometry.Transform2d
Another transform.
Return Value
Type: Boolean
true if transforms are different; otherwise false.
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace