RhinoCommon API
PostEffect.DisplayHelp Method
 Displays the post effect's help page, if any.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public abstract bool DisplayHelp()
Public MustOverride Function DisplayHelp As Boolean
Return Value
Type: Boolean
 Return true if successful, else false.
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace