RhinoCommon API
BoundingBox Constructor (IEnumerable<Point3d>)
 Constructs a bounding box from a collection of points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox(
	IEnumerable<Point3d> points
)
Public Sub New (
	points As IEnumerable(Of Point3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to include in the bounding box.
See Also
Reference
BoundingBox Structure
BoundingBox Overload
Rhino.Geometry Namespace