RhinoCommon API
DisplayPipeline.Open Method
 Opens the pipeline.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Open()
Public Function Open As Boolean
Return Value
Type: Boolean
True if the pipeline was opened, false if it was already open or failed to open.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace