RhinoCommon API
LicenseUtils.ReturnLicense Method
 OBSOLETE - REMOVE WHEN POSSIBLE.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool ReturnLicense(
	Guid productId
)
Public Shared Function ReturnLicense (
	productId As Guid
) As Boolean
Parameters
productId
Type: System.Guid
[Missing <param name="productId"/> documentation for "M:Rhino.PlugIns.LicenseUtils.ReturnLicense(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.ReturnLicense(System.Guid)"]
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace