RhinoCommon API
NurbsCurve.GrevilleParameters Method
 Gets all Greville parameters for this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double[] GrevilleParameters()
Public Function GrevilleParameters As Double()
Return Value
Type: Double[]
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurve.GrevilleParameters"]
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace