RhinoCommon API
TrulyObservableOrderedSet<T> Constructor (IEnumerable<T>, IEqualityComparer<T>)
 Creates an instance with the given items.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TrulyObservableOrderedSet(
	IEnumerable<T> items,
	IEqualityComparer<T> comparer = null
)
Public Sub New (
	items As IEnumerable(Of T),
	Optional comparer As IEqualityComparer(Of T) = Nothing
)
Parameters
items
Type: System.Collections.Generic.IEnumerable<T>
Items that the instance will contain. If there are duplicate items, they will be removed.
comparer (Optional)
Type: System.Collections.Generic.IEqualityComparer<T>
custom comparerer, used to check for duplicates. If no comparer is specified, Default is used.
See Also
Reference
TrulyObservableOrderedSet<T> Class
TrulyObservableOrderedSet<T> Overload
Rhino.Runtime.Notifications Namespace