RhinoCommon API
LengthMassProperties.Compute Method (Curve, Boolean, Boolean, Boolean, Boolean)
 Calculates the length mass properties of a curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public static LengthMassProperties Compute(
	Curve curve,
	bool length,
	bool firstMoments,
	bool secondMoments,
	bool productMoments
)
Public Shared Function Compute (
	curve As Curve,
	length As Boolean,
	firstMoments As Boolean,
	secondMoments As Boolean,
	productMoments As Boolean
) As LengthMassProperties
Parameters
curve
Type: Rhino.Geometry.Curve
The curve to measure.
length
Type: System.Boolean
true to calculate length.
firstMoments
Type: System.Boolean
true to calculate length first moments, length, and length centroid.
secondMoments
Type: System.Boolean
true to calculate length second moments.
productMoments
Type: System.Boolean
true to calculate length product moments.
Return Value
Type: LengthMassProperties
The LengthMassProperties for the given curve, or null on failure.
See Also
Reference
LengthMassProperties Class
Compute Overload
Rhino.Geometry Namespace