RhinoCommon API
Sphere.LatitudeRadians Method
 Computes the parallel at a specific latitude angle.
The angle is specified in radians.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Circle LatitudeRadians(
	double radians
)
Public Function LatitudeRadians (
	radians As Double
) As Circle
Parameters
radians
Type: System.Double
An angle in radians for the parallel.
Return Value
Type: Circle
A circle.
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace