RhinoCommon API
ColorStop Constructor
 Create color stop from a color and position
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public ColorStop(
	Color color,
	double t
)
Public Sub New (
	color As Color,
	t As Double
)
Parameters
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.ColorStop.#ctor(System.Drawing.Color,System.Double)"]
t
Type: System.Double
[Missing <param name="t"/> documentation for "M:Rhino.Display.ColorStop.#ctor(System.Drawing.Color,System.Double)"]
See Also
Reference
ColorStop Structure
Rhino.Display Namespace