RhinoCommon API
MeshVertexColorList.ToARGBArray Method
 Return colors as an array of integers with packed ARGB values
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int[] ToARGBArray()
Public Function ToARGBArray As Integer()
Return Value
Type: Int32[]
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.MeshVertexColorList.ToARGBArray"]
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace