RhinoCommon API
Dialogs.ShowColorDialog Method (Object, Color4f, Boolean, NamedColorList, Dialogs.OnColorChangedEvent)
 Displays the standard modal color picker dialog for floating point colors.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool ShowColorDialog(
	Object parent,
	ref Color4f color,
	bool allowAlpha,
	NamedColorList namedColorList,
	Dialogs.OnColorChangedEvent colorCallback
)
Public Shared Function ShowColorDialog (
	parent As Object,
	ByRef color As Color4f,
	allowAlpha As Boolean,
	namedColorList As NamedColorList,
	colorCallback As Dialogs.OnColorChangedEvent
) As Boolean
Parameters
parent
Type: System.Object
Parent window for this dialog, should always pass this if calling from a form or user control.
color
Type: Rhino.Display.Color4f
The initial color to set the picker to and also accepts the user's choice.
allowAlpha
Type: System.Boolean
Specifies if the color picker should allow changes to the alpha channel or not.
namedColorList
Type: Rhino.UI.NamedColorList
 If not null and contains at least one named color this list will replace the standard Rhino Color list displayed by the rhino color dialog.
colorCallback
Type: Rhino.UI.Dialogs.OnColorChangedEvent
 May be optionally passed to ShowColorDialog and will get called when the color value changes in the color dialog.
Return Value
Type: Boolean
true if a color was picked, false if the user canceled the picker dialog.
See Also
Reference
Dialogs Class
ShowColorDialog Overload
Rhino.UI Namespace