RhinoCommon API
Line.PointAtLength Method
 Computes a point located at a specific metric distance from the line origin (From).
If line start and end coincide, then the start point is always returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point3d PointAtLength(
	double distance
)
Public Function PointAtLength (
	distance As Double
) As Point3d
Parameters
distance
Type: System.Double
A positive, 0, or a negative value that will be the distance from From.
Return Value
Type: Point3d
The newly found point.
See Also
Reference
Line Structure
Rhino.Geometry Namespace