RhinoCommon API
RotationGripUserInterfaceObject Constructor
 Create a rotation grip that is aligned to a plane with a defined radius in pixels
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RotationGripUserInterfaceObject(
	Plane plane,
	double radius
)
Public Sub New (
	plane As Plane,
	radius As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
 Plane for rotation. Origin of the plane is the center of rotation. ZAxis of plane is axis that rotation occurs around. XAxis of plane is vector along which the grip is located.
radius
Type: System.Double
 Radius of rotation circle in pixel distance
See Also
Reference
RotationGripUserInterfaceObject Class
Rhino.UI Namespace