RhinoCommon API
ObjectTable.Replace Method (ObjRef, Leader)
Replaces one object with new text object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Replace(
	ObjRef objref,
	Leader leader
)
Public Function Replace (
	objref As ObjRef,
	leader As Leader
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
leader
Type: Rhino.Geometry.Leader
new leader to be added. The leader is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace