RhinoCommon API
BinaryArchiveReader.ReadColor Method
 Reads a Color from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color ReadColor()
Public Function ReadColor As Color
Return Value
Type: Color
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace