RhinoCommon API
GetTransform.AddTransformObjects Method
 Adds any objects you want transformed and grips you want transformed. Make sure no duplicates are in the list and that no grip owners are passed in as objects.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void AddTransformObjects(
	TransformObjectList list
)
Public Sub AddTransformObjects (
	list As TransformObjectList
)
Parameters
list
Type: Rhino.Collections.TransformObjectList
A custom transform object list.
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace