RhinoCommon API
Skin Constructor
 Initializes a new instance of the Skin class.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Skin()
Protected Sub New
See Also
Reference
Skin Class
Rhino.Runtime Namespace