RhinoCommon API
SubDEdgeSharpness.CreateEdgeChainSharpness Method
 Builds a sequence of evenly changing sharpnesses for the edges of a chain.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static SubDEdgeSharpness[] CreateEdgeChainSharpness(
	Interval chainSharpnessRange,
	int edgeCount
)
Public Shared Function CreateEdgeChainSharpness (
	chainSharpnessRange As Interval,
	edgeCount As Integer
) As SubDEdgeSharpness()
Parameters
chainSharpnessRange
Type: Rhino.Geometry.Interval
 The sharpness at the start of the chain and at the end of the chain.
edgeCount
Type: System.Int32
The number of edges in the chain.
Return Value
Type: SubDEdgeSharpness[]
 One sharpness per edge, or an empty array if the input is not valid.
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace