RhinoCommon API
ArchivableDictionary.Set Method (String, SByte)
 Sets a SByte.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Set(
	string key,
	sbyte val
)
Public Function Set (
	key As String,
	val As SByte
) As Boolean
Parameters
key
Type: System.String
The text key.
val
Type: System.SByte
A SByte.
Because SByte has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
true if set operation succeeded, otherwise false.
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace