RhinoCommon API
UserInterfaceGrid.AddLabel Method
 Append a label to the next cell, which is what most first column cells are. The label is returned so that its text alignment, color or height can be adjusted.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceLabel AddLabel(
	string text
)
Public Function AddLabel (
	text As String
) As UserInterfaceLabel
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.UI.UserInterfaceGrid.AddLabel(System.String)"]
Return Value
Type: UserInterfaceLabel
[Missing <returns> documentation for "M:Rhino.UI.UserInterfaceGrid.AddLabel(System.String)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace