RhinoCommon API
RhinoGet.GetMeshParameters Method
 Asks the user to specify meshing parameters.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Result GetMeshParameters(
	RhinoDoc doc,
	ref MeshingParameters parameters,
	ref int uiStyle
)
Public Shared Function GetMeshParameters (
	doc As RhinoDoc,
	ByRef parameters As MeshingParameters,
	ByRef uiStyle As Integer
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
The active document
parameters
Type: Rhino.Geometry.MeshingParameters
The initial meshing parameters. If successful, the updated meshing parameters are returned here.
uiStyle
Type: System.Int32
The user interface style, where: 0 = simple dialog, 1 = details dialog, 2 = script or batch mode.
Return Value
Type: Result
Commands.Result.Success if successful.
See Also
Reference
RhinoGet Class
Rhino.Input Namespace