RhinoCommon API
ObjectTable.FindId Method
Uses the object guid to find a rhino object. Deleted objects cannot be found by id. The guid is the value that is stored on RhinoObject.Id
 In a single document, no two active objects have the same guid. If an object is replaced with a new object, then the guid persists. For example, if the _Move command moves an object, then the moved object inherits it's guid from the starting object. If the Copy command copies an object, then the copy gets a new guid. This guid persists through file saving/opening operations. This function will not find grip objects.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override RhinoObject FindId(
	Guid id
)
Public Overrides Function FindId (
	id As Guid
) As RhinoObject
Parameters
id
Type: System.Guid
ID of object to search for.
Return Value
Type: RhinoObject
Reference to the rhino object with the objectId or null if no such object could be found.
Implements
ICommonComponentTable<T>.FindId(Guid)
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace