RhinoCommon API
Linetype Constructor (Linetype)
Initializes a new instance of the Linetype class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Linetype(
	Linetype other
)
Public Sub New (
	other As Linetype
)
Parameters
other
Type: Rhino.DocObjects.Linetype
[Missing <param name="other"/> documentation for "M:Rhino.DocObjects.Linetype.#ctor(Rhino.DocObjects.Linetype)"]
See Also
Reference
Linetype Class
Linetype Overload
Rhino.DocObjects Namespace