RhinoCommon API
StatusBar.SetDistancePane Method
 Sets the distance pane to a distance value.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void SetDistancePane(
	double distance
)
Public Shared Sub SetDistancePane (
	distance As Double
)
Parameters
distance
Type: System.Double
The distance value.
See Also
Reference
StatusBar Class
Rhino.UI Namespace