RhinoCommon API
MeshUnwrapper.Dispose Method
 Dispose of this object and any unmanaged memory associated with it.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
MeshUnwrapper Class
Rhino.Geometry Namespace