RhinoCommon API
HostUtils.UnhandledThreadException Method
 Exception handler for exceptions occurring on the UI thread
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void UnhandledThreadException(
	Object sender,
	ThreadExceptionEventArgs e
)
Public Shared Sub UnhandledThreadException (
	sender As Object,
	e As ThreadExceptionEventArgs
)
Parameters
sender
Type: System.Object
[Missing <param name="sender"/> documentation for "M:Rhino.Runtime.HostUtils.UnhandledThreadException(System.Object,System.Threading.ThreadExceptionEventArgs)"]
e
Type: System.Threading.ThreadExceptionEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.Runtime.HostUtils.UnhandledThreadException(System.Object,System.Threading.ThreadExceptionEventArgs)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace