RhinoCommon API
ScaleValue Constructor
 Default constructor
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ScaleValue()
Public Sub New
See Also
Reference
ScaleValue Class
Rhino Namespace