RhinoCommon API
SnapShotsClient.AnimationStop Method
 Called once at the end of an animation.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool AnimationStop(
	RhinoDoc doc
)
Public MustOverride Function AnimationStop (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
doc is the current document.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.AnimationStop(Rhino.RhinoDoc)"]
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace