RhinoCommon API
IZooClientUtilities.ShowBuyLicenseUi Method
[Missing <summary> documentation for "M:Rhino.Runtime.IZooClientUtilities.ShowBuyLicenseUi(System.Object,System.Guid)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void ShowBuyLicenseUi(
	Object verify,
	Guid productId
)
Sub ShowBuyLicenseUi (
	verify As Object,
	productId As Guid
)
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.ShowBuyLicenseUi(System.Object,System.Guid)"]
productId
Type: System.Guid
[Missing <param name="productId"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.ShowBuyLicenseUi(System.Object,System.Guid)"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace