RhinoCommon API
NamedParametersEventArgs.Set Method (String, IEnumerable<ObjRef>)
 Set a list of ObjRef instances as a value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Set(
	string name,
	IEnumerable<ObjRef> values
)
Public Sub Set (
	name As String,
	values As IEnumerable(Of ObjRef)
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})"]
values
Type: System.Collections.Generic.IEnumerable<ObjRef>
[Missing <param name="values"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})"]
See Also
Reference
NamedParametersEventArgs Class
Set Overload
Rhino.Runtime Namespace