RhinoCommon API
SnapShotsClient.PrepareForDocumentAnimation Method
 Called once at the start of an animation.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool PrepareForDocumentAnimation(
	RhinoDoc doc,
	BinaryArchiveReader archive_start,
	BinaryArchiveReader archive_stop
)
Public MustOverride Function PrepareForDocumentAnimation (
	doc As RhinoDoc,
	archive_start As BinaryArchiveReader,
	archive_stop As BinaryArchiveReader
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
doc is the current document.
archive_start
Type: Rhino.FileIO.BinaryArchiveReader
archive_start is a archive to the data of the starting position.
archive_stop
Type: Rhino.FileIO.BinaryArchiveReader
archive_stop is a archive to the data of the ending position.
Return Value
Type: Boolean
true if successful, otherwise
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace