RhinoCommon API
MeshNgonList.GetEnumerator Method
 Gets an enumerator that yields all ngons in this collection.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IEnumerator<MeshNgon> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of MeshNgon)
Return Value
Type: IEnumerator<MeshNgon>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace