RhinoCommon API
Vector3f.Add Method (Vector3f, Vector3f)
 Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Vector3f Add(
	Vector3f vector1,
	Vector3f vector2
)
Public Shared Function Add (
	vector1 As Vector3f,
	vector2 As Vector3f
) As Vector3f
Parameters
vector1
Type: Rhino.Geometry.Vector3f
A vector.
vector2
Type: Rhino.Geometry.Vector3f
A second vector.
Return Value
Type: Vector3f
A new vector that results from the component-wise addition of the two vectors.
See Also
Reference
Vector3f Structure
Add Overload
Rhino.Geometry Namespace