RhinoCommon API
GeometryBase.GetBoundingBox Method (Transform)
 Aligned Bounding box solver. Gets the world axis aligned bounding box for the transformed geometry.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual BoundingBox GetBoundingBox(
	Transform xform
)
Public Overridable Function GetBoundingBox (
	xform As Transform
) As BoundingBox
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to apply to object prior to the BoundingBox computation. The geometry itself is not modified.
Return Value
Type: BoundingBox
The accurate bounding box of the transformed geometry in world coordinates or BoundingBox.Empty if not bounding box could be found.
See Also
Reference
GeometryBase Class
GetBoundingBox Overload
Rhino.Geometry Namespace