RhinoCommon API
SubDComponent.Equality Operator
 Determines whether two components refer to the same component, with the same orientation, in the same SubD.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static bool operator ==(
	SubDComponent a,
	SubDComponent b
)
Public Shared Operator = (
	a As SubDComponent,
	b As SubDComponent
) As Boolean
Parameters
a
Type: Rhino.Geometry.SubDComponent
The first component.
b
Type: Rhino.Geometry.SubDComponent
The second component.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDComponent.op_Equality(Rhino.Geometry.SubDComponent,Rhino.Geometry.SubDComponent)"]
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace