RhinoCommon API
FileDwgWriteOptions Constructor (FileDwgWriteOptions)
Initializes a new instance of the FileDwgWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public FileDwgWriteOptions(
	FileDwgWriteOptions opt
)
Public Sub New (
	opt As FileDwgWriteOptions
)
Parameters
opt
Type: Rhino.FileIO.FileDwgWriteOptions
[Missing <param name="opt"/> documentation for "M:Rhino.FileIO.FileDwgWriteOptions.#ctor(Rhino.FileIO.FileDwgWriteOptions)"]
See Also
Reference
FileDwgWriteOptions Class
FileDwgWriteOptions Overload
Rhino.FileIO Namespace