RhinoCommon API
PointCloud.ClearColors Method
 Destroys the color information in this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void ClearColors()
Public Sub ClearColors
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace