RhinoCommon API
ColorRGBA.ToString Method (String, IFormatProvider)
[Missing <summary> documentation for "M:Rhino.Display.ColorRGBA.ToString(System.String,System.IFormatProvider)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string ToString(
	string format,
	IFormatProvider formatProvider
)
Public Function ToString (
	format As String,
	formatProvider As IFormatProvider
) As String
Parameters
format
Type: System.String
[Missing <param name="format"/> documentation for "M:Rhino.Display.ColorRGBA.ToString(System.String,System.IFormatProvider)"]
formatProvider
Type: System.IFormatProvider
[Missing <param name="formatProvider"/> documentation for "M:Rhino.Display.ColorRGBA.ToString(System.String,System.IFormatProvider)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Display.ColorRGBA.ToString(System.String,System.IFormatProvider)"]
Implements
IFormattable.ToString(String, IFormatProvider)
See Also
Reference
ColorRGBA Structure
ToString Overload
Rhino.Display Namespace