RhinoCommon API
Sun Constructor
 Create a utility object not associated with any document
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Sun()
Public Sub New
See Also
Reference
Sun Class
Rhino.Render Namespace