RhinoCommon API
SimpleArrayFloat Constructor (SimpleArrayFloat)
 Initializes a new SimpleArrayFloat with the contents of another SimpleArrayFloat.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SimpleArrayFloat(
	SimpleArrayFloat other
)
Public Sub New (
	other As SimpleArrayFloat
)
Parameters
other
Type: Rhino.Runtime.InteropWrappers.SimpleArrayFloat
[Missing <param name="other"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayFloat.#ctor(Rhino.Runtime.InteropWrappers.SimpleArrayFloat)"]
See Also
Reference
SimpleArrayFloat Class
SimpleArrayFloat Overload
Rhino.Runtime.InteropWrappers Namespace