RhinoCommon API
RenderEnvironment Constructor
Initializes a new instance of the RenderEnvironment class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected RenderEnvironment()
Protected Sub New
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace