RhinoCommon API
NurbsSurfaceKnotList.RemoveKnotsAt Method
 Remove knots from the surface and adjusts the remaining control points to maintain surface position as closely as possible.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool RemoveKnotsAt(
	double u,
	double v
)
Public Function RemoveKnotsAt (
	u As Double,
	v As Double
) As Boolean
Parameters
u
Type: System.Double
The u parameter on the surface that is closest to the knot to be removed.
v
Type: System.Double
The v parameter on the surface that is closest to the knot to be removed.
Return Value
Type: Boolean
true if successful, false on failure.
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace