RhinoCommon API
CurveKinkDefinition Constructor (Double, Double, Boolean, Boolean)
 Create a CurveKinkDefinition with specified settings.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public CurveKinkDefinition(
	double kinkAngleDegrees,
	double curvatureKinkRadiusRatio,
	bool kinkAtTangentChange,
	bool kinkAtCurvatureChange
)
Public Sub New (
	kinkAngleDegrees As Double,
	curvatureKinkRadiusRatio As Double,
	kinkAtTangentChange As Boolean,
	kinkAtCurvatureChange As Boolean
)
Parameters
kinkAngleDegrees
Type: System.Double
 0 <= kinkAngleDegrees <= 180. Values > 180 are treated as 180 and other values outside the [0,180] are treated as ON_CurveKinkDefinition::DefaultPolylineTangentKinkAngleDegrees. If a curve is a polyline and the angle (in degrees) between the tangents at a tangent discontinuity is > polyline_tangent_kink_angle_degrees, then that discontinuity is treated as a kink. In particular, passing 180.0 disables tangent discontinuity checks for polyline curves.
curvatureKinkRadiusRatio
Type: System.Double
 0 <= curvatureKinkRadiusRatio <= 1. Values > 1 are treated as 1 and other values outside the [0,1] are treated as ON_CurveKinkDefinition::DefaultCurvatureKinkRadiusRatio. If the ratio (minimum radius of curvature)/(maximum radius of curvature) at a curvature discontinuity is < curvature_kink_radius_ratio, then that discontinuity is treated as a kink. In particular, passing 0.0 disables curvature radius discontinuity checks.
kinkAtTangentChange
Type: System.Boolean
 true if tangent discontinuities should be tested to determine if the tangent discontinuity is a kink. false to ignore tangent discontinuities.
kinkAtCurvatureChange
Type: System.Boolean
 true if curvature discontinuities should be tested to determine if the curvature discontinuity is a kink. false to ignore curvature discontinuities.
See Also
Reference
CurveKinkDefinition Class
CurveKinkDefinition Overload
Rhino.Geometry Namespace