RhinoCommon API
UserInterfaceGrid.AddHeading Method
 Append a label that spans every column, for a section heading.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceLabel AddHeading(
	string text
)
Public Function AddHeading (
	text As String
) As UserInterfaceLabel
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.UI.UserInterfaceGrid.AddHeading(System.String)"]
Return Value
Type: UserInterfaceLabel
[Missing <returns> documentation for "M:Rhino.UI.UserInterfaceGrid.AddHeading(System.String)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace