RhinoCommon API
PostEffectPipeline.Execute Method
 Execute the pipeline. This executes all the post effects in order. Only this rectangle need be modified by the post effects.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Execute(
	Rectangle p,
	bool renderingInProgress,
	PostEffectExecuteContexts usageContexts,
	PostEffectHistograms histogramsToUpdate
)
Public Function Execute (
	p As Rectangle,
	renderingInProgress As Boolean,
	usageContexts As PostEffectExecuteContexts,
	histogramsToUpdate As PostEffectHistograms
) As Boolean
Parameters
p
Type: System.Drawing.Rectangle
p is a rectangle within the frame buffer.
renderingInProgress
Type: System.Boolean
rendering is true if rendering is in progress.
usageContexts
Type: Rhino.Render.PostEffects.PostEffectExecuteContexts
Context this pipeline is being executed in.
histogramsToUpdate
Type: Rhino.Render.PostEffects.PostEffectHistograms
Bitwise list of histograms to update during the execution of the pipeline
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectPipeline.Execute(System.Drawing.Rectangle,System.Boolean,Rhino.Render.PostEffects.PostEffectExecuteContexts,Rhino.Render.PostEffects.PostEffectHistograms)"]
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace