RhinoCommon API
Font.InstalledFonts Method (String)
[Missing <summary> documentation for "M:Rhino.DocObjects.Font.InstalledFonts(System.String)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public static Font[] InstalledFonts(
	string familyName
)
Public Shared Function InstalledFonts (
	familyName As String
) As Font()
Parameters
familyName
Type: System.String
[Missing <param name="familyName"/> documentation for "M:Rhino.DocObjects.Font.InstalledFonts(System.String)"]
Return Value
Type: Font[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Font.InstalledFonts(System.String)"]
See Also
Reference
Font Class
InstalledFonts Overload
Rhino.DocObjects Namespace