RhinoCommon API
ContentFactories.FindFactory Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.ContentFactories.FindFactory(System.Guid)"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public ContentFactory FindFactory(
	Guid uuid
)
Public Function FindFactory (
	uuid As Guid
) As ContentFactory
Parameters
uuid
Type: System.Guid
[Missing <param name="uuid"/> documentation for "M:Rhino.Render.DataSources.ContentFactories.FindFactory(System.Guid)"]
Return Value
Type: ContentFactory
[Missing <returns> documentation for "M:Rhino.Render.DataSources.ContentFactories.FindFactory(System.Guid)"]
See Also
Reference
ContentFactories Class
Rhino.Render.DataSources Namespace