RhinoCommon API
FileDwgWriteOptions.AddToDictionary Method
 Add these options to a dictionary, used by UIless dotnet export.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void AddToDictionary(
	ArchivableDictionary dict
)
Public Sub AddToDictionary (
	dict As ArchivableDictionary
)
Parameters
dict
Type: Rhino.Collections.ArchivableDictionary
[Missing <param name="dict"/> documentation for "M:Rhino.FileIO.FileDwgWriteOptions.AddToDictionary(Rhino.Collections.ArchivableDictionary)"]
Return Value
Type:
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace