RhinoCommon API
Curve.TrimInterval Method (Interval)
 Trims the curve in-place by removing portions of the curve outside the specified interval.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.25
Syntax
public bool TrimInterval(
	Interval domain
)
Public Function TrimInterval (
	domain As Interval
) As Boolean
Parameters
domain
Type: Rhino.Geometry.Interval
Trimming interval.
Return Value
Type: Boolean
True if successful, false otherwise.
Remarks
 Portions of the curve before curve(domain[0]) and after curve(domain[1]) are removed.
See Also
Reference
Curve Class
TrimInterval Overload
Rhino.Geometry Namespace