RhinoCommon API
InstanceDefinition.GetHashCode Method
 Use Id.GetHashCode()
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.InstanceDefinition.GetHashCode"]
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace