RhinoCommon API
CursorTooltipSettings.GetDefaultState Method
 Gets the cursor tooltip factory settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static CursorTooltipSettingsState GetDefaultState()
Public Shared Function GetDefaultState As CursorTooltipSettingsState
Return Value
Type: CursorTooltipSettingsState
A new cursor tooltip state with factory settings.
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace