RhinoCommon API
ManifestTable.ActiveObjectCount Method
 Total number of items in the manifest, including deleted items.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int ActiveObjectCount(
	ModelComponentType type
)
Public Function ActiveObjectCount (
	type As ModelComponentType
) As Integer
Parameters
type
Type: Rhino.DocObjects.ModelComponentType
[Missing <param name="type"/> documentation for "M:Rhino.FileIO.ManifestTable.ActiveObjectCount(Rhino.DocObjects.ModelComponentType)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.FileIO.ManifestTable.ActiveObjectCount(Rhino.DocObjects.ModelComponentType)"]
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace