RhinoCommon API
DracoCompressionOptions Constructor
 Initializes to default options
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public DracoCompressionOptions()
Public Sub New
See Also
Reference
DracoCompressionOptions Class
Rhino.FileIO Namespace