RhinoCommon API
File3dmSettings.LoadedPlugIns Method
 Information about the plug-ins loaded when the file was last saved
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IEnumerable<File3dmPlugInDetails> LoadedPlugIns()
Public Function LoadedPlugIns As IEnumerable(Of File3dmPlugInDetails)
Return Value
Type: IEnumerable<File3dmPlugInDetails>
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmSettings.LoadedPlugIns"]
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace