RhinoCommon API
FileSkpReadOptions Constructor
Initializes a new instance of the FileSkpReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileSkpReadOptions()
Public Sub New
See Also
Reference
FileSkpReadOptions Class
Rhino.FileIO Namespace