RhinoCommon API
ViewCapture.CaptureToSvg Method
[Missing <summary> documentation for "M:Rhino.Display.ViewCapture.CaptureToSvg(Rhino.Display.ViewCaptureSettings)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static XmlDocument CaptureToSvg(
	ViewCaptureSettings settings
)
Public Shared Function CaptureToSvg (
	settings As ViewCaptureSettings
) As XmlDocument
Parameters
settings
Type: Rhino.Display.ViewCaptureSettings
[Missing <param name="settings"/> documentation for "M:Rhino.Display.ViewCapture.CaptureToSvg(Rhino.Display.ViewCaptureSettings)"]
Return Value
Type: XmlDocument
[Missing <returns> documentation for "M:Rhino.Display.ViewCapture.CaptureToSvg(Rhino.Display.ViewCaptureSettings)"]
See Also
Reference
ViewCapture Class
Rhino.Display Namespace