RhinoCommon API
FieldDictionary.Add Method (String, Vector2d, String)
 Add a new Vector2dField to the dictionary.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Vector2dField Add(
	string key,
	Vector2d value,
	string prompt
)
Public Function Add (
	key As String,
	value As Vector2d,
	prompt As String
) As Vector2dField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: Rhino.Geometry.Vector2d
Initial value for this field.
prompt
Type: System.String
 Prompt to display in the user interface (Content Browsers) if this is null or an empty string the this field is a data only field and will not appear in the user interface.
Return Value
Type: Vector2dField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Vector2d,System.String)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace