RhinoCommon API
FileTypeList Constructor (String, String)
Initializes a new instance of the FileTypeList class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public FileTypeList(
	string description,
	string extension
)
Public Sub New (
	description As String,
	extension As String
)
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.PlugIns.FileTypeList.#ctor(System.String,System.String)"]
extension
Type: System.String
[Missing <param name="extension"/> documentation for "M:Rhino.PlugIns.FileTypeList.#ctor(System.String,System.String)"]
See Also
Reference
FileTypeList Class
FileTypeList Overload
Rhino.PlugIns Namespace