RhinoCommon API
CustomRenderMeshProvider.ObjectChanged Method
[Missing <summary> documentation for "M:Rhino.Render.CustomRenderMeshProvider.ObjectChanged(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void ObjectChanged(
	RhinoDoc doc,
	RhinoObject obj
)
Public Shared Sub ObjectChanged (
	doc As RhinoDoc,
	obj As RhinoObject
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider.ObjectChanged(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject)"]
obj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="obj"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider.ObjectChanged(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject)"]
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace