RhinoCommon API
DisplayBitmap.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
DisplayBitmap Class
Dispose Overload
Rhino.Display Namespace