RhinoCommon API
DimStyleTable.SetCurrentDimensionStyleIndex Method
Note: This API is now obsolete.
 Do not use. Use the SetCurrent(Int32, Boolean) method.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use the SetCurrent property.")]
public bool SetCurrentDimensionStyleIndex(
	int index,
	bool quiet
)
<ObsoleteAttribute("Use the SetCurrent property.")>
Public Function SetCurrentDimensionStyleIndex (
	index As Integer,
	quiet As Boolean
) As Boolean
Parameters
index
Type: System.Int32
Do not use.
quiet
Type: System.Boolean
Do not use.
Return Value
Type: Boolean
Do not use.
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace