RhinoCommon API
LightManagerSupport.LightFromId Method
 Get Rhino.Geometry.Light object associated to Guig uuid
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool LightFromId(
	RhinoDoc doc,
	Guid uuid,
	ref Light light
)
Public MustOverride Function LightFromId (
	doc As RhinoDoc,
	uuid As Guid,
	ByRef light As Light
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.LightManagerSupport.LightFromId(Rhino.RhinoDoc,System.Guid,Rhino.Geometry.Light@)"]
uuid
Type: System.Guid
[Missing <param name="uuid"/> documentation for "M:Rhino.Render.LightManagerSupport.LightFromId(Rhino.RhinoDoc,System.Guid,Rhino.Geometry.Light@)"]
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.LightManagerSupport.LightFromId(Rhino.RhinoDoc,System.Guid,Rhino.Geometry.Light@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.LightManagerSupport.LightFromId(Rhino.RhinoDoc,System.Guid,Rhino.Geometry.Light@)"]
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace