RhinoCommon API
SimpleArrayArrayPoint3d.PointCountAt Method
 Gets the amount of points in a polyline.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int PointCountAt(
	int index
)
Public Function PointCountAt (
	index As Integer
) As Integer
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d.PointCountAt(System.Int32)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d.PointCountAt(System.Int32)"]
See Also
Reference
SimpleArrayArrayPoint3d Class
Rhino.Runtime.InteropWrappers Namespace