RhinoCommon API
BezierSurface.CreateLoftedBezier Method
 Loft a bezier surface through a list of bezier curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public static BezierSurface CreateLoftedBezier(
	IEnumerable<BezierCurve> curves
)
Public Shared Function CreateLoftedBezier (
	curves As IEnumerable(Of BezierCurve)
) As BezierSurface
Parameters
curves
Type: System.Collections.Generic.IEnumerable<BezierCurve>
list of curves that have the same degree
Return Value
Type: BezierSurface
new bezier curve if successful
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace