RhinoCommon API
RenderContent.ChangeChild Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.ChangeChild(Rhino.Render.RenderContent,Rhino.Render.RenderContent)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
[ObsoleteAttribute("This method is obsolete and simply calls SetChild")]
public bool ChangeChild(
	RenderContent oldContent,
	RenderContent newContent
)
<ObsoleteAttribute("This method is obsolete and simply calls SetChild")>
Public Function ChangeChild (
	oldContent As RenderContent,
	newContent As RenderContent
) As Boolean
Parameters
oldContent
Type: Rhino.Render.RenderContent
[Missing <param name="oldContent"/> documentation for "M:Rhino.Render.RenderContent.ChangeChild(Rhino.Render.RenderContent,Rhino.Render.RenderContent)"]
newContent
Type: Rhino.Render.RenderContent
[Missing <param name="newContent"/> documentation for "M:Rhino.Render.RenderContent.ChangeChild(Rhino.Render.RenderContent,Rhino.Render.RenderContent)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.ChangeChild(Rhino.Render.RenderContent,Rhino.Render.RenderContent)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace