RhinoCommon API
ExtensionMethods.ToSimulatedEnvironmentMappingMode Method
[Missing <summary> documentation for "M:Rhino.Render.ExtensionMethods.ToSimulatedEnvironmentMappingMode(Rhino.Render.TextureEnvironmentMappingMode)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public static SimulatedTexture.EnvironmentMappingModes ToSimulatedEnvironmentMappingMode(
	this TextureEnvironmentMappingMode e
)
<ExtensionAttribute>
Public Shared Function ToSimulatedEnvironmentMappingMode (
	e As TextureEnvironmentMappingMode
) As SimulatedTexture.EnvironmentMappingModes
Parameters
e
Type: Rhino.Render.TextureEnvironmentMappingMode
[Missing <param name="e"/> documentation for "M:Rhino.Render.ExtensionMethods.ToSimulatedEnvironmentMappingMode(Rhino.Render.TextureEnvironmentMappingMode)"]
Return Value
Type: SimulatedTexture.EnvironmentMappingModes
[Missing <returns> documentation for "M:Rhino.Render.ExtensionMethods.ToSimulatedEnvironmentMappingMode(Rhino.Render.TextureEnvironmentMappingMode)"]
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type TextureEnvironmentMappingMode. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ExtensionMethods Class
Rhino.Render Namespace