RhinoCommon API
PointCloud Constructor (PointCloud)
 Initializes a new instance of the PointCloud class, copying (Merge) the content of another point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PointCloud(
	PointCloud other
)
Public Sub New (
	other As PointCloud
)
Parameters
other
Type: Rhino.Geometry.PointCloud
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.PointCloud.#ctor(Rhino.Geometry.PointCloud)"]
See Also
Reference
PointCloud Class
PointCloud Overload
Rhino.Geometry Namespace