RhinoCommon API
UserInterfaceButton Constructor
Initializes a new instance of the UserInterfaceButton class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UserInterfaceButton()
Public Sub New
See Also
Reference
UserInterfaceButton Class
Rhino.UI Namespace