RhinoCommon API
Worksession.SaveAs Method
 Saves this worksession to a .rws file.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SaveAs(
	string path
)
Public Function SaveAs (
	path As String
) As Boolean
Parameters
path
Type: System.String
The full path to write to.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace