RhinoCommon API
SurfaceFilletBase.TrimBreps Method
 If the two input breps are the same, TrimmedBreps[1] will be empty. The constructor idoes everything necessary for this to be called. Calles to the various fillet creation members will not change the result.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool TrimBreps(
	bool bExtend,
	List<Brep> TrimmedBreps0,
	List<Brep> TrimmedBreps1
)
Public Function TrimBreps (
	bExtend As Boolean,
	TrimmedBreps0 As List(Of Brep),
	TrimmedBreps1 As List(Of Brep)
) As Boolean
Parameters
bExtend
Type: System.Boolean
[Missing <param name="bExtend"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.TrimBreps(System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep})"]
TrimmedBreps0
Type: System.Collections.Generic.List<Brep>
[Missing <param name="TrimmedBreps0"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.TrimBreps(System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep})"]
TrimmedBreps1
Type: System.Collections.Generic.List<Brep>
[Missing <param name="TrimmedBreps1"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.TrimBreps(System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SurfaceFilletBase.TrimBreps(System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep})"]
See Also
Reference
SurfaceFilletBase Class
Rhino.Geometry Namespace