RhinoCommon API
Surface.GetNextDiscontinuity Method (Int32, Continuity, Double, Double, Double)
 Searches for a derivative, tangent, or curvature discontinuity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool GetNextDiscontinuity(
	int direction,
	Continuity continuityType,
	double t0,
	double t1,
	out double t
)
Public Function GetNextDiscontinuity (
	direction As Integer,
	continuityType As Continuity,
	t0 As Double,
	t1 As Double,
	<OutAttribute> ByRef t As Double
) As Boolean
Parameters
direction
Type: System.Int32
 If 0, then "u" parameter is checked. If 1, then the "v" parameter is checked.
continuityType
Type: Rhino.Geometry.Continuity
The desired continuity.
t0
Type: System.Double
 Search begins at t0. If there is a discontinuity at t0, it will be ignored. This makes it possible to repeatedly call GetNextDiscontinuity and step through the discontinuities.
t1
Type: System.Double
 (t0 != t1) If there is a discontinuity at t1 is will be ignored unless c is a locus discontinuity type and t1 is at the start or end of the curve.
t
Type: System.Double
 if a discontinuity is found, then t reports the parameter at the discontinuity.
Return Value
Type: Boolean
 Parametric continuity tests c = (C0_continuous, ..., G2_continuous): TRUE if a parametric discontinuity was found strictly between t0 and t1. Note well that all curves are parametrically continuous at the ends of their domains. Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous): TRUE if a locus discontinuity was found strictly between t0 and t1 or at t1 is the at the end of a curve. Note well that all open curves (IsClosed()=false) are locus discontinuous at the ends of their domains. All closed curves (IsClosed()=true) are at least C0_locus_continuous at the ends of their domains.
See Also
Reference
Surface Class
GetNextDiscontinuity Overload
Rhino.Geometry Namespace