RhinoCommon API
SweepOneRail.SetRoadlikeUpDirection Method
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.SetRoadlikeUpDirection(Rhino.Geometry.Vector3d)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetRoadlikeUpDirection(
	Vector3d up
)
Public Sub SetRoadlikeUpDirection (
	up As Vector3d
)
Parameters
up
Type: Rhino.Geometry.Vector3d
[Missing <param name="up"/> documentation for "M:Rhino.Geometry.SweepOneRail.SetRoadlikeUpDirection(Rhino.Geometry.Vector3d)"]
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace