RhinoCommon API
Utilities.MoveWindow Method
[Missing <summary> documentation for "M:Rhino.Render.Utilities.MoveWindow(System.IntPtr,System.Drawing.Rectangle,System.Boolean,System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void MoveWindow(
	IntPtr hwnd,
	Rectangle rect,
	bool bRepaint,
	bool bRepaintNC
)
Public Shared Sub MoveWindow (
	hwnd As IntPtr,
	rect As Rectangle,
	bRepaint As Boolean,
	bRepaintNC As Boolean
)
Parameters
hwnd
Type: System.IntPtr
[Missing <param name="hwnd"/> documentation for "M:Rhino.Render.Utilities.MoveWindow(System.IntPtr,System.Drawing.Rectangle,System.Boolean,System.Boolean)"]
rect
Type: System.Drawing.Rectangle
[Missing <param name="rect"/> documentation for "M:Rhino.Render.Utilities.MoveWindow(System.IntPtr,System.Drawing.Rectangle,System.Boolean,System.Boolean)"]
bRepaint
Type: System.Boolean
[Missing <param name="bRepaint"/> documentation for "M:Rhino.Render.Utilities.MoveWindow(System.IntPtr,System.Drawing.Rectangle,System.Boolean,System.Boolean)"]
bRepaintNC
Type: System.Boolean
[Missing <param name="bRepaintNC"/> documentation for "M:Rhino.Render.Utilities.MoveWindow(System.IntPtr,System.Drawing.Rectangle,System.Boolean,System.Boolean)"]
See Also
Reference
Utilities Class
Rhino.Render Namespace