RhinoCommon API
Mesh.ShrinkWrap Method (IEnumerable<Mesh>, ShrinkWrapParameters)
 Creates a unified ShrinkWrap mesh from a collection of input meshes. Returns null on error or failure.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Mesh ShrinkWrap(
	IEnumerable<Mesh> meshes,
	ShrinkWrapParameters parameters
)
Public Shared Function ShrinkWrap (
	meshes As IEnumerable(Of Mesh),
	parameters As ShrinkWrapParameters
) As Mesh
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
[Missing <param name="meshes"/> documentation for "M:Rhino.Geometry.Mesh.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters)"]
parameters
Type: Rhino.Geometry.ShrinkWrapParameters
A ShrinkWrapParameters object that specifies the configuration settings for the ShrinkWrap process.
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters)"]
See Also
Reference
Mesh Class
ShrinkWrap Overload
Rhino.Geometry Namespace