RhinoCommon API
HostUtils.GetPrinterNames Method
 Get list of printers available on this system
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string[] GetPrinterNames()
Public Shared Function GetPrinterNames As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.GetPrinterNames"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace