RhinoCommon API
Layer.IsParentOf Method (Guid)
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.IsParentOf(System.Guid)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsParentOf(
	Guid otherLayer
)
Public Function IsParentOf (
	otherLayer As Guid
) As Boolean
Parameters
otherLayer
Type: System.Guid
[Missing <param name="otherLayer"/> documentation for "M:Rhino.DocObjects.Layer.IsParentOf(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.IsParentOf(System.Guid)"]
See Also
Reference
Layer Class
IsParentOf Overload
Rhino.DocObjects Namespace