RhinoCommon API
DisplayMaterial Constructor
 Constructs a default material.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DisplayMaterial()
Public Sub New
See Also
Reference
DisplayMaterial Class
DisplayMaterial Overload
Rhino.Display Namespace