RhinoCommon API
PersistentSettings.GetByte Method (String, Byte, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetByte(System.String,System.Byte,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public byte GetByte(
	string key,
	byte defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetByte (
	key As String,
	defaultValue As Byte,
	legacyKeyList As IEnumerable(Of String)
) As Byte
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetByte(System.String,System.Byte,System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.Byte
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetByte(System.String,System.Byte,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetByte(System.String,System.Byte,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Byte
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetByte(System.String,System.Byte,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetByte Overload
Rhino Namespace