RhinoCommon API
Decal.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.Decal.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
Decal Class
Rhino.Render Namespace