RhinoCommon API
RuntimeDocumentDataTable.TryGetValue<T> Method (Object)
 Check dictionary for value and return it properly cast if found.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public T TryGetValue<T>(
	Object key
)
where T : class
Public Function TryGetValue(Of T As Class) (
	key As Object
) As T
Parameters
key
Type: System.Object
 Key to search for.
Type Parameters
T
 Class type created as necessary and returned.
Return Value
Type: T
 Returns the document specific instance of type T using the specified dictionary key or null if not found.
See Also
Reference
RuntimeDocumentDataTable Class
TryGetValue Overload
Rhino.DocObjects.Tables Namespace