RhinoCommon API
WorksessionFile.FromByteArray Method
Reads a worksession from the contents of a worksession file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static WorksessionFile FromByteArray(
	byte[] bytes
)
Public Shared Function FromByteArray (
	bytes As Byte()
) As WorksessionFile
Parameters
bytes
Type: System.Byte[]
The contents of a .rws file.
Return Value
Type: WorksessionFile
 The worksession, or null if the bytes could not be read, including the contents of a worksession file from a newer version of Rhino.
Exceptions
Exception | Condition
ArgumentNullException | If bytes is null.
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace