RhinoCommon API
MetaDataProxy.Dispose Method
 Dispose for MetaDataProxy
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
MetaDataProxy Class
Rhino.Render Namespace