RhinoCommon API
SubDDisplayParameters.SetAbsoluteDisplayDensity Method
 In almast all cases, you are better off using SetAdaptiveDisplayDensity().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public void SetAbsoluteDisplayDensity(
	uint absoluteDisplayDensity
)
Public Sub SetAbsoluteDisplayDensity (
	absoluteDisplayDensity As UInteger
)
Parameters
absoluteDisplayDensity
Type: System.UInt32
absoluteDisplayDensity <= SubDDisplayParameters.Density.MaximumDensity.
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace