RhinoCommon API
SupportOptions.SetCustomLibraryPath Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetCustomLibraryPath(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_SetCustomPath' instead")]
public static void SetCustomLibraryPath(
	string path
)
<ObsoleteAttribute("Use 'Libraries_SetCustomPath' instead")>
Public Shared Sub SetCustomLibraryPath (
	path As String
)
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.Render.SupportOptions.SetCustomLibraryPath(System.String)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace