RhinoCommon API
MaterialRef.Dispose Method
Releases all resources used by the MaterialRef
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace