RhinoCommon API
File3dmRenderTextures.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.FileIO.File3dmRenderTextures.GetEnumerator"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IEnumerator<File3dmRenderTexture> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of File3dmRenderTexture)
Return Value
Type: IEnumerator<File3dmRenderTexture>
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderTextures.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
File3dmRenderTextures Class
Rhino.FileIO Namespace