RhinoCommon API
ViewportInfo.RotateCamera Method
 Rotates the view camera.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool RotateCamera(
	double rotationAngleRadians,
	Vector3d rotationAxis,
	Point3d rotationCenter
)
Public Function RotateCamera (
	rotationAngleRadians As Double,
	rotationAxis As Vector3d,
	rotationCenter As Point3d
) As Boolean
Parameters
rotationAngleRadians
Type: System.Double
The amount to rotate expressed in radians.
rotationAxis
Type: Rhino.Geometry.Vector3d
The axis to rotate around.
rotationCenter
Type: Rhino.Geometry.Point3d
The point to rotate around.
Return Value
Type: Boolean
True if rotation is successful, false otherwise.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace