RhinoCommon API
TextureGraphInfo.SetAmountV Method
[Missing <summary> documentation for "M:Rhino.Render.TextureGraphInfo.SetAmountV(System.Double)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public void SetAmountV(
	double d
)
Public Sub SetAmountV (
	d As Double
)
Parameters
d
Type: System.Double
[Missing <param name="d"/> documentation for "M:Rhino.Render.TextureGraphInfo.SetAmountV(System.Double)"]
See Also
Reference
TextureGraphInfo Class
Rhino.Render Namespace