RhinoCommon API
Mesh.ExplodeAtUnweldedEdges Method
 Explode the mesh into sub-meshes where a sub-mesh is a collection of faces that are contained within a closed loop of "unwelded" edges. Unwelded edges are edges where the faces that share the edge have unique mesh vertices (not mesh topology vertices) at both ends of the edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Mesh[] ExplodeAtUnweldedEdges()
Public Function ExplodeAtUnweldedEdges As Mesh()
Return Value
Type: Mesh[]
 Array of sub-meshes on success; null on error. If the count in the returned array is 1, then nothing happened and the output is essentially a copy of the input.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace