RhinoCommon API
SubDComponentParameter.CreateEdgeParameter Method
 Creates a parameter that identifies a surface point on a SubD edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static SubDComponentParameter CreateEdgeParameter(
	uint edgeId,
	double edgeParameter,
	uint activeFaceId
)
Public Shared Function CreateEdgeParameter (
	edgeId As UInteger,
	edgeParameter As Double,
	activeFaceId As UInteger
) As SubDComponentParameter
Parameters
edgeId
Type: System.UInt32
The id of a SubD edge.
edgeParameter
Type: System.Double
 A value between 0 and 1. 0 is the edge's start vertex and 1 is its end vertex.
activeFaceId
Type: System.UInt32
 The id of a face attached to the edge, or 0 to let the SubD choose one. A crease edge has a different surface normal on each side.
Return Value
Type: SubDComponentParameter
[Missing <returns> documentation for "M:Rhino.Geometry.SubDComponentParameter.CreateEdgeParameter(System.UInt32,System.Double,System.UInt32)"]
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace