RhinoCommon API
Mesh.FileHole Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Geometry.Mesh.FileHole(System.Int32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use Mesh.FillHole")]
public bool FileHole(
	int topologyEdgeIndex
)
<ObsoleteAttribute("Use Mesh.FillHole")>
Public Function FileHole (
	topologyEdgeIndex As Integer
) As Boolean
Parameters
topologyEdgeIndex
Type: System.Int32
[Missing <param name="topologyEdgeIndex"/> documentation for "M:Rhino.Geometry.Mesh.FileHole(System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.FileHole(System.Int32)"]
See Also
Reference
Mesh Class
Rhino.Geometry Namespace