RhinoCommon API
Sphere.ToBrep Method
 Converts this sphere is it Brep representation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep ToBrep()
Public Function ToBrep As Brep
Return Value
Type: Brep
[Missing <returns> documentation for "M:Rhino.Geometry.Sphere.ToBrep"]
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace