RhinoCommon API
SubDDisplayParameters.Coarse Method
 Parameters for a course limit surface display mesh. SubD display density = adaptive SubDDisplayParameters.Density.CoarseDensity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static SubDDisplayParameters Coarse()
Public Shared Function Coarse As SubDDisplayParameters
Return Value
Type: SubDDisplayParameters
The SubD display parameters.
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace