RhinoCommon API
RenderTexture.GetProceduralImpulseNoiseArraySize Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetProceduralImpulseNoiseArraySize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static uint GetProceduralImpulseNoiseArraySize()
Public Shared Function GetProceduralImpulseNoiseArraySize As UInteger
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetProceduralImpulseNoiseArraySize"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace