RhinoCommon API
Dialogs.ShowLayerMaterialDialog Method
 Show a modal dialog to edit the material in the layer specified in layerIndices.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool ShowLayerMaterialDialog(
	RhinoDoc doc,
	IEnumerable<int> layerIndices
)
Public Shared Function ShowLayerMaterialDialog (
	doc As RhinoDoc,
	layerIndices As IEnumerable(Of Integer)
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
Rhino document
layerIndices
Type: System.Collections.Generic.IEnumerable<Int32>
true if the new layer button will be visible.
Return Value
Type: Boolean
 True if the dialog was closed with the OK button. False if the dialog was closed with escape.
See Also
Reference
Dialogs Class
Rhino.UI Namespace