RhinoCommon API
PlugIn.LoadPlugIn Method (Guid, Boolean, Boolean)
 Loads an installed plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool LoadPlugIn(
	Guid pluginId,
	bool loadQuietly,
	bool forceLoad
)
Public Shared Function LoadPlugIn (
	pluginId As Guid,
	loadQuietly As Boolean,
	forceLoad As Boolean
) As Boolean
Parameters
pluginId
Type: System.Guid
The id of the installed plug-in.
loadQuietly
Type: System.Boolean
Load the plug-in quietly.
forceLoad
Type: System.Boolean
Load plug-in even if previous attempt to load has failed.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
PlugIn Class
LoadPlugIn Overload
Rhino.PlugIns Namespace