RhinoCommon API
Point3f.Subtraction Operator
 Subtracts a point from another point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector3f operator -(
	Point3f point1,
	Point3f point2
)
Public Shared Operator - (
	point1 As Point3f,
	point2 As Point3f
) As Vector3f
Parameters
point1
Type: Rhino.Geometry.Point3f
A point.
point2
Type: Rhino.Geometry.Point3f
Another point.
Return Value
Type: Vector3f
A new vector that is the difference of point minus vector.
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace