RhinoCommon API
PlugIn.GetPlugInObject Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.GetPlugInObject"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual Object GetPlugInObject()
Public Overridable Function GetPlugInObject As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.GetPlugInObject"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace