RhinoCommon API
RhinoObject.GetSubObjects Method
 Explodes the object into sub-objects. It is up to the caller to add the returned objects to the document.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoObject[] GetSubObjects()
Public Function GetSubObjects As RhinoObject()
Return Value
Type: RhinoObject[]
An array of Rhino objects, or null if this object cannot be exploded.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace