RhinoCommon API
Brep.CreateBooleanUnion Method (IEnumerable<Brep>, Double, Boolean, Point3d[], Point3d[], Point3d[])
 Compute the Boolean Union of a set of Breps.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Brep[] CreateBooleanUnion(
	IEnumerable<Brep> breps,
	double tolerance,
	bool manifoldOnly,
	out Point3d[] nakedEdgePoints,
	out Point3d[] badIntersectionPoints,
	out Point3d[] nonManifoldEdgePoints
)
Public Shared Function CreateBooleanUnion (
	breps As IEnumerable(Of Brep),
	tolerance As Double,
	manifoldOnly As Boolean,
	<OutAttribute> ByRef nakedEdgePoints As Point3d(),
	<OutAttribute> ByRef badIntersectionPoints As Point3d(),
	<OutAttribute> ByRef nonManifoldEdgePoints As Point3d()
) As Brep()
Parameters
breps
Type: System.Collections.Generic.IEnumerable<Brep>
Breps to union.
tolerance
Type: System.Double
Tolerance to use for union operation.
manifoldOnly
Type: System.Boolean
If true, non-manifold input breps are ignored.
nakedEdgePoints
Type: Rhino.Geometry.Point3d[]
 If Boolean failed because the intersection hit a naked edge, a point will be added where the intersection hits the edge.
badIntersectionPoints
Type: Rhino.Geometry.Point3d[]
 If Boolean failed because an intersection ends on the interior of both surfaces, a point is added.This happens when the surface intersector fails.
nonManifoldEdgePoints
Type: Rhino.Geometry.Point3d[]
 If Boolean failed because the intersection hit a non-manifold edge, a point will be added where the intersection hits the edge.
Return Value
Type: Brep[]
An array of Brep results or null on failure.
Remarks
 Breps that have never been added to a document may need preparing first, or this method can fail, or return an unexpected result. See PrepareForBooleans().
See Also
Reference
Brep Class
CreateBooleanUnion Overload
Rhino.Geometry Namespace
Brep.PrepareForBooleans()