RhinoCommon API
FileFbxWriteOptions Constructor
Initializes a new instance of the FileFbxWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileFbxWriteOptions()
Public Sub New
See Also
Reference
FileFbxWriteOptions Class
Rhino.FileIO Namespace