RhinoCommon API
DisplayModeDescription.Finalize Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayModeDescription.Finalize"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace