RhinoCommon API
SupportOptions.LabelFormatUtc Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.LabelFormatUtc"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static int LabelFormatUtc()
Public Shared Function LabelFormatUtc As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.LabelFormatUtc"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace