RhinoCommon API
LightTable.Delete Method (LightObject)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LightTable.Delete(Rhino.DocObjects.LightObject)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override bool Delete(
	LightObject item
)
Public Overrides Function Delete (
	item As LightObject
) As Boolean
Parameters
item
Type: Rhino.DocObjects.LightObject
[Missing <param name="item"/> documentation for "M:Rhino.DocObjects.Tables.LightTable.Delete(Rhino.DocObjects.LightObject)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LightTable.Delete(Rhino.DocObjects.LightObject)"]
See Also
Reference
LightTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace