RhinoCommon API
Point3d.UnaryNegation Operator
 Computes the additive inverse of all coordinates in the point, and returns the new point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Point3d operator -(
	Point3d point
)
Public Shared Operator - (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
Return Value
Type: Point3d
A point value that, when summed with the point input, yields the Origin.
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace