RhinoCommon API
Squisher.SquishMesh Method (SquishParameters, Mesh)
 Squish the given mesh into a flat mesh
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public Mesh SquishMesh(
	SquishParameters sp,
	Mesh mesh3d
)
Public Function SquishMesh (
	sp As SquishParameters,
	mesh3d As Mesh
) As Mesh
Parameters
sp
Type: Rhino.Geometry.SquishParameters
The parameters for the squish operation
mesh3d
Type: Rhino.Geometry.Mesh
The mesh to squish
Return Value
Type: Mesh
A flattened mesh
See Also
Reference
Squisher Class
SquishMesh Overload
Rhino.Geometry Namespace