RhinoCommon API
CloudHostUtils.CheckEntitlement Method
 Performs the cloud entitlement check (and on AMI-based Marketplace products, also submits a metering record). Re-callable — each invocation runs the gate independently and the platform implementation makes no claim of idempotency. On EC2 with a Marketplace-attached product code and the right IAM role this calls AWS Marketplace MeterUsage; elsewhere this is a no-op.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.33
Syntax
public static void CheckEntitlement()
Public Shared Sub CheckEntitlement
See Also
Reference
CloudHostUtils Class
Rhino.Runtime Namespace