RhinoCommon API
Decal.UVBounds Method
 The UV bounds of the decal. Only used when mapping is UV.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public void UVBounds(
	ref double minUOut,
	ref double minVOut,
	ref double maxUOut,
	ref double maxVOut
)
Public Sub UVBounds (
	ByRef minUOut As Double,
	ByRef minVOut As Double,
	ByRef maxUOut As Double,
	ByRef maxVOut As Double
)
Parameters
minUOut
Type: System.Double
[Missing <param name="minUOut"/> documentation for "M:Rhino.Render.Decal.UVBounds(System.Double@,System.Double@,System.Double@,System.Double@)"]
minVOut
Type: System.Double
[Missing <param name="minVOut"/> documentation for "M:Rhino.Render.Decal.UVBounds(System.Double@,System.Double@,System.Double@,System.Double@)"]
maxUOut
Type: System.Double
[Missing <param name="maxUOut"/> documentation for "M:Rhino.Render.Decal.UVBounds(System.Double@,System.Double@,System.Double@,System.Double@)"]
maxVOut
Type: System.Double
[Missing <param name="maxVOut"/> documentation for "M:Rhino.Render.Decal.UVBounds(System.Double@,System.Double@,System.Double@,System.Double@)"]
See Also
Reference
Decal Class
Rhino.Render Namespace