RhinoCommon API
MeshUnwrapper.Unwrap Method
 Unwraps the meshes passed in as constructor arguments and stores the results in texture coordinates.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public bool Unwrap(
	MeshUnwrapMethod method
)
Public Function Unwrap (
	method As MeshUnwrapMethod
) As Boolean
Parameters
method
Type: Rhino.Geometry.MeshUnwrapMethod
Unwrap method to be used
Return Value
Type: Boolean
True on success
See Also
Reference
MeshUnwrapper Class
Rhino.Geometry Namespace