RhinoCommon API
RhinoObject.SetTextureMapping Method (Int32, TextureMapping, Transform)
 Sets texture mapping and mapping object transform for a channel
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.26
Syntax
public int SetTextureMapping(
	int channel,
	TextureMapping tm,
	Transform objectTransform
)
Public Function SetTextureMapping (
	channel As Integer,
	tm As TextureMapping,
	objectTransform As Transform
) As Integer
Parameters
channel
Type: System.Int32
[Missing <param name="channel"/> documentation for "M:Rhino.DocObjects.RhinoObject.SetTextureMapping(System.Int32,Rhino.Render.TextureMapping,Rhino.Geometry.Transform)"]
tm
Type: Rhino.Render.TextureMapping
The TextureMapping to set into this channel, or null to remove a texture mapping from a channel.
objectTransform
Type: Rhino.Geometry.Transform
Mapping channel object transform
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.SetTextureMapping(System.Int32,Rhino.Render.TextureMapping,Rhino.Geometry.Transform)"]
See Also
Reference
RhinoObject Class
SetTextureMapping Overload
Rhino.DocObjects Namespace