RhinoCommon API
Brep.CreateCurvatureAnalysisMesh Method (Brep, CurvatureAnalysisSettingsState)
 Create an array of analysis meshes for the brep using the specified settings. Meshes aren't set on the brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Mesh[] CreateCurvatureAnalysisMesh(
	Brep brep,
	CurvatureAnalysisSettingsState state
)
Public Shared Function CreateCurvatureAnalysisMesh (
	brep As Brep,
	state As CurvatureAnalysisSettingsState
) As Mesh()
Parameters
brep
Type: Rhino.Geometry.Brep
The brep to mesh.
state
Type: Rhino.ApplicationSettings.CurvatureAnalysisSettingsState
 CurvatureAnalysisSettingsState
Return Value
Type: Mesh[]
The analysis meshes. The array is empty if no mesh could be created.
Remarks
 The mesh density comes from the active document, and falls back to MeshingParameters.DefaultAnalysisMesh when there is no active document, as when running headless or in Compute.
 Each mesh covers the untrimmed surface under a face, so on a trimmed face the mesh extends past the trims and any statistic taken from it includes area that is not part of the brep.
See Also
Reference
Brep Class
CreateCurvatureAnalysisMesh Overload
Rhino.Geometry Namespace