RhinoCommon API
SupportOptions.SetAlwaysShowSunPreview Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetAlwaysShowSunPreview(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void SetAlwaysShowSunPreview(
	bool b
)
Public Shared Sub SetAlwaysShowSunPreview (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetAlwaysShowSunPreview(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace