RhinoCommon API
LayerTable.GetSorted Method
 Gets an array of layer indices that are sorted by the values of SortIndex.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.34
Syntax
public int[] GetSorted()
Public Function GetSorted As Integer()
Return Value
Type: Int32[]
An array of layer indices.
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace