RhinoCommon API
RhinoView.FromRuntimeSerialNumber Method
 Get a RhinoView from it's unique runtime serial number
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RhinoView FromRuntimeSerialNumber(
	uint serialNumber
)
Public Shared Function FromRuntimeSerialNumber (
	serialNumber As UInteger
) As RhinoView
Parameters
serialNumber
Type: System.UInt32
[Missing <param name="serialNumber"/> documentation for "M:Rhino.Display.RhinoView.FromRuntimeSerialNumber(System.UInt32)"]
Return Value
Type: RhinoView
RhinoView or null if no view exists for a given serial number
See Also
Reference
RhinoView Class
Rhino.Display Namespace