RhinoCommon API
TextFields.LayoutUserText Method (String, String)
 Returns user text value from a layout id Key
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string LayoutUserText(
	string layoutId,
	string key
)
Public Shared Function LayoutUserText (
	layoutId As String,
	key As String
) As String
Parameters
layoutId
Type: System.String
[Missing <param name="layoutId"/> documentation for "M:Rhino.Runtime.TextFields.LayoutUserText(System.String,System.String)"]
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Runtime.TextFields.LayoutUserText(System.String,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.LayoutUserText(System.String,System.String)"]
See Also
Reference
TextFields Class
LayoutUserText Overload
Rhino.Runtime Namespace