RhinoCommon API
RenderContent.OpenInModalEditor Method
Note: This API is now obsolete.
 Call this method to open the content in the a modal version of the editor. The content must be in the document or the call will fail.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
[ObsoleteAttribute("Obsolete, use Edit a version that returns a RenderContent",
	false)]
public bool OpenInModalEditor()
<ObsoleteAttribute("Obsolete, use Edit a version that returns a RenderContent",
	false)>
Public Function OpenInModalEditor As Boolean
Return Value
Type: Boolean
 Returns true on success or false on error.
See Also
Reference
RenderContent Class
Rhino.Render Namespace