RhinoCommon API
SnapShotsClient.RegisterSnapShotClient Method
 Function used to register snapshots client
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool RegisterSnapShotClient(
	SnapShotsClient client
)
Public Shared Function RegisterSnapShotClient (
	client As SnapShotsClient
) As Boolean
Parameters
client
Type: Rhino.DocObjects.SnapShots.SnapShotsClient
[Missing <param name="client"/> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.RegisterSnapShotClient(Rhino.DocObjects.SnapShots.SnapShotsClient)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.RegisterSnapShotClient(Rhino.DocObjects.SnapShots.SnapShotsClient)"]
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace