RhinoCommon API
PlugIn.ResetMessageBoxes Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.ResetMessageBoxes"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ResetMessageBoxes()
Protected Overridable Sub ResetMessageBoxes
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace