RhinoCommon API
Box.GetCorners Method
 Gets an array of the 8 corner points of this box, or an empty array if this box is not valid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d[] GetCorners()
Public Function GetCorners As Point3d()
Return Value
Type: Point3d[]
An array of 0 or 8 corners.
See Also
Reference
Box Structure
Rhino.Geometry Namespace