RhinoCommon API
NamedParametersEventArgs.TryGetPoint Method
 Try to get a Point3d value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool TryGetPoint(
	string name,
	out Point3d value
)
Public Function TryGetPoint (
	name As String,
	<OutAttribute> ByRef value As Point3d
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetPoint(System.String,Rhino.Geometry.Point3d@)"]
value
Type: Rhino.Geometry.Point3d
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetPoint(System.String,Rhino.Geometry.Point3d@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetPoint(System.String,Rhino.Geometry.Point3d@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace