RhinoCommon API
LinearWorkflow Constructor (LinearWorkflow)
 Create a utility object not associated with any document from another object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LinearWorkflow(
	LinearWorkflow src
)
Public Sub New (
	src As LinearWorkflow
)
Parameters
src
Type: Rhino.Render.LinearWorkflow
[Missing <param name="src"/> documentation for "M:Rhino.Render.LinearWorkflow.#ctor(Rhino.Render.LinearWorkflow)"]
See Also
Reference
LinearWorkflow Class
LinearWorkflow Overload
Rhino.Render Namespace