RhinoCommon API
DisplayPipeline.GetDrawListSerialNumbers Method
 Gets the current model and page view draw list serial numbers, which can be used to determine if a model or page view needs to be redrawn.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static void GetDrawListSerialNumbers(
	out uint modelSerialNumber,
	out uint pageSerialNumber
)
Public Shared Sub GetDrawListSerialNumbers (
	<OutAttribute> ByRef modelSerialNumber As UInteger,
	<OutAttribute> ByRef pageSerialNumber As UInteger
)
Parameters
modelSerialNumber
Type: System.UInt32
The current model draw list serial number.
pageSerialNumber
Type: System.UInt32
The current page view draw list serial number.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace