RhinoCommon API
SquishParameters.GetSpringConstants Method
 See if the spring constants could have been set with SetSpringConstants().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public bool GetSpringConstants(
	out double boundaryBias,
	out double deformationBias
)
Public Function GetSpringConstants (
	<OutAttribute> ByRef boundaryBias As Double,
	<OutAttribute> ByRef deformationBias As Double
) As Boolean
Parameters
boundaryBias
Type: System.Double
 boundary_bias: 0.0 to 1.0 0.0: boundary and interior treated the same 1.0: strongest bias to preserving boundary lengths at the expense of interior distortion.
deformationBias
Type: System.Double
 deformation_bias: -1.0 to 1.0 -1.0: strongest bias in favor of compression. 0.0: no preference between compression and stretching 1.0: strongest bias in favor of stretching
Return Value
Type: Boolean
 If the spring constants have values that could be set by calling SetSpringConstants(), then boundary_bias and deformation_bias are set to those values and this function returns true. Otherwise, boundaryBias and deformationBias are set to 0.0 and false is returned.
See Also
Reference
SquishParameters Class
Rhino.Geometry Namespace