RhinoCommon API
FileDst.Read Method
Read a dst file into a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	FileDstReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As FileDstReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.FileDstReadOptions
options used for importing the dst file
Return Value
Type: Boolean
true on success
See Also
Reference
FileDst Class
Rhino.FileIO Namespace