RhinoCommon API
GeometryBase.DeleteUserString Method
[Missing <summary> documentation for "M:Rhino.Geometry.GeometryBase.DeleteUserString(System.String)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public bool DeleteUserString(
	string key
)
Public Function DeleteUserString (
	key As String
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Geometry.GeometryBase.DeleteUserString(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.GeometryBase.DeleteUserString(System.String)"]
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace