RhinoCommon API
AppearanceSettings.SetToDarkMode Method
Set UI to the default dark mode color scheme
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
public static bool SetToDarkMode()
Public Shared Function SetToDarkMode As Boolean
Return Value
Type: Boolean
true on sucess
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace