RhinoCommon API
BrepEdge.TrimIndices Method
 Gets the indices of all trims associated with this edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.12
Syntax
public int[] TrimIndices()
Public Function TrimIndices As Integer()
Return Value
Type: Int32[]
Empty array on failure.
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace