RhinoCommon API
PostEffectUI.AddSection Method
 Add a section to the UI.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void AddSection(
	ICollapsibleSection section
)
Public Sub AddSection (
	section As ICollapsibleSection
)
Parameters
section
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="section"/> documentation for "M:Rhino.Render.PostEffects.PostEffectUI.AddSection(Rhino.UI.Controls.ICollapsibleSection)"]
See Also
Reference
PostEffectUI Class
Rhino.Render.PostEffects Namespace