RhinoCommon API
PointCloudUnsafeLock.PointArray Method
 Retrieves a pointer to the raw point array, which uses coordinates defined with double precision floating point numbers, or null if none is available.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public Point3d* PointArray(
	out int length
)
Visual Basic does not support APIs that consume or return unsafe types.
Parameters
length
Type: System.Int32
The length of the array. This value is returned by reference (out in C#). 0 is returned when there is no single precision array.
Return Value
Type: Point3d*
The beginning of the point array. Item 0 is the first vertex, and item length-1 is the last valid one. If no array is available, null is returned.
See Also
Reference
PointCloudUnsafeLock Class
Rhino.Geometry Namespace