RhinoCommon API
GroupTable.FindNameHash Method
 Finds a group given its name hash.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Group FindNameHash(
	NameHash nameHash
)
Public Function FindNameHash (
	nameHash As NameHash
) As Group
Parameters
nameHash
Type: Rhino.FileIO.NameHash
The name hash of the group to be searched.
Return Value
Type: Group
An group, or null on error.
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace