RhinoCommon API
ObjectTable.AddBox Method (Box)
 Adds a box to the object table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid AddBox(
	Box box
)
Public Function AddBox (
	box As Box
) As Guid
Parameters
box
Type: Rhino.Geometry.Box
The box.
Return Value
Type: Guid
The ID.
See Also
Reference
ObjectTable Class
AddBox Overload
Rhino.DocObjects.Tables Namespace