RhinoCommon API
DisplayPipeline.PopDepthTesting Method
 Pop a DepthTesting flag off the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void PopDepthTesting()
Public Sub PopDepthTesting
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace