RhinoCommon API
ColorHSV.CreateFromHSL Method
 Constructs the nearest HSV equivalent of an HSL color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ColorHSV CreateFromHSL(
	ColorHSL hsl
)
Public Shared Function CreateFromHSL (
	hsl As ColorHSL
) As ColorHSV
Parameters
hsl
Type: Rhino.Display.ColorHSL
Target color in HSL space.
Return Value
Type: ColorHSV
The HSV equivalent of the HSL color.
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace