RhinoCommon API
NurbsCurveFitParameters.GetSmoothingIntensityFromCoefficient Method
 Returns the NurbsCurveFitParameters.Intensity value that corresponds to a given smoothing coefficient.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public NurbsCurveFitParameters.Intensity GetSmoothingIntensityFromCoefficient(
	double coefficient
)
Public Function GetSmoothingIntensityFromCoefficient (
	coefficient As Double
) As NurbsCurveFitParameters.Intensity
Parameters
coefficient
Type: System.Double
[Missing <param name="coefficient"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.GetSmoothingIntensityFromCoefficient(System.Double)"]
Return Value
Type: NurbsCurveFitParameters.Intensity
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.GetSmoothingIntensityFromCoefficient(System.Double)"]
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace