RhinoCommon API
DisplayModeDescription.UpdateDisplayMode Method (DisplayModeDescription, Boolean)
 Updates an existing display mode.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool UpdateDisplayMode(
	DisplayModeDescription displayMode,
	bool bSave
)
Public Shared Function UpdateDisplayMode (
	displayMode As DisplayModeDescription,
	bSave As Boolean
) As Boolean
Parameters
displayMode
Type: Rhino.Display.DisplayModeDescription
The display mode description to update.
bSave
Type: System.Boolean
True to save the display mode to disk, false otherwise.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
DisplayModeDescription Class
UpdateDisplayMode Overload
Rhino.Display Namespace