RhinoCommon API
SupportOptions.BlockContent_ShowBlockContent Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.BlockContent_ShowBlockContent"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool BlockContent_ShowBlockContent()
Public Shared Function BlockContent_ShowBlockContent As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.BlockContent_ShowBlockContent"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace