RhinoCommon API
LinearDimension Constructor
Initializes a new instance of the LinearDimension class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public LinearDimension()
Public Sub New
See Also
Reference
LinearDimension Class
LinearDimension Overload
Rhino.Geometry Namespace