RhinoCommon API
RhinoDoc.ClearUndoRecords Method (UInt32, Boolean)
[Missing <summary> documentation for "M:Rhino.RhinoDoc.ClearUndoRecords(System.UInt32,System.Boolean)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void ClearUndoRecords(
	uint undoSerialNumber,
	bool purgeDeletedObjects
)
Public Sub ClearUndoRecords (
	undoSerialNumber As UInteger,
	purgeDeletedObjects As Boolean
)
Parameters
undoSerialNumber
Type: System.UInt32
[Missing <param name="undoSerialNumber"/> documentation for "M:Rhino.RhinoDoc.ClearUndoRecords(System.UInt32,System.Boolean)"]
purgeDeletedObjects
Type: System.Boolean
[Missing <param name="purgeDeletedObjects"/> documentation for "M:Rhino.RhinoDoc.ClearUndoRecords(System.UInt32,System.Boolean)"]
See Also
Reference
RhinoDoc Class
ClearUndoRecords Overload
Rhino Namespace