RhinoCommon API
Field.ValueAsByteArray Method
 Return field as a byte array.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected byte[] ValueAsByteArray()
Protected Function ValueAsByteArray As Byte()
Return Value
Type: Byte[]
Return field as a byte array.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace