RhinoCommon API
SubD.CreateTriSphere Method
 Creates a SubD sphere made from triangular faces. This is a goofy topology for a Catmull-Clark subdivision surface (all triangles and all vertices have 5 or 6 edges). You may want to consider using the much behaved result from CreateSubDQuadSphere() or even the result from CreateSubDGlobeSphere().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static SubD CreateTriSphere(
	Sphere sphere,
	SubDComponentLocation vertexLocation,
	uint triSubdivisionLevel
)
Public Shared Function CreateTriSphere (
	sphere As Sphere,
	vertexLocation As SubDComponentLocation,
	triSubdivisionLevel As UInteger
) As SubD
Parameters
sphere
Type: Rhino.Geometry.Sphere
Location, size and orientation of the sphere.
vertexLocation
Type: Rhino.Geometry.SubDComponentLocation
 If vertexLocation = SubDComponentLocation::ControlNet, then the control net points will be on the surface of the sphere. Otherwise the limit surface points will be on the sphere.
triSubdivisionLevel
Type: System.UInt32
 The resulting sphere will have 20*4^subdivision level triangles. (0 for 20 triangles, 1 for 80 triangles, 2 for 320 triangles, ...).
Return Value
Type: SubD
 If the input parameters are valid, a SubD tri sphere is returned. Otherwise null is returned.
See Also
Reference
SubD Class
Rhino.Geometry Namespace