RhinoCommon API
Curve.GetConicSectionType Method (Point3d, Point3d, Point3d)
 Returns the type of conic section based on the curve's shape.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ConicSectionType GetConicSectionType(
	out Point3d focus1,
	out Point3d focus2,
	out Point3d center
)
Public Function GetConicSectionType (
	<OutAttribute> ByRef focus1 As Point3d,
	<OutAttribute> ByRef focus2 As Point3d,
	<OutAttribute> ByRef center As Point3d
) As ConicSectionType
Parameters
focus1
Type: Rhino.Geometry.Point3d
The first focus point, if applicable.
focus2
Type: Rhino.Geometry.Point3d
The second focus point, if applicable.
center
Type: Rhino.Geometry.Point3d
The center point, if applicable.
Return Value
Type: ConicSectionType
[Missing <returns> documentation for "M:Rhino.Geometry.Curve.GetConicSectionType(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)"]
See Also
Reference
Curve Class
GetConicSectionType Overload
Rhino.Geometry Namespace