RhinoCommon API
IZooClientUtilities.CheckOutLicense Method
 Checks out a loaned out license from the owning Zoo.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool CheckOutLicense(
	Object verify,
	Guid productId
)
Function CheckOutLicense (
	verify As Object,
	productId As Guid
) As Boolean
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.CheckOutLicense(System.Object,System.Guid)"]
productId
Type: System.Guid
[Missing <param name="productId"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.CheckOutLicense(System.Object,System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.CheckOutLicense(System.Object,System.Guid)"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace