RhinoCommon API
ContentUndoHelper.AddContent Method
 Call this *after* adding a content. Undo will cause the content to be deleted.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AddContent(
	RenderContent content,
	RenderContent parent
)
Public Function AddContent (
	content As RenderContent,
	parent As RenderContent
) As Boolean
Parameters
content
Type: Rhino.Render.RenderContent
Content you just added to the ContentList.
parent
Type: Rhino.Render.RenderContent
 is the content that will become the parent of the new content, or null if the new content is being added at the top level (i.e., not a child).
Return Value
Type: Boolean
true if the content was added.
See Also
Reference
ContentUndoHelper Class
Rhino.Render Namespace