RhinoCommon API
DimensionStyle.IsFieldOverriden Method
[Missing <summary> documentation for "M:Rhino.DocObjects.DimensionStyle.IsFieldOverriden(Rhino.DocObjects.DimensionStyle.Field)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsFieldOverriden(
	DimensionStyle.Field field
)
Public Function IsFieldOverriden (
	field As DimensionStyle.Field
) As Boolean
Parameters
field
Type: Rhino.DocObjects.DimensionStyle.Field
[Missing <param name="field"/> documentation for "M:Rhino.DocObjects.DimensionStyle.IsFieldOverriden(Rhino.DocObjects.DimensionStyle.Field)"]
Return Value
Type: Boolean
 True if the field corresponding to field_id is overridden in this AnnotationStyle False if the field is not overridden
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace