RhinoCommon API
NamedParametersEventArgs.TryGetObjRefs Method
 Try to get an array of ObjRef instances for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool TryGetObjRefs(
	string name,
	out ObjRef[] value
)
Public Function TryGetObjRefs (
	name As String,
	<OutAttribute> ByRef value As ObjRef()
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetObjRefs(System.String,Rhino.DocObjects.ObjRef[]@)"]
value
Type: Rhino.DocObjects.ObjRef[]
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetObjRefs(System.String,Rhino.DocObjects.ObjRef[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetObjRefs(System.String,Rhino.DocObjects.ObjRef[]@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace