RhinoCommon API
PersistentSettingsConverter.TryParseStringDictionary Method
 Attempts to convert a string to a key value string pair array.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool TryParseStringDictionary(
	string s,
	out KeyValuePair<string, string>[] value
)
Public Shared Function TryParseStringDictionary (
	s As String,
	<OutAttribute> ByRef value As KeyValuePair(Of String, String)()
) As Boolean
Parameters
s
Type: System.String
String to parse
value
Type: System.Collections.Generic.KeyValuePair<String, String>[]
 Result will get copied here, if the string is null or empty then this will be an empty array, if there was an error parsing then this will be null otherwise it will be the string parsed as a key value string pair array.
Return Value
Type: Boolean
 Returns true if the string is not empty and properly formatted as a key value string pair list otherwise returns false.
See Also
Reference
PersistentSettingsConverter Class
Rhino Namespace