RhinoCommon API
RhinoList<T>.AddRange Method (IEnumerable<T>)
 Adds the elements of the specified collection to the end of the List.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddRange(
	IEnumerable<T> collection
)
Public Sub AddRange (
	collection As IEnumerable(Of T)
)
Parameters
collection
Type: System.Collections.Generic.IEnumerable<T>
The collection whose elements should be added to the end of the List. The collection itself cannot be a null reference (Nothing in Visual Basic), but it can contain elements that are a null reference (Nothing in Visual Basic), if type T is a reference type.
See Also
Reference
RhinoList<T> Class
AddRange Overload
Rhino.Collections Namespace