RhinoCommon API
EarthAnchorPoint.GetModelCompass Method
 Returns a plane in model coordinates whose X axis points East, Y axis points North and Z axis points Up. The origin is set to ModelBasepoint.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Plane GetModelCompass()
Public Function GetModelCompass As Plane
Return Value
Type: Plane
A plane value. This might be invalid on error.
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace