RhinoCommon API
PersistentSettings.GetStringDictionary Method (String, KeyValuePair<String, String>[])
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[])"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public KeyValuePair<string, string>[] GetStringDictionary(
	string key,
	KeyValuePair<string, string>[] defaultValue
)
Public Function GetStringDictionary (
	key As String,
	defaultValue As KeyValuePair(Of String, String)()
) As KeyValuePair(Of String, String)()
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[])"]
defaultValue
Type: System.Collections.Generic.KeyValuePair<String, String>[]
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[])"]
Return Value
Type: KeyValuePair<String, String>[]
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[])"]
See Also
Reference
PersistentSettings Class
GetStringDictionary Overload
Rhino Namespace