RhinoCommon API
DisplayConduit.PostProcessFrameBuffer Method
 Called after the frame has been drawn, with the finished frame available to be read. Use this to record or stream a viewport: reading the frame here copies the one that was just drawn, and never redraws the scene.
Overriding this makes every frame cost an extra frame buffer read back for as long as the conduit is enabled, whether or not the override reads anything.
The override runs on the thread that drew the frame and holds up the next one. Copy the pixels here and do the rest of the work somewhere else.
The default implementation does nothing.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void PostProcessFrameBuffer(
	PostProcessFrameBufferEventArgs e
)
Protected Overridable Sub PostProcessFrameBuffer (
	e As PostProcessFrameBufferEventArgs
)
Parameters
e
Type: Rhino.Display.PostProcessFrameBufferEventArgs
The event argument gives access to the frame that was drawn.
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace