RhinoCommon API
File3dmNamedConstructionPlanes.Clear Method
 Removes all named construction planes from the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
See Also
Reference
File3dmNamedConstructionPlanes Class
Rhino.FileIO Namespace