RhinoCommon API
FileGHSReadOptions Constructor
Initializes a new instance of the FileGHSReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileGHSReadOptions()
Public Sub New
See Also
Reference
FileGHSReadOptions Class
Rhino.FileIO Namespace