RhinoCommon API
Unroller.PerformUnroll Method (Curve[], Point3d[], TextDot[])
 Executes unrolling operations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep[] PerformUnroll(
	out Curve[] unrolledCurves,
	out Point3d[] unrolledPoints,
	out TextDot[] unrolledDots
)
Public Function PerformUnroll (
	<OutAttribute> ByRef unrolledCurves As Curve(),
	<OutAttribute> ByRef unrolledPoints As Point3d(),
	<OutAttribute> ByRef unrolledDots As TextDot()
) As Brep()
Parameters
unrolledCurves
Type: Rhino.Geometry.Curve[]
An array of unrolled curves is assigned during the call in this out parameter.
unrolledPoints
Type: Rhino.Geometry.Point3d[]
An array of unrolled points is assigned during the call in this out parameter.
unrolledDots
Type: Rhino.Geometry.TextDot[]
An array of unrolled text dots is assigned during the call in this out parameter.
Return Value
Type: Brep[]
An array of breps. This array can be empty.
See Also
Reference
Unroller Class
PerformUnroll Overload
Rhino.Geometry Namespace