RhinoCommon API
NamedColorList Constructor (String)
 Initializes a new instance of the ColorList with the specified name.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public NamedColorList(
	string name
)
Public Sub New (
	name As String
)
Parameters
name
Type: System.String
Name of the list (required)
See Also
Reference
NamedColorList Class
NamedColorList Overload
Rhino.UI Namespace