RhinoCommon API
RhinoViewport.PopConstructionPlane Method
 Sets the construction plane to the plane that was active before the last call to PushConstructionPlane.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool PopConstructionPlane()
Public Function PopConstructionPlane As Boolean
Return Value
Type: Boolean
true if a construction plane was popped.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace