RhinoCommon API
Mesh.Weld Method (Double, Boolean)
 Makes sure that faces sharing an edge and having a difference of normal less than or equal to angleToleranceRadians share vertices along that edge, vertex normals are averaged.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Weld(
	double angleToleranceRadians,
	bool preserveSurfaceParameters
)
Public Sub Weld (
	angleToleranceRadians As Double,
	preserveSurfaceParameters As Boolean
)
Parameters
angleToleranceRadians
Type: System.Double
Angle at which to weld vertices.
preserveSurfaceParameters
Type: System.Boolean
 If true, vertex copies whose surface parameters differ are never merged into a single vertex - the edge between them is left unwelded instead of averaging or discarding one side's parameters. Vertex copies whose surface parameters already match are still merged normally.
See Also
Reference
Mesh Class
Weld Overload
Rhino.Geometry Namespace