RhinoCommon API
TextFields.DimValue Method (String, String)
 Returns the measured value of a dimension formatted with the named annotation style.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static string DimValue(
	string dimensionId,
	string styleNameOrId
)
Public Shared Function DimValue (
	dimensionId As String,
	styleNameOrId As String
) As String
Parameters
dimensionId
Type: System.String
[Missing <param name="dimensionId"/> documentation for "M:Rhino.Runtime.TextFields.DimValue(System.String,System.String)"]
styleNameOrId
Type: System.String
[Missing <param name="styleNameOrId"/> documentation for "M:Rhino.Runtime.TextFields.DimValue(System.String,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.DimValue(System.String,System.String)"]
See Also
Reference
TextFields Class
DimValue Overload
Rhino.Runtime Namespace