RhinoCommon API
MeshVertexList.ShowAll Method
 Shows all vertices in the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void ShowAll()
Public Sub ShowAll
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace