RhinoCommon API
ReplayHistoryData.Dispose Method
Releases all resources used by the ReplayHistoryData
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace