RhinoCommon API
DrawingUtilities.DarkModeConvertPixel Method
 Attempt to adjust pixels to an image that works for dark mode
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void DarkModeConvertPixel(
	ref byte r,
	ref byte g,
	ref byte b
)
Public Shared Sub DarkModeConvertPixel (
	ByRef r As Byte,
	ByRef g As Byte,
	ByRef b As Byte
)
Parameters
r
Type: System.Byte
Red
g
Type: System.Byte
Green
b
Type: System.Byte
Vlue
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace