RhinoCommon API
ColorRGBA.CompareTo Method
 Compares this ColorRGBA with another ColorRGBA.
Channels evaluation priority is first A, then R, then G, then B.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int CompareTo(
	ColorRGBA other
)
Public Function CompareTo (
	other As ColorRGBA
) As Integer
Parameters
other
Type: Rhino.Display.ColorRGBA
The other ColorRGBA to use in comparison.
Return Value
Type: Int32
 0: if this is identical to other
-1: if this < other
+1: if this > other
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace