RhinoCommon API
SubDEdgeSharpness Constructor (Double)
 Creates a sharpness with the same value at both ends.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDEdgeSharpness(
	double sharpness
)
Public Sub New (
	sharpness As Double
)
Parameters
sharpness
Type: System.Double
 Between 0.0 and MaximumValue, or CreaseValue.
Remarks
 If sharpness is not valid, the result is Nan.
See Also
Reference
SubDEdgeSharpness Structure
SubDEdgeSharpness Overload
Rhino.Geometry Namespace