RhinoCommon API
DisplayPipeline.DrawActivePoint Method
 Draws a point in style used during "GetPoint" operations
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawActivePoint(
	Point3d point
)
Public Sub DrawActivePoint (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
Location of the point in world coordinates
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace