RhinoCommon API
PersistentSettings.SetEnumValue<T> Method (T)
 Set an enumerated value in the settings.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public void SetEnumValue<T>(
	T enumValue
)
where T : struct, new(), IConvertible
Public Sub SetEnumValue(Of T As {Structure, New, IConvertible}) (
	enumValue As T
)
Parameters
enumValue
Type: T
[Missing <param name="enumValue"/> documentation for "M:Rhino.PersistentSettings.SetEnumValue``1(``0)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.PersistentSettings.SetEnumValue``1(``0)"]
See Also
Reference
PersistentSettings Class
SetEnumValue Overload
Rhino Namespace