RhinoCommon API
CustomDisplay Constructor
 Constructs a new CustomDisplay instance. You must call Dispose() when you are done with this instance, otherwise the display methods will never be switched off.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public CustomDisplay(
	bool enable
)
Public Sub New (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
If true, the display will be enabled immediately.
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace