RhinoCommon API
MatchSrfSettings.EnableRefinement Method
 Enable refinement of the surface being edited
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public void EnableRefinement(
	bool enabled,
	double positionalTolerance = 0.001,
	double angleToleranceRadians = 0.0174532925199433,
	double curvatureTolerance = 0.05
)
Public Sub EnableRefinement (
	enabled As Boolean,
	Optional positionalTolerance As Double = 0.001,
	Optional angleToleranceRadians As Double = 0.0174532925199433,
	Optional curvatureTolerance As Double = 0.05
)
Parameters
enabled
Type: System.Boolean
Switch refinement on or off
positionalTolerance (Optional)
Type: System.Double
absolute distance
angleToleranceRadians (Optional)
Type: System.Double
angle between surface normals
curvatureTolerance (Optional)
Type: System.Double
percentage difference in radius of curvature
See Also
Reference
MatchSrfSettings Class
Rhino.Geometry Namespace