RhinoCommon API
FileSkpWriteOptions Constructor
Initializes a new instance of the FileSkpWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileSkpWriteOptions()
Public Sub New
See Also
Reference
FileSkpWriteOptions Class
Rhino.FileIO Namespace