RhinoCommon API
Brep.Split Method (Brep, Double, Boolean)
 Splits a Brep into pieces using a Brep as a cutter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep[] Split(
	Brep cutter,
	double intersectionTolerance,
	out bool toleranceWasRaised
)
Public Function Split (
	cutter As Brep,
	intersectionTolerance As Double,
	<OutAttribute> ByRef toleranceWasRaised As Boolean
) As Brep()
Parameters
cutter
Type: Rhino.Geometry.Brep
The Brep to use as a cutter.
intersectionTolerance
Type: System.Double
The tolerance with which to compute intersections.
toleranceWasRaised
Type: System.Boolean
 Set to true if the split failed at intersectionTolerance but succeeded when the tolerance was increased to twice intersectionTolerance.
Return Value
Type: Brep[]
A new array of Breps. This array can be empty.
See Also
Reference
Brep Class
Split Overload
Rhino.Geometry Namespace