RhinoCommon API
Mesh.IsPointInside Method
 Determines if a point is inside a solid mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsPointInside(
	Point3d point,
	double tolerance,
	bool strictlyIn
)
Public Function IsPointInside (
	point As Point3d,
	tolerance As Double,
	strictlyIn As Boolean
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
3d point to test.
tolerance
Type: System.Double
 (>=0) 3d distance tolerance used for ray-mesh intersection and determining strict inclusion. This is expected to be a tiny value.
strictlyIn
Type: System.Boolean
 If strictlyIn is true, then point must be inside mesh by at least tolerance in order for this function to return true. If strictlyIn is false, then this function will return true if point is inside or the distance from point to a mesh face is <= tolerance.
Return Value
Type: Boolean
 true if point is inside the solid mesh, false if not.
Remarks
 The caller is responsible for making certain the mesh is valid, closed, and 2-manifold before calling this function. If the mesh is not, the behavior is undetermined.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace