RhinoCommon API
CustomPointObject.Finalize Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomPointObject.Finalize"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
CustomPointObject Class
Rhino.DocObjects.Custom Namespace