RhinoCommon API
SupportOptions.SetShowDocuments Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetShowDocuments(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_SetShowDocuments' instead")]
public static void SetShowDocuments(
	bool b
)
<ObsoleteAttribute("Use 'Libraries_SetShowDocuments' instead")>
Public Shared Sub SetShowDocuments (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetShowDocuments(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace