RhinoCommon API
DisplayPipeline.GetOpenGLWorldToCamera Method
 Get an array of 16 floats that represents the "world" to "camera" coordinate transformation in OpenGL's right handed coordinate system
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public float[] GetOpenGLWorldToCamera(
	bool includeModelTransform
)
Public Function GetOpenGLWorldToCamera (
	includeModelTransform As Boolean
) As Single()
Parameters
includeModelTransform
Type: System.Boolean
[Missing <param name="includeModelTransform"/> documentation for "M:Rhino.Display.DisplayPipeline.GetOpenGLWorldToCamera(System.Boolean)"]
Return Value
Type: Single[]
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipeline.GetOpenGLWorldToCamera(System.Boolean)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace