RhinoCommon API
Vector3f.Transform Method
 Transforms the vector in place.
The transformation matrix acts on the left of the vector; i.e.,
result = transformation*vector
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Transform(
	Transform transformation
)
Public Sub Transform (
	transformation As Transform
)
Parameters
transformation
Type: Rhino.Geometry.Transform
Transformation matrix to apply.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace