RhinoCommon API
RenderContent.ShowContentInstanceBrowser Method
 Allows the user to choose a content by displaying the Content Instance Browser dialog. The dialog will have OK, Cancel and Help buttons, and optional New and Edit buttons. Specifies the document to use.Sets the initially selected content and receives the instance id of the chosen content.Specifies the kind(s) of content that should be displayed in the browser.Specifies which optional buttons to display. Returns true if the user chooses a content or false if the dialog is cancelled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public static bool ShowContentInstanceBrowser(
	RhinoDoc doc,
	ref Guid instance_id,
	RenderContentKind kinds,
	RenderContent.ContentInstanceBrowserButtons buttons
)
Public Shared Function ShowContentInstanceBrowser (
	doc As RhinoDoc,
	ByRef instance_id As Guid,
	kinds As RenderContentKind,
	buttons As RenderContent.ContentInstanceBrowserButtons
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.RenderContent.ShowContentInstanceBrowser(Rhino.RhinoDoc,System.Guid@,Rhino.Render.RenderContentKind,Rhino.Render.RenderContent.ContentInstanceBrowserButtons)"]
instance_id
Type: System.Guid
[Missing <param name="instance_id"/> documentation for "M:Rhino.Render.RenderContent.ShowContentInstanceBrowser(Rhino.RhinoDoc,System.Guid@,Rhino.Render.RenderContentKind,Rhino.Render.RenderContent.ContentInstanceBrowserButtons)"]
kinds
Type: Rhino.Render.RenderContentKind
[Missing <param name="kinds"/> documentation for "M:Rhino.Render.RenderContent.ShowContentInstanceBrowser(Rhino.RhinoDoc,System.Guid@,Rhino.Render.RenderContentKind,Rhino.Render.RenderContent.ContentInstanceBrowserButtons)"]
buttons
Type: Rhino.Render.RenderContent.ContentInstanceBrowserButtons
[Missing <param name="buttons"/> documentation for "M:Rhino.Render.RenderContent.ShowContentInstanceBrowser(Rhino.RhinoDoc,System.Guid@,Rhino.Render.RenderContentKind,Rhino.Render.RenderContent.ContentInstanceBrowserButtons)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.ShowContentInstanceBrowser(Rhino.RhinoDoc,System.Guid@,Rhino.Render.RenderContentKind,Rhino.Render.RenderContent.ContentInstanceBrowserButtons)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace