RhinoCommon API
NamedViewTable.Rename Method (Int32, String)
 Renames a named view.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Rename(
	int index,
	string newName
)
Public Function Rename (
	index As Integer,
	newName As String
) As Boolean
Parameters
index
Type: System.Int32
Index of the named view in the named view table.
newName
Type: System.String
The new name.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
NamedViewTable Class
Rename Overload
Rhino.DocObjects.Tables Namespace