RhinoCommon API
ViewCaptureSettings.SetLayout Method
[Missing <summary> documentation for "M:Rhino.Display.ViewCaptureSettings.SetLayout(System.Drawing.Size,System.Drawing.Rectangle)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetLayout(
	Size mediaSize,
	Rectangle cropRectangle
)
Public Sub SetLayout (
	mediaSize As Size,
	cropRectangle As Rectangle
)
Parameters
mediaSize
Type: System.Drawing.Size
[Missing <param name="mediaSize"/> documentation for "M:Rhino.Display.ViewCaptureSettings.SetLayout(System.Drawing.Size,System.Drawing.Rectangle)"]
cropRectangle
Type: System.Drawing.Rectangle
[Missing <param name="cropRectangle"/> documentation for "M:Rhino.Display.ViewCaptureSettings.SetLayout(System.Drawing.Size,System.Drawing.Rectangle)"]
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace