RhinoCommon API
PointCloud.GetRandomSubsample Method (UInt32, CancellationToken, IProgress<Double>)
 Returns a random subsample of a point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public PointCloud GetRandomSubsample(
	uint numberOfPoints,
	CancellationToken cancelToken,
	IProgress<double> progress
)
Public Function GetRandomSubsample (
	numberOfPoints As UInteger,
	cancelToken As CancellationToken,
	progress As IProgress(Of Double)
) As PointCloud
Parameters
numberOfPoints
Type: System.UInt32
The number of points the new point cloud should contain.
cancelToken
Type: System.Threading.CancellationToken
The cancellation token.
progress
Type: System.IProgress<Double>
The provider for progress updates.
Return Value
Type: PointCloud
A subsample of this point cloud if success, null otherwise.
See Also
Reference
PointCloud Class
GetRandomSubsample Overload
Rhino.Geometry Namespace