RhinoCommon API
DisplayPipeline.DrawSurfaceDirectionIndicators Method
 Draw surface indicators
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void DrawSurfaceDirectionIndicators(
	SurfaceDirectionIndicators directionIndicators
)
Public Sub DrawSurfaceDirectionIndicators (
	directionIndicators As SurfaceDirectionIndicators
)
Parameters
directionIndicators
Type: Rhino.Geometry.SurfaceDirectionIndicators
[Missing <param name="directionIndicators"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSurfaceDirectionIndicators(Rhino.Geometry.SurfaceDirectionIndicators)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace