RhinoCommon API
BinaryArchiveReader.ReadGeometryArray Method
[Missing <summary> documentation for "M:Rhino.FileIO.BinaryArchiveReader.ReadGeometryArray"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public GeometryBase[] ReadGeometryArray()
Public Function ReadGeometryArray As GeometryBase()
Return Value
Type: GeometryBase[]
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveReader.ReadGeometryArray"]
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace