RhinoCommon API
InstanceDefinition.CreatePreviewBitmap Method (Guid, DefinedViewportProjection, IsometricCamera, Boolean, Size, Boolean)
 Creates a preview bitmap of the instance definition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public Bitmap CreatePreviewBitmap(
	Guid displayModeId,
	DefinedViewportProjection viewportProjection,
	IsometricCamera isometricCamera,
	bool drawDecorations,
	Size bitmapSize,
	bool applyDpiScaling
)
Public Function CreatePreviewBitmap (
	displayModeId As Guid,
	viewportProjection As DefinedViewportProjection,
	isometricCamera As IsometricCamera,
	drawDecorations As Boolean,
	bitmapSize As Size,
	applyDpiScaling As Boolean
) As Bitmap
Parameters
displayModeId
Type: System.Guid
The id of the display mode to draw with.
viewportProjection
Type: Rhino.Display.DefinedViewportProjection
The view projection.
isometricCamera
Type: Rhino.Display.IsometricCamera
The isometric camera angle.
drawDecorations
Type: System.Boolean
Specify true to draw viewport decorations, such as grid and axes.
bitmapSize
Type: System.Drawing.Size
The bitmap size in pixels.
applyDpiScaling
Type: System.Boolean
Specify true to apply DPI scaling (Windows-only).
Return Value
Type: Bitmap
The preview bitmap if successful, null otherwise.
See Also
Reference
InstanceDefinition Class
CreatePreviewBitmap Overload
Rhino.DocObjects Namespace