RhinoCommon API
VolumeMassProperties.Compute Method (Brep, Boolean, Boolean, Boolean, Boolean, Double, Double)
 Compute the VolumeMassProperties for a single Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.10
Syntax
public static VolumeMassProperties Compute(
	Brep brep,
	bool volume,
	bool firstMoments,
	bool secondMoments,
	bool productMoments,
	double relativeTolerance,
	double absoluteTolerance
)
Public Shared Function Compute (
	brep As Brep,
	volume As Boolean,
	firstMoments As Boolean,
	secondMoments As Boolean,
	productMoments As Boolean,
	relativeTolerance As Double,
	absoluteTolerance As Double
) As VolumeMassProperties
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to measure.
volume
Type: System.Boolean
true to calculate volume.
firstMoments
Type: System.Boolean
true to calculate volume first moments, volume, and volume centroid.
secondMoments
Type: System.Boolean
true to calculate volume second moments.
productMoments
Type: System.Boolean
true to calculate volume product moments.
relativeTolerance
Type: System.Double
The relative tolerance used for the calculation. In overloads of this function where tolerances are not specified, 1.0e-6 is used.
absoluteTolerance
Type: System.Double
The absolute tolerancwe used for the calculation. In overloads of this function where tolerances are not specified, 1.0e-6 is used.
Return Value
Type: VolumeMassProperties
The VolumeMassProperties for the given Brep or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When brep is null.
See Also
Reference
VolumeMassProperties Class
Compute Overload
Rhino.Geometry Namespace