RhinoCommon API
RenderContentCollection.GetEnumerator Method
 Enumerates the contents in the collection. This makes it possible to use the collection directly in a foreach loop instead of manually driving a ContentCollectionIterator:
foreach (RenderContent content in collection) { ... }
 The collection also implements IEnumerable<RenderContent>, so LINQ can be used on it directly. Note that this method returns the non-generic enumerator for backwards compatibility, which is why the loop variable above is declared as RenderContent rather than var.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IEnumerator GetEnumerator()
Public Function GetEnumerator As IEnumerator
Return Value
Type: IEnumerator
[Missing <returns> documentation for "M:Rhino.Render.RenderContentCollection.GetEnumerator"]
Implements
IEnumerable.GetEnumerator()
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace