RhinoCommon API
DrawingUtilities.DarkModeConvertPixels Method
 Attempt to adjust pixels to an image that works for dark mode
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void DarkModeConvertPixels(
	ref byte[] rgbaBytes
)
Public Shared Sub DarkModeConvertPixels (
	ByRef rgbaBytes As Byte()
)
Parameters
rgbaBytes
Type: System.Byte[]
[Missing <param name="rgbaBytes"/> documentation for "M:Rhino.UI.DrawingUtilities.DarkModeConvertPixels(System.Byte[]@)"]
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace