RhinoCommon API
DisplayPipeline.DrawClippingPlaneWires Method
 Draw a cipping plane
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void DrawClippingPlaneWires(
	ClippingPlaneSurface clippingPlane,
	Color color
)
Public Sub DrawClippingPlaneWires (
	clippingPlane As ClippingPlaneSurface,
	color As Color
)
Parameters
clippingPlane
Type: Rhino.Geometry.ClippingPlaneSurface
[Missing <param name="clippingPlane"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawClippingPlaneWires(Rhino.Geometry.ClippingPlaneSurface,System.Drawing.Color)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawClippingPlaneWires(Rhino.Geometry.ClippingPlaneSurface,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace