RhinoCommon API
UserInterfaceObjectBase.ClearKeyboardFocus Method
 Take keyboard focus away from whichever user interface object has it, so that typing goes to the command line again.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void ClearKeyboardFocus(
	RhinoDoc doc
)
Public Shared Sub ClearKeyboardFocus (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
Document to redraw. This can be null.
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace