RhinoCommon API
PlugIn Constructor
Initializes a new instance of the PlugIn class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected PlugIn()
Protected Sub New
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace