RhinoCommon API
MarkupTable.GetUnusedMarkupName Method
 Gets unused markup name used as default when creating new markups.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string GetUnusedMarkupName()
Public Function GetUnusedMarkupName As String
Return Value
Type: String
The unused name.
See Also
Reference
MarkupTable Class
Rhino.DocObjects.Tables Namespace