RhinoCommon API
SuspendCollectionChangedNotifications<T>.Dispose Method
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
 Namespace: Rhino.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SuspendCollectionChangedNotifications<T> Class
Rhino.Notifications Namespace