RhinoCommon API
DisplayPipeline.DrawInferenceLine Method
 Draw an inference line used in gesture based snapping
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.17
Syntax
public void DrawInferenceLine(
	Point3d P,
	Point3d O,
	Color color,
	DisplayPipeline.InferenceLineType type
)
Public Sub DrawInferenceLine (
	P As Point3d,
	O As Point3d,
	color As Color,
	type As DisplayPipeline.InferenceLineType
)
Parameters
P
Type: Rhino.Geometry.Point3d
First point used to define the line in world coordinates
O
Type: Rhino.Geometry.Point3d
Second point used to define the line in world coordinates
color
Type: System.Drawing.Color
Color of line
type
Type: Rhino.Display.DisplayPipeline.InferenceLineType
Type of line DisplayPipeline.InferenceLineType
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace