RhinoCommon API
Vector2f.Negate Method
 Computes the reversed vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static Vector2f Negate(
	Vector2f vector
)
Public Shared Function Negate (
	vector As Vector2f
) As Vector2f
Parameters
vector
Type: Rhino.Geometry.Vector2f
A vector to negate.
Return Value
Type: Vector2f
A new vector where all components were multiplied by -1.
Remarks
This is similar to Reverse(), but is static for CLR compliance, and with default name.
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace