RhinoCommon API
SnapShotsClient.SaveDocument Method
 Called when the user saves a snapshot and SupportDocument() returns true.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool SaveDocument(
	RhinoDoc doc,
	BinaryArchiveWriter archive
)
Public MustOverride Function SaveDocument (
	doc As RhinoDoc,
	archive As BinaryArchiveWriter
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
doc is the current document
archive
Type: Rhino.FileIO.BinaryArchiveWriter
 archive is the archive to write the data to
Return Value
Type: Boolean
true if successful, otherwise false
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace