RhinoCommon API
OptionString Constructor (String, Boolean)
 Constructs the option object.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public OptionString(
	string initialString,
	bool allowEmptyString
)
Public Sub New (
	initialString As String,
	allowEmptyString As Boolean
)
Parameters
initialString
Type: System.String
The initial value.
allowEmptyString
Type: System.Boolean
 If false, the value is not allowed to be changed to an empty string. It is allowed to remain empty if it starts out as empty. If true, the string is allowed to be changed to an empty string.
See Also
Reference
OptionString Class
OptionString Overload
Rhino.Input.Custom Namespace