RhinoCommon API
RenderContentSerializer.RegisterSerializer Method
 Register the RenderContentSerializer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool RegisterSerializer(
	Guid id
)
Public Function RegisterSerializer (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
 Plug-in id
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContentSerializer.RegisterSerializer(System.Guid)"]
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace