RhinoCommon API
RenderPrimitiveList.Add Method (IEnumerable<Mesh>, RenderMaterial)
[Missing <summary> documentation for "M:Rhino.Render.RenderPrimitiveList.Add(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Render.RenderMaterial)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public void Add(
	IEnumerable<Mesh> meshes,
	RenderMaterial material
)
Public Sub Add (
	meshes As IEnumerable(Of Mesh),
	material As RenderMaterial
)
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
[Missing <param name="meshes"/> documentation for "M:Rhino.Render.RenderPrimitiveList.Add(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Render.RenderMaterial)"]
material
Type: Rhino.Render.RenderMaterial
[Missing <param name="material"/> documentation for "M:Rhino.Render.RenderPrimitiveList.Add(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Render.RenderMaterial)"]
See Also
Reference
RenderPrimitiveList Class
Add Overload
Rhino.Render Namespace