RhinoCommon API
StdVectorGuid Constructor (IEnumerable<Guid>)
 Initializes a new StdVectorGuid class
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public StdVectorGuid(
	IEnumerable<Guid> values
)
Public Sub New (
	values As IEnumerable(Of Guid)
)
Parameters
values
Type: System.Collections.Generic.IEnumerable<Guid>
initial set of Guids to add to the array
See Also
Reference
StdVectorGuid Class
StdVectorGuid Overload
Rhino.Runtime.InteropWrappers Namespace