RhinoCommon API
SectionStyleTable.Delete Method (IEnumerable<Int32>, Boolean, Int32)
 Delete multiple section styles.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Delete(
	IEnumerable<int> sectionStyleIndices,
	bool quiet,
	int deleteWarning
)
Public Function Delete (
	sectionStyleIndices As IEnumerable(Of Integer),
	quiet As Boolean,
	deleteWarning As Integer
) As Integer
Parameters
sectionStyleIndices
Type: System.Collections.Generic.IEnumerable<Int32>
An enumeration of section style indices.
quiet
Type: System.Boolean
If true, no warning message box appears if a section style is in use.
deleteWarning
Type: System.Int32
 Action to take when multiple delete warnings occur, where: 0 == No to all, 1 == Yes to all, 2 == Ask the user.
Return Value
Type: Int32
The number of section styles that were deleted.
See Also
Reference
SectionStyleTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace