RhinoCommon API
RenderWindow.Channel.SetValue Method (Int32, Int32, Single)
 Assign value to a pixel at coordinate (x, y).
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetValue(
	int x,
	int y,
	float value
)
Public Sub SetValue (
	x As Integer,
	y As Integer,
	value As Single
)
Parameters
x
Type: System.Int32
The horizontal pixel position. No validation is done on this value. The caller is responsible for ensuring that it is within the frame buffer.
y
Type: System.Int32
the vertical pixel position. No validation is done on this value. The caller is responsible for ensuring that it is within the frame buffer.
value
Type: System.Single
The value to store in the channel at the specified position.
See Also
Reference
RenderWindow.Channel Class
SetValue Overload
Rhino.Render Namespace