RhinoCommon API
RhinoList<T> Constructor (Int32, T)
 Initializes a new list with a specified amount of values.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoList(
	int amount,
	T defaultValue
)
Public Sub New (
	amount As Integer,
	defaultValue As T
)
Parameters
amount
Type: System.Int32
Number of values to add to this list. Must be equal to or larger than zero.
defaultValue
Type: T
Value to add, for reference types, the same item will be added over and over again.
See Also
Reference
RhinoList<T> Class
RhinoList<T> Overload
Rhino.Collections Namespace