RhinoCommon API
ComponentStatus.Addition Operator
 Sets flags from both component states and returns a new ComponentStatus.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ComponentStatus operator +(
	ComponentStatus a,
	ComponentStatus b
)
Public Shared Operator + (
	a As ComponentStatus,
	b As ComponentStatus
) As ComponentStatus
Parameters
a
Type: Rhino.Geometry.ComponentStatus
The first ComponentStatus.
b
Type: Rhino.Geometry.ComponentStatus
The second ComponentStatus.
Return Value
Type: ComponentStatus
A new ComponentStatus.
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace