RhinoCommon API
ObjectAttributes.DeleteAllUserStrings Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.DeleteAllUserStrings"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DeleteAllUserStrings()
Public Sub DeleteAllUserStrings
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace