RhinoCommon API
Circle.TrySmallestEnclosingCircle Method
 Attempt to create the smallest circle enclosing a set of planar points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static bool TrySmallestEnclosingCircle(
	IEnumerable<Point2d> points,
	double tolerance,
	out Circle circle,
	out int[] indicesOnCircle
)
Public Shared Function TrySmallestEnclosingCircle (
	points As IEnumerable(Of Point2d),
	tolerance As Double,
	<OutAttribute> ByRef circle As Circle,
	<OutAttribute> ByRef indicesOnCircle As Integer()
) As Boolean
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point2d>
The points to enclose.
tolerance
Type: System.Double
The tolerance to use
circle
Type: Rhino.Geometry.Circle
The resulting circle on success.
indicesOnCircle
Type: System.Int32[]
If possible, indices of two or three points that define the circle
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Circle Structure
Rhino.Geometry Namespace