RhinoCommon API
PointCloud.GetEnumerator Method
 Gets an enumerator that allows to modify each point cloud point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IEnumerator<PointCloudItem> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of PointCloudItem)
Return Value
Type: IEnumerator<PointCloudItem>
A instance of IEnumerator<T>.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace