RhinoCommon API
RhinoObject.GetTextureChannels Method
 Get a list of the texture mapping channel Id's associated with object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public int[] GetTextureChannels()
Public Function GetTextureChannels As Integer()
Return Value
Type: Int32[]
 Returns an array of channel Id's or an empty list if there are not mappings.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace