RhinoCommon API
RebuildCurveOptions Constructor
Initializes a new instance of the RebuildCurveOptions class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RebuildCurveOptions()
Public Sub New
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace