RhinoCommon API
Mesh.CreateBooleanUnion Method (IEnumerable<Mesh>, MeshBooleanOptions, Result, Int32[][])
 Computes the solid union of a set of meshes and reports which inputs contributed to each output.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Mesh[] CreateBooleanUnion(
	IEnumerable<Mesh> meshes,
	MeshBooleanOptions options,
	out Result commandResult,
	out int[][] inputMap
)
Public Shared Function CreateBooleanUnion (
	meshes As IEnumerable(Of Mesh),
	options As MeshBooleanOptions,
	<OutAttribute> ByRef commandResult As Result,
	<OutAttribute> ByRef inputMap As Integer()()
) As Mesh()
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
Meshes to union.
options
Type: Rhino.Geometry.MeshBooleanOptions
An option instance. Can be null, but generally it should be instantiated and have a tolerance set.
commandResult
Type: Rhino.Commands.Result
A value indicating if the function was successful, or if it was cancelled, or if it did nothing, or failed.
inputMap
Type: System.Int32[][]
 On success, one array per output mesh (parallel to the returned array), listing the indices of the input meshes that contributed faces to that output. Indices refer to meshes in enumeration order; null inputs are skipped and not assigned an index. Null when the function fails.
Return Value
Type: Mesh[]
An array of Mesh results or null on failure.
See Also
Reference
Mesh Class
CreateBooleanUnion Overload
Rhino.Geometry Namespace