RhinoCommon API
PersistentSettings.SetUnsignedInteger Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetUnsignedInteger(System.String,System.UInt32)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetUnsignedInteger(
	string key,
	uint value
)
Public Sub SetUnsignedInteger (
	key As String,
	value As UInteger
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetUnsignedInteger(System.String,System.UInt32)"]
value
Type: System.UInt32
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetUnsignedInteger(System.String,System.UInt32)"]
See Also
Reference
PersistentSettings Class
Rhino Namespace