RhinoCommon API
DisplayPipeline.DrawCurve Method (Curve, Color)
 Draw a single Curve object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DrawCurve(
	Curve curve,
	Color color
)
Public Sub DrawCurve (
	curve As Curve,
	color As Color
)
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to draw.
color
Type: System.Drawing.Color
Color to draw with.
See Also
Reference
DisplayPipeline Class
DrawCurve Overload
Rhino.Display Namespace