RhinoCommon API
ReduceMeshParameters Constructor
 Constructs a polygon reduction parameter object with default values. Users of this class should not rely on default values to stay constant across service releases.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ReduceMeshParameters()
Public Sub New
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace