RhinoCommon API
WorksessionFile.Dump Method
 Describes the worksession: its version, and for each model its paths and saved layer settings. For each saved layer it gives its name and the settings Rhino uses.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Dump()
Public Function Dump As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.FileIO.WorksessionFile.Dump"]
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace