RhinoCommon API
DisplayPipeline.DrawPoint Method (Point3d, PointStyle, Color, Color, Single, Single, Single, Single, Boolean, Boolean)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawPoint(
	Point3d point,
	PointStyle style,
	Color strokeColor,
	Color fillColor,
	float radius,
	float strokeWidth,
	float secondarySize,
	float rotationRadians,
	bool diameterIsInPixels,
	bool autoScaleForDpi
)
Public Sub DrawPoint (
	point As Point3d,
	style As PointStyle,
	strokeColor As Color,
	fillColor As Color,
	radius As Single,
	strokeWidth As Single,
	secondarySize As Single,
	rotationRadians As Single,
	diameterIsInPixels As Boolean,
	autoScaleForDpi As Boolean
)
Parameters
point
Type: Rhino.Geometry.Point3d
[Missing <param name="point"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Boolean)"]
style
Type: Rhino.Display.PointStyle
[Missing <param name="style"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Boolean)"]
strokeColor
Type: System.Drawing.Color
[Missing <param name="strokeColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Boolean)"]
fillColor
Type: System.Drawing.Color
[Missing <param name="fillColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Boolean)"]
radius
Type: System.Single
[Missing <param name="radius"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Boolean)"]
strokeWidth
Type: System.Single
[Missing <param name="strokeWidth"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Boolean)"]
secondarySize
Type: System.Single
[Missing <param name="secondarySize"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Boolean)"]
rotationRadians
Type: System.Single
[Missing <param name="rotationRadians"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Boolean)"]
diameterIsInPixels
Type: System.Boolean
[Missing <param name="diameterIsInPixels"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Boolean)"]
autoScaleForDpi
Type: System.Boolean
[Missing <param name="autoScaleForDpi"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Boolean)"]
See Also
Reference
DisplayPipeline Class
DrawPoint Overload
Rhino.Display Namespace