RhinoCommon API
PostEffectPipeline.ThreadEngine Method
 Get the post effect thread engine.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PostEffectThreadEngine ThreadEngine()
Public Function ThreadEngine As PostEffectThreadEngine
Return Value
Type: PostEffectThreadEngine
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectPipeline.ThreadEngine"]
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace