RhinoCommon API
Mesh.PatchSingleFace Method
 Creates a single mesh face from the given input. The new mesh will be apppended to this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool PatchSingleFace(
	IEnumerable<ComponentIndex> components
)
Public Function PatchSingleFace (
	components As IEnumerable(Of ComponentIndex)
) As Boolean
Parameters
components
Type: System.Collections.Generic.IEnumerable<ComponentIndex>
An enumeration of component indexes from this mesh. This can be one following combinations: 1 vertex (MeshVertex or MeshTopologyVertex) and 1 edge (MeshTopologyEdge), 2 edges (MeshTopologyEdge), or 3 vertices (MeshVertex or MeshTopologyVertex).
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace