RhinoCommon API
BinaryArchiveReader.AtEnd Method
 true if at end of a file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public bool AtEnd()
Public Function AtEnd As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveReader.AtEnd"]
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace