RhinoCommon API
Notification Constructor
 Creates a new instance that can be edited by any assembly.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Notification()
Public Sub New
See Also
Reference
Notification Class
Notification Overload
Rhino.Runtime.Notifications Namespace