RhinoCommon API
VisualAnalysisMode.DrawExtrusionObject Method
 Draws one extrusion. Override this method to add your custom behavior.
The default implementation does nothing.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void DrawExtrusionObject(
	ExtrusionObject extrusion,
	DisplayPipeline pipeline
)
Protected Overridable Sub DrawExtrusionObject (
	extrusion As ExtrusionObject,
	pipeline As DisplayPipeline
)
Parameters
extrusion
Type: Rhino.DocObjects.ExtrusionObject
An extrusion object.
pipeline
Type: Rhino.Display.DisplayPipeline
The current display pipeline.
Remarks
 Extrusions are not breps, so DrawBrepObject(BrepObject, DisplayPipeline) is not called for them. A mode that should treat the two alike needs to override both.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace