RhinoCommon API
Decal.HorzSweep Method
 Gets the angles of the decal's arc of 'horizontal sweep'. Replaces StartLatitude and EndLatitude.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void HorzSweep(
	out double sta,
	out double end
)
Public Sub HorzSweep (
	<OutAttribute> ByRef sta As Double,
	<OutAttribute> ByRef end As Double
)
Parameters
sta
Type: System.Double
[Missing <param name="sta"/> documentation for "M:Rhino.Render.Decal.HorzSweep(System.Double@,System.Double@)"]
end
Type: System.Double
[Missing <param name="end"/> documentation for "M:Rhino.Render.Decal.HorzSweep(System.Double@,System.Double@)"]
See Also
Reference
Decal Class
Rhino.Render Namespace