RhinoCommon API
AppearanceSettings.DefaultPaintColor Method (PaintColor, Boolean)
 Get a default paint color for Rhino. The current paint color may be different than the default
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Color DefaultPaintColor(
	PaintColor whichColor,
	bool darkMode
)
Public Shared Function DefaultPaintColor (
	whichColor As PaintColor,
	darkMode As Boolean
) As Color
Parameters
whichColor
Type: Rhino.ApplicationSettings.PaintColor
The color to retrieve
darkMode
Type: System.Boolean
 If true gets the default dark mode color otherwise return the default light mode color
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.AppearanceSettings.DefaultPaintColor(Rhino.ApplicationSettings.PaintColor,System.Boolean)"]
See Also
Reference
AppearanceSettings Class
DefaultPaintColor Overload
Rhino.ApplicationSettings Namespace