RhinoCommon API
RhinoCore.Finalize Method
 IDisposable implementation
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RhinoCore Class
Rhino.Runtime.InProcess Namespace