RhinoCommon API
Transform Constructor (Double)
 Initializes a new transform matrix with a specified value along the diagonal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Transform(
	double diagonalValue
)
Public Sub New (
	diagonalValue As Double
)
Parameters
diagonalValue
Type: System.Double
Value to assign to all diagonal cells except M33 which is set to 1.0.
See Also
Reference
Transform Structure
Transform Overload
Rhino.Geometry Namespace