RhinoCommon API
File3dm.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
File3dm Class
Dispose Overload
Rhino.FileIO Namespace