RhinoCommon API
WorksessionFile.GetModel Method
Gets a copy of a model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFileModel GetModel(
	int index
)
Public Function GetModel (
	index As Integer
) As WorksessionFileModel
Parameters
index
Type: System.Int32
Index of the model.
Return Value
Type: WorksessionFileModel
A copy of the model. Changes to it are kept only after SetModel(Int32, WorksessionFileModel).
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If index is out of range.
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace