RhinoCommon API
RhinoViewport.MouseDollyZoom Method
 Zooms lens (thus adjusting the field of view) while moving the camera.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool MouseDollyZoom(
	Point mousePreviousPoint,
	Point mouseCurrentPoint
)
Public Function MouseDollyZoom (
	mousePreviousPoint As Point,
	mouseCurrentPoint As Point
) As Boolean
Parameters
mousePreviousPoint
Type: System.Drawing.Point
The mouse previous point.
mouseCurrentPoint
Type: System.Drawing.Point
The mouse current point.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.MouseDollyZoom(System.Drawing.Point,System.Drawing.Point)"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace