RhinoCommon API
SubDEdgeSharpness.ToPercentageText Method (Double)
 Describes a single end sharpness value as a percentage, for user interface code.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static string ToPercentageText(
	double sharpness
)
Public Shared Function ToPercentageText (
	sharpness As Double
) As String
Parameters
sharpness
Type: System.Double
 Between 0.0 and MaximumValue, or CreaseValue.
Return Value
Type: String
 A number followed by a percent sign, "crease" for CreaseValue, or a warning sign if sharpness is not valid.
See Also
Reference
SubDEdgeSharpness Structure
ToPercentageText Overload
Rhino.Geometry Namespace