RhinoCommon API
AnimationProperties Constructor
 Initializes a new instance of the AnimationProperties class.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public AnimationProperties()
Public Sub New
See Also
Reference
AnimationProperties Class
AnimationProperties Overload
Rhino.DocObjects Namespace