RhinoCommon API
PersistentSettings.SetStringDictionary Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[])"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetStringDictionary(
	string key,
	KeyValuePair<string, string>[] value
)
Public Sub SetStringDictionary (
	key As String,
	value As KeyValuePair(Of String, String)()
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[])"]
value
Type: System.Collections.Generic.KeyValuePair<String, String>[]
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[])"]
See Also
Reference
PersistentSettings Class
Rhino Namespace