RhinoCommon API
RenderContent.ChildSlotAmount Method
 Gets the amount property for the texture in the specified child slot.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public double ChildSlotAmount(
	string childSlotName
)
Public Function ChildSlotAmount (
	childSlotName As String
) As Double
Parameters
childSlotName
Type: System.String
The child slot name of the texture.
Return Value
Type: Double
The requested amount value. Values are typically from 0.0 to 100.0
See Also
Reference
RenderContent Class
Rhino.Render Namespace