RhinoCommon API
ColorRGBA.EpsilonEquals Method
 Check that all values in other are within epsilon of the values in this
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool EpsilonEquals(
	ColorRGBA other,
	double epsilon
)
Public Function EpsilonEquals (
	other As ColorRGBA,
	epsilon As Double
) As Boolean
Parameters
other
Type: Rhino.Display.ColorRGBA
[Missing <param name="other"/> documentation for "M:Rhino.Display.ColorRGBA.EpsilonEquals(Rhino.Display.ColorRGBA,System.Double)"]
epsilon
Type: System.Double
[Missing <param name="epsilon"/> documentation for "M:Rhino.Display.ColorRGBA.EpsilonEquals(Rhino.Display.ColorRGBA,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.ColorRGBA.EpsilonEquals(Rhino.Display.ColorRGBA,System.Double)"]
Implements
IEpsilonComparable<T>.EpsilonEquals(T, Double)
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace