RhinoCommon API
RenderWindow.SetAdjust Method
Note: This API is now obsolete.
 OBSOLETE. NOT IMPLEMENTED.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("The Render Window UI now uses post effects for gamma, tone mapping, etc.")]
public void SetAdjust(
	RenderWindow.ImageAdjust imageAdjust
)
<ObsoleteAttribute("The Render Window UI now uses post effects for gamma, tone mapping, etc.")>
Public Sub SetAdjust (
	imageAdjust As RenderWindow.ImageAdjust
)
Parameters
imageAdjust
Type: Rhino.Render.RenderWindow.ImageAdjust
OBSOLETE
See Also
Reference
RenderWindow Class
Rhino.Render Namespace