RhinoCommon API
RhinoDoc.OpenDocuments Method
 Returns a list of currently open Rhino documents
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RhinoDoc[] OpenDocuments()
Public Shared Function OpenDocuments As RhinoDoc()
Return Value
Type: RhinoDoc[]
[Missing <returns> documentation for "M:Rhino.RhinoDoc.OpenDocuments"]
See Also
Reference
RhinoDoc Class
OpenDocuments Overload
Rhino Namespace