RhinoCommon API
Localization.FormatDistanceAndTolerance Method
[Missing <summary> documentation for "M:Rhino.UI.Localization.FormatDistanceAndTolerance(System.Double,Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string FormatDistanceAndTolerance(
	double distance,
	UnitSystem units,
	DimensionStyle dimStyle,
	bool alternate
)
Public Shared Function FormatDistanceAndTolerance (
	distance As Double,
	units As UnitSystem,
	dimStyle As DimensionStyle,
	alternate As Boolean
) As String
Parameters
distance
Type: System.Double
[Missing <param name="distance"/> documentation for "M:Rhino.UI.Localization.FormatDistanceAndTolerance(System.Double,Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle,System.Boolean)"]
units
Type: Rhino.UnitSystem
[Missing <param name="units"/> documentation for "M:Rhino.UI.Localization.FormatDistanceAndTolerance(System.Double,Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle,System.Boolean)"]
dimStyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimStyle"/> documentation for "M:Rhino.UI.Localization.FormatDistanceAndTolerance(System.Double,Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle,System.Boolean)"]
alternate
Type: System.Boolean
primary or alternate
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.Localization.FormatDistanceAndTolerance(System.Double,Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle,System.Boolean)"]
See Also
Reference
Localization Class
Rhino.UI Namespace