RhinoCommon API
LengthUnit.Scale Method
 Computes the scale factor for changing a measurement on different units.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static double Scale(
	 in LengthUnit from,
	 in LengthUnit to
)
Public Shared Function Scale (
	 ByRef from As LengthUnit,
	 ByRef to As LengthUnit
) As Double
Parameters
from
Type: Rhino.LengthUnit
The units to convert from.
to
Type: Rhino.LengthUnit
The units to convert measurements into.
Return Value
Type: Double
A unit scale factor.
See Also
Reference
LengthUnit Structure
Rhino Namespace