RhinoCommon API
RhinoApp.ReleaseMouseCapture Method
Releases the mouse capture.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool ReleaseMouseCapture()
Public Shared Function ReleaseMouseCapture As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoApp.ReleaseMouseCapture"]
See Also
Reference
RhinoApp Class
Rhino Namespace