RhinoCommon API
File3dmStringTable.GetSectionNames Method
 Returns a list of all the section names for document strings in the 3dm file.
By default a section name is a key that is prefixed with a string separated by a backslash.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string[] GetSectionNames()
Public Function GetSectionNames As String()
Return Value
Type: String[]
An array of section names. This can be empty, but not null.
See Also
Reference
File3dmStringTable Class
Rhino.FileIO Namespace