RhinoCommon API
BinaryArchiveReader.ReadByte Method
 Reads a Byte from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public byte ReadByte()
Public Function ReadByte As Byte
Return Value
Type: Byte
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace