RhinoCommon API
PostEffect Constructor
Initializes a new instance of the PostEffect class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PostEffect()
Public Sub New
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace