RhinoCommon API
NamedPositionTable.Append Method (Guid, IEnumerable<Guid>)
Append objects to a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Append(
	Guid id,
	IEnumerable<Guid> objectIds
)
Public Function Append (
	id As Guid,
	objectIds As IEnumerable(Of Guid)
) As Boolean
Parameters
id
Type: System.Guid
 Guid of the Named Position which you want to append to.
objectIds
Type: System.Collections.Generic.IEnumerable<Guid>
 New object ids to be included in this Named Position.
Return Value
Type: Boolean
 True or False depending on whether the Append was successful.
See Also
Reference
NamedPositionTable Class
Append Overload
Rhino.DocObjects.Tables Namespace