RhinoCommon API
NurbsCurveFitParameters.GetCurvatureBiasIntensityFromCoefficient Method
 Returns the NurbsCurveFitParameters.Intensity value that corresponds to a given curvature bias coefficient.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public NurbsCurveFitParameters.Intensity GetCurvatureBiasIntensityFromCoefficient(
	double coefficient
)
Public Function GetCurvatureBiasIntensityFromCoefficient (
	coefficient As Double
) As NurbsCurveFitParameters.Intensity
Parameters
coefficient
Type: System.Double
[Missing <param name="coefficient"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.GetCurvatureBiasIntensityFromCoefficient(System.Double)"]
Return Value
Type: NurbsCurveFitParameters.Intensity
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.GetCurvatureBiasIntensityFromCoefficient(System.Double)"]
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace