RhinoCommon API
WorksessionFileLayerValues Constructor
Creates layer settings with the defaults: visible, unlocked and black.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFileLayerValues()
Public Sub New
See Also
Reference
WorksessionFileLayerValues Class
WorksessionFileLayerValues Overload
Rhino.FileIO Namespace