RhinoCommon API
Brep.InsetFaces Method
 Individually insets faces of a brep by offsetting the faces outer edges inward and inner edges out then splitting the face with the offset curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public Brep InsetFaces(
	IEnumerable<int> faceIndices,
	double distance,
	bool loose,
	bool ignoreSeams,
	bool creaseCorners,
	double tolerance,
	double angleTolerance
)
Public Function InsetFaces (
	faceIndices As IEnumerable(Of Integer),
	distance As Double,
	loose As Boolean,
	ignoreSeams As Boolean,
	creaseCorners As Boolean,
	tolerance As Double,
	angleTolerance As Double
) As Brep
Parameters
faceIndices
Type: System.Collections.Generic.IEnumerable<Int32>
the indices of the faces to inset
distance
Type: System.Double
The distance to offset along the face
loose
Type: System.Boolean
If true, offset by moving edit points otherwise offset within tolerance.
ignoreSeams
Type: System.Boolean
If true, the seam edges are not offset and adjacent edges are extended to meet the seam. Otherwise offset normally.
creaseCorners
Type: System.Boolean
If true, splitting curves will be made between the creases on edge curves and creases on the inset curves.
tolerance
Type: System.Double
The fitting tolerance for the offset. When in doubt, use the document's absolute tolerance.
angleTolerance
Type: System.Double
The angle tolerance in radians for identifying creases when creasing corners. When in doubt, use the document's angle tolerance.
Return Value
Type: Brep
The brep with inset faces on success. Null on error.
See Also
Reference
Brep Class
Rhino.Geometry Namespace