RhinoCommon API
SubDFaceList.Find Method (UInt32)
 Find a face in this SubD with a given id
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDFace Find(
	uint id
)
Public Function Find (
	id As UInteger
) As SubDFace
Parameters
id
Type: System.UInt32
[Missing <param name="id"/> documentation for "M:Rhino.Geometry.Collections.SubDFaceList.Find(System.UInt32)"]
Return Value
Type: SubDFace
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDFaceList.Find(System.UInt32)"]
See Also
Reference
SubDFaceList Class
Find Overload
Rhino.Geometry.Collections Namespace