RhinoCommon API
MarkupTable.Modify Method
Modify markup settings.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Modify(
	Markup markup,
	int index,
	bool quiet
)
Public Function Modify (
	markup As Markup,
	index As Integer,
	quiet As Boolean
) As Boolean
Parameters
markup
Type: Rhino.DocObjects.Markup
New markup settings. This information is copied.
index
Type: System.Int32
Zero based index of markup to set.
quiet
Type: System.Boolean
 if false, information message boxes pop up when illegal changes are attempted.
Return Value
Type: Boolean
 true if successful. false if index is out of range.
See Also
Reference
MarkupTable Class
Rhino.DocObjects.Tables Namespace