RhinoCommon API
RhinoViewport.FromId Method
 Call this method to get the viewport with the specified Id.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RhinoViewport FromId(
	Guid id
)
Public Shared Function FromId (
	id As Guid
) As RhinoViewport
Parameters
id
Type: System.Guid
 Id to search for.
Return Value
Type: RhinoViewport
 Returns a RhinoViewport if the Id is found otherwise null.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace