RhinoCommon API
FileObj.Write Method (StreamWriter, RhinoDoc, FileObjWriteOptions)
Write an obj stream based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static WriteFileResult Write(
	StreamWriter stream,
	RhinoDoc doc,
	FileObjWriteOptions options
)
Public Shared Function Write (
	stream As StreamWriter,
	doc As RhinoDoc,
	options As FileObjWriteOptions
) As WriteFileResult
Parameters
stream
Type: System.IO.StreamWriter
[Missing <param name="stream"/> documentation for "M:Rhino.FileIO.FileObj.Write(System.IO.StreamWriter,Rhino.RhinoDoc,Rhino.FileIO.FileObjWriteOptions)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.FileIO.FileObj.Write(System.IO.StreamWriter,Rhino.RhinoDoc,Rhino.FileIO.FileObjWriteOptions)"]
options
Type: Rhino.FileIO.FileObjWriteOptions
[Missing <param name="options"/> documentation for "M:Rhino.FileIO.FileObj.Write(System.IO.StreamWriter,Rhino.RhinoDoc,Rhino.FileIO.FileObjWriteOptions)"]
Return Value
Type: WriteFileResult
[Missing <returns> documentation for "M:Rhino.FileIO.FileObj.Write(System.IO.StreamWriter,Rhino.RhinoDoc,Rhino.FileIO.FileObjWriteOptions)"]
Remarks
 No .mtl file is written, hence no materials, when the WriteFile that takes a StreamWriter is called directly. If you need materials call the WriteFile that takes a string for the obj file path.
See Also
Reference
FileObj Class
Write Overload
Rhino.FileIO Namespace