RhinoCommon API
EarthAnchorPoint Constructor
 Initializes a new instance of the EarthAnchorPoint class.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public EarthAnchorPoint()
Public Sub New
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace