RhinoCommon API
Vector3f Explicit Conversion (Vector3d to Vector3f)
 Converts a double-precision vector in a single-precision vector. Needs explicit casting to help retain precision.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static explicit operator Vector3f (
	Vector3d vector
)
Public Shared Narrowing Operator CType (
	vector As Vector3d
) As Vector3f
Parameters
vector
Type: Rhino.Geometry.Vector3d
A vector.
Return Value
Type: Vector3f
The resulting vector.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace