RhinoCommon API
File3mfWriteOptions Constructor
Initializes a new instance of the File3mfWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3mfWriteOptions()
Public Sub New
See Also
Reference
File3mfWriteOptions Class
Rhino.FileIO Namespace