RhinoCommon API
TextureEvaluator.Dispose Method
 For Dispose pattern
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
TextureEvaluator Class
Dispose Overload
Rhino.Render Namespace