RhinoCommon API
RealtimeDisplayMode.HudAllowEditMaxPasses Method
 Override to allow maximum pass editing. By default disabled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool HudAllowEditMaxPasses()
Public Overridable Function HudAllowEditMaxPasses As Boolean
Return Value
Type: Boolean
Return true to allow users to edit the maximum pass count.
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace