RhinoCommon API
Intersection.MeshPlane Method (Mesh, IEnumerable<Plane>)
 Intersects a mesh with a collection of infinite planes.
ZeroTolerance is used as fixed tolerance.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient instaed.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Polyline[] MeshPlane(
	Mesh mesh,
	IEnumerable<Plane> planes
)
Public Shared Function MeshPlane (
	mesh As Mesh,
	planes As IEnumerable(Of Plane)
) As Polyline()
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to intersect.
planes
Type: System.Collections.Generic.IEnumerable<Plane>
Planes to intersect with.
Return Value
Type: Polyline[]
 An array of polylines describing the intersection loops, or null if no intersections could be found.
See Also
Reference
Intersection Class
MeshPlane Overload
Rhino.Geometry.Intersect Namespace