RhinoCommon API
StdVectorByte Constructor (IEnumerable<Byte>)
 Initializes a new StdVectorByte class
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.26
Syntax
public StdVectorByte(
	IEnumerable<byte> values
)
Public Sub New (
	values As IEnumerable(Of Byte)
)
Parameters
values
Type: System.Collections.Generic.IEnumerable<Byte>
initial set of integers to add to the array
See Also
Reference
StdVectorByte Class
StdVectorByte Overload
Rhino.Runtime.InteropWrappers Namespace