RhinoCommon API
SimpleArrayByte Constructor (SimpleArrayByte)
 Initializes a new SimpleArrayByte with the contents of another SimpleArrayByte.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SimpleArrayByte(
	SimpleArrayByte other
)
Public Sub New (
	other As SimpleArrayByte
)
Parameters
other
Type: Rhino.Runtime.InteropWrappers.SimpleArrayByte
[Missing <param name="other"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayByte.#ctor(Rhino.Runtime.InteropWrappers.SimpleArrayByte)"]
See Also
Reference
SimpleArrayByte Class
SimpleArrayByte Overload
Rhino.Runtime.InteropWrappers Namespace