RhinoCommon API
PhysicallyBasedMaterial.SynchronizeLegacyMaterial Method
[Missing <summary> documentation for "M:Rhino.DocObjects.PhysicallyBasedMaterial.SynchronizeLegacyMaterial"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SynchronizeLegacyMaterial()
Public Sub SynchronizeLegacyMaterial
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace