RhinoCommon API
ContentCollectionIterator Constructor
Initializes a new instance of the ContentCollectionIterator class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ContentCollectionIterator(
	IntPtr pCollection
)
Public Sub New (
	pCollection As IntPtr
)
Parameters
pCollection
Type: System.IntPtr
[Missing <param name="pCollection"/> documentation for "M:Rhino.Render.ContentCollectionIterator.#ctor(System.IntPtr)"]
See Also
Reference
ContentCollectionIterator Class
Rhino.Render Namespace