RhinoCommon API
LinetypeTable.PurgeUnused Method
 Purges any unused linetypes.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PurgeUnused()
Public Function PurgeUnused As Integer
Return Value
Type: Int32
The number of unused linetypes that were purged.
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace