RhinoCommon API
RhinoDoc.Purge Method (PurgeFilter, Boolean)
 Purges unused table objects from this document, the same way the Purge command does.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PurgeStatistics Purge(
	PurgeFilter filter,
	bool quiet
)
Public Function Purge (
	filter As PurgeFilter,
	quiet As Boolean
) As PurgeStatistics
Parameters
filter
Type: Rhino.PurgeFilter
The document table object types to purge.
quiet
Type: System.Boolean
Set to true to suppress any output or progress messages.
Return Value
Type: PurgeStatistics
What was purged.
See Also
Reference
RhinoDoc Class
Purge Overload
Rhino Namespace