RhinoCommon API
File3dm.DumpSummary Method
Prepares a text dump of model properties and settings.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string DumpSummary()
Public Function DumpSummary As String
Return Value
Type: String
The text dump.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace