RhinoCommon API
Curve.CreateMatchCurve Method
 Changes a curve end to meet a specified curve with a specified continuity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public static Curve[] CreateMatchCurve(
	Curve curve0,
	bool reverse0,
	BlendContinuity continuity,
	Curve curve1,
	bool reverse1,
	PreserveEnd preserve,
	bool average
)
Public Shared Function CreateMatchCurve (
	curve0 As Curve,
	reverse0 As Boolean,
	continuity As BlendContinuity,
	curve1 As Curve,
	reverse1 As Boolean,
	preserve As PreserveEnd,
	average As Boolean
) As Curve()
Parameters
curve0
Type: Rhino.Geometry.Curve
The open curve to change.
reverse0
Type: System.Boolean
Reverse the direction of the curve to change before matching.
continuity
Type: Rhino.Geometry.BlendContinuity
The continuity at the curve end.
curve1
Type: Rhino.Geometry.Curve
The open curve to match.
reverse1
Type: System.Boolean
Reverse the direction of the curve to match before matching.
preserve
Type: Rhino.Geometry.PreserveEnd
Prevent modification of the curvature at the end opposite the match for curves with fewer than six control points.
average
Type: System.Boolean
Adjust both curves to match each other.
Return Value
Type: Curve[]
The results of the curve matching, if successful, otherwise an empty array.
See Also
Reference
Curve Class
Rhino.Geometry Namespace