RhinoCommon API
SubD.Dispose Method (Boolean)
 Deletes the underlying native pointer during a Dispose call or GC collection
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Dispose(
	bool disposing
)
Protected Overrides Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
SubD Class
Dispose Overload
Rhino.Geometry Namespace