RhinoCommon API
BrepEdge.AdjacentFaces Method
 Gets the indices of all the BrepFaces that use this edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int[] AdjacentFaces()
Public Function AdjacentFaces As Integer()
Return Value
Type: Int32[]
[Missing <returns> documentation for "M:Rhino.Geometry.BrepEdge.AdjacentFaces"]
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace