RhinoCommon API
FieldDictionary.Add Method (String, Int32, String)
 Add a new IntField to the dictionary.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public IntField Add(
	string key,
	int value,
	string prompt
)
Public Function Add (
	key As String,
	value As Integer,
	prompt As String
) As IntField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: System.Int32
Initial value for this field.
prompt
Type: System.String
 Prompt to display in the user interface (Content Browsers) if this is null or an empty string the this field is a data only field and will not appear in the user interface.
Return Value
Type: IntField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Int32,System.String)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace