RhinoCommon API
Mesh.CreateUnweldedMesh Method
 Creates a new unwelded mesh from an existing mesh. Texture coordinates are ignored.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public static Mesh CreateUnweldedMesh(
	Mesh mesh
)
Public Shared Function CreateUnweldedMesh (
	mesh As Mesh
) As Mesh
Parameters
mesh
Type: Rhino.Geometry.Mesh
The source mesh to copy.
Return Value
Type: Mesh
The new unwelded mesh if successful, null otherwise.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace