RhinoCommon API
RhinoMath.UnitScale Method (UnitSystem, Double, UnitSystem, Double)
 Computes the scale factor for changing the measurements unit systems.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static double UnitScale(
	UnitSystem from,
	double fromMetersPerUnit,
	UnitSystem to,
	double toMetersPerUnit
)
Public Shared Function UnitScale (
	from As UnitSystem,
	fromMetersPerUnit As Double,
	to As UnitSystem,
	toMetersPerUnit As Double
) As Double
Parameters
from
Type: Rhino.UnitSystem
The system to convert from.
fromMetersPerUnit
Type: System.Double
For custom units, specify the meters per unit.
to
Type: Rhino.UnitSystem
The system to convert measurements into.
toMetersPerUnit
Type: System.Double
For custom units, specify the meters per unit.
Return Value
Type: Double
A scale multiplier.
See Also
Reference
RhinoMath Class
UnitScale Overload
Rhino Namespace