RhinoCommon API
HermiteSurface.UTangentAt Method
 Get the "u" tangent direction (actually first derivative) to interpolate at the u,v parameter location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Vector3d UTangentAt(
	int uIndex,
	int vIndex
)
Public Function UTangentAt (
	uIndex As Integer,
	vIndex As Integer
) As Vector3d
Parameters
uIndex
Type: System.Int32
The "u" index.
vIndex
Type: System.Int32
The "v" index.
Return Value
Type: Vector3d
The tangent direction.
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace