RhinoCommon API
Transform2d.Rotation Method (Double)
 Constructs a new rotation transformation with the origin as the rotation center.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d Rotation(
	double angleRadians
)
Public Shared Function Rotation (
	angleRadians As Double
) As Transform2d
Parameters
angleRadians
Type: System.Double
Angle, in radians, of the rotation. A positive angle rotates the X axis towards the Y axis.
Return Value
Type: Transform2d
A rotation transformation, or Transform2d.Nan if the angle is not valid.
See Also
Reference
Transform2d Structure
Rotation Overload
Rhino.Geometry Namespace