RhinoCommon API
SupportOptions.Libraries_InitialLocation Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.Libraries_InitialLocation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static SupportOptions.RdkInitialLocation Libraries_InitialLocation()
Public Shared Function Libraries_InitialLocation As SupportOptions.RdkInitialLocation
Return Value
Type: SupportOptions.RdkInitialLocation
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.Libraries_InitialLocation"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace