RhinoCommon API
PersistentSettings.TryGetChar Method (String, Char, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetChar(System.String,System.Char@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetChar(
	string key,
	out char value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetChar (
	key As String,
	<OutAttribute> ByRef value As Char,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetChar(System.String,System.Char@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: System.Char
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetChar(System.String,System.Char@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetChar(System.String,System.Char@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetChar(System.String,System.Char@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetChar Overload
Rhino Namespace