RhinoCommon API
DisplayPointAttributes Constructor
Initializes a new instance of the DisplayPointAttributes class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public DisplayPointAttributes()
Public Sub New
See Also
Reference
DisplayPointAttributes Class
DisplayPointAttributes Overload
Rhino.Display Namespace