RhinoCommon API
PostEffect.Dispose Method
Releases all resources used by the PostEffect
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PostEffect Class
Dispose Overload
Rhino.Render.PostEffects Namespace