RhinoCommon API
RhinoObject.EnableEditPointGrips Method
 Turns on edit point grips, the ones the EditPtOn command turns on.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EnableEditPointGrips()
Public Function EnableEditPointGrips As Boolean
Return Value
Type: Boolean
 true if the object has edit point grips when this returns. false for an object that has none: anything that is not a curve or a SubD, a curve with more than 1000 edit points or too few control points to have any, an empty SubD, and the cases EnableGrips(Guid) returns false for.
Remarks
 Curves and SubDs carry separate kinds of edit point grips. This picks the one that suits the object, as EditPtOn does, so a caller does not have to. An object that is neither is left exactly as it was. For a curve or a SubD, what happens to grips already on is described by EnableGrips(Guid).
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace