RhinoCommon API
RhinoPageView.SetActiveDetail Method (String, Boolean)
 Sets the active detail.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SetActiveDetail(
	string detailName,
	bool compareCase
)
Public Function SetActiveDetail (
	detailName As String,
	compareCase As Boolean
) As Boolean
Parameters
detailName
Type: System.String
The name, or title, of the detail to set active.
compareCase
Type: System.Boolean
Unused.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
RhinoPageView Class
SetActiveDetail Overload
Rhino.Display Namespace