RhinoCommon API
File3dmPlugInDetails Constructor
Initializes a new instance of the File3dmPlugInDetails class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmPlugInDetails()
Public Sub New
See Also
Reference
File3dmPlugInDetails Class
Rhino.FileIO Namespace