RhinoCommon API
ClippingPlaneObject.ObjectParticipates Method
 Determines whether an object is clipped by this clipping plane, taking the clip participation (inclusion/exclusion) lists into account. This is the same test the display uses.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ObjectParticipates(
	Guid objectId
)
Public Function ObjectParticipates (
	objectId As Guid
) As Boolean
Parameters
objectId
Type: System.Guid
Id of the object to test.
Return Value
Type: Boolean
true if the object is clipped by this clipping plane.
See Also
Reference
ClippingPlaneObject Class
Rhino.DocObjects Namespace