RhinoCommon API
SimpleArrayCurvePointer Constructor
 Initializes a new SimpleArrayCurvePointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SimpleArrayCurvePointer()
Public Sub New
See Also
Reference
SimpleArrayCurvePointer Class
SimpleArrayCurvePointer Overload
Rhino.Runtime.InteropWrappers Namespace