RhinoCommon API
RenderPlugIn.PreviewRenderType Method
 Tell what kind of preview rendering your renderer supports.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual RenderPlugIn.PreviewRenderTypes PreviewRenderType()
Protected Overridable Function PreviewRenderType As RenderPlugIn.PreviewRenderTypes
Return Value
Type: RenderPlugIn.PreviewRenderTypes
One of PreviewRenderTypes
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace