RhinoCommon API
LengthValue.Create Method (Double, UnitSystem, LengthValue.StringFormat, UInt32)
Create from Length and UnitSystem
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static LengthValue Create(
	double length,
	UnitSystem us,
	LengthValue.StringFormat format,
	uint localeId
)
Public Shared Function Create (
	length As Double,
	us As UnitSystem,
	format As LengthValue.StringFormat,
	localeId As UInteger
) As LengthValue
Parameters
length
Type: System.Double
Numeric length value
us
Type: Rhino.UnitSystem
Unit system
format
Type: Rhino.LengthValue.StringFormat
[Missing <param name="format"/> documentation for "M:Rhino.LengthValue.Create(System.Double,Rhino.UnitSystem,Rhino.LengthValue.StringFormat,System.UInt32)"]
localeId
Type: System.UInt32
[Missing <param name="localeId"/> documentation for "M:Rhino.LengthValue.Create(System.Double,Rhino.UnitSystem,Rhino.LengthValue.StringFormat,System.UInt32)"]
Return Value
Type: LengthValue
[Missing <returns> documentation for "M:Rhino.LengthValue.Create(System.Double,Rhino.UnitSystem,Rhino.LengthValue.StringFormat,System.UInt32)"]
See Also
Reference
LengthValue Class
Create Overload
Rhino Namespace