RhinoCommon API
NamedParametersEventArgs.Set Method (String, IEnumerable<UInt32>)
 Set a list of uint as a value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Set(
	string name,
	IEnumerable<uint> values
)
Public Sub Set (
	name As String,
	values As IEnumerable(Of UInteger)
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{System.UInt32})"]
values
Type: System.Collections.Generic.IEnumerable<UInt32>
[Missing <param name="values"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{System.UInt32})"]
See Also
Reference
NamedParametersEventArgs Class
Set Overload
Rhino.Runtime Namespace