RhinoCommon API
ViewportInfo.UnlockFrustumSymmetry Method
 Unlocks frustum horizontal and vertical symmetries.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void UnlockFrustumSymmetry()
Public Sub UnlockFrustumSymmetry
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace