RhinoCommon API
Triangle3d.ToPolyline Method
 Create a polyline from this triangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Polyline ToPolyline()
Public Function ToPolyline As Polyline
Return Value
Type: Polyline
[Missing <returns> documentation for "M:Rhino.Geometry.Triangle3d.ToPolyline"]
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace