RhinoCommon API
SupportOptions.AutoSaveKeepAmount Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.AutoSaveKeepAmount"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static int AutoSaveKeepAmount()
Public Shared Function AutoSaveKeepAmount As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.AutoSaveKeepAmount"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace