RhinoCommon API
UserData Constructor
Initializes a new instance of the UserData class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected UserData()
Protected Sub New
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace