RhinoCommon API
PythonScript.RemoveVariable Method
 Removes a defined variable from the main scripting context.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public abstract void RemoveVariable(
	string name
)
Public MustOverride Sub RemoveVariable (
	name As String
)
Parameters
name
Type: System.String
The variable name.
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace