RhinoCommon API
AnnotationBase.GetDimensionStyle Method
 Return the proper dimension style from which to get properties for this annotation object If this object has style overrides, those will be included in the returned dimension style and the style will be updated to include the current state of the parent style for non-overridden fields
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle GetDimensionStyle(
	DimensionStyle parentDimStyle
)
Public Function GetDimensionStyle (
	parentDimStyle As DimensionStyle
) As DimensionStyle
Parameters
parentDimStyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="parentDimStyle"/> documentation for "M:Rhino.Geometry.AnnotationBase.GetDimensionStyle(Rhino.DocObjects.DimensionStyle)"]
Return Value
Type: DimensionStyle
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.GetDimensionStyle(Rhino.DocObjects.DimensionStyle)"]
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace