RhinoCommon API
PreviewAppearance.SetRotationX Method
 SetRotationX
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetRotationX(
	double d
)
Public Sub SetRotationX (
	d As Double
)
Parameters
d
Type: System.Double
[Missing <param name="d"/> documentation for "M:Rhino.Render.PreviewAppearance.SetRotationX(System.Double)"]
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace