RhinoCommon API
IRhinoUiDialogService.DetectColorScheme Method
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.DetectColorScheme(System.Boolean@,System.Boolean@)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
void DetectColorScheme(
	out bool defaultLightMode,
	out bool defaultDarkMode
)
Sub DetectColorScheme (
	<OutAttribute> ByRef defaultLightMode As Boolean,
	<OutAttribute> ByRef defaultDarkMode As Boolean
)
Parameters
defaultLightMode
Type: System.Boolean
[Missing <param name="defaultLightMode"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.DetectColorScheme(System.Boolean@,System.Boolean@)"]
defaultDarkMode
Type: System.Boolean
[Missing <param name="defaultDarkMode"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.DetectColorScheme(System.Boolean@,System.Boolean@)"]
See Also
Reference
IRhinoUiDialogService Interface
Rhino.UI Namespace