RhinoCommon API
SecretKey Constructor
Initializes a new instance of the SecretKey class
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SecretKey()
Public Sub New
See Also
Reference
SecretKey Class
Rhino.Runtime.RhinoAccounts Namespace