RhinoCommon API
PreviewLighting.ElementKind Method
 ElementKind
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string ElementKind()
Public Function ElementKind As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.PreviewLighting.ElementKind"]
See Also
Reference
PreviewLighting Class
Rhino.Render Namespace