RhinoCommon API
BinaryArchiveWriter.WriteVector2d Method
 Writes a Vector2d value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteVector2d(
	Vector2d value
)
Public Sub WriteVector2d (
	value As Vector2d
)
Parameters
value
Type: Rhino.Geometry.Vector2d
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace