RhinoCommon API
Transform.GetEulerZYZ Method
 Find the Euler angles for a rotation transformation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public bool GetEulerZYZ(
	out double alpha,
	out double beta,
	out double gamma
)
Public Function GetEulerZYZ (
	<OutAttribute> ByRef alpha As Double,
	<OutAttribute> ByRef beta As Double,
	<OutAttribute> ByRef gamma As Double
) As Boolean
Parameters
alpha
Type: System.Double
Angle of rotation, in radians, about the Z axis.
beta
Type: System.Double
Angle of rotation, in radians, about the Y axis.
gamma
Type: System.Double
Angle of rotation, in radians, about the Z axis.
Return Value
Type: Boolean
 If true, then this = RotationZYZ(alpha, beta, gamma) = R_z(alpha) * R_y(beta) * R_z(gamma) where R_*(angle) is rotation of angle radians about the corresponding *-world coordinate axis. If false, then this is not a rotation.
Remarks
 Note, alpha and gamma are in the range (-pi, pi] while beta in the range [0, pi]
See Also
Reference
Transform Structure
Rhino.Geometry Namespace