RhinoCommon API
SubD.SetEdgeSharpness Method (IEnumerable<SubDEdge>, SubDEdgeSharpness, Boolean)
 Sets the sharpness of a list of edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public uint SetEdgeSharpness(
	IEnumerable<SubDEdge> edges,
	SubDEdgeSharpness sharpness,
	bool preserveSymmetry
)
Public Function SetEdgeSharpness (
	edges As IEnumerable(Of SubDEdge),
	sharpness As SubDEdgeSharpness,
	preserveSymmetry As Boolean
) As UInteger
Parameters
edges
Type: System.Collections.Generic.IEnumerable<SubDEdge>
The edges to change.
sharpness
Type: Rhino.Geometry.SubDEdgeSharpness
 The sharpness to apply to every edge in the list. Pass Smooth to make the edges smooth again.
preserveSymmetry
Type: System.Boolean
 If true and this SubD has symmetric content, the change tries to keep it symmetric.
Return Value
Type: UInt32
The number of edges that were changed.
See Also
Reference
SubD Class
SetEdgeSharpness Overload
Rhino.Geometry Namespace