RhinoCommon API
ContentUndoHelper Constructor (RhinoDoc)
 Constructs a ContentUndoHelper object inside a using block to handle undo when modifying a RenderContent or - alternatively - create the ContentUndoHelper and explicitly call Dispose when you are done.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public ContentUndoHelper(
	RhinoDoc doc
)
Public Sub New (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.ContentUndoHelper.#ctor(Rhino.RhinoDoc)"]
See Also
Reference
ContentUndoHelper Class
ContentUndoHelper Overload
Rhino.Render Namespace