RhinoCommon API
PreviewAppearance.Lighting Method
 Lighting
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PreviewLighting Lighting()
Public Function Lighting As PreviewLighting
Return Value
Type: PreviewLighting
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.Lighting"]
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace