RhinoCommon API
RenderPipeline Constructor (RhinoDoc, RunMode, PlugIn, Size, String, RenderWindow.StandardChannels, Boolean, Boolean)
 Constructs a subclass of this object on the stack in your Rhino plug-in's Render() or RenderWindow() implementation.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected RenderPipeline(
	RhinoDoc doc,
	RunMode mode,
	PlugIn plugin,
	Size sizeRendering,
	string caption,
	RenderWindow.StandardChannels channels,
	bool reuseRenderWindow,
	bool clearLastRendering
)
Protected Sub New (
	doc As RhinoDoc,
	mode As RunMode,
	plugin As PlugIn,
	sizeRendering As Size,
	caption As String,
	channels As RenderWindow.StandardChannels,
	reuseRenderWindow As Boolean,
	clearLastRendering As Boolean
)
Parameters
doc
Type: Rhino.RhinoDoc
A Rhino document.
mode
Type: Rhino.Commands.RunMode
A command running mode, such as scripted or interactive.
plugin
Type: Rhino.PlugIns.PlugIn
A plug-in.
sizeRendering
Type: System.Drawing.Size
The width and height of the rendering.
caption
Type: System.String
The caption to display in the frame window.
channels
Type: Rhino.Render.RenderWindow.StandardChannels
The color channel or channels.
reuseRenderWindow
Type: System.Boolean
This parameter is obsolete.
clearLastRendering
Type: System.Boolean
 true If the last rendering should be removed. Indicates that this render is being done using RenderQuiet(). It specifically makes sure the render mesh iterator does not display any progress user interface.
See Also
Reference
RenderPipeline Class
RenderPipeline Overload
Rhino.Render Namespace