RhinoCommon API
ReplayHistoryData.TryGetDoubles Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetDoubles(System.Int32,System.Double[]@)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public bool TryGetDoubles(
	int id,
	out double[] values
)
Public Function TryGetDoubles (
	id As Integer,
	<OutAttribute> ByRef values As Double()
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetDoubles(System.Int32,System.Double[]@)"]
values
Type: System.Double[]
[Missing <param name="values"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetDoubles(System.Int32,System.Double[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetDoubles(System.Int32,System.Double[]@)"]
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace