RhinoCommon API
SubDEdgeChain.Reverse Method
 Reverses the direction of the chain.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public void Reverse()
Public Sub Reverse
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace