RhinoCommon API
BezierCurve.GetControlVertex3d Method
Gets the 3D location of a control vertex at the specified index.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d GetControlVertex3d(
	int index
)
Public Function GetControlVertex3d (
	index As Integer
) As Point3d
Parameters
index
Type: System.Int32
 Control vertex index (0 <= index < ControlVertexCount).
Return Value
Type: Point3d
 The 3D location of the control vertex. If the Bezier is rational, the euclidean location is returned. Returns Unset if the index is out of range or the control vertex cannot be retrieved.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when index is out of range.
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace