RhinoCommon API
RenderPrimitiveList.AutoDeleteMaterialsOn Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPrimitiveList.AutoDeleteMaterialsOn"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AutoDeleteMaterialsOn()
Public Function AutoDeleteMaterialsOn As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPrimitiveList.AutoDeleteMaterialsOn"]
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace