RhinoCommon API
File3dsWriteOptions Constructor
Initializes a new instance of the File3dsWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dsWriteOptions()
Public Sub New
See Also
Reference
File3dsWriteOptions Class
Rhino.FileIO Namespace