RhinoCommon API
ManifestTable.FindName Method (String, ModelComponentType, Guid)
 Uses the name to find a model component. The name is the value that is stored in the .Name property. Deleted objects have no name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract ModelComponent FindName(
	string name,
	ModelComponentType type,
	Guid parent
)
Public MustOverride Function FindName (
	name As String,
	type As ModelComponentType,
	parent As Guid
) As ModelComponent
Parameters
name
Type: System.String
Name of model component to search for.
type
Type: Rhino.DocObjects.ModelComponentType
The type to be searched. Cannot be Unset.
parent
Type: System.Guid
Parent object id. This is only required for layers.
Return Value
Type: ModelComponent
Reference to the rhino object or null if no such object could be found.
See Also
Reference
ManifestTable Class
FindName Overload
Rhino.FileIO Namespace