RhinoCommon API
RenderWindow.SetProgress Method
 Accepts a rendering progress value to inform the user of the rendering advances.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetProgress(
	string text,
	float progress
)
Public Sub SetProgress (
	text As String,
	progress As Single
)
Parameters
text
Type: System.String
The progress text.
progress
Type: System.Single
A progress value in the domain [0.0f; 1.0f].
See Also
Reference
RenderWindow Class
Rhino.Render Namespace