RhinoCommon API
Quaternion.GetRotation Method (Transform)
 Returns a transformation matrix that performs the rotation defined by the quaternion. The transformation returned by this method has the property that xform * V = q.Rotate(V). If the quaternion is not unitized, the rotation of its unitized form is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public bool GetRotation(
	out Transform xform
)
Public Function GetRotation (
	<OutAttribute> ByRef xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Return Value
Type: Boolean
true if successful, false otherwise.
Remarks
 Do not confuse the result of this method the transformation matrix returned by MatrixForm().
See Also
Reference
Quaternion Structure
GetRotation Overload
Rhino.Geometry Namespace