RhinoCommon API
Interval.Addition Operator (Interval, Double)
 Shifts a Interval by a specific amount (addition).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Interval operator +(
	Interval interval,
	double number
)
Public Shared Operator + (
	interval As Interval,
	number As Double
) As Interval
Parameters
interval
Type: Rhino.Geometry.Interval
The interval to be used as a base.
number
Type: System.Double
The shifting value.
Return Value
Type: Interval
A new interval where T0 and T1 are summed with number.
See Also
Reference
Interval Structure
Addition Overload
Rhino.Geometry Namespace