RhinoCommon API
LengthUnit.IsNone Method
 Determines whether the specified value is None.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool IsNone(
	 in LengthUnit unit
)
Public Shared Function IsNone (
	 ByRef unit As LengthUnit
) As Boolean
Parameters
unit
Type: Rhino.LengthUnit
[Missing <param name="unit"/> documentation for "M:Rhino.LengthUnit.IsNone(Rhino.LengthUnit@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.LengthUnit.IsNone(Rhino.LengthUnit@)"]
See Also
Reference
LengthUnit Structure
Rhino Namespace