RhinoCommon API
PostEffectExecutionControl.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffectExecutionControl.Finalize"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
PostEffectExecutionControl Class
Rhino.Render.PostEffects Namespace