RhinoCommon API
GetPoint.PointOnSurface Method
 Use to determine if point was on a surface. If the point was on a surface, then the (u,v) are the surface parameters for the point. The point returned by Point() is the same as surface.PointAt(u,v).
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Surface PointOnSurface(
	out double u,
	out double v
)
Public Function PointOnSurface (
	<OutAttribute> ByRef u As Double,
	<OutAttribute> ByRef v As Double
) As Surface
Parameters
u
Type: System.Double
If the point was on a surface, then the u parameter.
v
Type: System.Double
If the point was on a surface, then the v parameter.
Return Value
Type: Surface
The surface or null if the point was not on a surface.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace