RhinoCommon API
DisplayPointAttributes Constructor (DisplayPointAttributes)
Initializes a new instance of the DisplayPointAttributes class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public DisplayPointAttributes(
	DisplayPointAttributes attributes
)
Public Sub New (
	attributes As DisplayPointAttributes
)
Parameters
attributes
Type: Rhino.Display.DisplayPointAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.Display.DisplayPointAttributes.#ctor(Rhino.Display.DisplayPointAttributes)"]
See Also
Reference
DisplayPointAttributes Class
DisplayPointAttributes Overload
Rhino.Display Namespace