RhinoCommon API
SimpleArrayVector3d Constructor (IEnumerable<Vector3d>)
 Initializes a new SimpleArrayVector3d instance from a set of vectors
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SimpleArrayVector3d(
	IEnumerable<Vector3d> vectors
)
Public Sub New (
	vectors As IEnumerable(Of Vector3d)
)
Parameters
vectors
Type: System.Collections.Generic.IEnumerable<Vector3d>
See Also
Reference
SimpleArrayVector3d Class
SimpleArrayVector3d Overload
Rhino.Runtime.InteropWrappers Namespace