RhinoCommon API
FieldDictionary.ContainsField Method
 Call this method to determine if a this FieldsList contains a field with the specified field name.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public bool ContainsField(
	string fieldName
)
Public Function ContainsField (
	fieldName As String
) As Boolean
Parameters
fieldName
Type: System.String
Field to search for
Return Value
Type: Boolean
 Returns true if a field with that matches fieldName is found or false if it is not found.
See Also
Reference
FieldDictionary Class
Rhino.Render.Fields Namespace