RhinoCommon API
PersistentSettings.TryGetDefault Method (String, String[])
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.String[]@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetDefault(
	string key,
	out string[] value
)
Public Function TryGetDefault (
	key As String,
	<OutAttribute> ByRef value As String()
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.String[]@)"]
value
Type: System.String[]
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.String[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.String[]@)"]
See Also
Reference
PersistentSettings Class
TryGetDefault Overload
Rhino Namespace