RhinoCommon API
RdkSelectionNavigator.CanGoBackwards Method
 Check the backwards status of the navigator
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool CanGoBackwards()
Public Function CanGoBackwards As Boolean
Return Value
Type: Boolean
True if it is possible to navigate backwards, else false
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace