RhinoCommon API
SupportOptions.ShowCustom Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.ShowCustom"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_ShowCustom' instead")]
public static bool ShowCustom()
<ObsoleteAttribute("Use 'Libraries_ShowCustom' instead")>
Public Shared Function ShowCustom As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.ShowCustom"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace