RhinoCommon API
Curve.CreateArcBlend Method
 Creates a polycurve consisting of two tangent arc segments that connect two points and two directions.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public static Curve CreateArcBlend(
	Point3d startPt,
	Vector3d startDir,
	Point3d endPt,
	Vector3d endDir,
	double controlPointLengthRatio
)
Public Shared Function CreateArcBlend (
	startPt As Point3d,
	startDir As Vector3d,
	endPt As Point3d,
	endDir As Vector3d,
	controlPointLengthRatio As Double
) As Curve
Parameters
startPt
Type: Rhino.Geometry.Point3d
Start of the arc blend curve.
startDir
Type: Rhino.Geometry.Vector3d
Start direction of the arc blend curve.
endPt
Type: Rhino.Geometry.Point3d
End of the arc blend curve.
endDir
Type: Rhino.Geometry.Vector3d
End direction of the arc blend curve.
controlPointLengthRatio
Type: System.Double
 The ratio of the control polygon lengths of the two arcs. Note, a value of 1.0 means the control polygon lengths for both arcs will be the same.
Return Value
Type: Curve
The arc blend curve, or null on error.
See Also
Reference
Curve Class
Rhino.Geometry Namespace