RhinoCommon API
RhinoDoc.SetCustomUnitSystem Method
 Changes the unit system to custom units and sets the custom unit scale.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public bool SetCustomUnitSystem(
	bool modelUnits,
	string customUnitName,
	double metersPerCustomUnit,
	bool scale
)
Public Function SetCustomUnitSystem (
	modelUnits As Boolean,
	customUnitName As String,
	metersPerCustomUnit As Double,
	scale As Boolean
) As Boolean
Parameters
modelUnits
Type: System.Boolean
 Set true to set values from the document's model unit system. Set false to set values from the document's page unit system.
customUnitName
Type: System.String
The custom unit system name.
metersPerCustomUnit
Type: System.Double
The meters per custom unit scale.
scale
Type: System.Boolean
Set true to scale existing objects.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
RhinoDoc Class
Rhino Namespace