RhinoCommon API
PhysicallyBasedMaterial.ParametersNames Constructor
Initializes a new instance of the PhysicallyBasedMaterial.ParametersNames class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ParametersNames()
Public Sub New
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace