RhinoCommon API
RhinoSettings.GetCurrentRenderer Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RhinoSettings.GetCurrentRenderer"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.17
Syntax
public Guid GetCurrentRenderer()
Public Function GetCurrentRenderer As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.DataSources.RhinoSettings.GetCurrentRenderer"]
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace