RhinoCommon API
Worksession.Attach Method (String)
 Attaches a model to this worksession as a reference model.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Attach(
	string path
)
Public Function Attach (
	path As String
) As Boolean
Parameters
path
Type: System.String
The full path to the .3dm file to attach.
Return Value
Type: Boolean
True if the model was attached, false otherwise.
Remarks
 The model is attached to this worksession's document, which need not be the active document. No user interface is displayed.
See Also
Reference
Worksession Class
Attach Overload
Rhino.DocObjects Namespace