RhinoCommon API
PersistentSettings.TryGetGuid Method (String, Guid)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetGuid(System.String,System.Guid@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetGuid(
	string key,
	out Guid value
)
Public Function TryGetGuid (
	key As String,
	<OutAttribute> ByRef value As Guid
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetGuid(System.String,System.Guid@)"]
value
Type: System.Guid
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetGuid(System.String,System.Guid@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetGuid(System.String,System.Guid@)"]
See Also
Reference
PersistentSettings Class
TryGetGuid Overload
Rhino Namespace