RhinoCommon API
OptionInteger Constructor (Int32)
Initializes a new instance of the OptionInteger class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public OptionInteger(
	int initialValue
)
Public Sub New (
	initialValue As Integer
)
Parameters
initialValue
Type: System.Int32
[Missing <param name="initialValue"/> documentation for "M:Rhino.Input.Custom.OptionInteger.#ctor(System.Int32)"]
See Also
Reference
OptionInteger Class
OptionInteger Overload
Rhino.Input.Custom Namespace