RhinoCommon API
ChangeQueue.ConvertCameraBasedLightToWorld Method
 Convert given (camera-based) light to a world-based light (in-place)
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void ConvertCameraBasedLightToWorld(
	ChangeQueue changequeue,
	Light light,
	ViewInfo vp
)
Public Shared Sub ConvertCameraBasedLightToWorld (
	changequeue As ChangeQueue,
	light As Light,
	vp As ViewInfo
)
Parameters
changequeue
Type: Rhino.Render.ChangeQueue.ChangeQueue
[Missing <param name="changequeue"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ConvertCameraBasedLightToWorld(Rhino.Render.ChangeQueue.ChangeQueue,Rhino.Render.ChangeQueue.Light,Rhino.DocObjects.ViewInfo)"]
light
Type: Rhino.Render.ChangeQueue.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ConvertCameraBasedLightToWorld(Rhino.Render.ChangeQueue.ChangeQueue,Rhino.Render.ChangeQueue.Light,Rhino.DocObjects.ViewInfo)"]
vp
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="vp"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ConvertCameraBasedLightToWorld(Rhino.Render.ChangeQueue.ChangeQueue,Rhino.Render.ChangeQueue.Light,Rhino.DocObjects.ViewInfo)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace