RhinoCommon API
ContentFactory.NewContent Method
 New Content returns a new content, which is Initialized with the Initialize() function. The content should be unitilized after use with the Unitialize function.
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public RenderContent NewContent()
Public Function NewContent As RenderContent
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.Render.DataSources.ContentFactory.NewContent"]
See Also
Reference
ContentFactory Class
Rhino.Render.DataSources Namespace