RhinoCommon API
SubD.JoinSubDs Method (IEnumerable<SubD>, Double, Boolean, Boolean)
 Joins an enumeration of SubDs to form as few as possible resulting SubDs. There may be more than one SubD in the result array.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.16
Syntax
public static SubD[] JoinSubDs(
	IEnumerable<SubD> subdsToJoin,
	double tolerance,
	bool joinedEdgesAreCreases,
	bool preserveSymmetry
)
Public Shared Function JoinSubDs (
	subdsToJoin As IEnumerable(Of SubD),
	tolerance As Double,
	joinedEdgesAreCreases As Boolean,
	preserveSymmetry As Boolean
) As SubD()
Parameters
subdsToJoin
Type: System.Collections.Generic.IEnumerable<SubD>
An enumeration of SubDs to join.
tolerance
Type: System.Double
The join tolerance.
joinedEdgesAreCreases
Type: System.Boolean
 If true, merged boundary edges will be creases. If false, merged boundary edges will be smooth.
preserveSymmetry
Type: System.Boolean
 If true, and if all inputs share the same symmetry, the output will also be symmetrical wrt. that symmetry. If false, or true but no common symmetry exists, symmetry information is removed from all newly joined SubDs.
Return Value
Type: SubD[]
[Missing <returns> documentation for "M:Rhino.Geometry.SubD.JoinSubDs(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubD},System.Double,System.Boolean,System.Boolean)"]
Remarks
 NOTE: All of the input SubDs are copied and added to the result array in one form or another.
See Also
Reference
SubD Class
JoinSubDs Overload
Rhino.Geometry Namespace