RhinoCommon API
FilePov.Write Method
Write a POV file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	FilePovWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As FilePovWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FilePovWriteOptions
options used for generating the POV file
Return Value
Type: Boolean
true on success
See Also
Reference
FilePov Class
Rhino.FileIO Namespace