RhinoCommon API
File3dm.ToByteArray Method
 Write to an in-memory byte[]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public byte[] ToByteArray()
Public Function ToByteArray As Byte()
Return Value
Type: Byte[]
[Missing <returns> documentation for "M:Rhino.FileIO.File3dm.ToByteArray"]
See Also
Reference
File3dm Class
ToByteArray Overload
Rhino.FileIO Namespace