RhinoCommon API
GetObject.ClearObjects Method
 Clear possible special object drawing
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public void ClearObjects()
Public Sub ClearObjects
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace