RhinoCommon API
Markup Constructor (Markup)
Create a new Markup that is a copy of another Markup
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Markup(
	Markup other
)
Public Sub New (
	other As Markup
)
Parameters
other
Type: Rhino.DocObjects.Markup
[Missing <param name="other"/> documentation for "M:Rhino.DocObjects.Markup.#ctor(Rhino.DocObjects.Markup)"]
See Also
Reference
Markup Class
Markup Overload
Rhino.DocObjects Namespace