RhinoCommon API
ViewSettings.UpdateFromState Method
 Updates from a particular setting state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void UpdateFromState(
	ViewSettingsState state
)
Public Shared Sub UpdateFromState (
	state As ViewSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.ViewSettingsState
The new state that will be set.
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace