RhinoCommon API
TextEntity.CreateSurfaces Method (DimensionStyle, Double, Double)
 Creates planar breps from the outline curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Brep[] CreateSurfaces(
	DimensionStyle dimstyle,
	double smallCapsScale = 1,
	double spacing = 0
)
Public Function CreateSurfaces (
	dimstyle As DimensionStyle,
	Optional smallCapsScale As Double = 1,
	Optional spacing As Double = 0
) As Brep()
Parameters
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.TextEntity.CreateSurfaces(Rhino.DocObjects.DimensionStyle,System.Double,System.Double)"]
smallCapsScale (Optional)
Type: System.Double
 Set to create small caps out of lower case letters.
spacing (Optional)
Type: System.Double
 Set to add additional spacing between glyph output.
Return Value
Type: Brep[]
An array of planar breps.
See Also
Reference
TextEntity Class
CreateSurfaces Overload
Rhino.Geometry Namespace