RhinoCommon API
SupportOptions.BlockContent_InitialLocation Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.BlockContent_InitialLocation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static SupportOptions.RdkInitialLocation BlockContent_InitialLocation()
Public Shared Function BlockContent_InitialLocation As SupportOptions.RdkInitialLocation
Return Value
Type: SupportOptions.RdkInitialLocation
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.BlockContent_InitialLocation"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace