RhinoCommon API
Brep.CreatePlanarUnion Method (Brep, Brep, Plane, Double)
 CreatePlanarUnion
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Brep[] CreatePlanarUnion(
	Brep b0,
	Brep b1,
	Plane plane,
	double tolerance
)
Public Shared Function CreatePlanarUnion (
	b0 As Brep,
	b1 As Brep,
	plane As Plane,
	tolerance As Double
) As Brep()
Parameters
b0
Type: Rhino.Geometry.Brep
The first brep to union.
b1
Type: Rhino.Geometry.Brep
The first brep to union.
plane
Type: Rhino.Geometry.Plane
The plane in which all the input breps lie
tolerance
Type: System.Double
Tolerance to use for union operation.
Return Value
Type: Brep[]
An array of Brep results or null on failure.
See Also
Reference
Brep Class
CreatePlanarUnion Overload
Rhino.Geometry Namespace