RhinoCommon API
ObjectTable.Replace Method (ObjRef, Brep, Boolean)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Brep,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public bool Replace(
	ObjRef objref,
	Brep brep,
	bool splitKinkySurfaces
)
Public Function Replace (
	objref As ObjRef,
	brep As Brep,
	splitKinkySurfaces As Boolean
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
[Missing <param name="objref"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Brep,System.Boolean)"]
brep
Type: Rhino.Geometry.Brep
[Missing <param name="brep"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Brep,System.Boolean)"]
splitKinkySurfaces
Type: System.Boolean
[Missing <param name="splitKinkySurfaces"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Brep,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Brep,System.Boolean)"]
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace