RhinoCommon API
GumballDisplayConduit Constructor (ActiveSpace)
Initializes a new instance of the GumballDisplayConduit class
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public GumballDisplayConduit(
	ActiveSpace space
)
Public Sub New (
	space As ActiveSpace
)
Parameters
space
Type: Rhino.DocObjects.ActiveSpace
[Missing <param name="space"/> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.#ctor(Rhino.DocObjects.ActiveSpace)"]
See Also
Reference
GumballDisplayConduit Class
GumballDisplayConduit Overload
Rhino.UI.Gumball Namespace