RhinoCommon API
ViewportInfo.CalculateCameraUpDirection Method
 Calculates the camera up direction.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public static Vector3d CalculateCameraUpDirection(
	Point3d location,
	Vector3d direction,
	double angle
)
Public Shared Function CalculateCameraUpDirection (
	location As Point3d,
	direction As Vector3d,
	angle As Double
) As Vector3d
Parameters
location
Type: Rhino.Geometry.Point3d
The camera location.
direction
Type: Rhino.Geometry.Vector3d
The camera direction.
angle
Type: System.Double
The camera rotation angle in radians.
Return Value
Type: Vector3d
The camera up direction.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace