RhinoCommon API
MeshNgonList.Orientation Method
 Determine if the ngon's boundary orientation matches that of the set of faces it is made from.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int Orientation(
	int index,
	bool permitHoles
)
Public Function Orientation (
	index As Integer,
	permitHoles As Boolean
) As Integer
Parameters
index
Type: System.Int32
Ngon index.
permitHoles
Type: System.Boolean
 true if the ngon is permitted to have interior holes, false otherwise.
Return Value
Type: Int32
 1: The ngon does not have holes, the ngon's faces are compatibly oriented, and the ngon's outer boundary orientation matches the faces' orientation. -1: The ngon does not have holes, the ngon's faces are compatibly oriented, and the ngon's outer boundary orientation is opposite the faces' orientation. 0: Otherwise.The ngon may be invalid, have holes, the ngon's faces may not be compatibly oriented, the ngons edges may not have a consistent orientation with respect to the faces, or some other issue.
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace