RhinoCommon API
TextLog Constructor (IntPtr)
Initializes a new instance of the TextLog class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextLog(
	IntPtr ptr
)
Public Sub New (
	ptr As IntPtr
)
Parameters
ptr
Type: System.IntPtr
[Missing <param name="ptr"/> documentation for "M:Rhino.FileIO.TextLog.#ctor(System.IntPtr)"]
See Also
Reference
TextLog Class
TextLog Overload
Rhino.FileIO Namespace