RhinoCommon API
FileObj.Read Method
[Missing <summary> documentation for "M:Rhino.FileIO.FileObj.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileObjReadOptions)"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool Read(
	string filename,
	RhinoDoc doc,
	FileObjReadOptions options
)
Public Shared Function Read (
	filename As String,
	doc As RhinoDoc,
	options As FileObjReadOptions
) As Boolean
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.FileIO.FileObj.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileObjReadOptions)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.FileIO.FileObj.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileObjReadOptions)"]
options
Type: Rhino.FileIO.FileObjReadOptions
[Missing <param name="options"/> documentation for "M:Rhino.FileIO.FileObj.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileObjReadOptions)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.FileObj.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileObjReadOptions)"]
See Also
Reference
FileObj Class
Rhino.FileIO Namespace