RhinoCommon API
StringTable.Delete Method (String)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.StringTable.Delete(System.String)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Delete(
	string key
)
Public Sub Delete (
	key As String
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.DocObjects.Tables.StringTable.Delete(System.String)"]
See Also
Reference
StringTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace