RhinoCommon API
BinaryArchiveWriter.WriteByteArray Method
 Writes a list, an array, or any enumerable of Byte to the archive.
The return will always be an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteByteArray(
	IEnumerable<byte> value
)
Public Sub WriteByteArray (
	value As IEnumerable(Of Byte)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<Byte>
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace