RhinoCommon API
NurbsCurveFitParameters.MinimumPointCountForDegree Method
 Give a degree and periodic setting, determine the minimum point count.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int MinimumPointCountForDegree(
	int degree,
	bool bClosed,
	bool bSubDFriendly
)
Public Shared Function MinimumPointCountForDegree (
	degree As Integer,
	bClosed As Boolean,
	bSubDFriendly As Boolean
) As Integer
Parameters
degree
Type: System.Int32
 Degree of output NURBS curve.
bClosed
Type: System.Boolean
 True if the output NURBS curve will be closed.
bSubDFriendly
Type: System.Boolean
 True if the output NURBS curve will be SubDFriendly.
Return Value
Type: Int32
 Minimum permitted point count.
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace