RhinoCommon API
Brep.SetTolerancesBoxesAndFlags Method
 Set tolerances and flags in a Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetTolerancesBoxesAndFlags()
Public Sub SetTolerancesBoxesAndFlags
See Also
Reference
Brep Class
SetTolerancesBoxesAndFlags Overload
Rhino.Geometry Namespace