RhinoCommon API
Brep.DuplicateBrep Method
 Same as Duplicate(), but already performs a cast to a brep.
This cast always succeeds.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep DuplicateBrep()
Public Function DuplicateBrep As Brep
Return Value
Type: Brep
A brep.
See Also
Reference
Brep Class
Rhino.Geometry Namespace