RhinoCommon API
TextFields.PointCoordinate Method
 returns the location of a 3d point
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string PointCoordinate(
	string pointId,
	string axis
)
Public Shared Function PointCoordinate (
	pointId As String,
	axis As String
) As String
Parameters
pointId
Type: System.String
[Missing <param name="pointId"/> documentation for "M:Rhino.Runtime.TextFields.PointCoordinate(System.String,System.String)"]
axis
Type: System.String
[Missing <param name="axis"/> documentation for "M:Rhino.Runtime.TextFields.PointCoordinate(System.String,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.PointCoordinate(System.String,System.String)"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace