RhinoCommon API
GetPoint.Get Method (Boolean, Boolean)
 After setting up options and so on, call this method to get a 2d or 3d point.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.12
Syntax
public GetResult Get(
	bool onMouseUp,
	bool get2DPoint
)
Public Function Get (
	onMouseUp As Boolean,
	get2DPoint As Boolean
) As GetResult
Parameters
onMouseUp
Type: System.Boolean
 If false, the point is returned when the left mouse button goes down. If true, the point is returned when the left mouse button goes up.
get2DPoint
Type: System.Boolean
If true then get a 2d point otherwise get a 2d point
Return Value
Type: GetResult
Point if the user chose a 3d point; Point2d if the user chose a 2d point; other enumeration value otherwise.
See Also
Reference
GetPoint Class
Get Overload
Rhino.Input.Custom Namespace