RhinoCommon API
WorksessionFileLayerValues.Finalize Method
Releases the native layer settings.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
WorksessionFileLayerValues Class
Rhino.FileIO Namespace