RhinoCommon API
File3dmRenderContent.FindChild Method
The child with the specified child slot name, or null if no such child exists.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmRenderContent FindChild(
	string child_slot_name
)
Public Function FindChild (
	child_slot_name As String
) As File3dmRenderContent
Parameters
child_slot_name
Type: System.String
[Missing <param name="child_slot_name"/> documentation for "M:Rhino.FileIO.File3dmRenderContent.FindChild(System.String)"]
Return Value
Type: File3dmRenderContent
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderContent.FindChild(System.String)"]
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace