RhinoCommon API
Brep.Split Method (IEnumerable<Brep>, Double)
 Splits a Brep into pieces using Breps as cutters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.13
Syntax
public Brep[] Split(
	IEnumerable<Brep> cutters,
	double intersectionTolerance
)
Public Function Split (
	cutters As IEnumerable(Of Brep),
	intersectionTolerance As Double
) As Brep()
Parameters
cutters
Type: System.Collections.Generic.IEnumerable<Brep>
One or more Breps to use as cutters.
intersectionTolerance
Type: System.Double
The tolerance with which to compute intersections.
Return Value
Type: Brep[]
A new array of Breps. This array can be empty.
See Also
Reference
Brep Class
Split Overload
Rhino.Geometry Namespace