RhinoCommon API
BinaryArchiveWriter.WriteDouble Method
 Writes a Double value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteDouble(
	double value
)
Public Sub WriteDouble (
	value As Double
)
Parameters
value
Type: System.Double
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace