RhinoCommon API
Mesh.PointAt Method (MeshPoint)
 Evaluate a mesh at a set of barycentric coordinates.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d PointAt(
	MeshPoint meshPoint
)
Public Function PointAt (
	meshPoint As MeshPoint
) As Point3d
Parameters
meshPoint
Type: Rhino.Geometry.MeshPoint
MeshPoint instance containing a valid Face Index and Barycentric coordinates.
Return Value
Type: Point3d
A Point on the mesh or Point3d.Unset if the faceIndex is not valid or if the barycentric coordinates could not be evaluated.
See Also
Reference
Mesh Class
PointAt Overload
Rhino.Geometry Namespace