RhinoCommon API
SuspendCollectionChangedEventHandler<T> Constructor
 Constructor. Notifications from the set to the handler are suspended until this object is disposed.
 Namespace: Rhino.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SuspendCollectionChangedEventHandler(
	NotifyCollectionChangedEventHandler handler,
	TrulyObservableOrderedSet<T> set,
	bool fireOnResume = true
)
Public Sub New (
	handler As NotifyCollectionChangedEventHandler,
	set As TrulyObservableOrderedSet(Of T),
	Optional fireOnResume As Boolean = true
)
Parameters
handler
Type: System.Collections.Specialized.NotifyCollectionChangedEventHandler
The event handler to suspend
set
Type: Rhino.Runtime.Notifications.TrulyObservableOrderedSet<T>
The collection to suspend notifications for
fireOnResume (Optional)
Type: System.Boolean
If true (=default), upon resuming notifications one Reset event will be fired if the collection was modified during the suspension.
See Also
Reference
SuspendCollectionChangedEventHandler<T> Class
Rhino.Notifications Namespace