RhinoCommon API
BinaryArchiveWriter.WriteVector3d Method
 Writes a Vector3d value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteVector3d(
	Vector3d value
)
Public Sub WriteVector3d (
	value As Vector3d
)
Parameters
value
Type: Rhino.Geometry.Vector3d
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace