RhinoCommon API
MeshPrincipalCurvatureList.GetEnumerator Method
 Gets an enumerator that yields all principal curvatures in this collection.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IEnumerator<SurfaceCurvature> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of SurfaceCurvature)
Return Value
Type: IEnumerator<SurfaceCurvature>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MeshPrincipalCurvatureList Class
Rhino.Geometry.Collections Namespace