RhinoCommon API
Mesh.CreateFromLines Method
 Creates a mesh by analizing the edge structure. Input lines could be from the extraction of edges from an original mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Mesh CreateFromLines(
	Curve[] lines,
	int maxFaceValence,
	double tolerance
)
Public Shared Function CreateFromLines (
	lines As Curve(),
	maxFaceValence As Integer,
	tolerance As Double
) As Mesh
Parameters
lines
Type: Rhino.Geometry.Curve[]
Lines to use for computation. If curve is non-linear, curve ends are used
maxFaceValence
Type: System.Int32
The maximum number of edges per face.
tolerance
Type: System.Double
The distance after which two end points of lines are considered coincident.
Return Value
Type: Mesh
A new mesh, or null if no mesh is constructed.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace