RhinoCommon API
Vector3d.VectorAngle Method (Vector3d, Vector3d, Vector3d)
 Computes the angle of v1, v2 with a normal vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static double VectorAngle(
	Vector3d v1,
	Vector3d v2,
	Vector3d vNormal
)
Public Shared Function VectorAngle (
	v1 As Vector3d,
	v2 As Vector3d,
	vNormal As Vector3d
) As Double
Parameters
v1
Type: Rhino.Geometry.Vector3d
First vector.
v2
Type: Rhino.Geometry.Vector3d
Second vector.
vNormal
Type: Rhino.Geometry.Vector3d
Normal vector.
Return Value
Type: Double
On success, the angle (in radians) between a and b with respect of normal vector; RhinoMath.UnsetValue on failure.
See Also
Reference
Vector3d Structure
VectorAngle Overload
Rhino.Geometry Namespace