RhinoCommon API
IDialogService.ShowMultiListBox Method
[Missing <summary> documentation for "M:Rhino.UI.IDialogService.ShowMultiListBox(System.String,System.String,System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.String})"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
string[] ShowMultiListBox(
	string title,
	string message,
	IList<string> items,
	IList<string> defaults = null
)
Function ShowMultiListBox (
	title As String,
	message As String,
	items As IList(Of String),
	Optional defaults As IList(Of String) = Nothing
) As String()
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.IDialogService.ShowMultiListBox(System.String,System.String,System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.String})"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.IDialogService.ShowMultiListBox(System.String,System.String,System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.String})"]
items
Type: System.Collections.Generic.IList<String>
[Missing <param name="items"/> documentation for "M:Rhino.UI.IDialogService.ShowMultiListBox(System.String,System.String,System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.String})"]
defaults (Optional)
Type: System.Collections.Generic.IList<String>
[Missing <param name="defaults"/> documentation for "M:Rhino.UI.IDialogService.ShowMultiListBox(System.String,System.String,System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.String})"]
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.UI.IDialogService.ShowMultiListBox(System.String,System.String,System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.String})"]
See Also
Reference
IDialogService Interface
Rhino.UI Namespace