RhinoCommon API
Transform.Multiply Operator (Transform, Point3d)
 Multiplies a transformation by a point and gets a new point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Point3d operator *(
	Transform m,
	Point3d p
)
Public Shared Operator * (
	m As Transform,
	p As Point3d
) As Point3d
Parameters
m
Type: Rhino.Geometry.Transform
A transformation.
p
Type: Rhino.Geometry.Point3d
A point.
Return Value
Type: Point3d
The transformed point.
Remarks
 Note well: The right hand column and bottom row have an important effect when transforming a Euclidean point and have no effect when transforming a vector. Be sure you understand the differences between vectors and points when applying a 4x4 transformation.
See Also
Reference
Transform Structure
Multiply Overload
Rhino.Geometry Namespace