RhinoCommon API
AnnotationBase.SetFacename Method
[Missing <summary> documentation for "M:Rhino.Geometry.AnnotationBase.SetFacename(System.Boolean,System.String)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool SetFacename(
	bool set_on,
	string facename
)
Public Overridable Function SetFacename (
	set_on As Boolean,
	facename As String
) As Boolean
Parameters
set_on
Type: System.Boolean
[Missing <param name="set_on"/> documentation for "M:Rhino.Geometry.AnnotationBase.SetFacename(System.Boolean,System.String)"]
facename
Type: System.String
[Missing <param name="facename"/> documentation for "M:Rhino.Geometry.AnnotationBase.SetFacename(System.Boolean,System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.SetFacename(System.Boolean,System.String)"]
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace