RhinoCommon API
BinaryArchiveWriter.WriteDoubleArray Method
 Writes a list, an array, or any enumerable of Double to the archive.
The return will always be an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteDoubleArray(
	IEnumerable<double> value
)
Public Sub WriteDoubleArray (
	value As IEnumerable(Of Double)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<Double>
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace