RhinoCommon API
PersistentSettings.GetColor Method (String, Color, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Drawing.Color,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Color GetColor(
	string key,
	Color defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetColor (
	key As String,
	defaultValue As Color,
	legacyKeyList As IEnumerable(Of String)
) As Color
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Drawing.Color,System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.Drawing.Color
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Drawing.Color,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Drawing.Color,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetColor(System.String,System.Drawing.Color,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetColor Overload
Rhino Namespace