RhinoCommon API
LengthUnit.Equals Method (LengthUnit)
 Indicates whether the current object is equal to another object of the same type.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Equals(
	LengthUnit other
)
Public Function Equals (
	other As LengthUnit
) As Boolean
Parameters
other
Type: Rhino.LengthUnit
Return Value
Type: Boolean
true if the current object is equal to the other object otherwise false.
Implements
IEquatable<T>.Equals(T)
Remarks
Name is ignored on the comparison (Meters and Metres are considered the same)
See Also
Reference
LengthUnit Structure
Equals Overload
Rhino Namespace