RhinoCommon API
Worksession.Save Method
 Saves this worksession to its existing .rws file.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Save()
Public Function Save As Boolean
Return Value
Type: Boolean
 True if successful. False if the worksession has never been saved, in which case use SaveAs(String) to supply a path.
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace