RhinoCommon API
NamedPositionTable.ObjectXform Method (Guid, Guid, Transform)
Retrieve the Transform of a Rhino Object relate to a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ObjectXform(
	Guid id,
	Guid objId,
	ref Transform xform
)
Public Function ObjectXform (
	id As Guid,
	objId As Guid,
	ByRef xform As Transform
) As Boolean
Parameters
id
Type: System.Guid
 The Guid of the Named Position
objId
Type: System.Guid
 The Guid of the Rhino Object from which to retrieve the Transform.
xform
Type: Rhino.Geometry.Transform
 The Transform to retrieve.
Return Value
Type: Boolean
 Transform of the RhinoObject related to the Named Position.
See Also
Reference
NamedPositionTable Class
ObjectXform Overload
Rhino.DocObjects.Tables Namespace