RhinoCommon API
BrepTrimList.GetEnumerator Method
 Gets an enumerator that visits all edges.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public IEnumerator<BrepTrim> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepTrim)
Return Value
Type: IEnumerator<BrepTrim>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
BrepTrimList Class
Rhino.Geometry.Collections Namespace