RhinoCommon API
ArchivableDictionary.Set Method (String, RectangleF)
 Sets a RectangleF.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Set(
	string key,
	RectangleF val
)
Public Function Set (
	key As String,
	val As RectangleF
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: System.Drawing.RectangleF
A value for that key.
Because RectangleF has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,System.Drawing.RectangleF)"]
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace