RhinoCommon API
IndexPair.IndexOf Method
 Determines the index of a specific item in IndexPair.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int IndexOf(
	int item
)
Public Function IndexOf (
	item As Integer
) As Integer
Parameters
item
Type: System.Int32
The object to locate in the IList<T>.
Return Value
Type: Int32
 The index, 0 for I or 1 for J of item if found in the list; otherwise, -1.
Implements
IList<T>.IndexOf(T)
See Also
Reference
IndexPair Structure
Rhino Namespace