RhinoCommon API
File3mfWriteOptions.ToDictionary Method
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public ArchivableDictionary ToDictionary()
Public Function ToDictionary As ArchivableDictionary
Return Value
Type: ArchivableDictionary
[Missing <returns> documentation for "M:Rhino.FileIO.File3mfWriteOptions.ToDictionary"]
See Also
Reference
File3mfWriteOptions Class
Rhino.FileIO Namespace