RhinoCommon API
BezierCurve.IncreaseDegree Method
Increase degree of bezier
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IncreaseDegree(
	int desiredDegree
)
Public Function IncreaseDegree (
	desiredDegree As Integer
) As Boolean
Parameters
desiredDegree
Type: System.Int32
Return Value
Type: Boolean
true if successful. false if desiredDegree < current degree.
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace