RhinoCommon API
ZebraAnalysisSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public static ZebraAnalysisSettingsState GetDefaultState()
Public Shared Function GetDefaultState As ZebraAnalysisSettingsState
Return Value
Type: ZebraAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.ZebraAnalysisSettings.GetDefaultState"]
See Also
Reference
ZebraAnalysisSettings Class
Rhino.ApplicationSettings Namespace