RhinoCommon API
ChangeQueue.OriginalInstanceIdsFromMaterialId Method
 Return the collection of original document instance ids assocaited with the material id.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.23
Syntax
public Guid[] OriginalInstanceIdsFromMaterialId(
	uint crc
)
Public Function OriginalInstanceIdsFromMaterialId (
	crc As UInteger
) As Guid()
Parameters
crc
Type: System.UInt32
The material id
Return Value
Type: Guid[]
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.OriginalInstanceIdsFromMaterialId(System.UInt32)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace