RhinoCommon API
ObjectPropertiesPage.ShouldDisplay Method (ObjectPropertiesPageEventArgs)
 Called when the selected objects list changes, return true if the object list contains one or more object the page can modify.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool ShouldDisplay(
	ObjectPropertiesPageEventArgs e
)
Public Overridable Function ShouldDisplay (
	e As ObjectPropertiesPageEventArgs
) As Boolean
Parameters
e
Type: Rhino.UI.ObjectPropertiesPageEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.ShouldDisplay(Rhino.UI.ObjectPropertiesPageEventArgs)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPage.ShouldDisplay(Rhino.UI.ObjectPropertiesPageEventArgs)"]
See Also
Reference
ObjectPropertiesPage Class
ShouldDisplay Overload
Rhino.UI Namespace