RhinoCommon API
CollapsibleSectionImpl.Finalize Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.Finalize"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace