RhinoCommon API
DisplayPipeline.DrawLine Method (Line, DisplayPen)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Line,Rhino.Display.DisplayPen)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void DrawLine(
	Line line,
	DisplayPen pen
)
Public Sub DrawLine (
	line As Line,
	pen As DisplayPen
)
Parameters
line
Type: Rhino.Geometry.Line
[Missing <param name="line"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Line,Rhino.Display.DisplayPen)"]
pen
Type: Rhino.Display.DisplayPen
[Missing <param name="pen"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Line,Rhino.Display.DisplayPen)"]
See Also
Reference
DisplayPipeline Class
DrawLine Overload
Rhino.Display Namespace