RhinoCommon API
FileCsvDocument.Save Method (TextWriter)
 Writes the document to a text writer. Records are separated by CRLF, per RFC 4180. If the document has a header, it is written ahead of the data rows.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Save(
	TextWriter writer
)
Public Sub Save (
	writer As TextWriter
)
Parameters
writer
Type: System.IO.TextWriter
The writer to write to.
See Also
Reference
FileCsvDocument Class
Save Overload
Rhino.FileIO Namespace