RhinoCommon API
ViewCaptureWriter.DrawCircle Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawCircle(System.Drawing.PointF,System.Single,System.Drawing.Color,Rhino.Runtime.ViewCaptureWriter.Pen)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract void DrawCircle(
	PointF center,
	float diameter,
	Color fillColor,
	ViewCaptureWriter.Pen stroke
)
Protected MustOverride Sub DrawCircle (
	center As PointF,
	diameter As Single,
	fillColor As Color,
	stroke As ViewCaptureWriter.Pen
)
Parameters
center
Type: System.Drawing.PointF
[Missing <param name="center"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawCircle(System.Drawing.PointF,System.Single,System.Drawing.Color,Rhino.Runtime.ViewCaptureWriter.Pen)"]
diameter
Type: System.Single
[Missing <param name="diameter"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawCircle(System.Drawing.PointF,System.Single,System.Drawing.Color,Rhino.Runtime.ViewCaptureWriter.Pen)"]
fillColor
Type: System.Drawing.Color
[Missing <param name="fillColor"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawCircle(System.Drawing.PointF,System.Single,System.Drawing.Color,Rhino.Runtime.ViewCaptureWriter.Pen)"]
stroke
Type: Rhino.Runtime.ViewCaptureWriter.Pen
[Missing <param name="stroke"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawCircle(System.Drawing.PointF,System.Single,System.Drawing.Color,Rhino.Runtime.ViewCaptureWriter.Pen)"]
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace