RhinoCommon API
WorksessionFileModel.Finalize Method
Releases the native model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace