RhinoCommon API
IShrinkWrapService.ShrinkWrap Method (Mesh, ShrinkWrapParameters)
 Create a shrinkwrap from a single mesh Null on error or incompatible settings
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
Mesh ShrinkWrap(
	Mesh mesh,
	ShrinkWrapParameters parameters
)
Function ShrinkWrap (
	mesh As Mesh,
	parameters As ShrinkWrapParameters
) As Mesh
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.Mesh,Rhino.Geometry.ShrinkWrapParameters)"]
parameters
Type: Rhino.Geometry.ShrinkWrapParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.Mesh,Rhino.Geometry.ShrinkWrapParameters)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.Mesh,Rhino.Geometry.ShrinkWrapParameters)"]
See Also
Reference
IShrinkWrapService Interface
ShrinkWrap Overload
Rhino.Runtime Namespace