RhinoCommon API
RenderTexture.GetRepeatLocked Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetRepeatLocked"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual bool GetRepeatLocked()
Public Overridable Function GetRepeatLocked As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetRepeatLocked"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace