RhinoCommon API
ColorRGBA.CreateFromLCH Method
 Create the nearest RGBA equivalent of a LCH color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static ColorRGBA CreateFromLCH(
	ColorLCH lch
)
Public Shared Function CreateFromLCH (
	lch As ColorLCH
) As ColorRGBA
Parameters
lch
Type: Rhino.Display.ColorLCH
Target color in LCH space.
Return Value
Type: ColorRGBA
The RGBA equivalent of the LCH color.
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace