RhinoCommon API
RhinoDoc.PurgeObjectHistory Method (Int32)
 Purges the history records of every object in this document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PurgeObjectHistory(
	out int hiddenCount
)
Public Function PurgeObjectHistory (
	<OutAttribute> ByRef hiddenCount As Integer
) As Integer
Parameters
hiddenCount
Type: System.Int32
 The number of purged objects that were hidden or on a hidden layer.
Return Value
Type: Int32
The number of objects that had a history record purged.
See Also
Reference
RhinoDoc Class
PurgeObjectHistory Overload
Rhino Namespace