RhinoCommon API
IWindow.Move Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IWindow.Move(System.Drawing.Rectangle,System.Boolean,System.Boolean)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void Move(
	Rectangle pos,
	bool bRepaint,
	bool bRepaintBorder
)
Sub Move (
	pos As Rectangle,
	bRepaint As Boolean,
	bRepaintBorder As Boolean
)
Parameters
pos
Type: System.Drawing.Rectangle
[Missing <param name="pos"/> documentation for "M:Rhino.UI.Controls.IWindow.Move(System.Drawing.Rectangle,System.Boolean,System.Boolean)"]
bRepaint
Type: System.Boolean
[Missing <param name="bRepaint"/> documentation for "M:Rhino.UI.Controls.IWindow.Move(System.Drawing.Rectangle,System.Boolean,System.Boolean)"]
bRepaintBorder
Type: System.Boolean
[Missing <param name="bRepaintBorder"/> documentation for "M:Rhino.UI.Controls.IWindow.Move(System.Drawing.Rectangle,System.Boolean,System.Boolean)"]
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace