RhinoCommon API
RenderContent.MakeGroupInstance Method
 Create an 'instance' of the content hierarchy and group the new hierarchy with this hierarchy. If the instance is subsequently attached to the same document, the state of all members of the group will be kept synchronized. With the exception of the instance ids, all state is exactly preserved in the new instance hierarchy. \note The grouping will have no effect until the new instance is attached to the same document.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.26
Syntax
public RenderContent MakeGroupInstance()
Public Function MakeGroupInstance As RenderContent
Return Value
Type: RenderContent
A grouped instance of the content hierarchy.
See Also
Reference
RenderContent Class
Rhino.Render Namespace