RhinoCommon API
SubDEdgeList.FindOrAdd Method
 Gets the edge between two vertices, adding a smooth edge if there is not one yet.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDEdge FindOrAdd(
	SubDVertex v0,
	SubDVertex v1
)
Public Function FindOrAdd (
	v0 As SubDVertex,
	v1 As SubDVertex
) As SubDEdge
Parameters
v0
Type: Rhino.Geometry.SubDVertex
First vertex.
v1
Type: Rhino.Geometry.SubDVertex
Second vertex.
Return Value
Type: SubDEdge
The existing or newly added edge, or null on failure.
See Also
Reference
SubDEdgeList Class
Rhino.Geometry.Collections Namespace