RhinoCommon API
DisplayPipeline.DrawGradientHatch Method (Hatch, IEnumerable<ColorStop>, Point3d, Point3d, Boolean, Single, DisplayPen, Color)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientHatch(Rhino.Geometry.Hatch,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single,Rhino.Display.DisplayPen,System.Drawing.Color)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void DrawGradientHatch(
	Hatch hatch,
	IEnumerable<ColorStop> stops,
	Point3d point1,
	Point3d point2,
	bool linearGradient,
	float repeat,
	DisplayPen boundary,
	Color backgroundFillColor
)
Public Sub DrawGradientHatch (
	hatch As Hatch,
	stops As IEnumerable(Of ColorStop),
	point1 As Point3d,
	point2 As Point3d,
	linearGradient As Boolean,
	repeat As Single,
	boundary As DisplayPen,
	backgroundFillColor As Color
)
Parameters
hatch
Type: Rhino.Geometry.Hatch
[Missing <param name="hatch"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientHatch(Rhino.Geometry.Hatch,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single,Rhino.Display.DisplayPen,System.Drawing.Color)"]
stops
Type: System.Collections.Generic.IEnumerable<ColorStop>
[Missing <param name="stops"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientHatch(Rhino.Geometry.Hatch,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single,Rhino.Display.DisplayPen,System.Drawing.Color)"]
point1
Type: Rhino.Geometry.Point3d
[Missing <param name="point1"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientHatch(Rhino.Geometry.Hatch,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single,Rhino.Display.DisplayPen,System.Drawing.Color)"]
point2
Type: Rhino.Geometry.Point3d
[Missing <param name="point2"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientHatch(Rhino.Geometry.Hatch,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single,Rhino.Display.DisplayPen,System.Drawing.Color)"]
linearGradient
Type: System.Boolean
[Missing <param name="linearGradient"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientHatch(Rhino.Geometry.Hatch,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single,Rhino.Display.DisplayPen,System.Drawing.Color)"]
repeat
Type: System.Single
[Missing <param name="repeat"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientHatch(Rhino.Geometry.Hatch,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single,Rhino.Display.DisplayPen,System.Drawing.Color)"]
boundary
Type: Rhino.Display.DisplayPen
[Missing <param name="boundary"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientHatch(Rhino.Geometry.Hatch,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single,Rhino.Display.DisplayPen,System.Drawing.Color)"]
backgroundFillColor
Type: System.Drawing.Color
[Missing <param name="backgroundFillColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientHatch(Rhino.Geometry.Hatch,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single,Rhino.Display.DisplayPen,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
DrawGradientHatch Overload
Rhino.Display Namespace