RhinoCommon API
GetInteger Constructor
Initializes a new instance of the GetInteger class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GetInteger()
Public Sub New
See Also
Reference
GetInteger Class
Rhino.Input.Custom Namespace