RhinoCommon API
File3dmDimStyleTable.FindIndex Method
 Retrieves a DimensionStyle object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As DimensionStyle
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: DimensionStyle
A DimensionStyle object, or null if none was found.
See Also
Reference
File3dmDimStyleTable Class
Rhino.FileIO Namespace