RhinoCommon API
RhinoViewport.SetConstructionPlane Method (Plane)
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.SetConstructionPlane(Rhino.Geometry.Plane)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetConstructionPlane(
	Plane plane
)
Public Sub SetConstructionPlane (
	plane As Plane
)
Parameters
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Display.RhinoViewport.SetConstructionPlane(Rhino.Geometry.Plane)"]
See Also
Reference
RhinoViewport Class
SetConstructionPlane Overload
Rhino.Display Namespace