RhinoCommon API
AngularDimension.Create Method (DimensionStyle, Line, Point3d, Line, Point3d, Point3d, Boolean)
 The angle between the lines is dimensioned. If the lines intersect in a single point, that point is used as the center of the angular dimension arc.In this case, there are eight possible angles to dimension.The pointOnAngularDimensionArc and pointOnLine parameters are used to select the correct angle to dimension. If a pointOnLine parameter is not set, the corresponding line's midpoint is used. If the lines are colinear, the point on the line closest to pointOnAngularDimensionArc is the center of the angular dimension arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static AngularDimension Create(
	DimensionStyle dimStyle,
	Line line1,
	Point3d pointOnLine1,
	Line line2,
	Point3d pointOnLine2,
	Point3d pointOnAngularDimensionArc,
	bool bSetExtensionPoints
)
Public Shared Function Create (
	dimStyle As DimensionStyle,
	line1 As Line,
	pointOnLine1 As Point3d,
	line2 As Line,
	pointOnLine2 As Point3d,
	pointOnAngularDimensionArc As Point3d,
	bSetExtensionPoints As Boolean
) As AngularDimension
Parameters
dimStyle
Type: Rhino.DocObjects.DimensionStyle
Dimension style.
line1
Type: Rhino.Geometry.Line
The first line.
pointOnLine1
Type: Rhino.Geometry.Point3d
 If specified, indicates which semi-infinite portion of line1 to dimension. Otherwise the midpoint of line1 as a segment is used. When in doubt, use Point3d.Unset.
line2
Type: Rhino.Geometry.Line
The second line.
pointOnLine2
Type: Rhino.Geometry.Point3d
[Missing <param name="pointOnLine2"/> documentation for "M:Rhino.Geometry.AngularDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Line,Rhino.Geometry.Point3d,Rhino.Geometry.Line,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean)"]
pointOnAngularDimensionArc
Type: Rhino.Geometry.Point3d
 A point on the interior of the angular dimension arc.
bSetExtensionPoints
Type: System.Boolean
 If bSetExtensionPoints is true, and a pointOnLine parameter is valid, that point is used as the extension point. Otherwise the angular dimension arc endpoint is used.
Return Value
Type: AngularDimension
The angular dimension if successful, null otherwise.
See Also
Reference
AngularDimension Class
Create Overload
Rhino.Geometry Namespace