RhinoCommon API
Line.MaximumDistanceTo Method (Point3d)
 Finds the largest distance between this line as a finite segment and a test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double MaximumDistanceTo(
	Point3d testPoint
)
Public Function MaximumDistanceTo (
	testPoint As Point3d
) As Double
Parameters
testPoint
Type: Rhino.Geometry.Point3d
A point to test.
Return Value
Type: Double
The maximum distance.
See Also
Reference
Line Structure
MaximumDistanceTo Overload
Rhino.Geometry Namespace