RhinoCommon API
SnapShotsClient.PlugInId Method
 The plug-in id that registers this client.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract Guid PlugInId()
Public MustOverride Function PlugInId As Guid
Return Value
Type: Guid
The plug-in id that registers this client.
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace