RhinoCommon API
Layer.RemoveCustomSectionStyle Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.RemoveCustomSectionStyle"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void RemoveCustomSectionStyle()
Public Sub RemoveCustomSectionStyle
See Also
Reference
Layer Class
Rhino.DocObjects Namespace