RhinoCommon API
SectionStyle Constructor (SectionStyle)
Create a new SetionStyle that is a copy of another SectionStyle
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public SectionStyle(
	SectionStyle other
)
Public Sub New (
	other As SectionStyle
)
Parameters
other
Type: Rhino.DocObjects.SectionStyle
[Missing <param name="other"/> documentation for "M:Rhino.DocObjects.SectionStyle.#ctor(Rhino.DocObjects.SectionStyle)"]
See Also
Reference
SectionStyle Class
SectionStyle Overload
Rhino.DocObjects Namespace