RhinoCommon API
Worksession.GetModels Method
 The models in this worksession, including the active model.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionModel[] GetModels(
	bool checkForUpdates
)
Public Function GetModels (
	checkForUpdates As Boolean
) As WorksessionModel()
Parameters
checkForUpdates
Type: System.Boolean
 True to fill in UpdateAvailable for each model. This compares each referenced file's size and last modified time against the values stored when the file was attached, which opens and stats each file once - no file contents are read, so the cost does not grow with the size of the models, but it is still one round trip per model. Pass false to skip it, for example when reading this repeatedly or when the models live on a slow network share.
Return Value
Type: WorksessionModel[]
The models in the worksession, or an empty array if there are none.
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace