RhinoCommon API
ColorHSL.ToArgbColor Method
 Convert HSL color to an equivalent System.Drawing.Color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color ToArgbColor()
Public Function ToArgbColor As Color
Return Value
Type: Color
A .Net framework library color value.
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace