RhinoCommon API
RenderContent.ConvertUnits Method
 Modify your content so that it is converted from meters into the units of the unit system. No need to call the base class when you override this, and no need to recurse into children.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public virtual void ConvertUnits(
	LengthUnit from,
	LengthUnit to
)
Public Overridable Sub ConvertUnits (
	from As LengthUnit,
	to As LengthUnit
)
Parameters
from
Type: Rhino.LengthUnit
[Missing <param name="from"/> documentation for "M:Rhino.Render.RenderContent.ConvertUnits(Rhino.LengthUnit,Rhino.LengthUnit)"]
to
Type: Rhino.LengthUnit
[Missing <param name="to"/> documentation for "M:Rhino.Render.RenderContent.ConvertUnits(Rhino.LengthUnit,Rhino.LengthUnit)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace