RhinoCommon API
SurfaceDirectionIndicators Constructor (Surface)
 Construct for a surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SurfaceDirectionIndicators(
	Surface surface
)
Public Sub New (
	surface As Surface
)
Parameters
surface
Type: Rhino.Geometry.Surface
[Missing <param name="surface"/> documentation for "M:Rhino.Geometry.SurfaceDirectionIndicators.#ctor(Rhino.Geometry.Surface)"]
See Also
Reference
SurfaceDirectionIndicators Class
SurfaceDirectionIndicators Overload
Rhino.Geometry Namespace