RhinoCommon API
SimpleArraySubDPointer.Add Method
 Adds a subd to the list.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public void Add(
	SubD subd,
	bool asConst
)
Public Sub Add (
	subd As SubD,
	asConst As Boolean
)
Parameters
subd
Type: Rhino.Geometry.SubD
A subd to add.
asConst
Type: System.Boolean
Whether this subd should be treated as non-modifiable.
See Also
Reference
SimpleArraySubDPointer Class
Rhino.Runtime.InteropWrappers Namespace