RhinoCommon API
ObjectTable.DeleteGrips Method (IEnumerable<Guid>)
 Deletes one or more grip objects.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public int DeleteGrips(
	IEnumerable<Guid> gripIds
)
Public Function DeleteGrips (
	gripIds As IEnumerable(Of Guid)
) As Integer
Parameters
gripIds
Type: System.Collections.Generic.IEnumerable<Guid>
The ids of the grip objects to delete.
Return Value
Type: Int32
The number of successfully deleted grip objects.
See Also
Reference
ObjectTable Class
DeleteGrips Overload
Rhino.DocObjects.Tables Namespace