RhinoCommon API
RhinoObject.GetFillSurfaces Method (RhinoObject, IEnumerable<ClippingPlaneObject>)
 Return list of fill surfaces if any for object and clipping plane. Fills are trimmed by clipping planes that did not generate them.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public static Brep[] GetFillSurfaces(
	RhinoObject rhinoObject,
	IEnumerable<ClippingPlaneObject> clippingPlaneObjects
)
Public Shared Function GetFillSurfaces (
	rhinoObject As RhinoObject,
	clippingPlaneObjects As IEnumerable(Of ClippingPlaneObject)
) As Brep()
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
Object to clip
clippingPlaneObjects
Type: System.Collections.Generic.IEnumerable<ClippingPlaneObject>
Enumeration of clipping plane objects
Return Value
Type: Brep[]
Array of Brep containing fully trimmed fills if there were any generated.
See Also
Reference
RhinoObject Class
GetFillSurfaces Overload
Rhino.DocObjects Namespace