RhinoCommon API
ColorHSL.CreateFromHSV Method
 Constructs the nearest HSL equivalent of an HSV color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ColorHSL CreateFromHSV(
	ColorHSV hsv
)
Public Shared Function CreateFromHSV (
	hsv As ColorHSV
) As ColorHSL
Parameters
hsv
Type: Rhino.Display.ColorHSV
Target color in HSV space.
Return Value
Type: ColorHSL
The HSL equivalent of the HSV color.
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace