RhinoCommon API
LicenseData Constructor (String, String, String, LicenseBuildType, Int32, Nullable<DateTime>, Icon, Boolean, Boolean)
 Public constructor
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LicenseData(
	string productLicense,
	string serialNumber,
	string licenseTitle,
	LicenseBuildType buildType,
	int licenseCount,
	DateTime? expirationDate,
	Icon productIcon,
	bool requiresOnlineValidation,
	bool isUpgradeFromPreviousVersion
)
Public Sub New (
	productLicense As String,
	serialNumber As String,
	licenseTitle As String,
	buildType As LicenseBuildType,
	licenseCount As Integer,
	expirationDate As DateTime?,
	productIcon As Icon,
	requiresOnlineValidation As Boolean,
	isUpgradeFromPreviousVersion As Boolean
)
Parameters
productLicense
Type: System.String
License string to be saved by ZooClient
serialNumber
Type: System.String
Serial number to be displayed to end user
licenseTitle
Type: System.String
Title of license (Rhino 6.0 Evaluation)
buildType
Type: Rhino.PlugIns.LicenseBuildType
A LicenseBuildType value
licenseCount
Type: System.Int32
Number of licenses represented by this string. Allows the Zoo to hand out multiple license keys when greater than 1.
expirationDate
Type: System.Nullable<DateTime>
Date when license expires, null if license never expires.
productIcon
Type: System.Drawing.Icon
Icon to display in Rhino License Options user interface when showing this license
requiresOnlineValidation
Type: System.Boolean
True if online validation server should be called with this license key; false otherwise. If true, caller must pass implementation of VerifyOnlineValidationCodeDelegate to GetLicense/AskUserForLicense
isUpgradeFromPreviousVersion
Type: System.Boolean
True if this license key requires a previous version license; false otherwise. If true, caller must pass implementation of VerifyPreviousVersionLicenseDelegate to GetLicense/AskUserForLicense
See Also
Reference
LicenseData Class
LicenseData Overload
Rhino.PlugIns Namespace