RhinoCommon API
LengthValue.Create Method (String, StringParserSettings, Boolean)
 Create from string
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static LengthValue Create(
	string s,
	StringParserSettings ps,
	out bool parsedAll
)
Public Shared Function Create (
	s As String,
	ps As StringParserSettings,
	<OutAttribute> ByRef parsedAll As Boolean
) As LengthValue
Parameters
s
Type: System.String
string to parse
ps
Type: Rhino.Input.StringParserSettings
[Missing <param name="ps"/> documentation for "M:Rhino.LengthValue.Create(System.String,Rhino.Input.StringParserSettings,System.Boolean@)"]
parsedAll
Type: System.Boolean
true if the whole string was parsed
Return Value
Type: LengthValue
[Missing <returns> documentation for "M:Rhino.LengthValue.Create(System.String,Rhino.Input.StringParserSettings,System.Boolean@)"]
See Also
Reference
LengthValue Class
Create Overload
Rhino Namespace