RhinoCommon API
ObjRef.SubD Method
 Gets the SubD if the referenced geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubD SubD()
Public Function SubD As SubD
Return Value
Type: SubD
A SubD; or null if the referenced object is not a SubD, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace