RhinoCommon API
DisplayPipeline.GetOpenGLCameraToClip Method
 Get an array of 16 floats that represents the "camera" to "clip" coordinate transformation in OpenGL's right handed coordinate system
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public float[] GetOpenGLCameraToClip()
Public Function GetOpenGLCameraToClip As Single()
Return Value
Type: Single[]
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipeline.GetOpenGLCameraToClip"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace