RhinoCommon API
RhinoObject.GetRenderMaterial Method (Boolean)
 Gets the RenderMaterial that this object uses based on it's attributes and the document that the object is associated with. If there is no RenderMaterial associated with this object then null is returned. If null is returned you should call GetMaterial to get the material used to render this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public RenderMaterial GetRenderMaterial(
	bool frontMaterial
)
Public Function GetRenderMaterial (
	frontMaterial As Boolean
) As RenderMaterial
Parameters
frontMaterial
Type: System.Boolean
 If true, gets the material used to render the object's front side otherwise; gets the material used to render the back side of the object.
Return Value
Type: RenderMaterial
 If there is a RenderMaterial associated with this objects' associated Material then it is returned otherwise; null is returned.
See Also
Reference
RhinoObject Class
GetRenderMaterial Overload
Rhino.DocObjects Namespace