RhinoCommon API
AppearanceSettings.DefaultWidgetColor Method
 Get a default widget color for Rhino. The current widget color may be different than the default
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Color DefaultWidgetColor(
	WidgetColor whichColor
)
Public Shared Function DefaultWidgetColor (
	whichColor As WidgetColor
) As Color
Parameters
whichColor
Type: Rhino.ApplicationSettings.WidgetColor
The color to retrieve
Return Value
Type: Color
A .Net library color.
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace