RhinoCommon API
RhinoApp.GetPlugInObject Method (String)
 Gets the object that is returned by PlugIn.GetPlugInObject for a given plug-in. This function attempts to find and load a plug-in with a given name. When a plug-in is found, it's GetPlugInObject function is called and the result is returned here. Note the plug-in must have already been installed in Rhino or the plug-in manager will not know where to look for a plug-in with a matching name.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Object GetPlugInObject(
	string plugin
)
Public Shared Function GetPlugInObject (
	plugin As String
) As Object
Parameters
plugin
Type: System.String
Name of a plug-in.
Return Value
Type: Object
 Result of PlugIn.GetPlugInObject for a given plug-in on success.
See Also
Reference
RhinoApp Class
GetPlugInObject Overload
Rhino Namespace