RhinoCommon API
TextureGraphInfo.Dispose Method
Releases all resources used by the TextureGraphInfo
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
TextureGraphInfo Class
Rhino.Render Namespace