RhinoCommon API
Worksession.Open Method
 Opens a worksession (.rws) file.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static RhinoDoc Open(
	string path
)
Public Shared Function Open (
	path As String
) As RhinoDoc
Parameters
path
Type: System.String
The full path to the .rws file to open.
Return Value
Type: RhinoDoc
 The document the worksession was read into, or null on failure.
Remarks
 Opening a worksession is a document-level operation rather than a change to an existing worksession, which is why this is static. Always use the returned document: it may be the current document, reused, or a newly created one, depending on the platform and on whether the current document can be reused. On Windows, other than headless, the current document is closed and replaced.
 As with SetActiveModel(UInt32), do not call this from a script running in a document that this might close.
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace