RhinoCommon API
CollapsibleSectionViewModel.GetData Method
 Call for an interface to data
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Object GetData(
	Guid uuidDataType,
	bool bForWrite,
	bool bAutoChangeBracket = true
)
Public Function GetData (
	uuidDataType As Guid,
	bForWrite As Boolean,
	Optional bAutoChangeBracket As Boolean = true
) As Object
Parameters
uuidDataType
Type: System.Guid
[Missing <param name="uuidDataType"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionViewModel.GetData(System.Guid,System.Boolean,System.Boolean)"]
bForWrite
Type: System.Boolean
[Missing <param name="bForWrite"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionViewModel.GetData(System.Guid,System.Boolean,System.Boolean)"]
bAutoChangeBracket (Optional)
Type: System.Boolean
[Missing <param name="bAutoChangeBracket"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionViewModel.GetData(System.Guid,System.Boolean,System.Boolean)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.Controls.CollapsibleSectionViewModel.GetData(System.Guid,System.Boolean,System.Boolean)"]
Implements
IRdkViewModel.GetData(Guid, Boolean, Boolean)
See Also
Reference
CollapsibleSectionViewModel Class
Rhino.UI.Controls Namespace