RhinoCommon API
UserInterfaceGrid.GetComputedRowHeight Method
 Height of a row in logical pixels as of the most recent layout. This is 0 until the grid has been drawn once.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double GetComputedRowHeight(
	int row
)
Public Function GetComputedRowHeight (
	row As Integer
) As Double
Parameters
row
Type: System.Int32
[Missing <param name="row"/> documentation for "M:Rhino.UI.UserInterfaceGrid.GetComputedRowHeight(System.Int32)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.UI.UserInterfaceGrid.GetComputedRowHeight(System.Int32)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace