RhinoCommon API
File3dmStringTable.SetString Method (String, String, String)
 Adds or sets a document string in the 3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string SetString(
	string section,
	string entry,
	string value
)
Public Function SetString (
	section As String,
	entry As String,
	value As String
) As String
Parameters
section
Type: System.String
The section.
entry
Type: System.String
The entry name.
value
Type: System.String
The entry value.
Return Value
Type: String
 The previous value if successful.
See Also
Reference
File3dmStringTable Class
SetString Overload
Rhino.FileIO Namespace