RhinoCommon API
PointCloud.InsertNew Method
 Inserts a new PointCloudItem at a specific position of the point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PointCloudItem InsertNew(
	int index
)
Public Function InsertNew (
	index As Integer
) As PointCloudItem
Parameters
index
Type: System.Int32
Index of new item.
Return Value
Type: PointCloudItem
The newly inserted item.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace