RhinoCommon API
PersistentSettingsSavedEventArgs.CommandSettings Method
 The new command settings
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PersistentSettings CommandSettings(
	string englishCommandName
)
Public Function CommandSettings (
	englishCommandName As String
) As PersistentSettings
Parameters
englishCommandName
Type: System.String
 English command to find settings for
Return Value
Type: PersistentSettings
[Missing <returns> documentation for "M:Rhino.PersistentSettingsSavedEventArgs.CommandSettings(System.String)"]
See Also
Reference
PersistentSettingsSavedEventArgs Class
Rhino Namespace