RhinoCommon API
FileTypeList.AddFileType Method (String, String, String, Boolean)
[Missing <summary> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String,System.String,System.Boolean)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int AddFileType(
	string description,
	string extension1,
	string extension2,
	bool showOptionsButtonInFileDialog
)
Public Function AddFileType (
	description As String,
	extension1 As String,
	extension2 As String,
	showOptionsButtonInFileDialog As Boolean
) As Integer
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String,System.String,System.Boolean)"]
extension1
Type: System.String
[Missing <param name="extension1"/> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String,System.String,System.Boolean)"]
extension2
Type: System.String
[Missing <param name="extension2"/> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String,System.String,System.Boolean)"]
showOptionsButtonInFileDialog
Type: System.Boolean
[Missing <param name="showOptionsButtonInFileDialog"/> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String,System.String,System.Boolean)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String,System.String,System.Boolean)"]
See Also
Reference
FileTypeList Class
AddFileType Overload
Rhino.PlugIns Namespace