RhinoCommon API
BinaryArchiveWriter.WriteCompressedBuffer Method
 Writes a list, an array, or any enumerable of Byte to the archive as a compressed buffer.
The return will always be an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public void WriteCompressedBuffer(
	IEnumerable<byte> value
)
Public Sub WriteCompressedBuffer (
	value As IEnumerable(Of Byte)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<Byte>
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace