RhinoCommon API
Interpolator.InterpolateNearestNeighbour Method
 Sample the list of numbers with Nearest Neighbor interpolation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double InterpolateNearestNeighbour(
	double t
)
Public Function InterpolateNearestNeighbour (
	t As Double
) As Double
Parameters
t
Type: System.Double
Parameter to sample at. The integer portion of the parameter indicates the index of the left-hand value. If this Interpolator is cyclical, parameters will be wrapped.
Return Value
Type: Double
The sampled value at t.
See Also
Reference
Interpolator Class
Rhino.Geometry Namespace