RhinoCommon API
DimensionStyle.IsChildOf Method
 Tests if this DimensionStyle is a child of a specific DimensionStyle
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsChildOf(
	Guid parentId
)
Public Function IsChildOf (
	parentId As Guid
) As Boolean
Parameters
parentId
Type: System.Guid
[Missing <param name="parentId"/> documentation for "M:Rhino.DocObjects.DimensionStyle.IsChildOf(System.Guid)"]
Return Value
Type: Boolean
 True if this is a child of the DimensionStyle with Parent False otherwise.
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace