RhinoCommon API
FileCsvDocument.Set Method (Int32, Int32, Double)
 Sets the value of a specific cell to a double-precision number, formatted with the general ("G") format specifier and the invariant culture.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Set(
	int column,
	int row,
	double value
)
Public Sub Set (
	column As Integer,
	row As Integer,
	value As Double
)
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.Double
The value to store.
See Also
Reference
FileCsvDocument Class
Set Overload
Rhino.FileIO Namespace