RhinoCommon API
FieldDictionary.Add Method (String, Single)
 Add a new FloatField to the dictionary. This will be a data only field and not show up in the content browsers.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public FloatField Add(
	string key,
	float value
)
Public Function Add (
	key As String,
	value As Single
) As FloatField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: System.Single
Initial value for this field.
Return Value
Type: FloatField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Single)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace