RhinoCommon API
BrepFaceList.SplitFacesAtTangents Method (Boolean)
 Splits all of the faces of a Brep at tangent locations.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SplitFacesAtTangents(
	bool aggressiveMode
)
Public Function SplitFacesAtTangents (
	aggressiveMode As Boolean
) As Boolean
Parameters
aggressiveMode
Type: System.Boolean
 If aggressive mode is true, the face surfaces will be split at locations of curvature discontinuities with constant tangents. If aggressive mode is false, only split when the curvature change is from no curvature to some curvature or when the curvature vector directions are opposite.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
BrepFaceList Class
SplitFacesAtTangents Overload
Rhino.Geometry.Collections Namespace