RhinoCommon API
Transform.ToDoubleArray Method
 Return the matrix as a linear array of 16 double values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double[] ToDoubleArray(
	bool rowDominant
)
Public Function ToDoubleArray (
	rowDominant As Boolean
) As Double()
Parameters
rowDominant
Type: System.Boolean
 If true, returns { M00, M01, M02...}. If false, returns { M00, M10, M20...}.
Return Value
Type: Double[]
An array of 16 doubles.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace