RhinoCommon API
Extrusion.WallSurface Method
 Gets one of the longitudinal surfaces of the extrusion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Surface WallSurface(
	ComponentIndex ci
)
Public Function WallSurface (
	ci As ComponentIndex
) As Surface
Parameters
ci
Type: Rhino.Geometry.ComponentIndex
The index specifying which precise item to retrieve.
Return Value
Type: Surface
The surface.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace