RhinoCommon API
OptionString Constructor (String)
 Constructs the option object.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public OptionString(
	string initialString
)
Public Sub New (
	initialString As String
)
Parameters
initialString
Type: System.String
The initial value.
See Also
Reference
OptionString Class
OptionString Overload
Rhino.Input.Custom Namespace