RhinoCommon API
ObjectTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override IEnumerator<RhinoObject> GetEnumerator()
Public Overrides Function GetEnumerator As IEnumerator(Of RhinoObject)
Return Value
Type: IEnumerator<RhinoObject>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
IEnumerable<T>.GetEnumerator()
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace