RhinoCommon API
ObjectTable.FindClippingPlanesForViewport Method (RhinoViewport, Boolean)
 Finds all of the clipping plane objects that actively clip a viewport.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.35
Syntax
public ClippingPlaneObject[] FindClippingPlanesForViewport(
	RhinoViewport viewport,
	bool includeHidden
)
Public Function FindClippingPlanesForViewport (
	viewport As RhinoViewport,
	includeHidden As Boolean
) As ClippingPlaneObject()
Parameters
viewport
Type: Rhino.Display.RhinoViewport
The viewport in which clipping planes are searched.
includeHidden
Type: System.Boolean
 When true, clipping planes that are hidden, or that are on hidden layers, are included in the results. Such planes still clip geometry in the viewport, so pass true when you need the complete set of planes affecting what is displayed.
Return Value
Type: ClippingPlaneObject[]
An array of clipping plane objects. The array can be empty but not null.
See Also
Reference
ObjectTable Class
FindClippingPlanesForViewport Overload
Rhino.DocObjects.Tables Namespace