RhinoCommon API
MeshUnsafeLock.FaceNormalsArray Method
 Retrieves a pointer to the raw mesh face normals array, which uses vectors defined with single precision floating point numbers, or throws an exception if none is available.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.1
Syntax
public Vector3f* FaceNormalsArray(
	out int length
)
Visual Basic does not support APIs that consume or return unsafe types.
Parameters
length
Type: System.Int32
The length of the array. This value is returned by reference (out in C#).
Return Value
Type: Vector3f*
The beginning of the vertex array. Item 0 is the first vertex, and item length-1 is the last valid one.
Exceptions
Exception | Condition
InvalidOperationException | The mesh does not have face normals.
See Also
Reference
MeshUnsafeLock Class
Rhino.Geometry Namespace