RhinoCommon API
FieldDictionary.TryGetValue<T> Method (String, T)
 Parametrized version of TryGetValue.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public bool TryGetValue<T>(
	string key,
	out T value
)
Public Function TryGetValue(Of T) (
	key As String,
	<OutAttribute> ByRef value As T
) As Boolean
Parameters
key
Type: System.String
Name of field to find.
value
Type: T
out parameter to be set.
Type Parameters
T
Type of field to find.
Return Value
Type: Boolean
true if field was found. If false out parameter value will be set to default(T).
See Also
Reference
FieldDictionary Class
TryGetValue Overload
Rhino.Render.Fields Namespace