RhinoCommon API
FilePdf.Read Method
Read a PDF file into a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	FilePdfReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As FilePdfReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.FilePdfReadOptions
options used for importing the PDF file
Return Value
Type: Boolean
true on success
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace