RhinoCommon API
WorksessionFileModel.GetLayerOverrides Method
Gets copies of all of the layer overrides.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFileLayerOverride[] GetLayerOverrides()
Public Function GetLayerOverrides As WorksessionFileLayerOverride()
Return Value
Type: WorksessionFileLayerOverride[]
[Missing <returns> documentation for "M:Rhino.FileIO.WorksessionFileModel.GetLayerOverrides"]
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace