RhinoCommon API
LicenseData.IsValid Method
 Public validator.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsValid()
Public Function IsValid As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseData.IsValid"]
See Also
Reference
LicenseData Class
IsValid Overload
Rhino.PlugIns Namespace