RhinoCommon API
IZooClientUtilities.Echo Method
[Missing <summary> documentation for "M:Rhino.Runtime.IZooClientUtilities.Echo(System.Object,System.String)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
string Echo(
	Object verify,
	string message
)
Function Echo (
	verify As Object,
	message As String
) As String
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.Echo(System.Object,System.String)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.Echo(System.Object,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.Echo(System.Object,System.String)"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace