RhinoCommon API
PostEffectData.SetParameter Method
 Set an arbitrary parameter to the post effect by its name. If the parameter is not known to the post effect, the method will fail. Returns true if successful or false on failure.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SetParameter(
	string param_name,
	Object param_value
)
Public Function SetParameter (
	param_name As String,
	param_value As Object
) As Boolean
Parameters
param_name
Type: System.String
[Missing <param name="param_name"/> documentation for "M:Rhino.Render.PostEffects.PostEffectData.SetParameter(System.String,System.Object)"]
param_value
Type: System.Object
[Missing <param name="param_value"/> documentation for "M:Rhino.Render.PostEffects.PostEffectData.SetParameter(System.String,System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectData.SetParameter(System.String,System.Object)"]
See Also
Reference
PostEffectData Class
Rhino.Render.PostEffects Namespace