RhinoCommon API
Polyline.CreateInscribedPolygon Method
 Create a regular polygon inscribed in a circle. The vertices of the polygon will be on the circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public static Polyline CreateInscribedPolygon(
	Circle circle,
	int sideCount
)
Public Shared Function CreateInscribedPolygon (
	circle As Circle,
	sideCount As Integer
) As Polyline
Parameters
circle
Type: Rhino.Geometry.Circle
The circle.
sideCount
Type: System.Int32
The number of sides
Return Value
Type: Polyline
A closed polyline if successful, null otherwise.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace