RhinoCommon API
SubD.PackFaces Method
 Resets the SubD to the default face packing if adding creases or deleting faces breaks the quad grids. It does not change the topology or geometry of the SubD. SubD face packs always stop at creases.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.23
Syntax
public uint PackFaces()
Public Function PackFaces As UInteger
Return Value
Type: UInt32
The number of face packs.
See Also
Reference
SubD Class
Rhino.Geometry Namespace