RhinoCommon API
BrepVertexList.AddPointOnFace Method
Adds a new point on face to the brep
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public BrepVertex AddPointOnFace(
	BrepFace face,
	double s,
	double t
)
Public Function AddPointOnFace (
	face As BrepFace,
	s As Double,
	t As Double
) As BrepVertex
Parameters
face
Type: Rhino.Geometry.BrepFace
face that vertex lies on
s
Type: System.Double
surface parameters
t
Type: System.Double
surface parameters
Return Value
Type: BrepVertex
new vertex that represents the point on face
Remarks
 If a vertex is a point on a face, then brep.Edges[edge_index] will be an edge with no 3d curve. This edge will have a single trim with type BrepTrimType.CurveOnSurface. There will be a loop containing this single trim.
See Also
Reference
BrepVertexList Class
Rhino.Geometry.Collections Namespace