RhinoCommon API
ScaleValue.OneToOne Method
 Make a new ScaleValue set to OneToOne
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ScaleValue OneToOne()
Public Shared Function OneToOne As ScaleValue
Return Value
Type: ScaleValue
[Missing <returns> documentation for "M:Rhino.ScaleValue.OneToOne"]
See Also
Reference
ScaleValue Class
Rhino Namespace