RhinoCommon API
Panels.IsShowing Method
 Check to see if reason is equal to any of the hide events
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool IsShowing(
	ShowPanelReason reason
)
Public Shared Function IsShowing (
	reason As ShowPanelReason
) As Boolean
Parameters
reason
Type: Rhino.UI.ShowPanelReason
[Missing <param name="reason"/> documentation for "M:Rhino.UI.Panels.IsShowing(Rhino.UI.ShowPanelReason)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Panels.IsShowing(Rhino.UI.ShowPanelReason)"]
See Also
Reference
Panels Class
Rhino.UI Namespace