RhinoCommon API
WorldMapDayNight.SetDayNightDisplay Method
[Missing <summary> documentation for "M:Rhino.Render.UI.WorldMapDayNight.SetDayNightDisplay(System.Boolean)"]
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetDayNightDisplay(
	bool bOn
)
Public Sub SetDayNightDisplay (
	bOn As Boolean
)
Parameters
bOn
Type: System.Boolean
[Missing <param name="bOn"/> documentation for "M:Rhino.Render.UI.WorldMapDayNight.SetDayNightDisplay(System.Boolean)"]
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace