RhinoCommon API
ObjectTable.InvalidateBoundingBox Method
 Destroys the cached scene bounding box so that it will be regenerated again from scratch next time the view is regenerated
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public void InvalidateBoundingBox()
Public Sub InvalidateBoundingBox
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace