RhinoCommon API
LengthValue.Length Method (LengthUnit)
 Length value in a given unit system
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Length(
	LengthUnit units
)
Public Function Length (
	units As LengthUnit
) As Double
Parameters
units
Type: Rhino.LengthUnit
[Missing <param name="units"/> documentation for "M:Rhino.LengthValue.Length(Rhino.LengthUnit)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.LengthValue.Length(Rhino.LengthUnit)"]
See Also
Reference
LengthValue Class
Length Overload
Rhino Namespace