RhinoCommon API
ConvertibleExtensions.ToColor4f Method
[Missing <summary> documentation for "M:Rhino.Render.ConvertibleExtensions.ToColor4f(System.IConvertible)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Color4f ToColor4f(
	this IConvertible variant
)
<ExtensionAttribute>
Public Shared Function ToColor4f (
	variant As IConvertible
) As Color4f
Parameters
variant
Type: System.IConvertible
[Missing <param name="variant"/> documentation for "M:Rhino.Render.ConvertibleExtensions.ToColor4f(System.IConvertible)"]
Return Value
Type: Color4f
[Missing <returns> documentation for "M:Rhino.Render.ConvertibleExtensions.ToColor4f(System.IConvertible)"]
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type IConvertible. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ConvertibleExtensions Class
Rhino.Render Namespace