RhinoCommon API
RhinoObject.Description Method
 Get a brief description of a object, including it's attributes and geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Description(
	TextLog textLog
)
Public Sub Description (
	textLog As TextLog
)
Parameters
textLog
Type: Rhino.FileIO.TextLog
A text log for collecting the description.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace