RhinoCommon API
RhinoViewport.Dispose Method
Releases all resources used by the RhinoViewport
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RhinoViewport Class
Dispose Overload
Rhino.Display Namespace