RhinoCommon API
TwistSpaceMorph Constructor
 Constructs a twist space morph.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public TwistSpaceMorph()
Public Sub New
See Also
Reference
TwistSpaceMorph Class
Rhino.Geometry.Morphs Namespace