RhinoCommon API
StackedDialogPage.OnDefaults Method
Called when stacked dialog Defaults button is pressed (see ShowDefaultsButton).
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual void OnDefaults()
Public Overridable Sub OnDefaults
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace