RhinoCommon API
Dialogs.ShowListBox Method (String, String, IList, Object)
 Displays Rhino's list box.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Object ShowListBox(
	string title,
	string message,
	IList items,
	Object selectedItem
)
Public Shared Function ShowListBox (
	title As String,
	message As String,
	items As IList,
	selectedItem As Object
) As Object
Parameters
title
Type: System.String
The dialog title.
message
Type: System.String
The dialog message.
items
Type: System.Collections.IList
A list of items to show.
selectedItem
Type: System.Object
The item to preselect.
Return Value
Type: Object
The selected item if successful, null on cancel.
See Also
Reference
Dialogs Class
ShowListBox Overload
Rhino.UI Namespace