RhinoCommon API
ClassArrayString.Add Method
 Adds a string to the list.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Add(
	string s
)
Public Sub Add (
	s As String
)
Parameters
s
Type: System.String
A string to add.
See Also
Reference
ClassArrayString Class
Rhino.Runtime.InteropWrappers Namespace