RhinoCommon API
FileSvgReadOptions Constructor
Initializes a new instance of the FileSvgReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileSvgReadOptions()
Public Sub New
See Also
Reference
FileSvgReadOptions Class
Rhino.FileIO Namespace