RhinoCommon API
RenderContent.Replace Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.Replace(Rhino.Render.RenderContent)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.13
Syntax
public bool Replace(
	RenderContent newcontent
)
Public Function Replace (
	newcontent As RenderContent
) As Boolean
Parameters
newcontent
Type: Rhino.Render.RenderContent
[Missing <param name="newcontent"/> documentation for "M:Rhino.Render.RenderContent.Replace(Rhino.Render.RenderContent)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.Replace(Rhino.Render.RenderContent)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace