RhinoCommon API
StringWrapper Constructor
 Initializes a new empty unmanaged string (ON_wString*).
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public StringWrapper()
Public Sub New
See Also
Reference
StringWrapper Class
StringWrapper Overload
Rhino.Runtime.InteropWrappers Namespace