RhinoCommon API
RenderTexture.GetEnvironmentMappingProjection Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetEnvironmentMappingProjection(Rhino.Render.TextureEnvironmentMappingMode,Rhino.Geometry.Vector3d,System.Single@,System.Single@)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public static bool GetEnvironmentMappingProjection(
	TextureEnvironmentMappingMode mode,
	Vector3d reflectionVector,
	out float u,
	out float v
)
Public Shared Function GetEnvironmentMappingProjection (
	mode As TextureEnvironmentMappingMode,
	reflectionVector As Vector3d,
	<OutAttribute> ByRef u As Single,
	<OutAttribute> ByRef v As Single
) As Boolean
Parameters
mode
Type: Rhino.Render.TextureEnvironmentMappingMode
[Missing <param name="mode"/> documentation for "M:Rhino.Render.RenderTexture.GetEnvironmentMappingProjection(Rhino.Render.TextureEnvironmentMappingMode,Rhino.Geometry.Vector3d,System.Single@,System.Single@)"]
reflectionVector
Type: Rhino.Geometry.Vector3d
[Missing <param name="reflectionVector"/> documentation for "M:Rhino.Render.RenderTexture.GetEnvironmentMappingProjection(Rhino.Render.TextureEnvironmentMappingMode,Rhino.Geometry.Vector3d,System.Single@,System.Single@)"]
u
Type: System.Single
[Missing <param name="u"/> documentation for "M:Rhino.Render.RenderTexture.GetEnvironmentMappingProjection(Rhino.Render.TextureEnvironmentMappingMode,Rhino.Geometry.Vector3d,System.Single@,System.Single@)"]
v
Type: System.Single
[Missing <param name="v"/> documentation for "M:Rhino.Render.RenderTexture.GetEnvironmentMappingProjection(Rhino.Render.TextureEnvironmentMappingMode,Rhino.Geometry.Vector3d,System.Single@,System.Single@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetEnvironmentMappingProjection(Rhino.Render.TextureEnvironmentMappingMode,Rhino.Geometry.Vector3d,System.Single@,System.Single@)"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace