RhinoCommon API
ChangeQueue.ApplySkylightChanges Method
 Override this when you want to handle skylight changes
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplySkylightChanges(
	Skylight skylight
)
Protected Overridable Sub ApplySkylightChanges (
	skylight As Skylight
)
Parameters
skylight
Type: Rhino.Render.ChangeQueue.Skylight
[Missing <param name="skylight"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplySkylightChanges(Rhino.Render.ChangeQueue.Skylight)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace