RhinoCommon API
AsyncRenderContext.StartRenderThread Method
 Start a new render thread with given function.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool StartRenderThread(
	ThreadStart threadStart,
	string threadName
)
Public Function StartRenderThread (
	threadStart As ThreadStart,
	threadName As String
) As Boolean
Parameters
threadStart
Type: System.Threading.ThreadStart
Function to start in render thread
threadName
Type: System.String
Name for the thread
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.AsyncRenderContext.StartRenderThread(System.Threading.ThreadStart,System.String)"]
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace