RhinoCommon API
FilePdfReadOptions Constructor
Initializes a new instance of the FilePdfReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FilePdfReadOptions()
Public Sub New
See Also
Reference
FilePdfReadOptions Class
Rhino.FileIO Namespace