RhinoCommon API
GetCircle.Get Method
 Perform the 'get' operation.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Result Get(
	out Circle circle
)
Public Function Get (
	<OutAttribute> ByRef circle As Circle
) As Result
Parameters
circle
Type: Rhino.Geometry.Circle
[Missing <param name="circle"/> documentation for "M:Rhino.Input.Custom.GetCircle.Get(Rhino.Geometry.Circle@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetCircle.Get(Rhino.Geometry.Circle@)"]
See Also
Reference
GetCircle Class
Rhino.Input.Custom Namespace