RhinoCommon API
GeometryBase.Scale Method
 Scales the object by the specified factor. The scale is centered at the origin.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Scale(
	double scaleFactor
)
Public Function Scale (
	scaleFactor As Double
) As Boolean
Parameters
scaleFactor
Type: System.Double
The uniform scaling factor.
Return Value
Type: Boolean
true if geometry successfully scaled.
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace