RhinoCommon API
RenderSettings.SetRenderEnvironment Method
 Set the render environment for a particular usage. Passing null for usage Skylighting or Reflection will turn the override for that usage off.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetRenderEnvironment(
	RenderSettings.EnvironmentUsage usage,
	RenderEnvironment env
)
Public Sub SetRenderEnvironment (
	usage As RenderSettings.EnvironmentUsage,
	env As RenderEnvironment
)
Parameters
usage
Type: Rhino.Render.RenderSettings.EnvironmentUsage
[Missing <param name="usage"/> documentation for "M:Rhino.Render.RenderSettings.SetRenderEnvironment(Rhino.Render.RenderSettings.EnvironmentUsage,Rhino.Render.RenderEnvironment)"]
env
Type: Rhino.Render.RenderEnvironment
[Missing <param name="env"/> documentation for "M:Rhino.Render.RenderSettings.SetRenderEnvironment(Rhino.Render.RenderSettings.EnvironmentUsage,Rhino.Render.RenderEnvironment)"]
See Also
Reference
RenderSettings Class
Rhino.Render Namespace