RhinoCommon API
RenderPrimitiveList.ToMaterialArray Method
 Call this method to see if there are any RenderMaterials associated with the meshes. Each primitive can optionally have a RenderMaterial associated with it, if the RenderMaterial is null then check for a RhinoObject.RenderMaterial.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public RenderMaterial[] ToMaterialArray()
Public Function ToMaterialArray As RenderMaterial()
Return Value
Type: RenderMaterial[]
 Return an array that of the same size as the ToMeshArray() containing the RenderMaterial associated with the mesh, may contain null entries if there is no RenderMaterial associated with the custom mesh.
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace