RhinoCommon API
Intersection.MeshMeshTwoSets Method
 Intersects two sets of meshes with each other. Overlaps and perforations are provided in the output list.
Only events between a mesh of the first set and a mesh of the second set are computed. Intersections among meshes of the same set, and self-intersections within a single mesh, are ignored.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool MeshMeshTwoSets(
	IEnumerable<Mesh> setA,
	IEnumerable<Mesh> setB,
	double tolerance,
	out Polyline[] intersections,
	bool overlapsPolylines,
	out Polyline[] overlapsPolylinesResult,
	bool overlapsMesh,
	out Mesh overlapsMeshResult,
	TextLog textLog,
	CancellationToken cancel,
	IProgress<double> progress
)
Public Shared Function MeshMeshTwoSets (
	setA As IEnumerable(Of Mesh),
	setB As IEnumerable(Of Mesh),
	tolerance As Double,
	<OutAttribute> ByRef intersections As Polyline(),
	overlapsPolylines As Boolean,
	<OutAttribute> ByRef overlapsPolylinesResult As Polyline(),
	overlapsMesh As Boolean,
	<OutAttribute> ByRef overlapsMeshResult As Mesh,
	textLog As TextLog,
	cancel As CancellationToken,
	progress As IProgress(Of Double)
) As Boolean
Parameters
setA
Type: System.Collections.Generic.IEnumerable<Mesh>
The first mesh input list. This cannot be null. Null entries are tolerated.
setB
Type: System.Collections.Generic.IEnumerable<Mesh>
The second mesh input list. This cannot be null. Null entries are tolerated.
tolerance
Type: System.Double
A tolerance value. If negative, the positive value will be used. WARNING! Good tolerance values are in the magnitude of 10^-7, or RhinoMath.SqrtEpsilon*10.
intersections
Type: Rhino.Geometry.Polyline[]
Returns the intersections.
overlapsPolylines
Type: System.Boolean
If true, overlaps are computed and returned.
overlapsPolylinesResult
Type: Rhino.Geometry.Polyline[]
If requested, overlaps are returned here.
overlapsMesh
Type: System.Boolean
If true, an overlaps mesh is computed and returned.
overlapsMeshResult
Type: Rhino.Geometry.Mesh
If requested, overlaps are returned here.
textLog
Type: Rhino.FileIO.TextLog
A text log, or null.
cancel
Type: System.Threading.CancellationToken
A cancellation token to stop the computation at a given point.
progress
Type: System.IProgress<Double>
A progress reporter to inform the user about progress, or null. The reported value is indicative.
Return Value
Type: Boolean
True, if the operation succeeded, otherwise false.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace