RhinoCommon API
RenderContent.SetIsRenderHashRecursive Method
 By default, RenderHash recurses into children when computing the render hash. However, some applications may require children to be excluded from the render hash calculation. Call this method to enable or disable recursing into children. see RenderHash
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SetIsRenderHashRecursive(
	bool recursive
)
Public Sub SetIsRenderHashRecursive (
	recursive As Boolean
)
Parameters
recursive
Type: System.Boolean
See Also
Reference
RenderContent Class
Rhino.Render Namespace