RhinoCommon API
NamedViewTable.RestoreAnimatedConstantSpeed Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimatedConstantSpeed(System.Int32,Rhino.Display.RhinoViewport,System.Double,System.Int32)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool RestoreAnimatedConstantSpeed(
	int index,
	RhinoViewport viewport,
	double units_per_frame,
	int ms_delay
)
Public Function RestoreAnimatedConstantSpeed (
	index As Integer,
	viewport As RhinoViewport,
	units_per_frame As Double,
	ms_delay As Integer
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimatedConstantSpeed(System.Int32,Rhino.Display.RhinoViewport,System.Double,System.Int32)"]
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimatedConstantSpeed(System.Int32,Rhino.Display.RhinoViewport,System.Double,System.Int32)"]
units_per_frame
Type: System.Double
[Missing <param name="units_per_frame"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimatedConstantSpeed(System.Int32,Rhino.Display.RhinoViewport,System.Double,System.Int32)"]
ms_delay
Type: System.Int32
[Missing <param name="ms_delay"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimatedConstantSpeed(System.Int32,Rhino.Display.RhinoViewport,System.Double,System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimatedConstantSpeed(System.Int32,Rhino.Display.RhinoViewport,System.Double,System.Int32)"]
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace