RhinoCommon API
Interval.Swap Method
 Exchanges T0 and T1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Swap()
Public Sub Swap
See Also
Reference
Interval Structure
Rhino.Geometry Namespace