RhinoCommon API
NodeInCodeTable Constructor
 Instantiates the table. Users of RhinoCommon do not typically need to call this constructor.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public NodeInCodeTable(
	IEnumerable<ComponentFunctionInfo> items = null
)
Public Sub New (
	Optional items As IEnumerable(Of ComponentFunctionInfo) = Nothing
)
Parameters
items (Optional)
Type: System.Collections.Generic.IEnumerable<ComponentFunctionInfo>
Items.
See Also
Reference
NodeInCodeTable Class
Rhino.NodeInCode Namespace