RhinoCommon API
SimpleArrayFloat.Array Method
 Return the raw data.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public IntPtr Array()
Public Function Array As IntPtr
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayFloat.Array"]
See Also
Reference
SimpleArrayFloat Class
Rhino.Runtime.InteropWrappers Namespace