RhinoCommon API
ExtensionMethods.ToEnvironmentMappingMode Method
[Missing <summary> documentation for "M:Rhino.Render.ExtensionMethods.ToEnvironmentMappingMode(Rhino.Render.SimulatedTexture.EnvironmentMappingModes)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public static TextureEnvironmentMappingMode ToEnvironmentMappingMode(
	this SimulatedTexture.EnvironmentMappingModes e
)
<ExtensionAttribute>
Public Shared Function ToEnvironmentMappingMode (
	e As SimulatedTexture.EnvironmentMappingModes
) As TextureEnvironmentMappingMode
Parameters
e
Type: Rhino.Render.SimulatedTexture.EnvironmentMappingModes
[Missing <param name="e"/> documentation for "M:Rhino.Render.ExtensionMethods.ToEnvironmentMappingMode(Rhino.Render.SimulatedTexture.EnvironmentMappingModes)"]
Return Value
Type: TextureEnvironmentMappingMode
[Missing <returns> documentation for "M:Rhino.Render.ExtensionMethods.ToEnvironmentMappingMode(Rhino.Render.SimulatedTexture.EnvironmentMappingModes)"]
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type SimulatedTexture.EnvironmentMappingModes. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ExtensionMethods Class
Rhino.Render Namespace