RhinoCommon API
RhinoMath.EvaluateSectionalCurvature Method
 Expert tool to evaluate sectional curvature from surface derivatives and section plane normal.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.16
Syntax
public static bool EvaluateSectionalCurvature(
	Vector3d ds,
	Vector3d dt,
	Vector3d dss,
	Vector3d dst,
	Vector3d dtt,
	Vector3d planeNormal,
	out Vector3d k
)
Public Shared Function EvaluateSectionalCurvature (
	ds As Vector3d,
	dt As Vector3d,
	dss As Vector3d,
	dst As Vector3d,
	dtt As Vector3d,
	planeNormal As Vector3d,
	<OutAttribute> ByRef k As Vector3d
) As Boolean
Parameters
ds
Type: Rhino.Geometry.Vector3d
First partial derivative.
dt
Type: Rhino.Geometry.Vector3d
First partial derivative.
dss
Type: Rhino.Geometry.Vector3d
Second partial derivative.
dst
Type: Rhino.Geometry.Vector3d
Second partial derivative.
dtt
Type: Rhino.Geometry.Vector3d
Second partial derivative.
planeNormal
Type: Rhino.Geometry.Vector3d
Unit normal to section plane.
k
Type: Rhino.Geometry.Vector3d
 Sectional curvature. Curvature of the intersection curve of the surface and plane through the surface point where the partial derivatives were evaluated.
Return Value
Type: Boolean
 True if successful. False if first partials are not linearly independent, in which case the k is set to zero.
See Also
Reference
RhinoMath Class
Rhino Namespace