RhinoCommon API
LayerTable.FindIndex Method
 Retrieves a Layer object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Layer FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As Layer
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: Layer
A Layer object, or null if none was found.
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace