RhinoCommon API
FieldDictionary.GetField Method
 Call this method to get the field with the specified name.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public Field GetField(
	string fieldName
)
Public Function GetField (
	fieldName As String
) As Field
Parameters
fieldName
Type: System.String
Field name to search for.
Return Value
Type: Field
 If the field exists in the Fields dictionary then the field is returned otherwise; null is returned.
See Also
Reference
FieldDictionary Class
Rhino.Render.Fields Namespace