RhinoCommon API
PhysicallyBasedMaterial.GetTextures Method
 Get array of textures that this material uses
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Texture[] GetTextures()
Public Function GetTextures As Texture()
Return Value
Type: Texture[]
[Missing <returns> documentation for "M:Rhino.DocObjects.PhysicallyBasedMaterial.GetTextures"]
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace