RhinoCommon API
Polyline.CreateStarPolygon Method
 Create a regular star polygon. The star begins at circle.PointAt(0) and the vertices alternate between being on circle and begin on a concentric circle of other_radius.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public static Polyline CreateStarPolygon(
	Circle circle,
	double radius,
	int cornerCount
)
Public Shared Function CreateStarPolygon (
	circle As Circle,
	radius As Double,
	cornerCount As Integer
) As Polyline
Parameters
circle
Type: Rhino.Geometry.Circle
The circle.
radius
Type: System.Double
The radius of other circle.
cornerCount
Type: System.Int32
The number of corners on the circle. There will be 2*cornerCount sides and 2*cornerCount vertices.
Return Value
Type: Polyline
A closed polyline if successful, null otherwise.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace