RhinoCommon API
Cone Constructor
 Initializes a new cone with a specified base plane, height and radius.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Cone(
	Plane plane,
	double height,
	double radius
)
Public Sub New (
	plane As Plane,
	height As Double,
	radius As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
Base plane of cone. The apex of the cone is at the plane's origin.
height
Type: System.Double
Height of cone.
radius
Type: System.Double
Radius of cone.
See Also
Reference
Cone Structure
Rhino.Geometry Namespace