RhinoCommon API
RdkModalEditContentBucket Constructor
Initializes a new instance of the RdkModalEditContentBucket class
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public RdkModalEditContentBucket(
	IntPtr pRdkModalEditContentBucket
)
Public Sub New (
	pRdkModalEditContentBucket As IntPtr
)
Parameters
pRdkModalEditContentBucket
Type: System.IntPtr
[Missing <param name="pRdkModalEditContentBucket"/> documentation for "M:Rhino.Render.DataSources.RdkModalEditContentBucket.#ctor(System.IntPtr)"]
See Also
Reference
RdkModalEditContentBucket Class
Rhino.Render.DataSources Namespace