RhinoCommon API
FileDgnReadOptions Constructor
Initializes a new instance of the FileDgnReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileDgnReadOptions()
Public Sub New
See Also
Reference
FileDgnReadOptions Class
Rhino.FileIO Namespace