RhinoCommon API
Triangle3d.PointAtBarycentricCoords Method
 Gets a point within this triangle using barycentric coordinates.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Point3d PointAtBarycentricCoords(
	Point2d coords
)
Public Function PointAtBarycentricCoords (
	coords As Point2d
) As Point3d
Parameters
coords
Type: Rhino.Geometry.Point2d
Barycentric mass for vertex B and C. A is valued as (1 - B - C).
Return Value
Type: Point3d
Point at barycentric mass.
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace