RhinoCommon API
Box.MakeValid Method
Note: This API is now obsolete.
 DO NOT USE THIS FUNCTION If some of the box's values (Plane origin or axis, intervals bounds) are unset, do nothing. Else, make the Box valid by reversing the non-increasing intervals of this box. This is almost never what you want because it only makes Empty boxes not empty and with non-zero length.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("This method is misguided and only turns empty boxes (which are invalid by design) into valid non-empty boxes. If you expect your code to create boxes with incorrectly non-increasing intervals that need to be reversed, use m_dx.MakeIncreasing(), etc. instead.")]
public bool MakeValid()
<ObsoleteAttribute("This method is misguided and only turns empty boxes (which are invalid by design) into valid non-empty boxes. If you expect your code to create boxes with incorrectly non-increasing intervals that need to be reversed, use m_dx.MakeIncreasing(), etc. instead.")>
Public Function MakeValid As Boolean
Return Value
Type: Boolean
true if the box was made valid, or if it was valid to begin with. false if the box remains unchanged.
See Also
Reference
Box Structure
Rhino.Geometry Namespace