RhinoCommon API
PlugIn.ObjectPropertiesPages Method (ObjectPropertiesPageCollection)
 Override this function is you want to extend the object properties dialog. This method will be called each time a new document is created for each instance of a object properties panel. On Windows there will be a single panel per document but on Mac there may be many properties panel per document.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ObjectPropertiesPages(
	ObjectPropertiesPageCollection collection
)
Protected Overridable Sub ObjectPropertiesPages (
	collection As ObjectPropertiesPageCollection
)
Parameters
collection
Type: Rhino.UI.ObjectPropertiesPageCollection
 Add custom pages by calling collection.Add
See Also
Reference
PlugIn Class
ObjectPropertiesPages Overload
Rhino.PlugIns Namespace