RhinoCommon API
LicenseUtils.IsCheckOutEnabled Method
 Returns whether or not license checkout is enabled.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool IsCheckOutEnabled()
Public Shared Function IsCheckOutEnabled As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.IsCheckOutEnabled"]
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace