RhinoCommon API
Silhouette.ComputeDraftCurve Method (GeometryBase, Double, Vector3d, Double, Double, CancellationToken)
 Computes draft curve silhouettes of a shape.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Silhouette[] ComputeDraftCurve(
	GeometryBase geometry,
	double draftAngle,
	Vector3d pullDirection,
	double tolerance,
	double angleToleranceRadians,
	CancellationToken cancelToken
)
Public Shared Function ComputeDraftCurve (
	geometry As GeometryBase,
	draftAngle As Double,
	pullDirection As Vector3d,
	tolerance As Double,
	angleToleranceRadians As Double,
	cancelToken As CancellationToken
) As Silhouette()
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
Geometry whose silhouettes need to be computed. Can be Brep, BrepFace, Mesh, or Extrusion.
draftAngle
Type: System.Double
The draft angle in radians. Draft angle can be a positive or negative value.
pullDirection
Type: Rhino.Geometry.Vector3d
3d direction for the mold to be pulled in, directed away from the object.
tolerance
Type: System.Double
 Tolerance to use for determining projecting relationships. Surfaces and curves that are closer than tolerance, may be treated as projecting. When in doubt use RhinoDoc.ModelAbsoluteTolerance.
angleToleranceRadians
Type: System.Double
 Angular tolerance to use for determining projecting relationships. A surface normal N that satisfies N o cameraDirection < Sin(angleToleranceRadians) may be considered projecting. When in doubt use RhinoDoc.ModelAngleToleranceRadians.
cancelToken
Type: System.Threading.CancellationToken
Computation cancellation token.
Return Value
Type: Silhouette[]
Array of silhouette curves.
See Also
Reference
Silhouette Class
ComputeDraftCurve Overload
Rhino.Geometry Namespace