RhinoCommon API
ICollapsibleSectionHolder2.EnableHeaderButton Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder2.EnableHeaderButton(Rhino.UI.Controls.ICollapsibleSection,System.Int32,System.Boolean)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
bool EnableHeaderButton(
	ICollapsibleSection s,
	int index,
	bool bEnable
)
Function EnableHeaderButton (
	s As ICollapsibleSection,
	index As Integer,
	bEnable As Boolean
) As Boolean
Parameters
s
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="s"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder2.EnableHeaderButton(Rhino.UI.Controls.ICollapsibleSection,System.Int32,System.Boolean)"]
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder2.EnableHeaderButton(Rhino.UI.Controls.ICollapsibleSection,System.Int32,System.Boolean)"]
bEnable
Type: System.Boolean
[Missing <param name="bEnable"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder2.EnableHeaderButton(Rhino.UI.Controls.ICollapsibleSection,System.Int32,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder2.EnableHeaderButton(Rhino.UI.Controls.ICollapsibleSection,System.Int32,System.Boolean)"]
See Also
Reference
ICollapsibleSectionHolder2 Interface
Rhino.UI.Controls Namespace