RhinoCommon API
Field.ValueAsInt Method
 Return field value as integer.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected int ValueAsInt()
Protected Function ValueAsInt As Integer
Return Value
Type: Int32
Return the field value as an integer.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace