RhinoCommon API
RhinoObject.TryGetRenderPrimitiveBoundingBox Method (ViewportInfo, DisplayPipelineAttributes, BoundingBox)
Note: This API is now obsolete.
 Get the bounding box for the custom render meshes associated with this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use CustomRenderMeshesBoundingBox instead")]
public bool TryGetRenderPrimitiveBoundingBox(
	ViewportInfo viewport,
	DisplayPipelineAttributes attrs,
	out BoundingBox boundingBox
)
<ObsoleteAttribute("Use CustomRenderMeshesBoundingBox instead")>
Public Function TryGetRenderPrimitiveBoundingBox (
	viewport As ViewportInfo,
	attrs As DisplayPipelineAttributes,
	<OutAttribute> ByRef boundingBox As BoundingBox
) As Boolean
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
attrs
Type: Rhino.Display.DisplayPipelineAttributes
 Attributes for the view mode you are supplying meshes for. Will be null if this is a modal rendering.
boundingBox
Type: Rhino.Geometry.BoundingBox
 This will be set to BoundingBox.Unset on failure otherwise it will be the bounding box for the custom render meshes associated with this object.
Return Value
Type: Boolean
 Returns true if the bounding box was successfully calculated otherwise returns false on error.
See Also
Reference
RhinoObject Class
TryGetRenderPrimitiveBoundingBox Overload
Rhino.DocObjects Namespace