RhinoCommon API
RealtimeDisplayMode.RemoveRealtimeViewport Method
 Remove RealtimeDisplayMode instance from internal dictionary.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void RemoveRealtimeViewport(
	IntPtr realtimeViewport
)
Public Shared Sub RemoveRealtimeViewport (
	realtimeViewport As IntPtr
)
Parameters
realtimeViewport
Type: System.IntPtr
IntPtr to the RealtimeDisplayMode instance to remove.
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace