RhinoCommon API
ChooseOneObjectSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static ChooseOneObjectSettingsState GetDefaultState()
Public Shared Function GetDefaultState As ChooseOneObjectSettingsState
Return Value
Type: ChooseOneObjectSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.ChooseOneObjectSettings.GetDefaultState"]
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace