RhinoCommon API
EmapAnalysisSettings.GetFileNames Method
 Get available list of emap filenames
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static string[] GetFileNames()
Public Shared Function GetFileNames As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.EmapAnalysisSettings.GetFileNames"]
See Also
Reference
EmapAnalysisSettings Class
Rhino.ApplicationSettings Namespace