RhinoCommon API
HostUtils.GetRhinoDotNetAssembly Method
 Only works on Windows. Returns null on Mac.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Assembly GetRhinoDotNetAssembly()
Public Shared Function GetRhinoDotNetAssembly As Assembly
Return Value
Type: Assembly
An assembly.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace