RhinoCommon API
NurbsSurface.MatchToCurve Method
 Constructs a NURBS surface with start and end edge isocurve matching the start and end of targetCurve, and Greville points on targetCurve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public NurbsSurface MatchToCurve(
	IsoStatus side,
	Curve targetCurve,
	double maxEndDistance,
	double maxInteriorDistance,
	double matchTolerance,
	int maxLevel
)
Public Function MatchToCurve (
	side As IsoStatus,
	targetCurve As Curve,
	maxEndDistance As Double,
	maxInteriorDistance As Double,
	matchTolerance As Double,
	maxLevel As Integer
) As NurbsSurface
Parameters
side
Type: Rhino.Geometry.IsoStatus
The isoparamentric curve direction.
targetCurve
Type: Rhino.Geometry.Curve
The target curve.
maxEndDistance
Type: System.Double
 If maxEndDistance dist > 0, the edge isocurve must be within maxEndDistance of targetCurve start. If maxEndDistance dist > 0, the edge isocurve must be within maxEndDistance of targetCurve end.
maxInteriorDistance
Type: System.Double
 If maxInteriorDistance > 0, all interior Greville points of the edge isocurve must be within maxInteriorDistance of targetCurve.
matchTolerance
Type: System.Double
The matching tolerance.
maxLevel
Type: System.Int32
 If maxLevel > 0, the result will be refined up to that many times, attempting to get the result within matchTolerance. If matchTolerance <= 0, no refinement will be done. In any case, the parameters closest points on targetCurve of the Greville points of the edge isocurve must be monotonic increasing.
Return Value
Type: NurbsSurface
Surface on success, null on failure.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace