RhinoCommon API
RhinoObject.SetRenderMeshParameters Method
 Sets the per-object meshing parameters for this object. When set, this object will use these meshing parameters when generating a render mesh, instead of those provided by the document.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool SetRenderMeshParameters(
	MeshingParameters mp
)
Public Function SetRenderMeshParameters (
	mp As MeshingParameters
) As Boolean
Parameters
mp
Type: Rhino.Geometry.MeshingParameters
 The per-object meshing parameters. Note: if null, then the per-object meshing parameters will be removed, and this object will revert to using the meshing parameters provided by the document.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace