RhinoCommon API
SubDEdgeChain.Begin Method
 Clears the chain and restarts it from a single edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public uint Begin(
	SubDEdge startEdge
)
Public Function Begin (
	startEdge As SubDEdge
) As UInteger
Parameters
startEdge
Type: Rhino.Geometry.SubDEdge
The edge to start from.
Return Value
Type: UInt32
The number of edges in the chain, so 1 on success and 0 on failure.
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace