RhinoCommon API
HiddenLineDrawing.BoundingBox Method
 Get tight bounding box of the hidden line drawing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public BoundingBox BoundingBox(
	bool includeHidden
)
Public Function BoundingBox (
	includeHidden As Boolean
) As BoundingBox
Parameters
includeHidden
Type: System.Boolean
Include hidden objects.
Return Value
Type: BoundingBox
The tight bounding box.
See Also
Reference
HiddenLineDrawing Class
Rhino.Geometry Namespace