RhinoCommon API
PersistentSettings.TryGetColor Method (String, Color, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetColor(System.String,System.Drawing.Color@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetColor(
	string key,
	out Color value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetColor (
	key As String,
	<OutAttribute> ByRef value As Color,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetColor(System.String,System.Drawing.Color@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: System.Drawing.Color
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetColor(System.String,System.Drawing.Color@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetColor(System.String,System.Drawing.Color@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetColor(System.String,System.Drawing.Color@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetColor Overload
Rhino Namespace