RhinoCommon API
PolylineCurve.CreateConvexHull2d Method
 Attempts to create a closed PolylineCurve that is the anti-clockwise planar convex hull of the input points. In addition, the indices of the extremal points among the input points are returned in correct order. Possible duplicates among the input points are taken care of. The input pointsThe indices into the input points such that points[hullIndices[i]] = result[i]. Since the result is a closed polyline if successful, the start/end index is repeated at the beginning and end of the hullIndices.
Return Value
Type: PolylineCurve
 The closed PolylineCurve encompassing the input points, or null if the input points were either too few, or were found to be collinear.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public static PolylineCurve CreateConvexHull2d(
	Point2d[] points,
	out int[] hullIndices
)
Public Shared Function CreateConvexHull2d (
	points As Point2d(),
	<OutAttribute> ByRef hullIndices As Integer()
) As PolylineCurve
Parameters
points
Type: Rhino.Geometry.Point2d[]
[Missing <param name="points"/> documentation for "M:Rhino.Geometry.PolylineCurve.CreateConvexHull2d(Rhino.Geometry.Point2d[],System.Int32[]@)"]
hullIndices
Type: System.Int32[]
[Missing <param name="hullIndices"/> documentation for "M:Rhino.Geometry.PolylineCurve.CreateConvexHull2d(Rhino.Geometry.Point2d[],System.Int32[]@)"]
Return Value
Type: PolylineCurve
[Missing <returns> documentation for "M:Rhino.Geometry.PolylineCurve.CreateConvexHull2d(Rhino.Geometry.Point2d[],System.Int32[]@)"]
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace