RhinoCommon API
Squisher.GetLengthConstrained2dLines Method
 Gets lines at the position of the mesh edges and diagonals that were constrained during the squish, in the 2d mesh. The line at any index here corresponds to the same line in GetLengthConstrained3dLines.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Line[] GetLengthConstrained2dLines()
Public Function GetLengthConstrained2dLines As Line()
Return Value
Type: Line[]
An array of lines representing the length constraints
See Also
Reference
Squisher Class
Rhino.Geometry Namespace