RhinoCommon API
RhinoList<T>.CopyTo Method (Int32, T[], Int32, Int32)
 Copies a range of elements from the List to a compatible one-dimensional array, starting at the specified index of the target array.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void CopyTo(
	int index,
	T[] array,
	int arrayIndex,
	int count
)
Public Sub CopyTo (
	index As Integer,
	array As T(),
	arrayIndex As Integer,
	count As Integer
)
Parameters
index
Type: System.Int32
The zero-based index in the source List at which copying begins.
array
Type: T[]
The one-dimensional Array that is the destination of the elements copied from List. The Array must have zero-based indexing.
arrayIndex
Type: System.Int32
The zero-based index in array at which copying begins.
count
Type: System.Int32
The number of elements to copy.
See Also
Reference
RhinoList<T> Class
CopyTo Overload
Rhino.Collections Namespace