RhinoCommon API
SnapShotsClient.RestoreDocument Method
 Called when the user restores a snapshot and SupportDocument() returns true.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool RestoreDocument(
	RhinoDoc doc,
	BinaryArchiveReader archive
)
Public MustOverride Function RestoreDocument (
	doc As RhinoDoc,
	archive As BinaryArchiveReader
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
doc is the current document
archive
Type: Rhino.FileIO.BinaryArchiveReader
archive is the archive to read the data from
Return Value
Type: Boolean
true if successful, otherwise false
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace