RhinoCommon API
Curve.CreatePeriodicCurve Method (Curve, Boolean)
 Removes kinks from a curve. Periodic curves deform smoothly without kinks.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Curve CreatePeriodicCurve(
	Curve curve,
	bool smooth
)
Public Shared Function CreatePeriodicCurve (
	curve As Curve,
	smooth As Boolean
) As Curve
Parameters
curve
Type: Rhino.Geometry.Curve
The curve to make periodic. Curve must have degree >= 2.
smooth
Type: System.Boolean
 If true, smooths any kinks in the curve and moves control points to make a smooth curve. If false, control point locations are not changed or changed minimally (only one point may move) and only the knot vector is altered.
Return Value
Type: Curve
The resulting curve if successful, null otherwise.
See Also
Reference
Curve Class
CreatePeriodicCurve Overload
Rhino.Geometry Namespace