RhinoCommon API
TransformObjectList.GripArray Method
 Gets access to the internal GripObject array of the TransformObjectList object.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public GripObject[] GripArray()
Public Function GripArray As GripObject()
Return Value
Type: GripObject[]
An array of grip objects, or an empty array if there were no grip objects.
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace