RhinoCommon API
SubDComponentParameter.Inequality Operator
 Determines whether two parameters are different.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool operator !=(
	SubDComponentParameter a,
	SubDComponentParameter b
)
Public Shared Operator <> (
	a As SubDComponentParameter,
	b As SubDComponentParameter
) As Boolean
Parameters
a
Type: Rhino.Geometry.SubDComponentParameter
[Missing <param name="a"/> documentation for "M:Rhino.Geometry.SubDComponentParameter.op_Inequality(Rhino.Geometry.SubDComponentParameter,Rhino.Geometry.SubDComponentParameter)"]
b
Type: Rhino.Geometry.SubDComponentParameter
[Missing <param name="b"/> documentation for "M:Rhino.Geometry.SubDComponentParameter.op_Inequality(Rhino.Geometry.SubDComponentParameter,Rhino.Geometry.SubDComponentParameter)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDComponentParameter.op_Inequality(Rhino.Geometry.SubDComponentParameter,Rhino.Geometry.SubDComponentParameter)"]
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace