RhinoCommon API
IRhinoUiDialogService.ShowPropertyListBox Method (String, String, IList, IList<String>)
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPropertyListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.String})"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
string[] ShowPropertyListBox(
	string title,
	string message,
	IList items,
	IList<string> values
)
Function ShowPropertyListBox (
	title As String,
	message As String,
	items As IList,
	values As IList(Of String)
) As String()
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPropertyListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.String})"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPropertyListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.String})"]
items
Type: System.Collections.IList
[Missing <param name="items"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPropertyListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.String})"]
values
Type: System.Collections.Generic.IList<String>
[Missing <param name="values"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPropertyListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.String})"]
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPropertyListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.String})"]
See Also
Reference
IRhinoUiDialogService Interface
ShowPropertyListBox Overload
Rhino.UI Namespace