RhinoCommon API
Curve.Split Method (Brep, Double)
Note: This API is now obsolete.
 Splits a curve into pieces using a polysurface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use version that takes an angle tolerance")]
public Curve[] Split(
	Brep cutter,
	double tolerance
)
<ObsoleteAttribute("Use version that takes an angle tolerance")>
Public Function Split (
	cutter As Brep,
	tolerance As Double
) As Curve()
Parameters
cutter
Type: Rhino.Geometry.Brep
A cutting surface or polysurface.
tolerance
Type: System.Double
A tolerance for computing intersections.
Return Value
Type: Curve[]
An array of curves. This array can be empty.
See Also
Reference
Curve Class
Split Overload
Rhino.Geometry Namespace