RhinoCommon API
PersistentSettings.SetDefault Method (String, Boolean)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Boolean)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetDefault(
	string key,
	bool value
)
Public Sub SetDefault (
	key As String,
	value As Boolean
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Boolean)"]
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Boolean)"]
See Also
Reference
PersistentSettings Class
SetDefault Overload
Rhino Namespace