RhinoCommon API
CollapsibleSectionImpl.NewNativeWrapper Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.NewNativeWrapper(System.IntPtr)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ICollapsibleSection NewNativeWrapper(
	IntPtr cpp
)
Public Shared Function NewNativeWrapper (
	cpp As IntPtr
) As ICollapsibleSection
Parameters
cpp
Type: System.IntPtr
[Missing <param name="cpp"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.NewNativeWrapper(System.IntPtr)"]
Return Value
Type: ICollapsibleSection
[Missing <returns> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.NewNativeWrapper(System.IntPtr)"]
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace