RhinoCommon API
SmartTrackSettings.GetDefaultState Method
 Gets the Smart Track factory settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static SmartTrackSettingsState GetDefaultState()
Public Shared Function GetDefaultState As SmartTrackSettingsState
Return Value
Type: SmartTrackSettingsState
A new Smart Track state with factory settings.
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace