RhinoCommon API
DisplayPipelineAttributes.GetDitherTransparencyEffect Method
 Get the current dither transparency amount.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public float GetDitherTransparencyEffect()
Public Function GetDitherTransparencyEffect As Single
Return Value
Type: Single
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipelineAttributes.GetDitherTransparencyEffect"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace