RhinoCommon API
ObjRef.Geometry Method
 Gets the geometry linked to the object targeted by this reference.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GeometryBase Geometry()
Public Function Geometry As GeometryBase
Return Value
Type: GeometryBase
The geometry.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace