RhinoCommon API
ViewCaptureWriter.DrawRectangle Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawRectangle(System.Drawing.RectangleF,System.Drawing.Color,System.Single,System.Drawing.Color,System.Single)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract void DrawRectangle(
	RectangleF rect,
	Color fillColor,
	float strokeWidth,
	Color strokeColor,
	float cornerRadius
)
Protected MustOverride Sub DrawRectangle (
	rect As RectangleF,
	fillColor As Color,
	strokeWidth As Single,
	strokeColor As Color,
	cornerRadius As Single
)
Parameters
rect
Type: System.Drawing.RectangleF
[Missing <param name="rect"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawRectangle(System.Drawing.RectangleF,System.Drawing.Color,System.Single,System.Drawing.Color,System.Single)"]
fillColor
Type: System.Drawing.Color
[Missing <param name="fillColor"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawRectangle(System.Drawing.RectangleF,System.Drawing.Color,System.Single,System.Drawing.Color,System.Single)"]
strokeWidth
Type: System.Single
[Missing <param name="strokeWidth"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawRectangle(System.Drawing.RectangleF,System.Drawing.Color,System.Single,System.Drawing.Color,System.Single)"]
strokeColor
Type: System.Drawing.Color
[Missing <param name="strokeColor"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawRectangle(System.Drawing.RectangleF,System.Drawing.Color,System.Single,System.Drawing.Color,System.Single)"]
cornerRadius
Type: System.Single
[Missing <param name="cornerRadius"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawRectangle(System.Drawing.RectangleF,System.Drawing.Color,System.Single,System.Drawing.Color,System.Single)"]
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace