RhinoCommon API
FontTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.FontTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IEnumerator<Font> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Font)
Return Value
Type: IEnumerator<Font>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.FontTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
FontTable Class
Rhino.DocObjects.Tables Namespace