RhinoCommon API
PostEffectCollection Constructor
 Create a utility object not associated with any document
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public PostEffectCollection()
Public Sub New
See Also
Reference
PostEffectCollection Class
PostEffectCollection Overload
Rhino.Render.PostEffects Namespace