RhinoCommon API
Transform2d.Rotation Method (Double, Point2d)
 Constructs a new rotation transformation with a specified rotation center.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d Rotation(
	double angleRadians,
	Point2d rotationCenter
)
Public Shared Function Rotation (
	angleRadians As Double,
	rotationCenter As Point2d
) As Transform2d
Parameters
angleRadians
Type: System.Double
Angle, in radians, of the rotation. A positive angle rotates the X axis towards the Y axis.
rotationCenter
Type: Rhino.Geometry.Point2d
The fixed point of the rotation.
Return Value
Type: Transform2d
A rotation transformation, or Transform2d.Nan if the input is not valid.
See Also
Reference
Transform2d Structure
Rotation Overload
Rhino.Geometry Namespace