RhinoCommon API
SubDDisplayParameters.Medium Method
 Parameters for a medium limit surface display mesh. SubD display density = adaptive SubDDisplayParameters.Density.MediumDensity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static SubDDisplayParameters Medium()
Public Shared Function Medium As SubDDisplayParameters
Return Value
Type: SubDDisplayParameters
The SubD display parameters.
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace