RhinoCommon API
LengthValue.IsUnset Method
 Test IsUnset
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsUnset()
Public Function IsUnset As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.LengthValue.IsUnset"]
See Also
Reference
LengthValue Class
Rhino Namespace