RhinoCommon API
PersistentSettings.TryGetRectangle Method (String, Rectangle)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetRectangle(System.String,System.Drawing.Rectangle@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetRectangle(
	string key,
	out Rectangle value
)
Public Function TryGetRectangle (
	key As String,
	<OutAttribute> ByRef value As Rectangle
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetRectangle(System.String,System.Drawing.Rectangle@)"]
value
Type: System.Drawing.Rectangle
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetRectangle(System.String,System.Drawing.Rectangle@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetRectangle(System.String,System.Drawing.Rectangle@)"]
See Also
Reference
PersistentSettings Class
TryGetRectangle Overload
Rhino Namespace