RhinoCommon API
Worksession.ModelPathFromSerialNumber Method
 Returns the path to a model, used by the worksession, given a reference model serial number
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public string ModelPathFromSerialNumber(
	uint modelSerialNumber
)
Public Function ModelPathFromSerialNumber (
	modelSerialNumber As UInteger
) As String
Parameters
modelSerialNumber
Type: System.UInt32
The reference model serial number.
Return Value
Type: String
The path to the model if successful, null otherwise.
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace