RhinoCommon API
DrawingUtilities.BitmapFromSvg Method (String, Int32, Int32, Boolean)
 Create bitmap of a given size from an svg string
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Bitmap BitmapFromSvg(
	string svg,
	int width,
	int height,
	bool adjustForDarkMode
)
Public Shared Function BitmapFromSvg (
	svg As String,
	width As Integer,
	height As Integer,
	adjustForDarkMode As Boolean
) As Bitmap
Parameters
svg
Type: System.String
A valid svg string
width
Type: System.Int32
Width of the svg in pixels
height
Type: System.Int32
Height of the svg in pixels
adjustForDarkMode
Type: System.Boolean
If true dark mode specific attributes will be used in the svg
Return Value
Type: Bitmap
A
See Also
Reference
DrawingUtilities Class
BitmapFromSvg Overload
Rhino.UI Namespace