RhinoCommon API
RenderContentCollection.Dispose Method
 Dispose function for RenderContentCollection
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace