RhinoCommon API
FilePly.Write Method
Write a ply file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static WriteFileResult Write(
	string filename,
	RhinoDoc doc,
	FilePlyWriteOptions options
)
Public Shared Function Write (
	filename As String,
	doc As RhinoDoc,
	options As FilePlyWriteOptions
) As WriteFileResult
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.FileIO.FilePly.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FilePlyWriteOptions)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.FileIO.FilePly.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FilePlyWriteOptions)"]
options
Type: Rhino.FileIO.FilePlyWriteOptions
[Missing <param name="options"/> documentation for "M:Rhino.FileIO.FilePly.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FilePlyWriteOptions)"]
Return Value
Type: WriteFileResult
[Missing <returns> documentation for "M:Rhino.FileIO.FilePly.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FilePlyWriteOptions)"]
See Also
Reference
FilePly Class
Rhino.FileIO Namespace