RhinoCommon API
LicenseData.IsValid Method (Boolean)
[Missing <summary> documentation for "M:Rhino.PlugIns.LicenseData.IsValid(System.Boolean)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsValid(
	bool ignoreExpirationDate
)
Public Function IsValid (
	ignoreExpirationDate As Boolean
) As Boolean
Parameters
ignoreExpirationDate
Type: System.Boolean
[Missing <param name="ignoreExpirationDate"/> documentation for "M:Rhino.PlugIns.LicenseData.IsValid(System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseData.IsValid(System.Boolean)"]
See Also
Reference
LicenseData Class
IsValid Overload
Rhino.PlugIns Namespace