RhinoCommon API
FileObj.Write Method (String, Mesh[], FileObjWriteOptions)
Write an obj file with an array of meshes
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static WriteFileResult Write(
	string filename,
	Mesh[] meshes,
	FileObjWriteOptions options
)
Public Shared Function Write (
	filename As String,
	meshes As Mesh(),
	options As FileObjWriteOptions
) As WriteFileResult
Parameters
filename
Type: System.String
path to write to
meshes
Type: Rhino.Geometry.Mesh[]
meshes to write as obj format
options
Type: Rhino.FileIO.FileObjWriteOptions
[Missing <param name="options"/> documentation for "M:Rhino.FileIO.FileObj.Write(System.String,Rhino.Geometry.Mesh[],Rhino.FileIO.FileObjWriteOptions)"]
Return Value
Type: WriteFileResult
[Missing <returns> documentation for "M:Rhino.FileIO.FileObj.Write(System.String,Rhino.Geometry.Mesh[],Rhino.FileIO.FileObjWriteOptions)"]
See Also
Reference
FileObj Class
Write Overload
Rhino.FileIO Namespace