RhinoCommon API
ClippingPlaneSurface.ClearClipParticipationLists Method
 Remove list of object ids that this clipping plane surface clips. This causes the clipping plane surface to clip all objects
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void ClearClipParticipationLists()
Public Sub ClearClipParticipationLists
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace