RhinoCommon API
PointCloudUnsafeLock.ValueArray Method
 Retrieves a pointer to the raw array of point values, or null if none is available.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public double* ValueArray(
	out int length
)
Visual Basic does not support APIs that consume or return unsafe types.
Parameters
length
Type: System.Int32
The length of the array. This value is returned by reference (out in C#). 0 is returned when there is no single precision array.
Return Value
Type: Double*
The beginning of the value array. Item 0 is the first vertex, and item length-1 is the last valid one. If no array is available, null is returned.
See Also
Reference
PointCloudUnsafeLock Class
Rhino.Geometry Namespace