RhinoCommon API
File3dmDisplacement.SubItemOn Method
 Gets the override for displacement 'on'. face_index is the index of the face on the polysurface/SubD.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SubItemOn(
	int face_index
)
Public Function SubItemOn (
	face_index As Integer
) As Boolean
Parameters
face_index
Type: System.Int32
[Missing <param name="face_index"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.SubItemOn(System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmDisplacement.SubItemOn(System.Int32)"]
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace