RhinoCommon API
DisplayPipeline.PushDepthWriting Method
 Push a DepthWriting flag on the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void PushDepthWriting(
	bool enable
)
Public Sub PushDepthWriting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
DepthWriting flag.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace