RhinoCommon API
RenderWindow.ChannelGPU.TextureHandle Method
Note: This API is now obsolete.
 Return the channel's texture handle.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[ObsoleteAttribute("This method has been deprecated. Please use TextureHandleOpenGL or TextureHandleMetal instead.")]
public uint TextureHandle()
<ObsoleteAttribute("This method has been deprecated. Please use TextureHandleOpenGL or TextureHandleMetal instead.")>
Public Function TextureHandle As UInteger
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.TextureHandle"]
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace