RhinoCommon API
RenderWindow.Channel.GetValues Method
 Get a rectangle of values from the channel. The input parameters are checked for validity. If the rectangle is not fully inside the frame buffer, the function will fail.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void GetValues(
	Rectangle rectangle,
	int stride,
	ComponentOrders componentOrder,
	ref float[] values
)
Public Sub GetValues (
	rectangle As Rectangle,
	stride As Integer,
	componentOrder As ComponentOrders,
	ByRef values As Single()
)
Parameters
rectangle
Type: System.Drawing.Rectangle
[Missing <param name="rectangle"/> documentation for "M:Rhino.Render.RenderWindow.Channel.GetValues(System.Drawing.Rectangle,System.Int32,Rhino.Render.ComponentOrders,System.Single[]@)"]
stride
Type: System.Int32
[Missing <param name="stride"/> documentation for "M:Rhino.Render.RenderWindow.Channel.GetValues(System.Drawing.Rectangle,System.Int32,Rhino.Render.ComponentOrders,System.Single[]@)"]
componentOrder
Type: Rhino.Render.ComponentOrders
[Missing <param name="componentOrder"/> documentation for "M:Rhino.Render.RenderWindow.Channel.GetValues(System.Drawing.Rectangle,System.Int32,Rhino.Render.ComponentOrders,System.Single[]@)"]
values
Type: System.Single[]
[Missing <param name="values"/> documentation for "M:Rhino.Render.RenderWindow.Channel.GetValues(System.Drawing.Rectangle,System.Int32,Rhino.Render.ComponentOrders,System.Single[]@)"]
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace