RhinoCommon API
Brep.CreateVariationalPatch Method (RhinoDoc, IEnumerable<Brep.CurveConstraint>, IEnumerable<Brep.CurveConstraint>, IEnumerable<Brep.PointConstraint>, Brep.VariationalPatchSettings, Boolean, CancellationToken, IProgress<Double>, Brep.VariationalPatchResult)
 Create a patch using variational approach
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Brep CreateVariationalPatch(
	RhinoDoc doc,
	IEnumerable<Brep.CurveConstraint> edges,
	IEnumerable<Brep.CurveConstraint> internalCurves,
	IEnumerable<Brep.PointConstraint> points,
	Brep.VariationalPatchSettings settings,
	bool multiThreading,
	CancellationToken cancelToken,
	IProgress<double> progress,
	out Brep.VariationalPatchResult results
)
Public Shared Function CreateVariationalPatch (
	doc As RhinoDoc,
	edges As IEnumerable(Of Brep.CurveConstraint),
	internalCurves As IEnumerable(Of Brep.CurveConstraint),
	points As IEnumerable(Of Brep.PointConstraint),
	settings As Brep.VariationalPatchSettings,
	multiThreading As Boolean,
	cancelToken As CancellationToken,
	progress As IProgress(Of Double),
	<OutAttribute> ByRef results As Brep.VariationalPatchResult
) As Brep
Parameters
doc
Type: Rhino.RhinoDoc
The Rhino document. Use null if not available.
edges
Type: System.Collections.Generic.IEnumerable<Brep.CurveConstraint>
Edges with continuity constraints
internalCurves
Type: System.Collections.Generic.IEnumerable<Brep.CurveConstraint>
Internal curves
points
Type: System.Collections.Generic.IEnumerable<Brep.PointConstraint>
Internal points
settings
Type: Rhino.Geometry.Brep.VariationalPatchSettings
The settings to use while creating the surface
multiThreading
Type: System.Boolean
Use multi-threading during the calculation
cancelToken
Type: System.Threading.CancellationToken
The cancellation token.
progress
Type: System.IProgress<Double>
The provider for progress updates.
results
Type: Rhino.Geometry.Brep.VariationalPatchResult
The results of the patching algorithm.
Return Value
Type: Brep
Trimmed surface if successful, null otherwise
See Also
Reference
Brep Class
CreateVariationalPatch Overload
Rhino.Geometry Namespace