RhinoCommon API
UserInterfaceTextBox.OnKeyboardFocusChanged Method
 Called when the box gains or loses keyboard focus. Read HasKeyboardFocus to find out which. The default implementation raises the KeyboardFocusChanged event.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnKeyboardFocusChanged(
	bool hasFocus
)
Protected Overridable Sub OnKeyboardFocusChanged (
	hasFocus As Boolean
)
Parameters
hasFocus
Type: System.Boolean
True when the box has just taken focus
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace