RhinoCommon API
RhinoGet.StringToCommandOptionName Method (String)
 Convert some arbitrary string value to a valid command option name removing any invalid characters.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string StringToCommandOptionName(
	string stringToConvert
)
Public Shared Function StringToCommandOptionName (
	stringToConvert As String
) As String
Parameters
stringToConvert
Type: System.String
 String to convert.
Return Value
Type: String
 Returns null if the string is null or empty or if it contains nothing but invalid characters. If the converted string is one or more characters in length then the converted value is returned.
See Also
Reference
RhinoGet Class
StringToCommandOptionName Overload
Rhino.Input Namespace