RhinoCommon API
Decal.SetHorzSweep Method
 Sets the angles of the decal's arc of 'horizontal sweep'.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetHorzSweep(
	double sta,
	double end
)
Public Sub SetHorzSweep (
	sta As Double,
	end As Double
)
Parameters
sta
Type: System.Double
[Missing <param name="sta"/> documentation for "M:Rhino.Render.Decal.SetHorzSweep(System.Double,System.Double)"]
end
Type: System.Double
[Missing <param name="end"/> documentation for "M:Rhino.Render.Decal.SetHorzSweep(System.Double,System.Double)"]
See Also
Reference
Decal Class
Rhino.Render Namespace