RhinoCommon API
FileImportPlugIn.MakeReferenceTableName Method (String)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.PlugIns.FileImportPlugIn.MakeReferenceTableName(System.String)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use MakeReferenceTableName(RhinoDoc doc, string nameToPrefix) instead. This method will use the active document which will be a poor choice on the Mac")]
protected string MakeReferenceTableName(
	string nameToPrefix
)
<ObsoleteAttribute("Use MakeReferenceTableName(RhinoDoc doc, string nameToPrefix) instead. This method will use the active document which will be a poor choice on the Mac")>
Protected Function MakeReferenceTableName (
	nameToPrefix As String
) As String
Parameters
nameToPrefix
Type: System.String
[Missing <param name="nameToPrefix"/> documentation for "M:Rhino.PlugIns.FileImportPlugIn.MakeReferenceTableName(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.PlugIns.FileImportPlugIn.MakeReferenceTableName(System.String)"]
See Also
Reference
FileImportPlugIn Class
MakeReferenceTableName Overload
Rhino.PlugIns Namespace