RhinoCommon API
SurfaceCurvature.Finalize Method
 Passively releases the unmanaged pointer.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace