RhinoCommon API
SubDSurfaceInterpolator.FixedVertexCount Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDSurfaceInterpolator.FixedVertexCount"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public uint FixedVertexCount()
Public Function FixedVertexCount As UInteger
Return Value
Type: UInt32
Number of vertices with fixed surface points.
See Also
Reference
SubDSurfaceInterpolator Class
Rhino.Geometry Namespace