RhinoCommon API
IZooClientUtilities.IsCheckOutEnabled Method
 Returns whether or not license checkout is enabled
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool IsCheckOutEnabled(
	Object verify
)
Function IsCheckOutEnabled (
	verify As Object
) As Boolean
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.IsCheckOutEnabled(System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.IsCheckOutEnabled(System.Object)"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace