RhinoCommon API
ComponentFunctionInfo.InvokeKeepTreeSilenceWarnings Method
 Runs Evaluate(IEnumerable, Boolean, String[]) with keepTree equal to true, and discards warnings (this is a dangerous operation!).
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Object[] InvokeKeepTreeSilenceWarnings(
	params Object[] args
)
Public Function InvokeKeepTreeSilenceWarnings (
	ParamArray args As Object()
) As Object()
Parameters
args
Type: System.Object[]
Arguments.
Return Value
Type: Object[]
Array of items.
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace