RhinoCommon API
CurveProxy Constructor
 Protected constructor for internal use.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CurveProxy()
Protected Sub New
See Also
Reference
CurveProxy Class
Rhino.Geometry Namespace