RhinoCommon API
LicenseData.Dispose Method
Releases all resources used by the LicenseData
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace