RhinoCommon API
PolylineCurve Constructor
 Initializes a new empty polyline curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PolylineCurve()
Public Sub New
See Also
Reference
PolylineCurve Class
PolylineCurve Overload
Rhino.Geometry Namespace