RhinoCommon API
FileSkp.Read Method
Read a Skp file into a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	FileSkpReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As FileSkpReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.FileSkpReadOptions
options used for importing the Skp file
Return Value
Type: Boolean
true on success
See Also
Reference
FileSkp Class
Rhino.FileIO Namespace