RhinoCommon API
PersistentSettings.GetColor Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetColor(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color GetColor(
	string key
)
Public Function GetColor (
	key As String
) As Color
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetColor(System.String)"]
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetColor(System.String)"]
See Also
Reference
PersistentSettings Class
GetColor Overload
Rhino Namespace