RhinoCommon API
MeshFace.Inequality Operator
 Determines whether two MeshFace structures have different values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool operator !=(
	MeshFace a,
	MeshFace b
)
Public Shared Operator <> (
	a As MeshFace,
	b As MeshFace
) As Boolean
Parameters
a
Type: Rhino.Geometry.MeshFace
The first MeshFace.
b
Type: Rhino.Geometry.MeshFace
The second MeshFace.
Return Value
Type: Boolean
true if the indices of the two points are in any way different; otherwise false.
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace