RhinoCommon API
Intersection.MeshLine Method (Mesh, Line, Int32[])
 Finds the intersections of a mesh and a line. The points are not necessarily sorted.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Point3d[] MeshLine(
	Mesh mesh,
	Line line,
	out int[] faceIds
)
Public Shared Function MeshLine (
	mesh As Mesh,
	line As Line,
	<OutAttribute> ByRef faceIds As Integer()
) As Point3d()
Parameters
mesh
Type: Rhino.Geometry.Mesh
A mesh to intersect
line
Type: Rhino.Geometry.Line
The line to intersect with the mesh
faceIds
Type: System.Int32[]
The indices of the intersecting faces. This out reference is assigned during the call. Empty if nothing is found.
Return Value
Type: Point3d[]
An array of points: one for each face that was passed by the faceIds out reference. Empty if no items are found.
See Also
Reference
Intersection Class
MeshLine Overload
Rhino.Geometry.Intersect Namespace