RhinoCommon API
NamedConstructionPlaneTable.Add Method (ConstructionPlane)
 Adds named construction plane to document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.18
Syntax
public int Add(
	ConstructionPlane constructionPlane
)
Public Function Add (
	constructionPlane As ConstructionPlane
) As Integer
Parameters
constructionPlane
Type: Rhino.DocObjects.ConstructionPlane
The construction plane value.
Return Value
Type: Int32
 0 based index of named construction plane. -1 on failure.
See Also
Reference
NamedConstructionPlaneTable Class
Add Overload
Rhino.DocObjects.Tables Namespace