RhinoCommon API
ViewUserInterfaceTable.Find<T> Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Find``1"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public T[] Find<T>()
where T : UserInterfaceObjectBase
Public Function Find(Of T As UserInterfaceObjectBase) As T()
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Find``1"]
Return Value
Type: T[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Find``1"]
See Also
Reference
ViewUserInterfaceTable Class
Rhino.DocObjects.Tables Namespace