RhinoCommon API
SubDEdgeList.SetEdgeTags Method (IEnumerable<SubDEdge>, SubDEdgeTag)
 Set edge tags for a list of edges. Useful for adding creases to SubDs
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
public void SetEdgeTags(
	IEnumerable<SubDEdge> edges,
	SubDEdgeTag tag
)
Public Sub SetEdgeTags (
	edges As IEnumerable(Of SubDEdge),
	tag As SubDEdgeTag
)
Parameters
edges
Type: System.Collections.Generic.IEnumerable<SubDEdge>
list of edges to set a specific tag on
tag
Type: Rhino.Geometry.SubDEdgeTag
The type of edge tag
See Also
Reference
SubDEdgeList Class
SetEdgeTags Overload
Rhino.Geometry.Collections Namespace