RhinoCommon API
GetCurve Constructor
 Initializes a new instance with the default prompts and options.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public GetCurve()
Public Sub New
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace