RhinoCommon API
GetBaseClass.Finalize Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetBaseClass.Finalize"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace