RhinoCommon API
TrulyObservableOrderedSet<T>.Clear Method
 Clears the ordered set.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
Exceptions
Exception | Condition
InvalidOperationException | Thrown if at least one item currently in the set cannot be modified by the current assembly.
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace