RhinoCommon API
BinaryArchiveFile.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace