RhinoCommon API
TextFields.Date Method (String, String)
 Current Date in a specific format and language
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Date(
	string dateFormat,
	string languageId
)
Public Shared Function Date (
	dateFormat As String,
	languageId As String
) As String
Parameters
dateFormat
Type: System.String
[Missing <param name="dateFormat"/> documentation for "M:Rhino.Runtime.TextFields.Date(System.String,System.String)"]
languageId
Type: System.String
[Missing <param name="languageId"/> documentation for "M:Rhino.Runtime.TextFields.Date(System.String,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.Date(System.String,System.String)"]
See Also
Reference
TextFields Class
Date Overload
Rhino.Runtime Namespace