RhinoCommon API
DisplayPen.FromLinetype Method (Linetype, Color, Double)
 Create a display pen that matches a linetype definition
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static DisplayPen FromLinetype(
	Linetype linetype,
	Color color,
	double patternScale
)
Public Shared Function FromLinetype (
	linetype As Linetype,
	color As Color,
	patternScale As Double
) As DisplayPen
Parameters
linetype
Type: Rhino.DocObjects.Linetype
[Missing <param name="linetype"/> documentation for "M:Rhino.Display.DisplayPen.FromLinetype(Rhino.DocObjects.Linetype,System.Drawing.Color,System.Double)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPen.FromLinetype(Rhino.DocObjects.Linetype,System.Drawing.Color,System.Double)"]
patternScale
Type: System.Double
scale to be applied to linetype dash pattern. Typically this is 1.0.
Return Value
Type: DisplayPen
[Missing <returns> documentation for "M:Rhino.Display.DisplayPen.FromLinetype(Rhino.DocObjects.Linetype,System.Drawing.Color,System.Double)"]
See Also
Reference
DisplayPen Class
FromLinetype Overload
Rhino.Display Namespace