RhinoCommon API
File3dmObjectTable.AddEllipse Method (Ellipse)
Adds a curve object to the document representing an ellipse.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddEllipse(
	Ellipse ellipse
)
Public Function AddEllipse (
	ellipse As Ellipse
) As Guid
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
An ellipse to add.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddEllipse Overload
Rhino.FileIO Namespace