RhinoCommon API
PreviewAppearance.RotationType Method
 RotationType
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IRhRdkPreviewSceneServer_eRotationType RotationType()
Public Function RotationType As IRhRdkPreviewSceneServer_eRotationType
Return Value
Type: IRhRdkPreviewSceneServer_eRotationType
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.RotationType"]
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace