RhinoCommon API
PlugIn.GetInstalledPlugInNames Method
 Returns the names of all installed Rhino plug-ins.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string[] GetInstalledPlugInNames()
Public Shared Function GetInstalledPlugInNames As String()
Return Value
Type: String[]
The names if successful.
See Also
Reference
PlugIn Class
GetInstalledPlugInNames Overload
Rhino.PlugIns Namespace