RhinoCommon API
SupportOptions.Libraries_UseDefaultLocation Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.Libraries_UseDefaultLocation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Libraries_UseDefaultLocation()
Public Shared Function Libraries_UseDefaultLocation As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.Libraries_UseDefaultLocation"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace