RhinoCommon API
SimulatedTexture Constructor (Texture)
Note: This API is now obsolete.
Initializes a new instance of the SimulatedTexture class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
[ObsoleteAttribute]
public SimulatedTexture(
	Texture texture
)
<ObsoleteAttribute>
Public Sub New (
	texture As Texture
)
Parameters
texture
Type: Rhino.DocObjects.Texture
[Missing <param name="texture"/> documentation for "M:Rhino.Render.SimulatedTexture.#ctor(Rhino.DocObjects.Texture)"]
See Also
Reference
SimulatedTexture Class
SimulatedTexture Overload
Rhino.Render Namespace