RhinoCommon API
ClippingPlaneSurface Constructor
 Constructs an empty clipping plane surface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public ClippingPlaneSurface()
Public Sub New
See Also
Reference
ClippingPlaneSurface Class
ClippingPlaneSurface Overload
Rhino.Geometry Namespace