RhinoCommon API
ChangeQueue.GetQueueSceneBoundingBox Method
 Get the scene bounding box
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public BoundingBox GetQueueSceneBoundingBox()
Public Function GetQueueSceneBoundingBox As BoundingBox
Return Value
Type: BoundingBox
Scene bounding box
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace