RhinoCommon API
BinaryArchiveWriter.WriteSByte Method
 Writes a SByte value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteSByte(
	sbyte value
)
Public Sub WriteSByte (
	value As SByte
)
Parameters
value
Type: System.SByte
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace