RhinoCommon API
Mesh.SplitWithProjectedPolylines Method (IEnumerable<PolylineCurve>, Double, TextLog, CancellationToken, IProgress<Double>)
 Splits a mesh by adding edges in correspondence with input polylines, and divides the mesh at partitioned areas. Polyline segments that are measured not to be on the mesh will be ignored.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Mesh[] SplitWithProjectedPolylines(
	IEnumerable<PolylineCurve> curves,
	double tolerance,
	TextLog textLog,
	CancellationToken cancel,
	IProgress<double> progress
)
Public Function SplitWithProjectedPolylines (
	curves As IEnumerable(Of PolylineCurve),
	tolerance As Double,
	textLog As TextLog,
	cancel As CancellationToken,
	progress As IProgress(Of Double)
) As Mesh()
Parameters
curves
Type: System.Collections.Generic.IEnumerable<PolylineCurve>
An array, a list or any enumerable of polyline curves.
tolerance
Type: System.Double
A tolerance value.
textLog
Type: Rhino.FileIO.TextLog
A text log, or null.
cancel
Type: System.Threading.CancellationToken
A cancellation token to stop the computation at a given point.
progress
Type: System.IProgress<Double>
A progress reporter to inform the user about progress. The reported value is indicative.
Return Value
Type: Mesh[]
An array of meshes, or null if no change would happen.
See Also
Reference
Mesh Class
SplitWithProjectedPolylines Overload
Rhino.Geometry Namespace