RhinoCommon API
RhinoDoc.FormatNumber Method (Double)
 Call this method to get string representing the specified value using the documents display coordinate system and display precision.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string FormatNumber(
	double value
)
Public Function FormatNumber (
	value As Double
) As String
Parameters
value
Type: System.Double
[Missing <param name="value"/> documentation for "M:Rhino.RhinoDoc.FormatNumber(System.Double)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.RhinoDoc.FormatNumber(System.Double)"]
See Also
Reference
RhinoDoc Class
FormatNumber Overload
Rhino Namespace