RhinoCommon API
Sun.AltitudeFromValues Method
[Missing <summary> documentation for "M:Rhino.Render.Sun.AltitudeFromValues(System.Double,System.Double,System.Double,System.Int32,System.DateTime,System.Double,System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static double AltitudeFromValues(
	double latitude,
	double longitude,
	double timezoneHours,
	int daylightMinutes,
	DateTime when,
	double hours,
	bool fast = false
)
Public Shared Function AltitudeFromValues (
	latitude As Double,
	longitude As Double,
	timezoneHours As Double,
	daylightMinutes As Integer,
	when As DateTime,
	hours As Double,
	Optional fast As Boolean = false
) As Double
Parameters
latitude
Type: System.Double
[Missing <param name="latitude"/> documentation for "M:Rhino.Render.Sun.AltitudeFromValues(System.Double,System.Double,System.Double,System.Int32,System.DateTime,System.Double,System.Boolean)"]
longitude
Type: System.Double
[Missing <param name="longitude"/> documentation for "M:Rhino.Render.Sun.AltitudeFromValues(System.Double,System.Double,System.Double,System.Int32,System.DateTime,System.Double,System.Boolean)"]
timezoneHours
Type: System.Double
[Missing <param name="timezoneHours"/> documentation for "M:Rhino.Render.Sun.AltitudeFromValues(System.Double,System.Double,System.Double,System.Int32,System.DateTime,System.Double,System.Boolean)"]
daylightMinutes
Type: System.Int32
[Missing <param name="daylightMinutes"/> documentation for "M:Rhino.Render.Sun.AltitudeFromValues(System.Double,System.Double,System.Double,System.Int32,System.DateTime,System.Double,System.Boolean)"]
when
Type: System.DateTime
[Missing <param name="when"/> documentation for "M:Rhino.Render.Sun.AltitudeFromValues(System.Double,System.Double,System.Double,System.Int32,System.DateTime,System.Double,System.Boolean)"]
hours
Type: System.Double
[Missing <param name="hours"/> documentation for "M:Rhino.Render.Sun.AltitudeFromValues(System.Double,System.Double,System.Double,System.Int32,System.DateTime,System.Double,System.Boolean)"]
fast (Optional)
Type: System.Boolean
[Missing <param name="fast"/> documentation for "M:Rhino.Render.Sun.AltitudeFromValues(System.Double,System.Double,System.Double,System.Int32,System.DateTime,System.Double,System.Boolean)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.Sun.AltitudeFromValues(System.Double,System.Double,System.Double,System.Int32,System.DateTime,System.Double,System.Boolean)"]
See Also
Reference
Sun Class
Rhino.Render Namespace