RhinoCommon API
PersistentSettings.GetPoint Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetPoint(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point GetPoint(
	string key
)
Public Function GetPoint (
	key As String
) As Point
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetPoint(System.String)"]
Return Value
Type: Point
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetPoint(System.String)"]
See Also
Reference
PersistentSettings Class
GetPoint Overload
Rhino Namespace