RhinoCommon API
PersistentSettings.GetSettingIsHiddenFromUserInterface Method (String)
 Values read from all users settings files will be marked as read-only which will cause any future calls to Set... to fail.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GetSettingIsHiddenFromUserInterface(
	string key
)
Public Function GetSettingIsHiddenFromUserInterface (
	key As String
) As Boolean
Parameters
key
Type: System.String
 Key name for which to search.
Return Value
Type: Boolean
 Returns true if the setting is read-only otherwise false.
Exceptions
Exception | Condition
KeyNotFoundException |  A KeyNotFoundException exception is thrown if the key is not found in the settings dictionary.
See Also
Reference
PersistentSettings Class
GetSettingIsHiddenFromUserInterface Overload
Rhino Namespace