RhinoCommon API
DisplayModeDescription.ImportFromFile Method (String)
 Imports a DisplayModeDescription from a Windows-style .ini file.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid ImportFromFile(
	string filename
)
Public Shared Function ImportFromFile (
	filename As String
) As Guid
Parameters
filename
Type: System.String
The name of the file to import.
Return Value
Type: Guid
The id of the DisplayModeDescription if successful.
See Also
Reference
DisplayModeDescription Class
ImportFromFile Overload
Rhino.Display Namespace