RhinoCommon API
ArchivableDictionary.GetBytes Method (String)
 Get value as byte[], will only succeed if value was created using Set(string key, byte[] value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public byte[] GetBytes(
	string key
)
Public Function GetBytes (
	key As String
) As Byte()
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetBytes(System.String)"]
Return Value
Type: Byte[]
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetBytes(System.String)"]
See Also
Reference
ArchivableDictionary Class
GetBytes Overload
Rhino.Collections Namespace