RhinoCommon API
DisplayConduit.SetObjectIdFilter Method (Guid)
 Set an object Id that this conduit's per-object functions will only be called for
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SetObjectIdFilter(
	Guid id
)
Public Sub SetObjectIdFilter (
	id As Guid
)
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Display.DisplayConduit.SetObjectIdFilter(System.Guid)"]
See Also
Reference
DisplayConduit Class
SetObjectIdFilter Overload
Rhino.Display Namespace