RhinoCommon API
BrepFace.ClosestPointOnFace Method
 Get the closest point to this face. Closest point finding respects the trims on the face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ClosestPointOnFace(
	Point3d testPoint,
	out double u,
	out double v,
	double maximumDistance
)
Public Function ClosestPointOnFace (
	testPoint As Point3d,
	<OutAttribute> ByRef u As Double,
	<OutAttribute> ByRef v As Double,
	maximumDistance As Double
) As Boolean
Parameters
testPoint
Type: Rhino.Geometry.Point3d
[Missing <param name="testPoint"/> documentation for "M:Rhino.Geometry.BrepFace.ClosestPointOnFace(Rhino.Geometry.Point3d,System.Double@,System.Double@,System.Double)"]
u
Type: System.Double
The surface u-parameter for the closest point
v
Type: System.Double
The surface v-parameter for the closest point
maximumDistance
Type: System.Double
The maximum allowed distance.
Past this distance, the search is given up and false is returned.
Use 0 to turn off this parameter.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.BrepFace.ClosestPointOnFace(Rhino.Geometry.Point3d,System.Double@,System.Double@,System.Double)"]
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace