RhinoCommon API
Sun.Here Method
[Missing <summary> documentation for "M:Rhino.Render.Sun.Here(System.Double@,System.Double@)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool Here(
	out double latitude,
	out double longitude
)
Public Shared Function Here (
	<OutAttribute> ByRef latitude As Double,
	<OutAttribute> ByRef longitude As Double
) As Boolean
Parameters
latitude
Type: System.Double
[Missing <param name="latitude"/> documentation for "M:Rhino.Render.Sun.Here(System.Double@,System.Double@)"]
longitude
Type: System.Double
[Missing <param name="longitude"/> documentation for "M:Rhino.Render.Sun.Here(System.Double@,System.Double@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.Sun.Here(System.Double@,System.Double@)"]
See Also
Reference
Sun Class
Rhino.Render Namespace