RhinoCommon API
SnapShotsClient.LightsCategory Method
 Predefined lights category
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string LightsCategory()
Public Shared Function LightsCategory As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.LightsCategory"]
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace