RhinoCommon API
RenderPipeline.RenderSize Method (RhinoDoc, Boolean)
 Get the render size as specified in the ON_3dmRenderSettings, and from RenderSources when fromRenderSources is true.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Size RenderSize(
	RhinoDoc doc,
	bool fromRenderSources
)
Public Shared Function RenderSize (
	doc As RhinoDoc,
	fromRenderSources As Boolean
) As Size
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.RenderPipeline.RenderSize(Rhino.RhinoDoc,System.Boolean)"]
fromRenderSources
Type: System.Boolean
[Missing <param name="fromRenderSources"/> documentation for "M:Rhino.Render.RenderPipeline.RenderSize(Rhino.RhinoDoc,System.Boolean)"]
Return Value
Type: Size
The render size.
See Also
Reference
RenderPipeline Class
RenderSize Overload
Rhino.Render Namespace