RhinoCommon API
NurbsCurve.Reparameterize Method (Double)
 Use a linear fractional transformation to re-parameterize the NURBS curve. This does not change the curve's domain.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Reparameterize(
	double c
)
Public Function Reparameterize (
	c As Double
) As Boolean
Parameters
c
Type: System.Double
 re-parameterization constant (generally speaking, c should be > 0). The control points and knots are adjusted so that output_nurbs(t) = input_nurbs(lambda(t)), where lambda(t) = c*t/( (c-1)*t + 1 ). Note that lambda(0) = 0, lambda(1) = 1, lambda'(t) > 0, lambda'(0) = c and lambda'(1) = 1/c.
Return Value
Type: Boolean
true if successful.
Remarks
 The CV and knot values are values are changed so that output_nurbs(t) = input_nurbs(lambda(t)).
See Also
Reference
NurbsCurve Class
Reparameterize Overload
Rhino.Geometry Namespace