RhinoCommon API
RenderContentType.Dispose Method
Releases all resources used by the RenderContentType
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RenderContentType Class
Dispose Overload
Rhino.Render Namespace