RhinoCommon API
Sun.SetPosition Method (Double, Double)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.Sun.SetPosition(System.Double,System.Double)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use Azimuth and Altitude properties instead")]
public void SetPosition(
	double azimuthDegrees,
	double altitudeDegrees
)
<ObsoleteAttribute("Use Azimuth and Altitude properties instead")>
Public Sub SetPosition (
	azimuthDegrees As Double,
	altitudeDegrees As Double
)
Parameters
azimuthDegrees
Type: System.Double
[Missing <param name="azimuthDegrees"/> documentation for "M:Rhino.Render.Sun.SetPosition(System.Double,System.Double)"]
altitudeDegrees
Type: System.Double
[Missing <param name="altitudeDegrees"/> documentation for "M:Rhino.Render.Sun.SetPosition(System.Double,System.Double)"]
See Also
Reference
Sun Class
SetPosition Overload
Rhino.Render Namespace