RhinoCommon API
ObjectTable.Replace Method (ObjRef, TextEntity)
Replaces one object with new text object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Replace(
	ObjRef objref,
	TextEntity text
)
Public Function Replace (
	objref As ObjRef,
	text As TextEntity
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
text
Type: Rhino.Geometry.TextEntity
new text to be added. The text is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace