RhinoCommon API
GrasshopperDisplayMaterial Constructor (Color)
 Constructs a material with a specific diffuse colour.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public GrasshopperDisplayMaterial(
	Color diffuse
)
Public Sub New (
	diffuse As Color
)
Parameters
diffuse
Type: System.Drawing.Color
The diffuse colour. Unlike DisplayMaterial, the alpha channel is not ignored — it is the opacity. See Diffuse.
See Also
Reference
GrasshopperDisplayMaterial Class
GrasshopperDisplayMaterial Overload
Rhino.Display Namespace