RhinoCommon API
Panels.ClosePanel Method (Guid, RhinoDoc)
 Will close or hide the specified panel type, in Windows Rhino, if it is the only visible tab the tab dock bar will be closed as well. In Mac Rhino it will always close the modeless dialog hosting the panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public static void ClosePanel(
	Guid panelId,
	RhinoDoc doc
)
Public Shared Sub ClosePanel (
	panelId As Guid,
	doc As RhinoDoc
)
Parameters
panelId
Type: System.Guid
 Class type Id of the panel to close.
doc
Type: Rhino.RhinoDoc
 Document associated with panel you wish to close.
See Also
Reference
Panels Class
ClosePanel Overload
Rhino.UI Namespace