RhinoCommon API
Mesh.SolidOrientation Method
 Determines orientation of a "solid" mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int SolidOrientation()
Public Function SolidOrientation As Integer
Return Value
Type: Int32
+1 = mesh is solid with outward facing normals.
-1 = mesh is solid with inward facing normals.
0 = mesh is not solid.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace