RhinoCommon API
Brep.IsBox Method
 Verifies a Brep is in the form of a solid box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.10
Syntax
public bool IsBox()
Public Function IsBox As Boolean
Return Value
Type: Boolean
true if the Brep is a solid box, false otherwise.
See Also
Reference
Brep Class
IsBox Overload
Rhino.Geometry Namespace