RhinoCommon API
SHA1OpenNURBS Constructor
 Constructs a new instance of the SHA1 algorithm.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public SHA1OpenNURBS()
Public Sub New
See Also
Reference
SHA1OpenNURBS Class
Rhino.FileIO Namespace