RhinoCommon API
PointCloud.GetPointValues Method
 Copy all the extra point values in this point cloud to an array. Extra values can be used to store a user-defined value, such as intensity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public double[] GetPointValues()
Public Function GetPointValues As Double()
Return Value
Type: Double[]
An array containing all the extra point values in this point cloud.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace