RhinoCommon API
TextFields.PageName Method
 Return the current layout page name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string PageName()
Public Shared Function PageName As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.PageName"]
See Also
Reference
TextFields Class
PageName Overload
Rhino.Runtime Namespace