RhinoCommon API
VolumeMassProperties.Transform Method
 On input, this contains the mass properties for some geometry G. On exit, this contains the mass properties for the transformed geometry xform(G).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
 The transformation. When computing volumne mass properties, transform must be an affine transformation, or IsAffine. When computing area mass properties, transform must be a similarity transformation, or IsSimilarity(Double). Perspective transformations are not allowed.
Return Value
Type: Boolean
 True if successful, false otherwise.
Remarks
 The Area of a transformed object can not be calculated from the area of the original object if the transform is not a similarity, like a non-uniform scaling.
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace