RhinoCommon API
LengthValue.Length Method
 Length value in this instance's current unit system
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Length()
Public Function Length As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.LengthValue.Length"]
See Also
Reference
LengthValue Class
Length Overload
Rhino Namespace