RhinoCommon API
Extrusion.CreateBoxExtrusion Method
 Gets an extrusion from a box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Extrusion CreateBoxExtrusion(
	Box box,
	bool cap = true
)
Public Shared Function CreateBoxExtrusion (
	box As Box,
	Optional cap As Boolean = true
) As Extrusion
Parameters
box
Type: Rhino.Geometry.Box
IsValid must be true.
cap (Optional)
Type: System.Boolean
If true, the base and the top of the box will be capped. Defaults to true.
Return Value
Type: Extrusion
Extrusion on success. null on failure.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace