RhinoCommon API
RhinoList<T>.RemoveAt Method
 Removes the element at the specified index of the List.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RemoveAt(
	int index
)
Public Sub RemoveAt (
	index As Integer
)
Parameters
index
Type: System.Int32
The zero-based index of the element to remove.
Implements
IList<T>.RemoveAt(Int32)
IList.RemoveAt(Int32)
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace