RhinoCommon API
RenderMaterial.SimulateMaterial Method (Boolean)
Note: This API is now obsolete.
 Call this function to receive the simulation for a RenderMaterial used by the display and other rendering engines.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Incorrect spelling - use ToMaterial instead, and don't override this virtual function")]
public virtual Material SimulateMaterial(
	bool isForDataOnly
)
<ObsoleteAttribute("Incorrect spelling - use ToMaterial instead, and don't override this virtual function")>
Public Overridable Function SimulateMaterial (
	isForDataOnly As Boolean
) As Material
Parameters
isForDataOnly
Type: System.Boolean
Called when only asking for a hash - don't write any textures to the disk - just provide the filenames they will get.
Return Value
Type: Material
The simulation of the render material
See Also
Reference
RenderMaterial Class
SimulateMaterial Overload
Rhino.Render Namespace