RhinoCommon API
CommonObject.FromBase64String Method
 Create a CommonObject instance from a Base64 encoded string. This is typically the values used when passing common objects around as JSON data
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static CommonObject FromBase64String(
	int archive3dm,
	int opennurbs,
	string base64Data
)
Public Shared Function FromBase64String (
	archive3dm As Integer,
	opennurbs As Integer,
	base64Data As String
) As CommonObject
Parameters
archive3dm
Type: System.Int32
[Missing <param name="archive3dm"/> documentation for "M:Rhino.Runtime.CommonObject.FromBase64String(System.Int32,System.Int32,System.String)"]
opennurbs
Type: System.Int32
[Missing <param name="opennurbs"/> documentation for "M:Rhino.Runtime.CommonObject.FromBase64String(System.Int32,System.Int32,System.String)"]
base64Data
Type: System.String
[Missing <param name="base64Data"/> documentation for "M:Rhino.Runtime.CommonObject.FromBase64String(System.Int32,System.Int32,System.String)"]
Return Value
Type: CommonObject
[Missing <returns> documentation for "M:Rhino.Runtime.CommonObject.FromBase64String(System.Int32,System.Int32,System.String)"]
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace