RhinoCommon API
OrdinateDimension.Get3dPoints Method
 Get locations of dimension's 3d points
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Get3dPoints(
	out Point3d basepoint,
	out Point3d defpoint,
	out Point3d leaderpoint,
	out Point3d kinkpoint1,
	out Point3d kinkpoint2
)
Public Function Get3dPoints (
	<OutAttribute> ByRef basepoint As Point3d,
	<OutAttribute> ByRef defpoint As Point3d,
	<OutAttribute> ByRef leaderpoint As Point3d,
	<OutAttribute> ByRef kinkpoint1 As Point3d,
	<OutAttribute> ByRef kinkpoint2 As Point3d
) As Boolean
Parameters
basepoint
Type: Rhino.Geometry.Point3d
Dimension's base point
defpoint
Type: Rhino.Geometry.Point3d
Dimension's definition point
leaderpoint
Type: Rhino.Geometry.Point3d
Point at tail of leader
kinkpoint1
Type: Rhino.Geometry.Point3d
Point at first jog
kinkpoint2
Type: Rhino.Geometry.Point3d
Point at second jog
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.OrdinateDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)"]
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace