RhinoCommon API
File3dmObjectTable.GetBoundingBox Method
Gets the bounding box containing every object in this table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox GetBoundingBox()
Public Function GetBoundingBox As BoundingBox
Return Value
Type: BoundingBox
The computed bounding box.
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace