RhinoCommon API
WorldMapDayNight.SetTimeInfo Method
[Missing <summary> documentation for "M:Rhino.Render.UI.WorldMapDayNight.SetTimeInfo(System.DateTime,System.Double,System.Int32,System.Boolean)"]
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetTimeInfo(
	DateTime dt,
	double timezone,
	int daylightSavingMinutes,
	bool bDaylightSavingsOn
)
Public Sub SetTimeInfo (
	dt As DateTime,
	timezone As Double,
	daylightSavingMinutes As Integer,
	bDaylightSavingsOn As Boolean
)
Parameters
dt
Type: System.DateTime
[Missing <param name="dt"/> documentation for "M:Rhino.Render.UI.WorldMapDayNight.SetTimeInfo(System.DateTime,System.Double,System.Int32,System.Boolean)"]
timezone
Type: System.Double
[Missing <param name="timezone"/> documentation for "M:Rhino.Render.UI.WorldMapDayNight.SetTimeInfo(System.DateTime,System.Double,System.Int32,System.Boolean)"]
daylightSavingMinutes
Type: System.Int32
[Missing <param name="daylightSavingMinutes"/> documentation for "M:Rhino.Render.UI.WorldMapDayNight.SetTimeInfo(System.DateTime,System.Double,System.Int32,System.Boolean)"]
bDaylightSavingsOn
Type: System.Boolean
[Missing <param name="bDaylightSavingsOn"/> documentation for "M:Rhino.Render.UI.WorldMapDayNight.SetTimeInfo(System.DateTime,System.Double,System.Int32,System.Boolean)"]
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace