RhinoCommon API
UserData.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
UserData Class
Dispose Overload
Rhino.DocObjects.Custom Namespace