RhinoCommon API
NurbsCurve.CreateFromArc Method (Arc, Int32, Int32)
 Create a uniform non-rational cubic NURBS approximation of an arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static NurbsCurve CreateFromArc(
	Arc arc,
	int degree,
	int cvCount
)
Public Shared Function CreateFromArc (
	arc As Arc,
	degree As Integer,
	cvCount As Integer
) As NurbsCurve
Parameters
arc
Type: Rhino.Geometry.Arc
[Missing <param name="arc"/> documentation for "M:Rhino.Geometry.NurbsCurve.CreateFromArc(Rhino.Geometry.Arc,System.Int32,System.Int32)"]
degree
Type: System.Int32
>=1
cvCount
Type: System.Int32
CV count >=5
Return Value
Type: NurbsCurve
NURBS curve approximation of an arc on success
See Also
Reference
NurbsCurve Class
CreateFromArc Overload
Rhino.Geometry Namespace