RhinoCommon API
AsyncRenderContext Constructor
Initializes a new instance of the AsyncRenderContext class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected AsyncRenderContext()
Protected Sub New
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace