RhinoCommon API
File3dmRenderMaterial.ToMaterial Method
 Get a simulated material that approximates this material's appearance.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Material ToMaterial()
Public Function ToMaterial As Material
Return Value
Type: Material
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderMaterial.ToMaterial"]
See Also
Reference
File3dmRenderMaterial Class
Rhino.FileIO Namespace