RhinoCommon API
Mesh.ComputeCurvatureApproximation Method
 Compute an approximation of the discrete curvatures of the mesh vertices, according to which type of curvature information is requested. This method will not yield meaningful values on nonmanifold vertices, and nan on naked vertices. For now, this method operates solely on the mesh topology (the fully welded mesh), but distribtes the result across all the ordinary vertices. This method is a const and thread-safe method and will leave the m_K array untouched. An integer indicating which curvature is desired. gaussian_curvature = 1, mean_curvature = 2, minimum unsigned radius of curvature = 3, maximum unsigned radius of curvature = 4 Resulting curvature array on success, null on failure. On success, the length of the array is the number of vertices.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public bool ComputeCurvatureApproximation(
	int type,
	out double[] perVertexCurvatures
)
Public Function ComputeCurvatureApproximation (
	type As Integer,
	<OutAttribute> ByRef perVertexCurvatures As Double()
) As Boolean
Parameters
type
Type: System.Int32
[Missing <param name="type"/> documentation for "M:Rhino.Geometry.Mesh.ComputeCurvatureApproximation(System.Int32,System.Double[]@)"]
perVertexCurvatures
Type: System.Double[]
[Missing <param name="perVertexCurvatures"/> documentation for "M:Rhino.Geometry.Mesh.ComputeCurvatureApproximation(System.Int32,System.Double[]@)"]
Return Value
Type: Boolean
True on success and false on failure.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace