RhinoCommon API
Polyline.Duplicate Method
 Returns a deep copy of this polyline instance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Polyline Duplicate()
Public Function Duplicate As Polyline
Return Value
Type: Polyline
The duplicated polyline.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace