RhinoCommon API
Surface.LocalClosestPoint Method
 Find parameters of the point on a surface that is locally closest to the testPoint. The search for a local close point starts at seed parameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public bool LocalClosestPoint(
	Point3d testPoint,
	double seedU,
	double seedV,
	out double u,
	out double v
)
Public Function LocalClosestPoint (
	testPoint As Point3d,
	seedU As Double,
	seedV As Double,
	<OutAttribute> ByRef u As Double,
	<OutAttribute> ByRef v As Double
) As Boolean
Parameters
testPoint
Type: Rhino.Geometry.Point3d
A point to test against.
seedU
Type: System.Double
The seed parameter in the U direction.
seedV
Type: System.Double
The seed parameter in the V direction.
u
Type: System.Double
U parameter of the surface that is closest to testPoint.
v
Type: System.Double
V parameter of the surface that is closest to testPoint.
Return Value
Type: Boolean
true if the search is successful, false if the search fails.
See Also
Reference
Surface Class
Rhino.Geometry Namespace