RhinoCommon API
DetailViewObject.TryGetPaperLength Method
 Converts a paper length into a model length.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.17
Syntax
public bool TryGetPaperLength(
	double model,
	out double paper
)
Public Function TryGetPaperLength (
	model As Double,
	<OutAttribute> ByRef paper As Double
) As Boolean
Parameters
model
Type: System.Double
[Missing <param name="model"/> documentation for "M:Rhino.DocObjects.DetailViewObject.TryGetPaperLength(System.Double,System.Double@)"]
paper
Type: System.Double
[Missing <param name="paper"/> documentation for "M:Rhino.DocObjects.DetailViewObject.TryGetPaperLength(System.Double,System.Double@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.DetailViewObject.TryGetPaperLength(System.Double,System.Double@)"]
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace