RhinoCommon API
BoundingBox.Union Method (Point3d)
 Updates this BoundingBox to represent the union of itself and a point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Union(
	Point3d point
)
Public Sub Union (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to include in the union.
Remarks
If this bounding box is InValid then the union will be the BoundingBox containing only the point. If the point is InValid, this BoundingBox will remain unchanged.
See Also
Reference
BoundingBox Structure
Union Overload
Rhino.Geometry Namespace