RhinoCommon API
SubDEdgeChain Constructor (SubD)
 Creates an empty chain in the given SubD.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDEdgeChain(
	SubD subd
)
Public Sub New (
	subd As SubD
)
Parameters
subd
Type: Rhino.Geometry.SubD
The SubD the chain will run through.
See Also
Reference
SubDEdgeChain Class
SubDEdgeChain Overload
Rhino.Geometry Namespace