RhinoCommon API
Delegates Constructor
Initializes a new instance of the Delegates class
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Delegates()
Public Sub New
See Also
Reference
Delegates Class
Rhino.UI.Controls Namespace