RhinoCommon API
SnapShotsClient.SupportsDocument Method
 Defines if the client supports document user data or not
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool SupportsDocument()
Public MustOverride Function SupportsDocument As Boolean
Return Value
Type: Boolean
 true if the client saves/restores document user data.
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace