RhinoCommon API
SimpleArrayBrepPointer.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SimpleArrayBrepPointer Class
Dispose Overload
Rhino.Runtime.InteropWrappers Namespace