RhinoCommon API
RenderPipeline.GetRenderWindow Method (Boolean, Boolean)
 As GetRenderWindow(). The parameter withWireframeChannel controls whether the returned RenderWindow will have the channel added. The parameter fromRenderViewSource controls from where the RenderSize is queried.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderWindow GetRenderWindow(
	bool withWireframeChannel,
	bool fromRenderViewSource
)
Public Function GetRenderWindow (
	withWireframeChannel As Boolean,
	fromRenderViewSource As Boolean
) As RenderWindow
Parameters
withWireframeChannel
Type: System.Boolean
true if the RenderWindow needs to have a wireframe channel.
fromRenderViewSource
Type: System.Boolean
true if the RenderWindow size needs to be set from RenderViewSource size. false will use the active view.
Return Value
Type: RenderWindow
RenderWindow if one exists, null otherwise (i.e. rendering has already completed).
See Also
Reference
RenderPipeline Class
GetRenderWindow Overload
Rhino.Render Namespace