RhinoCommon API
RhinoPageView.GetPreviewImage Method
 Creates a preview image of the page.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Bitmap GetPreviewImage(
	Size size,
	bool grayScale
)
Public Function GetPreviewImage (
	size As Size,
	grayScale As Boolean
) As Bitmap
Parameters
size
Type: System.Drawing.Size
The size of the preview image.
grayScale
Type: System.Boolean
Set true to produce a grayscale image, false to produce a color image.
Return Value
Type: Bitmap
A bitmap if successful, null otherwise.
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace