RhinoCommon API
FileAi.Read Method
Read a Ai file into a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	FileAiReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As FileAiReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.FileAiReadOptions
options used for importing the Ai file
Return Value
Type: Boolean
true on success
See Also
Reference
FileAi Class
Rhino.FileIO Namespace