RhinoCommon API
Worksession.Detach Method (IEnumerable<UInt32>)
 Detaches several reference models from this worksession.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Detach(
	IEnumerable<uint> modelSerialNumbers
)
Public Function Detach (
	modelSerialNumbers As IEnumerable(Of UInteger)
) As Boolean
Parameters
modelSerialNumbers
Type: System.Collections.Generic.IEnumerable<UInt32>
 The reference models' serial numbers, from SerialNumber.
Return Value
Type: Boolean
True if at least one model was detached, false otherwise.
See Also
Reference
Worksession Class
Detach Overload
Rhino.DocObjects Namespace