RhinoCommon API
FileStl.Read Method
Read a STL file into a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	FileStlReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As FileStlReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.FileStlReadOptions
options used for importing the STL file
Return Value
Type: Boolean
true on success
See Also
Reference
FileStl Class
Rhino.FileIO Namespace