RhinoCommon API
ObjectTable.DeleteGrip Method (GripObject)
 Deletes a grip object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public bool DeleteGrip(
	GripObject grip
)
Public Function DeleteGrip (
	grip As GripObject
) As Boolean
Parameters
grip
Type: Rhino.DocObjects.GripObject
The grip object to delete.
Return Value
Type: Boolean
True on success.
See Also
Reference
ObjectTable Class
DeleteGrip Overload
Rhino.DocObjects.Tables Namespace