RhinoCommon API
ViewUserInterfaceTable.Add Method (UserInterfaceObjectBase)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Add(Rhino.UI.UserInterfaceObjectBase)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Add(
	UserInterfaceObjectBase item
)
Public Function Add (
	item As UserInterfaceObjectBase
) As Boolean
Parameters
item
Type: Rhino.UI.UserInterfaceObjectBase
[Missing <param name="item"/> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Add(Rhino.UI.UserInterfaceObjectBase)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Add(Rhino.UI.UserInterfaceObjectBase)"]
See Also
Reference
ViewUserInterfaceTable Class
Add Overload
Rhino.DocObjects.Tables Namespace