RhinoCommon API
NurbsCurve.CreatePlanarRailFrames Method
 Computes planar rail sweep frames at specified parameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Plane[] CreatePlanarRailFrames(
	IEnumerable<double> parameters,
	Vector3d normal
)
Public Function CreatePlanarRailFrames (
	parameters As IEnumerable(Of Double),
	normal As Vector3d
) As Plane()
Parameters
parameters
Type: System.Collections.Generic.IEnumerable<Double>
A collection of curve parameters.
normal
Type: Rhino.Geometry.Vector3d
Unit normal to the plane.
Return Value
Type: Plane[]
An array of planes if successful, or an empty array on failure.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace