RhinoCommon API
SubDSurfaceInterpolator.InterpolatedVertexCount Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDSurfaceInterpolator.InterpolatedVertexCount"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public uint InterpolatedVertexCount()
Public Function InterpolatedVertexCount As UInteger
Return Value
Type: UInt32
Number of vertices with interpolated surface points.
See Also
Reference
SubDSurfaceInterpolator Class
Rhino.Geometry Namespace