RhinoCommon API
NurbsSurface.MakeUniform Method
 Changes a NURBS surface so each control point affects the surface exactly the same way. This make the knot vectors uniform without changing the control point locations. This will change the object shape slightly.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.24
Syntax
public bool MakeUniform(
	int direction
)
Public Function MakeUniform (
	direction As Integer
) As Boolean
Parameters
direction
Type: System.Int32
 Specify 0 for "u" direction, 1 for "v" direction, or 2 for both directions.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace