RhinoCommon API
FilePdf.AddPage Method (Int32, Int32, Int32)
 Add a blank page to this document
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public abstract int AddPage(
	int widthInDots,
	int heightInDots,
	int dotsPerInch
)
Public MustOverride Function AddPage (
	widthInDots As Integer,
	heightInDots As Integer,
	dotsPerInch As Integer
) As Integer
Parameters
widthInDots
Type: System.Int32
[Missing <param name="widthInDots"/> documentation for "M:Rhino.FileIO.FilePdf.AddPage(System.Int32,System.Int32,System.Int32)"]
heightInDots
Type: System.Int32
[Missing <param name="heightInDots"/> documentation for "M:Rhino.FileIO.FilePdf.AddPage(System.Int32,System.Int32,System.Int32)"]
dotsPerInch
Type: System.Int32
[Missing <param name="dotsPerInch"/> documentation for "M:Rhino.FileIO.FilePdf.AddPage(System.Int32,System.Int32,System.Int32)"]
Return Value
Type: Int32
page number on success
See Also
Reference
FilePdf Class
AddPage Overload
Rhino.FileIO Namespace