RhinoCommon API
FieldDictionary.AddTextured Method (String, Point3d, String, Boolean, Int32)
 Add a new Point3dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Point3dField AddTextured(
	string key,
	Point3d value,
	string prompt,
	bool treatAsLinear,
	int sectionId
)
Public Function AddTextured (
	key As String,
	value As Point3d,
	prompt As String,
	treatAsLinear As Boolean,
	sectionId As Integer
) As Point3dField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: Rhino.Geometry.Point3d
Initial value for this field.
prompt
Type: System.String
 Prompt to display in the user interface (Content Browsers) if this is null or an empty string the this field is a data only field and will not appear in the user interface.
treatAsLinear
Type: System.Boolean
Determines whether the texture in this slot will be treated as linear by rendering engines (ie - not gamma packed).
sectionId
Type: System.Int32
The id of the section containing the field
Return Value
Type: Point3dField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Geometry.Point3d,System.String,System.Boolean,System.Int32)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
AddTextured Overload
Rhino.Render.Fields Namespace