RhinoCommon API
RenderPlugIn.ShowDecalProperties Method
 Override this function to handle showing a modal dialog with your plug-in's custom decal properties. You will be passed the current properties for the object being edited. The defaults will be set in InitializeDecalProperties.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool ShowDecalProperties(
	ref List<NamedValue> properties
)
Protected Overridable Function ShowDecalProperties (
	ByRef properties As List(Of NamedValue)
) As Boolean
Parameters
properties
Type: System.Collections.Generic.List<NamedValue>
A list of named values that will be stored on the object the input values are the current ones, you should modify the values after the dialog closes.
Return Value
Type: Boolean
true if the user pressed "OK", otherwise false.
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace