RhinoCommon API
NamedParametersEventArgs.TryGetGeometry Method
[Missing <summary> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetGeometry(System.String,Rhino.Geometry.GeometryBase[]@)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool TryGetGeometry(
	string name,
	out GeometryBase[] values
)
Public Function TryGetGeometry (
	name As String,
	<OutAttribute> ByRef values As GeometryBase()
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetGeometry(System.String,Rhino.Geometry.GeometryBase[]@)"]
values
Type: Rhino.Geometry.GeometryBase[]
[Missing <param name="values"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetGeometry(System.String,Rhino.Geometry.GeometryBase[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetGeometry(System.String,Rhino.Geometry.GeometryBase[]@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace