RhinoCommon API
SectionStyleTable.Add Method
 Adds a new section style with specified definition to the table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Add(
	SectionStyle sectionstyle
)
Public Function Add (
	sectionstyle As SectionStyle
) As Integer
Parameters
sectionstyle
Type: Rhino.DocObjects.SectionStyle
 Definition of new section style. The information in sectionstyle is copied. If sectionstyle.Name is empty then a unique name of the form "SectionStyle 01" will be automatically created.
Return Value
Type: Int32
 Index of new section style type or -1 on error.
See Also
Reference
SectionStyleTable Class
Rhino.DocObjects.Tables Namespace