RhinoCommon API
Brep.ReplaceEdge Method
 Re-trims the given edges of this single-face Brep, replacing each deleted edge with new boundary geometry. This is the SDK equivalent of the ReplaceEdge command.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Brep ReplaceEdge(
	IEnumerable<int> edgeIndices,
	BrepReplaceEdgeMethod method,
	Curve replacementCurve,
	double tolerance
)
Public Function ReplaceEdge (
	edgeIndices As IEnumerable(Of Integer),
	method As BrepReplaceEdgeMethod,
	replacementCurve As Curve,
	tolerance As Double
) As Brep
Parameters
edgeIndices
Type: System.Collections.Generic.IEnumerable<Int32>
The indices of the edges to replace.
method
Type: Rhino.Geometry.BrepReplaceEdgeMethod
How the deleted edges are re-trimmed.
replacementCurve
Type: Rhino.Geometry.Curve
 The curve used to re-trim when method is Curve; ignored (may be null) otherwise.
tolerance
Type: System.Double
The tolerance. When in doubt, use the document's model absolute tolerance.
Return Value
Type: Brep
The modified Brep if successful, null otherwise (for example, if this Brep has more than one face).
See Also
Reference
Brep Class
Rhino.Geometry Namespace