RhinoCommon API
UserInterfaceRadioButton Constructor (String)
Initializes a new instance of the UserInterfaceRadioButton class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceRadioButton(
	string text
)
Public Sub New (
	text As String
)
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.UI.UserInterfaceRadioButton.#ctor(System.String)"]
See Also
Reference
UserInterfaceRadioButton Class
UserInterfaceRadioButton Overload
Rhino.UI Namespace