RhinoCommon API
RenderWindow.ChannelGPU.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace