RhinoCommon API
RenderTexture.GetRotation Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetRotation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual Vector3d GetRotation()
Public Overridable Function GetRotation As Vector3d
Return Value
Type: Vector3d
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetRotation"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace