RhinoCommon API
Brep.CreateTrimmedSurface Method (BrepFace, Surface)
Note: This API is now obsolete.
 Constructs a Brep using the trimming information of a brep face and a surface. Surface must be roughly the same shape and in the same location as the trimming brep face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use version that takes tolerance as input")]
public static Brep CreateTrimmedSurface(
	BrepFace trimSource,
	Surface surfaceSource
)
<ObsoleteAttribute("Use version that takes tolerance as input")>
Public Shared Function CreateTrimmedSurface (
	trimSource As BrepFace,
	surfaceSource As Surface
) As Brep
Parameters
trimSource
Type: Rhino.Geometry.BrepFace
BrepFace which contains trimmingSource brep.
surfaceSource
Type: Rhino.Geometry.Surface
Surface that trims of BrepFace will be applied to.
Return Value
Type: Brep
A brep with the shape of surfaceSource and the trims of trimSource or null on failure.
See Also
Reference
Brep Class
CreateTrimmedSurface Overload
Rhino.Geometry Namespace