RhinoCommon API
TextFields.CurveLength Method (String)
 Get length of a curve given a string id
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static double CurveLength(
	string id
)
Public Shared Function CurveLength (
	id As String
) As Double
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.CurveLength(System.String)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.CurveLength(System.String)"]
See Also
Reference
TextFields Class
CurveLength Overload
Rhino.Runtime Namespace