RhinoCommon API
RenderContentCollection.GetSearchPattern Method
 See SetSearchPattern
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string GetSearchPattern()
Public Function GetSearchPattern As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.RenderContentCollection.GetSearchPattern"]
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace