RhinoCommon API
SupportOptions.UseRenderedPreview Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.UseRenderedPreview"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool UseRenderedPreview()
Public Shared Function UseRenderedPreview As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.UseRenderedPreview"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace