RhinoCommon API
SectionStyleTable.Find Method (Guid, Boolean)
Finds a section style with a matching ID.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Find(
	Guid id,
	bool ignoreDeletedSectionStyles
)
Public Function Find (
	id As Guid,
	ignoreDeletedSectionStyles As Boolean
) As Integer
Parameters
id
Type: System.Guid
The ID of the section style to be found.
ignoreDeletedSectionStyles
Type: System.Boolean
 If true, deleted section styles are not checked.
Return Value
Type: Int32
 If the section style was found, the section style index, >=0, is returned. If the section style was not found, -1 is returned.
See Also
Reference
SectionStyleTable Class
Find Overload
Rhino.DocObjects.Tables Namespace