RhinoCommon API
Vector3d.CrossProduct Method
 Computes the cross product (or vector product, or exterior product) of two vectors.
This operation is not commutative.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector3d CrossProduct(
	Vector3d a,
	Vector3d b
)
Public Shared Function CrossProduct (
	a As Vector3d,
	b As Vector3d
) As Vector3d
Parameters
a
Type: Rhino.Geometry.Vector3d
First vector.
b
Type: Rhino.Geometry.Vector3d
Second vector.
Return Value
Type: Vector3d
A new vector that is perpendicular to both a and b,
has Length == a.Length * b.Length * sin(theta) where theta is the angle between a and b.
The resulting vector is oriented according to the right hand rule.
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace