RhinoCommon API
MeshFaceList.RemoveAt Method (Int32, Boolean)
 Removes a face from the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.6
Syntax
public void RemoveAt(
	int index,
	bool compact
)
Public Sub RemoveAt (
	index As Integer,
	compact As Boolean
)
Parameters
index
Type: System.Int32
The index of the face that will be removed.
compact
Type: System.Boolean
If true, removes vertices that are no longer referenced.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If index is < 0 or >= Count.
See Also
Reference
MeshFaceList Class
RemoveAt Overload
Rhino.Geometry.Collections Namespace