RhinoCommon API
GetBaseClass.AcceptEnterWhenDone Method
 There are instances of RhinoGet that prompt with "Press Enter when Done." yet do not call AcceptNothing(). On the Mac, these instances need an additional call to AcceptEnterWhenDone() so the GetPointOptions dialog can correctly enable the Done button.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void AcceptEnterWhenDone(
	bool enable
)
Public Sub AcceptEnterWhenDone (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
[Missing <param name="enable"/> documentation for "M:Rhino.Input.Custom.GetBaseClass.AcceptEnterWhenDone(System.Boolean)"]
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace