RhinoCommon API
PlugIn.FlushSettingsSavedQueue Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.FlushSettingsSavedQueue"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void FlushSettingsSavedQueue()
Public Shared Sub FlushSettingsSavedQueue
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace