RhinoCommon API
LicenseUtils.LoginToCloudZoo Method
[Missing <summary> documentation for "M:Rhino.PlugIns.LicenseUtils.LoginToCloudZoo"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool LoginToCloudZoo()
Public Shared Function LoginToCloudZoo As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.LoginToCloudZoo"]
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace