RhinoCommon API
ContentUI.IsCreated Method
 Returns true if the UI is created, else false
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public virtual bool IsCreated()
Public Overridable Function IsCreated As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.ContentUI.IsCreated"]
See Also
Reference
ContentUI Class
Rhino.UI.Controls Namespace