RhinoCommon API
PostEffectCollection.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.Finalize"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
PostEffectCollection Class
Rhino.Render.PostEffects Namespace