RhinoCommon API
GetBaseClass.Color Method
Gets a color if Get*() returns GetResult.Color.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color Color()
Public Function Color As Color
Return Value
Type: Color
The color chosen by the user.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace