RhinoCommon API
DisplayPipeline.DrawLinesNoClip Method
 Draws a multiple lines. This version of line drawing will draw the segments of the line that extend beyond the near and far planes of the view frustum with depths on those planes
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public void DrawLinesNoClip(
	IEnumerable<Line> lines,
	Color color,
	int thickness
)
Public Sub DrawLinesNoClip (
	lines As IEnumerable(Of Line),
	color As Color,
	thickness As Integer
)
Parameters
lines
Type: System.Collections.Generic.IEnumerable<Line>
the lines to draw
color
Type: System.Drawing.Color
Color to draw lines in
thickness
Type: System.Int32
Thickness (in pixels) of lines
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace