RhinoCommon API
ContentUI.ContentUIHolder Method
 Returns the holder that contains the UI sections, if this is an expandable content UI with sections inside holders. Returns null for custom UIs.
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public virtual ICollapsibleSectionHolder ContentUIHolder()
Public Overridable Function ContentUIHolder As ICollapsibleSectionHolder
Return Value
Type: ICollapsibleSectionHolder
[Missing <returns> documentation for "M:Rhino.UI.Controls.ContentUI.ContentUIHolder"]
See Also
Reference
ContentUI Class
Rhino.UI.Controls Namespace