RhinoCommon API
SubD.OnSwitchToNonConst Method
 Called when this object switches from being considered "owned by the document" to being an independent instance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void OnSwitchToNonConst()
Protected Overrides Sub OnSwitchToNonConst
See Also
Reference
SubD Class
Rhino.Geometry Namespace