RhinoCommon API
DisplayPipeline.DrawObject Method (RhinoObject)
 Draws a RhinoObject.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DrawObject(
	RhinoObject rhinoObject
)
Public Sub DrawObject (
	rhinoObject As RhinoObject
)
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
The Rhino object.
See Also
Reference
DisplayPipeline Class
DrawObject Overload
Rhino.Display Namespace