RhinoCommon API
StdVectorOfSharedPtrToMesh Constructor
 Initializes a new StdVectorOfSharedPtrToMesh instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public StdVectorOfSharedPtrToMesh()
Public Sub New
See Also
Reference
StdVectorOfSharedPtrToMesh Class
Rhino.Runtime.InteropWrappers Namespace