RhinoCommon API
Layer.SetPersistentLocking Method
 Set the persistent locking setting for this layer
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.5
Syntax
public void SetPersistentLocking(
	bool persistentLocking
)
Public Sub SetPersistentLocking (
	persistentLocking As Boolean
)
Parameters
persistentLocking
Type: System.Boolean
[Missing <param name="persistentLocking"/> documentation for "M:Rhino.DocObjects.Layer.SetPersistentLocking(System.Boolean)"]
See Also
Reference
Layer Class
Rhino.DocObjects Namespace