RhinoCommon API
BinaryArchiveWriter.WritePoint2d Method
 Writes a Point2d value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WritePoint2d(
	Point2d value
)
Public Sub WritePoint2d (
	value As Point2d
)
Parameters
value
Type: Rhino.Geometry.Point2d
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace