RhinoCommon API
SubDEdgeSharpness Constructor (Double, Double)
 Creates a sharpness that varies from one end of the edge to the other.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDEdgeSharpness(
	double sharpness0,
	double sharpness1
)
Public Sub New (
	sharpness0 As Double,
	sharpness1 As Double
)
Parameters
sharpness0
Type: System.Double
 Sharpness at the start of the edge, between 0.0 and MaximumValue.
sharpness1
Type: System.Double
 Sharpness at the end of the edge, between 0.0 and MaximumValue.
Remarks
 If either value is not valid, the result is Nan. Passing CreaseValue for both values gives Crease.
See Also
Reference
SubDEdgeSharpness Structure
SubDEdgeSharpness Overload
Rhino.Geometry Namespace