RhinoCommon API
RenderPrimitiveList.Mesh Method
 Get the mesh for the primitive at the specified index. If the item at this index is a primitive type other than a mesh then it mesh representation is returned.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public Mesh Mesh(
	int index
)
Public Function Mesh (
	index As Integer
) As Mesh
Parameters
index
Type: System.Int32
 The zero based index of the item in the list. Valid values are greater than or equal to 0 and less than Count.
Return Value
Type: Mesh
 Returns the mesh for the primitive at the specified index. If the item at this index is a primitive type other than a mesh then it mesh representation is returned.
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace