RhinoCommon API
Notification.ExecuteAssemblyProtectedCode Method (Action)
 If a Notification object is only allowed to be modified by certain assemblies, then any code that interacts with it must be wrapped around this method, or a InvalidOperationException will be thrown. For performance reasons, the code wrapped by this method should be kept as simple as possible.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static void ExecuteAssemblyProtectedCode(
	Action action
)
Public Shared Sub ExecuteAssemblyProtectedCode (
	action As Action
)
Parameters
action
Type: System.Action
The code to run that modifies one or more notification objects
Remarks
This method is not thread-safe and should only be manipulated in UI thread.
See Also
Reference
Notification Class
ExecuteAssemblyProtectedCode Overload
Rhino.Runtime.Notifications Namespace