RhinoCommon API
RenderContent.DeleteChild Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.DeleteChild(System.String,Rhino.Render.RenderContent.ChangeContexts)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public bool DeleteChild(
	string childSlotName,
	RenderContent.ChangeContexts changeContexts
)
Public Function DeleteChild (
	childSlotName As String,
	changeContexts As RenderContent.ChangeContexts
) As Boolean
Parameters
childSlotName
Type: System.String
[Missing <param name="childSlotName"/> documentation for "M:Rhino.Render.RenderContent.DeleteChild(System.String,Rhino.Render.RenderContent.ChangeContexts)"]
changeContexts
Type: Rhino.Render.RenderContent.ChangeContexts
[Missing <param name="changeContexts"/> documentation for "M:Rhino.Render.RenderContent.DeleteChild(System.String,Rhino.Render.RenderContent.ChangeContexts)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.DeleteChild(System.String,Rhino.Render.RenderContent.ChangeContexts)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace