RhinoCommon API
FilePdf.Create Method
 Create a new instance of a FilePdf class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static FilePdf Create()
Public Shared Function Create As FilePdf
Return Value
Type: FilePdf
[Missing <returns> documentation for "M:Rhino.FileIO.FilePdf.Create"]
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace