RhinoCommon API
LayerTable.Sort Method
 Updates the layer sort order
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Sort(
	IEnumerable<int> layerIndices
)
Public Sub Sort (
	layerIndices As IEnumerable(Of Integer)
)
Parameters
layerIndices
Type: System.Collections.Generic.IEnumerable<Int32>
The sort order.
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace