RhinoCommon API
ColorHSV.CreateFromLCH Method
 Create the nearest HSV equivalent of a LCH color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ColorHSV CreateFromLCH(
	ColorLCH lch
)
Public Shared Function CreateFromLCH (
	lch As ColorLCH
) As ColorHSV
Parameters
lch
Type: Rhino.Display.ColorLCH
Target color in LCH space.
Return Value
Type: ColorHSV
The HSV equivalent of the LCH color.
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace