RhinoCommon API
Surface.IsClosed Method
 Gets a value indicating if the surface is closed in a direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsClosed(
	int direction
)
Public Function IsClosed (
	direction As Integer
) As Boolean
Parameters
direction
Type: System.Int32
0 = U, 1 = V.
Return Value
Type: Boolean
The indicating boolean value.
See Also
Reference
Surface Class
Rhino.Geometry Namespace