RhinoCommon API
SubDEdgeSharpness.EndSharpness Method
 Gets the sharpness at the start or the end of the edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public double EndSharpness(
	int endIndex
)
Public Function EndSharpness (
	endIndex As Integer
) As Double
Parameters
endIndex
Type: System.Int32
0 for the start of the edge, 1 for the end.
Return Value
Type: Double
The sharpness, or NaN if endIndex is out of range.
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace