RhinoCommon API
ContentFactory Constructor
Initializes a new instance of the ContentFactory class
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public ContentFactory(
	IntPtr pRdkContentFactory
)
Public Sub New (
	pRdkContentFactory As IntPtr
)
Parameters
pRdkContentFactory
Type: System.IntPtr
[Missing <param name="pRdkContentFactory"/> documentation for "M:Rhino.Render.DataSources.ContentFactory.#ctor(System.IntPtr)"]
See Also
Reference
ContentFactory Class
Rhino.Render.DataSources Namespace