RhinoCommon API
DisplayPipeline.DrawStereoFrameBuffer Method
 Draws the viewport as seen from the left and the right eye viewports and returns the result as OpenGL texture handles.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public bool DrawStereoFrameBuffer(
	ViewportInfo viewportLeft,
	ViewportInfo viewportRight,
	out uint handleLeft,
	out uint handleRight
)
Public Function DrawStereoFrameBuffer (
	viewportLeft As ViewportInfo,
	viewportRight As ViewportInfo,
	<OutAttribute> ByRef handleLeft As UInteger,
	<OutAttribute> ByRef handleRight As UInteger
) As Boolean
Parameters
viewportLeft
Type: Rhino.DocObjects.ViewportInfo
The viewport representing the left eye location and look direction.
viewportRight
Type: Rhino.DocObjects.ViewportInfo
The viewport representing the right eye location and look direction.
handleLeft
Type: System.UInt32
Will contain the OpenGL texture handle which references the left output color buffer.
handleRight
Type: System.UInt32
Will contain the OpenGL texture handle which references the right output color buffer.
Return Value
Type: Boolean
true if drawing succeeded, false otherwise.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace