RhinoCommon API
SupportOptions.SupportSharedUIsNoCache Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SupportSharedUIsNoCache"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool SupportSharedUIsNoCache()
Public Shared Function SupportSharedUIsNoCache As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.SupportSharedUIsNoCache"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace