RhinoCommon API
FileCsvDocument.Save Method (String)
 Writes the document to a file on disk, encoded as UTF-8 with a byte order mark. The mark lets spreadsheet applications (for example Excel on Windows and Mac) detect the encoding rather than falling back to the system code page, which garbles non-ASCII text such as Korean (RH-97173). Use Save(String, Encoding) with new UTF8Encoding(false) to write UTF-8 without a mark.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Save(
	string path
)
Public Sub Save (
	path As String
)
Parameters
path
Type: System.String
The path of the file to write.
See Also
Reference
FileCsvDocument Class
Save Overload
Rhino.FileIO Namespace