RhinoCommon API
PostEffectThreadEngine.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.Finalize"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
PostEffectThreadEngine Class
Rhino.Render.PostEffects Namespace