RhinoCommon API
Localization.LocalizeForm Method
 Look in the dialog item list for the specified key and return the translated localized string if the key is found otherwise return the English string.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void LocalizeForm(
	Object formOrUserControl
)
Public Shared Sub LocalizeForm (
	formOrUserControl As Object
)
Parameters
formOrUserControl
Type: System.Object
[Missing <param name="formOrUserControl"/> documentation for "M:Rhino.UI.Localization.LocalizeForm(System.Object)"]
See Also
Reference
Localization Class
Rhino.UI Namespace