RhinoCommon API
LengthValue.ChangeLength Method
 Changes the numeric value in a LengthValue and leaves all of the other info unchanged UnitSystem, ParseSettings and StringFormat stay as they were
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LengthValue ChangeLength(
	double newLength
)
Public Function ChangeLength (
	newLength As Double
) As LengthValue
Parameters
newLength
Type: System.Double
[Missing <param name="newLength"/> documentation for "M:Rhino.LengthValue.ChangeLength(System.Double)"]
Return Value
Type: LengthValue
A new LengthValue
See Also
Reference
LengthValue Class
Rhino Namespace