RhinoCommon API
SimpleArraySubDPointer Constructor
 Initializes a new SimpleArraySubDPointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public SimpleArraySubDPointer()
Public Sub New
See Also
Reference
SimpleArraySubDPointer Class
Rhino.Runtime.InteropWrappers Namespace