RhinoCommon API
PythonScript Constructor
 Initializes a new instance of the PythonScript class.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected PythonScript()
Protected Sub New
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace