RhinoCommon API
SubDVertexList.Find Method (Int32)
 Find a vertex in this SubD with a given id
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDVertex Find(
	int id
)
Public Function Find (
	id As Integer
) As SubDVertex
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.Geometry.Collections.SubDVertexList.Find(System.Int32)"]
Return Value
Type: SubDVertex
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDVertexList.Find(System.Int32)"]
See Also
Reference
SubDVertexList Class
Find Overload
Rhino.Geometry.Collections Namespace