RhinoCommon API
LicenseUtils.CheckInLicense Method
 Checks in a previously checked out license to the Zoo server from which it was checked out.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool CheckInLicense(
	Guid productId
)
Public Shared Function CheckInLicense (
	productId As Guid
) As Boolean
Parameters
productId
Type: System.Guid
 The Guid of the product that you want to check in.
Return Value
Type: Boolean
 true if the license was checked in successful. false if not successful or on error.
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace