RhinoCommon API
File3dmShutLining.CurvePull Method
 Returns whether the given curve is pulled to the surface before creating the shut-line.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool CurvePull(
	Guid curve_id
)
Public Function CurvePull (
	curve_id As Guid
) As Boolean
Parameters
curve_id
Type: System.Guid
[Missing <param name="curve_id"/> documentation for "M:Rhino.FileIO.File3dmShutLining.CurvePull(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmShutLining.CurvePull(System.Guid)"]
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace