RhinoCommon API
UserDataList.Find Method
 Finds a specific data type in this regulated collection.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public UserData Find(
	Type userdataType
)
Public Function Find (
	userdataType As Type
) As UserData
Parameters
userdataType
Type: System.Type
A data type.
Return Value
Type: UserData
The found data, or null of nothing was found.
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace