RhinoCommon API
DisplayPointSet.Create Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayPointSet.Create(System.Collections.Generic.IEnumerable{Rhino.Display.DisplayPoint})"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static DisplayPointSet Create(
	IEnumerable<DisplayPoint> points
)
Public Shared Function Create (
	points As IEnumerable(Of DisplayPoint)
) As DisplayPointSet
Parameters
points
Type: System.Collections.Generic.IEnumerable<DisplayPoint>
[Missing <param name="points"/> documentation for "M:Rhino.Display.DisplayPointSet.Create(System.Collections.Generic.IEnumerable{Rhino.Display.DisplayPoint})"]
Return Value
Type: DisplayPointSet
[Missing <returns> documentation for "M:Rhino.Display.DisplayPointSet.Create(System.Collections.Generic.IEnumerable{Rhino.Display.DisplayPoint})"]
See Also
Reference
DisplayPointSet Class
Rhino.Display Namespace