RhinoCommon API
SurfaceCurvature.Create Method
 Create a SurfaceCurvature from explicit principal curvatures and the geometric frame at the evaluation point. Use this when you have already computed curvature data from a non-RhinoCommon surface representation (planes, spheres, cylinders, cones, etc.).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static SurfaceCurvature Create(
	double kappa1,
	double kappa2,
	Point2d uv,
	Plane frame
)
Public Shared Function Create (
	kappa1 As Double,
	kappa2 As Double,
	uv As Point2d,
	frame As Plane
) As SurfaceCurvature
Parameters
kappa1
Type: System.Double
Principal curvature with maximum absolute value. Must be a finite number.
kappa2
Type: System.Double
Principal curvature with minimum absolute value. Must be a finite number.
uv
Type: Rhino.Geometry.Point2d
The (u,v) parameter where the curvature was evaluated.
frame
Type: Rhino.Geometry.Plane
 Orthonormal frame at the evaluation point. The origin is the surface point, the X axis is the principal direction associated with kappa1, the Y axis is the principal direction associated with kappa2, and the Z axis is the surface normal.
Return Value
Type: SurfaceCurvature
A SurfaceCurvature instance.
Exceptions
Exception | Condition
ArgumentException | Thrown when a curvature value is not finite, the uv parameter is invalid, or the frame is not a valid plane.
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace