RhinoCommon API
NurbsSurfacePointList.GetWeight Method
 Gets the weight of a control point at the given (u, v) index. Note, if the surface is non-rational, the weight will be 1.0.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double GetWeight(
	int u,
	int v
)
Public Function GetWeight (
	u As Integer,
	v As Integer
) As Double
Parameters
u
Type: System.Int32
Index of control-point along surface U direction.
v
Type: System.Int32
Index of control-point along surface V direction.
Return Value
Type: Double
The control point weight if successful, Rhino.Math.UnsetValue otherwise.
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace