RhinoCommon API
SubD.DeleteComponents Method (IEnumerable<ComponentIndex>, Boolean)
 Deletes components from this SubD, identified by component index.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool DeleteComponents(
	IEnumerable<ComponentIndex> componentIndices,
	bool markDeletedFaceEdges
)
Public Function DeleteComponents (
	componentIndices As IEnumerable(Of ComponentIndex),
	markDeletedFaceEdges As Boolean
) As Boolean
Parameters
componentIndices
Type: System.Collections.Generic.IEnumerable<ComponentIndex>
The component indices to delete.
markDeletedFaceEdges
Type: System.Boolean
 If true, edges that survive the deletion of a face they bounded get their runtime mark set.
Return Value
Type: Boolean
True if the deletion succeeded.
See Also
Reference
SubD Class
DeleteComponents Overload
Rhino.Geometry Namespace