RhinoCommon API
Brep.CutUpSurface Method (Surface, IEnumerable<Curve>, Boolean, Double, Double)
 Splits, or cuts up, a surface. Designed to split the underlying surface of a Brep face with edge curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public static Brep[] CutUpSurface(
	Surface surface,
	IEnumerable<Curve> curves,
	bool flip,
	double fitTolerance,
	double keepTolerance
)
Public Shared Function CutUpSurface (
	surface As Surface,
	curves As IEnumerable(Of Curve),
	flip As Boolean,
	fitTolerance As Double,
	keepTolerance As Double
) As Brep()
Parameters
surface
Type: Rhino.Geometry.Surface
The surface to cut up.
curves
Type: System.Collections.Generic.IEnumerable<Curve>
 The edge curves with consistent orientation. The curves should lie on the surface.
flip
Type: System.Boolean
If true, the input curves are oriented clockwise.
fitTolerance
Type: System.Double
The fitting tolerance.
keepTolerance
Type: System.Double
Used to decide which face to keep. For best results, should be at least 2 * fitTolerance.
Return Value
Type: Brep[]
The Brep pieces if successful, an empty array on failure.
See Also
Reference
Brep Class
CutUpSurface Overload
Rhino.Geometry Namespace