RhinoCommon API
TransformObjectList.Add Method (RhinoObject)
 Add a RhinoObject to this list
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public void Add(
	RhinoObject rhinoObject
)
Public Sub Add (
	rhinoObject As RhinoObject
)
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhinoObject"/> documentation for "M:Rhino.Collections.TransformObjectList.Add(Rhino.DocObjects.RhinoObject)"]
See Also
Reference
TransformObjectList Class
Add Overload
Rhino.Collections Namespace