RhinoCommon API
GumballDisplayConduit.SetBaseGumball Method (GumballObject)
 Contents of the gumball are copied to the base gumball of this class.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetBaseGumball(
	GumballObject gumball
)
Public Sub SetBaseGumball (
	gumball As GumballObject
)
Parameters
gumball
Type: Rhino.UI.Gumball.GumballObject
The gumball source.
See Also
Reference
GumballDisplayConduit Class
SetBaseGumball Overload
Rhino.UI.Gumball Namespace