RhinoCommon API
RhinoSettings.Dispose Method
Releases all resources used by the RhinoSettings
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace