RhinoCommon API
Transform2d.ToTransform Method
 Gets the 4x4 transformation that applies this 2d transformation to the x and y coordinates and leaves the z coordinate unchanged.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Transform ToTransform()
Public Function ToTransform As Transform
Return Value
Type: Transform
The equivalent 4x4 transformation.
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace