RhinoCommon API
Vector2f.Subtract Method
 Subtracts the second vector from the first one.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static Vector2f Subtract(
	Vector2f vector1,
	Vector2f vector2
)
Public Shared Function Subtract (
	vector1 As Vector2f,
	vector2 As Vector2f
) As Vector2f
Parameters
vector1
Type: Rhino.Geometry.Vector2f
A vector.
vector2
Type: Rhino.Geometry.Vector2f
A second vector.
Return Value
Type: Vector2f
A new vector that results from the component-wise difference of vector1 - vector2.
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace