RhinoCommon API
DisplayPipeline.AddClippingPlane Method
 Add a clipping plane to be used during the drawing of this frame
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public int AddClippingPlane(
	Point3d point,
	Vector3d normal
)
Public Function AddClippingPlane (
	point As Point3d,
	normal As Vector3d
) As Integer
Parameters
point
Type: Rhino.Geometry.Point3d
point on the plane
normal
Type: Rhino.Geometry.Vector3d
vector perpendicular to the plane
Return Value
Type: Int32
index for the added clipping plane
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace