RhinoCommon API
ClippingPlaneSurface Constructor (Plane)
 Constructs a clipping plane surface from a Plane
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public ClippingPlaneSurface(
	Plane plane
)
Public Sub New (
	plane As Plane
)
Parameters
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.ClippingPlaneSurface.#ctor(Rhino.Geometry.Plane)"]
See Also
Reference
ClippingPlaneSurface Class
ClippingPlaneSurface Overload
Rhino.Geometry Namespace