RhinoCommon API
Brep.Split Method (IEnumerable<GeometryBase>, Vector3d, Boolean, Double)
 Splits a Brep into pieces using a combination of curves, to be extruded, and Breps as cutters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.13
Syntax
public Brep[] Split(
	IEnumerable<GeometryBase> cutters,
	Vector3d normal,
	bool planView,
	double intersectionTolerance
)
Public Function Split (
	cutters As IEnumerable(Of GeometryBase),
	normal As Vector3d,
	planView As Boolean,
	intersectionTolerance As Double
) As Brep()
Parameters
cutters
Type: System.Collections.Generic.IEnumerable<GeometryBase>
The curves, surfaces, faces and Breps to be used as cutters. Any other geometry is ignored.
normal
Type: Rhino.Geometry.Vector3d
A construction plane normal, used in deciding how to extrude a curve into a cutter.
planView
Type: System.Boolean
Set true if the assume view is a plan, or parallel projection, view.
intersectionTolerance
Type: System.Double
The tolerance with which to compute intersections.
Return Value
Type: Brep[]
A new array of Breps. This array can be empty.
Remarks
 A Curve in cutters is extruded to produce a surface to use as a cutter. The extrusion direction is chosen, as in the Rhino Split command, based on the properties of the active view. In particular the construction plane Normal and whether the active view is a plan view, a parallel projection with construction plane normal as the view direction. If planView is false and the curve is planar then the curve is extruded perpendicular to the curve, otherwise the curve is extruded in the normal direction.
See Also
Reference
Brep Class
Split Overload
Rhino.Geometry Namespace