RhinoCommon API
RotationGripUserInterfaceObject.OnRotationDrag Method
 Called when dragging a rotation grip. Angle is the amount that the plane will be rotated when dragging
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnRotationDrag(
	double angle,
	MouseState mouse
)
Protected Overridable Sub OnRotationDrag (
	angle As Double,
	mouse As MouseState
)
Parameters
angle
Type: System.Double
signed angle of rotation amout
mouse
Type: Rhino.UI.MouseState
mouse state while dragging
See Also
Reference
RotationGripUserInterfaceObject Class
Rhino.UI Namespace