RhinoCommon API
UserInterfaceGrid.SetColumnAutoWidth Method
 Make a column as wide as the widest control in it. Controls report their width from their computed size, so a label column sized this way is exactly as wide as its longest description.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetColumnAutoWidth(
	int column
)
Public Sub SetColumnAutoWidth (
	column As Integer
)
Parameters
column
Type: System.Int32
[Missing <param name="column"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetColumnAutoWidth(System.Int32)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace