RhinoCommon API
GetCylinder.GetMesh Method (Int32, Int32, Cylinder)
 Prompt for the getting of a mesh cylinder.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Result GetMesh(
	ref int verticalFaces,
	ref int aroundFaces,
	out Cylinder cylinder
)
Public Function GetMesh (
	ByRef verticalFaces As Integer,
	ByRef aroundFaces As Integer,
	<OutAttribute> ByRef cylinder As Cylinder
) As Result
Parameters
verticalFaces
Type: System.Int32
The number of faces in the vertical direction.
aroundFaces
Type: System.Int32
The number of faces in the around direction
cylinder
Type: Rhino.Geometry.Cylinder
The cylinder geometry defined by the user.
Return Value
Type: Result
The result of the getting operation.
See Also
Reference
GetCylinder Class
GetMesh Overload
Rhino.Input.Custom Namespace