RhinoCommon API
RenderContentCollection.Iterator Method
 Gets an iterator for the collection
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ContentCollectionIterator Iterator()
Public Function Iterator As ContentCollectionIterator
Return Value
Type: ContentCollectionIterator
[Missing <returns> documentation for "M:Rhino.Render.RenderContentCollection.Iterator"]
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace