RhinoCommon API
Mesh.ExtendSelectionByFaceLoop Method
 Suggests an extension of a face selection set by using information related with topology and alignment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int[] ExtendSelectionByFaceLoop(
	int[] preselectedFaces,
	int newFace,
	bool iterative = true
)
Public Function ExtendSelectionByFaceLoop (
	preselectedFaces As Integer(),
	newFace As Integer,
	Optional iterative As Boolean = true
) As Integer()
Parameters
preselectedFaces
Type: System.Int32[]
An array of faces that were already selected.
newFace
Type: System.Int32
A new face index. If this index is already part of the selection, no extension is suggested.
iterative (Optional)
Type: System.Boolean
[Missing <param name="iterative"/> documentation for "M:Rhino.Geometry.Mesh.ExtendSelectionByFaceLoop(System.Int32[],System.Int32,System.Boolean)"]
Return Value
Type: Int32[]
An array of faces that are in a visual relationship with newFace.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If newFace is less than 0 or larger than the face count.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace