RhinoCommon API
Curve.CreateRevisionCloud Method (Curve, Int32, Double, Boolean)
 Creates a revision cloud curve from a planar curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static Curve CreateRevisionCloud(
	Curve curve,
	int segmentCount,
	double angle,
	bool flip
)
Public Shared Function CreateRevisionCloud (
	curve As Curve,
	segmentCount As Integer,
	angle As Double,
	flip As Boolean
) As Curve
Parameters
curve
Type: Rhino.Geometry.Curve
The input planar curve.
segmentCount
Type: System.Int32
 The number of segments in the output revision cloud curve. If zero, the number of segments in the output revision cloud curve is based on the NURB form of the input curve.
angle
Type: System.Double
 The angle in radians, between PI/2.0 and PI radians (90 and 180 degrees). This angle indicates the amount of bulge in the segments.
flip
Type: System.Boolean
The arc segments in output revision cloud curve will be in the opposite direction to the input curve.
Return Value
Type: Curve
A revision cloud curve is successful, false otherwise.
See Also
Reference
Curve Class
CreateRevisionCloud Overload
Rhino.Geometry Namespace