RhinoCommon API
TextFields.TryParse Method
 Evaluates the contents of a text string with field expressions and returns the result
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool TryParse(
	string text,
	RhinoDoc doc,
	out List<string> result
)
Public Shared Function TryParse (
	text As String,
	doc As RhinoDoc,
	<OutAttribute> ByRef result As List(Of String)
) As Boolean
Parameters
text
Type: System.String
 The text formula to parse and evaluate
doc
Type: Rhino.RhinoDoc
 The Rhino document to evaluate
result
Type: System.Collections.Generic.List<String>
 The result of the evaluated expression. Otherwise, if the text is null or the evaluation process fails, the result will be empty.
Return Value
Type: Boolean
 Returns True if the expression is evaluated properly; Otherwise False.
See Also
Reference
TextFields Class
Rhino.Runtime Namespace