RhinoCommon API
ObjRef.InstanceDefinitionPart Method
 If sub-object selection is enabled and a piece of an instance reference is selected, this will return the selected piece.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoObject InstanceDefinitionPart()
Public Function InstanceDefinitionPart As RhinoObject
Return Value
Type: RhinoObject
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjRef.InstanceDefinitionPart"]
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace