RhinoCommon API
UnknownUserData Constructor
 Constructs a new unknown data entity.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public UnknownUserData(
	IntPtr pointerNativeUserData
)
Public Sub New (
	pointerNativeUserData As IntPtr
)
Parameters
pointerNativeUserData
Type: System.IntPtr
A pointer to the entity.
See Also
Reference
UnknownUserData Class
Rhino.DocObjects.Custom Namespace