RhinoCommon API
RhinoDoc.GetCurrentMeshingParameters Method
 Get the custom meshing parameters that this document will use.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public MeshingParameters GetCurrentMeshingParameters()
Public Function GetCurrentMeshingParameters As MeshingParameters
Return Value
Type: MeshingParameters
[Missing <returns> documentation for "M:Rhino.RhinoDoc.GetCurrentMeshingParameters"]
See Also
Reference
RhinoDoc Class
Rhino Namespace