RhinoCommon API
UserInterfaceGrid.SetChildColumnSpan Method
 Number of columns a cell occupies. The default is 1. Use this for a section heading or a control that runs the full width of the grid. A span is clamped to the number of columns left in the row.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetChildColumnSpan(
	int index,
	int span
)
Public Sub SetChildColumnSpan (
	index As Integer,
	span As Integer
)
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetChildColumnSpan(System.Int32,System.Int32)"]
span
Type: System.Int32
[Missing <param name="span"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetChildColumnSpan(System.Int32,System.Int32)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace