RhinoCommon API
RhinoObject.HistoryParents Method
 Gets the ids of the parent Rhino objects of this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public Guid[] HistoryParents()
Public Function HistoryParents As Guid()
Return Value
Type: Guid[]
An array of Rhino object ids if successful, an empty array if the object has no parents or on error.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace