RhinoCommon API
CommonObject.ComputeMemoryEstimate Method
 Computes an estimate of the number of bytes that this object is using in memory.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static uint ComputeMemoryEstimate(
	CommonObject obj
)
Public Shared Function ComputeMemoryEstimate (
	obj As CommonObject
) As UInteger
Parameters
obj
Type: Rhino.Runtime.CommonObject
[Missing <param name="obj"/> documentation for "M:Rhino.Runtime.CommonObject.ComputeMemoryEstimate(Rhino.Runtime.CommonObject)"]
Return Value
Type: UInt32
An estimated memory footprint.
Remarks
 This is the same as calling GeometryBase.MemoryEstimate, but works for all CommonObject derived classes.
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace