RhinoCommon API
BoundingBox.ToString Method
 Constructs the string representation of this aligned bounding box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
Text.
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace