RhinoCommon API
Mesh.QuadRemeshAsync Method (QuadRemeshParameters, IProgress<Int32>, CancellationToken)
 Quad remesh this mesh asynchronously.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Task<Mesh> QuadRemeshAsync(
	QuadRemeshParameters parameters,
	IProgress<int> progress,
	CancellationToken cancelToken
)
Public Function QuadRemeshAsync (
	parameters As QuadRemeshParameters,
	progress As IProgress(Of Integer),
	cancelToken As CancellationToken
) As Task(Of Mesh)
Parameters
parameters
Type: Rhino.Geometry.QuadRemeshParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshAsync(Rhino.Geometry.QuadRemeshParameters,System.IProgress{System.Int32},System.Threading.CancellationToken)"]
progress
Type: System.IProgress<Int32>
[Missing <param name="progress"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshAsync(Rhino.Geometry.QuadRemeshParameters,System.IProgress{System.Int32},System.Threading.CancellationToken)"]
cancelToken
Type: System.Threading.CancellationToken
[Missing <param name="cancelToken"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshAsync(Rhino.Geometry.QuadRemeshParameters,System.IProgress{System.Int32},System.Threading.CancellationToken)"]
Return Value
Type: Task<Mesh>
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshAsync(Rhino.Geometry.QuadRemeshParameters,System.IProgress{System.Int32},System.Threading.CancellationToken)"]
See Also
Reference
Mesh Class
QuadRemeshAsync Overload
Rhino.Geometry Namespace