RhinoCommon API
Brep.JoinEdges Method
 Joins two naked edges, or edges that are coincident or close together.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool JoinEdges(
	int edgeIndex0,
	int edgeIndex1,
	double joinTolerance,
	bool compact
)
Public Function JoinEdges (
	edgeIndex0 As Integer,
	edgeIndex1 As Integer,
	joinTolerance As Double,
	compact As Boolean
) As Boolean
Parameters
edgeIndex0
Type: System.Int32
The first edge index.
edgeIndex1
Type: System.Int32
The second edge index.
joinTolerance
Type: System.Double
The join tolerance.
compact
Type: System.Boolean
 If joining more than one edge pair and want the edge indices of subsequent pairs to remain valid, set to false. But then call Brep.Compact() on the final result.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace