RhinoCommon API
RhinoObject.GetDynamicTransform Method
 While an object is being dynamically transformed (dragged, rotated, ...), the current transformation can be retrieved and used for creating dynamic display.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool GetDynamicTransform(
	out Transform transform
)
Public Function GetDynamicTransform (
	<OutAttribute> ByRef transform As Transform
) As Boolean
Parameters
transform
Type: Rhino.Geometry.Transform
[Missing <param name="transform"/> documentation for "M:Rhino.DocObjects.RhinoObject.GetDynamicTransform(Rhino.Geometry.Transform@)"]
Return Value
Type: Boolean
 True if the object is being edited and its transformation is available. False if the object is not being edited, in which case the identity transform is returned.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace