RhinoCommon API
LayerTable.Add Method
 Adds a new layer with default definition to the layer table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Add()
Public Function Add As Integer
Return Value
Type: Int32
index of new layer.
See Also
Reference
LayerTable Class
Add Overload
Rhino.DocObjects.Tables Namespace