RhinoCommon API
HatchPatternTable.PurgeUnused Method
 Purges any unused hatch patterns.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PurgeUnused()
Public Function PurgeUnused As Integer
Return Value
Type: Int32
The number of unused hatch patterns that were purged.
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace