RhinoCommon API
Curve.Reparameterize Method
 Reparameterizes a curve using automatic parameterization.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public Curve Reparameterize()
Public Function Reparameterize As Curve
Return Value
Type: Curve
The reparameterized curve if successful, null otherwise.
Remarks
 Poorly parameterized objects may not intersect and trim properly when combined with other objects. "Poorly parameterized" means the curve's domain or the surface's u or v spaces are tiny or huge compared to the size of the object. When curves are parameterized with a [0,1] domain, both the accuracy and the precision of geometric calculations like intersections and closest points are reduced, sometimes dramatically. Ideally the domain of a curve is close to it's length.
See Also
Reference
Curve Class
Rhino.Geometry Namespace