RhinoCommon API
PointCloud.Merge Method
 Merges, or appends, a specified point cloud into this one.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Merge(
	PointCloud other
)
Public Sub Merge (
	other As PointCloud
)
Parameters
other
Type: Rhino.Geometry.PointCloud
PointCloud to merge with this one.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace