RhinoCommon API
HiddenLineDrawing.RejoinCompatibleVisible Method
 Join consecutive visible curves from a single FullCurve
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void RejoinCompatibleVisible()
Public Sub RejoinCompatibleVisible
See Also
Reference
HiddenLineDrawing Class
Rhino.Geometry Namespace