RhinoCommon API
NamedLayerStateTable.Restore Method (String, RestoreLayerProperties, Guid)
 Restores a named layer state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public bool Restore(
	string name,
	RestoreLayerProperties properties,
	Guid viewportId
)
Public Function Restore (
	name As String,
	properties As RestoreLayerProperties,
	viewportId As Guid
) As Boolean
Parameters
name
Type: System.String
The name of the layer state.
properties
Type: Rhino.DocObjects.Tables.RestoreLayerProperties
The layer properties to restore.
viewportId
Type: System.Guid
The id of the layout or detail viewport to restore the per-viewport layer properties.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedLayerStateTable.Restore(System.String,Rhino.DocObjects.Tables.RestoreLayerProperties,System.Guid)"]
See Also
Reference
NamedLayerStateTable Class
Restore Overload
Rhino.DocObjects.Tables Namespace