RhinoCommon API
RhinoList<T>.Sort Method (Comparison<T>)
 Sorts the elements in the entire list using the specified comparer.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Sort(
	Comparison<T> comparison
)
Public Sub Sort (
	comparison As Comparison(Of T)
)
Parameters
comparison
Type: System.Comparison<T>
The System.Comparison(T) to use when comparing elements.
See Also
Reference
RhinoList<T> Class
Sort Overload
Rhino.Collections Namespace