RhinoCommon API
Brep.CreateBooleanUnion Method (IEnumerable<Brep>, Double)
 Compute the Boolean Union of a set of Breps.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Brep[] CreateBooleanUnion(
	IEnumerable<Brep> breps,
	double tolerance
)
Public Shared Function CreateBooleanUnion (
	breps As IEnumerable(Of Brep),
	tolerance As Double
) As Brep()
Parameters
breps
Type: System.Collections.Generic.IEnumerable<Brep>
Breps to union.
tolerance
Type: System.Double
Tolerance to use for union operation.
Return Value
Type: Brep[]
An array of Brep results or null on failure.
Remarks
 Breps that have never been added to a document may need preparing first, or this method can fail, or return an unexpected result. See PrepareForBooleans().
See Also
Reference
Brep Class
CreateBooleanUnion Overload
Rhino.Geometry Namespace
Brep.PrepareForBooleans()