RhinoCommon API
Panels.ChangePanelIcon Method (Type, Icon)
 Update the icon used for a panel tab.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void ChangePanelIcon(
	Type panelType,
	Icon icon
)
Public Shared Sub ChangePanelIcon (
	panelType As Type,
	icon As Icon
)
Parameters
panelType
Type: System.Type
[Missing <param name="panelType"/> documentation for "M:Rhino.UI.Panels.ChangePanelIcon(System.Type,System.Drawing.Icon)"]
icon
Type: System.Drawing.Icon
New icon to use
See Also
Reference
Panels Class
ChangePanelIcon Overload
Rhino.UI Namespace