RhinoCommon API
Decal.GetTextureMapping Method
 Gets the Texture Mapping of the decal.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public TextureMapping GetTextureMapping()
Public Function GetTextureMapping As TextureMapping
Return Value
Type: TextureMapping
[Missing <returns> documentation for "M:Rhino.Render.Decal.GetTextureMapping"]
See Also
Reference
Decal Class
Rhino.Render Namespace