RhinoCommon API
RenderWindow.Invalidate Method
 Invalidate the entire view window so that the pixels get painted.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Invalidate()
Public Sub Invalidate
See Also
Reference
RenderWindow Class
Rhino.Render Namespace