RhinoCommon API
Curve.CreateTweenCurvesWithMatching Method (Curve, Curve, Int32)
Note: This API is now obsolete.
 Creates curves between two open or closed input curves. Make the structure of input curves compatible if needed. Refits the input curves to have the same structure. The resulting curves are usually more complex than input unless input curves are compatible and no refit is needed. There is no matching of curves direction. Caller must match input curves direction before calling the function.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.2
Syntax
[ObsoleteAttribute("Use version that takes tolerance as input")]
public static Curve[] CreateTweenCurvesWithMatching(
	Curve curve0,
	Curve curve1,
	int numCurves
)
<ObsoleteAttribute("Use version that takes tolerance as input")>
Public Shared Function CreateTweenCurvesWithMatching (
	curve0 As Curve,
	curve1 As Curve,
	numCurves As Integer
) As Curve()
Parameters
curve0
Type: Rhino.Geometry.Curve
The first, or starting, curve.
curve1
Type: Rhino.Geometry.Curve
The second, or ending, curve.
numCurves
Type: System.Int32
Number of tween curves to create.
Return Value
Type: Curve[]
An array of tween curves. This array can be empty.
See Also
Reference
Curve Class
CreateTweenCurvesWithMatching Overload
Rhino.Geometry Namespace