RhinoCommon API
Point2f.DistanceToSquared Method
 Computes the squared distance between two points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public double DistanceToSquared(
	Point2f other
)
Public Function DistanceToSquared (
	other As Point2f
) As Double
Parameters
other
Type: Rhino.Geometry.Point2f
Other point for distance measurement.
Return Value
Type: Double
The squared length of the line between this and the other point; or 0 if any of the points is not valid.
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace