RhinoCommon API
MatchSrfSettings Constructor
 Constructor
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public MatchSrfSettings(
	Continuity match,
	Continuity otherEnd
)
Public Sub New (
	match As Continuity,
	otherEnd As Continuity
)
Parameters
match
Type: Rhino.Geometry.Continuity
[Missing <param name="match"/> documentation for "M:Rhino.Geometry.MatchSrfSettings.#ctor(Rhino.Geometry.Continuity,Rhino.Geometry.Continuity)"]
otherEnd
Type: Rhino.Geometry.Continuity
[Missing <param name="otherEnd"/> documentation for "M:Rhino.Geometry.MatchSrfSettings.#ctor(Rhino.Geometry.Continuity,Rhino.Geometry.Continuity)"]
See Also
Reference
MatchSrfSettings Class
Rhino.Geometry Namespace