RhinoCommon API
SupportOptions.BlockContent_ShowCustom Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.BlockContent_ShowCustom"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool BlockContent_ShowCustom()
Public Shared Function BlockContent_ShowCustom As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.BlockContent_ShowCustom"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace