RhinoCommon API
FieldDictionary.Add Method (String, Point3d)
 Add a new Point3dField to the dictionary. This will be a data only field and not show up in the content browsers.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Point3dField Add(
	string key,
	Point3d value
)
Public Function Add (
	key As String,
	value As Point3d
) As Point3dField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: Rhino.Geometry.Point3d
Initial value for this field.
Return Value
Type: Point3dField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Point3d)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace