RhinoCommon API
ContentCollectionIterator.DeleteThis Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.ContentCollectionIterator.DeleteThis"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use Dispose")]
public void DeleteThis()
<ObsoleteAttribute("Use Dispose")>
Public Sub DeleteThis
See Also
Reference
ContentCollectionIterator Class
Rhino.Render Namespace