RhinoCommon API
Curve.GetLocalPerpPoint Method (Point3d, Double, Interval, Double)
 Search for a location on the curve, near seedParmameter, that is perpendicular to a test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GetLocalPerpPoint(
	Point3d testPoint,
	double seedParmameter,
	Interval subDomain,
	out double curveParameter
)
Public Function GetLocalPerpPoint (
	testPoint As Point3d,
	seedParmameter As Double,
	subDomain As Interval,
	<OutAttribute> ByRef curveParameter As Double
) As Boolean
Parameters
testPoint
Type: Rhino.Geometry.Point3d
The test point.
seedParmameter
Type: System.Double
A "seed" parameter on the curve.
subDomain
Type: Rhino.Geometry.Interval
The sub-domain of the curve to search.
curveParameter
Type: System.Double
The parameter value at the perpendicular point
Return Value
Type: Boolean
True if a solution is found, false otherwise.
See Also
Reference
Curve Class
GetLocalPerpPoint Overload
Rhino.Geometry Namespace