RhinoCommon API
MeshVertexList.Clear Method
 Clears the Vertex list on the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
IList.Clear()
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace