RhinoCommon API
TextFields.Area Method (String)
 Returns the area value for a selected object id
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static double Area(
	string id
)
Public Shared Function Area (
	id As String
) As Double
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.Area(System.String)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.Area(System.String)"]
See Also
Reference
TextFields Class
Area Overload
Rhino.Runtime Namespace