RhinoCommon API
Interop.ToIRhinoViewport Method
 Convert a Rhino.Display.Viewport to an RMA.Rhino.IRhinoViewport.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Object ToIRhinoViewport(
	RhinoViewport source
)
Public Shared Function ToIRhinoViewport (
	source As RhinoViewport
) As Object
Parameters
source
Type: Rhino.Display.RhinoViewport
A RhinoCommon viewport.
Return Value
Type: Object
 Rhino_DotNet IRhinoViewport object on success. This will be an independent copy.
See Also
Reference
Interop Class
Rhino.Runtime Namespace