RhinoCommon API
RuiUpdateUi.RegisterMenuItem Method (Guid, Guid, Guid, RuiUpdateUi.UpdateMenuItemEventHandler)
Register menu item update delegate
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public static bool RegisterMenuItem(
	Guid file,
	Guid menu,
	Guid item,
	RuiUpdateUi.UpdateMenuItemEventHandler callBack
)
Public Shared Function RegisterMenuItem (
	file As Guid,
	menu As Guid,
	item As Guid,
	callBack As RuiUpdateUi.UpdateMenuItemEventHandler
) As Boolean
Parameters
file
Type: System.Guid
Menu file Id
menu
Type: System.Guid
Menu Id
item
Type: System.Guid
Menu item Id
callBack
Type: Rhino.UI.RuiUpdateUi.UpdateMenuItemEventHandler
[Missing <param name="callBack"/> documentation for "M:Rhino.UI.RuiUpdateUi.RegisterMenuItem(System.Guid,System.Guid,System.Guid,Rhino.UI.RuiUpdateUi.UpdateMenuItemEventHandler)"]
Return Value
Type: Boolean
true if Registered otherwise false
See Also
Reference
RuiUpdateUi Class
RegisterMenuItem Overload
Rhino.UI Namespace