RhinoCommon API
ArchivableDictionary.GetDouble Method (String)
 Get value as double, will only succeed if value was created using Set(string key, double value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double GetDouble(
	string key
)
Public Function GetDouble (
	key As String
) As Double
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetDouble(System.String)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetDouble(System.String)"]
See Also
Reference
ArchivableDictionary Class
GetDouble Overload
Rhino.Collections Namespace