RhinoCommon API
GroupTable.RemapObjects Method (IEnumerable<RhinoObject>, Dictionary<Int32, Int32>)
 Remaps an enumeration of Rhino objects to new groups.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.16
Syntax
public int RemapObjects(
	IEnumerable<RhinoObject> rhinoObjects,
	out Dictionary<int, int> indexMap
)
Public Function RemapObjects (
	rhinoObjects As IEnumerable(Of RhinoObject),
	<OutAttribute> ByRef indexMap As Dictionary(Of Integer, Integer)
) As Integer
Parameters
rhinoObjects
Type: System.Collections.Generic.IEnumerable<RhinoObject>
The enumeration of Rhino objects.
indexMap
Type: System.Collections.Generic.Dictionary<Int32, Int32>
A map from old group indices to new group indices.
Return Value
Type: Int32
The number of Rhino objects that were modified.
Remarks
 In some situations, a bunch of Rhino objects are copied, new groups need to be created. This method handles the details.
See Also
Reference
GroupTable Class
RemapObjects Overload
Rhino.DocObjects.Tables Namespace