RhinoCommon API
Brep.CreatePlanarBreps Method (IEnumerable<Curve>, Double)
 Constructs a set of planar breps as outlines by the loops.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep[] CreatePlanarBreps(
	IEnumerable<Curve> inputLoops,
	double tolerance
)
Public Shared Function CreatePlanarBreps (
	inputLoops As IEnumerable(Of Curve),
	tolerance As Double
) As Brep()
Parameters
inputLoops
Type: System.Collections.Generic.IEnumerable<Curve>
Curve loops that delineate the planar boundaries.
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.Brep.CreatePlanarBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)"]
Return Value
Type: Brep[]
An array of Planar Breps.
See Also
Reference
Brep Class
CreatePlanarBreps Overload
Rhino.Geometry Namespace