RhinoCommon API
Brep.UntrimOuterLoop Method
 Untrims the outer boundary of a face, expanding the face back to the boundary of its underlying surface. Inner loops (holes) are left in place. The outer boundary is only untrimmed when all of its edges are naked; otherwise the operation fails to avoid corrupting adjacent faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Brep UntrimOuterLoop(
	int faceIndex
)
Public Function UntrimOuterLoop (
	faceIndex As Integer
) As Brep
Parameters
faceIndex
Type: System.Int32
The index of the face to untrim.
Return Value
Type: Brep
The untrimmed Brep if successful, null otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace