RhinoCommon API
LightManagerSupportClient.SetLightSolo Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupportClient.SetLightSolo(Rhino.Geometry.Light,System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SetLightSolo(
	Light light,
	bool bSolo
)
Public Function SetLightSolo (
	light As Light,
	bSolo As Boolean
) As Boolean
Parameters
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.LightManagerSupportClient.SetLightSolo(Rhino.Geometry.Light,System.Boolean)"]
bSolo
Type: System.Boolean
[Missing <param name="bSolo"/> documentation for "M:Rhino.Render.LightManagerSupportClient.SetLightSolo(Rhino.Geometry.Light,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.LightManagerSupportClient.SetLightSolo(Rhino.Geometry.Light,System.Boolean)"]
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace