RhinoCommon API
DisplayPipeline.PopClipTesting Method
Note: This API is now obsolete.
 Pop a ClipTesting flag off the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use PopDepthTesting")]
public void PopClipTesting()
<ObsoleteAttribute("Use PopDepthTesting")>
Public Sub PopClipTesting
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace