RhinoCommon API
PolyCurve.SegmentDomain Method
 Returns the polycurve sub-domain assigned to a segment curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Interval SegmentDomain(
	int segmentIndex
)
Public Function SegmentDomain (
	segmentIndex As Integer
) As Interval
Parameters
segmentIndex
Type: System.Int32
Index of segment.
Return Value
Type: Interval
 The polycurve sub-domain assigned to a segment curve. Returns Interval.Unset if segment_index < 0 or segment_index >= Count().
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace