RhinoCommon API
ControlPoint Constructor (Point4d)
 Constructs a new homogeneous control point, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ControlPoint(
	Point4d pt
)
Public Sub New (
	pt As Point4d
)
Parameters
pt
Type: Rhino.Geometry.Point4d
Coordinates of the control point.
Remarks
 For expert use only. If you do not understand homogeneous coordinates, then use an override that accepts world 3-D, or Euclidean, coordinates as input.
See Also
Reference
ControlPoint Structure
ControlPoint Overload
Rhino.Geometry Namespace