RhinoCommon API
RenderWindow.EndAsyncRender Method
 Must be called when an asynchronous render has finished or ended for any reason.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void EndAsyncRender(
	RenderWindow.RenderSuccessCode successCode
)
Public Sub EndAsyncRender (
	successCode As RenderWindow.RenderSuccessCode
)
Parameters
successCode
Type: Rhino.Render.RenderWindow.RenderSuccessCode
Completed for a correct or canceled render, Failed for errors.
See Also
Reference
RenderWindow Class
Rhino.Render Namespace