RhinoCommon API
SubDEdgeList.SetEdgeTags Method (IEnumerable<Int32>, SubDEdgeTag)
 Set edge tags for a list of edges. Useful for adding creases to SubDs
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
public void SetEdgeTags(
	IEnumerable<int> edgeIndices,
	SubDEdgeTag tag
)
Public Sub SetEdgeTags (
	edgeIndices As IEnumerable(Of Integer),
	tag As SubDEdgeTag
)
Parameters
edgeIndices
Type: System.Collections.Generic.IEnumerable<Int32>
list of indices for the edges to set tags on
tag
Type: Rhino.Geometry.SubDEdgeTag
The type of edge tag
See Also
Reference
SubDEdgeList Class
SetEdgeTags Overload
Rhino.Geometry.Collections Namespace