RhinoCommon API
ViewCaptureWriter.Draw Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.Draw(System.IntPtr,Rhino.RhinoDoc)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public void Draw(
	IntPtr constPtrPrintInfo,
	RhinoDoc doc
)
Public Sub Draw (
	constPtrPrintInfo As IntPtr,
	doc As RhinoDoc
)
Parameters
constPtrPrintInfo
Type: System.IntPtr
[Missing <param name="constPtrPrintInfo"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.Draw(System.IntPtr,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.Draw(System.IntPtr,Rhino.RhinoDoc)"]
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace