RhinoCommon API
PostEffectPipeline.GetMaxLuminance Method
 Get the max luminance in the rendering.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public float GetMaxLuminance()
Public Function GetMaxLuminance As Single
Return Value
Type: Single
max luminance
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace