RhinoCommon API
SubDVertex.ClearSavedSubdivisionPoints Method
 Discards the cached subdivision and surface points for this vertex, so they are recomputed on next use.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public void ClearSavedSubdivisionPoints(
	bool clearNeighborhood
)
Public Sub ClearSavedSubdivisionPoints (
	clearNeighborhood As Boolean
)
Parameters
clearNeighborhood
Type: System.Boolean
 If true, the cached points of the neighboring components are discarded too. Moving a control net point changes the surface around it, not just at it, so pass true after an edit unless you know only this vertex is affected.
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace