RhinoCommon API
FileGltf.Write Method
Write a glTF file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public static bool Write(
	string filename,
	RhinoDoc doc,
	FileGltfWriteOptions options
)
Public Shared Function Write (
	filename As String,
	doc As RhinoDoc,
	options As FileGltfWriteOptions
) As Boolean
Parameters
filename
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileGltfWriteOptions
options used for generating the glTF file
Return Value
Type: Boolean
true on success
See Also
Reference
FileGltf Class
Rhino.FileIO Namespace