RhinoCommon API
FileCsvDocument.TryGetDouble Method (String, Int32, Double)
 Retrieves the value of a cell as a double-precision number, addressing the column by header name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetDouble(
	string column,
	int row,
	out double value
)
Public Function TryGetDouble (
	column As String,
	row As Integer,
	<OutAttribute> ByRef value As Double
) As Boolean
Parameters
column
Type: System.String
The header name of the column.
row
Type: System.Int32
The zero-based data-row index (y).
value
Type: System.Double
The parsed value, or 0.0 if the column or cell does not exist or cannot be parsed.
Return Value
Type: Boolean
true if the column and cell exist and were parsed; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetDouble Overload
Rhino.FileIO Namespace