RhinoCommon API
Linetype.CreateFromPatternString Method
 Creates a linetype from a pattern string. Values greater than zero represent line segments, and values less than or equal to zero represents space segments.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
public static Linetype CreateFromPatternString(
	string patternString,
	bool millimeters
)
Public Shared Function CreateFromPatternString (
	patternString As String,
	millimeters As Boolean
) As Linetype
Parameters
patternString
Type: System.String
The pattern string.
millimeters
Type: System.Boolean
 Specify true if the pattern is represented in millimeters. Specify false if the pattern is represented in inches.
Return Value
Type: Linetype
A valid linetype if successful, null otherwise.
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace