RhinoCommon API
Components Constructor
Initializes a new instance of the Components class
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Components()
Protected Sub New
See Also
Reference
Components Class
Rhino.NodeInCode Namespace