RhinoCommon API
RhinoObject.GetFillSurfaces Method (RhinoObject, IEnumerable<ClippingPlaneObject>, Boolean)
 Return list of fill surfaces if any for object and clipping plane.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public static Brep[] GetFillSurfaces(
	RhinoObject rhinoObject,
	IEnumerable<ClippingPlaneObject> clippingPlaneObjects,
	bool unclippedFills
)
Public Shared Function GetFillSurfaces (
	rhinoObject As RhinoObject,
	clippingPlaneObjects As IEnumerable(Of ClippingPlaneObject),
	unclippedFills As Boolean
) As Brep()
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
Object to clip
clippingPlaneObjects
Type: System.Collections.Generic.IEnumerable<ClippingPlaneObject>
Enumeration of clipping plane objects
unclippedFills
Type: System.Boolean
Use true to get fills that are not trimmed by all clipping planes
Return Value
Type: Brep[]
Array of Brep containing fills if there were any generated, trimmed if unclippedFills was false
See Also
Reference
RhinoObject Class
GetFillSurfaces Overload
Rhino.DocObjects Namespace