RhinoCommon API
EventWatcher Constructor
 Creates a new event watcher and begins watching.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public EventWatcher(
	bool includeHeadlessDocuments
)
Public Sub New (
	includeHeadlessDocuments As Boolean
)
Parameters
includeHeadlessDocuments
Type: System.Boolean
 When true, events are also raised for headless documents. In this case handlers may be invoked on a non-UI thread (see the remarks on EventWatcher).
See Also
Reference
EventWatcher Class
Rhino Namespace