RhinoCommon API
SubDVertex.EdgeAt Method
 Retrieve a SubDEdge from this vertex
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDEdge EdgeAt(
	int index
)
Public Function EdgeAt (
	index As Integer
) As SubDEdge
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Geometry.SubDVertex.EdgeAt(System.Int32)"]
Return Value
Type: SubDEdge
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertex.EdgeAt(System.Int32)"]
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace