RhinoCommon API
RenderEnvironmentTable.BeginChange Method
[Missing <summary> documentation for "M:Rhino.Render.RenderEnvironmentTable.BeginChange(Rhino.Render.RenderContent.ChangeContexts)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void BeginChange(
	RenderContent.ChangeContexts changeContext
)
Public Sub BeginChange (
	changeContext As RenderContent.ChangeContexts
)
Parameters
changeContext
Type: Rhino.Render.RenderContent.ChangeContexts
[Missing <param name="changeContext"/> documentation for "M:Rhino.Render.RenderEnvironmentTable.BeginChange(Rhino.Render.RenderContent.ChangeContexts)"]
See Also
Reference
RenderEnvironmentTable Class
Rhino.Render Namespace