RhinoCommon API
ObjectTable.ModifyRenderMaterial Method (Guid, RenderMaterial)
 Modifies an object's render material assignment, this will set the objects material source to ObjectMaterialSource.MaterialFromObject.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool ModifyRenderMaterial(
	Guid objectId,
	RenderMaterial material
)
Public Function ModifyRenderMaterial (
	objectId As Guid,
	material As RenderMaterial
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to modify.
material
Type: Rhino.Render.RenderMaterial
 Material to assign to this object.
Return Value
Type: Boolean
 Returns true on success otherwise returns false.
See Also
Reference
ObjectTable Class
ModifyRenderMaterial Overload
Rhino.DocObjects.Tables Namespace