RhinoCommon API
RhinoObject.SetCustomRenderMeshParameter Method
 Set the named custom render mesh parameter value for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual void SetCustomRenderMeshParameter(
	Guid providerId,
	string parameterName,
	Object value
)
Public Overridable Sub SetCustomRenderMeshParameter (
	providerId As Guid,
	parameterName As String,
	value As Object
)
Parameters
providerId
Type: System.Guid
Id of the custom render mesh provider
parameterName
Type: System.String
[Missing <param name="parameterName"/> documentation for "M:Rhino.DocObjects.RhinoObject.SetCustomRenderMeshParameter(System.Guid,System.String,System.Object)"]
value
Type: System.Object
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.RhinoObject.SetCustomRenderMeshParameter(System.Guid,System.String,System.Object)"]
Return Value
Type:
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace