RhinoCommon API
NamedParametersEventArgs.TryGetViewport Method
 Try to get a viewport for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool TryGetViewport(
	string name,
	out ViewportInfo viewport
)
Public Function TryGetViewport (
	name As String,
	<OutAttribute> ByRef viewport As ViewportInfo
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetViewport(System.String,Rhino.DocObjects.ViewportInfo@)"]
viewport
Type: Rhino.DocObjects.ViewportInfo
[Missing <param name="viewport"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetViewport(System.String,Rhino.DocObjects.ViewportInfo@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetViewport(System.String,Rhino.DocObjects.ViewportInfo@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace