RhinoCommon API
MaterialRefs.Clear Method
 Removes all items from this dictionary.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace