RhinoCommon API
PersistentSettings.GetSettingIsHiddenFromUserInterface Method (String, IEnumerable<String>)
 Values read from all users settings files will be marked as read-only which will cause any future calls to Set... to fail.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GetSettingIsHiddenFromUserInterface(
	string key,
	IEnumerable<string> legacyKeyList
)
Public Function GetSettingIsHiddenFromUserInterface (
	key As String,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
 Key name for which to search.
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetSettingIsHiddenFromUserInterface(System.String,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
 Returns true if the setting is read-only otherwise false.
Exceptions
Exception | Condition
KeyNotFoundException |  A KeyNotFoundException exception is thrown if the key is not found in the settings dictionary.
See Also
Reference
PersistentSettings Class
GetSettingIsHiddenFromUserInterface Overload
Rhino Namespace