RhinoCommon API
ObjectAttributes.Duplicate Method
 Constructs a copy of this ObjectAttributes instance.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ObjectAttributes Duplicate()
Public Function Duplicate As ObjectAttributes
Return Value
Type: ObjectAttributes
A new instance on success, or null on failure.
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace