RhinoCommon API
PolylineCurve.ToPolyline Method
 Returns the underlying Polyline, or points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Polyline ToPolyline()
Public Function ToPolyline As Polyline
Return Value
Type: Polyline
The Polyline if successful, null of the curve has no points.
See Also
Reference
PolylineCurve Class
ToPolyline Overload
Rhino.Geometry Namespace