RhinoCommon API
RenderPipeline.GetRenderWindowFromRenderViewSource Method
 Like GetRenderWindow(), but with the size for RenderWindow set from RenderViewSources if fromRenderViewSource is set to true
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderWindow GetRenderWindowFromRenderViewSource(
	bool fromRenderViewSource
)
Public Function GetRenderWindowFromRenderViewSource (
	fromRenderViewSource As Boolean
) As RenderWindow
Parameters
fromRenderViewSource
Type: System.Boolean
true if
Return Value
Type: RenderWindow
RenderWindow if one exists, null otherwise (i.e. rendering has already completed).
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace