RhinoCommon API
SubDEdge.RelativeFaceAt Method
 Gets the face on one side of this edge, relative to the direction this edge is referenced with.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDFace RelativeFaceAt(
	int relativeFaceIndex
)
Public Function RelativeFaceAt (
	relativeFaceIndex As Integer
) As SubDFace
Parameters
relativeFaceIndex
Type: System.Int32
0 for the left side, 1 for the right side.
Return Value
Type: SubDFace
 The face, with its ComponentDirection set so its boundary runs the same way as this edge. Null if there is no such face, or if the edge is nonmanifold.
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace