RhinoCommon API
MeshVertexList.SetVertex Method (Int32, Double, Double, Double, Boolean)
 Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.6
Syntax
public bool SetVertex(
	int index,
	double x,
	double y,
	double z,
	bool updateNormals
)
Public Function SetVertex (
	index As Integer,
	x As Double,
	y As Double,
	z As Double,
	updateNormals As Boolean
) As Boolean
Parameters
index
Type: System.Int32
Index of vertex to set.
x
Type: System.Double
X component of vertex location.
y
Type: System.Double
Y component of vertex location.
z
Type: System.Double
Z component of vertex location.
updateNormals
Type: System.Boolean
Set to true if you'd like the vertex and face normals impacted by the change updated.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexList Class
SetVertex Overload
Rhino.Geometry.Collections Namespace