RhinoCommon API
BezierCurve Constructor (IEnumerable<Point2d>)
 Create bezier curve with controls defined by a list of 2d points
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BezierCurve(
	IEnumerable<Point2d> controlPoints
)
Public Sub New (
	controlPoints As IEnumerable(Of Point2d)
)
Parameters
controlPoints
Type: System.Collections.Generic.IEnumerable<Point2d>
See Also
Reference
BezierCurve Class
BezierCurve Overload
Rhino.Geometry Namespace