RhinoCommon API
SquishParameters.SetSpringConstants Method
 A simplified interface for setting the Stretch and Compression spring constants
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public void SetSpringConstants(
	double boundaryBias,
	double deformationBias
)
Public Sub SetSpringConstants (
	boundaryBias As Double,
	deformationBias As Double
)
Parameters
boundaryBias
Type: System.Double
 boundary_bias: 0.0 to 1.0 0.0: boundary and interior treated the same 1.0: strongest bias to preserving boundary lengths at the expense of interior distortion.
deformationBias
Type: System.Double
 deformation_bias: -1.0 to 1.0 -1.0: strongest bias in favor of compression. 0.0: no preference between compression and stretching 1.0: strongest bias in favor of stretching
See Also
Reference
SquishParameters Class
Rhino.Geometry Namespace