RhinoCommon API
Panels.OnClosePanel Method
 Call this method to raise the Closed event
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void OnClosePanel(
	Guid panelId,
	uint documentSerialNumber
)
Public Shared Sub OnClosePanel (
	panelId As Guid,
	documentSerialNumber As UInteger
)
Parameters
panelId
Type: System.Guid
Panel identifier.
documentSerialNumber
Type: System.UInt32
The document associated with the closed panel.
See Also
Reference
Panels Class
Rhino.UI Namespace