RhinoCommon API
HiddenLineDrawingParameters.SetViewport Method (ViewportInfo)
 Set the viewport for the hidden line drawing (HLD). The viewport supplies the projection that determines the visibility of curves, and the HLD coordinate system in which the resulting curves are represented. The HLD-coordinate system is a right handed system for 3-D model space, in which the 3rd coordinate direction is the projection direction. In particular the z-coordinate direction points from the scene toward the camera.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetViewport(
	ViewportInfo viewport
)
Public Sub SetViewport (
	viewport As ViewportInfo
)
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
A copy of viewportInfo is made inside of HiddenLineDrawing.
Return Value
Type:
True if the viewport has been set.
See Also
Reference
HiddenLineDrawingParameters Class
SetViewport Overload
Rhino.Geometry Namespace