RhinoCommon API
ColorRGBA.ToArgb Method
 Converts this color to a 32-bit ARGB value.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.35
Syntax
public int ToArgb()
Public Function ToArgb As Integer
Return Value
Type: Int32
The 32-bit ARGB value that corresponds to this color
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace