RhinoCommon API
FilePdf.SetCustomPages Method
 Set the list of custom PDF page definitions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void SetCustomPages(
	IEnumerable<PrintedPageDefinition> pages
)
Public Shared Sub SetCustomPages (
	pages As IEnumerable(Of PrintedPageDefinition)
)
Parameters
pages
Type: System.Collections.Generic.IEnumerable<PrintedPageDefinition>
[Missing <param name="pages"/> documentation for "M:Rhino.FileIO.FilePdf.SetCustomPages(System.Collections.Generic.IEnumerable{Rhino.PrintedPageDefinition})"]
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace