RhinoCommon API
Quaternion.Multiply Operator (Quaternion, Int32)
 Multiplies (scales) all quaternion coefficients by a factor and returns a new quaternion with the result.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Quaternion operator *(
	Quaternion q,
	int x
)
Public Shared Operator * (
	q As Quaternion,
	x As Integer
) As Quaternion
Parameters
q
Type: Rhino.Geometry.Quaternion
A quaternion.
x
Type: System.Int32
A number.
Return Value
Type: Quaternion
A new quaternion.
See Also
Reference
Quaternion Structure
Multiply Overload
Rhino.Geometry Namespace