RhinoCommon API
SupportOptions.SetUseDefaultLibraryPath Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetUseDefaultLibraryPath(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_SetUseDefaultLocation' instead")]
public static void SetUseDefaultLibraryPath(
	bool b
)
<ObsoleteAttribute("Use 'Libraries_SetUseDefaultLocation' instead")>
Public Shared Sub SetUseDefaultLibraryPath (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetUseDefaultLibraryPath(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace