RhinoCommon API
Transform2d.Multiply Operator (Transform2d, Transform2d)
 Multiplies (combines) two transformations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d operator *(
	Transform2d a,
	Transform2d b
)
Public Shared Operator * (
	a As Transform2d,
	b As Transform2d
) As Transform2d
Parameters
a
Type: Rhino.Geometry.Transform2d
First transformation.
b
Type: Rhino.Geometry.Transform2d
Second transformation.
Return Value
Type: Transform2d
A transformation matrix that combines the effect of both input transformations. The resulting Transform2d gives the same result as though you'd first apply B then A.
See Also
Reference
Transform2d Structure
Multiply Overload
Rhino.Geometry Namespace