RhinoCommon API
Worksession.Attach Method (IEnumerable<String>)
 Attaches several models to this worksession as reference models.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Attach(
	IEnumerable<string> paths
)
Public Function Attach (
	paths As IEnumerable(Of String)
) As Integer
Parameters
paths
Type: System.Collections.Generic.IEnumerable<String>
The full paths to the .3dm files to attach.
Return Value
Type: Int32
The number of models that were attached.
See Also
Reference
Worksession Class
Attach Overload
Rhino.DocObjects Namespace