RhinoCommon API
RhinoDoc.OpenInteractive Method
 Opens a 3dm file and makes it the active document. If called on windows the active document will be saved and closed and the new document will be opened and become the active document. If called on the Mac the file will be opened in a new document window. This function is interactive in that it will ask you if you want to open a document as read only if it is already open in a different process
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RhinoDoc OpenInteractive(
	string filePath,
	out bool wasAlreadyOpen
)
Public Shared Function OpenInteractive (
	filePath As String,
	<OutAttribute> ByRef wasAlreadyOpen As Boolean
) As RhinoDoc
Parameters
filePath
Type: System.String
Full path to the 3dm file to open
wasAlreadyOpen
Type: System.Boolean
 Will get set to true if there is a currently open document with the specified path; otherwise it will get set to false.
Return Value
Type: RhinoDoc
 Returns the newly opened document on success or null on error.
See Also
Reference
RhinoDoc Class
Rhino Namespace