RhinoCommon API
DisplayPipeline.Clone Method
 Clones the pipeline. Creates an identical copy of "this" pipeline. Copies all conduits from "this" pipeline to the new pipeline.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public DisplayPipeline Clone(
	RhinoViewport viewport
)
Public Function Clone (
	viewport As RhinoViewport
) As DisplayPipeline
Parameters
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.Display.DisplayPipeline.Clone(Rhino.Display.RhinoViewport)"]
Return Value
Type: DisplayPipeline
The newly cloned pipeline if successful, null otherwise. or failed to close.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace