RhinoCommon API
Notification.HideModal Method
 Tells Rhino to hide the notification if it is being currently shown as a modal.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void HideModal()
Public Sub HideModal
Exceptions
Exception | Condition
InvalidOperationException | Thrown if the calling assembly cannot modify this instance
Remarks
If the notification is not being currently shown but is being queued by Rhino as a result of calling ShowModal(), then the notification will be dequeued. If the notification was never queued, then this method has no effect.
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace