RhinoCommon API
Mesh.IsManifold Method
 Returns true if every mesh "edge" has at most two faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public bool IsManifold()
Public Function IsManifold As Boolean
Return Value
Type: Boolean
true if the mesh is manifold, false otherwise.
See Also
Reference
Mesh Class
IsManifold Overload
Rhino.Geometry Namespace