RhinoCommon API
NamedParametersEventArgs.TryGetStrings Method
 Try to get a string array for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool TryGetStrings(
	string name,
	out string[] value
)
Public Function TryGetStrings (
	name As String,
	<OutAttribute> ByRef value As String()
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetStrings(System.String,System.String[]@)"]
value
Type: System.String[]
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetStrings(System.String,System.String[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetStrings(System.String,System.String[]@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace