RhinoCommon API
DimensionStyle.CreatePreviewBitmap Method (Int32, Int32, Boolean)
[Missing <summary> documentation for "M:Rhino.DocObjects.DimensionStyle.CreatePreviewBitmap(System.Int32,System.Int32,System.Boolean)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Bitmap CreatePreviewBitmap(
	int width,
	int height,
	bool transparent
)
Public Function CreatePreviewBitmap (
	width As Integer,
	height As Integer,
	transparent As Boolean
) As Bitmap
Parameters
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.DocObjects.DimensionStyle.CreatePreviewBitmap(System.Int32,System.Int32,System.Boolean)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.DocObjects.DimensionStyle.CreatePreviewBitmap(System.Int32,System.Int32,System.Boolean)"]
transparent
Type: System.Boolean
[Missing <param name="transparent"/> documentation for "M:Rhino.DocObjects.DimensionStyle.CreatePreviewBitmap(System.Int32,System.Int32,System.Boolean)"]
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.DocObjects.DimensionStyle.CreatePreviewBitmap(System.Int32,System.Int32,System.Boolean)"]
See Also
Reference
DimensionStyle Class
CreatePreviewBitmap Overload
Rhino.DocObjects Namespace