RhinoCommon API
Dialogs.ShowColorDialog Method (Color, Boolean, String, NamedColorList)
 Display Rhino's color selection dialog.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool ShowColorDialog(
	ref Color color,
	bool includeButtonColors,
	string dialogTitle,
	NamedColorList namedColorList
)
Public Shared Function ShowColorDialog (
	ByRef color As Color,
	includeButtonColors As Boolean,
	dialogTitle As String,
	namedColorList As NamedColorList
) As Boolean
Parameters
color
Type: System.Drawing.Color
 [in/out] Default color for dialog, and will receive new color if function returns true.
includeButtonColors
Type: System.Boolean
 Display button face and text options at top of named color list.
dialogTitle
Type: System.String
The title of the dialog.
namedColorList
Type: Rhino.UI.NamedColorList
 If not null and contains one or more named colors the Rhino color dialog named color list will be replaces with this list.
Return Value
Type: Boolean
true if the color changed. false if the color has not changed or the user pressed cancel.
See Also
Reference
Dialogs Class
ShowColorDialog Overload
Rhino.UI Namespace