RhinoCommon API
RhinoObject.FromRuntimeSerialNumber Method
 Get a Rhino object for a unique runtime serial number
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RhinoObject FromRuntimeSerialNumber(
	uint serialNumber
)
Public Shared Function FromRuntimeSerialNumber (
	serialNumber As UInteger
) As RhinoObject
Parameters
serialNumber
Type: System.UInt32
[Missing <param name="serialNumber"/> documentation for "M:Rhino.DocObjects.RhinoObject.FromRuntimeSerialNumber(System.UInt32)"]
Return Value
Type: RhinoObject
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.FromRuntimeSerialNumber(System.UInt32)"]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace