RhinoCommon API
Mesh.Subdivide Method
 Subdivides the faces of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Subdivide()
Public Function Subdivide As Boolean
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
Mesh Class
Subdivide Overload
Rhino.Geometry Namespace