RhinoCommon API
MeshUnsafeLock.FacesArray Method
 Retrieves a pointer to the raw faces array, which uses 4 integers for each face. MeshFace.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.20
Syntax
public MeshFace* FacesArray(
	out int length
)
Visual Basic does not support APIs that consume or return unsafe types.
Parameters
length
Type: System.Int32
The length of the array. This value is returned by reference (out in C#).
Return Value
Type: MeshFace*
The beginning of the vertex array. Item 0 is the first vertex, and item length-1 is the last valid one.
Exceptions
Exception | Condition
InvalidOperationException | The mesh does not have face normals.
See Also
Reference
MeshUnsafeLock Class
Rhino.Geometry Namespace