RhinoCommon API
DrawingUtilities.CreateCurvePreviewGeometry Method
 Create a series of closed polyline loops representing a curve and a linetype combination.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static List<Point2f[]> CreateCurvePreviewGeometry(
	Curve curve,
	Linetype linetype,
	int width,
	int height
)
Public Shared Function CreateCurvePreviewGeometry (
	curve As Curve,
	linetype As Linetype,
	width As Integer,
	height As Integer
) As List(Of Point2f())
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.UI.DrawingUtilities.CreateCurvePreviewGeometry(Rhino.Geometry.Curve,Rhino.DocObjects.Linetype,System.Int32,System.Int32)"]
linetype
Type: Rhino.DocObjects.Linetype
[Missing <param name="linetype"/> documentation for "M:Rhino.UI.DrawingUtilities.CreateCurvePreviewGeometry(Rhino.Geometry.Curve,Rhino.DocObjects.Linetype,System.Int32,System.Int32)"]
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.UI.DrawingUtilities.CreateCurvePreviewGeometry(Rhino.Geometry.Curve,Rhino.DocObjects.Linetype,System.Int32,System.Int32)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.UI.DrawingUtilities.CreateCurvePreviewGeometry(Rhino.Geometry.Curve,Rhino.DocObjects.Linetype,System.Int32,System.Int32)"]
Return Value
Type: List<Point2f[]>
[Missing <returns> documentation for "M:Rhino.UI.DrawingUtilities.CreateCurvePreviewGeometry(Rhino.Geometry.Curve,Rhino.DocObjects.Linetype,System.Int32,System.Int32)"]
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace