RhinoCommon API
RenderContent.GetUiHash Method
 This allows a content to have more than one UI for the same content type.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public virtual ulong GetUiHash()
Public Overridable Function GetUiHash As ULong
Return Value
Type: UInt64
 Default is zero and is ignored.
See Also
Reference
RenderContent Class
Rhino.Render Namespace