RhinoCommon API
BinaryArchiveReader.ReadInt64 Method
 Reads a Int64 from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public long ReadInt64()
Public Function ReadInt64 As Long
Return Value
Type: Int64
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace