RhinoCommon API
NotLicensedException Constructor (String)
 Create a new instance with a custom message
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public NotLicensedException(
	string message
)
Public Sub New (
	message As String
)
Parameters
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.Runtime.NotLicensedException.#ctor(System.String)"]
See Also
Reference
NotLicensedException Class
NotLicensedException Overload
Rhino.Runtime Namespace