RhinoCommon API
Light.CreateSunLight Method (Double, Double, Double)
 Constructs a light that represents the Sun.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Light CreateSunLight(
	double northAngleDegrees,
	double azimuthDegrees,
	double altitudeDegrees
)
Public Shared Function CreateSunLight (
	northAngleDegrees As Double,
	azimuthDegrees As Double,
	altitudeDegrees As Double
) As Light
Parameters
northAngleDegrees
Type: System.Double
The angle of North in degrees. North is the angle between positive World X axis and model North, as measured on World XY plane.
azimuthDegrees
Type: System.Double
The Azimuth angle value in degrees. Azimuth is the compass angle from North.
altitudeDegrees
Type: System.Double
The Altitude angle in degrees. Altitude is the angle above the ground plane.
Return Value
Type: Light
A new sun light.
Exceptions
Exception | Condition
RdkNotLoadedException | If the RDK is not loaded.
See Also
Reference
Light Class
CreateSunLight Overload
Rhino.Geometry Namespace