RhinoCommon API
GetCircle Constructor
Initializes a new instance of the GetCircle class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public GetCircle()
Public Sub New
See Also
Reference
GetCircle Class
Rhino.Input.Custom Namespace