RhinoCommon API
Analytics.Send Method (NameValueCollection)
 Advanced method for sending Google Analytics data. It is the caller's responsibility to make sure that all parameters passed will result in a valid Google Analytics hit. Failure to do so will result in Google Analytics ignoring your hit, and the caller will get no data. The Analytics class will populate data from the Application, the GoogleAnalyticsTrackingID, the User ID, and set the hit type "t" to "event". It also sets other information about the system.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Send(
	NameValueCollection data
)
Public Sub Send (
	data As NameValueCollection
)
Parameters
data
Type: System.Collections.Specialized.NameValueCollection
Name-Value pairs of data to send. Any valid Google Analytics Measurement Protocol parameter is allowed. No input validation is performed.
See Also
Reference
Analytics Class
Send Overload
Rhino.Runtime Namespace