RhinoCommon API
StatusBar.SetPointPane Method
 Sets the point pane to a point value.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void SetPointPane(
	Point3d point
)
Public Shared Sub SetPointPane (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
The point value.
See Also
Reference
StatusBar Class
Rhino.UI Namespace