RhinoCommon API
RhinoPageInterop.NewPropertiesPanelPagePointer Method
 For internal use only, provides access to unmanaged core
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static IntPtr NewPropertiesPanelPagePointer(
	ObjectPropertiesPage page,
	uint rhinoDocRuntimeSn
)
Public Shared Function NewPropertiesPanelPagePointer (
	page As ObjectPropertiesPage,
	rhinoDocRuntimeSn As UInteger
) As IntPtr
Parameters
page
Type: Rhino.UI.ObjectPropertiesPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.RhinoPageInterop.NewPropertiesPanelPagePointer(Rhino.UI.ObjectPropertiesPage,System.UInt32)"]
rhinoDocRuntimeSn
Type: System.UInt32
[Missing <param name="rhinoDocRuntimeSn"/> documentation for "M:Rhino.UI.RhinoPageInterop.NewPropertiesPanelPagePointer(Rhino.UI.ObjectPropertiesPage,System.UInt32)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.RhinoPageInterop.NewPropertiesPanelPagePointer(Rhino.UI.ObjectPropertiesPage,System.UInt32)"]
See Also
Reference
RhinoPageInterop Class
Rhino.UI Namespace