RhinoCommon API
RhinoViewport.GetUserString Method
 Gets a user string.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public string GetUserString(
	string key
)
Public Function GetUserString (
	key As String
) As String
Parameters
key
Type: System.String
id used to retrieve the string.
Return Value
Type: String
string associated with the key if successful. null if no key was found.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace