RhinoCommon API
RenderSettings Constructor
 Initialize a new instance of the RenderSettings class.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RenderSettings()
Public Sub New
See Also
Reference
RenderSettings Class
RenderSettings Overload
Rhino.Render Namespace