RhinoCommon API
FileSvg.Read Method
Read a Svg file into a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	FileSvgReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As FileSvgReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.FileSvgReadOptions
options used for importing the Svg file
Return Value
Type: Boolean
true on success
See Also
Reference
FileSvg Class
Rhino.FileIO Namespace