RhinoCommon API
HostUtils.RecordInitInstanceTime Method
 Used to help record times at startup with the -stopwatch flag to help determine bottlenecks in start up speed
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void RecordInitInstanceTime(
	string description
)
Public Shared Sub RecordInitInstanceTime (
	description As String
)
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.Runtime.HostUtils.RecordInitInstanceTime(System.String)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace