RhinoCommon API
WorldMapDayNight.Dispose Method
Releases all resources used by the WorldMapDayNight
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace