RhinoCommon API
RenderPipeline.NeedToProcessGeometryTable Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.NeedToProcessGeometryTable"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool NeedToProcessGeometryTable()
Protected Overridable Function NeedToProcessGeometryTable As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.NeedToProcessGeometryTable"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace