RhinoCommon API
RdkUndoRecord.Finalize Method
 Destructor for RdkUndoRecord
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RdkUndoRecord Class
Rhino.Render Namespace