RhinoCommon API
StackedDialogPage.SetActivePageTo Method
[Missing <summary> documentation for "M:Rhino.UI.StackedDialogPage.SetActivePageTo(System.String,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public bool SetActivePageTo(
	string pageName,
	bool documentPropertiesPage
)
Public Function SetActivePageTo (
	pageName As String,
	documentPropertiesPage As Boolean
) As Boolean
Parameters
pageName
Type: System.String
[Missing <param name="pageName"/> documentation for "M:Rhino.UI.StackedDialogPage.SetActivePageTo(System.String,System.Boolean)"]
documentPropertiesPage
Type: System.Boolean
[Missing <param name="documentPropertiesPage"/> documentation for "M:Rhino.UI.StackedDialogPage.SetActivePageTo(System.String,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.StackedDialogPage.SetActivePageTo(System.String,System.Boolean)"]
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace