RhinoCommon API
Layer.SetPerViewportVisible Method
 Controls layer visibility in specific viewports.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetPerViewportVisible(
	Guid viewportId,
	bool visible
)
Public Sub SetPerViewportVisible (
	viewportId As Guid,
	visible As Boolean
)
Parameters
viewportId
Type: System.Guid
 If not Guid.Empty, then the setting applies only to the viewport with the specified id. If Guid.Empty, then the setting applies to all viewports with per viewport layer settings.
visible
Type: System.Boolean
true to make layer visible, false to make layer invisible.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace