RhinoCommon API
BitmapExtensions.BitmapAsTextureFileReference Method
 Inserts bitmap into Rhino's texture manager and returns a FileReference.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
public static FileReference BitmapAsTextureFileReference(
	this Bitmap bitmap,
	uint crc
)
<ExtensionAttribute>
Public Shared Function BitmapAsTextureFileReference (
	bitmap As Bitmap,
	crc As UInteger
) As FileReference
Parameters
bitmap
Type: System.Drawing.Bitmap
The bitmap which will be referenced by the FileReference.
crc
Type: System.UInt32
The crc of the bitmap. This should be a unique number which changes if the contents of the bitmap changes. NOTE: if a different bitmap is provided using the same crc as a previous bitmap, then the previous bitmap will be overwritten in the texture manager and both previously returned FileReferences will reference the newly provided bitmap.
Return Value
Type: FileReference
[Missing <returns> documentation for "M:Rhino.BitmapExtensions.BitmapAsTextureFileReference(System.Drawing.Bitmap,System.UInt32)"]
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Bitmap. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BitmapExtensions Class
Rhino Namespace