RhinoCommon API
Linetype.GetUserStrings Method
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public NameValueCollection GetUserStrings()
Public Function GetUserStrings As NameValueCollection
Return Value
Type: NameValueCollection
A new collection.
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace