RhinoCommon API
File3dmRenderContent.ChildSlotOn Method
True if a particular child slot is 'on'.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ChildSlotOn(
	string child_slot_name
)
Public Function ChildSlotOn (
	child_slot_name As String
) As Boolean
Parameters
child_slot_name
Type: System.String
[Missing <param name="child_slot_name"/> documentation for "M:Rhino.FileIO.File3dmRenderContent.ChildSlotOn(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderContent.ChildSlotOn(System.String)"]
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace