RhinoCommon API
DisplayPipeline.GetLights Method
 Get lights that this pipeline is current using
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public Light[] GetLights()
Public Function GetLights As Light()
Return Value
Type: Light[]
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipeline.GetLights"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace