RhinoCommon API
MeshFaceNormalList.UnitizeFaceNormals Method
 Unitizes all the existing face normals.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool UnitizeFaceNormals()
Public Function UnitizeFaceNormals As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace