RhinoCommon API
GetLine Constructor
Initializes a new instance of the GetLine class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public GetLine()
Public Sub New
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace