RhinoCommon API
HatchLine.DashAt Method
 Get the dash length at the specified index.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double DashAt(
	int dashIndex
)
Public Function DashAt (
	dashIndex As Integer
) As Double
Parameters
dashIndex
Type: System.Int32
Index of the dash to get.
Return Value
Type: Double
The length of the dash. or gap if negative.
See Also
Reference
HatchLine Class
Rhino.DocObjects Namespace