RhinoCommon API
NamedParametersEventArgs.Set Method (String, Point)
 Set a Point value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Set(
	string name,
	Point value
)
Public Sub Set (
	name As String,
	value As Point
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Drawing.Point)"]
value
Type: System.Drawing.Point
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Drawing.Point)"]
See Also
Reference
NamedParametersEventArgs Class
Set Overload
Rhino.Runtime Namespace