RhinoCommon API
Mesh.CreateFromCylinder Method (Cylinder, Int32, Int32, Boolean, Boolean)
Constructs a mesh cylinder.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Mesh CreateFromCylinder(
	Cylinder cylinder,
	int vertical,
	int around,
	bool capBottom,
	bool capTop
)
Public Shared Function CreateFromCylinder (
	cylinder As Cylinder,
	vertical As Integer,
	around As Integer,
	capBottom As Boolean,
	capTop As Boolean
) As Mesh
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
[Missing <param name="cylinder"/> documentation for "M:Rhino.Geometry.Mesh.CreateFromCylinder(Rhino.Geometry.Cylinder,System.Int32,System.Int32,System.Boolean,System.Boolean)"]
vertical
Type: System.Int32
Number of faces in the top-to-bottom direction.
around
Type: System.Int32
Number of faces around the cylinder.
capBottom
Type: System.Boolean
If true end at Cylinder.Height1 should be capped.
capTop
Type: System.Boolean
If true end at Cylinder.Height2 should be capped.
Return Value
Type: Mesh
Returns a mesh cylinder if successful, null otherwise.
Exceptions
Exception | Condition
ArgumentException | Thrown when cylinder is invalid.
See Also
Reference
Mesh Class
CreateFromCylinder Overload
Rhino.Geometry Namespace