RhinoCommon API
ObjectAttributes.GetActiveInViewportOverrides Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.GetActiveInViewportOverrides(System.Guid[]@,System.Boolean@)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool GetActiveInViewportOverrides(
	out Guid[] viewportIds,
	out bool active
)
Public Function GetActiveInViewportOverrides (
	<OutAttribute> ByRef viewportIds As Guid(),
	<OutAttribute> ByRef active As Boolean
) As Boolean
Parameters
viewportIds
Type: System.Guid[]
[Missing <param name="viewportIds"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.GetActiveInViewportOverrides(System.Guid[]@,System.Boolean@)"]
active
Type: System.Boolean
[Missing <param name="active"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.GetActiveInViewportOverrides(System.Guid[]@,System.Boolean@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.GetActiveInViewportOverrides(System.Guid[]@,System.Boolean@)"]
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace