RhinoCommon API
RenderContent.SetRenderHash Method
Note: This API is now obsolete.
 This method is deprecated and no longer called. For more information see CalculateRenderHash(UInt64)
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("This method is deprecated and no longer called. For more information see CalculateRenderHash")]
public void SetRenderHash(
	uint hash
)
<ObsoleteAttribute("This method is deprecated and no longer called. For more information see CalculateRenderHash")>
Public Sub SetRenderHash (
	hash As UInteger
)
Parameters
hash
Type: System.UInt32
See Also
Reference
RenderContent Class
Rhino.Render Namespace