RhinoCommon API
Brep.DestroyRegionTopology Method
 Destroys a Brep's region topology information.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.13
Syntax
public void DestroyRegionTopology()
Public Sub DestroyRegionTopology
See Also
Reference
Brep Class
Rhino.Geometry Namespace