RhinoCommon API
ObjRef Constructor (Guid)
Note: This API is now obsolete.
 Initializes a new object reference from a globally unique identifier (Guid).
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use version that takes a document.")]
public ObjRef(
	Guid id
)
<ObsoleteAttribute("Use version that takes a document.")>
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
The ID.
See Also
Reference
ObjRef Class
ObjRef Overload
Rhino.DocObjects Namespace