RhinoCommon API
SimpleArrayArrayPoint3d.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SimpleArrayArrayPoint3d Class
Dispose Overload
Rhino.Runtime.InteropWrappers Namespace