RhinoCommon API
SubD.SharpEdgeCount Method
 Gets the number of sharp edges in this SubD. See IsSharp for what makes an edge sharp.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public uint SharpEdgeCount()
Public Function SharpEdgeCount As UInteger
Return Value
Type: UInt32
The number of sharp edges.
See Also
Reference
SubD Class
SharpEdgeCount Overload
Rhino.Geometry Namespace