RhinoCommon API
GetEllipsoid.GetMesh Method (Int32, Int32, Mesh)
 Prompt for the getting of a mesh ellipsoid.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Result GetMesh(
	ref int verticalFaces,
	ref int aroundFaces,
	out Mesh ellipsoid
)
Public Function GetMesh (
	ByRef verticalFaces As Integer,
	ByRef aroundFaces As Integer,
	<OutAttribute> ByRef ellipsoid As Mesh
) As Result
Parameters
verticalFaces
Type: System.Int32
The number of faces in the vertical direction.
aroundFaces
Type: System.Int32
The number of faces in the around direction
ellipsoid
Type: Rhino.Geometry.Mesh
The ellipsoid in Mesh form.
Return Value
Type: Result
The result of the getting operation.
See Also
Reference
GetEllipsoid Class
GetMesh Overload
Rhino.Input.Custom Namespace