RhinoCommon API
RhinoObject.ObjectFrame Method (RhinoObject.ObjectFrameFlags)
[Missing <summary> documentation for "M:Rhino.DocObjects.RhinoObject.ObjectFrame(Rhino.DocObjects.RhinoObject.ObjectFrameFlags)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Plane ObjectFrame(
	RhinoObject.ObjectFrameFlags flags
)
Public Function ObjectFrame (
	flags As RhinoObject.ObjectFrameFlags
) As Plane
Parameters
flags
Type: Rhino.DocObjects.RhinoObject.ObjectFrameFlags
[Missing <param name="flags"/> documentation for "M:Rhino.DocObjects.RhinoObject.ObjectFrame(Rhino.DocObjects.RhinoObject.ObjectFrameFlags)"]
Return Value
Type: Plane
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.ObjectFrame(Rhino.DocObjects.RhinoObject.ObjectFrameFlags)"]
See Also
Reference
RhinoObject Class
ObjectFrame Overload
Rhino.DocObjects Namespace