RhinoCommon API
ChangeQueue.ApplyLinearWorkflowChanges Method
 Override this when you want to handle linear workflow changes
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplyLinearWorkflowChanges(
	LinearWorkflow lw
)
Protected Overridable Sub ApplyLinearWorkflowChanges (
	lw As LinearWorkflow
)
Parameters
lw
Type: Rhino.Render.LinearWorkflow
[Missing <param name="lw"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyLinearWorkflowChanges(Rhino.Render.LinearWorkflow)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace