RhinoCommon API
RenderTexture.GetPreviewLocalMapping Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetPreviewLocalMapping"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool GetPreviewLocalMapping()
Public Function GetPreviewLocalMapping As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetPreviewLocalMapping"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace