RhinoCommon API
ObjectAttributes.HasHideInDetailOverrideSet Method
Is this object supposed to be hidden in a given detail
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public bool HasHideInDetailOverrideSet(
	Guid detailId
)
Public Function HasHideInDetailOverrideSet (
	detailId As Guid
) As Boolean
Parameters
detailId
Type: System.Guid
[Missing <param name="detailId"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.HasHideInDetailOverrideSet(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.HasHideInDetailOverrideSet(System.Guid)"]
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace