RhinoCommon API
RenderContentType.NewContentFromTypeId Method (Guid, RhinoDoc)
[Missing <summary> documentation for "M:Rhino.Render.RenderContentType.NewContentFromTypeId(System.Guid,Rhino.RhinoDoc)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public static RenderContent NewContentFromTypeId(
	Guid typeId,
	RhinoDoc doc
)
Public Shared Function NewContentFromTypeId (
	typeId As Guid,
	doc As RhinoDoc
) As RenderContent
Parameters
typeId
Type: System.Guid
[Missing <param name="typeId"/> documentation for "M:Rhino.Render.RenderContentType.NewContentFromTypeId(System.Guid,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.RenderContentType.NewContentFromTypeId(System.Guid,Rhino.RhinoDoc)"]
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.Render.RenderContentType.NewContentFromTypeId(System.Guid,Rhino.RhinoDoc)"]
See Also
Reference
RenderContentType Class
NewContentFromTypeId Overload
Rhino.Render Namespace