RhinoCommon API
NodeInCodeTable.TryGetIndex Method
 Gets the ComponentFunctionInfo at
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override bool TryGetIndex(
	GetIndexBinder binder,
	Object[] indexes,
	out Object result
)
Public Overrides Function TryGetIndex (
	binder As GetIndexBinder,
	indexes As Object(),
	<OutAttribute> ByRef result As Object
) As Boolean
Parameters
binder
Type: System.Dynamic.GetIndexBinder
The binder.
indexes
Type: System.Object[]
ONE string index.
result
Type: System.Object
The bound info.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.NodeInCode.NodeInCodeTable.TryGetIndex(System.Dynamic.GetIndexBinder,System.Object[],System.Object@)"]
See Also
Reference
NodeInCodeTable Class
Rhino.NodeInCode Namespace