RhinoCommon API
Vector2f.UnaryNegation Operator
 Computes the opposite vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector2f operator -(
	Vector2f vector
)
Public Shared Operator - (
	vector As Vector2f
) As Vector2f
Parameters
vector
Type: Rhino.Geometry.Vector2f
A vector to negate.
Return Value
Type: Vector2f
A new vector where all components were multiplied by -1.
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace