RhinoCommon API
Brep.CreateFromLoftRebuild Method (IEnumerable<Curve>, Point3d, Point3d, LoftType, Boolean, Int32)
 Constructs one or more Breps by lofting through a set of curves. Input for the loft is simplified by rebuilding to a specified number of control points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Brep[] CreateFromLoftRebuild(
	IEnumerable<Curve> curves,
	Point3d start,
	Point3d end,
	LoftType loftType,
	bool closed,
	int rebuildPointCount
)
Public Shared Function CreateFromLoftRebuild (
	curves As IEnumerable(Of Curve),
	start As Point3d,
	end As Point3d,
	loftType As LoftType,
	closed As Boolean,
	rebuildPointCount As Integer
) As Brep()
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
 The curves to loft through. This function will not perform any curve sorting. You must pass in curves in the order you want them lofted. This function will not adjust the directions of open curves. Use Curve.DoDirectionsMatch and Curve.Reverse to adjust the directions of open curves. This function will not adjust the seams of closed curves. Use Curve.ChangeClosedCurveSeam to adjust the seam of closed curves.
start
Type: Rhino.Geometry.Point3d
 Optional starting point of loft. Use Point3d.Unset if you do not want to include a start point.
end
Type: Rhino.Geometry.Point3d
 Optional ending point of lost. Use Point3d.Unset if you do not want to include an end point.
loftType
Type: Rhino.Geometry.LoftType
type of loft to perform.
closed
Type: System.Boolean
true if the last curve in this loft should be connected back to the first one.
rebuildPointCount
Type: System.Int32
A number of points to use while rebuilding the curves. 0 leaves turns this parameter off.
Return Value
Type: Brep[]
 Constructs a closed surface, continuing the surface past the last curve around to the first curve. Available when you have selected three shape curves.
See Also
Reference
Brep Class
CreateFromLoftRebuild Overload
Rhino.Geometry Namespace