RhinoCommon API
File3mf.Write Method
Write a 3mf file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	File3mfWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As File3mfWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.File3mfWriteOptions
options used for generating the Vda file
Return Value
Type: Boolean
true on success
See Also
Reference
File3mf Class
Rhino.FileIO Namespace