RhinoCommon API
RdkEdit.Execute Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RdkEdit.Execute(Rhino.Render.RenderContentCollection)"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public bool Execute(
	RenderContentCollection collection
)
Public Function Execute (
	collection As RenderContentCollection
) As Boolean
Parameters
collection
Type: Rhino.Render.RenderContentCollection
[Missing <param name="collection"/> documentation for "M:Rhino.Render.DataSources.RdkEdit.Execute(Rhino.Render.RenderContentCollection)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.DataSources.RdkEdit.Execute(Rhino.Render.RenderContentCollection)"]
See Also
Reference
RdkEdit Class
Rhino.Render.DataSources Namespace