RhinoCommon API
PageViewGroupTable.Add Method
 Adds a new page view group to the table. The new page view group will be given a unique name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Add()
Public Function Add As Integer
Return Value
Type: Int32
Index of new page view group if successful, -1 otherwise.
See Also
Reference
PageViewGroupTable Class
Add Overload
Rhino.DocObjects.Tables Namespace