RhinoCommon API
NamedParametersEventArgs.TryGetLine Method
 Get a line for the specified key
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool TryGetLine(
	string name,
	out Line value
)
Public Function TryGetLine (
	name As String,
	<OutAttribute> ByRef value As Line
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetLine(System.String,Rhino.Geometry.Line@)"]
value
Type: Rhino.Geometry.Line
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetLine(System.String,Rhino.Geometry.Line@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetLine(System.String,Rhino.Geometry.Line@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace