RhinoCommon API
SubD.CreateSubDBox Method (Box, Double, UInt32, UInt32, UInt32)
 Creates a SubD box from a Box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static SubD CreateSubDBox(
	Box box,
	double edgeSharpness,
	uint faceCountX,
	uint faceCountY,
	uint faceCountZ
)
Public Shared Function CreateSubDBox (
	box As Box,
	edgeSharpness As Double,
	faceCountX As UInteger,
	faceCountY As UInteger,
	faceCountZ As UInteger
) As SubD
Parameters
box
Type: Rhino.Geometry.Box
The box to build from. It must be valid.
edgeSharpness
Type: System.Double
 The sharpness to give the edges where box sides meet. See CreateSubDBox(IEnumerable<Point3d>, Double, UInt32, UInt32, UInt32).
faceCountX
Type: System.UInt32
Number of faces in the box X direction.
faceCountY
Type: System.UInt32
Number of faces in the box Y direction.
faceCountZ
Type: System.UInt32
Number of faces in the box Z direction.
Return Value
Type: SubD
A new SubD box, or null if the input is not valid.
See Also
Reference
SubD Class
CreateSubDBox Overload
Rhino.Geometry Namespace