RhinoCommon API
RenderSettings Constructor (RenderSettings)
 Initialize new instance of the RenderSettings class.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderSettings(
	RenderSettings source
)
Public Sub New (
	source As RenderSettings
)
Parameters
source
Type: Rhino.Render.RenderSettings
If not null, settings are copied from source.
See Also
Reference
RenderSettings Class
RenderSettings Overload
Rhino.Render Namespace