RhinoCommon API
ICommonComponentTable<T>.FindId Method
 Retrieves an object based on ID. You should prefer ID search over Index search.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
T FindId(
	Guid id
)
Function FindId (
	id As Guid
) As T
Parameters
id
Type: System.Guid
The id to search for.
Return Value
Type: T
A model component, or null if none was found.
See Also
Reference
ICommonComponentTable<T> Interface
Rhino.FileIO Namespace