RhinoCommon API
HatchLine Constructor (HatchLine)
 Construts a new hatch line.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public HatchLine(
	HatchLine hatchLine
)
Public Sub New (
	hatchLine As HatchLine
)
Parameters
hatchLine
Type: Rhino.DocObjects.HatchLine
The hatch line to copy.
See Also
Reference
HatchLine Class
HatchLine Overload
Rhino.DocObjects Namespace