RhinoCommon API
Dialogs.ShowNumberBox Method (String, String, Double, Double, Double)
 Displays Rhino's number edit box.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool ShowNumberBox(
	string title,
	string message,
	ref double number,
	double minimum,
	double maximum
)
Public Shared Function ShowNumberBox (
	title As String,
	message As String,
	ByRef number As Double,
	minimum As Double,
	maximum As Double
) As Boolean
Parameters
title
Type: System.String
The dialog title.
message
Type: System.String
The dialog message.
number
Type: System.Double
The default and return value.
minimum
Type: System.Double
The minimum allowable value.
maximum
Type: System.Double
The maximum allowable value.
Return Value
Type: Boolean
true of OK was clicked, false otherwise.
See Also
Reference
Dialogs Class
ShowNumberBox Overload
Rhino.UI Namespace