RhinoCommon API
GetCancel.Cancel Method
 Cancel all running tasks
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Cancel()
Public Sub Cancel
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace