RhinoCommon API
MetaDataProxy.SetContentInstanceId Method
 Set Content instance id for meta data
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public void SetContentInstanceId(
	Guid uuid
)
Public Sub SetContentInstanceId (
	uuid As Guid
)
Parameters
uuid
Type: System.Guid
[Missing <param name="uuid"/> documentation for "M:Rhino.Render.MetaDataProxy.SetContentInstanceId(System.Guid)"]
See Also
Reference
MetaDataProxy Class
Rhino.Render Namespace