RhinoCommon API
RuiUpdateUi.RegisterMenuItem Method (String, String, String, RuiUpdateUi.UpdateMenuItemEventHandler)
Register menu item update delegate
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public static bool RegisterMenuItem(
	string fileId,
	string menuId,
	string itemId,
	RuiUpdateUi.UpdateMenuItemEventHandler callBack
)
Public Shared Function RegisterMenuItem (
	fileId As String,
	menuId As String,
	itemId As String,
	callBack As RuiUpdateUi.UpdateMenuItemEventHandler
) As Boolean
Parameters
fileId
Type: System.String
Menu file Id
menuId
Type: System.String
Menu Id
itemId
Type: System.String
Menu item Id
callBack
Type: Rhino.UI.RuiUpdateUi.UpdateMenuItemEventHandler
[Missing <param name="callBack"/> documentation for "M:Rhino.UI.RuiUpdateUi.RegisterMenuItem(System.String,System.String,System.String,Rhino.UI.RuiUpdateUi.UpdateMenuItemEventHandler)"]
Return Value
Type: Boolean
true if Registered otherwise false
See Also
Reference
RuiUpdateUi Class
RegisterMenuItem Overload
Rhino.UI Namespace