RhinoCommon API
RenderTexture.IsNormalMap Method
 Return true if the texture is a normalmap. When creating a custom RenderTexture implementation of a normal map set the appropriate property on the CustomRenderContentAttribute decorator on that clas.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.16
Syntax
public bool IsNormalMap()
Public Function IsNormalMap As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.IsNormalMap"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace