RhinoCommon API
Brep.FilletSurfaceResults Constructor
Initializes a new instance of the Brep.FilletSurfaceResults class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FilletSurfaceResults()
Public Sub New
See Also
Reference
Brep.FilletSurfaceResults Class
Rhino.Geometry Namespace