RhinoCommon API
HostUtils.RhinoCommonExceptionHandler Method
 For internal use only!!! Unhanded exception handler, writes stack trace to RhinoDotNet.txt file
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void RhinoCommonExceptionHandler(
	string title,
	Object sender,
	Exception ex
)
Public Shared Sub RhinoCommonExceptionHandler (
	title As String,
	sender As Object,
	ex As Exception
)
Parameters
title
Type: System.String
 Exception title to write to text file
sender
Type: System.Object
[Missing <param name="sender"/> documentation for "M:Rhino.Runtime.HostUtils.RhinoCommonExceptionHandler(System.String,System.Object,System.Exception)"]
ex
Type: System.Exception
[Missing <param name="ex"/> documentation for "M:Rhino.Runtime.HostUtils.RhinoCommonExceptionHandler(System.String,System.Object,System.Exception)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace