RhinoCommon API
PlugIn.RaiseOnPlugInSettingsSavedEvent Method
 Raise any pending OnPlugInSettingsSaved events, the events are normally queued while a command is running and fired while Rhino is in an idle state. Calling this method will raise any pending changed events regardless of Rhino's current idle state or if a command is running.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void RaiseOnPlugInSettingsSavedEvent()
Public Shared Sub RaiseOnPlugInSettingsSavedEvent
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace