RhinoCommon API
ChangeQueue.ApplyLightChanges Method
 Override this when you want to handle light changes
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplyLightChanges(
	List<Light> lightChanges
)
Protected Overridable Sub ApplyLightChanges (
	lightChanges As List(Of Light)
)
Parameters
lightChanges
Type: System.Collections.Generic.List<Light>
[Missing <param name="lightChanges"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyLightChanges(System.Collections.Generic.List{Rhino.Render.ChangeQueue.Light})"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace