RhinoCommon API
ObjectTable.Add Method (GeometryBase, ObjectAttributes, HistoryRecord, Boolean)
 Adds geometry that is not further specified.
This is meant, for example, to handle addition of sets of different geometrical entities.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid Add(
	GeometryBase geometry,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function Add (
	geometry As GeometryBase,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
The base geometry. This cannot be null.
attributes
Type: Rhino.DocObjects.ObjectAttributes
The object attributes. This can be null.
history
Type: Rhino.DocObjects.HistoryRecord
The history information that will be saved.
reference
Type: System.Boolean
If reference is true, object will not be saved in the 3dm file.
Return Value
Type: Guid
The new object ID on success.
Exceptions
Exception | Condition
ArgumentNullException | If geometry is null.
See Also
Reference
ObjectTable Class
Add Overload
Rhino.DocObjects.Tables Namespace