RhinoCommon API
Brep.CreatePlanarBreps Method (IEnumerable<Curve>)
Note: This API is now obsolete.
 Constructs a set of planar breps as outlines by the loops.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use version that takes tolerance as input")]
public static Brep[] CreatePlanarBreps(
	IEnumerable<Curve> inputLoops
)
<ObsoleteAttribute("Use version that takes tolerance as input")>
Public Shared Function CreatePlanarBreps (
	inputLoops As IEnumerable(Of Curve)
) As Brep()
Parameters
inputLoops
Type: System.Collections.Generic.IEnumerable<Curve>
Curve loops that delineate the planar boundaries.
Return Value
Type: Brep[]
An array of Planar Breps.
See Also
Reference
Brep Class
CreatePlanarBreps Overload
Rhino.Geometry Namespace