RhinoCommon API
SubD.CreateFromSweep Method (NurbsCurve, NurbsCurve, IEnumerable<NurbsCurve>, Boolean, Boolean)
 Fits a SubD through a series of profile curves that define the SubD cross-sections and two curves that defines SubD edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static SubD CreateFromSweep(
	NurbsCurve rail1,
	NurbsCurve rail2,
	IEnumerable<NurbsCurve> shapes,
	bool closed,
	bool addCorners
)
Public Shared Function CreateFromSweep (
	rail1 As NurbsCurve,
	rail2 As NurbsCurve,
	shapes As IEnumerable(Of NurbsCurve),
	closed As Boolean,
	addCorners As Boolean
) As SubD
Parameters
rail1
Type: Rhino.Geometry.NurbsCurve
The first SubD-friendly NURBS curve to sweep along.
rail2
Type: Rhino.Geometry.NurbsCurve
The second SubD-friendly NURBS curve to sweep along.
shapes
Type: System.Collections.Generic.IEnumerable<NurbsCurve>
An enumeration of SubD-friendly NURBS curves to sweep through.
closed
Type: System.Boolean
Creates a SubD that is closed in the rail curve direction.
addCorners
Type: System.Boolean
With open curves, adds creased vertices to the SubD at both ends of the first and last curves.
Return Value
Type: SubD
A new SubD if successful, or null on failure.
Remarks
 Shape curves must be in the proper order and orientation. Shape curves must have the same point counts and rail curves must have the same point counts. Shape curves will relocated to the nearest pair of Greville points on the rails. Shape curves will be made at each pair of rail edit points where there isn't an input shape.
See Also
Reference
SubD Class
CreateFromSweep Overload
Rhino.Geometry Namespace