RhinoCommon API
RhDisplayPoint Constructor
Initializes a new instance of the RhDisplayPoint class
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RhDisplayPoint(
	Point3d location
)
Public Sub New (
	location As Point3d
)
Parameters
location
Type: Rhino.Geometry.Point3d
[Missing <param name="location"/> documentation for "M:Rhino.Runtime.InteropWrappers.RhDisplayPoint.#ctor(Rhino.Geometry.Point3d)"]
See Also
Reference
RhDisplayPoint Structure
Rhino.Runtime.InteropWrappers Namespace