RhinoCommon API
HostUtils.RegisterComputeEndpoint Method
 Register a class that can participate as a compute endpoint
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static void RegisterComputeEndpoint(
	string endpointPath,
	Type t
)
Public Shared Sub RegisterComputeEndpoint (
	endpointPath As String,
	t As Type
)
Parameters
endpointPath
Type: System.String
[Missing <param name="endpointPath"/> documentation for "M:Rhino.Runtime.HostUtils.RegisterComputeEndpoint(System.String,System.Type)"]
t
Type: System.Type
[Missing <param name="t"/> documentation for "M:Rhino.Runtime.HostUtils.RegisterComputeEndpoint(System.String,System.Type)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace