RhinoCommon API
Surface.IsTorus Method
Determines if the surface is a portion of a torus within RhinoMath.ZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsTorus()
Public Function IsTorus As Boolean
Return Value
Type: Boolean
true if the surface is a portion of a torus.
See Also
Reference
Surface Class
IsTorus Overload
Rhino.Geometry Namespace