RhinoCommon API
RenderContentSerializer.Write Method
 Called to save a custom RenderContent object as an external file.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public abstract bool Write(
	string pathToFile,
	RenderContent renderContent,
	CreatePreviewEventArgs previewArgs
)
Public MustOverride Function Write (
	pathToFile As String,
	renderContent As RenderContent,
	previewArgs As CreatePreviewEventArgs
) As Boolean
Parameters
pathToFile
Type: System.String
 Full path of file to write
renderContent
Type: Rhino.Render.RenderContent
 Render content to save
previewArgs
Type: Rhino.Render.CreatePreviewEventArgs
 Parameters used to generate a preview image which may be embedded in the exported file.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContentSerializer.Write(System.String,Rhino.Render.RenderContent,Rhino.Render.CreatePreviewEventArgs)"]
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace