RhinoCommon API
Mesh.Flip Method (Boolean, Boolean, Boolean, Boolean)
Reverses the direction of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Flip(
	bool vertexNormals,
	bool faceNormals,
	bool faceOrientation,
	bool ngonsBoundaryDirection
)
Public Sub Flip (
	vertexNormals As Boolean,
	faceNormals As Boolean,
	faceOrientation As Boolean,
	ngonsBoundaryDirection As Boolean
)
Parameters
vertexNormals
Type: System.Boolean
If true, vertex normals will be reversed.
faceNormals
Type: System.Boolean
If true, face normals will be reversed.
faceOrientation
Type: System.Boolean
If true, face orientations will be reversed.
ngonsBoundaryDirection
Type: System.Boolean
If true, ngon boundaries will be reversed
See Also
Reference
Mesh Class
Flip Overload
Rhino.Geometry Namespace