RhinoCommon API
File3dmObjectTable.AddSubD Method (SubD)
 Adds a SubD to the document
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Guid AddSubD(
	SubD subd
)
Public Function AddSubD (
	subd As SubD
) As Guid
Parameters
subd
Type: Rhino.Geometry.SubD
the Subd to add
Return Value
Type: Guid
A unique identifier for the SubD, or Empty on failure
See Also
Reference
File3dmObjectTable Class
AddSubD Overload
Rhino.FileIO Namespace