RhinoCommon API
Command.GetCommandStyle Method
 Returns a command's style flags.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Style GetCommandStyle(
	Guid commandId
)
Public Shared Function GetCommandStyle (
	commandId As Guid
) As Style
Parameters
commandId
Type: System.Guid
A command ID.
Return Value
Type: Style
The command's style flags, or None if the command is not found.
See Also
Reference
Command Class
Rhino.Commands Namespace