RhinoCommon API
ViewportInfo.UnlockCamera Method
 Unlocks the camera vectors and location.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void UnlockCamera()
Public Sub UnlockCamera
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace