RhinoCommon API
RenderPrimitiveList.Material Method
 Call this method to get the render material associated with the mesh at the specified index. Will return null if there is no material associated with the requested mesh.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public RenderMaterial Material(
	int index
)
Public Function Material (
	index As Integer
) As RenderMaterial
Parameters
index
Type: System.Int32
 The zero based index of the item in the list. Valid values are greater than or equal to 0 and less than Count.
Return Value
Type: RenderMaterial
 If there is a render material associated at the requested index then the material is returned otherwise null is returned.
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace