RhinoCommon API
File3dmObjectTable.AddInstanceObject Method (InstanceReferenceGeometry)
 Adds an instance reference geometry object to the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public Guid AddInstanceObject(
	InstanceReferenceGeometry instanceReference
)
Public Function AddInstanceObject (
	instanceReference As InstanceReferenceGeometry
) As Guid
Parameters
instanceReference
Type: Rhino.Geometry.InstanceReferenceGeometry
The instance reference geometry object.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddInstanceObject Overload
Rhino.FileIO Namespace