RhinoCommon API
SnapShotsClient.ExtendBoundingBoxForObjectAnimation Method
 Called once at the start of an animation. This can be used to extend the scene bounding box to avoid clipping.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract void ExtendBoundingBoxForObjectAnimation(
	RhinoDoc doc,
	RhinoObject doc_object,
	ref Transform transform,
	BinaryArchiveReader archive_start,
	BinaryArchiveReader archive_stop,
	ref BoundingBox bbox
)
Public MustOverride Sub ExtendBoundingBoxForObjectAnimation (
	doc As RhinoDoc,
	doc_object As RhinoObject,
	ByRef transform As Transform,
	archive_start As BinaryArchiveReader,
	archive_stop As BinaryArchiveReader,
	ByRef bbox As BoundingBox
)
Parameters
doc
Type: Rhino.RhinoDoc
doc is the current document.
doc_object
Type: Rhino.DocObjects.RhinoObject
doc_obj is the current object.
transform
Type: Rhino.Geometry.Transform
transform is a transformation matrix. The matrix is set to identity the first time an object is associated with a snapshot. After that the matrix is updated when the object is transformed(scale, rotate etc.).
archive_start
Type: Rhino.FileIO.BinaryArchiveReader
archive_start is a archive to the data of the starting position.
archive_stop
Type: Rhino.FileIO.BinaryArchiveReader
archive_stop is a archive to the data of the ending position.
bbox
Type: Rhino.Geometry.BoundingBox
bbox is the current scene bounding box.
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace