RhinoCommon API
RenderWindow.Channel.SetValues Method
 Set a pixel buffer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetValues(
	Rectangle rectangle,
	Size bufferResolution,
	PixelBuffer colorBuffer
)
Public Sub SetValues (
	rectangle As Rectangle,
	bufferResolution As Size,
	colorBuffer As PixelBuffer
)
Parameters
rectangle
Type: System.Drawing.Rectangle
[Missing <param name="rectangle"/> documentation for "M:Rhino.Render.RenderWindow.Channel.SetValues(System.Drawing.Rectangle,System.Drawing.Size,Rhino.Render.PixelBuffer)"]
bufferResolution
Type: System.Drawing.Size
[Missing <param name="bufferResolution"/> documentation for "M:Rhino.Render.RenderWindow.Channel.SetValues(System.Drawing.Rectangle,System.Drawing.Size,Rhino.Render.PixelBuffer)"]
colorBuffer
Type: Rhino.Render.PixelBuffer
PixelBuffer to a color buffer of floats in RGBA format.
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace