RhinoCommon API
Skin.OnEndLoadPlugIn Method
Is called after each plug-in has been loaded.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnEndLoadPlugIn()
Protected Overridable Sub OnEndLoadPlugIn
See Also
Reference
Skin Class
Rhino.Runtime Namespace