RhinoCommon API
NamedParametersEventArgs.Set Method (String, GeometryBase)
 Set geometry for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Set(
	string name,
	GeometryBase value
)
Public Sub Set (
	name As String,
	value As GeometryBase
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.GeometryBase)"]
value
Type: Rhino.Geometry.GeometryBase
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.GeometryBase)"]
See Also
Reference
NamedParametersEventArgs Class
Set Overload
Rhino.Runtime Namespace