RhinoCommon API
RenderPipeline.SetAsyncRenderContext Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.SetAsyncRenderContext(Rhino.Render.AsyncRenderContext@)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetAsyncRenderContext(
	ref AsyncRenderContext aRC
)
Public Sub SetAsyncRenderContext (
	ByRef aRC As AsyncRenderContext
)
Parameters
aRC
Type: Rhino.Render.AsyncRenderContext
[Missing <param name="aRC"/> documentation for "M:Rhino.Render.RenderPipeline.SetAsyncRenderContext(Rhino.Render.AsyncRenderContext@)"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace