RhinoCommon API
LengthUnit.Equals Method (Object)
 Indicates whether the current object is equal to another object of the same type.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object other
)
Public Overrides Function Equals (
	other As Object
) As Boolean
Parameters
other
Type: System.Object
Return Value
Type: Boolean
true if the current object is equal to the other object otherwise false.
See Also
Reference
LengthUnit Structure
Equals Overload
Rhino Namespace