RhinoCommon API
RenderPlugIn.EnableAssignMaterialButton Method
 Called to enable/disable the "Material" button located on the "Material" tab in the Properties and Layer dialog boxes. The default return value is false which will disable the button. If the button is disabled then the OnAssignMaterial function is never called.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.12
Syntax
public virtual bool EnableAssignMaterialButton()
Public Overridable Function EnableAssignMaterialButton As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.RenderPlugIn.EnableAssignMaterialButton"]
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace