RhinoCommon API
File3dmMaterialTable.FindIndex Method
 Retrieves a material based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Material FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As Material
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: Material
A material, or null if none was found.
See Also
Reference
File3dmMaterialTable Class
Rhino.FileIO Namespace