RhinoCommon API
IStackedDialogPageService.GetNativePageWindow Method (Object, Boolean, Boolean, Object, Object)
 Get the unmanaged pointer associated with the pages content control
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
IntPtr GetNativePageWindow(
	Object pageObject,
	bool isRhinoPanel,
	bool applyPanelStyles,
	out Object nativeWindowObject,
	out Object host
)
Function GetNativePageWindow (
	pageObject As Object,
	isRhinoPanel As Boolean,
	applyPanelStyles As Boolean,
	<OutAttribute> ByRef nativeWindowObject As Object,
	<OutAttribute> ByRef host As Object
) As IntPtr
Parameters
pageObject
Type: System.Object
[Missing <param name="pageObject"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Boolean,System.Boolean,System.Object@,System.Object@)"]
isRhinoPanel
Type: System.Boolean
[Missing <param name="isRhinoPanel"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Boolean,System.Boolean,System.Object@,System.Object@)"]
applyPanelStyles
Type: System.Boolean
[Missing <param name="applyPanelStyles"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Boolean,System.Boolean,System.Object@,System.Object@)"]
nativeWindowObject
Type: System.Object
[Missing <param name="nativeWindowObject"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Boolean,System.Boolean,System.Object@,System.Object@)"]
host
Type: System.Object
[Missing <param name="host"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Boolean,System.Boolean,System.Object@,System.Object@)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Boolean,System.Boolean,System.Object@,System.Object@)"]
See Also
Reference
IStackedDialogPageService Interface
GetNativePageWindow Overload
Rhino.UI Namespace