RhinoCommon API
File3dm.WriteOneObject Method
 Creates a simple 3dm file that contains a single geometric object.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool WriteOneObject(
	string path,
	GeometryBase geometry
)
Public Shared Function WriteOneObject (
	path As String,
	geometry As GeometryBase
) As Boolean
Parameters
path
Type: System.String
Path to the 3dm file to create.
geometry
Type: Rhino.Geometry.GeometryBase
 The geometry to be saved in the archive's object table. This is typically a Curve, Surface, Brep, Mesh, or SubD.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace