RhinoCommon API
Mesh.CreateQuickHull3D Method (PointCloud)
 Attempts to create a 3d convex hull mesh from an input point cloud using the QuickHull algorithm. Hull faces whose shared edges are not clearly convex are merged, so faces of the resulting mesh may be triangles, quads, or larger convex polygons (returned as mesh ngons).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Mesh CreateQuickHull3D(
	PointCloud pointCloud
)
Public Shared Function CreateQuickHull3D (
	pointCloud As PointCloud
) As Mesh
Parameters
pointCloud
Type: Rhino.Geometry.PointCloud
The point cloud to be covered with the convex hull. At least four points are required, and they must not be coincident, colinear, or coplanar.
Return Value
Type: Mesh
A valid mesh if successful. If there were too few input points, or the input was degenerate (coincident, colinear, or coplanar), the result is null.
See Also
Reference
Mesh Class
CreateQuickHull3D Overload
Rhino.Geometry Namespace