RhinoCommon API
RenderPipeline.SupportsPause Method
 Override and return true if the renderer supports pausing
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool SupportsPause()
Public Overridable Function SupportsPause As Boolean
Return Value
Type: Boolean
true if pausing is supported, false otherwise
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace