RhinoCommon API
BinaryArchiveReader.ReadUShort Method
 Reads a UInt16 from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ushort ReadUShort()
Public Function ReadUShort As UShort
Return Value
Type: UInt16
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace