RhinoCommon API
ObjectAttributes.IsInGroup Method
 Determines if an object belong to a group or not.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool IsInGroup(
	int groupIndex
)
Public Function IsInGroup (
	groupIndex As Integer
) As Boolean
Parameters
groupIndex
Type: System.Int32
The index that will be tested.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.IsInGroup(System.Int32)"]
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace