RhinoCommon API
Curve.CreateBooleanUnion Method (IEnumerable<Curve>)
Note: This API is now obsolete.
 Calculates the boolean union of two or more closed, planar curves. Note, curves must be co-planar.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use version that takes tolerance as input")]
public static Curve[] CreateBooleanUnion(
	IEnumerable<Curve> curves
)
<ObsoleteAttribute("Use version that takes tolerance as input")>
Public Shared Function CreateBooleanUnion (
	curves As IEnumerable(Of Curve)
) As Curve()
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
The co-planar curves to union.
Return Value
Type: Curve[]
Result curves on success, empty array if no union could be calculated.
See Also
Reference
Curve Class
CreateBooleanUnion Overload
Rhino.Geometry Namespace