RhinoCommon API
SurfaceCurvature.CreateFromSurface Method
 Create a SurfaceCurvature from by evaluating surface and a u,v parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static SurfaceCurvature CreateFromSurface(
	Surface surface,
	double u,
	double v
)
Public Shared Function CreateFromSurface (
	surface As Surface,
	u As Double,
	v As Double
) As SurfaceCurvature
Parameters
surface
Type: Rhino.Geometry.Surface
The surface to evaluate.
u
Type: System.Double
A U parameter.
v
Type: System.Double
A V parameter.
Return Value
Type: SurfaceCurvature
A SurfaceCurvature if successful, null otherwise.
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace