RhinoCommon API
SurfaceFilletBase.IsInitialized Method
 Check to see if the fillet is properly initialized. If it is not, then the selected curves, surfaces, and/or radius must be adjusted in some way before creating the fillet
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsInitialized()
Public Function IsInitialized As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SurfaceFilletBase.IsInitialized"]
See Also
Reference
SurfaceFilletBase Class
Rhino.Geometry Namespace