RhinoCommon API
ClippingPlaneObject.RemoveClipViewport Method
 Removes a viewport from the list of viewports that this clipping plane clips.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public bool RemoveClipViewport(
	RhinoViewport viewport,
	bool commit
)
Public Function RemoveClipViewport (
	viewport As RhinoViewport,
	commit As Boolean
) As Boolean
Parameters
viewport
Type: Rhino.Display.RhinoViewport
The viewport to remove.
commit
Type: System.Boolean
Commit the change. When in doubt, set this parameter to true.
Return Value
Type: Boolean
true if the viewport was removed, false if the viewport was not in the list.
See Also
Reference
ClippingPlaneObject Class
Rhino.DocObjects Namespace