RhinoCommon API
File3dmObjectTable.AddInstanceObject Method (Int32, Transform)
 Adds an instance reference geometry object to the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public Guid AddInstanceObject(
	int instanceDefinitionIndex,
	Transform instanceXform
)
Public Function AddInstanceObject (
	instanceDefinitionIndex As Integer,
	instanceXform As Transform
) As Guid
Parameters
instanceDefinitionIndex
Type: System.Int32
The index of the instance definition geometry object.
instanceXform
Type: Rhino.Geometry.Transform
The transformation.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddInstanceObject Overload
Rhino.FileIO Namespace