RhinoCommon API
NamedParametersEventArgs.TryGetMeshParameters Method
 Get an MeshingParameters for the specified key
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool TryGetMeshParameters(
	string name,
	out MeshingParameters value
)
Public Function TryGetMeshParameters (
	name As String,
	<OutAttribute> ByRef value As MeshingParameters
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetMeshParameters(System.String,Rhino.Geometry.MeshingParameters@)"]
value
Type: Rhino.Geometry.MeshingParameters
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetMeshParameters(System.String,Rhino.Geometry.MeshingParameters@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetMeshParameters(System.String,Rhino.Geometry.MeshingParameters@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace