RhinoCommon API
ObjectTable.ModifyRenderMaterial Method (ObjRef, RenderMaterial)
 Modifies an object's render material assignment, this will set the objects material source to ObjectMaterialSource.MaterialFromObject.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool ModifyRenderMaterial(
	ObjRef objRef,
	RenderMaterial material
)
Public Function ModifyRenderMaterial (
	objRef As ObjRef,
	material As RenderMaterial
) As Boolean
Parameters
objRef
Type: Rhino.DocObjects.ObjRef
Object to modify.
material
Type: Rhino.Render.RenderMaterial
 Material to assign to this object.
Return Value
Type: Boolean
 Returns true on success otherwise returns false.
See Also
Reference
ObjectTable Class
ModifyRenderMaterial Overload
Rhino.DocObjects.Tables Namespace