RhinoCommon API
RhinoApp.ChangeLicenseKey Method
 Display UI asking the user to enter a license for the product specified by licenseId.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool ChangeLicenseKey(
	Guid pluginId
)
Public Shared Function ChangeLicenseKey (
	pluginId As Guid
) As Boolean
Parameters
pluginId
Type: System.Guid
Guid identifying the plug-in that is requesting a change of license key
Return Value
Type: Boolean
true on success, false otherwise
See Also
Reference
RhinoApp Class
Rhino Namespace