RhinoCommon API
Utilities.ShowContentNewExistingBrowser Method
 Shows the Content New / Existing Browser to allow the user to select a new or existing content, or multiple contents.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Utilities.ContentNewExistingResults ShowContentNewExistingBrowser(
	RhinoDoc doc,
	Guid defaultType,
	Guid defaultInstanceId,
	RenderContentKind kinds,
	Utilities.ContentNewExistingFlags flags,
	string presetCategory,
	IEnumerable<string> categories,
	IEnumerable<Guid> types,
	out Guid[] contents
)
Public Shared Function ShowContentNewExistingBrowser (
	doc As RhinoDoc,
	defaultType As Guid,
	defaultInstanceId As Guid,
	kinds As RenderContentKind,
	flags As Utilities.ContentNewExistingFlags,
	presetCategory As String,
	categories As IEnumerable(Of String),
	types As IEnumerable(Of Guid),
	<OutAttribute> ByRef contents As Guid()
) As Utilities.ContentNewExistingResults
Parameters
doc
Type: Rhino.RhinoDoc
A Rhino document.
defaultType
Type: System.Guid
The content type that will be initially selected in the 'New' tab.
defaultInstanceId
Type: System.Guid
The content instance that will be initially selected in the 'Existing' tab.
kinds
Type: Rhino.Render.RenderContentKind
Semicolon-delimited string specifying which content kinds will be displayed.
flags
Type: Rhino.Render.Utilities.ContentNewExistingFlags
Flags controlling the browser (tabs to hide, type of selection).
presetCategory
Type: System.String
Specifies the category to preset in the drop-down list on the 'New' tab. If this string is empty, the preset category will be 'All'.
categories
Type: System.Collections.Generic.IEnumerable<String>
Specifies the categories to display. Render contents that do not belong to one of these categories will not be listed. If this array is empty, all render contents from all categories will be listed.
types
Type: System.Collections.Generic.IEnumerable<Guid>
Specifies content types to display. Contents that are not one of these types will not be listed. If this array is empty, all content types will be listed.
contents
Type: System.Guid[]
Array of Guid(s) of the chosen item(s). Depending on the result, this can accept type id(s) of content type(s) or instance id(s) of existing content(s).
Return Value
Type: Utilities.ContentNewExistingResults
The result of displaying the browser.
See Also
Reference
Utilities Class
Rhino.Render Namespace