RhinoCommon API
PersistentSettings.DeleteChild Method
 Call this method to delete a child settings key.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DeleteChild(
	string key
)
Public Sub DeleteChild (
	key As String
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.DeleteChild(System.String)"]
See Also
Reference
PersistentSettings Class
Rhino Namespace