RhinoCommon API
ObjectTable.Replace Method (Guid, TextDot)
Replaces one object with new text dot object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Replace(
	Guid objectId,
	TextDot dot
)
Public Function Replace (
	objectId As Guid,
	dot As TextDot
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
dot
Type: Rhino.Geometry.TextDot
new text dot to be added. The text dot is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace