RhinoCommon API
RenderWindow.GetRequestedRenderChannels Method
 Get array of Guids representing the channels requested by the post effect pipeline for this RenderWindow.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Guid[] GetRequestedRenderChannels()
Public Function GetRequestedRenderChannels As Guid()
Return Value
Type: Guid[]
Array of Guid
See Also
Reference
RenderWindow Class
Rhino.Render Namespace