RhinoCommon API
ProxyObject.CreateMeshes Method
 Create meshes used to render and analyze surface and polysurface objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Since: 5.0
Syntax
public override int CreateMeshes(
	MeshType meshType,
	MeshingParameters parameters,
	bool ignoreCustomParameters
)
Public Overrides Function CreateMeshes (
	meshType As MeshType,
	parameters As MeshingParameters,
	ignoreCustomParameters As Boolean
) As Integer
Parameters
meshType
Type: Rhino.Geometry.MeshType
type of meshes to create
parameters
Type: Rhino.Geometry.MeshingParameters
 in parameters that control the quality of the meshes that are created
ignoreCustomParameters
Type: System.Boolean
 Default should be false. Should the object ignore any custom meshing parameters on the object's attributes
Return Value
Type: Int32
number of meshes created
See Also
Reference
ProxyObject Class
Rhino.DocObjects Namespace