RhinoCommon API
NurbsSurfaceKnotList.RemoveMultipleKnots Method
Remove multiple knots from this surface
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int RemoveMultipleKnots(
	int minimumMultiplicity,
	int maximumMultiplicity,
	double tolerance
)
Public Function RemoveMultipleKnots (
	minimumMultiplicity As Integer,
	maximumMultiplicity As Integer,
	tolerance As Double
) As Integer
Parameters
minimumMultiplicity
Type: System.Int32
 Remove knots with multiplicity > minimumKnotMultiplicity
maximumMultiplicity
Type: System.Int32
 Remove knots with multiplicity < maximumKnotMultiplicity
tolerance
Type: System.Double
 When you remove knots, the shape of the surface is changed. If tolerance is RhinoMath.UnsetValue, any amount of change is permitted. If tolerance is >=0, the maximum distance between the input and output surface is restricted to be <= tolerance.
Return Value
Type: Int32
number of knots removed on success. 0 if no knots were removed
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace