RhinoCommon API
MeshVertexList.Point3dAt Method
 Get double precision location at a given index
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public Point3d Point3dAt(
	int index
)
Public Function Point3dAt (
	index As Integer
) As Point3d
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Geometry.Collections.MeshVertexList.Point3dAt(System.Int32)"]
Return Value
Type: Point3d
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.MeshVertexList.Point3dAt(System.Int32)"]
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace