RhinoCommon API
LOC.STR Method (String, Int32)
Note: This API is now obsolete.
DO NOT use this function, it is a trap to determine where context IDs have been copied from other, already extracted, strings.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[ObsoleteAttribute("Don't copy and paste context IDs", true)]
public static string STR(
	string english,
	int contextid
)
<ObsoleteAttribute("Don't copy and paste context IDs", true)>
Public Shared Function STR (
	english As String,
	contextid As Integer
) As String
Parameters
english
Type: System.String
The English name.
contextid
Type: System.Int32
Copied context id.
Return Value
Type: String
English name.
See Also
Reference
LOC Class
STR Overload
Rhino.UI Namespace