RhinoCommon API
ChangeQueue.ApplyViewChange Method
 Override ApplyViewChange when you want to receive changes to the view/camera
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplyViewChange(
	ViewInfo viewInfo
)
Protected Overridable Sub ApplyViewChange (
	viewInfo As ViewInfo
)
Parameters
viewInfo
Type: Rhino.DocObjects.ViewInfo
The ViewInfo with the changes
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace