RhinoCommon API
RhinoObject.ObjectFrame Method
[Missing <summary> documentation for "M:Rhino.DocObjects.RhinoObject.ObjectFrame"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Plane ObjectFrame()
Public Function ObjectFrame As Plane
Return Value
Type: Plane
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.ObjectFrame"]
See Also
Reference
RhinoObject Class
ObjectFrame Overload
Rhino.DocObjects Namespace