RhinoCommon API
Thumbnail.Dispose Method
 Dispose for Thumbnail
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace