RhinoCommon API
SubDComponentParameter.Equals Method (SubDComponentParameter)
Indicates whether the current object is equal to another object of the same type.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Equals(
	SubDComponentParameter other
)
Public Function Equals (
	other As SubDComponentParameter
) As Boolean
Parameters
other
Type: Rhino.Geometry.SubDComponentParameter
An object to compare with this object.
Return Value
Type: Boolean
true if the current object is equal to the other parameter; otherwise, false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
SubDComponentParameter Structure
Equals Overload
Rhino.Geometry Namespace