RhinoCommon API
GetLine.EnableFromBothSidesOption Method
 If true, then the "BothSides" option shows up when the start point is interactively picked.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public void EnableFromBothSidesOption(
	bool on
)
Public Sub EnableFromBothSidesOption (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Input.Custom.GetLine.EnableFromBothSidesOption(System.Boolean)"]
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace