RhinoCommon API
PreviewAppearance.ToMetaData Method (MetaDataProxy)
 Copy PreviewAppearance to MetaData
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public void ToMetaData(
	MetaDataProxy mdp
)
Public Sub ToMetaData (
	mdp As MetaDataProxy
)
Parameters
mdp
Type: Rhino.Render.MetaDataProxy
[Missing <param name="mdp"/> documentation for "M:Rhino.Render.PreviewAppearance.ToMetaData(Rhino.Render.MetaDataProxy)"]
See Also
Reference
PreviewAppearance Class
ToMetaData Overload
Rhino.Render Namespace