RhinoCommon API
CustomBrepObject.Dispose Method (Boolean)
Releases the unmanaged resources used by the CustomBrepObject and optionally releases the managed resources
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Dispose(
	bool disposing
)
Protected Overrides Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
CustomBrepObject Class
Dispose Overload
Rhino.DocObjects.Custom Namespace