RhinoCommon API
RenderContentSerializer.ReportContentAndFile Method
 This is called from your implementation of LoadMultiple() to add a content and the file it was loaded from when the LoadMultipleFlags.Preload flag is NOT set. See LoadMultiple() for an explanation of this method's use.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public virtual void ReportContentAndFile(
	RenderContent renderContent,
	string pathToFile,
	int flags
)
Public Overridable Sub ReportContentAndFile (
	renderContent As RenderContent,
	pathToFile As String,
	flags As Integer
)
Parameters
renderContent
Type: Rhino.Render.RenderContent
 Render content that was loaded from the file.
pathToFile
Type: System.String
 Full path of the file that the render content was loaded from.
flags
Type: System.Int32
 Flags for future use; should be passed as zero.
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace