RhinoCommon API
Mesh.CreateContourCurves Method (Mesh, Point3d, Point3d, Double)
Note: This API is now obsolete.
 (Old call maintained for compatibility.)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Prefer the overload that takes a tolerance value.")]
public static Curve[] CreateContourCurves(
	Mesh meshToContour,
	Point3d contourStart,
	Point3d contourEnd,
	double interval
)
<ObsoleteAttribute("Prefer the overload that takes a tolerance value.")>
Public Shared Function CreateContourCurves (
	meshToContour As Mesh,
	contourStart As Point3d,
	contourEnd As Point3d,
	interval As Double
) As Curve()
Parameters
meshToContour
Type: Rhino.Geometry.Mesh
Avoid.
contourStart
Type: Rhino.Geometry.Point3d
Avoid.
contourEnd
Type: Rhino.Geometry.Point3d
Avoid.
interval
Type: System.Double
Avoid.
Return Value
Type: Curve[]
Avoid.
See Also
Reference
Mesh Class
CreateContourCurves Overload
Rhino.Geometry Namespace