RhinoCommon API
RenderWindow.SetSize Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.SetSize(System.Drawing.Size)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetSize(
	Size size
)
Public Sub SetSize (
	size As Size
)
Parameters
size
Type: System.Drawing.Size
[Missing <param name="size"/> documentation for "M:Rhino.Render.RenderWindow.SetSize(System.Drawing.Size)"]
See Also
Reference
RenderWindow Class
Rhino.Render Namespace