RhinoCommon API
DevelopableSrf Constructor
Initializes a new instance of the DevelopableSrf class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DevelopableSrf()
Public Sub New
See Also
Reference
DevelopableSrf Class
Rhino.Geometry Namespace