RhinoCommon API
RenderWindow.SetIsRendering Method
 Set whether or not rendering is in progress. Added to support raytraced mode.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public void SetIsRendering(
	bool is_rendering
)
Public Sub SetIsRendering (
	is_rendering As Boolean
)
Parameters
is_rendering
Type: System.Boolean
[Missing <param name="is_rendering"/> documentation for "M:Rhino.Render.RenderWindow.SetIsRendering(System.Boolean)"]
See Also
Reference
RenderWindow Class
Rhino.Render Namespace