RhinoCommon API
AnnotationBase.IsAllBold Method
 Returns true if all of the text in the annotation is Bold, otherwise returns false
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.22
Syntax
public bool IsAllBold()
Public Function IsAllBold As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.IsAllBold"]
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace