RhinoCommon API
Curve.CreateArcCornerRectangle Method
 Creates an arc-cornered (rounded) rectangular curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public static Curve CreateArcCornerRectangle(
	Rectangle3d rectangle,
	double radius
)
Public Shared Function CreateArcCornerRectangle (
	rectangle As Rectangle3d,
	radius As Double
) As Curve
Parameters
rectangle
Type: Rhino.Geometry.Rectangle3d
The rectangle.
radius
Type: System.Double
The arc radius at each corner.
Return Value
Type: Curve
Aa arc-cornered rectangular curve if successful, null otherwise.
See Also
Reference
Curve Class
Rhino.Geometry Namespace