RhinoCommon API
CommonObject Constructor
 Allows construction from inheriting classes.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CommonObject()
Protected Sub New
See Also
Reference
CommonObject Class
CommonObject Overload
Rhino.Runtime Namespace