RhinoCommon API
RTree.PointCloudClosestPoints Method
 Finds the point in a list of 3D points that is closest to a test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static IEnumerable<int[]> PointCloudClosestPoints(
	PointCloud pointcloud,
	IEnumerable<Point3d> needlePts,
	double limitDistance
)
Public Shared Function PointCloudClosestPoints (
	pointcloud As PointCloud,
	needlePts As IEnumerable(Of Point3d),
	limitDistance As Double
) As IEnumerable(Of Integer())
Parameters
pointcloud
Type: Rhino.Geometry.PointCloud
A point cloud to be searched.
needlePts
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to search for.
limitDistance
Type: System.Double
The maximum allowed distance.
Return Value
Type: IEnumerable<Int32[]>
An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
See Also
Reference
RTree Class
Rhino.Geometry Namespace