RhinoCommon API
LicenseLeaseChangedEventArgs Constructor
Initializes a new instance of the LicenseLeaseChangedEventArgs class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LicenseLeaseChangedEventArgs(
	LicenseLease lease
)
Public Sub New (
	lease As LicenseLease
)
Parameters
lease
Type: Rhino.PlugIns.LicenseLease
[Missing <param name="lease"/> documentation for "M:Rhino.PlugIns.LicenseLeaseChangedEventArgs.#ctor(Rhino.PlugIns.LicenseLease)"]
See Also
Reference
LicenseLeaseChangedEventArgs Class
Rhino.PlugIns Namespace