RhinoCommon API
DisplayPipeline.PopCullFaceMode Method
 Pop a FaceCull flag off the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void PopCullFaceMode()
Public Sub PopCullFaceMode
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace