RhinoCommon API
FileImportPlugIn.MakeReferenceTableName Method (RhinoDoc, String)
[Missing <summary> documentation for "M:Rhino.PlugIns.FileImportPlugIn.MakeReferenceTableName(Rhino.RhinoDoc,System.String)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected string MakeReferenceTableName(
	RhinoDoc doc,
	string nameToPrefix
)
Protected Function MakeReferenceTableName (
	doc As RhinoDoc,
	nameToPrefix As String
) As String
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.PlugIns.FileImportPlugIn.MakeReferenceTableName(Rhino.RhinoDoc,System.String)"]
nameToPrefix
Type: System.String
[Missing <param name="nameToPrefix"/> documentation for "M:Rhino.PlugIns.FileImportPlugIn.MakeReferenceTableName(Rhino.RhinoDoc,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.PlugIns.FileImportPlugIn.MakeReferenceTableName(Rhino.RhinoDoc,System.String)"]
See Also
Reference
FileImportPlugIn Class
MakeReferenceTableName Overload
Rhino.PlugIns Namespace