RhinoCommon API
Decal.CustomData Method (Guid)
 Gets decal custom data for a specified renderer. See Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public List<NamedValue> CustomData(
	Guid renderer
)
Public Function CustomData (
	renderer As Guid
) As List(Of NamedValue)
Parameters
renderer
Type: System.Guid
[Missing <param name="renderer"/> documentation for "M:Rhino.Render.Decal.CustomData(System.Guid)"]
Return Value
Type: List<NamedValue>
A list of name-value pairs for the custom data properties. If there is no custom data on the decal for the specified renderer, the list will be empty.
See Also
Reference
Decal Class
CustomData Overload
Rhino.Render Namespace