RhinoCommon API
WorksessionFileModel.SetLayerOverride Method
Replaces a layer override with a copy of another.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetLayerOverride(
	int index,
	WorksessionFileLayerOverride layerOverride
)
Public Sub SetLayerOverride (
	index As Integer,
	layerOverride As WorksessionFileLayerOverride
)
Parameters
index
Type: System.Int32
Index of the layer override to replace.
layerOverride
Type: Rhino.FileIO.WorksessionFileLayerOverride
The layer override to copy.
Exceptions
Exception | Condition
ArgumentNullException | If layerOverride is null.
ArgumentOutOfRangeException | If index is out of range.
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace