RhinoCommon API
SubDEdge.FaceAt Method
 Retrieve a SubDFace from this edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDFace FaceAt(
	int index
)
Public Function FaceAt (
	index As Integer
) As SubDFace
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Geometry.SubDEdge.FaceAt(System.Int32)"]
Return Value
Type: SubDFace
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdge.FaceAt(System.Int32)"]
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace