RhinoCommon API
ObjectTable.GetSelectedObjectTypes Method
What geometry types are currently selected
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ObjectType GetSelectedObjectTypes()
Public Function GetSelectedObjectTypes As ObjectType
Return Value
Type: ObjectType
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetSelectedObjectTypes"]
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace