RhinoCommon API
RenderContent.SetChildSlotAmount Method
 Sets the amount property for the texture in the specified child slot.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public void SetChildSlotAmount(
	string childSlotName,
	double amount,
	RenderContent.ChangeContexts cc
)
Public Sub SetChildSlotAmount (
	childSlotName As String,
	amount As Double,
	cc As RenderContent.ChangeContexts
)
Parameters
childSlotName
Type: System.String
The child slot name of the texture.
amount
Type: System.Double
The texture amount. Values are typically from 0.0 to 100.0
cc
Type: Rhino.Render.RenderContent.ChangeContexts
The context of the change.
See Also
Reference
RenderContent Class
Rhino.Render Namespace