RhinoCommon API
BrepEdgeList.MergeEdge Method
 Merge adjacent edges to a specified edge recursively. A pair of adjacent edges in a Brep are mergeable if the angle between them is less than tolerance and the valence of the shared vertex is 2.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.23
Syntax
public int MergeEdge(
	int edgeIndex,
	double angleTolerance
)
Public Function MergeEdge (
	edgeIndex As Integer,
	angleTolerance As Double
) As Integer
Parameters
edgeIndex
Type: System.Int32
>Index of edge to merge.
angleTolerance
Type: System.Double
The maximum allowable difference of angle in radian between adjacent edges that can be merged.
Return Value
Type: Int32
The number of edges merged.
See Also
Reference
BrepEdgeList Class
Rhino.Geometry.Collections Namespace