RhinoCommon API
RenderMaterial.AssignTo Method (ObjRef)
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.AssignTo(Rhino.DocObjects.ObjRef)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.13
Syntax
public bool AssignTo(
	ObjRef or
)
Public Function AssignTo (
	or As ObjRef
) As Boolean
Parameters
or
Type: Rhino.DocObjects.ObjRef
[Missing <param name="or"/> documentation for "M:Rhino.Render.RenderMaterial.AssignTo(Rhino.DocObjects.ObjRef)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.AssignTo(Rhino.DocObjects.ObjRef)"]
See Also
Reference
RenderMaterial Class
AssignTo Overload
Rhino.Render Namespace