RhinoCommon API
Mesh.CreateFromIterativeCleanup Method
Repairs meshes with vertices that are too near, using a tolerance value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Mesh[] CreateFromIterativeCleanup(
	IEnumerable<Mesh> meshes,
	double tolerance
)
Public Shared Function CreateFromIterativeCleanup (
	meshes As IEnumerable(Of Mesh),
	tolerance As Double
) As Mesh()
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
The meshes to be repaired.
tolerance
Type: System.Double
A minimum distance for clean vertices.
Return Value
Type: Mesh[]
A valid meshes array if successful. If no change was required, some meshes can be null. Otherwise, null, when no changes were done.
Remarks
See Also
Reference
Mesh Class
Rhino.Geometry Namespace
Mesh.RequireIterativeCleanup(IEnumerable<Mesh>, Double)