RhinoCommon API
RenderTexture.SetOffset Method
 Set offset value across UVW space. If the projection type is WCS or other type specified in model units, then this is the offset in meters.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual void SetOffset(
	Vector3d value,
	RenderContent.ChangeContexts changeContext
)
Public Overridable Sub SetOffset (
	value As Vector3d,
	changeContext As RenderContent.ChangeContexts
)
Parameters
value
Type: Rhino.Geometry.Vector3d
[Missing <param name="value"/> documentation for "M:Rhino.Render.RenderTexture.SetOffset(Rhino.Geometry.Vector3d,Rhino.Render.RenderContent.ChangeContexts)"]
changeContext
Type: Rhino.Render.RenderContent.ChangeContexts
[Missing <param name="changeContext"/> documentation for "M:Rhino.Render.RenderTexture.SetOffset(Rhino.Geometry.Vector3d,Rhino.Render.RenderContent.ChangeContexts)"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace