RhinoCommon API
ObjectTable.DeleteGrips Method (RhinoObject, IEnumerable<Int32>)
 Deletes one or more grip objects.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public int DeleteGrips(
	RhinoObject owner,
	IEnumerable<int> gripIndices
)
Public Function DeleteGrips (
	owner As RhinoObject,
	gripIndices As IEnumerable(Of Integer)
) As Integer
Parameters
owner
Type: Rhino.DocObjects.RhinoObject
The owner of the grip objects.
gripIndices
Type: System.Collections.Generic.IEnumerable<Int32>
The indices of the grip objects to delete.
Return Value
Type: Int32
The number of successfully deleted grip objects.
See Also
Reference
ObjectTable Class
DeleteGrips Overload
Rhino.DocObjects.Tables Namespace