RhinoCommon API
ComponentStatus.Equals Method (ComponentStatus)
 Determines if another ComponentStatus and this are equal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Equals(
	ComponentStatus other
)
Public Function Equals (
	other As ComponentStatus
) As Boolean
Parameters
other
Type: Rhino.Geometry.ComponentStatus
A ComponentStatus.
Return Value
Type: Boolean
true if equal in value. false otherwise
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ComponentStatus Structure
Equals Overload
Rhino.Geometry Namespace