RhinoCommon API
BrepFace.ClearPackId Method
 Sets BrepFace.PackId to 0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.19
Syntax
public void ClearPackId()
Public Sub ClearPackId
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace