RhinoCommon API
ReplayHistoryData.UpdateResultArray Method
 Update the Results array with a different set of values. Null entries in the newResults will result in empty ReplayHistoryResult elements
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void UpdateResultArray(
	IEnumerable<ReplayHistoryResult> newResults
)
Public Sub UpdateResultArray (
	newResults As IEnumerable(Of ReplayHistoryResult)
)
Parameters
newResults
Type: System.Collections.Generic.IEnumerable<ReplayHistoryResult>
[Missing <param name="newResults"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.UpdateResultArray(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ReplayHistoryResult})"]
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace