RhinoCommon API
CurveKinkDefinition.IsCurvatureZero Method (Vector3d)
 Returns true if the curvature vector is considered to be zero given the CurvatureKinkZeroTolerance
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsCurvatureZero(
	Vector3d curvature
)
Public Function IsCurvatureZero (
	curvature As Vector3d
) As Boolean
Parameters
curvature
Type: Rhino.Geometry.Vector3d
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.CurveKinkDefinition.IsCurvatureZero(Rhino.Geometry.Vector3d)"]
See Also
Reference
CurveKinkDefinition Class
IsCurvatureZero Overload
Rhino.Geometry Namespace