RhinoCommon API
ViewCaptureSettings.Equals Method (ViewCaptureSettings)
 Check if the contents of this object is the same as another object
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public bool Equals(
	ViewCaptureSettings other
)
Public Function Equals (
	other As ViewCaptureSettings
) As Boolean
Parameters
other
Type: Rhino.Display.ViewCaptureSettings
other settings to compare against
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.ViewCaptureSettings.Equals(Rhino.Display.ViewCaptureSettings)"]
See Also
Reference
ViewCaptureSettings Class
Equals Overload
Rhino.Display Namespace