RhinoCommon API
DisplayModeDescription.GetDisplayMode Method
 Gets a display mode description by id.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static DisplayModeDescription GetDisplayMode(
	Guid id
)
Public Shared Function GetDisplayMode (
	id As Guid
) As DisplayModeDescription
Parameters
id
Type: System.Guid
The id of the display mode.
Return Value
Type: DisplayModeDescription
The display mode description if found, null otherwise.
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace