RhinoCommon API
UserInterfaceIcon Constructor
Initializes a new instance of the UserInterfaceIcon class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UserInterfaceIcon()
Public Sub New
See Also
Reference
UserInterfaceIcon Class
Rhino.UI Namespace