RhinoCommon API
Transform2d.Rotation Method (Double, Double, Point2d)
 Constructs a new rotation transformation from the sine and cosine of an angle and a specified rotation center.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d Rotation(
	double sinAngle,
	double cosAngle,
	Point2d rotationCenter
)
Public Shared Function Rotation (
	sinAngle As Double,
	cosAngle As Double,
	rotationCenter As Point2d
) As Transform2d
Parameters
sinAngle
Type: System.Double
The sine of the rotation angle.
cosAngle
Type: System.Double
The cosine of the rotation angle.
rotationCenter
Type: Rhino.Geometry.Point2d
The fixed point of the rotation.
Return Value
Type: Transform2d
A rotation transformation, or Transform2d.Nan if the input is not valid.
See Also
Reference
Transform2d Structure
Rotation Overload
Rhino.Geometry Namespace