RhinoCommon API
AnnotationBase.PlainTextToRtf Method
[Missing <summary> documentation for "M:Rhino.Geometry.AnnotationBase.PlainTextToRtf(System.String)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string PlainTextToRtf(
	string str
)
Public Shared Function PlainTextToRtf (
	str As String
) As String
Parameters
str
Type: System.String
[Missing <param name="str"/> documentation for "M:Rhino.Geometry.AnnotationBase.PlainTextToRtf(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.PlainTextToRtf(System.String)"]
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace