RhinoCommon API
PersistentSettings.GetUnsignedInteger Method (String, UInt32, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetUnsignedInteger(System.String,System.UInt32,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint GetUnsignedInteger(
	string key,
	uint defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetUnsignedInteger (
	key As String,
	defaultValue As UInteger,
	legacyKeyList As IEnumerable(Of String)
) As UInteger
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetUnsignedInteger(System.String,System.UInt32,System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.UInt32
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetUnsignedInteger(System.String,System.UInt32,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetUnsignedInteger(System.String,System.UInt32,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetUnsignedInteger(System.String,System.UInt32,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetUnsignedInteger Overload
Rhino Namespace