RhinoCommon API
ZBufferCapture.ShowAnnotations Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowAnnotations(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public void ShowAnnotations(
	bool on
)
Public Sub ShowAnnotations (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowAnnotations(System.Boolean)"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace