RhinoCommon API
CustomObjectGrips.NurbsCurveGrip Method
 If the grips are control points of a NURBS curve, then this gets the grip that controls the i-th CV.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual GripObject NurbsCurveGrip(
	int i
)
Protected Overridable Function NurbsCurveGrip (
	i As Integer
) As GripObject
Parameters
i
Type: System.Int32
The control point index.
Return Value
Type: GripObject
A grip controlling a NURBS curve CV or null.
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace