RhinoCommon API
ChooseOneObjectSettings.RestoreDefaults Method
 Commits the default settings as the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void RestoreDefaults()
Public Shared Sub RestoreDefaults
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace