RhinoCommon API
RdkUndo Constructor
 Constructor for RdkUndo
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public RdkUndo(
	IntPtr pUndoRecord
)
Public Sub New (
	pUndoRecord As IntPtr
)
Parameters
pUndoRecord
Type: System.IntPtr
[Missing <param name="pUndoRecord"/> documentation for "M:Rhino.Render.RdkUndo.#ctor(System.IntPtr)"]
See Also
Reference
RdkUndo Class
Rhino.Render Namespace