RhinoCommon API
IShrinkWrapService.ShrinkWrap Method (IEnumerable<GeometryBase>, ShrinkWrapParameters, MeshingParameters, CancellationToken)
 Create a mesh from a collection of geometry base objects Null on error or incompatible settings
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
Mesh ShrinkWrap(
	IEnumerable<GeometryBase> geometryBases,
	ShrinkWrapParameters parameters,
	MeshingParameters meshingParameters,
	CancellationToken cancellationToken
)
Function ShrinkWrap (
	geometryBases As IEnumerable(Of GeometryBase),
	parameters As ShrinkWrapParameters,
	meshingParameters As MeshingParameters,
	cancellationToken As CancellationToken
) As Mesh
Parameters
geometryBases
Type: System.Collections.Generic.IEnumerable<GeometryBase>
[Missing <param name="geometryBases"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.ShrinkWrapParameters,Rhino.Geometry.MeshingParameters,System.Threading.CancellationToken)"]
parameters
Type: Rhino.Geometry.ShrinkWrapParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.ShrinkWrapParameters,Rhino.Geometry.MeshingParameters,System.Threading.CancellationToken)"]
meshingParameters
Type: Rhino.Geometry.MeshingParameters
[Missing <param name="meshingParameters"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.ShrinkWrapParameters,Rhino.Geometry.MeshingParameters,System.Threading.CancellationToken)"]
cancellationToken
Type: System.Threading.CancellationToken
[Missing <param name="cancellationToken"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.ShrinkWrapParameters,Rhino.Geometry.MeshingParameters,System.Threading.CancellationToken)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.ShrinkWrapParameters,Rhino.Geometry.MeshingParameters,System.Threading.CancellationToken)"]
See Also
Reference
IShrinkWrapService Interface
ShrinkWrap Overload
Rhino.Runtime Namespace