RhinoCommon API
IRhRdkThumbnail.IsHot Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.IsHot"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool IsHot()
Function IsHot As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.IsHot"]
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls.ThumbnailUI Namespace