RhinoCommon API
OptionString.Finalize Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.OptionString.Finalize"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
OptionString Class
Rhino.Input.Custom Namespace