RhinoCommon API
CustomGripObject.Dispose Method
Releases all resources used by the CustomGripObject
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
CustomGripObject Class
Dispose Overload
Rhino.DocObjects.Custom Namespace