RhinoCommon API
Curve.ClosedCurveOrientation Method
 Determines the orientation (counterclockwise or clockwise) of a closed, planar curve in the world XY plane. Only works with simple (no self intersections) closed, planar curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public CurveOrientation ClosedCurveOrientation()
Public Function ClosedCurveOrientation As CurveOrientation
Return Value
Type: CurveOrientation
The orientation of this curve with respect to world XY plane.
See Also
Reference
Curve Class
ClosedCurveOrientation Overload
Rhino.Geometry Namespace