RhinoCommon API
RdkUndoRecord.Dispose Method
 Dispose for RdkUndoRecord
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RdkUndoRecord Class
Rhino.Render Namespace