RhinoCommon API
Brep.CreatePlanarBreps Method (CurveList)
Note: This API is now obsolete.
 Constructs a set of planar Breps as outlines by the loops.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use version that takes tolerance as input")]
public static Brep[] CreatePlanarBreps(
	CurveList inputLoops
)
<ObsoleteAttribute("Use version that takes tolerance as input")>
Public Shared Function CreatePlanarBreps (
	inputLoops As CurveList
) As Brep()
Parameters
inputLoops
Type: Rhino.Collections.CurveList
Curve loops that delineate the planar boundaries.
Return Value
Type: Brep[]
An array of Planar Breps or null on error.
See Also
Reference
Brep Class
CreatePlanarBreps Overload
Rhino.Geometry Namespace