RhinoCommon API
NurbsSurfacePointList.SetPoint Method (Int32, Int32, Double, Double, Double)
 Sets a world 3-D, or Euclidean, control point at the given (u, v) index. The 4-D representation is (x, y, z, 1.0).
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SetPoint(
	int u,
	int v,
	double x,
	double y,
	double z
)
Public Function SetPoint (
	u As Integer,
	v As Integer,
	x As Double,
	y As Double,
	z As Double
) As Boolean
Parameters
u
Type: System.Int32
Index of control point in the surface U direction.
v
Type: System.Int32
Index of control point in the surface V direction.
x
Type: System.Double
X coordinate of control point.
y
Type: System.Double
Y coordinate of control point.
z
Type: System.Double
Z coordinate of control point.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsSurfacePointList Class
SetPoint Overload
Rhino.Geometry.Collections Namespace