RhinoCommon API
AnnotationBase.SetBold Method
[Missing <summary> documentation for "M:Rhino.Geometry.AnnotationBase.SetBold(System.Boolean)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool SetBold(
	bool set_on
)
Public Overridable Function SetBold (
	set_on As Boolean
) As Boolean
Parameters
set_on
Type: System.Boolean
[Missing <param name="set_on"/> documentation for "M:Rhino.Geometry.AnnotationBase.SetBold(System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.SetBold(System.Boolean)"]
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace