RhinoCommon API
DimensionStyle.ClearAllFieldOverrides Method
 Sets all the fields in this DimensionStyle to be not overridden Does not change any dimstyle_id's or parent_id's
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void ClearAllFieldOverrides()
Public Sub ClearAllFieldOverrides
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace