RhinoCommon API
HermiteSurface.SetTwistAt Method
 Set the twist direction (mixed second partial derivative) to interpolate at the u,v parameter location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SetTwistAt(
	int uIndex,
	int vIndex,
	Vector3d twist
)
Public Sub SetTwistAt (
	uIndex As Integer,
	vIndex As Integer,
	twist As Vector3d
)
Parameters
uIndex
Type: System.Int32
The "u" index.
vIndex
Type: System.Int32
The "v" index.
twist
Type: Rhino.Geometry.Vector3d
The twist direction.
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace