RhinoCommon API
RenderTexture.SetPreviewLocalMapping Method (Boolean, RenderContent.ChangeContexts)
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.SetPreviewLocalMapping(System.Boolean,Rhino.Render.RenderContent.ChangeContexts)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public void SetPreviewLocalMapping(
	bool value,
	RenderContent.ChangeContexts changeContext
)
Public Sub SetPreviewLocalMapping (
	value As Boolean,
	changeContext As RenderContent.ChangeContexts
)
Parameters
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.Render.RenderTexture.SetPreviewLocalMapping(System.Boolean,Rhino.Render.RenderContent.ChangeContexts)"]
changeContext
Type: Rhino.Render.RenderContent.ChangeContexts
[Missing <param name="changeContext"/> documentation for "M:Rhino.Render.RenderTexture.SetPreviewLocalMapping(System.Boolean,Rhino.Render.RenderContent.ChangeContexts)"]
See Also
Reference
RenderTexture Class
SetPreviewLocalMapping Overload
Rhino.Render Namespace