RhinoCommon API
RhinoPageView.RemoveFromPageViewGroup Method
 Removes this page view to a page view group.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void RemoveFromPageViewGroup(
	int pageViewGroupIndex
)
Public Sub RemoveFromPageViewGroup (
	pageViewGroupIndex As Integer
)
Parameters
pageViewGroupIndex
Type: System.Int32
Zero-based index of the page view group.
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace