RhinoCommon API
RhinoMath.IsValidDouble Method
 Determines whether a Double value is valid within the RhinoCommon context.
Rhino does not use Double.NaN by convention, so this test evaluates to true if:
x is not equal to RhinoMath.UnsetValue
System.Double.IsNaN(x) evaluates to false
System.Double.IsInfinity(x) evaluates to false
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool IsValidDouble(
	double x
)
Public Shared Function IsValidDouble (
	x As Double
) As Boolean
Parameters
x
Type: System.Double
Double number to test for validity.
Return Value
Type: Boolean
true if the number if valid, false if the number is NaN, Infinity or Unset.
See Also
Reference
RhinoMath Class
Rhino Namespace