RhinoCommon API
Decals.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.Render.Decals.GetEnumerator"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public IEnumerator<Decal> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Decal)
Return Value
Type: IEnumerator<Decal>
[Missing <returns> documentation for "M:Rhino.Render.Decals.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
Decals Class
Rhino.Render Namespace