RhinoCommon API
RadialDimension.AdjustFromPoints Method
 Update Dimension geometry from point locations
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AdjustFromPoints(
	Plane plane,
	Point3d centerpoint,
	Point3d radiuspoint,
	Point3d dimlinepoint,
	double rotationInPlane
)
Public Function AdjustFromPoints (
	plane As Plane,
	centerpoint As Point3d,
	radiuspoint As Point3d,
	dimlinepoint As Point3d,
	rotationInPlane As Double
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
Dimension's plane
centerpoint
Type: Rhino.Geometry.Point3d
Dimension's center point
radiuspoint
Type: Rhino.Geometry.Point3d
Point on dimension radius
dimlinepoint
Type: Rhino.Geometry.Point3d
Point on dimension line
rotationInPlane
Type: System.Double
This parameter is currently ignored
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.RadialDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace