RhinoCommon API
BrepFace.RefitTrim Method
 The RefitTrim command replaces a trimmed surface edge with an untrimmed edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Surface[] RefitTrim(
	BrepEdge edge,
	IEnumerable<double> knots,
	double tolerance,
	bool bSections,
	ref double fitQuality
)
Public Function RefitTrim (
	edge As BrepEdge,
	knots As IEnumerable(Of Double),
	tolerance As Double,
	bSections As Boolean,
	ByRef fitQuality As Double
) As Surface()
Parameters
edge
Type: Rhino.Geometry.BrepEdge
The edge to fit.
knots
Type: System.Collections.Generic.IEnumerable<Double>
The custom knot vector to use, or an empty vector to use the existing knots of the surface.
tolerance
Type: System.Double
The 3d tolerance for projection, splitting, and fitting.
bSections
Type: System.Boolean
If true, the surface is divided into separate surface patches at all knots.
fitQuality
Type: System.Double
A measure of the 3d fit to the trim curve.
Return Value
Type: Surface[]
The trimmed surfaces.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace