RhinoCommon API
UserInterfaceObjectBase.IsMouseOver Method
 Called to test if the mouse is actively over this object
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool IsMouseOver(
	MouseState mouse
)
Protected Overridable Function IsMouseOver (
	mouse As MouseState
) As Boolean
Parameters
mouse
Type: Rhino.UI.MouseState
[Missing <param name="mouse"/> documentation for "M:Rhino.UI.UserInterfaceObjectBase.IsMouseOver(Rhino.UI.MouseState)"]
Return Value
Type: Boolean
 Return true if the mouse is over this object
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace