RhinoCommon API
FileVrmlWriteOptions Constructor
Initializes a new instance of the FileVrmlWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileVrmlWriteOptions()
Public Sub New
See Also
Reference
FileVrmlWriteOptions Class
Rhino.FileIO Namespace