RhinoCommon API
ColorLAB.CreateFromRGBA Method
 Create the nearest LAB equivalent of an RGBA color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public static ColorLAB CreateFromRGBA(
	ColorRGBA rgb
)
Public Shared Function CreateFromRGBA (
	rgb As ColorRGBA
) As ColorLAB
Parameters
rgb
Type: Rhino.Display.ColorRGBA
Target color in RGBA space.
Return Value
Type: ColorLAB
The LAB equivalent of the RGBA color.
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace