RhinoCommon API
Mesh.UnifyNormals Method
 Attempts to fix inconsistencies in the directions of mesh faces in a mesh. This function does not modify mesh vertex normals, it rearranges the mesh face winding and face normals to make them all consistent. Note, you may want to call Mesh.Normals.ComputeNormals() to recompute vertex normals after calling this functions.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int UnifyNormals()
Public Function UnifyNormals As Integer
Return Value
Type: Int32
number of faces that were modified.
See Also
Reference
Mesh Class
UnifyNormals Overload
Rhino.Geometry Namespace