RhinoCommon API
Squisher.SquishSurface Method (SquishParameters, Surface)
 Squish the surface into a flat brep
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public Brep SquishSurface(
	SquishParameters sp,
	Surface surface
)
Public Function SquishSurface (
	sp As SquishParameters,
	surface As Surface
) As Brep
Parameters
sp
Type: Rhino.Geometry.SquishParameters
The parameters for the squish operation
surface
Type: Rhino.Geometry.Surface
The surface to be squished
Return Value
Type: Brep
A brep representing the flattened surface
Remarks
NB: If you are using this function from Grasshopper, which does not have a type that can hold a trimmed surface, you will need to pass a Brep to your component and get the face of interest from this Brep into this function. Otherwise you will lose all trimming information. Example: `brep_out = SquishSurface(sp, brep.Faces[0])`
See Also
Reference
Squisher Class
SquishSurface Overload
Rhino.Geometry Namespace