RhinoCommon API
RenderWindow.Channel.GetMinMaxValues Method
 Get the minimum and maximum values in the channel. minThe channel's minimum value. maxThe channel's maximum value.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void GetMinMaxValues(
	out float min,
	out float max
)
Public Sub GetMinMaxValues (
	<OutAttribute> ByRef min As Single,
	<OutAttribute> ByRef max As Single
)
Parameters
min
Type: System.Single
[Missing <param name="min"/> documentation for "M:Rhino.Render.RenderWindow.Channel.GetMinMaxValues(System.Single@,System.Single@)"]
max
Type: System.Single
[Missing <param name="max"/> documentation for "M:Rhino.Render.RenderWindow.Channel.GetMinMaxValues(System.Single@,System.Single@)"]
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace