RhinoCommon API
RenderMaterialTable.EndChange Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterialTable.EndChange"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void EndChange()
Public Sub EndChange
See Also
Reference
RenderMaterialTable Class
Rhino.Render Namespace