RhinoCommon API
DisplayPipeline.DrawConstructionPlane Method
 Draws a construction plane.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DrawConstructionPlane(
	ConstructionPlane constructionPlane
)
Public Sub DrawConstructionPlane (
	constructionPlane As ConstructionPlane
)
Parameters
constructionPlane
Type: Rhino.DocObjects.ConstructionPlane
The construction plane to draw.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace