RhinoCommon API
ArchivableDictionary.Set Method (String, Color)
 Sets a Color.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Set(
	string key,
	Color val
)
Public Function Set (
	key As String,
	val As Color
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: System.Drawing.Color
A value for that key.
Because Color has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
true if set operation succeeded, otherwise false.
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace