RhinoCommon API
HiddenLineDrawingObjectCurve.Curve Method (Double, Int32)
 Returns the HiddenLineDrawingCurve object containing parameter 't'.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public HiddenLineDrawingSegment Curve(
	double t,
	int side
)
Public Function Curve (
	t As Double,
	side As Integer
) As HiddenLineDrawingSegment
Parameters
t
Type: System.Double
The parameter.
side
Type: System.Int32
 Determines which side to return at breakpoints, where: 0 - default, <0 - curve that contains an interval [t-, t], for some t- < t, >0 - curve that contains an interval [t, t+], for some t+ > t.
Return Value
Type: HiddenLineDrawingSegment
The HiddenLineDrawingCurve object if successful.
See Also
Reference
HiddenLineDrawingObjectCurve Class
Curve Overload
Rhino.Geometry Namespace