RhinoCommon API
MeshVertexColorList.Clear Method
 Clears the vertex color list on the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
IList.Clear()
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace