RhinoCommon API
ObjectPropertiesPage.RunScript Method (ObjectPropertiesPageEventArgs)
 This method is called when scripting the Rhino Properties command and choosing this page.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual Result RunScript(
	ObjectPropertiesPageEventArgs e
)
Public Overridable Function RunScript (
	e As ObjectPropertiesPageEventArgs
) As Result
Parameters
e
Type: Rhino.UI.ObjectPropertiesPageEventArgs
 Provides access to the selected object list and document.
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPage.RunScript(Rhino.UI.ObjectPropertiesPageEventArgs)"]
See Also
Reference
ObjectPropertiesPage Class
RunScript Overload
Rhino.UI Namespace