RhinoCommon API
Mesh.CreateBooleanSplit Method (IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result, Int32[][])
 Splits a set of meshes with another set and reports which inputs contributed to each output.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Mesh[] CreateBooleanSplit(
	IEnumerable<Mesh> meshesToSplit,
	IEnumerable<Mesh> meshSplitters,
	MeshBooleanOptions options,
	out Result result,
	out int[][] inputMap
)
Public Shared Function CreateBooleanSplit (
	meshesToSplit As IEnumerable(Of Mesh),
	meshSplitters As IEnumerable(Of Mesh),
	options As MeshBooleanOptions,
	<OutAttribute> ByRef result As Result,
	<OutAttribute> ByRef inputMap As Integer()()
) As Mesh()
Parameters
meshesToSplit
Type: System.Collections.Generic.IEnumerable<Mesh>
A list, an array, or any enumerable set of meshes to be split.
meshSplitters
Type: System.Collections.Generic.IEnumerable<Mesh>
A list, an array, or any enumerable set of meshes that cut.
options
Type: Rhino.Geometry.MeshBooleanOptions
The boolean option instance, or null.
result
Type: Rhino.Commands.Result
A value indicating success, or cancel, or failure, or nothing.
inputMap
Type: System.Int32[][]
 On success, one array per output mesh (parallel to the returned array), listing the indices of the input meshes that contributed faces to that output. The index space is flat-concatenated: meshesToSplit occupies 0..n0-1 and meshSplitters occupies n0..n0+n1-1, in enumeration order; null inputs are skipped and not assigned an index. Null when the function fails.
Return Value
Type: Mesh[]
A new mesh array, or null on error.
See Also
Reference
Mesh Class
CreateBooleanSplit Overload
Rhino.Geometry Namespace