RhinoCommon API
Material.SetBumpTexture Method (String)
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.SetBumpTexture(System.String)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SetBumpTexture(
	string filename
)
Public Function SetBumpTexture (
	filename As String
) As Boolean
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.DocObjects.Material.SetBumpTexture(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.SetBumpTexture(System.String)"]
See Also
Reference
Material Class
SetBumpTexture Overload
Rhino.DocObjects Namespace
Material.SetTexture(Texture, TextureType)