RhinoCommon API
ViewportInfo.SetViewScale Method
 Set scaling applied for this viewport projection. For reflected projections, call with values 1,1,-1
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetViewScale(
	double scaleX,
	double scaleY,
	double scaleZ
)
Public Sub SetViewScale (
	scaleX As Double,
	scaleY As Double,
	scaleZ As Double
)
Parameters
scaleX
Type: System.Double
[Missing <param name="scaleX"/> documentation for "M:Rhino.DocObjects.ViewportInfo.SetViewScale(System.Double,System.Double,System.Double)"]
scaleY
Type: System.Double
[Missing <param name="scaleY"/> documentation for "M:Rhino.DocObjects.ViewportInfo.SetViewScale(System.Double,System.Double,System.Double)"]
scaleZ
Type: System.Double
[Missing <param name="scaleZ"/> documentation for "M:Rhino.DocObjects.ViewportInfo.SetViewScale(System.Double,System.Double,System.Double)"]
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace