RhinoCommon API
SnapShotsClient.ObjectTransformNotification Method
 Called for every object that is associated with a snapshot and gets transformed in Rhino. This is getting called for each stored snapshot and gives the client the possibility to update the stored data.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool ObjectTransformNotification(
	RhinoDoc doc,
	RhinoObject doc_object,
	ref Transform transform,
	BinaryArchiveReader archive
)
Public MustOverride Function ObjectTransformNotification (
	doc As RhinoDoc,
	doc_object As RhinoObject,
	ByRef transform As Transform,
	archive As BinaryArchiveReader
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
doc is the current document.
doc_object
Type: Rhino.DocObjects.RhinoObject
doc_obj is the current object.
transform
Type: Rhino.Geometry.Transform
transform is a transformation matrix. The matrix is set to identity the first time an object is associated with a snapshot. After that the matrix is updated when the object is transformed(scale, rotate etc.).
archive
Type: Rhino.FileIO.BinaryArchiveReader
archive is a archive which can be used to update the stored data.
Return Value
Type: Boolean
true if successful, otherwise false.
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace