RhinoCommon API
Surface.TryGetFiniteCylinder Method
Tests a surface with the assumption that it might be a right circular cylinder and returns this geometry.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetFiniteCylinder(
	out Cylinder cylinder,
	double tolerance
)
Public Function TryGetFiniteCylinder (
	<OutAttribute> ByRef cylinder As Cylinder,
	tolerance As Double
) As Boolean
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
On success, the cylinder parameters are filled in.
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the surface is a portion of a cylinder.
Remarks
 If successful, a finite cylinder is returned.
See Also
Reference
Surface Class
Rhino.Geometry Namespace