RhinoCommon API
MarkupTable.Find Method (String)
Finds the markup with a given name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Find(
	string name
)
Public Function Find (
	name As String
) As Integer
Parameters
name
Type: System.String
 The name of the markup to find. The search ignores case.
Return Value
Type: Int32
 If the markup was found, the markup index, >=0, is returned. If the markup was not found, -1 is returned.
See Also
Reference
MarkupTable Class
Find Overload
Rhino.DocObjects.Tables Namespace