RhinoCommon API
DetailViewObject.CommitViewportChanges Method
[Missing <summary> documentation for "M:Rhino.DocObjects.DetailViewObject.CommitViewportChanges"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool CommitViewportChanges()
Public Function CommitViewportChanges As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.DetailViewObject.CommitViewportChanges"]
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace