RhinoCommon API
SubDSurfaceInterpolator.InterpolatedVertexIndex Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDSurfaceInterpolator.InterpolatedVertexIndex(System.UInt32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public uint InterpolatedVertexIndex(
	uint vertexId
)
Public Function InterpolatedVertexIndex (
	vertexId As UInteger
) As UInteger
Parameters
vertexId
Type: System.UInt32
[Missing <param name="vertexId"/> documentation for "M:Rhino.Geometry.SubDSurfaceInterpolator.InterpolatedVertexIndex(System.UInt32)"]
Return Value
Type: UInt32
 If vertex is an interpolated vertex, returns the index of the vertex in the array returned by VertexIdList(). Otherwise, returns ON_UNSET_UINT_INDEX.
See Also
Reference
SubDSurfaceInterpolator Class
Rhino.Geometry Namespace