RhinoCommon API
Localization.FormatNumber Method (Double)
 Get a string version of a number.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string FormatNumber(
	double x
)
Public Shared Function FormatNumber (
	x As Double
) As String
Parameters
x
Type: System.Double
The number to format into a string.
Return Value
Type: String
The formatted number.
See Also
Reference
Localization Class
FormatNumber Overload
Rhino.UI Namespace