RhinoCommon API
SupportOptions.FileExplorer_ShowDocuments Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.FileExplorer_ShowDocuments"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool FileExplorer_ShowDocuments()
Public Shared Function FileExplorer_ShowDocuments As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.FileExplorer_ShowDocuments"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace