RhinoCommon API
MaterialTable.Find Method (Material, Boolean)
 Finds a material index.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int Find(
	Material material,
	bool ignoreDeletedMaterials
)
Public Function Find (
	material As Material,
	ignoreDeletedMaterials As Boolean
) As Integer
Parameters
material
Type: Rhino.DocObjects.Material
Material to search for.
ignoreDeletedMaterials
Type: System.Boolean
true means don't search deleted materials.
Return Value
Type: Int32
 >=0 index of the material -1 no material matchin material.
See Also
Reference
MaterialTable Class
Find Overload
Rhino.DocObjects.Tables Namespace