RhinoCommon API
TextFields.PageHeight Method
 Return the current layout page height in the layout units
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static double PageHeight()
Public Shared Function PageHeight As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.PageHeight"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace