RhinoCommon API
File3dm.ReadEarthAnchorPoint Method
 Reads only the earth anchor point from an existing 3dm file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public static EarthAnchorPoint ReadEarthAnchorPoint(
	string path
)
Public Shared Function ReadEarthAnchorPoint (
	path As String
) As EarthAnchorPoint
Parameters
path
Type: System.String
A location on disk or network.
Return Value
Type: EarthAnchorPoint
The earth anchor point.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace