RhinoCommon API
File3dmShutLining.DeleteAllCurves Method
 Deletes all the curves from the shut-lining.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void DeleteAllCurves()
Public Sub DeleteAllCurves
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace