RhinoCommon API
DisplayPipeline.DrawInstanceDefinition Method (InstanceDefinition)
 Draws an InstanceDefinition.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.15
Syntax
public void DrawInstanceDefinition(
	InstanceDefinition instanceDefinition
)
Public Sub DrawInstanceDefinition (
	instanceDefinition As InstanceDefinition
)
Parameters
instanceDefinition
Type: Rhino.DocObjects.InstanceDefinition
The instance definition.
See Also
Reference
DisplayPipeline Class
DrawInstanceDefinition Overload
Rhino.Display Namespace