RhinoCommon API
RhinoList<T>.Reverse Method
 Reverses the order of the elements in the entire List.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Reverse()
Public Sub Reverse
See Also
Reference
RhinoList<T> Class
Reverse Overload
Rhino.Collections Namespace