RhinoCommon API
NurbsCurve.CreateParabolaFromVertex Method
 Creates a parabola from vertex and end points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static NurbsCurve CreateParabolaFromVertex(
	Point3d vertex,
	Point3d startPoint,
	Point3d endPoint
)
Public Shared Function CreateParabolaFromVertex (
	vertex As Point3d,
	startPoint As Point3d,
	endPoint As Point3d
) As NurbsCurve
Parameters
vertex
Type: Rhino.Geometry.Point3d
The vertex point.
startPoint
Type: Rhino.Geometry.Point3d
The start point.
endPoint
Type: Rhino.Geometry.Point3d
The end point
Return Value
Type: NurbsCurve
A 2 degree NURBS curve if successful, false otherwise.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace