RhinoCommon API
LayerTable.Duplicate Method (IEnumerable<Int32>, Boolean, Boolean)
 Duplicates, or copies, one or more layers. Duplicated layers are added to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public int[] Duplicate(
	IEnumerable<int> layerIndices,
	bool duplicateObjects,
	bool duplicateSublayers
)
Public Function Duplicate (
	layerIndices As IEnumerable(Of Integer),
	duplicateObjects As Boolean,
	duplicateSublayers As Boolean
) As Integer()
Parameters
layerIndices
Type: System.Collections.Generic.IEnumerable<Int32>
The indices of layers to duplicate.
duplicateObjects
Type: System.Boolean
If true, then layer objects will also be duplicated and added to the document.
duplicateSublayers
Type: System.Boolean
If true, then all sub-layers of the layer will be duplicated.
Return Value
Type: Int32[]
The indices of the newly added layers if successful, an empty array on failure.
See Also
Reference
LayerTable Class
Duplicate Overload
Rhino.DocObjects.Tables Namespace