RhinoCommon API
Brep.FilletSurfaceSettings.CreateChamferSettings Method
 Create settings for chamfered surfaces
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Brep.FilletSurfaceSettings CreateChamferSettings(
	double radius0,
	double radius1,
	double tolerance,
	bool trim,
	bool extend
)
Public Shared Function CreateChamferSettings (
	radius0 As Double,
	radius1 As Double,
	tolerance As Double,
	trim As Boolean,
	extend As Boolean
) As Brep.FilletSurfaceSettings
Parameters
radius0
Type: System.Double
The distance from the intersection of face0 to the edge of the chamfer.
radius1
Type: System.Double
The distance from the intersection of face1 to the edge of the chamfer.
tolerance
Type: System.Double
The tolerance. When in doubt, use the document's model absolute tolerance.
trim
Type: System.Boolean
If true, the input faces will be trimmed, if false, the input faces will be split.
extend
Type: System.Boolean
If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
Return Value
Type: Brep.FilletSurfaceSettings
[Missing <returns> documentation for "M:Rhino.Geometry.Brep.FilletSurfaceSettings.CreateChamferSettings(System.Double,System.Double,System.Double,System.Boolean,System.Boolean)"]
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace