RhinoCommon API
ViewCaptureWriter Constructor
Initializes a new instance of the ViewCaptureWriter class
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ViewCaptureWriter(
	double dpi,
	Size pageSize
)
Public Sub New (
	dpi As Double,
	pageSize As Size
)
Parameters
dpi
Type: System.Double
[Missing <param name="dpi"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.#ctor(System.Double,System.Drawing.Size)"]
pageSize
Type: System.Drawing.Size
[Missing <param name="pageSize"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.#ctor(System.Double,System.Drawing.Size)"]
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace