RhinoCommon API
File3dmDisplacement.SetSubItemTexture Method
 Sets the override for displacement 'texture'. face_index is the index of the face on the polysurface/SubD.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetSubItemTexture(
	int face_index,
	Guid texture_id
)
Public Sub SetSubItemTexture (
	face_index As Integer,
	texture_id As Guid
)
Parameters
face_index
Type: System.Int32
[Missing <param name="face_index"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.SetSubItemTexture(System.Int32,System.Guid)"]
texture_id
Type: System.Guid
[Missing <param name="texture_id"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.SetSubItemTexture(System.Int32,System.Guid)"]
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace