RhinoCommon API
FileCsvDocument.Read Method (String)
 Reads a CSV file from disk. The file is assumed to have no header row.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static FileCsvDocument Read(
	string path
)
Public Shared Function Read (
	path As String
) As FileCsvDocument
Parameters
path
Type: System.String
The path of the file to read.
Return Value
Type: FileCsvDocument
A new document populated with the contents of the file.
See Also
Reference
FileCsvDocument Class
Read Overload
Rhino.FileIO Namespace