RhinoCommon API
File3dmGroupTable.FindIndex Method
 Retrieves a Group object based on an index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public Group FindIndex(
	int groupIndex
)
Public Function FindIndex (
	groupIndex As Integer
) As Group
Parameters
groupIndex
Type: System.Int32
The index to search for.
Return Value
Type: Group
A Group object, or null if none was found.
See Also
Reference
File3dmGroupTable Class
Rhino.FileIO Namespace