RhinoCommon API
SubDSurfaceInterpolator.CreateFromVertexIdList Method
 Create an interpolator where all the listed vertices in the SubD are free vertices in the linear system used for interpolation, and the unselected are fixed to their initial positions. Free vertices are can move as a result of the interpolation, and can receive an interpolation target location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static SubDSurfaceInterpolator CreateFromVertexIdList(
	SubD subd,
	IEnumerable<uint> vertexIndices,
	out uint freeVertexCount
)
Public Shared Function CreateFromVertexIdList (
	subd As SubD,
	vertexIndices As IEnumerable(Of UInteger),
	<OutAttribute> ByRef freeVertexCount As UInteger
) As SubDSurfaceInterpolator
Parameters
subd
Type: Rhino.Geometry.SubD
The SubD to use for interpolation
vertexIndices
Type: System.Collections.Generic.IEnumerable<UInt32>
Indices of the vertices to be interpolated
freeVertexCount
Type: System.UInt32
The number of free vertices in the system
Return Value
Type: SubDSurfaceInterpolator
A new SubDSurfaceInterpolator
Remarks
 Sets ContextId to the Guid of the Rhino SubD object for subd.
See Also
Reference
SubDSurfaceInterpolator Class
Rhino.Geometry Namespace