RhinoCommon API
HatchPattern.CreatePreviewGeometry Method
 Creates preview line segments of the hatch pattern.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public Line[] CreatePreviewGeometry(
	int width,
	int height,
	double angle
)
Public Function CreatePreviewGeometry (
	width As Integer,
	height As Integer,
	angle As Double
) As Line()
Parameters
width
Type: System.Int32
The width of the preview.
height
Type: System.Int32
The height of the preview.
angle
Type: System.Double
The rotation angle of the pattern display in radians.
Return Value
Type: Line[]
The preview line segments if successful, an empty array on failure.
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace