RhinoCommon API
RhinoMath.Wrap Method
 Limits a Double to be specified within an interval of two numbers by repeating the available interval cyclically.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public static double Wrap(
	double value,
	double bound1,
	double bound2
)
Public Shared Function Wrap (
	value As Double,
	bound1 As Double,
	bound2 As Double
) As Double
Parameters
value
Type: System.Double
A number.
bound1
Type: System.Double
A first bound.
bound2
Type: System.Double
A second bound. This does not necessarily need to be larger or smaller than bound1.
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.RhinoMath.Wrap(System.Double,System.Double,System.Double)"]
See Also
Reference
RhinoMath Class
Rhino Namespace