RhinoCommon API
CurveIntersections.Finalize Method
 Destructor.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
CurveIntersections Class
Rhino.Geometry.Intersect Namespace