RhinoCommon API
SceneServerData.Dispose Method
 Dispose for SceneServerData
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SceneServerData Class
Dispose Overload
Rhino.Render Namespace