RhinoCommon API
ObjectTable.AddSubD Method (SubD, ObjectAttributes, HistoryRecord, Boolean)
Adds a SubD object to Rhino.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Guid AddSubD(
	SubD subD,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddSubD (
	subD As SubD,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
subD
Type: Rhino.Geometry.SubD
A duplicate of this SubD is added to Rhino.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes that will be linked with the object.
history
Type: Rhino.DocObjects.HistoryRecord
[Missing <param name="history"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddSubD(Rhino.Geometry.SubD,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
reference
Type: System.Boolean
[Missing <param name="reference"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddSubD(Rhino.Geometry.SubD,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddSubD Overload
Rhino.DocObjects.Tables Namespace