RhinoCommon API
ObjectPropertiesPage.GetSelectedObjects Method (ObjectType)
 Get selected objects that match a given filter
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoObject[] GetSelectedObjects(
	ObjectType filter
)
Public Function GetSelectedObjects (
	filter As ObjectType
) As RhinoObject()
Parameters
filter
Type: Rhino.DocObjects.ObjectType
[Missing <param name="filter"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.GetSelectedObjects(Rhino.DocObjects.ObjectType)"]
Return Value
Type: RhinoObject[]
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPage.GetSelectedObjects(Rhino.DocObjects.ObjectType)"]
See Also
Reference
ObjectPropertiesPage Class
GetSelectedObjects Overload
Rhino.UI Namespace