RhinoCommon API
Transform.Clone Method
 Returns a deep copy of the transform. For languages that treat structures as value types, this can be accomplished by a simple assignment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Transform Clone()
Public Function Clone As Transform
Return Value
Type: Transform
A deep copy of this data structure.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace