RhinoCommon API
ColorRGBA.BlendTo Method
[Missing <summary> documentation for "M:Rhino.Display.ColorRGBA.BlendTo(Rhino.Display.ColorRGBA,System.Double)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public ColorRGBA BlendTo(
	ColorRGBA col,
	double coefficient
)
Public Function BlendTo (
	col As ColorRGBA,
	coefficient As Double
) As ColorRGBA
Parameters
col
Type: Rhino.Display.ColorRGBA
[Missing <param name="col"/> documentation for "M:Rhino.Display.ColorRGBA.BlendTo(Rhino.Display.ColorRGBA,System.Double)"]
coefficient
Type: System.Double
[Missing <param name="coefficient"/> documentation for "M:Rhino.Display.ColorRGBA.BlendTo(Rhino.Display.ColorRGBA,System.Double)"]
Return Value
Type: ColorRGBA
[Missing <returns> documentation for "M:Rhino.Display.ColorRGBA.BlendTo(Rhino.Display.ColorRGBA,System.Double)"]
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace