RhinoCommon API
FilePdf.DrawPolyline Method
 Draw a polyline path
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public abstract void DrawPolyline(
	int pageNumber,
	PointF[] polyline,
	Color fillColor,
	Color strokeColor,
	float strokeWidth
)
Public MustOverride Sub DrawPolyline (
	pageNumber As Integer,
	polyline As PointF(),
	fillColor As Color,
	strokeColor As Color,
	strokeWidth As Single
)
Parameters
pageNumber
Type: System.Int32
[Missing <param name="pageNumber"/> documentation for "M:Rhino.FileIO.FilePdf.DrawPolyline(System.Int32,System.Drawing.PointF[],System.Drawing.Color,System.Drawing.Color,System.Single)"]
polyline
Type: System.Drawing.PointF[]
[Missing <param name="polyline"/> documentation for "M:Rhino.FileIO.FilePdf.DrawPolyline(System.Int32,System.Drawing.PointF[],System.Drawing.Color,System.Drawing.Color,System.Single)"]
fillColor
Type: System.Drawing.Color
[Missing <param name="fillColor"/> documentation for "M:Rhino.FileIO.FilePdf.DrawPolyline(System.Int32,System.Drawing.PointF[],System.Drawing.Color,System.Drawing.Color,System.Single)"]
strokeColor
Type: System.Drawing.Color
[Missing <param name="strokeColor"/> documentation for "M:Rhino.FileIO.FilePdf.DrawPolyline(System.Int32,System.Drawing.PointF[],System.Drawing.Color,System.Drawing.Color,System.Single)"]
strokeWidth
Type: System.Single
[Missing <param name="strokeWidth"/> documentation for "M:Rhino.FileIO.FilePdf.DrawPolyline(System.Int32,System.Drawing.PointF[],System.Drawing.Color,System.Drawing.Color,System.Single)"]
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace