RhinoCommon API
File3dmGroupTable.FindNameHash Method
 Finds a Group given its name hash.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public Group FindNameHash(
	NameHash nameHash
)
Public Function FindNameHash (
	nameHash As NameHash
) As Group
Parameters
nameHash
Type: Rhino.FileIO.NameHash
The name hash of the Group to be searched.
Return Value
Type: Group
A Group, or null on error.
See Also
Reference
File3dmGroupTable Class
Rhino.FileIO Namespace