RhinoCommon API
RealtimeDisplayMode.RegisterDisplayModes Method (Assembly, Guid)
 Find and register classes that derive from RealtimeDisplayMode from the given plug-in. The plug-in is found in the given assembly
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RealtimeDisplayModeClassInfo[] RegisterDisplayModes(
	Assembly assembly,
	Guid pluginId
)
Public Shared Function RegisterDisplayModes (
	assembly As Assembly,
	pluginId As Guid
) As RealtimeDisplayModeClassInfo()
Parameters
assembly
Type: System.Reflection.Assembly
[Missing <param name="assembly"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.RegisterDisplayModes(System.Reflection.Assembly,System.Guid)"]
pluginId
Type: System.Guid
[Missing <param name="pluginId"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.RegisterDisplayModes(System.Reflection.Assembly,System.Guid)"]
Return Value
Type: RealtimeDisplayModeClassInfo[]
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.RegisterDisplayModes(System.Reflection.Assembly,System.Guid)"]
See Also
Reference
RealtimeDisplayMode Class
RegisterDisplayModes Overload
Rhino.Render Namespace