RhinoCommon API
ObjectTable.Duplicate Method (Guid)
 Same as TransformObject(objref, ON_Xform.Identity, false)
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid Duplicate(
	Guid objectId
)
Public Function Duplicate (
	objectId As Guid
) As Guid
Parameters
objectId
Type: System.Guid
An ID to an object in the document that needs to be duplicated.
Return Value
Type: Guid
The new object ID.
See Also
Reference
ObjectTable Class
Duplicate Overload
Rhino.DocObjects.Tables Namespace