RhinoCommon API
LengthMassProperties.Compute Method (Curve)
 Calculates the length mass properties of a curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public static LengthMassProperties Compute(
	Curve curve
)
Public Shared Function Compute (
	curve As Curve
) As LengthMassProperties
Parameters
curve
Type: Rhino.Geometry.Curve
The curve to measure.
Return Value
Type: LengthMassProperties
The LengthMassProperties for the given curve, or null on failure.
See Also
Reference
LengthMassProperties Class
Compute Overload
Rhino.Geometry Namespace