RhinoCommon API
SupportOptions.MaxPreviewSeconds Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.MaxPreviewSeconds"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static int MaxPreviewSeconds()
Public Shared Function MaxPreviewSeconds As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.MaxPreviewSeconds"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace