RhinoCommon API
TextEntity.CreateCurvesGrouped Method (DimensionStyle, Boolean, Boolean, Double, Double)
 Creates planar curve from text outline curves. Curves are grouped such that each element in the list being returned represents a single character.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public List<Curve[]> CreateCurvesGrouped(
	DimensionStyle dimstyle,
	bool allowOpen,
	bool makeSmallCaps,
	double smallCapsScale,
	double spacing
)
Public Function CreateCurvesGrouped (
	dimstyle As DimensionStyle,
	allowOpen As Boolean,
	makeSmallCaps As Boolean,
	smallCapsScale As Double,
	spacing As Double
) As List(Of Curve())
Parameters
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.TextEntity.CreateCurvesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Boolean,System.Double,System.Double)"]
allowOpen
Type: System.Boolean
 Set to true to prevent forced closing of open curves retrieved from glyphs.
makeSmallCaps
Type: System.Boolean
[Missing <param name="makeSmallCaps"/> documentation for "M:Rhino.Geometry.TextEntity.CreateCurvesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Boolean,System.Double,System.Double)"]
smallCapsScale
Type: System.Double
[Missing <param name="smallCapsScale"/> documentation for "M:Rhino.Geometry.TextEntity.CreateCurvesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Boolean,System.Double,System.Double)"]
spacing
Type: System.Double
[Missing <param name="spacing"/> documentation for "M:Rhino.Geometry.TextEntity.CreateCurvesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Boolean,System.Double,System.Double)"]
Return Value
Type: List<Curve[]>
[Missing <returns> documentation for "M:Rhino.Geometry.TextEntity.CreateCurvesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Boolean,System.Double,System.Double)"]
See Also
Reference
TextEntity Class
CreateCurvesGrouped Overload
Rhino.Geometry Namespace