RhinoCommon API
SoftTransformSettings.UpdateFromState Method
 Sets all settings to a particular defined joined state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void UpdateFromState(
	SoftTransformSettingsState state
)
Public Shared Sub UpdateFromState (
	state As SoftTransformSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.SoftTransformSettingsState
The particular state.
See Also
Reference
SoftTransformSettings Class
Rhino.ApplicationSettings Namespace