RhinoCommon API
RenderContent.IsRenderHashCached Method
Note: This API is now obsolete.
 This method is deprecated and no longer called. For more information see CalculateRenderHash(UInt64)
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("This method is deprecated and no longer called. For more information see CalculateRenderHash")]
public bool IsRenderHashCached()
<ObsoleteAttribute("This method is deprecated and no longer called. For more information see CalculateRenderHash")>
Public Function IsRenderHashCached As Boolean
Return Value
Type: Boolean
bool
See Also
Reference
RenderContent Class
Rhino.Render Namespace