RhinoCommon API
IntersectingMeshPair Constructor
 Initializes a new instance of IntersectingMeshPair.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IntersectingMeshPair(
	int meshIndexA,
	int meshIndexB,
	int faceIndexA,
	int faceIndexB
)
Public Sub New (
	meshIndexA As Integer,
	meshIndexB As Integer,
	faceIndexA As Integer,
	faceIndexB As Integer
)
Parameters
meshIndexA
Type: System.Int32
The index of the first mesh.
meshIndexB
Type: System.Int32
The index of the second mesh.
faceIndexA
Type: System.Int32
The index of a face of the first mesh.
faceIndexB
Type: System.Int32
The index of a face of the second mesh.
See Also
Reference
IntersectingMeshPair Structure
Rhino.Geometry.Intersect Namespace