RhinoCommon API
HatchPatternTable.Rename Method (Int32, String)
 Renames a hatch pattern in the table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Rename(
	int hatchPatternIndex,
	string hatchPatternName
)
Public Function Rename (
	hatchPatternIndex As Integer,
	hatchPatternName As String
) As Boolean
Parameters
hatchPatternIndex
Type: System.Int32
The index of the hatch pattern to rename.
hatchPatternName
Type: System.String
The new hatch pattern name.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
HatchPatternTable Class
Rename Overload
Rhino.DocObjects.Tables Namespace