RhinoCommon API
HostUtils.ShutDownRhinoCommon_RDK Method
 Makes sure all static RhinoCommon RDK components are de-initialized so they aren't calling into space when the RDK is unloaded.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void ShutDownRhinoCommon_RDK()
Public Shared Sub ShutDownRhinoCommon_RDK
Remarks
Subsequent calls to this method will be ignored.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace