RhinoCommon API
ColorRGBA.Equals Method (ColorRGBA)
 Determines whether the specified ColorRGBA has the same values as the present color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Equals(
	ColorRGBA other
)
Public Function Equals (
	other As ColorRGBA
) As Boolean
Parameters
other
Type: Rhino.Display.ColorRGBA
The specified color.
Return Value
Type: Boolean
true if color has the same channel values as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ColorRGBA Structure
Equals Overload
Rhino.Display Namespace