RhinoCommon API
ZBufferCapture.ShowText Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowText(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public void ShowText(
	bool on
)
Public Sub ShowText (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowText(System.Boolean)"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace