RhinoCommon API
RhinoDoc.Redo Method
 Redo the last action that was "undone"
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.16
Syntax
public bool Redo()
Public Function Redo As Boolean
Return Value
Type: Boolean
 true on success
See Also
Reference
RhinoDoc Class
Rhino Namespace