RhinoCommon API
DisplayPipeline.SetupDisplayMaterial Method (Color)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.SetupDisplayMaterial(System.Drawing.Color)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public DisplayMaterial SetupDisplayMaterial(
	Color color
)
Public Function SetupDisplayMaterial (
	color As Color
) As DisplayMaterial
Parameters
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.SetupDisplayMaterial(System.Drawing.Color)"]
Return Value
Type: DisplayMaterial
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipeline.SetupDisplayMaterial(System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
SetupDisplayMaterial Overload
Rhino.Display Namespace