RhinoCommon API
Polyline.ToPolylineCurve Method
 Constructs a polyline curve representation of this polyline.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PolylineCurve ToPolylineCurve()
Public Function ToPolylineCurve As PolylineCurve
Return Value
Type: PolylineCurve
A curve shaped like this polyline or null on failure.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace