RhinoCommon API
Quaternion.GetYawPitchRoll Method
 Find sthe Tait-Byran angles, also loosely called Euler angles, for this quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool GetYawPitchRoll(
	out double yaw,
	out double pitch,
	out double roll
)
Public Function GetYawPitchRoll (
	<OutAttribute> ByRef yaw As Double,
	<OutAttribute> ByRef pitch As Double,
	<OutAttribute> ByRef roll As Double
) As Boolean
Parameters
yaw
Type: System.Double
Angle, in radians, to rotate about the ZAxis.
pitch
Type: System.Double
Angle, in radians, to rotate about the YAxis.
roll
Type: System.Double
Angle, in radians, to rotate about the XAxis.
Return Value
Type: Boolean
true if successful, or false if this is not a rotation.
Remarks
 When true, this = RotationZYX(yaw, pitch, roll) = R_z(yaw) * R_y(pitch) * R_x(roll), where R_*(angle) is rotation of angle radians about the corresponding world coordinate axis. roll and yaw are in the range (-pi, pi], and pitch is in [-pi/2, pi/2].
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace