RhinoCommon API
LicenseUtils.Initialize Method
 Initializes the license manager.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool Initialize()
Public Shared Function Initialize As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.Initialize"]
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace