RhinoCommon API
Centermark.Create Method (DimensionStyle, Plane, Point3d, Double)
Creates a new center mark dimension.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Centermark Create(
	DimensionStyle dimStyle,
	Plane plane,
	Point3d centerPoint,
	double radius
)
Public Shared Function Create (
	dimStyle As DimensionStyle,
	plane As Plane,
	centerPoint As Point3d,
	radius As Double
) As Centermark
Parameters
dimStyle
Type: Rhino.DocObjects.DimensionStyle
Dimension's dimension style.
plane
Type: Rhino.Geometry.Plane
Dimension's plane.
centerPoint
Type: Rhino.Geometry.Point3d
Dimension's center point.
radius
Type: System.Double
Center mark's radius.
Return Value
Type: Centermark
A new center mark if successful, null otherwise.
See Also
Reference
Centermark Class
Create Overload
Rhino.Geometry Namespace