RhinoCommon API
Triangle3d.ToMesh Method
 Create a mesh from this triangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Mesh ToMesh()
Public Function ToMesh As Mesh
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Triangle3d.ToMesh"]
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace