RhinoCommon API
RhinoObject.GetHighlightedSubObjects Method
 Gets a list of all highlighted sub-objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ComponentIndex[] GetHighlightedSubObjects()
Public Function GetHighlightedSubObjects As ComponentIndex()
Return Value
Type: ComponentIndex[]
An array of all highlighted sub-objects; or null is there are none.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace