RhinoCommon API
ColorHSV Constructor (Double, Double, Double)
 Constructs a new instance of ColorHSV with custom channel values.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ColorHSV(
	double hue,
	double saturation,
	double value
)
Public Sub New (
	hue As Double,
	saturation As Double,
	value As Double
)
Parameters
hue
Type: System.Double
Hue channel value. Hue channels rotate between 0.0 and 1.0.
saturation
Type: System.Double
Saturation channel value. Channel will be limited to 0~1.
value
Type: System.Double
Value (Brightness) channel value. Channel will be limited to 0~1.
See Also
Reference
ColorHSV Structure
ColorHSV Overload
Rhino.Display Namespace