RhinoCommon API
Point3f.DistanceToSquared Method
 Computes the squared distance between two points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public double DistanceToSquared(
	Point3f other
)
Public Function DistanceToSquared (
	other As Point3f
) As Double
Parameters
other
Type: Rhino.Geometry.Point3f
Other point for distance measurement.
Return Value
Type: Double
The squared length of the line between this and the other point; or 0 if any of the points is not valid.
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace