RhinoCommon API
SubDEdgeSharpness.ToPercentage Method
 Converts a sharpness value to a percentage between 0.0 and 100.0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static double ToPercentage(
	double sharpness,
	double creasePercentage
)
Public Shared Function ToPercentage (
	sharpness As Double,
	creasePercentage As Double
) As Double
Parameters
sharpness
Type: System.Double
 Between 0.0 and MaximumValue, or CreaseValue.
creasePercentage
Type: System.Double
 The value to return when sharpness is CreaseValue.
Return Value
Type: Double
 100.0 * sharpness / MaximumValue, creasePercentage for CreaseValue, or NaN if sharpness is not valid.
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace