RhinoCommon API
SubDSurfaceInterpolator.Clear Method
 Destroys the information needed to solve the interpolation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
SubDSurfaceInterpolator Class
Rhino.Geometry Namespace