RhinoCommon API
DisplayMaterial.Finalize Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayMaterial.Finalize"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace