RhinoCommon API
PersistentSettings.TryGetRectangle Method (String, Rectangle, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetRectangle(System.String,System.Drawing.Rectangle@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetRectangle(
	string key,
	out Rectangle value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetRectangle (
	key As String,
	<OutAttribute> ByRef value As Rectangle,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetRectangle(System.String,System.Drawing.Rectangle@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: System.Drawing.Rectangle
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetRectangle(System.String,System.Drawing.Rectangle@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetRectangle(System.String,System.Drawing.Rectangle@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetRectangle(System.String,System.Drawing.Rectangle@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetRectangle Overload
Rhino Namespace