RhinoCommon API
SupportOptions.UsePreviewCache Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.UsePreviewCache"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool UsePreviewCache()
Public Shared Function UsePreviewCache As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.UsePreviewCache"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace