RhinoCommon API
Decal.CustomData Method
 Gets decal custom data for the current renderer. See Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public List<NamedValue> CustomData()
Public Function CustomData As List(Of NamedValue)
Return Value
Type: List<NamedValue>
A list of name-value pairs for the custom data properties. If there is no custom data on the decal for the current renderer, the list will be empty.
See Also
Reference
Decal Class
CustomData Overload
Rhino.Render Namespace