RhinoCommon API
IntersectionEvent.CompareEquivalent Method (IntersectionEvent, IntersectionEvent, Double, TextLog)
 Compare intersection events.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool CompareEquivalent(
	IntersectionEvent eventA,
	IntersectionEvent eventB,
	double relativePointTolerance,
	TextLog log
)
Public Shared Function CompareEquivalent (
	eventA As IntersectionEvent,
	eventB As IntersectionEvent,
	relativePointTolerance As Double,
	log As TextLog
) As Boolean
Parameters
eventA
Type: Rhino.Geometry.Intersect.IntersectionEvent
The first intersection event to compare.
eventB
Type: Rhino.Geometry.Intersect.IntersectionEvent
The second intersection event to compare.
relativePointTolerance
Type: System.Double
The comparison tolerance. If RhinoMath.UnsetValue, then RhinoMath.SqrtEpsilon is used.
log
Type: Rhino.FileIO.TextLog
If not null and false is returned, then a description of the error is appended to log.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Intersect.IntersectionEvent.CompareEquivalent(Rhino.Geometry.Intersect.IntersectionEvent,Rhino.Geometry.Intersect.IntersectionEvent,System.Double,Rhino.FileIO.TextLog)"]
See Also
Reference
IntersectionEvent Class
CompareEquivalent Overload
Rhino.Geometry.Intersect Namespace