RhinoCommon API
RenderPlugIn.RegisterRenderTabs Method
 Override this method and call RegisterTab(PlugIn, Type, Guid, String, Icon) to add custom tabs to the render output window
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void RegisterRenderTabs(
	RenderTabs tabs
)
Protected Overridable Sub RegisterRenderTabs (
	tabs As RenderTabs
)
Parameters
tabs
Type: Rhino.Render.RenderTabs
[Missing <param name="tabs"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.RegisterRenderTabs(Rhino.Render.RenderTabs)"]
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace