RhinoCommon API
Transform.Equality Operator
 Determines if two transformations are equal in value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool operator ==(
	Transform a,
	Transform b
)
Public Shared Operator = (
	a As Transform,
	b As Transform
) As Boolean
Parameters
a
Type: Rhino.Geometry.Transform
A transform.
b
Type: Rhino.Geometry.Transform
Another transform.
Return Value
Type: Boolean
true if transforms are equal; otherwise false.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace