RhinoCommon API
TextFields.ObjectLayer Method
 Return an object's layer name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string ObjectLayer(
	string id
)
Public Shared Function ObjectLayer (
	id As String
) As String
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.ObjectLayer(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.ObjectLayer(System.String)"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace