RhinoCommon API
GetBaseClass.AddOptionEnumSelectionList<T> Method (LocalizeStringPair, IEnumerable<T>, Int32)
 Adds a list of enumerated values as option list. Use enumSelection[go.Option.CurrentListOptionIndex] to retrieve selection.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.37
Syntax
public int AddOptionEnumSelectionList<T>(
	LocalizeStringPair optionName,
	IEnumerable<T> enumSelection,
	int listCurrentIndex
)
where T : struct, new(), IConvertible
Public Function AddOptionEnumSelectionList(Of T As {Structure, New, IConvertible}) (
	optionName As LocalizeStringPair,
	enumSelection As IEnumerable(Of T),
	listCurrentIndex As Integer
) As Integer
Parameters
optionName
Type: Rhino.UI.LocalizeStringPair
The name of the option
enumSelection
Type: System.Collections.Generic.IEnumerable<T>
The enumerated values to use.
listCurrentIndex
Type: System.Int32
Zero based index of current option.
Type Parameters
T
The enumerated type
Return Value
Type: Int32
Option index
See Also
Reference
GetBaseClass Class
AddOptionEnumSelectionList Overload
Rhino.Input.Custom Namespace