RhinoCommon API
PointCloud.ReleaseUnsafeLock Method
 Updates the PointCloud data with the information that was stored via the PointCloudUnsafeLock.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public void ReleaseUnsafeLock(
	PointCloudUnsafeLock pointCloudData
)
Public Sub ReleaseUnsafeLock (
	pointCloudData As PointCloudUnsafeLock
)
Parameters
pointCloudData
Type: Rhino.Geometry.PointCloudUnsafeLock
The data that will be unlocked.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace