RhinoCommon API
IRhinoDocObserver.RhinoDocClosed Method
 When a document is closed
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void RhinoDocClosed(
	RhinoDocObserverArgs e
)
Sub RhinoDocClosed (
	e As RhinoDocObserverArgs
)
Parameters
e
Type: Rhino.RhinoDocObserverArgs
[Missing <param name="e"/> documentation for "M:Rhino.IRhinoDocObserver.RhinoDocClosed(Rhino.RhinoDocObserverArgs)"]
See Also
Reference
IRhinoDocObserver Interface
Rhino Namespace