RhinoCommon API
Brep.Split Method (IEnumerable<Curve>, Double)
 Splits a Brep into pieces using curves, at least partially on the Brep, as cutters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.13
Syntax
public Brep[] Split(
	IEnumerable<Curve> cutters,
	double intersectionTolerance
)
Public Function Split (
	cutters As IEnumerable(Of Curve),
	intersectionTolerance As Double
) As Brep()
Parameters
cutters
Type: System.Collections.Generic.IEnumerable<Curve>
The splitting curves. Only the portion of the curve on the Brep surface will be used for cutting.
intersectionTolerance
Type: System.Double
The tolerance with which to compute intersections.
Return Value
Type: Brep[]
A new array of Breps. This array can be empty.
See Also
Reference
Brep Class
Split Overload
Rhino.Geometry Namespace