RhinoCommon API
TrulyObservableOrderedSet<T>.Sort<TKey> Method
 Sorts the set.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Sort<TKey>(
	Func<T, TKey> keySelector,
	bool descending = false
)
Public Sub Sort(Of TKey) (
	keySelector As Func(Of T, TKey),
	Optional descending As Boolean = false
)
Parameters
keySelector
Type: System.Func<T, TKey>
[Missing <param name="keySelector"/> documentation for "M:Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.Sort``1(System.Func{`0,``0},System.Boolean)"]
descending (Optional)
Type: System.Boolean
If true, the sort will happen in descending other; if false, it will happen in ascending order.
Type Parameters
TKey
[Missing <typeparam name="TKey"/> documentation for "M:Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.Sort``1(System.Func{`0,``0},System.Boolean)"]
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace