RhinoCommon API
LicenseUtils.GetLicenseStatus Method
 Returns the current status of every license for UI purposes.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static LicenseStatus[] GetLicenseStatus()
Public Shared Function GetLicenseStatus As LicenseStatus()
Return Value
Type: LicenseStatus[]
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicenseStatus"]
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace