RhinoCommon API
Sun.JulianDay Method
[Missing <summary> documentation for "M:Rhino.Render.Sun.JulianDay(System.Double,System.Int32,System.DateTime,System.Double)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static double JulianDay(
	double timezoneHours,
	int daylightMinutes,
	DateTime when,
	double hours
)
Public Shared Function JulianDay (
	timezoneHours As Double,
	daylightMinutes As Integer,
	when As DateTime,
	hours As Double
) As Double
Parameters
timezoneHours
Type: System.Double
[Missing <param name="timezoneHours"/> documentation for "M:Rhino.Render.Sun.JulianDay(System.Double,System.Int32,System.DateTime,System.Double)"]
daylightMinutes
Type: System.Int32
[Missing <param name="daylightMinutes"/> documentation for "M:Rhino.Render.Sun.JulianDay(System.Double,System.Int32,System.DateTime,System.Double)"]
when
Type: System.DateTime
[Missing <param name="when"/> documentation for "M:Rhino.Render.Sun.JulianDay(System.Double,System.Int32,System.DateTime,System.Double)"]
hours
Type: System.Double
[Missing <param name="hours"/> documentation for "M:Rhino.Render.Sun.JulianDay(System.Double,System.Int32,System.DateTime,System.Double)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.Sun.JulianDay(System.Double,System.Int32,System.DateTime,System.Double)"]
See Also
Reference
Sun Class
Rhino.Render Namespace