RhinoCommon API
ThumbData.GetPreviewHeigth Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.ThumbData.GetPreviewHeigth(Rhino.Render.DataSources.Sizes,Rhino.Render.DataSources.Shapes)"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static int GetPreviewHeigth(
	Sizes thumb_size,
	Shapes shape
)
Public Shared Function GetPreviewHeigth (
	thumb_size As Sizes,
	shape As Shapes
) As Integer
Parameters
thumb_size
Type: Rhino.Render.DataSources.Sizes
[Missing <param name="thumb_size"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.ThumbData.GetPreviewHeigth(Rhino.Render.DataSources.Sizes,Rhino.Render.DataSources.Shapes)"]
shape
Type: Rhino.Render.DataSources.Shapes
[Missing <param name="shape"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.ThumbData.GetPreviewHeigth(Rhino.Render.DataSources.Sizes,Rhino.Render.DataSources.Shapes)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.ThumbData.GetPreviewHeigth(Rhino.Render.DataSources.Sizes,Rhino.Render.DataSources.Shapes)"]
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace