RhinoCommon API
ShowPanelEventArgs Constructor
Initializes a new instance of the ShowPanelEventArgs class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ShowPanelEventArgs(
	Guid panelId,
	uint documentSerialNumber,
	bool show
)
Public Sub New (
	panelId As Guid,
	documentSerialNumber As UInteger,
	show As Boolean
)
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.ShowPanelEventArgs.#ctor(System.Guid,System.UInt32,System.Boolean)"]
documentSerialNumber
Type: System.UInt32
[Missing <param name="documentSerialNumber"/> documentation for "M:Rhino.UI.ShowPanelEventArgs.#ctor(System.Guid,System.UInt32,System.Boolean)"]
show
Type: System.Boolean
[Missing <param name="show"/> documentation for "M:Rhino.UI.ShowPanelEventArgs.#ctor(System.Guid,System.UInt32,System.Boolean)"]
See Also
Reference
ShowPanelEventArgs Class
Rhino.UI Namespace