RhinoCommon API
RealtimeDisplayMode.OnRenderSizeChanged Method
 Override to restart your render engine
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool OnRenderSizeChanged(
	int width,
	int height
)
Public Overridable Function OnRenderSizeChanged (
	width As Integer,
	height As Integer
) As Boolean
Parameters
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.OnRenderSizeChanged(System.Int32,System.Int32)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.OnRenderSizeChanged(System.Int32,System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.OnRenderSizeChanged(System.Int32,System.Int32)"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace