RhinoCommon API
NurbsCurveKnotList.Contains Method
 Returns an indication of the presence of a value in the knot list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Contains(
	double item
)
Public Function Contains (
	item As Double
) As Boolean
Parameters
item
Type: System.Double
The item.
Return Value
Type: Boolean
true if present, false otherwise.
Implements
ICollection<T>.Contains(T)
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace