RhinoCommon API
SimpleArrayGuid Constructor
 Initializes a new SimpleArrayGuid class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SimpleArrayGuid()
Public Sub New
See Also
Reference
SimpleArrayGuid Class
SimpleArrayGuid Overload
Rhino.Runtime.InteropWrappers Namespace