RhinoCommon API
ViewInfo Constructor (UInt32)
 Construct the ViewInfo for active viewport of given doc.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ViewInfo(
	uint docRuntimeSerialNumber
)
Public Sub New (
	docRuntimeSerialNumber As UInteger
)
Parameters
docRuntimeSerialNumber
Type: System.UInt32
Runtime serial number of the document to query for the active viewport
See Also
Reference
ViewInfo Class
ViewInfo Overload
Rhino.DocObjects Namespace