RhinoCommon API
RenderWindow.IsChannelShown Method
 Query if a channel is being shown.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool IsChannelShown(
	Guid id
)
Public Function IsChannelShown (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Render.RenderWindow.IsChannelShown(System.Guid)"]
Return Value
Type: Boolean
Returns true if the channel is being shown.
See Also
Reference
RenderWindow Class
Rhino.Render Namespace