RhinoCommon API
RhinoDoc.GetGumballPlane Method
 Returns the active plane of Rhino's auto-gumball widget. Note, when calling from a Rhino command, make sure the command class has the Rhino.Commands.Style.Transparent command style attribute.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GetGumballPlane(
	out Plane plane
)
Public Function GetGumballPlane (
	<OutAttribute> ByRef plane As Plane
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
The active plane.
Return Value
Type: Boolean
true if the auto-gumball widget is enabled and visible. False otherwise.
See Also
Reference
RhinoDoc Class
Rhino Namespace