RhinoCommon API
SupportOptions.SetUseQuickInitialPreview Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetUseQuickInitialPreview(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void SetUseQuickInitialPreview(
	bool b
)
Public Shared Sub SetUseQuickInitialPreview (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetUseQuickInitialPreview(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace