RhinoCommon API
RenderContentCollection.Finalize Method
 Finalizer for RenderContentCollection
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace