RhinoCommon API
PreviewJobSignature.Compare Method
 Compare two Preview Job Signatures. True if they are the same, otherwise false.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public bool Compare(
	PreviewJobSignature pjs
)
Public Function Compare (
	pjs As PreviewJobSignature
) As Boolean
Parameters
pjs
Type: Rhino.Render.PreviewJobSignature
[Missing <param name="pjs"/> documentation for "M:Rhino.Render.PreviewJobSignature.Compare(Rhino.Render.PreviewJobSignature)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PreviewJobSignature.Compare(Rhino.Render.PreviewJobSignature)"]
See Also
Reference
PreviewJobSignature Class
Rhino.Render Namespace