RhinoCommon API
RhinoViewport.SetUserStrings Method
 Attach a user string (key,value combination) to this viewport.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.18
Syntax
public bool SetUserStrings(
	IEnumerable<KeyValuePair<string, string>> items,
	bool replace
)
Public Function SetUserStrings (
	items As IEnumerable(Of KeyValuePair(Of String, String)),
	replace As Boolean
) As Boolean
Parameters
items
Type: System.Collections.Generic.IEnumerable<KeyValuePair<String, String>>
collection of key-value pairs to set.
replace
Type: System.Boolean
If True, the previous user string will be removed
Return Value
Type: Boolean
true on success.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace