RhinoCommon API
PlaneIntersectionCache.Clear Method
 Removes all entries, and releases the geometry the cache kept alive.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
PlaneIntersectionCache Class
Rhino.Geometry.Intersect Namespace