RhinoCommon API
SurfaceProxy Constructor
 Protected constructor for internal use.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected SurfaceProxy()
Protected Sub New
See Also
Reference
SurfaceProxy Class
Rhino.Geometry Namespace