RhinoCommon API
Transform.IsUniformlyScaled Method
 Determines if this transform is uniformly scaled - that is, a similarity transformation that scales all directions equally and preserves angles, mapping circles to circles. This includes pure rotations, translations and mirroring.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsUniformlyScaled()
Public Function IsUniformlyScaled As Boolean
Return Value
Type: Boolean
True if uniformly scaled, false otherwise.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace