RhinoCommon API
SimpleArrayBinaryArchiveReader Constructor
 Initializes a new SimpleArrayBinaryArchiveReader class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public SimpleArrayBinaryArchiveReader()
Public Sub New
See Also
Reference
SimpleArrayBinaryArchiveReader Class
SimpleArrayBinaryArchiveReader Overload
Rhino.Runtime.InteropWrappers Namespace