RhinoCommon API
CurvatureGraphSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static CurvatureGraphSettingsState GetDefaultState()
Public Shared Function GetDefaultState As CurvatureGraphSettingsState
Return Value
Type: CurvatureGraphSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.CurvatureGraphSettings.GetDefaultState"]
See Also
Reference
CurvatureGraphSettings Class
Rhino.ApplicationSettings Namespace