RhinoCommon API
SubD.CreateFromMesh Method (Mesh, SubDCreationOptions)
 Create a new SubD from a mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static SubD CreateFromMesh(
	Mesh mesh,
	SubDCreationOptions options
)
Public Shared Function CreateFromMesh (
	mesh As Mesh,
	options As SubDCreationOptions
) As SubD
Parameters
mesh
Type: Rhino.Geometry.Mesh
The input mesh.
options
Type: Rhino.Geometry.SubDCreationOptions
The SubD creation options.
Return Value
Type: SubD
A new SubD if successful, or null on failure.
See Also
Reference
SubD Class
CreateFromMesh Overload
Rhino.Geometry Namespace