RhinoCommon API
ObjectTable.AddRhinoObject Method (CustomPointObject, HistoryRecord)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomPointObject,Rhino.DocObjects.HistoryRecord)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public void AddRhinoObject(
	CustomPointObject pointObject,
	HistoryRecord history
)
Public Sub AddRhinoObject (
	pointObject As CustomPointObject,
	history As HistoryRecord
)
Parameters
pointObject
Type: Rhino.DocObjects.Custom.CustomPointObject
[Missing <param name="pointObject"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomPointObject,Rhino.DocObjects.HistoryRecord)"]
history
Type: Rhino.DocObjects.HistoryRecord
[Missing <param name="history"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomPointObject,Rhino.DocObjects.HistoryRecord)"]
See Also
Reference
ObjectTable Class
AddRhinoObject Overload
Rhino.DocObjects.Tables Namespace