RhinoCommon API
Color4f.FromArgb Method (Single, Single, Single, Single)
[Missing <summary> documentation for "M:Rhino.Display.Color4f.FromArgb(System.Single,System.Single,System.Single,System.Single)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public static Color4f FromArgb(
	float a,
	float r,
	float g,
	float b
)
Public Shared Function FromArgb (
	a As Single,
	r As Single,
	g As Single,
	b As Single
) As Color4f
Parameters
a
Type: System.Single
[Missing <param name="a"/> documentation for "M:Rhino.Display.Color4f.FromArgb(System.Single,System.Single,System.Single,System.Single)"]
r
Type: System.Single
[Missing <param name="r"/> documentation for "M:Rhino.Display.Color4f.FromArgb(System.Single,System.Single,System.Single,System.Single)"]
g
Type: System.Single
[Missing <param name="g"/> documentation for "M:Rhino.Display.Color4f.FromArgb(System.Single,System.Single,System.Single,System.Single)"]
b
Type: System.Single
[Missing <param name="b"/> documentation for "M:Rhino.Display.Color4f.FromArgb(System.Single,System.Single,System.Single,System.Single)"]
Return Value
Type: Color4f
[Missing <returns> documentation for "M:Rhino.Display.Color4f.FromArgb(System.Single,System.Single,System.Single,System.Single)"]
See Also
Reference
Color4f Structure
FromArgb Overload
Rhino.Display Namespace