RhinoCommon API
Intersection.BrepBrep Method (Brep, Brep, Double, Boolean, Curve[], Point3d[])
 Intersects two Breps.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public static bool BrepBrep(
	Brep brepA,
	Brep brepB,
	double tolerance,
	bool joinCurves,
	out Curve[] intersectionCurves,
	out Point3d[] intersectionPoints
)
Public Shared Function BrepBrep (
	brepA As Brep,
	brepB As Brep,
	tolerance As Double,
	joinCurves As Boolean,
	<OutAttribute> ByRef intersectionCurves As Curve(),
	<OutAttribute> ByRef intersectionPoints As Point3d()
) As Boolean
Parameters
brepA
Type: Rhino.Geometry.Brep
First Brep for intersection.
brepB
Type: Rhino.Geometry.Brep
Second Brep for intersection.
tolerance
Type: System.Double
Intersection tolerance.
joinCurves
Type: System.Boolean
If true, join the resulting curves where possible.
intersectionCurves
Type: Rhino.Geometry.Curve[]
The intersection curves will be returned here.
intersectionPoints
Type: Rhino.Geometry.Point3d[]
The intersection points will be returned here.
Return Value
Type: Boolean
 true if the operation was success, false otherwise. Check the output arrays to determine how the input intersects.
See Also
Reference
Intersection Class
BrepBrep Overload
Rhino.Geometry.Intersect Namespace