RhinoCommon API
LicenseUtils.ConvertLicense Method
 Converts a product license from a standalone node to a network node.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool ConvertLicense(
	Guid productId
)
Public Shared Function ConvertLicense (
	productId As Guid
) As Boolean
Parameters
productId
Type: System.Guid
 The Guid of the product that you want to check in.
Return Value
Type: Boolean
 true if the license was successfully converted. false if not successful or on error.
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace