RhinoCommon API
InstanceDefinitionTable.ModifyInsertionPoint Method
 Modifies the insertion point of an instance definition. The definition's geometry is re-origined so that the supplied point becomes the new insertion point - the point that aligns with the insertion location when the block is inserted. Existing instance references are not modified, so they will appear to move. Only embedded instance definitions are supported; the function returns false for linked definitions.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ModifyInsertionPoint(
	int idefIndex,
	Point3d point
)
Public Function ModifyInsertionPoint (
	idefIndex As Integer,
	point As Point3d
) As Boolean
Parameters
idefIndex
Type: System.Int32
The index of the instance definition to be modified.
point
Type: Rhino.Geometry.Point3d
The new insertion point, in the definition's current coordinates.
Return Value
Type: Boolean
true if operation succeeded.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace