RhinoCommon API
BrepFace.RemoveHoles Method
 Remove all inner loops, or holes, from a Brep face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Brep RemoveHoles(
	double tolerance
)
Public Function RemoveHoles (
	tolerance As Double
) As Brep
Parameters
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.BrepFace.RemoveHoles(System.Double)"]
Return Value
Type: Brep
[Missing <returns> documentation for "M:Rhino.Geometry.BrepFace.RemoveHoles(System.Double)"]
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace