RhinoCommon API
NamedPositionTable.Objects Method (Guid)
Array of Rhino Objects related to a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoObject[] Objects(
	Guid id
)
Public Function Objects (
	id As Guid
) As RhinoObject()
Parameters
id
Type: System.Guid
 The Guid of the named position from which you want to retrieve the objects.
Return Value
Type: RhinoObject[]
 Array of Rhino Objects which are tracked by the Named Position.
See Also
Reference
NamedPositionTable Class
Objects Overload
Rhino.DocObjects.Tables Namespace