RhinoCommon API
NurbsCurve.SetEndCondition Method (Boolean, NurbsCurve.NurbsCurveEndConditionType, Point3d, Vector3d, Vector3d)
 Set end condition of a NURBS curve to point, tangent and curvature.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SetEndCondition(
	bool bSetEnd,
	NurbsCurve.NurbsCurveEndConditionType continuity,
	Point3d point,
	Vector3d tangent,
	Vector3d curvature
)
Public Function SetEndCondition (
	bSetEnd As Boolean,
	continuity As NurbsCurve.NurbsCurveEndConditionType,
	point As Point3d,
	tangent As Vector3d,
	curvature As Vector3d
) As Boolean
Parameters
bSetEnd
Type: System.Boolean
true: set end of curve, false: set start of curve
continuity
Type: Rhino.Geometry.NurbsCurve.NurbsCurveEndConditionType
Position: set start or end point, Tangency: set point and tangent, Curvature: set point, tangent and curvature
point
Type: Rhino.Geometry.Point3d
point to set
tangent
Type: Rhino.Geometry.Vector3d
tangent to set
curvature
Type: Rhino.Geometry.Vector3d
curvature to set
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsCurve Class
SetEndCondition Overload
Rhino.Geometry Namespace