RhinoCommon API
FieldDictionary.Add Method (String, Point4d)
 Add a new Point4dField to the dictionary. This will be a data only field and not show up in the content browsers.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Point4dField Add(
	string key,
	Point4d value
)
Public Function Add (
	key As String,
	value As Point4d
) As Point4dField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: Rhino.Geometry.Point4d
Initial value for this field.
Return Value
Type: Point4dField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Point4d)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace