RhinoCommon API
Command Constructor
 Default protected constructor. It only allows instantiation through sub-classing.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Command()
Protected Sub New
See Also
Reference
Command Class
Rhino.Commands Namespace