RhinoCommon API
ChangeQueue.ApplyRenderSettingsChanges Method (DisplayRenderSettings)
 Override this when you want to handle render setting changes. These are for the viewport settings.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplyRenderSettingsChanges(
	DisplayRenderSettings settings
)
Protected Overridable Sub ApplyRenderSettingsChanges (
	settings As DisplayRenderSettings
)
Parameters
settings
Type: Rhino.Render.ChangeQueue.DisplayRenderSettings
[Missing <param name="settings"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyRenderSettingsChanges(Rhino.Render.ChangeQueue.DisplayRenderSettings)"]
See Also
Reference
ChangeQueue Class
ApplyRenderSettingsChanges Overload
Rhino.Render.ChangeQueue Namespace