RhinoCommon API
SubDFaceList.ClearPerFaceColors Method
 Removes all per face color overrides on the active level.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.18
Syntax
public uint ClearPerFaceColors()
Public Function ClearPerFaceColors As UInteger
Return Value
Type: UInt32
Number of changed faces.
Remarks
 Per face colors are a mutable property on SubDFace and are set with PerFaceColor.
See Also
Reference
SubDFaceList Class
Rhino.Geometry.Collections Namespace