RhinoCommon API
DisplayPipeline.DrawDot Method (Single, Single, String)
 Draws a text dot in screen coordinates.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawDot(
	float screenX,
	float screenY,
	string text
)
Public Sub DrawDot (
	screenX As Single,
	screenY As Single,
	text As String
)
Parameters
screenX
Type: System.Single
X coordinate (in pixels) of dot center.
screenY
Type: System.Single
Y coordinate (in pixels) of dot center.
text
Type: System.String
Text content of dot.
See Also
Reference
DisplayPipeline Class
DrawDot Overload
Rhino.Display Namespace