RhinoCommon API
DrawingUtilities.SvgToRhinoDibIntPtr Method
 Create bitmap of a given size from an svg string
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void SvgToRhinoDibIntPtr(
	string svg,
	int width,
	int height,
	bool adjustForDarkMode,
	IntPtr pRhinoDib
)
Public Shared Sub SvgToRhinoDibIntPtr (
	svg As String,
	width As Integer,
	height As Integer,
	adjustForDarkMode As Boolean,
	pRhinoDib As IntPtr
)
Parameters
svg
Type: System.String
[Missing <param name="svg"/> documentation for "M:Rhino.UI.DrawingUtilities.SvgToRhinoDibIntPtr(System.String,System.Int32,System.Int32,System.Boolean,System.IntPtr)"]
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.UI.DrawingUtilities.SvgToRhinoDibIntPtr(System.String,System.Int32,System.Int32,System.Boolean,System.IntPtr)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.UI.DrawingUtilities.SvgToRhinoDibIntPtr(System.String,System.Int32,System.Int32,System.Boolean,System.IntPtr)"]
adjustForDarkMode
Type: System.Boolean
[Missing <param name="adjustForDarkMode"/> documentation for "M:Rhino.UI.DrawingUtilities.SvgToRhinoDibIntPtr(System.String,System.Int32,System.Int32,System.Boolean,System.IntPtr)"]
pRhinoDib
Type: System.IntPtr
[Missing <param name="pRhinoDib"/> documentation for "M:Rhino.UI.DrawingUtilities.SvgToRhinoDibIntPtr(System.String,System.Int32,System.Int32,System.Boolean,System.IntPtr)"]
Return Value
Type:
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace