RhinoCommon API
File3dmDisplacement.DeleteSubItem Method
 Deletes a sub-item by its face index. face_index is the index of the face on the polysurface/SubD.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void DeleteSubItem(
	int face_index
)
Public Sub DeleteSubItem (
	face_index As Integer
)
Parameters
face_index
Type: System.Int32
[Missing <param name="face_index"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.DeleteSubItem(System.Int32)"]
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace