RhinoCommon API
Font.FromQuartetProperties Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Font.FromQuartetProperties(System.String,System.Boolean,System.Boolean)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public static Font FromQuartetProperties(
	string quartetName,
	bool bold,
	bool italic
)
Public Shared Function FromQuartetProperties (
	quartetName As String,
	bold As Boolean,
	italic As Boolean
) As Font
Parameters
quartetName
Type: System.String
[Missing <param name="quartetName"/> documentation for "M:Rhino.DocObjects.Font.FromQuartetProperties(System.String,System.Boolean,System.Boolean)"]
bold
Type: System.Boolean
[Missing <param name="bold"/> documentation for "M:Rhino.DocObjects.Font.FromQuartetProperties(System.String,System.Boolean,System.Boolean)"]
italic
Type: System.Boolean
[Missing <param name="italic"/> documentation for "M:Rhino.DocObjects.Font.FromQuartetProperties(System.String,System.Boolean,System.Boolean)"]
Return Value
Type: Font
[Missing <returns> documentation for "M:Rhino.DocObjects.Font.FromQuartetProperties(System.String,System.Boolean,System.Boolean)"]
See Also
Reference
Font Class
Rhino.DocObjects Namespace