RhinoCommon API
StackedDialogPage Constructor
 Protected constructor
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected StackedDialogPage(
	string englishPageTitle
)
Protected Sub New (
	englishPageTitle As String
)
Parameters
englishPageTitle
Type: System.String
[Missing <param name="englishPageTitle"/> documentation for "M:Rhino.UI.StackedDialogPage.#ctor(System.String)"]
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace