RhinoCommon API
ObjectTable.Replace Method (Guid, Brep, Boolean)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Brep,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public bool Replace(
	Guid objectId,
	Brep brep,
	bool splitKinkySurfaces
)
Public Function Replace (
	objectId As Guid,
	brep As Brep,
	splitKinkySurfaces As Boolean
) As Boolean
Parameters
objectId
Type: System.Guid
[Missing <param name="objectId"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Brep,System.Boolean)"]
brep
Type: Rhino.Geometry.Brep
[Missing <param name="brep"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Brep,System.Boolean)"]
splitKinkySurfaces
Type: System.Boolean
[Missing <param name="splitKinkySurfaces"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Brep,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Brep,System.Boolean)"]
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace