RhinoCommon API
AsyncRenderContext.StopRendering Method
 Override StopRendering if you need to do additional tasks besides having Cancel set to true. Note: you should always base.StopRendering() in your overriding implementation.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual void StopRendering()
Public Overridable Sub StopRendering
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace