RhinoCommon API
SimpleArrayMeshPointer Constructor
 Initializes a new SimpleArrayMeshPointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SimpleArrayMeshPointer()
Public Sub New
See Also
Reference
SimpleArrayMeshPointer Class
Rhino.Runtime.InteropWrappers Namespace