RhinoCommon API
TextureGraphInfo.SetActiveAxis Method
[Missing <summary> documentation for "M:Rhino.Render.TextureGraphInfo.SetActiveAxis(Rhino.Render.TextureGraphInfo.Axis)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public void SetActiveAxis(
	TextureGraphInfo.Axis axis
)
Public Sub SetActiveAxis (
	axis As TextureGraphInfo.Axis
)
Parameters
axis
Type: Rhino.Render.TextureGraphInfo.Axis
[Missing <param name="axis"/> documentation for "M:Rhino.Render.TextureGraphInfo.SetActiveAxis(Rhino.Render.TextureGraphInfo.Axis)"]
See Also
Reference
TextureGraphInfo Class
Rhino.Render Namespace