RhinoCommon API
HermiteSurface.ToNurbsSurface Method
 Constructs a NURBS surface satisfying the Hermite interpolation conditions.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public NurbsSurface ToNurbsSurface()
Public Function ToNurbsSurface As NurbsSurface
Return Value
Type: NurbsSurface
A NURBS surface is successful, null otherwise.
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace