RhinoCommon API
DisplayPipeline.DrawPoints Method (IEnumerable<Point3d>, PointStyle, Single, Color)
Draw a set of points with a given radius, style and color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawPoints(
	IEnumerable<Point3d> points,
	PointStyle style,
	float radius,
	Color color
)
Public Sub DrawPoints (
	points As IEnumerable(Of Point3d),
	style As PointStyle,
	radius As Single,
	color As Color
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Location of points in world coordinates.
style
Type: Rhino.Display.PointStyle
Point display style.
radius
Type: System.Single
Point size in pixels.
color
Type: System.Drawing.Color
 Color of points. If style is ControlPoint, this will be the border color.
See Also
Reference
DisplayPipeline Class
DrawPoints Overload
Rhino.Display Namespace