RhinoCommon API
RhinoViewport.GetFrustumBoundingBox Method
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.GetFrustumBoundingBox"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox GetFrustumBoundingBox()
Public Function GetFrustumBoundingBox As BoundingBox
Return Value
Type: BoundingBox
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.GetFrustumBoundingBox"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace