RhinoCommon API
DisplayPipeline.Flush Method
 Force the pipeline to immediately flush any cached geometry to the display
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Flush()
Public Sub Flush
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace