RhinoCommon API
RenderPrimitiveList.Add Method (Cone, Plane, RenderMaterial)
 Add primitive cone and material.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public void Add(
	Cone cone,
	Plane truncation,
	RenderMaterial material
)
Public Sub Add (
	cone As Cone,
	truncation As Plane,
	material As RenderMaterial
)
Parameters
cone
Type: Rhino.Geometry.Cone
Cone to add.
truncation
Type: Rhino.Geometry.Plane
 The plane used to cut the cone (the non-apex end is kept). Should be equal to cone.plane if not truncated.
material
Type: Rhino.Render.RenderMaterial
 Material to add, may be null if not needed.
See Also
Reference
RenderPrimitiveList Class
Add Overload
Rhino.Render Namespace