RhinoCommon API
FileCsv.Write Method
Write a Csv file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	FileCsvWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As FileCsvWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileCsvWriteOptions
options used for generating the Csv file
Return Value
Type: Boolean
true on success
See Also
Reference
FileCsv Class
Rhino.FileIO Namespace