RhinoCommon API
ContentCollectionIterator.Dispose Method
Releases all resources used by the ContentCollectionIterator
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ContentCollectionIterator Class
Rhino.Render Namespace