RhinoCommon API
NurbsCurve.CreateFromCircle Method (Circle)
 Gets a rational degree 2 NURBS curve representation of the circle. Note that the parameterization of NURBS curve does not match circle's transcendental parameterization. Use GetRadianFromNurbFormParameter() and GetParameterFromRadian() to convert between the NURBS curve parameter and the transcendental parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static NurbsCurve CreateFromCircle(
	Circle circle
)
Public Shared Function CreateFromCircle (
	circle As Circle
) As NurbsCurve
Parameters
circle
Type: Rhino.Geometry.Circle
[Missing <param name="circle"/> documentation for "M:Rhino.Geometry.NurbsCurve.CreateFromCircle(Rhino.Geometry.Circle)"]
Return Value
Type: NurbsCurve
Curve on success, null on failure.
See Also
Reference
NurbsCurve Class
CreateFromCircle Overload
Rhino.Geometry Namespace