RhinoCommon API
RealtimeDisplayMode.SignalRedraw Method
 Use to signal the underlying pipeline a redraw is wanted. This can be used for instance when a renderer has completed a pass which should be updated in the associated viewport.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SignalRedraw()
Public Sub SignalRedraw
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace