RhinoCommon API
CollapsibleSectionHolderImpl.IsSameObject Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.CollapsibleSectionHolderImpl.IsSameObject(System.IntPtr)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsSameObject(
	IntPtr cpp
)
Public Function IsSameObject (
	cpp As IntPtr
) As Boolean
Parameters
cpp
Type: System.IntPtr
[Missing <param name="cpp"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionHolderImpl.IsSameObject(System.IntPtr)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.CollapsibleSectionHolderImpl.IsSameObject(System.IntPtr)"]
See Also
Reference
CollapsibleSectionHolderImpl Class
Rhino.UI.Controls Namespace