RhinoCommon API
SubDDisplayParameters.Default Method
 Parameters for the default limit surface display mesh. SubD display density = adaptive SubDDisplayParameters.Density.DefaultDensity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static SubDDisplayParameters Default()
Public Shared Function Default As SubDDisplayParameters
Return Value
Type: SubDDisplayParameters
The SubD display parameters.
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace