RhinoCommon API
DisplayPen.PatternAsArray Method
 Get the pattern for this pen as an array of dash,gap,dash,gap... values
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public float[] PatternAsArray()
Public Function PatternAsArray As Single()
Return Value
Type: Single[]
[Missing <returns> documentation for "M:Rhino.Display.DisplayPen.PatternAsArray"]
See Also
Reference
DisplayPen Class
Rhino.Display Namespace