RhinoCommon API
DisplayPipeline.DrawPoints Method (DisplayPointSet, DisplayPointAttributes, DisplayPointAttributes)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoints(Rhino.Display.DisplayPointSet,Rhino.Display.DisplayPointAttributes,Rhino.Display.DisplayPointAttributes)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void DrawPoints(
	DisplayPointSet points,
	DisplayPointAttributes fallbackAttributes,
	DisplayPointAttributes overrideAttributes
)
Public Sub DrawPoints (
	points As DisplayPointSet,
	fallbackAttributes As DisplayPointAttributes,
	overrideAttributes As DisplayPointAttributes
)
Parameters
points
Type: Rhino.Display.DisplayPointSet
[Missing <param name="points"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoints(Rhino.Display.DisplayPointSet,Rhino.Display.DisplayPointAttributes,Rhino.Display.DisplayPointAttributes)"]
fallbackAttributes
Type: Rhino.Display.DisplayPointAttributes
[Missing <param name="fallbackAttributes"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoints(Rhino.Display.DisplayPointSet,Rhino.Display.DisplayPointAttributes,Rhino.Display.DisplayPointAttributes)"]
overrideAttributes
Type: Rhino.Display.DisplayPointAttributes
[Missing <param name="overrideAttributes"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawPoints(Rhino.Display.DisplayPointSet,Rhino.Display.DisplayPointAttributes,Rhino.Display.DisplayPointAttributes)"]
See Also
Reference
DisplayPipeline Class
DrawPoints Overload
Rhino.Display Namespace