RhinoCommon API
Mesh.ClearTextureData Method
 Removes all texture coordinate information from this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void ClearTextureData()
Public Sub ClearTextureData
See Also
Reference
Mesh Class
Rhino.Geometry Namespace