RhinoCommon API
DrawingUtilities.BitmapFromSvg Method (String, Int32, Int32)
 Create bitmap of a given size from an svg string
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public static Bitmap BitmapFromSvg(
	string svg,
	int width,
	int height
)
Public Shared Function BitmapFromSvg (
	svg As String,
	width As Integer,
	height As Integer
) As Bitmap
Parameters
svg
Type: System.String
A valid svg string
width
Type: System.Int32
Width of the svg in pixels
height
Type: System.Int32
Height of the svg in pixels
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.UI.DrawingUtilities.BitmapFromSvg(System.String,System.Int32,System.Int32)"]
See Also
Reference
DrawingUtilities Class
BitmapFromSvg Overload
Rhino.UI Namespace