RhinoCommon API
RhinoGet.GetInterpolatedCurveOnSurface Method (Surface, Curve, ObjRef, Point2d[])
 Interactively picks the points of a curve interpolated through a surface. This is the getter behind the Rhino InterpCrvOnSrf command.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Result GetInterpolatedCurveOnSurface(
	Surface surface,
	out Curve curve,
	out ObjRef surfaceObjRef,
	out Point2d[] surfaceParameters
)
Public Shared Function GetInterpolatedCurveOnSurface (
	surface As Surface,
	<OutAttribute> ByRef curve As Curve,
	<OutAttribute> ByRef surfaceObjRef As ObjRef,
	<OutAttribute> ByRef surfaceParameters As Point2d()
) As Result
Parameters
surface
Type: Rhino.Geometry.Surface
The surface to draw on, or null to have the user pick one.
curve
Type: Rhino.Geometry.Curve
The resulting curve, or null when the result is not Success.
surfaceObjRef
Type: Rhino.DocObjects.ObjRef
 The face the user picked, or null when a surface was supplied or nothing was picked.
surfaceParameters
Type: Rhino.Geometry.Point2d[]
The picked points in the parameter space of the surface.
Return Value
Type: Result
 The command result. UnknownCommand means the user chose the Edit option, which the InterpCrvOnSrf command answers by restarting in edit mode.
See Also
Reference
RhinoGet Class
GetInterpolatedCurveOnSurface Overload
Rhino.Input Namespace