RhinoCommon API
RenderMaterial.ToMaterial Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.ToMaterial(Rhino.Render.RenderTexture.TextureGeneration)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Material ToMaterial(
	RenderTexture.TextureGeneration tg
)
Public Function ToMaterial (
	tg As RenderTexture.TextureGeneration
) As Material
Parameters
tg
Type: Rhino.Render.RenderTexture.TextureGeneration
[Missing <param name="tg"/> documentation for "M:Rhino.Render.RenderMaterial.ToMaterial(Rhino.Render.RenderTexture.TextureGeneration)"]
Return Value
Type: Material
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.ToMaterial(Rhino.Render.RenderTexture.TextureGeneration)"]
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace