RhinoCommon API
Notification.ToString Method
 Returns a readable string representation of the instance.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.Notifications.Notification.ToString"]
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace