RhinoCommon API
RenderWindow.Channel.AddValue Method
 Add value to existing values at point x, y. If x or y are out of range, the function will fail and may crash Rhino.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void AddValue(
	int x,
	int y,
	Color4f value
)
Public Sub AddValue (
	x As Integer,
	y As Integer,
	value As Color4f
)
Parameters
x
Type: System.Int32
The horizontal pixel position. No validation is done on this value. The caller is responsible for ensuring that it is within the frame buffer.
y
Type: System.Int32
The vertical pixel position. No validation is done on this value. The caller is responsible for ensuring that it is within the frame buffer.
value
Type: Rhino.Display.Color4f
The color to store in the channel at the specified position.
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace