RhinoCommon API
SupportOptions.PreferNativeRenderer Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.PreferNativeRenderer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool PreferNativeRenderer()
Public Shared Function PreferNativeRenderer As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.PreferNativeRenderer"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace