RhinoCommon API
StringHolder.Finalize Method
 Destructor
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
StringHolder Class
Rhino.Runtime.InteropWrappers Namespace