RhinoCommon API
ObjectAttributes.ComputedSectionStyle Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedSectionStyle(Rhino.RhinoDoc,Rhino.DocObjects.ObjectAttributes,System.Boolean,System.Guid)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SectionStyle ComputedSectionStyle(
	RhinoDoc doc,
	ObjectAttributes sectionerAttributes,
	bool computeColors,
	Guid viewport_id
)
Public Function ComputedSectionStyle (
	doc As RhinoDoc,
	sectionerAttributes As ObjectAttributes,
	computeColors As Boolean,
	viewport_id As Guid
) As SectionStyle
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedSectionStyle(Rhino.RhinoDoc,Rhino.DocObjects.ObjectAttributes,System.Boolean,System.Guid)"]
sectionerAttributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="sectionerAttributes"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedSectionStyle(Rhino.RhinoDoc,Rhino.DocObjects.ObjectAttributes,System.Boolean,System.Guid)"]
computeColors
Type: System.Boolean
[Missing <param name="computeColors"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedSectionStyle(Rhino.RhinoDoc,Rhino.DocObjects.ObjectAttributes,System.Boolean,System.Guid)"]
viewport_id
Type: System.Guid
[Missing <param name="viewport_id"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedSectionStyle(Rhino.RhinoDoc,Rhino.DocObjects.ObjectAttributes,System.Boolean,System.Guid)"]
Return Value
Type: SectionStyle
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedSectionStyle(Rhino.RhinoDoc,Rhino.DocObjects.ObjectAttributes,System.Boolean,System.Guid)"]
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace