RhinoCommon API
RhinoObject.HistoryChildren Method
 Gets the ids of the child Rhino objects of this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public Guid[] HistoryChildren()
Public Function HistoryChildren As Guid()
Return Value
Type: Guid[]
An array of Rhino object ids if successful, an empty array if the object has no children or on error.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace