RhinoCommon API
Squisher.GetAreaConstrainedTrianglesIndices Method
 Gets mesh vertex indices for the triangular faces that were constrained during the squish. Indices can be used in both the 2d and 3d mesh vertices arrays.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public MeshFace[] GetAreaConstrainedTrianglesIndices()
Public Function GetAreaConstrainedTrianglesIndices As MeshFace()
Return Value
Type: MeshFace[]
An array of mesh faces
See Also
Reference
Squisher Class
Rhino.Geometry Namespace