RhinoCommon API
Color4f.ApplyGamma Method
[Missing <summary> documentation for "M:Rhino.Display.Color4f.ApplyGamma(Rhino.Display.Color4f,System.Single)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Color4f ApplyGamma(
	Color4f col,
	float gamma
)
Public Shared Function ApplyGamma (
	col As Color4f,
	gamma As Single
) As Color4f
Parameters
col
Type: Rhino.Display.Color4f
[Missing <param name="col"/> documentation for "M:Rhino.Display.Color4f.ApplyGamma(Rhino.Display.Color4f,System.Single)"]
gamma
Type: System.Single
[Missing <param name="gamma"/> documentation for "M:Rhino.Display.Color4f.ApplyGamma(Rhino.Display.Color4f,System.Single)"]
Return Value
Type: Color4f
[Missing <returns> documentation for "M:Rhino.Display.Color4f.ApplyGamma(Rhino.Display.Color4f,System.Single)"]
See Also
Reference
Color4f Structure
Rhino.Display Namespace