RhinoCommon API
MeshVertexList.Hide Method
 Hides the vertex at the given index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Hide(
	int vertexIndex
)
Public Sub Hide (
	vertexIndex As Integer
)
Parameters
vertexIndex
Type: System.Int32
Index of vertex to hide.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace