RhinoCommon API
File3dmObjectTable.GetEnumerator Method
 Returns an enumerator that yields all objects in this document. Like in Rhino, this includes lights. Unlike in Rhino, however, all lights are returned in the end of the list.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override IEnumerator<File3dmObject> GetEnumerator()
Public Overrides Function GetEnumerator As IEnumerator(Of File3dmObject)
Return Value
Type: IEnumerator<File3dmObject>
An enumerator that yields all objects in a document.
Implements
IEnumerable<T>.GetEnumerator()
IEnumerable<T>.GetEnumerator()
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace