RhinoCommon API
Surface.FitCurveToSurface Method
[Missing <summary> documentation for "M:Rhino.Geometry.Surface.FitCurveToSurface(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,System.Double,System.Collections.Generic.IEnumerable{System.Double},System.Boolean,Rhino.Geometry.Curve@,Rhino.Geometry.Curve@)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Curve[] FitCurveToSurface(
	Curve trimCurve3d,
	Vector3d trimProjectionDir,
	double tolerance,
	IEnumerable<double> Knots,
	bool divideIntoSections,
	ref Curve trimCurveOnSurface,
	ref Curve splitCurve
)
Public Function FitCurveToSurface (
	trimCurve3d As Curve,
	trimProjectionDir As Vector3d,
	tolerance As Double,
	Knots As IEnumerable(Of Double),
	divideIntoSections As Boolean,
	ByRef trimCurveOnSurface As Curve,
	ByRef splitCurve As Curve
) As Curve()
Parameters
trimCurve3d
Type: Rhino.Geometry.Curve
curve that will trim from one edge to the opposite
trimProjectionDir
Type: Rhino.Geometry.Vector3d
Vector for projection, or zero vector for no projection
tolerance
Type: System.Double
3d tolerance for projection, splitting, fitting...
Knots
Type: System.Collections.Generic.IEnumerable<Double>
For TrimParamKnots=3, the custom knots to add
divideIntoSections
Type: System.Boolean
If true, the surface is divided at each knot
trimCurveOnSurface
Type: Rhino.Geometry.Curve
the actual trim curve as it is projected on or pulled to the surface
splitCurve
Type: Rhino.Geometry.Curve
the actual fit curve the split the surface
Return Value
Type: Curve[]
[Missing <returns> documentation for "M:Rhino.Geometry.Surface.FitCurveToSurface(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,System.Double,System.Collections.Generic.IEnumerable{System.Double},System.Boolean,Rhino.Geometry.Curve@,Rhino.Geometry.Curve@)"]
See Also
Reference
Surface Class
Rhino.Geometry Namespace