RhinoCommon API
RenderTexture.SetGraphInfo Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.SetGraphInfo(Rhino.Render.TextureGraphInfo)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public void SetGraphInfo(
	TextureGraphInfo tgi
)
Public Sub SetGraphInfo (
	tgi As TextureGraphInfo
)
Parameters
tgi
Type: Rhino.Render.TextureGraphInfo
[Missing <param name="tgi"/> documentation for "M:Rhino.Render.RenderTexture.SetGraphInfo(Rhino.Render.TextureGraphInfo)"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace