RhinoCommon API
PurgeStatistics.PurgedCount Method
 The number of table objects that were purged.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PurgedCount(
	PurgeFilter filter
)
Public Function PurgedCount (
	filter As PurgeFilter
) As Integer
Parameters
filter
Type: Rhino.PurgeFilter
 The document table object types of interest. Values can be or-ed together, in which case the sum of the counts of each type is returned.
Return Value
Type: Int32
The number of table objects that were purged.
See Also
Reference
PurgeStatistics Class
Rhino Namespace