RhinoCommon API
ColorLCH.CreateFromHSL Method
 Create the nearest LCH equivalent of an HSL color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static ColorLCH CreateFromHSL(
	ColorHSL hsl
)
Public Shared Function CreateFromHSL (
	hsl As ColorHSL
) As ColorLCH
Parameters
hsl
Type: Rhino.Display.ColorHSL
Target color in HSL space.
Return Value
Type: ColorLCH
The LCH equivalent of the HSL color.
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace