RhinoCommon API
ZooClientParameters Constructor
 ZooClientParameters Constructor
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ZooClientParameters(
	Guid productGuid,
	Guid licenseGuid,
	string productTitle,
	int productBuildType,
	LicenseCapabilities capabilities,
	string licenseEntryTextMask,
	string productPath,
	Object parentWindow,
	LicenseTypes selectedLicenseType,
	ValidateProductKeyDelegate validateProductKey,
	OnLeaseChangedDelegate onLeaseChangedDelegate,
	VerifyLicenseKeyDelegate verifyLicenseKeyDelegate,
	VerifyPreviousVersionLicenseDelegate verifyPreviousVersionLicenseKeyDelegate
)
Public Sub New (
	productGuid As Guid,
	licenseGuid As Guid,
	productTitle As String,
	productBuildType As Integer,
	capabilities As LicenseCapabilities,
	licenseEntryTextMask As String,
	productPath As String,
	parentWindow As Object,
	selectedLicenseType As LicenseTypes,
	validateProductKey As ValidateProductKeyDelegate,
	onLeaseChangedDelegate As OnLeaseChangedDelegate,
	verifyLicenseKeyDelegate As VerifyLicenseKeyDelegate,
	verifyPreviousVersionLicenseKeyDelegate As VerifyPreviousVersionLicenseDelegate
)
Parameters
productGuid
Type: System.Guid
Guid used by ZooClient to identify the plug-in requesting a license from ZooClient. This Guid may be used by different versions of the plug-in. If different licenses are used by different versions of the plug-in, the plug-in must also specify a LicenseGuid.
licenseGuid
Type: System.Guid
Guid used by ZooClient to identify the license saved by ZooClient. This differs from ProductGuid because different versions of a plug-in with the same Plug-in ID may need different licenses.
productTitle
Type: System.String
Title of product displayed in user interface
productBuildType
Type: System.Int32
[Missing <param name="productBuildType"/> documentation for "M:Rhino.Runtime.ZooClientParameters.#ctor(System.Guid,System.Guid,System.String,System.Int32,Rhino.PlugIns.LicenseCapabilities,System.String,System.String,System.Object,Rhino.Runtime.LicenseTypes,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate)"]
capabilities
Type: Rhino.PlugIns.LicenseCapabilities
Enum that declares whether this product supports evalation, licensing, purchasing, and cloud zoo
licenseEntryTextMask
Type: System.String
Text mask used to limit input. EG: RH50-AAAA-AAAA-AAAA-AAAA-AAAA
productPath
Type: System.String
Full path to DLL implementing product
parentWindow
Type: System.Object
Object used to parent UI DLLs
selectedLicenseType
Type: Rhino.Runtime.LicenseTypes
Type of license currently used by this product
validateProductKey
Type: Rhino.PlugIns.ValidateProductKeyDelegate
Delegate called to validate the structure of a license key
onLeaseChangedDelegate
Type: Rhino.PlugIns.OnLeaseChangedDelegate
Delegate called when a cloud zoo lease changes
verifyLicenseKeyDelegate
Type: Rhino.PlugIns.VerifyLicenseKeyDelegate
Delegate called to verify the structure of a license key
verifyPreviousVersionLicenseKeyDelegate
Type: Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate
Delegate called to verify the structure of an upgrade license key
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace