RhinoCommon API
Mesh.CreateExtrusion Method (Curve, Vector3d)
 Constructs a mesh by extruding a curve along a vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Mesh CreateExtrusion(
	Curve profile,
	Vector3d direction
)
Public Shared Function CreateExtrusion (
	profile As Curve,
	direction As Vector3d
) As Mesh
Parameters
profile
Type: Rhino.Geometry.Curve
Profile curve to extrude.
direction
Type: Rhino.Geometry.Vector3d
Direction and length of extrusion.
Return Value
Type: Mesh
A mesh on success or null on failure.
See Also
Reference
Mesh Class
CreateExtrusion Overload
Rhino.Geometry Namespace