RhinoCommon API
GetOption Constructor
Initializes a new instance of the GetOption class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GetOption()
Public Sub New
See Also
Reference
GetOption Class
Rhino.Input.Custom Namespace