RhinoCommon API
RealtimeDisplayMode.ShutdownRenderer Method
 Override to shutdown your render engine
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract void ShutdownRenderer()
Public MustOverride Sub ShutdownRenderer
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace