RhinoCommon API
MeshVertexList.ToPoint3dArray Method
 Copies all vertices to a new array of Point3d.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d[] ToPoint3dArray()
Public Function ToPoint3dArray As Point3d()
Return Value
Type: Point3d[]
A new array.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace