RhinoCommon API
PointCloud.CreateFromMesh Method
 Creates a point cloud from a mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.29
Syntax
public static PointCloud CreateFromMesh(
	Mesh mesh
)
Public Shared Function CreateFromMesh (
	mesh As Mesh
) As PointCloud
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to copy vertices, vertex normals, and colors.
Return Value
Type: PointCloud
A point cloud if successful, otherwise null.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace