RhinoCommon API
Decal.GetUVBounds Method
 The UV bounds of the decal. Only used when mapping is UV.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.18
Syntax
public void GetUVBounds(
	out double min_u,
	out double min_v,
	out double max_u,
	out double max_v
)
Public Sub GetUVBounds (
	<OutAttribute> ByRef min_u As Double,
	<OutAttribute> ByRef min_v As Double,
	<OutAttribute> ByRef max_u As Double,
	<OutAttribute> ByRef max_v As Double
)
Parameters
min_u
Type: System.Double
[Missing <param name="min_u"/> documentation for "M:Rhino.Render.Decal.GetUVBounds(System.Double@,System.Double@,System.Double@,System.Double@)"]
min_v
Type: System.Double
[Missing <param name="min_v"/> documentation for "M:Rhino.Render.Decal.GetUVBounds(System.Double@,System.Double@,System.Double@,System.Double@)"]
max_u
Type: System.Double
[Missing <param name="max_u"/> documentation for "M:Rhino.Render.Decal.GetUVBounds(System.Double@,System.Double@,System.Double@,System.Double@)"]
max_v
Type: System.Double
[Missing <param name="max_v"/> documentation for "M:Rhino.Render.Decal.GetUVBounds(System.Double@,System.Double@,System.Double@,System.Double@)"]
See Also
Reference
Decal Class
Rhino.Render Namespace