RhinoCommon API
PostEffectJobChannels.GetChannel Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffectJobChannels.GetChannel(System.Guid)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PostEffectChannel GetChannel(
	Guid channelId
)
Public Function GetChannel (
	channelId As Guid
) As PostEffectChannel
Parameters
channelId
Type: System.Guid
[Missing <param name="channelId"/> documentation for "M:Rhino.Render.PostEffects.PostEffectJobChannels.GetChannel(System.Guid)"]
Return Value
Type: PostEffectChannel
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectJobChannels.GetChannel(System.Guid)"]
See Also
Reference
PostEffectJobChannels Class
Rhino.Render.PostEffects Namespace