RhinoCommon API
AngularDimension Constructor (Plane, Vector3d, Point3d, Point3d, Point3d, Point3d)
 Constructs an angular dimension with extension lines starting at plane origin (arc center).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public AngularDimension(
	Plane plane,
	Vector3d horizontal,
	Point3d centerpoint,
	Point3d defpoint1,
	Point3d defpoint2,
	Point3d dimlinepoint
)
Public Sub New (
	plane As Plane,
	horizontal As Vector3d,
	centerpoint As Point3d,
	defpoint1 As Point3d,
	defpoint2 As Point3d,
	dimlinepoint As Point3d
)
Parameters
plane
Type: Rhino.Geometry.Plane
Dimension's plane.
horizontal
Type: Rhino.Geometry.Vector3d
Horizontal reference direction.
centerpoint
Type: Rhino.Geometry.Point3d
Dimension center point.
defpoint1
Type: Rhino.Geometry.Point3d
Point on first extension line.
defpoint2
Type: Rhino.Geometry.Point3d
Point on second extension line.
dimlinepoint
Type: Rhino.Geometry.Point3d
Point on dimension arc.
See Also
Reference
AngularDimension Class
AngularDimension Overload
Rhino.Geometry Namespace