RhinoCommon API
SurfaceCurvature.Dispose Method
 Actively releases the unmanaged pointer.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace