RhinoCommon API
AngularDimension.GetAngleDisplayText Method
[Missing <summary> documentation for "M:Rhino.Geometry.AngularDimension.GetAngleDisplayText(Rhino.DocObjects.DimensionStyle)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string GetAngleDisplayText(
	DimensionStyle style
)
Public Function GetAngleDisplayText (
	style As DimensionStyle
) As String
Parameters
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.AngularDimension.GetAngleDisplayText(Rhino.DocObjects.DimensionStyle)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Geometry.AngularDimension.GetAngleDisplayText(Rhino.DocObjects.DimensionStyle)"]
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace