RhinoCommon API
Texture.SetRGBBlendValues Method
 If the TextureCombineMode is Blend, then the blending function for RGB is determined by
 new rgb = colorcolor + a0[0]*(current RGB) + a1[1]*(texture RGB) + a2[2]*min(current RGB,texture RGB) + a3[3]*max(current RGB,texture RGB)
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetRGBBlendValues(
	Color color,
	double a0,
	double a1,
	double a2,
	double a3
)
Public Sub SetRGBBlendValues (
	color As Color,
	a0 As Double,
	a1 As Double,
	a2 As Double,
	a3 As Double
)
Parameters
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.DocObjects.Texture.SetRGBBlendValues(System.Drawing.Color,System.Double,System.Double,System.Double,System.Double)"]
a0
Type: System.Double
[Missing <param name="a0"/> documentation for "M:Rhino.DocObjects.Texture.SetRGBBlendValues(System.Drawing.Color,System.Double,System.Double,System.Double,System.Double)"]
a1
Type: System.Double
[Missing <param name="a1"/> documentation for "M:Rhino.DocObjects.Texture.SetRGBBlendValues(System.Drawing.Color,System.Double,System.Double,System.Double,System.Double)"]
a2
Type: System.Double
[Missing <param name="a2"/> documentation for "M:Rhino.DocObjects.Texture.SetRGBBlendValues(System.Drawing.Color,System.Double,System.Double,System.Double,System.Double)"]
a3
Type: System.Double
[Missing <param name="a3"/> documentation for "M:Rhino.DocObjects.Texture.SetRGBBlendValues(System.Drawing.Color,System.Double,System.Double,System.Double,System.Double)"]
See Also
Reference
Texture Class
Rhino.DocObjects Namespace