RhinoCommon API
CommonObject.FromJSON Method (String)
 Create a CommonObject instance from a JSON string
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public static CommonObject FromJSON(
	string json
)
Public Shared Function FromJSON (
	json As String
) As CommonObject
Parameters
json
Type: System.String
[Missing <param name="json"/> documentation for "M:Rhino.Runtime.CommonObject.FromJSON(System.String)"]
Return Value
Type: CommonObject
[Missing <returns> documentation for "M:Rhino.Runtime.CommonObject.FromJSON(System.String)"]
See Also
Reference
CommonObject Class
FromJSON Overload
Rhino.Runtime Namespace