RhinoCommon API
UserInterfaceObjectBase.RegisterForAllDocuments Method
 Make this object visible for all documents. Typically you will only have user interface objects work with single documents. For that case, call doc.ViewUserInterface.Add
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool RegisterForAllDocuments()
Public Function RegisterForAllDocuments As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.UserInterfaceObjectBase.RegisterForAllDocuments"]
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace