RhinoCommon API
Surface.Transpose Method
 Transposes surface parameterization (swap U and V)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Surface Transpose()
Public Function Transpose As Surface
Return Value
Type: Surface
New transposed surface on success, null on failure.
See Also
Reference
Surface Class
Transpose Overload
Rhino.Geometry Namespace