RhinoCommon API
PostEffectData.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffectData.Finalize"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
PostEffectData Class
Rhino.Render.PostEffects Namespace