RhinoCommon API
AnnotationBase.SetRichText Method
 Sets the annotation's text as rich text (RTF), optionally using a specified dimension style for formatting overrides.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetRichText(
	string rtfText,
	DimensionStyle dimstyle
)
Public Sub SetRichText (
	rtfText As String,
	dimstyle As DimensionStyle
)
Parameters
rtfText
Type: System.String
The RTF (Rich Text Format) string to assign to the annotation.
dimstyle
Type: Rhino.DocObjects.DimensionStyle
The dimension style to use for formatting overrides, or null to use the current style.
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace