RhinoCommon API
SubD.Flip Method
 Reverses the orientation of all SubD normals.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public bool Flip()
Public Function Flip As Boolean
Return Value
Type: Boolean
True if successful.
See Also
Reference
SubD Class
Rhino.Geometry Namespace