RhinoCommon API
TextureEvaluator.WriteToFloatArray2 Method
 Fast access to bitmap evaluator - supply size (which you will probably have received from CRhRdkTexture::PixelSize) to see if the data can be extracted direct to a width*height*4 array of unsigned chars.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public virtual StdVectorFloat WriteToFloatArray2(
	int width,
	int height
)
Public Overridable Function WriteToFloatArray2 (
	width As Integer,
	height As Integer
) As StdVectorFloat
Parameters
width
Type: System.Int32
is the point for which to evaluate the texture.
height
Type: System.Int32
duvwdx is a ray differential.
Return Value
Type: StdVectorFloat
A FloatArray full of the float values in RGBA order, or null if the function did not succeed.
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace