RhinoCommon API
RenderPipeline.RenderEnterModalLoop Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.RenderEnterModalLoop"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool RenderEnterModalLoop()
Protected Overridable Function RenderEnterModalLoop As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.RenderEnterModalLoop"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace