RhinoCommon API
ArchivableDictionary.TryGetBytes Method
 Get value as byte[], will only succeed if value was created using Set(string key, byte[] value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public bool TryGetBytes(
	string key,
	out byte[] value
)
Public Function TryGetBytes (
	key As String,
	<OutAttribute> ByRef value As Byte()
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetBytes(System.String,System.Byte[]@)"]
value
Type: System.Byte[]
[Missing <param name="value"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetBytes(System.String,System.Byte[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetBytes(System.String,System.Byte[]@)"]
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace