RhinoCommon API
HostUtils.GetActivePlugInVersionFolders Method (Boolean)
 Recurses through the auto install plug-in folders and returns the directories containing "active" versions of plug-ins.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static IEnumerable<DirectoryInfo> GetActivePlugInVersionFolders(
	bool currentUser
)
Public Shared Function GetActivePlugInVersionFolders (
	currentUser As Boolean
) As IEnumerable(Of DirectoryInfo)
Parameters
currentUser
Type: System.Boolean
Current user (true) or machine (false).
Return Value
Type: IEnumerable<DirectoryInfo>
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.GetActivePlugInVersionFolders(System.Boolean)"]
See Also
Reference
HostUtils Class
GetActivePlugInVersionFolders Overload
Rhino.Runtime Namespace