RhinoCommon API
File3dmObject.Equals Method (Object)
 Verified that two objects refer to the same object in a document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
The other item to test.
Return Value
Type: Boolean
true is the two objects coincide.
See Also
Reference
File3dmObject Class
Equals Overload
Rhino.FileIO Namespace