RhinoCommon API
Brep.CreateFilletSurface Method (BrepFace, Point2d, BrepFace, Point2d, Double, Boolean, Double)
Note: This API is now obsolete.
 Creates a constant-radius round surface between two surfaces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use the CreateFilletSurface that takes settings and returns results")]
public static Brep[] CreateFilletSurface(
	BrepFace face0,
	Point2d uv0,
	BrepFace face1,
	Point2d uv1,
	double radius,
	bool extend,
	double tolerance
)
<ObsoleteAttribute("Use the CreateFilletSurface that takes settings and returns results")>
Public Shared Function CreateFilletSurface (
	face0 As BrepFace,
	uv0 As Point2d,
	face1 As BrepFace,
	uv1 As Point2d,
	radius As Double,
	extend As Boolean,
	tolerance As Double
) As Brep()
Parameters
face0
Type: Rhino.Geometry.BrepFace
First face to fillet from.
uv0
Type: Rhino.Geometry.Point2d
A parameter face0 at the side you want to keep after filleting.
face1
Type: Rhino.Geometry.BrepFace
Second face to fillet from.
uv1
Type: Rhino.Geometry.Point2d
A parameter face1 at the side you want to keep after filleting.
radius
Type: System.Double
The fillet radius.
extend
Type: System.Boolean
If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
tolerance
Type: System.Double
The tolerance. When in doubt, use the document's model absolute tolerance.
Return Value
Type: Brep[]
Array of Breps if successful.
See Also
Reference
Brep Class
CreateFilletSurface Overload
Rhino.Geometry Namespace