RhinoCommon API
ObjectPropertiesPage.InitializeControls Method
Note: This API is now obsolete.
 Called on the active page after the selected objects list has changed to notify the page to initialize its content to reflect the new object list.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("InitializeControls is obsolete, override UpdatePage instead")]
public virtual void InitializeControls(
	RhinoObject rhObj
)
<ObsoleteAttribute("InitializeControls is obsolete, override UpdatePage instead")>
Public Overridable Sub InitializeControls (
	rhObj As RhinoObject
)
Parameters
rhObj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhObj"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.InitializeControls(Rhino.DocObjects.RhinoObject)"]
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace