RhinoCommon API
TextureCache.Contains Method
 Determines whether a texture is registered under the given name.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool Contains(
	string name
)
Public Shared Function Contains (
	name As String
) As Boolean
Parameters
name
Type: System.String
The name to look for.
Return Value
Type: Boolean
true if a texture is registered under this name.
See Also
Reference
TextureCache Class
Rhino.Display Namespace