RhinoCommon API
SimpleArrayPlane.ToArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Plane[] ToArray()
Public Function ToArray As Plane()
Return Value
Type: Plane[]
The managed array.
See Also
Reference
SimpleArrayPlane Class
Rhino.Runtime.InteropWrappers Namespace