RhinoCommon API
Transform.Diagonal Method (Double, Double, Double)
 Constructs a new transformation with diagonal (d0,d1,d2,1.0).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public static Transform Diagonal(
	double d0,
	double d1,
	double d2
)
Public Shared Function Diagonal (
	d0 As Double,
	d1 As Double,
	d2 As Double
) As Transform
Parameters
d0
Type: System.Double
Transform.M00 value.
d1
Type: System.Double
Transform.M11 value.
d2
Type: System.Double
Transform.M22 value.
Return Value
Type: Transform
A transformation with diagonal (d0,d1,d2,1.0).
See Also
Reference
Transform Structure
Diagonal Overload
Rhino.Geometry Namespace