RhinoCommon API
Transform2d.Multiply Operator (Transform2d, Point2d)
 Multiplies a transformation by a point and gets a new point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Point2d operator *(
	Transform2d m,
	Point2d p
)
Public Shared Operator * (
	m As Transform2d,
	p As Point2d
) As Point2d
Parameters
m
Type: Rhino.Geometry.Transform2d
A transformation.
p
Type: Rhino.Geometry.Point2d
A point.
Return Value
Type: Point2d
The transformed point.
Remarks
 Note well: The right hand column is the translation. It has an important effect when transforming a Euclidean point and has no effect when transforming a vector.
See Also
Reference
Transform2d Structure
Multiply Overload
Rhino.Geometry Namespace