RhinoCommon API
FilePlyReadOptions Constructor
Initializes a new instance of the FilePlyReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FilePlyReadOptions()
Public Sub New
See Also
Reference
FilePlyReadOptions Class
Rhino.FileIO Namespace