RhinoCommon API
SubDSurfaceInterpolator.CreateFromSubD Method
 Create an interpolator where all the vertices in the SubD are free vertices in the linear system used for interpolation (i.e. can move as a result of the interpolation, and can receive an interpolation target location).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static SubDSurfaceInterpolator CreateFromSubD(
	SubD subd,
	out uint freeVertexCount
)
Public Shared Function CreateFromSubD (
	subd As SubD,
	<OutAttribute> ByRef freeVertexCount As UInteger
) As SubDSurfaceInterpolator
Parameters
subd
Type: Rhino.Geometry.SubD
The SubD to use for interpolation
freeVertexCount
Type: System.UInt32
The number of free vertices in the system
Return Value
Type: SubDSurfaceInterpolator
A new SubDSurfaceInterpolator
Remarks
 Sets ContextId to the Guid of the Rhino SubD object for subd.
See Also
Reference
SubDSurfaceInterpolator Class
Rhino.Geometry Namespace