RhinoCommon API
Linetype.DuplicateLinetype Method
 Duplicates a linetype, clears the name, id, and locked bits.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Linetype DuplicateLinetype()
Public Function DuplicateLinetype As Linetype
Return Value
Type: Linetype
The duplicated linetype if successful, null otherwise.
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace