RhinoCommon API
ChangeQueue.ApplyClippingPlaneChanges Method
 Override this when you want to handle clippingplane changes
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplyClippingPlaneChanges(
	Guid[] deleted,
	List<ClippingPlane> addedOrModified
)
Protected Overridable Sub ApplyClippingPlaneChanges (
	deleted As Guid(),
	addedOrModified As List(Of ClippingPlane)
)
Parameters
deleted
Type: System.Guid[]
[Missing <param name="deleted"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyClippingPlaneChanges(System.Guid[],System.Collections.Generic.List{Rhino.Render.ChangeQueue.ClippingPlane})"]
addedOrModified
Type: System.Collections.Generic.List<ClippingPlane>
[Missing <param name="addedOrModified"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyClippingPlaneChanges(System.Guid[],System.Collections.Generic.List{Rhino.Render.ChangeQueue.ClippingPlane})"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace