RhinoCommon API
DisplayPipeline.Draw2dText Method (String, Color, Point2d, TextHorizontalAlignment, TextVerticalAlignment, Single, String, Boolean, Boolean, Boolean, Boolean, Boolean)
 Draws 2D text on the viewport.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Draw2dText(
	string text,
	Color color,
	Point2d screenCoordinate,
	TextHorizontalAlignment horizontalAlignment,
	TextVerticalAlignment verticalAlignment,
	float height,
	string fontface,
	bool bold,
	bool italic,
	bool underline,
	bool strikethrough,
	bool applyKerning
)
Public Sub Draw2dText (
	text As String,
	color As Color,
	screenCoordinate As Point2d,
	horizontalAlignment As TextHorizontalAlignment,
	verticalAlignment As TextVerticalAlignment,
	height As Single,
	fontface As String,
	bold As Boolean,
	italic As Boolean,
	underline As Boolean,
	strikethrough As Boolean,
	applyKerning As Boolean
)
Parameters
text
Type: System.String
The string to draw.
color
Type: System.Drawing.Color
Text color.
screenCoordinate
Type: Rhino.Geometry.Point2d
Definition point in screen coordinates (0,0 is top-left corner). The alignment attaches to this point.
horizontalAlignment
Type: Rhino.DocObjects.TextHorizontalAlignment
Where the definition point sits across the text's horizontal advance.
verticalAlignment
Type: Rhino.DocObjects.TextVerticalAlignment
Where the definition point sits down the text's lines. BottomOfTop puts the first line's baseline on the point; Top puts the top of a capital there, which is what the middleJustified=false overloads draw.
height
Type: System.Single
Height in pixels (good default is 12).
fontface
Type: System.String
Font name (good default is "Arial").
bold
Type: System.Boolean
If true, the bold face of the font family is used.
italic
Type: System.Boolean
If true, the italic face of the font family is used.
underline
Type: System.Boolean
If true, the text is underlined.
strikethrough
Type: System.Boolean
If true, the text is struck through.
applyKerning
Type: System.Boolean
If true, the font's kerning pairs are used to space the glyphs.
See Also
Reference
DisplayPipeline Class
Draw2dText Overload
Rhino.Display Namespace