RhinoCommon API
NurbsCurve.Append Method
 Appends a NURBS curve to this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.13
Syntax
public bool Append(
	NurbsCurve nurbsCurve
)
Public Function Append (
	nurbsCurve As NurbsCurve
) As Boolean
Parameters
nurbsCurve
Type: Rhino.Geometry.NurbsCurve
The NURBS curve to append.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurve.Append(Rhino.Geometry.NurbsCurve)"]
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace