RhinoCommon API
NurbsSurface.MakeNonRational Method
 Makes this surface non-rational.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool MakeNonRational()
Public Function MakeNonRational As Boolean
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace