RhinoCommon API
WorksessionFile.ToByteArray Method (Int32)
Writes the worksession as the contents of a .rws file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public byte[] ToByteArray(
	int version
)
Public Function ToByteArray (
	version As Integer
) As Byte()
Parameters
version
Type: System.Int32
4 or 5.
Return Value
Type: Byte[]
The file contents, or null if the worksession could not be written.
See Also
Reference
WorksessionFile Class
ToByteArray Overload
Rhino.FileIO Namespace