RhinoCommon API
ToolbarFile.SaveAs Method
 Saves the toolbar file to a different path.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SaveAs(
	string path
)
Public Function SaveAs (
	path As String
) As Boolean
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.UI.ToolbarFile.SaveAs(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFile.SaveAs(System.String)"]
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace