RhinoCommon API
ChangeQueue.ApplyDynamicObjectTransforms Method
 Handle dynamic object transforms
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplyDynamicObjectTransforms(
	List<DynamicObjectTransform> dynamicObjectTransforms
)
Protected Overridable Sub ApplyDynamicObjectTransforms (
	dynamicObjectTransforms As List(Of DynamicObjectTransform)
)
Parameters
dynamicObjectTransforms
Type: System.Collections.Generic.List<DynamicObjectTransform>
[Missing <param name="dynamicObjectTransforms"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyDynamicObjectTransforms(System.Collections.Generic.List{Rhino.Render.ChangeQueue.DynamicObjectTransform})"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace