RhinoCommon API
RenderContentType.GetAllAvailableTypes Method
 Gets an array of all available render content types registered with Rhino.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RenderContentType[] GetAllAvailableTypes()
Public Shared Function GetAllAvailableTypes As RenderContentType()
Return Value
Type: RenderContentType[]
An array with all types.
See Also
Reference
RenderContentType Class
Rhino.Render Namespace