RhinoCommon API
RenderContentKindList.Count Method
 The number of kinds in the collection
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public int Count()
Public Function Count As Integer
Return Value
Type: Int32
The number of kinds in the collection
See Also
Reference
RenderContentKindList Class
Rhino.Render Namespace