RhinoCommon API
SubD Constructor
 Create a new instance of SubD geometry
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubD()
Public Sub New
See Also
Reference
SubD Class
SubD Overload
Rhino.Geometry Namespace