RhinoCommon API
Brep.GetTangentConnectedComponents Method
 If this Brep has two or more components connected by tangent edges, then duplicates of the connected components are returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public Brep[] GetTangentConnectedComponents(
	double angleTolerance,
	bool includeMeshes
)
Public Function GetTangentConnectedComponents (
	angleTolerance As Double,
	includeMeshes As Boolean
) As Brep()
Parameters
angleTolerance
Type: System.Double
The angle tolerance, in radians, used to determine tangent edges.
includeMeshes
Type: System.Boolean
If true, any cached meshes on this Brep are copied to the returned Breps.
Return Value
Type: Brep[]
An array of tangent edge connected components, or an empty array.
See Also
Reference
Brep Class
Rhino.Geometry Namespace