RhinoCommon API
DisplayModeDescription.ImportFromFile Method (String, Boolean)
 Imports a DisplayModeDescription from a Windows-style .ini file.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.27
Syntax
public static Guid ImportFromFile(
	string filename,
	bool interactive
)
Public Shared Function ImportFromFile (
	filename As String,
	interactive As Boolean
) As Guid
Parameters
filename
Type: System.String
The name of the file to import.
interactive
Type: System.Boolean
True to show user interface messages, false to suppress any user interface messages.
Return Value
Type: Guid
The id of the DisplayModeDescription if successful.
See Also
Reference
DisplayModeDescription Class
ImportFromFile Overload
Rhino.Display Namespace