RhinoCommon API
Skin.OnMainFrameWindowCreated Method
Is called when the main frame window is created.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnMainFrameWindowCreated()
Protected Overridable Sub OnMainFrameWindowCreated
See Also
Reference
Skin Class
Rhino.Runtime Namespace