RhinoCommon API
WorksessionFileModel.Dispose Method
Releases the native model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace