RhinoCommon API
RhinoObject.GetBoundingBox Method
 Called when Rhino wants the bounding box of this object. Viewpoert can be null. This is the default base class version that will go through to the C++ base class if it is called from the custom object
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual BoundingBox GetBoundingBox(
	RhinoViewport viewport
)
Protected Overridable Function GetBoundingBox (
	viewport As RhinoViewport
) As BoundingBox
Parameters
viewport
Type: Rhino.Display.RhinoViewport
For objects like labels or lights, the viewport in which the bounding box should be calculated. Otherwise null.
Return Value
Type: BoundingBox
The bounding box.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace