RhinoCommon API
GetPoint.EnableNoRedrawOnExit Method
 The default functionality of the GetPoint operation is to perform a redraw on exit. Calling this function with true turns off automatic redraw at the end of GetPoint. May be needed in some commands for flicker free feedback. When set to true, the caller is responsible for cleaning up the screen after GetPoint.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void EnableNoRedrawOnExit(
	bool noRedraw
)
Public Sub EnableNoRedrawOnExit (
	noRedraw As Boolean
)
Parameters
noRedraw
Type: System.Boolean
[Missing <param name="noRedraw"/> documentation for "M:Rhino.Input.Custom.GetPoint.EnableNoRedrawOnExit(System.Boolean)"]
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace