RhinoCommon API
RhinoGet.GetPointOnMesh Method (RhinoDoc, Guid, String, Boolean, Point3d)
 Gets a point constrained to an existing mesh in the document.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public static Result GetPointOnMesh(
	RhinoDoc doc,
	Guid meshObjectId,
	string prompt,
	bool acceptNothing,
	out Point3d point
)
Public Shared Function GetPointOnMesh (
	doc As RhinoDoc,
	meshObjectId As Guid,
	prompt As String,
	acceptNothing As Boolean,
	<OutAttribute> ByRef point As Point3d
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
Document containing mesh object.
meshObjectId
Type: System.Guid
An ID of a mesh in the document.
prompt
Type: System.String
Text prompt.
acceptNothing
Type: System.Boolean
true if nothing else should be accepted.
point
Type: Rhino.Geometry.Point3d
A point value will be assigned to this out parameter during this call.
Return Value
Type: Result
A command result based on user choice.
See Also
Reference
RhinoGet Class
GetPointOnMesh Overload
Rhino.Input Namespace