RhinoCommon API
Panels.DockBarIdInUse Method
 For internal use, call this method to see if a dock bar Id is currently being used by any Rhino dock bar. Rhino
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool DockBarIdInUse(
	Guid dockBarId
)
Public Shared Function DockBarIdInUse (
	dockBarId As Guid
) As Boolean
Parameters
dockBarId
Type: System.Guid
[Missing <param name="dockBarId"/> documentation for "M:Rhino.UI.Panels.DockBarIdInUse(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Panels.DockBarIdInUse(System.Guid)"]
See Also
Reference
Panels Class
Rhino.UI Namespace