RhinoCommon API
MeshUnsafeLock.VertexPoint3dArray Method
 Retrieves a pointer to the raw mesh vertex array, which uses coordinates defined with double precision floating point numbers, or throws an exception if none is available.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.20
Syntax
public Point3d* VertexPoint3dArray(
	out int length
)
Visual Basic does not support APIs that consume or return unsafe types.
Parameters
length
Type: System.Int32
The length of the array. This value is returned by reference (out in C#).
Return Value
Type: Point3d*
The beginning of the vertex array. Item 0 is the first vertex, and item length-1 is the last valid one. If no array is available, null is returned.
Exceptions
Exception | Condition
InvalidOperationException | The mesh does not use double precision vertices.
Remarks
When running this method for writing and if the mesh has also a single precision array, the array is synchronized if the pointer to the single precision array was not requested. Otherwise, it is up to the caller to ensure that the mesh vertices are kept synchronized, by setting both arrays to the required values.
See Also
Reference
MeshUnsafeLock Class
Rhino.Geometry Namespace