RhinoCommon API
WorksessionFile Constructor (WorksessionFile)
Creates a copy of another worksession.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFile(
	WorksessionFile other
)
Public Sub New (
	other As WorksessionFile
)
Parameters
other
Type: Rhino.FileIO.WorksessionFile
The worksession to copy.
Exceptions
Exception | Condition
ArgumentNullException | If other is null.
See Also
Reference
WorksessionFile Class
WorksessionFile Overload
Rhino.FileIO Namespace