RhinoCommon API
HostUtils.DescribeGeometry Method
 Returns a description that is similar to the one in the _What command, except for not mentioning units and other attribute data. This description is translated in the current Rhino version.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string DescribeGeometry(
	GeometryBase geometry
)
Public Shared Function DescribeGeometry (
	geometry As GeometryBase
) As String
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
[Missing <param name="geometry"/> documentation for "M:Rhino.Runtime.HostUtils.DescribeGeometry(Rhino.Geometry.GeometryBase)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.DescribeGeometry(Rhino.Geometry.GeometryBase)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace