RhinoCommon API
Brep.CreateFilletSurfaceCurve Method
 Create a fillet (rational arcs or non-rational arc approxiation or chamfered surface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool CreateFilletSurfaceCurve(
	BrepFace face,
	Point2d uv,
	Curve curve,
	double t,
	Brep.FilletSurfaceSettings settings,
	out Brep.FilletSurfaceResults results
)
Public Shared Function CreateFilletSurfaceCurve (
	face As BrepFace,
	uv As Point2d,
	curve As Curve,
	t As Double,
	settings As Brep.FilletSurfaceSettings,
	<OutAttribute> ByRef results As Brep.FilletSurfaceResults
) As Boolean
Parameters
face
Type: Rhino.Geometry.BrepFace
Face to fillet from.
uv
Type: Rhino.Geometry.Point2d
A parameter on the face at the side you want to keep after filleting.
curve
Type: Rhino.Geometry.Curve
Curve to fillet to.
t
Type: System.Double
A parameter on the curve close to the point on the face.
settings
Type: Rhino.Geometry.Brep.FilletSurfaceSettings
The settings to use for filleting
results
Type: Rhino.Geometry.Brep.FilletSurfaceResults
If true is returned, this contains the fillet results.
Return Value
Type: Boolean
true if successful
Exceptions
Exception | Condition
ArgumentNullException
See Also
Reference
Brep Class
Rhino.Geometry Namespace