RhinoCommon API
SubDVertexList.Add Method
 Add a new vertex to the end of the Vertex list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDVertex Add(
	SubDVertexTag tag,
	Point3d vertex
)
Public Function Add (
	tag As SubDVertexTag,
	vertex As Point3d
) As SubDVertex
Parameters
tag
Type: Rhino.Geometry.SubDVertexTag
The type of vertex tag, such as smooth or corner.
vertex
Type: Rhino.Geometry.Point3d
Location of new vertex.
Return Value
Type: SubDVertex
The newly added vertex.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If tag is unset or non-defined.
See Also
Reference
SubDVertexList Class
Rhino.Geometry.Collections Namespace