RhinoCommon API
AnnotationBase.GetDimensionScale Method
 Get view dependent dimension scale
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static double GetDimensionScale(
	RhinoDoc doc,
	DimensionStyle dimstyle,
	RhinoViewport vport
)
Public Shared Function GetDimensionScale (
	doc As RhinoDoc,
	dimstyle As DimensionStyle,
	vport As RhinoViewport
) As Double
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Geometry.AnnotationBase.GetDimensionScale(Rhino.RhinoDoc,Rhino.DocObjects.DimensionStyle,Rhino.Display.RhinoViewport)"]
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.AnnotationBase.GetDimensionScale(Rhino.RhinoDoc,Rhino.DocObjects.DimensionStyle,Rhino.Display.RhinoViewport)"]
vport
Type: Rhino.Display.RhinoViewport
[Missing <param name="vport"/> documentation for "M:Rhino.Geometry.AnnotationBase.GetDimensionScale(Rhino.RhinoDoc,Rhino.DocObjects.DimensionStyle,Rhino.Display.RhinoViewport)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.GetDimensionScale(Rhino.RhinoDoc,Rhino.DocObjects.DimensionStyle,Rhino.Display.RhinoViewport)"]
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace