RhinoCommon API
Panels.ChangePanelIcon Method (Type, String)
 Update the icon used for a panel tab.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void ChangePanelIcon(
	Type panelType,
	string fullPathToResource
)
Public Shared Sub ChangePanelIcon (
	panelType As Type,
	fullPathToResource As String
)
Parameters
panelType
Type: System.Type
[Missing <param name="panelType"/> documentation for "M:Rhino.UI.Panels.ChangePanelIcon(System.Type,System.String)"]
fullPathToResource
Type: System.String
Full path to the new icon resource
See Also
Reference
Panels Class
ChangePanelIcon Overload
Rhino.UI Namespace