RhinoCommon API
ObjectPropertiesPageEventArgs.IncludesObjectsType Method (ObjectType, Boolean)
[Missing <summary> documentation for "M:Rhino.UI.ObjectPropertiesPageEventArgs.IncludesObjectsType(Rhino.DocObjects.ObjectType,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public bool IncludesObjectsType(
	ObjectType objectTypes,
	bool allMustMatch
)
Public Function IncludesObjectsType (
	objectTypes As ObjectType,
	allMustMatch As Boolean
) As Boolean
Parameters
objectTypes
Type: Rhino.DocObjects.ObjectType
[Missing <param name="objectTypes"/> documentation for "M:Rhino.UI.ObjectPropertiesPageEventArgs.IncludesObjectsType(Rhino.DocObjects.ObjectType,System.Boolean)"]
allMustMatch
Type: System.Boolean
 If true then every selected object must match the object type otherwise; only a single object has to be of the specified type
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPageEventArgs.IncludesObjectsType(Rhino.DocObjects.ObjectType,System.Boolean)"]
See Also
Reference
ObjectPropertiesPageEventArgs Class
IncludesObjectsType Overload
Rhino.UI Namespace