RhinoCommon API
ICollapsibleSection2.OnDetachingFromHolder Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ICollapsibleSection2.OnDetachingFromHolder(Rhino.UI.Controls.ICollapsibleSectionHolder2)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
void OnDetachingFromHolder(
	ICollapsibleSectionHolder2 holder
)
Sub OnDetachingFromHolder (
	holder As ICollapsibleSectionHolder2
)
Parameters
holder
Type: Rhino.UI.Controls.ICollapsibleSectionHolder2
[Missing <param name="holder"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSection2.OnDetachingFromHolder(Rhino.UI.Controls.ICollapsibleSectionHolder2)"]
See Also
Reference
ICollapsibleSection2 Interface
Rhino.UI.Controls Namespace