RhinoCommon API
RenderMeshes.Dispose Method
 Dispose this collection
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RenderMeshes Class
Dispose Overload
Rhino.Render.CustomRenderMeshes Namespace