RhinoCommon API
ContentCollectionIterator.First Method
[Missing <summary> documentation for "M:Rhino.Render.ContentCollectionIterator.First"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderContent First()
Public Function First As RenderContent
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.Render.ContentCollectionIterator.First"]
See Also
Reference
ContentCollectionIterator Class
Rhino.Render Namespace