RhinoCommon API
AreaMassProperties.Compute Method (Brep, Boolean, Boolean, Boolean, Boolean, Double, Double)
 Compute the AreaMassProperties for a single Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.10
Syntax
public static AreaMassProperties Compute(
	Brep brep,
	bool area,
	bool firstMoments,
	bool secondMoments,
	bool productMoments,
	double relativeTolerance,
	double absoluteTolerance
)
Public Shared Function Compute (
	brep As Brep,
	area As Boolean,
	firstMoments As Boolean,
	secondMoments As Boolean,
	productMoments As Boolean,
	relativeTolerance As Double,
	absoluteTolerance As Double
) As AreaMassProperties
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to measure.
area
Type: System.Boolean
true to calculate area.
firstMoments
Type: System.Boolean
true to calculate area first moments, area, and area centroid.
secondMoments
Type: System.Boolean
true to calculate area second moments.
productMoments
Type: System.Boolean
true to calculate area product moments.
relativeTolerance
Type: System.Double
The relative tolerance used for the calculation. In overloads of this function where tolerances are not specified, 1.0e-6 is used.
absoluteTolerance
Type: System.Double
The absolute tolerancwe used for the calculation. In overloads of this function where tolerances are not specified, 1.0e-6 is used.
Return Value
Type: AreaMassProperties
The AreaMassProperties for the given Brep or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When brep is null.
See Also
Reference
AreaMassProperties Class
Compute Overload
Rhino.Geometry Namespace