RhinoCommon API
Mesh.CreateBooleanSplit Method (IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result)
 Splits a set of meshes with another set.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Mesh[] CreateBooleanSplit(
	IEnumerable<Mesh> meshesToSplit,
	IEnumerable<Mesh> meshSplitters,
	MeshBooleanOptions options,
	out Result result
)
Public Shared Function CreateBooleanSplit (
	meshesToSplit As IEnumerable(Of Mesh),
	meshSplitters As IEnumerable(Of Mesh),
	options As MeshBooleanOptions,
	<OutAttribute> ByRef result As Result
) As Mesh()
Parameters
meshesToSplit
Type: System.Collections.Generic.IEnumerable<Mesh>
A list, an array, or any enumerable set of meshes to be split. If this is null, null will be returned.
meshSplitters
Type: System.Collections.Generic.IEnumerable<Mesh>
A list, an array, or any enumerable set of meshes that cut. If this is null, null will be returned.
options
Type: Rhino.Geometry.MeshBooleanOptions
The boolean option instance, or null.
result
Type: Rhino.Commands.Result
A value indicating success, or cancel, or failure, or nothing.
Return Value
Type: Mesh[]
A new mesh array, or null on error.
See Also
Reference
Mesh Class
CreateBooleanSplit Overload
Rhino.Geometry Namespace