RhinoCommon API
File3dmObjectTable.AddAngularDimension Method (AngularDimension)
 Adds a angular dimension object to the 3dm file object table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public Guid AddAngularDimension(
	AngularDimension dimension
)
Public Function AddAngularDimension (
	dimension As AngularDimension
) As Guid
Parameters
dimension
Type: Rhino.Geometry.AngularDimension
Dimension object to add.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddAngularDimension Overload
Rhino.FileIO Namespace