RhinoCommon API
SurfaceDirectionIndicators Constructor (BrepFace)
 Construct for a Brep face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SurfaceDirectionIndicators(
	BrepFace face
)
Public Sub New (
	face As BrepFace
)
Parameters
face
Type: Rhino.Geometry.BrepFace
[Missing <param name="face"/> documentation for "M:Rhino.Geometry.SurfaceDirectionIndicators.#ctor(Rhino.Geometry.BrepFace)"]
See Also
Reference
SurfaceDirectionIndicators Class
SurfaceDirectionIndicators Overload
Rhino.Geometry Namespace