RhinoCommon API
EarthAnchorPoint.ModelLocationIsSet Method
 Checks if the model location is set or not.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public bool ModelLocationIsSet()
Public Function ModelLocationIsSet As Boolean
Return Value
Type: Boolean
Boolean value, true if set else false
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace