RhinoCommon API
RhinoViewport.GetViewScale Method
 Get Scale transform applied to the viewport
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double[] GetViewScale()
Public Function GetViewScale As Double()
Return Value
Type: Double[]
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.GetViewScale"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace