RhinoCommon API
ObjectPropertiesPage.RunScript Method (RhinoDoc, RhinoObject[])
Note: This API is now obsolete.
 This method is called when scripting the Rhino Properties command and choosing this page.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("RunScript(RhinoDoc doc, RhinoObject[] objectList) is obsolete, override RunScript(ObjectPropertiesPageEventArgs e) instead")]
public virtual Result RunScript(
	RhinoDoc doc,
	RhinoObject[] objectList
)
<ObsoleteAttribute("RunScript(RhinoDoc doc, RhinoObject[] objectList) is obsolete, override RunScript(ObjectPropertiesPageEventArgs e) instead")>
Public Overridable Function RunScript (
	doc As RhinoDoc,
	objectList As RhinoObject()
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
Active RhinoDoc
objectList
Type: Rhino.DocObjects.RhinoObject[]
 List of objects selected by the Properties command.
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPage.RunScript(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject[])"]
See Also
Reference
ObjectPropertiesPage Class
RunScript Overload
Rhino.UI Namespace