RhinoCommon API
TextFields.BlockInsertionCoordinate Method
 Returns the insertion coordinate of a block instance. If the field is being evaluated from text inside a block instance, the immediate parent block instance is used.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static string BlockInsertionCoordinate(
	string blockId,
	string axis
)
Public Shared Function BlockInsertionCoordinate (
	blockId As String,
	axis As String
) As String
Parameters
blockId
Type: System.String
[Missing <param name="blockId"/> documentation for "M:Rhino.Runtime.TextFields.BlockInsertionCoordinate(System.String,System.String)"]
axis
Type: System.String
[Missing <param name="axis"/> documentation for "M:Rhino.Runtime.TextFields.BlockInsertionCoordinate(System.String,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.BlockInsertionCoordinate(System.String,System.String)"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace