RhinoCommon API
RenderMaterial.GetTextureOnFromUsage Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.GetTextureOnFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GetTextureOnFromUsage(
	RenderMaterial.StandardChildSlots slot
)
Public Function GetTextureOnFromUsage (
	slot As RenderMaterial.StandardChildSlots
) As Boolean
Parameters
slot
Type: Rhino.Render.RenderMaterial.StandardChildSlots
[Missing <param name="slot"/> documentation for "M:Rhino.Render.RenderMaterial.GetTextureOnFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.GetTextureOnFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace