RhinoCommon API
File3dmLayerTable.AddLayer Method (String, Color, Guid)
 Add a new layer to the model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.30
Syntax
public int AddLayer(
	string name,
	Color color,
	Guid parentId
)
Public Function AddLayer (
	name As String,
	color As Color,
	parentId As Guid
) As Integer
Parameters
name
Type: System.String
Layer name.
color
Type: System.Drawing.Color
Layer color.
parentId
Type: System.Guid
The id of the parent layer, can be Guid.Empty.
Return Value
Type: Int32
 The layer's index (>=0) is returned. Otherwise, RhinoMath.UnsetIntIndex is returned.
See Also
Reference
File3dmLayerTable Class
AddLayer Overload
Rhino.FileIO Namespace