RhinoCommon API
ControlPoint.Equals Method (ControlPoint)
 Determines if two points exactly match.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Equals(
	ControlPoint other
)
Public Function Equals (
	other As ControlPoint
) As Boolean
Parameters
other
Type: Rhino.Geometry.ControlPoint
The other point.
Return Value
Type: Boolean
True if the other control point exactly matches this one.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ControlPoint Structure
Equals Overload
Rhino.Geometry Namespace