RhinoCommon API
RenderWindow.SetRGBAChannelColors Method (Rectangle, Color4f[])
 Call this method to open the RenderWindow.StandardChannels.RGBA channel and set a block of color values
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetRGBAChannelColors(
	Rectangle rectangle,
	Color4f[] colors
)
Public Sub SetRGBAChannelColors (
	rectangle As Rectangle,
	colors As Color4f()
)
Parameters
rectangle
Type: System.Drawing.Rectangle
 rectangle.X is the horizontal pixel position of the left edge. No validation is done on this value. The caller is responsible for ensuring that it is within the frame buffer. rectangle.Y is the vertical pixel position of the top edge. No validation is done on this value. The caller is responsible for ensuring that it is within the frame buffer. rectangle.Width is the width of the rectangle in pixels. No validation is done on this value. rectangle.Height is the height of the rectangle in pixels. No validation is done on this value.
colors
Type: Rhino.Display.Color4f[]
Array of Color4f values used to set the RenderWindow.StandardChannels.RGBA
See Also
Reference
RenderWindow Class
SetRGBAChannelColors Overload
Rhino.Render Namespace