RhinoCommon API
Mesh.ShrinkWrap Method (PointCloud, ShrinkWrapParameters)
 Creates a unified ShrinkWrap mesh from a point cloud returns null on error or failure
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Mesh ShrinkWrap(
	PointCloud pointCloud,
	ShrinkWrapParameters parameters
)
Public Shared Function ShrinkWrap (
	pointCloud As PointCloud,
	parameters As ShrinkWrapParameters
) As Mesh
Parameters
pointCloud
Type: Rhino.Geometry.PointCloud
[Missing <param name="pointCloud"/> documentation for "M:Rhino.Geometry.Mesh.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters)"]
parameters
Type: Rhino.Geometry.ShrinkWrapParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.Mesh.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters)"]
See Also
Reference
Mesh Class
ShrinkWrap Overload
Rhino.Geometry Namespace