RhinoCommon API
CustomPointObject Constructor
Initializes a new instance of the CustomPointObject class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CustomPointObject()
Protected Sub New
See Also
Reference
CustomPointObject Class
CustomPointObject Overload
Rhino.DocObjects.Custom Namespace