RhinoCommon API
Sphere Constructor (Plane, Double)
 Initializes a new sphere given the plane of the equator circle and radius.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Sphere(
	Plane equatorialPlane,
	double radius
)
Public Sub New (
	equatorialPlane As Plane,
	radius As Double
)
Parameters
equatorialPlane
Type: Rhino.Geometry.Plane
A plane that will be intersecting the sphere at the same distance from both poles (parameterization singularities).
radius
Type: System.Double
A radius value.
See Also
Reference
Sphere Structure
Sphere Overload
Rhino.Geometry Namespace