RhinoCommon API
RhinoApp.LoginToCloudZoo Method
 Logs in to the cloud zoo.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool LoginToCloudZoo()
Public Shared Function LoginToCloudZoo As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoApp.LoginToCloudZoo"]
See Also
Reference
RhinoApp Class
Rhino Namespace