RhinoCommon API
SubDDisplayParameters Constructor
 Initializes a new instance with default values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public SubDDisplayParameters()
Public Sub New
See Also
Reference
SubDDisplayParameters Class
SubDDisplayParameters Overload
Rhino.Geometry Namespace