RhinoCommon API
RenderMaterial.ImportMaterialAndAssignToLayers Method
Imports a material file (.RMTL) and assigns the imported material to one or more layers.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool ImportMaterialAndAssignToLayers(
	RhinoDoc doc,
	string file,
	IEnumerable<int> layer_indices
)
Public Shared Function ImportMaterialAndAssignToLayers (
	doc As RhinoDoc,
	file As String,
	layer_indices As IEnumerable(Of Integer)
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
The document to attach the imported material to and which also contains the layers.
file
Type: System.String
The full path to the RMTL file to be imported.
layer_indices
Type: System.Collections.Generic.IEnumerable<Int32>
An array of indices of the layers to assign the material to.
Return Value
Type: Boolean
True if successful, else false.
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace