RhinoCommon API
SimpleArrayUint Constructor
 Initializes a new SimpleArrayInt class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public SimpleArrayUint()
Public Sub New
See Also
Reference
SimpleArrayUint Class
SimpleArrayUint Overload
Rhino.Runtime.InteropWrappers Namespace