RhinoCommon API
Mesh.CreateBooleanDifference Method (IEnumerable<Mesh>, IEnumerable<Mesh>)
 Computes the solid difference of two sets of Meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Mesh[] CreateBooleanDifference(
	IEnumerable<Mesh> firstSet,
	IEnumerable<Mesh> secondSet
)
Public Shared Function CreateBooleanDifference (
	firstSet As IEnumerable(Of Mesh),
	secondSet As IEnumerable(Of Mesh)
) As Mesh()
Parameters
firstSet
Type: System.Collections.Generic.IEnumerable<Mesh>
First set of Meshes (the set to subtract from).
secondSet
Type: System.Collections.Generic.IEnumerable<Mesh>
Second set of Meshes (the set to subtract).
Return Value
Type: Mesh[]
An array of Mesh results or null on failure.
See Also
Reference
Mesh Class
CreateBooleanDifference Overload
Rhino.Geometry Namespace