RhinoCommon API
RdkEdit Constructor
Initializes a new instance of the RdkEdit class
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public RdkEdit(
	IntPtr pRdkEdit
)
Public Sub New (
	pRdkEdit As IntPtr
)
Parameters
pRdkEdit
Type: System.IntPtr
[Missing <param name="pRdkEdit"/> documentation for "M:Rhino.Render.DataSources.RdkEdit.#ctor(System.IntPtr)"]
See Also
Reference
RdkEdit Class
Rhino.Render.DataSources Namespace