RhinoCommon API
AnnotationBase.GetPlainTextWithRunMap Method
 Return plain text string for this annotation with field expressions unevaluated.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string GetPlainTextWithRunMap(
	ref int[] map
)
Public Function GetPlainTextWithRunMap (
	ByRef map As Integer()
) As String
Parameters
map
Type: System.Int32[]
an array of int values in groups of 3: run index, character start position, and length.
Return Value
Type: String
A plain text string.
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace