RhinoCommon API
SimpleArrayClippingPlaneObjectPointer.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SimpleArrayClippingPlaneObjectPointer Class
Dispose Overload
Rhino.Runtime.InteropWrappers Namespace