RhinoCommon API
FileGltf Constructor
Initializes a new instance of the FileGltf class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileGltf()
Public Sub New
See Also
Reference
FileGltf Class
Rhino.FileIO Namespace