RhinoCommon API
EmapAnalysisSettings.SetFileNames Method
 Set available list of emap filenames
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void SetFileNames(
	IEnumerable<string> filenames
)
Public Shared Sub SetFileNames (
	filenames As IEnumerable(Of String)
)
Parameters
filenames
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="filenames"/> documentation for "M:Rhino.ApplicationSettings.EmapAnalysisSettings.SetFileNames(System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
EmapAnalysisSettings Class
Rhino.ApplicationSettings Namespace