RhinoCommon API
LightManagerSupport.ModifyLight Method
 Modify properties of the light
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract void ModifyLight(
	RhinoDoc doc,
	Light light
)
Public MustOverride Sub ModifyLight (
	doc As RhinoDoc,
	light As Light
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.LightManagerSupport.ModifyLight(Rhino.RhinoDoc,Rhino.Geometry.Light)"]
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.LightManagerSupport.ModifyLight(Rhino.RhinoDoc,Rhino.Geometry.Light)"]
Return Value
Type:
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace