RhinoCommon API
Surface.IsIsoparametric Method (Curve, Interval)
 Determines if a 2D curve is isoparametric in the parameter space of this surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IsoStatus IsIsoparametric(
	Curve curve,
	Interval curveDomain
)
Public Function IsIsoparametric (
	curve As Curve,
	curveDomain As Interval
) As IsoStatus
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to test.
curveDomain
Type: Rhino.Geometry.Interval
Sub domain of the curve.
Return Value
Type: IsoStatus
IsoStatus flag describing the iso-parametric relationship between the surface and the curve.
See Also
Reference
Surface Class
IsIsoparametric Overload
Rhino.Geometry Namespace