RhinoCommon API
BezierCurve.MakeRational Method
Make bezier rational
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool MakeRational()
Public Function MakeRational As Boolean
Return Value
Type: Boolean
true if successful
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace