RhinoCommon API
ChooseOneObjectSettings.UpdateFromState Method
 Sets all settings to a particular defined joined state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void UpdateFromState(
	ChooseOneObjectSettingsState state
)
Public Shared Sub UpdateFromState (
	state As ChooseOneObjectSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.ChooseOneObjectSettingsState
The particular state.
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace