RhinoCommon API
GetSphere.Get Method
 Prompt for the getting of a sphere.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Result Get(
	out Sphere sphere
)
Public Function Get (
	<OutAttribute> ByRef sphere As Sphere
) As Result
Parameters
sphere
Type: Rhino.Geometry.Sphere
The sphere geometry defined by the user.
Return Value
Type: Result
The result of the getting operation.
See Also
Reference
GetSphere Class
Rhino.Input.Custom Namespace