RhinoCommon API
Linetype.Default Method
 Set linetype to default settings.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Default()
Public Sub Default
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace