RhinoCommon API
FileGltfWriteOptions Constructor
Initializes a new instance of the FileGltfWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileGltfWriteOptions()
Public Sub New
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace