RhinoCommon API
Dialogs.ShowPrintWidths Method (String, String)
 Shows the print widths dialogs
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static double ShowPrintWidths(
	string title,
	string message
)
Public Shared Function ShowPrintWidths (
	title As String,
	message As String
) As Double
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.Dialogs.ShowPrintWidths(System.String,System.String)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.Dialogs.ShowPrintWidths(System.String,System.String)"]
Return Value
Type: Double
The selected print width
See Also
Reference
Dialogs Class
ShowPrintWidths Overload
Rhino.UI Namespace