RhinoCommon API
RealtimeDisplayMode.GetRenderSize Method
 Get the current render resolution for the running render session.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract void GetRenderSize(
	out int width,
	out int height
)
Public MustOverride Sub GetRenderSize (
	<OutAttribute> ByRef width As Integer,
	<OutAttribute> ByRef height As Integer
)
Parameters
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetRenderSize(System.Int32@,System.Int32@)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetRenderSize(System.Int32@,System.Int32@)"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace