RhinoCommon API
IRhinoUiDialogService.ShowNumberBox Method
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool ShowNumberBox(
	string title,
	string message,
	ref double number,
	double minimum,
	double maximum
)
Function ShowNumberBox (
	title As String,
	message As String,
	ByRef number As Double,
	minimum As Double,
	maximum As Double
) As Boolean
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)"]
number
Type: System.Double
[Missing <param name="number"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)"]
minimum
Type: System.Double
[Missing <param name="minimum"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)"]
maximum
Type: System.Double
[Missing <param name="maximum"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)"]
See Also
Reference
IRhinoUiDialogService Interface
Rhino.UI Namespace