RhinoCommon API
Mesh.Smooth Method (Double, Int32, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths a mesh by averaging the positions of mesh vertices in a specified region.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Smooth(
	double smoothFactor,
	int numSteps,
	bool bXSmooth,
	bool bYSmooth,
	bool bZSmooth,
	bool bFixBoundaries,
	SmoothingCoordinateSystem coordinateSystem,
	Plane plane
)
Public Function Smooth (
	smoothFactor As Double,
	numSteps As Integer,
	bXSmooth As Boolean,
	bYSmooth As Boolean,
	bZSmooth As Boolean,
	bFixBoundaries As Boolean,
	coordinateSystem As SmoothingCoordinateSystem,
	plane As Plane
) As Boolean
Parameters
smoothFactor
Type: System.Double
The smoothing factor, which controls how much vertices move towards the average of the neighboring vertices.
numSteps
Type: System.Int32
The number of smoothing iterations.
bXSmooth
Type: System.Boolean
When true vertices move in X axis direction.
bYSmooth
Type: System.Boolean
When true vertices move in Y axis direction.
bZSmooth
Type: System.Boolean
When true vertices move in Z axis direction.
bFixBoundaries
Type: System.Boolean
When true vertices along naked edges will not be modified.
coordinateSystem
Type: Rhino.Geometry.SmoothingCoordinateSystem
The coordinates to determine the direction of the smoothing.
plane
Type: Rhino.Geometry.Plane
If SmoothingCoordinateSystem.CPlane specified, then the construction plane.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
Mesh Class
Smooth Overload
Rhino.Geometry Namespace