RhinoCommon API
Mesh.CopyFrom Method
 Copies mesh values into this mesh from another mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void CopyFrom(
	Mesh other
)
Public Sub CopyFrom (
	other As Mesh
)
Parameters
other
Type: Rhino.Geometry.Mesh
The other mesh to copy from.
Exceptions
Exception | Condition
ArgumentNullException | If other is null.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace