RhinoCommon API
PageViewGroupTable.GetSorted Method
 Gets an array of page view group indices that are sorted by the values of SortIndex.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int[] GetSorted()
Public Function GetSorted As Integer()
Return Value
Type: Int32[]
An array of page view indices.
See Also
Reference
PageViewGroupTable Class
Rhino.DocObjects.Tables Namespace