RhinoCommon API
IEpsilonFComparable<T>.EpsilonEquals Method
[Missing <summary> documentation for "M:Rhino.IEpsilonFComparable`1.EpsilonEquals(`0,System.Single)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool EpsilonEquals(
	T other,
	float epsilon
)
Function EpsilonEquals (
	other As T,
	epsilon As Single
) As Boolean
Parameters
other
Type: T
[Missing <param name="other"/> documentation for "M:Rhino.IEpsilonFComparable`1.EpsilonEquals(`0,System.Single)"]
epsilon
Type: System.Single
[Missing <param name="epsilon"/> documentation for "M:Rhino.IEpsilonFComparable`1.EpsilonEquals(`0,System.Single)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.IEpsilonFComparable`1.EpsilonEquals(`0,System.Single)"]
See Also
Reference
IEpsilonFComparable<T> Interface
Rhino Namespace