RhinoCommon API
RenderMaterial.SimulateMaterial Method (Material, RenderTexture.TextureGeneration)
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public virtual void SimulateMaterial(
	ref Material simulation,
	RenderTexture.TextureGeneration tg
)
Public Overridable Sub SimulateMaterial (
	ByRef simulation As Material,
	tg As RenderTexture.TextureGeneration
)
Parameters
simulation
Type: Rhino.DocObjects.Material
Set the properties of the input basic material to provide the simulation for this material.
tg
Type: Rhino.Render.RenderTexture.TextureGeneration
See RenderTexture.TextureGeneration.
See Also
Reference
RenderMaterial Class
SimulateMaterial Overload
Rhino.Render Namespace