RhinoCommon API
PersistentSettings.GetStringList Method (String, String[])
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetStringList(System.String,System.String[])"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string[] GetStringList(
	string key,
	string[] defaultValue
)
Public Function GetStringList (
	key As String,
	defaultValue As String()
) As String()
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetStringList(System.String,System.String[])"]
defaultValue
Type: System.String[]
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetStringList(System.String,System.String[])"]
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetStringList(System.String,System.String[])"]
See Also
Reference
PersistentSettings Class
GetStringList Overload
Rhino Namespace