RhinoCommon API
RhinoDoc.SetModelUrl Method
 Sets the link address, or URL, for the model.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetModelUrl(
	string url,
	string urlDescription
)
Public Sub SetModelUrl (
	url As String,
	urlDescription As String
)
Parameters
url
Type: System.String
The URL.
urlDescription
Type: System.String
The URL description.
See Also
Reference
RhinoDoc Class
Rhino Namespace