RhinoCommon API
PersistentSettings.GetInteger Method (String, Int32, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int GetInteger(
	string key,
	int defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetInteger (
	key As String,
	defaultValue As Integer,
	legacyKeyList As IEnumerable(Of String)
) As Integer
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.Int32
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetInteger Overload
Rhino Namespace