RhinoCommon API
DisplayPipeline.DrawPointCloud Method (PointCloud, Single, Color)
 Draws a point cloud.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawPointCloud(
	PointCloud cloud,
	float size,
	Color color
)
Public Sub DrawPointCloud (
	cloud As PointCloud,
	size As Single,
	color As Color
)
Parameters
cloud
Type: Rhino.Geometry.PointCloud
Point cloud to draw.
size
Type: System.Single
Size of points.
color
Type: System.Drawing.Color
Color of points in the cloud, if the cloud has a color array this setting is ignored.
See Also
Reference
DisplayPipeline Class
DrawPointCloud Overload
Rhino.Display Namespace