RhinoCommon API
ContentFactories Constructor
Initializes a new instance of the ContentFactories class
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public ContentFactories(
	IntPtr pRdkContentFactories
)
Public Sub New (
	pRdkContentFactories As IntPtr
)
Parameters
pRdkContentFactories
Type: System.IntPtr
[Missing <param name="pRdkContentFactories"/> documentation for "M:Rhino.Render.DataSources.ContentFactories.#ctor(System.IntPtr)"]
See Also
Reference
ContentFactories Class
Rhino.Render.DataSources Namespace