RhinoCommon API
ViewCaptureSettings.SetModelScaleToFit Method
 Scales the model to fit.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.21
Syntax
public void SetModelScaleToFit(
	bool promptOnChange
)
Public Sub SetModelScaleToFit (
	promptOnChange As Boolean
)
Parameters
promptOnChange
Type: System.Boolean
Prompt the user if the model scale will change.
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace