RhinoCommon API
SubDComponentParameter.ToString Method
Returns the fully qualified type name of this instance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The fully qualified type name.
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace