RhinoCommon API
ChangeQueue.ApplyGroundPlaneChanges Method
 Override this when you want to handle groundplane changes
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplyGroundPlaneChanges(
	GroundPlane gp
)
Protected Overridable Sub ApplyGroundPlaneChanges (
	gp As GroundPlane
)
Parameters
gp
Type: Rhino.Render.ChangeQueue.GroundPlane
[Missing <param name="gp"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyGroundPlaneChanges(Rhino.Render.ChangeQueue.GroundPlane)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace