RhinoCommon API
RenderWindow.RegisterPostEffectExecutionControl Method
 Register an instance of PostEffectExecutionControl.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void RegisterPostEffectExecutionControl(
	PostEffectExecutionControl ec
)
Public Sub RegisterPostEffectExecutionControl (
	ec As PostEffectExecutionControl
)
Parameters
ec
Type: Rhino.Render.PostEffects.PostEffectExecutionControl
[Missing <param name="ec"/> documentation for "M:Rhino.Render.RenderWindow.RegisterPostEffectExecutionControl(Rhino.Render.PostEffects.PostEffectExecutionControl)"]
See Also
Reference
RenderWindow Class
Rhino.Render Namespace