RhinoCommon API
ObjectTable.DeleteGrip Method (ObjRef)
 Deletes a grip object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public bool DeleteGrip(
	ObjRef gripRef
)
Public Function DeleteGrip (
	gripRef As ObjRef
) As Boolean
Parameters
gripRef
Type: Rhino.DocObjects.ObjRef
A reference to the grip object to delete.
Return Value
Type: Boolean
True on success.
See Also
Reference
ObjectTable Class
DeleteGrip Overload
Rhino.DocObjects.Tables Namespace