RhinoCommon API
StringHolder Constructor
 Constructor
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public StringHolder()
Public Sub New
See Also
Reference
StringHolder Class
Rhino.Runtime.InteropWrappers Namespace