RhinoCommon API
Notification.ShowModal Method
 Tells Rhino to display the notification modally.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void ShowModal()
Public Sub ShowModal
Remarks
The notification will only be displayed if/once the instance is added to the NotificationCenter. Rhino keeps a queue of notifications that need to be shown modally, so calling this method does not mean that this particular notification will be immediately displayed.
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace