RhinoCommon API
Mesh.WithDisplacement Method
 Constructs new mesh from the current one, with displacement applied to it.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Mesh WithDisplacement(
	MeshDisplacementInfo displacement
)
Public Function WithDisplacement (
	displacement As MeshDisplacementInfo
) As Mesh
Parameters
displacement
Type: Rhino.Geometry.MeshDisplacementInfo
Information on mesh displacement.
Return Value
Type: Mesh
A new mesh with shutlining.
Exceptions
Exception | Condition
ArgumentNullException | If displacer is null.
InvalidOperationException | If displacement failed because of an error. The exception message specifies the error.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace