RhinoCommon API
LicenseUtils.GetOneLicenseStatus Method
 Returns the current status of a license for UI purposes.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.5
Syntax
public static LicenseStatus GetOneLicenseStatus(
	Guid productid
)
Public Shared Function GetOneLicenseStatus (
	productid As Guid
) As LicenseStatus
Parameters
productid
Type: System.Guid
[Missing <param name="productid"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetOneLicenseStatus(System.Guid)"]
Return Value
Type: LicenseStatus
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.GetOneLicenseStatus(System.Guid)"]
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace