RhinoCommon API
Brep.CreateFromJoinedEdges Method
 Joins two naked edges, or edges that are coincident or close together, from two Breps.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep CreateFromJoinedEdges(
	Brep brep0,
	int edgeIndex0,
	Brep brep1,
	int edgeIndex1,
	double joinTolerance
)
Public Shared Function CreateFromJoinedEdges (
	brep0 As Brep,
	edgeIndex0 As Integer,
	brep1 As Brep,
	edgeIndex1 As Integer,
	joinTolerance As Double
) As Brep
Parameters
brep0
Type: Rhino.Geometry.Brep
The first Brep.
edgeIndex0
Type: System.Int32
The edge index on the first Brep.
brep1
Type: Rhino.Geometry.Brep
The second Brep.
edgeIndex1
Type: System.Int32
The edge index on the second Brep.
joinTolerance
Type: System.Double
The join tolerance.
Return Value
Type: Brep
The resulting Brep if successful, null on failure.
See Also
Reference
Brep Class
Rhino.Geometry Namespace