RhinoCommon API
NurbsCurve.CreateFromFitPoints Method (IEnumerable<Point3d>, Double, Boolean)
 Fits a NURBS curve to a dense, ordered set of points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static NurbsCurve CreateFromFitPoints(
	IEnumerable<Point3d> points,
	double tolerance,
	bool periodic
)
Public Shared Function CreateFromFitPoints (
	points As IEnumerable(Of Point3d),
	tolerance As Double,
	periodic As Boolean
) As NurbsCurve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
An enumeration of 3D points.
tolerance
Type: System.Double
The fitting tolerance. When in doubt, use the document's model absolute tolerance.
periodic
Type: System.Boolean
Set true to create a periodic curve.
Return Value
Type: NurbsCurve
A NURBS curve if successful, or null on failure.
See Also
Reference
NurbsCurve Class
CreateFromFitPoints Overload
Rhino.Geometry Namespace