RhinoCommon API
FileX3dvWriteOptions Constructor
Initializes a new instance of the FileX3dvWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileX3dvWriteOptions()
Public Sub New
See Also
Reference
FileX3dvWriteOptions Class
Rhino.FileIO Namespace