RhinoCommon API
GeometryBase.GeometryReferenceEquals Method
 Determines if two objects are respectively shallow copies, new managed instantiations of the same geometry, or similar internal references to the exact same geometry, both in managed and in unmanaged code.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.2
Syntax
public static bool GeometryReferenceEquals(
	GeometryBase one,
	GeometryBase other
)
Public Shared Function GeometryReferenceEquals (
	one As GeometryBase,
	other As GeometryBase
) As Boolean
Parameters
one
Type: Rhino.Geometry.GeometryBase
The first object
other
Type: Rhino.Geometry.GeometryBase
The other object
Return Value
Type: Boolean
True if indeed the objects are really the same. False otherwise.
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace