RhinoCommon API
Skin.ShowChooseTemplate Method
 Called when the host requests the Skin's "choose template" UI (e.g. from the File > New Using Template menu item). Default implementation is empty.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
protected virtual void ShowChooseTemplate()
Protected Overridable Sub ShowChooseTemplate
See Also
Reference
Skin Class
Rhino.Runtime Namespace