RhinoCommon API
ViewTable.GetViewList Method
 Gets an array of all the views.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RhinoView[] GetViewList(
	ViewTypeFilter filter
)
Public Function GetViewList (
	filter As ViewTypeFilter
) As RhinoView()
Parameters
filter
Type: Rhino.Display.ViewTypeFilter
View types to include
Return Value
Type: RhinoView[]
An array of Rhino views. This array can be empty, but not null.
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace