RhinoCommon API
SimpleArrayPoint3d.Add Method
 Adds a point to the list
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Add(
	Point3d pt
)
Public Sub Add (
	pt As Point3d
)
Parameters
pt
Type: Rhino.Geometry.Point3d
[Missing <param name="pt"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.Add(Rhino.Geometry.Point3d)"]
See Also
Reference
SimpleArrayPoint3d Class
Rhino.Runtime.InteropWrappers Namespace