RhinoCommon API
SimpleArrayGeometryPointer Constructor
 Initializes a new SimpleArrayGeometryPointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SimpleArrayGeometryPointer()
Public Sub New
See Also
Reference
SimpleArrayGeometryPointer Class
SimpleArrayGeometryPointer Overload
Rhino.Runtime.InteropWrappers Namespace