RhinoCommon API
CurvatureGraphSettings.UpdateFromState Method
 Sets all settings to a particular defined joined state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void UpdateFromState(
	CurvatureGraphSettingsState state
)
Public Shared Sub UpdateFromState (
	state As CurvatureGraphSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.CurvatureGraphSettingsState
The particular state.
See Also
Reference
CurvatureGraphSettings Class
Rhino.ApplicationSettings Namespace