RhinoCommon API
FileTxt.Write Method
Write a Txt file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	FileTxtWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As FileTxtWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileTxtWriteOptions
options used for generating the Txt file
Return Value
Type: Boolean
true on success
See Also
Reference
FileTxt Class
Rhino.FileIO Namespace