RhinoCommon API
UserInterfaceGrid.AddChild Method
 Append a control to the next cell.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void AddChild(
	UserInterfaceControl child
)
Public Sub AddChild (
	child As UserInterfaceControl
)
Parameters
child
Type: Rhino.UI.UserInterfaceControl
[Missing <param name="child"/> documentation for "M:Rhino.UI.UserInterfaceGrid.AddChild(Rhino.UI.UserInterfaceControl)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace