RhinoCommon API
Mesh.ShrinkWrap Method (IEnumerable<Mesh>, ShrinkWrapParameters, CancellationToken)
 Creates a unified ShrinkWrap mesh from a collection of input meshes. Returns null on error or failure. Supports cancellation during volumetric calculations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public static Mesh ShrinkWrap(
	IEnumerable<Mesh> meshes,
	ShrinkWrapParameters parameters,
	CancellationToken token
)
Public Shared Function ShrinkWrap (
	meshes As IEnumerable(Of Mesh),
	parameters As ShrinkWrapParameters,
	token As CancellationToken
) As Mesh
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
[Missing <param name="meshes"/> documentation for "M:Rhino.Geometry.Mesh.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
parameters
Type: Rhino.Geometry.ShrinkWrapParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.Mesh.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
token
Type: System.Threading.CancellationToken
Supports cancellation during volumetric calculations.
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
See Also
Reference
Mesh Class
ShrinkWrap Overload
Rhino.Geometry Namespace