RhinoCommon API
FileCsvDocument.TryGetBool Method (String, Int32, Boolean)
 Retrieves the value of a cell as a boolean, addressing the column by header name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetBool(
	string column,
	int row,
	out bool value
)
Public Function TryGetBool (
	column As String,
	row As Integer,
	<OutAttribute> ByRef value As Boolean
) As Boolean
Parameters
column
Type: System.String
The header name of the column.
row
Type: System.Int32
The zero-based data-row index (y).
value
Type: System.Boolean
The parsed value, or false if the column or cell does not exist or cannot be parsed.
Return Value
Type: Boolean
true if the column and cell exist and were parsed; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetBool Overload
Rhino.FileIO Namespace