RhinoCommon API
GetCancel.WaitAll<TResult> Method (IEnumerable<Task<TResult>>, RhinoDoc)
 Awaits some tasks to finish.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Result WaitAll<TResult>(
	IEnumerable<Task<TResult>> tasks,
	RhinoDoc doc
)
Public Function WaitAll(Of TResult) (
	tasks As IEnumerable(Of Task(Of TResult)),
	doc As RhinoDoc
) As Result
Parameters
tasks
Type: System.Collections.Generic.IEnumerable<Task<TResult>>
The tasks.
doc
Type: Rhino.RhinoDoc
A document to set progress reporting.
Type Parameters
TResult
[Missing <typeparam name="TResult"/> documentation for "M:Rhino.Input.Custom.GetCancel.WaitAll``1(System.Collections.Generic.IEnumerable{System.Threading.Tasks.Task{``0}},Rhino.RhinoDoc)"]
Return Value
Type: Result
A result enumeration.
See Also
Reference
GetCancel Class
WaitAll Overload
Rhino.Input.Custom Namespace