RhinoCommon API
GripUserInterfaceObject.Constrain Method (Curve)
[Missing <summary> documentation for "M:Rhino.UI.GripUserInterfaceObject.Constrain(Rhino.Geometry.Curve)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Constrain(
	Curve curve
)
Public Sub Constrain (
	curve As Curve
)
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.UI.GripUserInterfaceObject.Constrain(Rhino.Geometry.Curve)"]
See Also
Reference
GripUserInterfaceObject Class
Constrain Overload
Rhino.UI Namespace