RhinoCommon API
IPanelsService.DestroyNativeWindow Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.DestroyNativeWindow(System.Object,System.Object,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
void DestroyNativeWindow(
	Object host,
	Object nativeObject,
	bool disposeOfNativeObject
)
Sub DestroyNativeWindow (
	host As Object,
	nativeObject As Object,
	disposeOfNativeObject As Boolean
)
Parameters
host
Type: System.Object
[Missing <param name="host"/> documentation for "M:Rhino.UI.IPanelsService.DestroyNativeWindow(System.Object,System.Object,System.Boolean)"]
nativeObject
Type: System.Object
[Missing <param name="nativeObject"/> documentation for "M:Rhino.UI.IPanelsService.DestroyNativeWindow(System.Object,System.Object,System.Boolean)"]
disposeOfNativeObject
Type: System.Boolean
[Missing <param name="disposeOfNativeObject"/> documentation for "M:Rhino.UI.IPanelsService.DestroyNativeWindow(System.Object,System.Object,System.Boolean)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace