RhinoCommon API
SubD.ClearEvaluationCache Method
 Clear all cached evaluation information (meshes, surface points, bounding boxes, ...) that depends on edge tags, vertex tags, and the location of vertex control points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void ClearEvaluationCache()
Public Sub ClearEvaluationCache
See Also
Reference
SubD Class
Rhino.Geometry Namespace
SubD.CopyEvaluationCache(SubD)
SubD.UpdateSurfaceMeshCache(Boolean)