RhinoCommon API
PersistentSettings.AddChild Method
 Call this method to add a new child key, if the key is exists then the existing key is returned otherwise a new empty PersistentSettings child key is added and the new settings are returned.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PersistentSettings AddChild(
	string key
)
Public Function AddChild (
	key As String
) As PersistentSettings
Parameters
key
Type: System.String
Key to add to the child dictionary.
Return Value
Type: PersistentSettings
 If the key is exists then the existing key is returned otherwise a new empty PersistentSettings child key is added and the new settings are returned.
See Also
Reference
PersistentSettings Class
Rhino Namespace