RhinoCommon API
TextureMapping.CreateCustomMeshMapping Method
 Create custom mesh mapping
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public static TextureMapping CreateCustomMeshMapping(
	Mesh mesh
)
Public Shared Function CreateCustomMeshMapping (
	mesh As Mesh
) As TextureMapping
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh with texture coordinates
Return Value
Type: TextureMapping
TextureMapping instance
See Also
Reference
TextureMapping Class
Rhino.Render Namespace