RhinoCommon API
GetBaseClass.AcceptUndo Method
 If you want to allow the user to have an 'undo' option in GetPoint.Get(), GetObject.GetObjects(), etc., then call AcceptUndo(true) beforehand.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void AcceptUndo(
	bool enable
)
Public Sub AcceptUndo (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true if user is able to choose the 'Undo' option.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace