RhinoCommon API
CollapsibleSectionImpl.Factory Constructor
Initializes a new instance of the CollapsibleSectionImpl.Factory class
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Factory()
Public Sub New
See Also
Reference
CollapsibleSectionImpl.Factory Class
Rhino.UI.Controls Namespace