RhinoCommon API
HatchLine.AppendDash Method
 Add a dash to the pattern.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void AppendDash(
	double dash
)
Public Sub AppendDash (
	dash As Double
)
Parameters
dash
Type: System.Double
Length to append, < 0 for a gap.
See Also
Reference
HatchLine Class
Rhino.DocObjects Namespace