RhinoCommon API
RenderContent.FromId Method
 Search for a content object based on its Id
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public static RenderContent FromId(
	RhinoDoc document,
	Guid id
)
Public Shared Function FromId (
	document As RhinoDoc,
	id As Guid
) As RenderContent
Parameters
document
Type: Rhino.RhinoDoc
 The Rhino document containing the content.
id
Type: System.Guid
 Id of the content instance to search for.
Return Value
Type: RenderContent
 Returns the content object with the specified Id if it is found otherwise it returns null.
See Also
Reference
RenderContent Class
Rhino.Render Namespace