RhinoCommon API
SupportOptions.SetLibrariesInitialLocation Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetLibrariesInitialLocation(Rhino.Render.SupportOptions.RdkInitialLocation)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_SetInitialLocation' instead")]
public static void SetLibrariesInitialLocation(
	SupportOptions.RdkInitialLocation l
)
<ObsoleteAttribute("Use 'Libraries_SetInitialLocation' instead")>
Public Shared Sub SetLibrariesInitialLocation (
	l As SupportOptions.RdkInitialLocation
)
Parameters
l
Type: Rhino.Render.SupportOptions.RdkInitialLocation
[Missing <param name="l"/> documentation for "M:Rhino.Render.SupportOptions.SetLibrariesInitialLocation(Rhino.Render.SupportOptions.RdkInitialLocation)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace