RhinoCommon API
SurfaceDirectionIndicators.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SurfaceDirectionIndicators Class
Dispose Overload
Rhino.Geometry Namespace