RhinoCommon API
CurveBooleanRegions.RegionCurves Method
 Returns the boundary curves in a curve region. A curve region is a collection of curves that bound a single connected region of the plane. Note, the first curve is always the outer boundary.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Curve[] RegionCurves(
	int regionIndex
)
Public Function RegionCurves (
	regionIndex As Integer
) As Curve()
Parameters
regionIndex
Type: System.Int32
The curve region index.
Return Value
Type: Curve[]
An array of boundary curves if successful, an empty array if not successful.
See Also
Reference
CurveBooleanRegions Class
Rhino.Geometry Namespace