RhinoCommon API
PythonScript.RuntimeAssemblies Method
 Get list of assemblies used by python for library browser and inclusion into the runtime
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Assembly[] RuntimeAssemblies()
Public Shared Function RuntimeAssemblies As Assembly()
Return Value
Type: Assembly[]
[Missing <returns> documentation for "M:Rhino.Runtime.PythonScript.RuntimeAssemblies"]
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace