RhinoCommon API
TextFields.ObjectPageName Method
 Returns the layout page name the object resides on
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string ObjectPageName(
	string id
)
Public Shared Function ObjectPageName (
	id As String
) As String
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.ObjectPageName(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.ObjectPageName(System.String)"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace