RhinoCommon API
UserInterfaceCheckBox Constructor
Initializes a new instance of the UserInterfaceCheckBox class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceCheckBox()
Public Sub New
See Also
Reference
UserInterfaceCheckBox Class
UserInterfaceCheckBox Overload
Rhino.UI Namespace