RhinoCommon API
PostEffectData.DataCRC Method
 Get a CRC representing the state of the entire post effect.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public uint DataCRC(
	uint current_remainder
)
Public Function DataCRC (
	current_remainder As UInteger
) As UInteger
Parameters
current_remainder
Type: System.UInt32
[Missing <param name="current_remainder"/> documentation for "M:Rhino.Render.PostEffects.PostEffectData.DataCRC(System.UInt32)"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectData.DataCRC(System.UInt32)"]
See Also
Reference
PostEffectData Class
Rhino.Render.PostEffects Namespace