RhinoCommon API
RealtimeDisplayMode.GetRealtimeViewport Method (IntPtr, Boolean)
Retrieve RealtimeDisplayMode instance. If create is set to true then a new instance is created if not found, null is returned for false.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RealtimeDisplayMode GetRealtimeViewport(
	IntPtr realtimeViewport,
	bool create
)
Public Shared Function GetRealtimeViewport (
	realtimeViewport As IntPtr,
	create As Boolean
) As RealtimeDisplayMode
Parameters
realtimeViewport
Type: System.IntPtr
IntPtr
create
Type: System.Boolean
true to create if not found, false to return null if not found.
Return Value
Type: RealtimeDisplayMode
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetRealtimeViewport(System.IntPtr,System.Boolean)"]
See Also
Reference
RealtimeDisplayMode Class
GetRealtimeViewport Overload
Rhino.Render Namespace