RhinoCommon API
Localization.LocalizeString Method (String, Int32, Int32)
Note: This API is now obsolete.
 DO NOT use this function, it is a trap to determine where context IDs have been copied from other, already extracted, strings.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[ObsoleteAttribute("Don't copy and paste context IDs", true)]
public static string LocalizeString(
	string english,
	int wrongcontextId,
	int contextId
)
<ObsoleteAttribute("Don't copy and paste context IDs", true)>
Public Shared Function LocalizeString (
	english As String,
	wrongcontextId As Integer,
	contextId As Integer
) As String
Parameters
english
Type: System.String
The text in English.
wrongcontextId
Type: System.Int32
The copied ID.
contextId
Type: System.Int32
The context ID.
Return Value
Type: String
The english string.
See Also
Reference
Localization Class
LocalizeString Overload
Rhino.UI Namespace