RhinoCommon API
TextFields.Area Method (String, String)
 Returns the area value for a selected object id in a specified unit system
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static double Area(
	string id,
	string unitSystem
)
Public Shared Function Area (
	id As String,
	unitSystem As String
) As Double
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.Area(System.String,System.String)"]
unitSystem
Type: System.String
[Missing <param name="unitSystem"/> documentation for "M:Rhino.Runtime.TextFields.Area(System.String,System.String)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.Area(System.String,System.String)"]
See Also
Reference
TextFields Class
Area Overload
Rhino.Runtime Namespace