RhinoCommon API
MeshingParameters.CopyFrom Method
 Call this method to copy MeshingParameters from another instance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void CopyFrom(
	MeshingParameters source
)
Public Sub CopyFrom (
	source As MeshingParameters
)
Parameters
source
Type: Rhino.Geometry.MeshingParameters
[Missing <param name="source"/> documentation for "M:Rhino.Geometry.MeshingParameters.CopyFrom(Rhino.Geometry.MeshingParameters)"]
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace