RhinoCommon API
NurbsCurve.CreateParabolaFromPoints Method
 Creates a parabola from three points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static NurbsCurve CreateParabolaFromPoints(
	Point3d startPoint,
	Point3d innerPoint,
	Point3d endPoint
)
Public Shared Function CreateParabolaFromPoints (
	startPoint As Point3d,
	innerPoint As Point3d,
	endPoint As Point3d
) As NurbsCurve
Parameters
startPoint
Type: Rhino.Geometry.Point3d
The start point.
innerPoint
Type: Rhino.Geometry.Point3d
A point on the curve.
endPoint
Type: Rhino.Geometry.Point3d
The end point
Return Value
Type: NurbsCurve
A 2 degree NURBS curve if successful, false otherwise.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace