RhinoCommon API
RhinoDoc.GetRedoRecords Method
 Gets this document's redo history, ordered from the action that the next call to Redo() repeats to the oldest action that can be redone.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UndoRecordEntry[] GetRedoRecords()
Public Function GetRedoRecords As UndoRecordEntry()
Return Value
Type: UndoRecordEntry[]
 The redo records. The list is empty when there is nothing to redo.
See Also
Reference
RhinoDoc Class
Rhino Namespace