RhinoCommon API
LayerTable.Undelete Method
 Undeletes a layer that has been deleted by DeleteLayer().
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Undelete(
	int layerIndex
)
Public Function Undelete (
	layerIndex As Integer
) As Boolean
Parameters
layerIndex
Type: System.Int32
 zero based index of layer to undelete. This must be in the range 0 <= layerIndex < LayerTable.Count.
Return Value
Type: Boolean
true if successful.
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace