RhinoCommon API
ObjectTable.Replace Method (ObjRef, GeometryBase, Boolean)
 Replaces the geometry in one object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public bool Replace(
	ObjRef objref,
	GeometryBase geometry,
	bool ignoreModes
)
Public Function Replace (
	objref As ObjRef,
	geometry As GeometryBase,
	ignoreModes As Boolean
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
reference to old object to be replaced. The objref.Object() will be deleted.
geometry
Type: Rhino.Geometry.GeometryBase
[Missing <param name="geometry"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.GeometryBase,System.Boolean)"]
ignoreModes
Type: System.Boolean
[Missing <param name="ignoreModes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.GeometryBase,System.Boolean)"]
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace