RhinoCommon API
WorksessionFile.Write Method (String, Int32)
Writes a worksession file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Write(
	string path,
	int version
)
Public Function Write (
	path As String,
	version As Integer
) As Boolean
Parameters
path
Type: System.String
The file to write.
version
Type: System.Int32
 4 or 5. Version 4 needs exactly one active model and saves only the model file paths.
Return Value
Type: Boolean
 True if the file was written. If false is returned, an existing file is left as it was.
Exceptions
Exception | Condition
ArgumentNullException | If path is null.
See Also
Reference
WorksessionFile Class
Write Overload
Rhino.FileIO Namespace