RhinoCommon API
IRhinoUiDialogService.ShowPrintWidths Method (String, String, Double)
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPrintWidths(System.String,System.String,System.Double)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
double ShowPrintWidths(
	string title,
	string message,
	double selectedWidth
)
Function ShowPrintWidths (
	title As String,
	message As String,
	selectedWidth As Double
) As Double
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPrintWidths(System.String,System.String,System.Double)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPrintWidths(System.String,System.String,System.Double)"]
selectedWidth
Type: System.Double
[Missing <param name="selectedWidth"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPrintWidths(System.String,System.String,System.Double)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPrintWidths(System.String,System.String,System.Double)"]
See Also
Reference
IRhinoUiDialogService Interface
ShowPrintWidths Overload
Rhino.UI Namespace