RhinoCommon API
Curve.Smooth Method (Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem)
 Smooths a curve by averaging the positions of control points in a specified region.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Curve Smooth(
	double smoothFactor,
	bool bXSmooth,
	bool bYSmooth,
	bool bZSmooth,
	bool bFixBoundaries,
	SmoothingCoordinateSystem coordinateSystem
)
Public Function Smooth (
	smoothFactor As Double,
	bXSmooth As Boolean,
	bYSmooth As Boolean,
	bZSmooth As Boolean,
	bFixBoundaries As Boolean,
	coordinateSystem As SmoothingCoordinateSystem
) As Curve
Parameters
smoothFactor
Type: System.Double
 The smoothing factor, which controls how much control points move towards the average of the neighboring control points. Note that this smoothFactor is equivalent to twice the smooth factor used in the Smooth command: on a polyline, Rhino _Smooth with a factor of 0.2 is the same as Smooth(Double) with a factor of 0.4.
bXSmooth
Type: System.Boolean
When true control points move in X axis direction.
bYSmooth
Type: System.Boolean
When true control points move in Y axis direction.
bZSmooth
Type: System.Boolean
When true control points move in Z axis direction.
bFixBoundaries
Type: System.Boolean
When true the curve ends don't move.
coordinateSystem
Type: Rhino.Geometry.SmoothingCoordinateSystem
The coordinates to determine the direction of the smoothing.
Return Value
Type: Curve
The smoothed curve if successful, null otherwise.
See Also
Reference
Curve Class
Smooth Overload
Rhino.Geometry Namespace