RhinoCommon API
PlugIn.PathFromId Method
 Gets the path to an installed plug-in given the id of that plug-in
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public static string PathFromId(
	Guid pluginId
)
Public Shared Function PathFromId (
	pluginId As Guid
) As String
Parameters
pluginId
Type: System.Guid
[Missing <param name="pluginId"/> documentation for "M:Rhino.PlugIns.PlugIn.PathFromId(System.Guid)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.PathFromId(System.Guid)"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace