RhinoCommon API
FilePdf.DrawLine Method
 Draw a line
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public void DrawLine(
	int pageNumber,
	PointF from,
	PointF to,
	Color strokeColor,
	float strokeWidth
)
Public Sub DrawLine (
	pageNumber As Integer,
	from As PointF,
	to As PointF,
	strokeColor As Color,
	strokeWidth As Single
)
Parameters
pageNumber
Type: System.Int32
[Missing <param name="pageNumber"/> documentation for "M:Rhino.FileIO.FilePdf.DrawLine(System.Int32,System.Drawing.PointF,System.Drawing.PointF,System.Drawing.Color,System.Single)"]
from
Type: System.Drawing.PointF
[Missing <param name="from"/> documentation for "M:Rhino.FileIO.FilePdf.DrawLine(System.Int32,System.Drawing.PointF,System.Drawing.PointF,System.Drawing.Color,System.Single)"]
to
Type: System.Drawing.PointF
[Missing <param name="to"/> documentation for "M:Rhino.FileIO.FilePdf.DrawLine(System.Int32,System.Drawing.PointF,System.Drawing.PointF,System.Drawing.Color,System.Single)"]
strokeColor
Type: System.Drawing.Color
[Missing <param name="strokeColor"/> documentation for "M:Rhino.FileIO.FilePdf.DrawLine(System.Int32,System.Drawing.PointF,System.Drawing.PointF,System.Drawing.Color,System.Single)"]
strokeWidth
Type: System.Single
[Missing <param name="strokeWidth"/> documentation for "M:Rhino.FileIO.FilePdf.DrawLine(System.Int32,System.Drawing.PointF,System.Drawing.PointF,System.Drawing.Color,System.Single)"]
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace