RhinoCommon API
SubD.InterpolateSurfacePoints Method (UInt32[], Point3d[])
 Modifies the SubD so that the SubD vertex limit surface points of the listed vertices are equal to surface_points[].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool InterpolateSurfacePoints(
	uint[] vertexIndices,
	Point3d[] surfacePoints
)
Public Function InterpolateSurfacePoints (
	vertexIndices As UInteger(),
	surfacePoints As Point3d()
) As Boolean
Parameters
vertexIndices
Type: System.UInt32[]
 Ids of the vertices to interpolate. Other vertices remain fixed.
surfacePoints
Type: Rhino.Geometry.Point3d[]
 Points for limit surface to interpolate. surface_points[i] is the location for the vertex returned by this.Vertices.Find(vertexIndices[i]).
Return Value
Type: Boolean
True on success
See Also
Reference
SubD Class
InterpolateSurfacePoints Overload
Rhino.Geometry Namespace
SubD.SetVertexSurfacePoint(UInt32, Point3d)
SubDVertex.SurfacePoint()
Rhino.Geometry.SubDSurfaceInterpolator