RhinoCommon API
ContentUndoHelper Constructor (RhinoDoc, String)
Note: This API is now obsolete.
 DEPRECATED: Constructs a ContentUndoHelper object inside a using block to handle undo when modifying a RenderContent or - alternatively - create the ContentUndoHelper and explicitly call Dispose when you are done.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Prefer the one without the description.")]
public ContentUndoHelper(
	RhinoDoc doc,
	string description
)
<ObsoleteAttribute("Prefer the one without the description.")>
Public Sub New (
	doc As RhinoDoc,
	description As String
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.ContentUndoHelper.#ctor(Rhino.RhinoDoc,System.String)"]
description
Type: System.String
Unused: Undo description (which appears in the UI when undo is run)
See Also
Reference
ContentUndoHelper Class
ContentUndoHelper Overload
Rhino.Render Namespace