RhinoCommon API
SurfaceCurvature.CreateFromSubD Method (SubD, SubDComponentParameter, SubD.ExtraordinaryVertexCurvature)
 Create a SurfaceCurvature by evaluating a SubD's surface (its limit surface) at a surface parameter, choosing what to report exactly on an extraordinary vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static SurfaceCurvature CreateFromSubD(
	SubD subd,
	SubDComponentParameter parameter,
	SubD.ExtraordinaryVertexCurvature extraordinaryVertexCurvature
)
Public Shared Function CreateFromSubD (
	subd As SubD,
	parameter As SubDComponentParameter,
	extraordinaryVertexCurvature As SubD.ExtraordinaryVertexCurvature
) As SurfaceCurvature
Parameters
subd
Type: Rhino.Geometry.SubD
The SubD to evaluate.
parameter
Type: Rhino.Geometry.SubDComponentParameter
The surface parameter to evaluate.
extraordinaryVertexCurvature
Type: Rhino.Geometry.SubD.ExtraordinaryVertexCurvature
 What to report when the parameter is exactly on an extraordinary vertex, where the limit surface has no curvature of its own. This changes nothing anywhere else, including inside such a vertex's corner quad.
Return Value
Type: SurfaceCurvature
A SurfaceCurvature if successful, null otherwise.
Remarks
 With SectorAverage the result at an extraordinary vertex is an average of the curvature around it, so Direction(Int32) is unset: an average has no single principal direction. Point and Normal are the vertex's own and are exact.
See Also
Reference
SurfaceCurvature Class
CreateFromSubD Overload
Rhino.Geometry Namespace