RhinoCommon API
RenderPrimitiveList.Dispose Method
Releases all resources used by the RenderPrimitiveList
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace