RhinoCommon API
BezierSurface.MakeRational Method
Make bezier rational
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool MakeRational()
Public Function MakeRational As Boolean
Return Value
Type: Boolean
true if successful
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace