RhinoCommon API
SubDSurfaceInterpolator.Solve Method
 Solve the interpolation system, given target interpolation locations for the free vertices in the system. Updates the subd referenced by this system so the corresponding surface points are at the locations given by surfacePoints.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Solve(
	Point3d[] surfacePoints
)
Public Function Solve (
	surfacePoints As Point3d()
) As Boolean
Parameters
surfacePoints
Type: Rhino.Geometry.Point3d[]
 The limit surface locations for the interpolated vertices. The number of desired locations needs to match the InterpolatedVertexCount().
Return Value
Type: Boolean
True if a solution was found.
See Also
Reference
SubDSurfaceInterpolator Class
Rhino.Geometry Namespace