RhinoCommon API
RenderWindow.SetRGBAChannelColors Method (Size, Color4f[])
 Call this method to open the RenderWindow.StandardChannels.RGBA channel and set a block of color values
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetRGBAChannelColors(
	Size size,
	Color4f[] colors
)
Public Sub SetRGBAChannelColors (
	size As Size,
	colors As Color4f()
)
Parameters
size
Type: System.Drawing.Size
Size of the area to set. No validation is done on this value
colors
Type: Rhino.Display.Color4f[]
Array of Color4f values used to set the RenderWindow.StandardChannels.RGBA
See Also
Reference
RenderWindow Class
SetRGBAChannelColors Overload
Rhino.Render Namespace