RhinoCommon API
NurbsSurface.CreateCurveOnSurfacePoints Method
 Computes a discrete spline curve on the surface. In other words, computes a sequence of points on the surface, each with a corresponding parameter value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static Point2d[] CreateCurveOnSurfacePoints(
	Surface surface,
	IEnumerable<Point2d> fixedPoints,
	double tolerance,
	bool periodic,
	int initCount,
	int levels
)
Public Shared Function CreateCurveOnSurfacePoints (
	surface As Surface,
	fixedPoints As IEnumerable(Of Point2d),
	tolerance As Double,
	periodic As Boolean,
	initCount As Integer,
	levels As Integer
) As Point2d()
Parameters
surface
Type: Rhino.Geometry.Surface
 The surface on which the curve is constructed. The surface should be G1 continuous. If the surface is closed in the u or v direction and is G1 at the seam, the function will construct point sequences that cross over the seam.
fixedPoints
Type: System.Collections.Generic.IEnumerable<Point2d>
Surface points to interpolate given by parameters. These must be distinct.
tolerance
Type: System.Double
Relative tolerance used by the solver. When in doubt, use a tolerance of 0.0.
periodic
Type: System.Boolean
When true constructs a smoothly closed curve.
initCount
Type: System.Int32
Maximum number of points to insert between fixed points on the first level.
levels
Type: System.Int32
The number of levels (between 1 and 3) to be used in multi-level solver. Use 1 for single level solve.
Return Value
Type: Point2d[]
 A sequence of surface points, given by surface parameters, if successful. The number of output points is approximately: 2 ^ (level-1) * initCount * fixedPoints.Count.
Remarks
 To create a curve from the output points, use Surface.CreateCurveOnSurface.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace