RhinoCommon API
GetEllipse.Get Method
 Prompt for the getting of an ellipse.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Result Get(
	out NurbsCurve ellipse
)
Public Function Get (
	<OutAttribute> ByRef ellipse As NurbsCurve
) As Result
Parameters
ellipse
Type: Rhino.Geometry.NurbsCurve
The ellipse in NURB form.
Return Value
Type: Result
The result of the get operation.
See Also
Reference
GetEllipse Class
Rhino.Input.Custom Namespace