RhinoCommon API
NurbsCurvePointList.SetPoint Method (Int32, Point3d, Double)
 Sets a world 3-D, or Euclidean, control point and weight at a given index. The 4-D representation is (x*w, y*w, z*w, w).
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SetPoint(
	int index,
	Point3d point,
	double weight
)
Public Function SetPoint (
	index As Integer,
	point As Point3d,
	weight As Double
) As Boolean
Parameters
index
Type: System.Int32
Index of control point to set.
point
Type: Rhino.Geometry.Point3d
Coordinates of the control point.
weight
Type: System.Double
Weight of control point.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsCurvePointList Class
SetPoint Overload
Rhino.Geometry.Collections Namespace