RhinoCommon API
RealtimeDisplayMode.StartRenderer Method
 Override to start your render engine. Note that before using the RenderWindow you *must* call SetSize to properly initialize the underlying DIB.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool StartRenderer(
	int w,
	int h,
	RhinoDoc doc,
	ViewInfo view,
	ViewportInfo viewportInfo,
	bool forCapture,
	RenderWindow renderWindow
)
Public MustOverride Function StartRenderer (
	w As Integer,
	h As Integer,
	doc As RhinoDoc,
	view As ViewInfo,
	viewportInfo As ViewportInfo,
	forCapture As Boolean,
	renderWindow As RenderWindow
) As Boolean
Parameters
w
Type: System.Int32
Width of resolution
h
Type: System.Int32
Height of resolution
doc
Type: Rhino.RhinoDoc
Rhino document
view
Type: Rhino.DocObjects.ViewInfo
active view
viewportInfo
Type: Rhino.DocObjects.ViewportInfo
active viewport info
forCapture
Type: System.Boolean
true if renderer is started for capture purposes (ViewCaptureTo*), false for regular interactive rendering
renderWindow
Type: Rhino.Render.RenderWindow
RenderWindow to hold render results in.
Return Value
Type: Boolean
Return true when your render engine started correctly, false when that failed
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace