RhinoCommon API
Mesh.QuadRemeshBrepAsync Method (Brep, QuadRemeshParameters, IEnumerable<Curve>, IProgress<Int32>, CancellationToken)
 Quad remesh this Brep asynchronously.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Task<Mesh> QuadRemeshBrepAsync(
	Brep brep,
	QuadRemeshParameters parameters,
	IEnumerable<Curve> guideCurves,
	IProgress<int> progress,
	CancellationToken cancelToken
)
Public Shared Function QuadRemeshBrepAsync (
	brep As Brep,
	parameters As QuadRemeshParameters,
	guideCurves As IEnumerable(Of Curve),
	progress As IProgress(Of Integer),
	cancelToken As CancellationToken
) As Task(Of Mesh)
Parameters
brep
Type: Rhino.Geometry.Brep
 Set Brep Face Mode by setting QuadRemeshParameters.PreserveMeshArrayEdgesMode
parameters
Type: Rhino.Geometry.QuadRemeshParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshBrepAsync(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)"]
guideCurves
Type: System.Collections.Generic.IEnumerable<Curve>
 A curve array used to influence mesh face layout The curves should touch the input mesh Set Guide Curve Influence by using QuadRemeshParameters.GuideCurveInfluence
progress
Type: System.IProgress<Int32>
[Missing <param name="progress"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshBrepAsync(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)"]
cancelToken
Type: System.Threading.CancellationToken
[Missing <param name="cancelToken"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshBrepAsync(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)"]
Return Value
Type: Task<Mesh>
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshBrepAsync(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)"]
See Also
Reference
Mesh Class
QuadRemeshBrepAsync Overload
Rhino.Geometry Namespace