RhinoCommon API
CustomRenderMeshProvider2.BuildCustomMeshes Method (ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, DisplayPipelineAttributes)
[Missing <summary> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.RhinoDoc,Rhino.Render.RenderPrimitiveList,System.Guid,Rhino.Display.DisplayPipelineAttributes)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool BuildCustomMeshes(
	ViewportInfo vp,
	RhinoDoc doc,
	RenderPrimitiveList objMeshes,
	Guid requestingPlugIn,
	DisplayPipelineAttributes attrs
)
Public MustOverride Function BuildCustomMeshes (
	vp As ViewportInfo,
	doc As RhinoDoc,
	objMeshes As RenderPrimitiveList,
	requestingPlugIn As Guid,
	attrs As DisplayPipelineAttributes
) As Boolean
Parameters
vp
Type: Rhino.DocObjects.ViewportInfo
[Missing <param name="vp"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.RhinoDoc,Rhino.Render.RenderPrimitiveList,System.Guid,Rhino.Display.DisplayPipelineAttributes)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.RhinoDoc,Rhino.Render.RenderPrimitiveList,System.Guid,Rhino.Display.DisplayPipelineAttributes)"]
objMeshes
Type: Rhino.Render.RenderPrimitiveList
[Missing <param name="objMeshes"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.RhinoDoc,Rhino.Render.RenderPrimitiveList,System.Guid,Rhino.Display.DisplayPipelineAttributes)"]
requestingPlugIn
Type: System.Guid
[Missing <param name="requestingPlugIn"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.RhinoDoc,Rhino.Render.RenderPrimitiveList,System.Guid,Rhino.Display.DisplayPipelineAttributes)"]
attrs
Type: Rhino.Display.DisplayPipelineAttributes
[Missing <param name="attrs"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.RhinoDoc,Rhino.Render.RenderPrimitiveList,System.Guid,Rhino.Display.DisplayPipelineAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.RhinoDoc,Rhino.Render.RenderPrimitiveList,System.Guid,Rhino.Display.DisplayPipelineAttributes)"]
See Also
Reference
CustomRenderMeshProvider2 Class
BuildCustomMeshes Overload
Rhino.Render Namespace