RhinoCommon API
DimStyleTable.Modify Method (DimensionStyle, AnnotationBase)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Modify(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.AnnotationBase)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ModifyType Modify(
	DimensionStyle dimstyle,
	AnnotationBase annotation
)
Public Function Modify (
	dimstyle As DimensionStyle,
	annotation As AnnotationBase
) As ModifyType
Parameters
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Modify(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.AnnotationBase)"]
annotation
Type: Rhino.Geometry.AnnotationBase
[Missing <param name="annotation"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Modify(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.AnnotationBase)"]
Return Value
Type: ModifyType
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Modify(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.AnnotationBase)"]
See Also
Reference
DimStyleTable Class
Modify Overload
Rhino.DocObjects.Tables Namespace