RhinoCommon API
HostUtils.GetPlatformService<T> Method
For internal use only. Loads an assembly for dependency injection via IPlatformServiceLocator.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static T GetPlatformService<T>(
	string assemblyPath = null,
	string typeFullName = null
)
where T : class
Public Shared Function GetPlatformService(Of T As Class) (
	Optional assemblyPath As String = Nothing,
	Optional typeFullName As String = Nothing
) As T
Parameters
assemblyPath (Optional)
Type: System.String
The relative path of the assembly, relative to the position of RhinoCommon.dll
typeFullName (Optional)
Type: System.String
The full name of the type that is IPlatformServiceLocator. This is optional.
Type Parameters
T
The type of the service to be instantiated.
Return Value
Type: T
An instance, or null.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace