RhinoCommon API
ModelComponent.LockName Method
 Locks the component Name property.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void LockName()
Public Sub LockName
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace