RhinoCommon API
Mesh.CreateBooleanIntersection Method (IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result, Int32[][])
 Computes the solid intersection of two sets of meshes and reports which inputs contributed to each output.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Mesh[] CreateBooleanIntersection(
	IEnumerable<Mesh> firstSet,
	IEnumerable<Mesh> secondSet,
	MeshBooleanOptions options,
	out Result result,
	out int[][] inputMap
)
Public Shared Function CreateBooleanIntersection (
	firstSet As IEnumerable(Of Mesh),
	secondSet As IEnumerable(Of Mesh),
	options As MeshBooleanOptions,
	<OutAttribute> ByRef result As Result,
	<OutAttribute> ByRef inputMap As Integer()()
) As Mesh()
Parameters
firstSet
Type: System.Collections.Generic.IEnumerable<Mesh>
First set of Meshes.
secondSet
Type: System.Collections.Generic.IEnumerable<Mesh>
Second set of Meshes.
options
Type: Rhino.Geometry.MeshBooleanOptions
The boolean option instance, or null.
result
Type: Rhino.Commands.Result
A value indicating success, or cancel, or failure, or nothing.
inputMap
Type: System.Int32[][]
 On success, one array per output mesh (parallel to the returned array), listing the indices of the input meshes that contributed faces to that output. The index space is flat-concatenated: firstSet occupies 0..n0-1 and secondSet occupies n0..n0+n1-1, in enumeration order; null inputs are skipped and not assigned an index. Null when the function fails.
Return Value
Type: Mesh[]
An array of Mesh results or null on failure.
See Also
Reference
Mesh Class
CreateBooleanIntersection Overload
Rhino.Geometry Namespace