RhinoCommon API
DevelopableSrf.RulingMinTwist Method (NurbsCurve, Double, NurbsCurve, Double, Interval, Double, Double)
 Find a ruling from rail0(t0) to rail1(t1_out) that has the least twist across the ruling with t1_out in domain1. max_cos_twist is cos(twist) for the returned ruling
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool RulingMinTwist(
	NurbsCurve rail0,
	double t0,
	NurbsCurve rail1,
	double t1,
	Interval dom1,
	ref double t1_out,
	ref double cos_twist_out
)
Public Shared Function RulingMinTwist (
	rail0 As NurbsCurve,
	t0 As Double,
	rail1 As NurbsCurve,
	t1 As Double,
	dom1 As Interval,
	ByRef t1_out As Double,
	ByRef cos_twist_out As Double
) As Boolean
Parameters
rail0
Type: Rhino.Geometry.NurbsCurve
[Missing <param name="rail0"/> documentation for "M:Rhino.Geometry.DevelopableSrf.RulingMinTwist(Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.Interval,System.Double@,System.Double@)"]
t0
Type: System.Double
[Missing <param name="t0"/> documentation for "M:Rhino.Geometry.DevelopableSrf.RulingMinTwist(Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.Interval,System.Double@,System.Double@)"]
rail1
Type: Rhino.Geometry.NurbsCurve
[Missing <param name="rail1"/> documentation for "M:Rhino.Geometry.DevelopableSrf.RulingMinTwist(Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.Interval,System.Double@,System.Double@)"]
t1
Type: System.Double
[Missing <param name="t1"/> documentation for "M:Rhino.Geometry.DevelopableSrf.RulingMinTwist(Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.Interval,System.Double@,System.Double@)"]
dom1
Type: Rhino.Geometry.Interval
[Missing <param name="dom1"/> documentation for "M:Rhino.Geometry.DevelopableSrf.RulingMinTwist(Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.Interval,System.Double@,System.Double@)"]
t1_out
Type: System.Double
[Missing <param name="t1_out"/> documentation for "M:Rhino.Geometry.DevelopableSrf.RulingMinTwist(Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.Interval,System.Double@,System.Double@)"]
cos_twist_out
Type: System.Double
[Missing <param name="cos_twist_out"/> documentation for "M:Rhino.Geometry.DevelopableSrf.RulingMinTwist(Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.Interval,System.Double@,System.Double@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.DevelopableSrf.RulingMinTwist(Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.Interval,System.Double@,System.Double@)"]
See Also
Reference
DevelopableSrf Class
RulingMinTwist Overload
Rhino.Geometry Namespace