RhinoCommon API
CustomRenderMeshProvider2.BuildCustomMeshes Method (ViewportInfo, RenderPrimitiveList, Guid, Boolean)
[Missing <summary> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.Render.RenderPrimitiveList,System.Guid,System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public override bool BuildCustomMeshes(
	ViewportInfo vp,
	RenderPrimitiveList objMeshes,
	Guid requestingPlugIn,
	bool preview
)
Public Overrides Function BuildCustomMeshes (
	vp As ViewportInfo,
	objMeshes As RenderPrimitiveList,
	requestingPlugIn As Guid,
	preview As Boolean
) As Boolean
Parameters
vp
Type: Rhino.DocObjects.ViewportInfo
[Missing <param name="vp"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.Render.RenderPrimitiveList,System.Guid,System.Boolean)"]
objMeshes
Type: Rhino.Render.RenderPrimitiveList
[Missing <param name="objMeshes"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.Render.RenderPrimitiveList,System.Guid,System.Boolean)"]
requestingPlugIn
Type: System.Guid
[Missing <param name="requestingPlugIn"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.Render.RenderPrimitiveList,System.Guid,System.Boolean)"]
preview
Type: System.Boolean
[Missing <param name="preview"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.Render.RenderPrimitiveList,System.Guid,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.Render.RenderPrimitiveList,System.Guid,System.Boolean)"]
See Also
Reference
CustomRenderMeshProvider2 Class
BuildCustomMeshes Overload
Rhino.Render Namespace