RhinoCommon API
RhinoSettings.SetGroundPlaneOnInViewDisplayMode Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RhinoSettings.SetGroundPlaneOnInViewDisplayMode(Rhino.Display.RhinoView,System.Boolean)"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public void SetGroundPlaneOnInViewDisplayMode(
	RhinoView view,
	bool bOn
)
Public Sub SetGroundPlaneOnInViewDisplayMode (
	view As RhinoView,
	bOn As Boolean
)
Parameters
view
Type: Rhino.Display.RhinoView
[Missing <param name="view"/> documentation for "M:Rhino.Render.DataSources.RhinoSettings.SetGroundPlaneOnInViewDisplayMode(Rhino.Display.RhinoView,System.Boolean)"]
bOn
Type: System.Boolean
[Missing <param name="bOn"/> documentation for "M:Rhino.Render.DataSources.RhinoSettings.SetGroundPlaneOnInViewDisplayMode(Rhino.Display.RhinoView,System.Boolean)"]
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace