RhinoCommon API
TextureEvaluator.WriteToFloatArray Method
Note: This API is now obsolete.
 Fast access to bitmap evaluator - supply size (which you will probably have received from CRhRdkTexture::PixelSize) to see if the data can be extracted direct to a width*height*4 array of unsigned chars.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[ObsoleteAttribute("Use WriteToFloatArray2 instead - supports much larger byte arrays")]
public virtual SimpleArrayFloat WriteToFloatArray(
	int width,
	int height
)
<ObsoleteAttribute("Use WriteToFloatArray2 instead - supports much larger byte arrays")>
Public Overridable Function WriteToFloatArray (
	width As Integer,
	height As Integer
) As SimpleArrayFloat
Parameters
width
Type: System.Int32
is the point for which to evaluate the texture.
height
Type: System.Int32
duvwdx is a ray differential.
Return Value
Type: SimpleArrayFloat
A FloatArray full of the float values in RGBA order, or null if the function did not succeed.
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace