RhinoCommon API
Brep.GetConnectedComponents Method
 If this Brep has two or more connected components, then duplicates of the connected components are returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public Brep[] GetConnectedComponents()
Public Function GetConnectedComponents As Brep()
Return Value
Type: Brep[]
An array of connected components, or an empty array.
See Also
Reference
Brep Class
Rhino.Geometry Namespace