RhinoCommon API
HostUtils.LoadAssemblyFrom Method
 Calls Assembly.LoadFrom in .NET 4.8. May call a different routine under .NET Core
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Assembly LoadAssemblyFrom(
	string path
)
Public Shared Function LoadAssemblyFrom (
	path As String
) As Assembly
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.Runtime.HostUtils.LoadAssemblyFrom(System.String)"]
Return Value
Type: Assembly
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.LoadAssemblyFrom(System.String)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace