RhinoCommon API
RhinoViewport.SetProjection Method (IsometricCamera, String, Boolean)
 Set viewport to a defined projection.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SetProjection(
	IsometricCamera projection,
	string viewName,
	bool updateConstructionPlane
)
Public Function SetProjection (
	projection As IsometricCamera,
	viewName As String,
	updateConstructionPlane As Boolean
) As Boolean
Parameters
projection
Type: Rhino.Display.IsometricCamera
The "isometric" projection type.
viewName
Type: System.String
If not null or empty, the name is set.
updateConstructionPlane
Type: System.Boolean
If true, the construction plane is set to the viewport plane.
Return Value
Type: Boolean
true if successful.
See Also
Reference
RhinoViewport Class
SetProjection Overload
Rhino.Display Namespace