RhinoCommon API
MostRecentCommandDescription Constructor
Initializes a new instance of the MostRecentCommandDescription class
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MostRecentCommandDescription()
Public Sub New
See Also
Reference
MostRecentCommandDescription Class
Rhino.Commands Namespace