RhinoCommon API
Field.ValueAsDouble Method
 Return field value as a double precision number.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected double ValueAsDouble()
Protected Function ValueAsDouble As Double
Return Value
Type: Double
Return the field value as a double precision number.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace