RhinoCommon API
MeshCurveIntersection Constructor
Initializes a new instance of the MeshCurveIntersection class
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshCurveIntersection()
Public Sub New
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace