RhinoCommon API
SubDEdgeChain.AddEdge Method
 Adds an edge to whichever end of the chain it connects to.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public uint AddEdge(
	SubDEdge edge
)
Public Function AddEdge (
	edge As SubDEdge
) As UInteger
Parameters
edge
Type: Rhino.Geometry.SubDEdge
The edge to add.
Return Value
Type: UInt32
 The number of edges that were added, so 1 on success and 0 if the edge does not connect to either end, is already in the chain, or the chain is empty.
Remarks
 This cannot start a chain: adding to an empty chain does nothing and returns 0. Use Begin(SubDEdge) or the SubDEdgeChain(SubD, SubDEdge) constructor for the first edge.
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace