RhinoCommon API
RhinoViewport Constructor (RhinoViewport)
Initializes a new instance of the RhinoViewport class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoViewport(
	RhinoViewport other
)
Public Sub New (
	other As RhinoViewport
)
Parameters
other
Type: Rhino.Display.RhinoViewport
[Missing <param name="other"/> documentation for "M:Rhino.Display.RhinoViewport.#ctor(Rhino.Display.RhinoViewport)"]
See Also
Reference
RhinoViewport Class
RhinoViewport Overload
Rhino.Display Namespace