RhinoCommon API
RhinoApp.IsInstallationEvaluation Method
 If licenseType is an evaluation license, returns true. An evaluation license limits the ability of Rhino to save based on either the number of saves or a fixed period of time.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public static bool IsInstallationEvaluation(
	Installation licenseType
)
Public Shared Function IsInstallationEvaluation (
	licenseType As Installation
) As Boolean
Parameters
licenseType
Type: Rhino.ApplicationSettings.Installation
[Missing <param name="licenseType"/> documentation for "M:Rhino.RhinoApp.IsInstallationEvaluation(Rhino.ApplicationSettings.Installation)"]
Return Value
Type: Boolean
true if licenseType is an evaluation license. false otherwise
See Also
Reference
RhinoApp Class
Rhino Namespace
Rhino.ApplicationSettings.Installation