RhinoCommon API
RTree.PointCloudKNeighbors Method
 Finds a certain amount of points in a list of 3D points that are the k-closest to a test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static IEnumerable<int[]> PointCloudKNeighbors(
	PointCloud pointcloud,
	IEnumerable<Point3d> needlePts,
	int amount
)
Public Shared Function PointCloudKNeighbors (
	pointcloud As PointCloud,
	needlePts As IEnumerable(Of Point3d),
	amount As Integer
) As IEnumerable(Of Integer())
Parameters
pointcloud
Type: Rhino.Geometry.PointCloud
A point cloud to be searched.
needlePts
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to search for.
amount
Type: System.Int32
The required amount of closest neighbors to find.
Return Value
Type: IEnumerable<Int32[]>
An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
See Also
Reference
RTree Class
Rhino.Geometry Namespace
RhinoList.PointCloudKNeighbors(PointCloud, IEnumerable<Point3d>, Int32)