RhinoCommon API
SectionStyleTable.AddReferenceSectionStyle Method
 Adds a reference section style that will not be saved in files.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int AddReferenceSectionStyle(
	SectionStyle sectionstyle
)
Public Function AddReferenceSectionStyle (
	sectionstyle As SectionStyle
) As Integer
Parameters
sectionstyle
Type: Rhino.DocObjects.SectionStyle
 Definition of new section style. The information in sectionstyle is copied. If sectionstyle.Name is empty then a unique name of the form "SectionStyle 01" will be automatically created.
Return Value
Type: Int32
 Index of new section style or -1 on error.
See Also
Reference
SectionStyleTable Class
Rhino.DocObjects.Tables Namespace