RhinoCommon API
SweepTwoRail.PerformSweep Method (Curve, Curve, Curve)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep[] PerformSweep(
	Curve rail1,
	Curve rail2,
	Curve crossSection
)
Public Function PerformSweep (
	rail1 As Curve,
	rail2 As Curve,
	crossSection As Curve
) As Brep()
Parameters
rail1
Type: Rhino.Geometry.Curve
Rail to sweep shapes along.
rail2
Type: Rhino.Geometry.Curve
Rail to sweep shapes along.
crossSection
Type: Rhino.Geometry.Curve
Shape curve.
Return Value
Type: Brep[]
Array of Brep sweep results.
See Also
Reference
SweepTwoRail Class
PerformSweep Overload
Rhino.Geometry Namespace