RhinoCommon API
StdVectorByte Constructor (UInt64)
 Initializes a new SimpleArrayByte class. Initial size of the array - all values are set to zero.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public StdVectorByte(
	ulong initialSize
)
Public Sub New (
	initialSize As ULong
)
Parameters
initialSize
Type: System.UInt64
[Missing <param name="initialSize"/> documentation for "M:Rhino.Runtime.InteropWrappers.StdVectorByte.#ctor(System.UInt64)"]
See Also
Reference
StdVectorByte Class
StdVectorByte Overload
Rhino.Runtime.InteropWrappers Namespace