RhinoCommon API
File3dm Constructor
 Initializes a new instance of a 3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public File3dm()
Public Sub New
See Also
Reference
File3dm Class
Rhino.FileIO Namespace