RhinoCommon API
UserDataList.Contains Method
 Checks for the existence of a specific type of user-data in this list Both .NET and native user-data is checked
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public bool Contains(
	Guid userdataId
)
Public Function Contains (
	userdataId As Guid
) As Boolean
Parameters
userdataId
Type: System.Guid
[Missing <param name="userdataId"/> documentation for "M:Rhino.DocObjects.Custom.UserDataList.Contains(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Custom.UserDataList.Contains(System.Guid)"]
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace