RhinoCommon API
HatchPatternTable.Rename Method (HatchPattern, String)
 Renames a hatch pattern in the table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Rename(
	HatchPattern item,
	string hatchPatternName
)
Public Function Rename (
	item As HatchPattern,
	hatchPatternName As String
) As Boolean
Parameters
item
Type: Rhino.DocObjects.HatchPattern
The hatch pattern to rename
hatchPatternName
Type: System.String
The new hatch pattern name.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
HatchPatternTable Class
Rename Overload
Rhino.DocObjects.Tables Namespace