RhinoCommon API
DisplayPipeline.DrawPatternedLine Method (Point3d, Point3d, Color, Int32, Int32)
 Draws a single line with specified pattern.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawPatternedLine(
	Point3d from,
	Point3d to,
	Color color,
	int pattern,
	int thickness
)
Public Sub DrawPatternedLine (
	from As Point3d,
	to As Point3d,
	color As Color,
	pattern As Integer,
	thickness As Integer
)
Parameters
from
Type: Rhino.Geometry.Point3d
Line start point.
to
Type: Rhino.Geometry.Point3d
Line end point.
color
Type: System.Drawing.Color
Color of line.
pattern
Type: System.Int32
Pattern of the line (like 0x00001111 for dotted line).
thickness
Type: System.Int32
Thickness (in pixels) of lines.
See Also
Reference
DisplayPipeline Class
DrawPatternedLine Overload
Rhino.Display Namespace