RhinoCommon API
ControlPoint Constructor (Point3d, Double)
 Constructs a control point from a world 3-D, or Euclidean, location and a weight. The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ControlPoint(
	Point3d euclideanPt,
	double weight
)
Public Sub New (
	euclideanPt As Point3d,
	weight As Double
)
Parameters
euclideanPt
Type: Rhino.Geometry.Point3d
Coordinates of the control point.
weight
Type: System.Double
Weight factor of the control point. You should not use weights less than or equal to zero.
See Also
Reference
ControlPoint Structure
ControlPoint Overload
Rhino.Geometry Namespace