RhinoCommon API
RhinoGet.GetDistance Method
 Allows the user to interactively pick a distance
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Result GetDistance(
	string commandPrompt,
	double defaultDistance,
	out double distance
)
Public Shared Function GetDistance (
	commandPrompt As String,
	defaultDistance As Double,
	<OutAttribute> ByRef distance As Double
) As Result
Parameters
commandPrompt
Type: System.String
if null, a default prompt will be displayed
defaultDistance
Type: System.Double
[Missing <param name="defaultDistance"/> documentation for "M:Rhino.Input.RhinoGet.GetDistance(System.String,System.Double,System.Double@)"]
distance
Type: System.Double
[Missing <param name="distance"/> documentation for "M:Rhino.Input.RhinoGet.GetDistance(System.String,System.Double,System.Double@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetDistance(System.String,System.Double,System.Double@)"]
See Also
Reference
RhinoGet Class
Rhino.Input Namespace