RhinoCommon API
DisplayModeDescription.ExportToFile Method
 Exports a DisplayModeDescription to a Windows-style .ini file.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool ExportToFile(
	DisplayModeDescription displayMode,
	string filename
)
Public Shared Function ExportToFile (
	displayMode As DisplayModeDescription,
	filename As String
) As Boolean
Parameters
displayMode
Type: Rhino.Display.DisplayModeDescription
The DisplayModeDescription to export.
filename
Type: System.String
The name of the file to create.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.DisplayModeDescription.ExportToFile(Rhino.Display.DisplayModeDescription,System.String)"]
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace