RhinoCommon API
IndexPair Constructor
 Initializes a new instance of IndexPair with two indices.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IndexPair(
	int i,
	int j
)
Public Sub New (
	i As Integer,
	j As Integer
)
Parameters
i
Type: System.Int32
A first index.
j
Type: System.Int32
A second index.
See Also
Reference
IndexPair Structure
Rhino Namespace