RhinoCommon API
Transform.Orthogonalize Method
 Force the linear part of this transformation to be a rotation (or a rotation with reflection). Use DecomposeRigid(T,R) to find the nearest rotation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public bool Orthogonalize(
	double tolerance
)
Public Function Orthogonalize (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
The evaluation tolerance
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace