RhinoCommon API
RenderContent.SetChildSlotParameter Method
 Extra requirements are a way of specifying extra functionality on parameters in the automatic UI. Override this function to support values being set from automatic UI sections or the texture summary. See IAutoUIExtraRequirements.h in the C++ RDK SDK for string definitions for the parameter names. Call the base class from your override if you do not support the extra requirement parameter. Please do not call this function. It is only retained for backward compatibility. You should instead call SetExtraRequirementParameter().
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual bool SetChildSlotParameter(
	string contentParameterName,
	string extraRequirementParameter,
	Object value,
	RenderContent.ExtraRequirementsSetContexts sc
)
Public Overridable Function SetChildSlotParameter (
	contentParameterName As String,
	extraRequirementParameter As String,
	value As Object,
	sc As RenderContent.ExtraRequirementsSetContexts
) As Boolean
Parameters
contentParameterName
Type: System.String
The parameter or field internal name to which this query applies.
extraRequirementParameter
Type: System.String
The extra requirement parameter, as listed in IAutoUIExtraRequirements.h in the C++ RDK SDK.
value
Type: System.Object
The value to set this extra requirement parameter. You will typically use System.Convert to convert the value to the type you need.
sc
Type: Rhino.Render.RenderContent.ExtraRequirementsSetContexts
The context of this operation.
Return Value
Type: Boolean
true if successful, else false.
See Also
Reference
RenderContent Class
Rhino.Render Namespace