RhinoCommon API
RenderContent.MatchData Method
 Implement to transfer data from another content to this content during creation.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual RenderContent.MatchDataResult MatchData(
	RenderContent oldContent
)
Public Overridable Function MatchData (
	oldContent As RenderContent
) As RenderContent.MatchDataResult
Parameters
oldContent
Type: Rhino.Render.RenderContent
An old content object from which the implementation may harvest data.
Return Value
Type: RenderContent.MatchDataResult
Information about how much data was matched.
See Also
Reference
RenderContent Class
Rhino.Render Namespace