RhinoCommon API
NurbsCurvePointList.SetPoint Method (Int32, Double, Double, Double)
 Sets a world 3-D, or Euclidean, control point at the given index. The 4-D representation is (x, y, z, 1.0).
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SetPoint(
	int index,
	double x,
	double y,
	double z
)
Public Function SetPoint (
	index As Integer,
	x As Double,
	y As Double,
	z As Double
) As Boolean
Parameters
index
Type: System.Int32
Index of control point to set.
x
Type: System.Double
X coordinate of control point.
y
Type: System.Double
Y coordinate of control point.
z
Type: System.Double
Z coordinate of control point.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsCurvePointList Class
SetPoint Overload
Rhino.Geometry.Collections Namespace