RhinoCommon API
PreviewJobSignature.Dispose Method
 Dispose
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PreviewJobSignature Class
Rhino.Render Namespace