RhinoCommon API
DimStyleTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override IEnumerator<DimensionStyle> GetEnumerator()
Public Overrides Function GetEnumerator As IEnumerator(Of DimensionStyle)
Return Value
Type: IEnumerator<DimensionStyle>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
IEnumerable<T>.GetEnumerator()
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace