RhinoCommon API
FileDwgWriteOptions Constructor
 AutoCAD version format to write to
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileDwgWriteOptions()
Public Sub New
See Also
Reference
FileDwgWriteOptions Class
FileDwgWriteOptions Overload
Rhino.FileIO Namespace