RhinoCommon API
ModelComponent.ToString Method
 Returns the name of the model component type, and then its name and index.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.ModelComponent.ToString"]
Remarks
This is provided as a visual aid. Do not rely on this for serialization.
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace