RhinoCommon API
SimpleArrayIntPtr.ConstPointer Method
 Gets the constant (immutable) pointer of this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
The constant pointer.
See Also
Reference
SimpleArrayIntPtr Class
Rhino.Runtime.InteropWrappers Namespace