RhinoCommon API
GetPoint.SetCursor Method
 Sets cursor that will be used when Get() is called and snap is not happening.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetCursor(
	CursorStyle cursor
)
Public Sub SetCursor (
	cursor As CursorStyle
)
Parameters
cursor
Type: Rhino.UI.CursorStyle
[Missing <param name="cursor"/> documentation for "M:Rhino.Input.Custom.GetPoint.SetCursor(Rhino.UI.CursorStyle)"]
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace