RhinoCommon API
SubDEdgeSharpness.EqualDelta Method
 Determines whether two sharpnesses have the same Delta and meet with the same value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static bool EqualDelta(
	SubDEdgeSharpness s0,
	SubDEdgeSharpness s1
)
Public Shared Function EqualDelta (
	s0 As SubDEdgeSharpness,
	s1 As SubDEdgeSharpness
) As Boolean
Parameters
s0
Type: Rhino.Geometry.SubDEdgeSharpness
The sharpness of the first edge.
s1
Type: Rhino.Geometry.SubDEdgeSharpness
The sharpness of the second edge.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgeSharpness.EqualDelta(Rhino.Geometry.SubDEdgeSharpness,Rhino.Geometry.SubDEdgeSharpness)"]
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace