RhinoCommon API
Brep.FindCoincidentBrepComponents Method
 Find the indices of all brep faces, edges and vertices that are within tolerance of a test-point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public void FindCoincidentBrepComponents(
	Point3d point,
	double tolerance,
	out int[] faces,
	out int[] edges,
	out int[] vertices
)
Public Sub FindCoincidentBrepComponents (
	point As Point3d,
	tolerance As Double,
	<OutAttribute> ByRef faces As Integer(),
	<OutAttribute> ByRef edges As Integer(),
	<OutAttribute> ByRef vertices As Integer()
)
Parameters
point
Type: Rhino.Geometry.Point3d
Test point.
tolerance
Type: System.Double
Coincidence tolerance.
faces
Type: System.Int32[]
Array of BrepFace indices.
edges
Type: System.Int32[]
Array of BrepEdge indices.
vertices
Type: System.Int32[]
Array of BrepVertex indices.
See Also
Reference
Brep Class
Rhino.Geometry Namespace