RhinoCommon API
Curve.ClosedCurveOrientation Method (Transform)
 Determines the orientation (counterclockwise or clockwise) of a closed, planar curve. Only works with simple (no self intersections) closed, planar curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public CurveOrientation ClosedCurveOrientation(
	Transform xform
)
Public Function ClosedCurveOrientation (
	xform As Transform
) As CurveOrientation
Parameters
xform
Type: Rhino.Geometry.Transform
 Transformation to map the curve to the world XY plane.
Return Value
Type: CurveOrientation
The orientation of this curve in the world XY-plane.
See Also
Reference
Curve Class
ClosedCurveOrientation Overload
Rhino.Geometry Namespace