RhinoCommon API
RenderPlugIn.OnSetCurrent Method
 This plug-in (has become)/(is no longer) the current render plug-in
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnSetCurrent(
	bool current
)
Protected Overridable Sub OnSetCurrent (
	current As Boolean
)
Parameters
current
Type: System.Boolean
 If true then this plug-in is now the current render plug-in otherwise it is no longer the current render plug-in.
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace