RhinoCommon API
DisplayBitmap.Update Method
 Update the image used for this DisplayBitmap
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public void Update(
	Bitmap bitmap
)
Public Sub Update (
	bitmap As Bitmap
)
Parameters
bitmap
Type: System.Drawing.Bitmap
[Missing <param name="bitmap"/> documentation for "M:Rhino.Display.DisplayBitmap.Update(System.Drawing.Bitmap)"]
See Also
Reference
DisplayBitmap Class
Rhino.Display Namespace