RhinoCommon API
ChangeQueue.ApplyDynamicLightChanges Method
 Handle dynamic light changes
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplyDynamicLightChanges(
	List<Light> dynamicLightChanges
)
Protected Overridable Sub ApplyDynamicLightChanges (
	dynamicLightChanges As List(Of Light)
)
Parameters
dynamicLightChanges
Type: System.Collections.Generic.List<Light>
[Missing <param name="dynamicLightChanges"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyDynamicLightChanges(System.Collections.Generic.List{Rhino.Geometry.Light})"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace