RhinoCommon API
IRdkViewModel.Discard Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRdkViewModel.Discard(System.Guid)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void Discard(
	Guid uuidDataType
)
Sub Discard (
	uuidDataType As Guid
)
Parameters
uuidDataType
Type: System.Guid
[Missing <param name="uuidDataType"/> documentation for "M:Rhino.UI.Controls.IRdkViewModel.Discard(System.Guid)"]
See Also
Reference
IRdkViewModel Interface
Rhino.UI.Controls Namespace