RhinoCommon API
NurbsSurface.MakeCompatible Method
 For expert use only. Makes a pair of compatible NURBS surfaces based on two input surfaces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool MakeCompatible(
	Surface surface0,
	Surface surface1,
	out NurbsSurface nurb0,
	out NurbsSurface nurb1
)
Public Shared Function MakeCompatible (
	surface0 As Surface,
	surface1 As Surface,
	<OutAttribute> ByRef nurb0 As NurbsSurface,
	<OutAttribute> ByRef nurb1 As NurbsSurface
) As Boolean
Parameters
surface0
Type: Rhino.Geometry.Surface
The first surface.
surface1
Type: Rhino.Geometry.Surface
The second surface.
nurb0
Type: Rhino.Geometry.NurbsSurface
The first output NURBS surface.
nurb1
Type: Rhino.Geometry.NurbsSurface
The second output NURBS surface.
Return Value
Type: Boolean
true if successful, false on failure.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace