RhinoCommon API
FileLwoReadOptions Constructor
Initializes a new instance of the FileLwoReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileLwoReadOptions()
Public Sub New
See Also
Reference
FileLwoReadOptions Class
Rhino.FileIO Namespace