RhinoCommon API
Dithering Constructor (Dithering)
 Create a utility object not associated with any document from another object
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Dithering(
	Dithering d
)
Public Sub New (
	d As Dithering
)
Parameters
d
Type: Rhino.Render.Dithering
[Missing <param name="d"/> documentation for "M:Rhino.Render.Dithering.#ctor(Rhino.Render.Dithering)"]
See Also
Reference
Dithering Class
Dithering Overload
Rhino.Render Namespace