RhinoCommon API
Transform2d.TryGetInverse Method
 Attempts to get the inverse transform of this transform.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetInverse(
	out Transform2d inverseTransform
)
Public Function TryGetInverse (
	<OutAttribute> ByRef inverseTransform As Transform2d
) As Boolean
Parameters
inverseTransform
Type: Rhino.Geometry.Transform2d
The inverse transform. This out reference will be assigned during this call.
Return Value
Type: Boolean
 true on success. If false is returned and this Transform2d is invalid, inverseTransform will be set to this Transform2d. If false is returned and this Transform2d is valid, inverseTransform will be set to a pseudo inverse.
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace