RhinoCommon API
WorksessionFileLayerValues.SetLayer Method
Replaces the layer settings with a copy of layer.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetLayer(
	Layer layer
)
Public Sub SetLayer (
	layer As Layer
)
Parameters
layer
Type: Rhino.DocObjects.Layer
The layer to copy.
Exceptions
Exception | Condition
ArgumentNullException | If layer is null.
See Also
Reference
WorksessionFileLayerValues Class
Rhino.FileIO Namespace