RhinoCommon API
Brep Constructor
Initializes a new empty brep
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public Brep()
Public Sub New
See Also
Reference
Brep Class
Brep Overload
Rhino.Geometry Namespace