RhinoCommon API
RenderTexture.SetWrapType Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.SetWrapType(Rhino.Render.TextureWrapType,Rhino.Render.RenderContent.ChangeContexts)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual void SetWrapType(
	TextureWrapType value,
	RenderContent.ChangeContexts changeContext
)
Public Overridable Sub SetWrapType (
	value As TextureWrapType,
	changeContext As RenderContent.ChangeContexts
)
Parameters
value
Type: Rhino.Render.TextureWrapType
[Missing <param name="value"/> documentation for "M:Rhino.Render.RenderTexture.SetWrapType(Rhino.Render.TextureWrapType,Rhino.Render.RenderContent.ChangeContexts)"]
changeContext
Type: Rhino.Render.RenderContent.ChangeContexts
[Missing <param name="changeContext"/> documentation for "M:Rhino.Render.RenderTexture.SetWrapType(Rhino.Render.TextureWrapType,Rhino.Render.RenderContent.ChangeContexts)"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace