RhinoCommon API
IRhinoUiDialogService.ShowLineTypes Method (String, String, RhinoDoc, Guid)
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc,System.Guid)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
Guid ShowLineTypes(
	string title,
	string message,
	RhinoDoc doc,
	Guid selectedLinetypeId
)
Function ShowLineTypes (
	title As String,
	message As String,
	doc As RhinoDoc,
	selectedLinetypeId As Guid
) As Guid
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc,System.Guid)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc,System.Guid)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc,System.Guid)"]
selectedLinetypeId
Type: System.Guid
[Missing <param name="selectedLinetypeId"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc,System.Guid)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc,System.Guid)"]
See Also
Reference
IRhinoUiDialogService Interface
ShowLineTypes Overload
Rhino.UI Namespace