RhinoCommon API
CurveList.Insert Method (Int32, Circle)
 Inserts a line at a given index of this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Insert(
	int index,
	Circle circle
)
Public Sub Insert (
	index As Integer,
	circle As Circle
)
Parameters
index
Type: System.Int32
A 0-based position in the list.
circle
Type: Rhino.Geometry.Circle
The circle value from which to construct the new curve.
See Also
Reference
CurveList Class
Insert Overload
Rhino.Collections Namespace