RhinoCommon API
HostUtils.CreatePlugIn Method
 Instantiates a plug-in type and registers the associated commands and classes.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static PlugIn CreatePlugIn(
	Type pluginType,
	bool printDebugMessages
)
Public Shared Function CreatePlugIn (
	pluginType As Type,
	printDebugMessages As Boolean
) As PlugIn
Parameters
pluginType
Type: System.Type
A plug-in type. This type must derive from PlugIn.
printDebugMessages
Type: System.Boolean
true if debug messages should be printed.
Return Value
Type: PlugIn
A new plug-in instance.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace