RhinoCommon API
RhinoObject.GetRenderMeshParameters Method
 Returns the meshing parameters that this object uses for generating render meshes. If this object does not have per-object meshing parameters, then the document's meshing parameters are returned.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public MeshingParameters GetRenderMeshParameters()
Public Function GetRenderMeshParameters As MeshingParameters
Return Value
Type: MeshingParameters
The render meshing parameters.
See Also
Reference
RhinoObject Class
GetRenderMeshParameters Overload
Rhino.DocObjects Namespace