RhinoCommon API
SubDEdgeSharpness.Reversed Method
 Gets this sharpness with its two end values swapped.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDEdgeSharpness Reversed()
Public Function Reversed As SubDEdgeSharpness
Return Value
Type: SubDEdgeSharpness
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgeSharpness.Reversed"]
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace