RhinoCommon API
AppearanceSettings.DefaultPaintColor Method (PaintColor)
 Get a default paint color for Rhino. The current paint color may be different than the default
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Color DefaultPaintColor(
	PaintColor whichColor
)
Public Shared Function DefaultPaintColor (
	whichColor As PaintColor
) As Color
Parameters
whichColor
Type: Rhino.ApplicationSettings.PaintColor
The color to retrieve
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.AppearanceSettings.DefaultPaintColor(Rhino.ApplicationSettings.PaintColor)"]
See Also
Reference
AppearanceSettings Class
DefaultPaintColor Overload
Rhino.ApplicationSettings Namespace