RhinoCommon API
ObjectTable.Replace Method (Guid, SubD)
Replaces one object with new subd object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Replace(
	Guid objectId,
	SubD subD
)
Public Function Replace (
	objectId As Guid,
	subD As SubD
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
subD
Type: Rhino.Geometry.SubD
 new mesh to be added A duplicate of the mesh is added to the Rhino model.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace