RhinoCommon API
DisplayPipeline.DrawDraftAnglePreview Method (Brep, Color)
 Draws a Brep in Draft Angle preview.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void DrawDraftAnglePreview(
	Brep brep,
	Color color
)
Public Sub DrawDraftAnglePreview (
	brep As Brep,
	color As Color
)
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to draw.
color
Type: System.Drawing.Color
Objct color.
See Also
Reference
DisplayPipeline Class
DrawDraftAnglePreview Overload
Rhino.Display Namespace