RhinoCommon API
RenderTexture.GetWrapType Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetWrapType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual TextureWrapType GetWrapType()
Public Overridable Function GetWrapType As TextureWrapType
Return Value
Type: TextureWrapType
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetWrapType"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace