RhinoCommon API
File3dm.DumpToTextLog Method
Prepares a text dump of the entire model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public void DumpToTextLog(
	TextLog log
)
Public Sub DumpToTextLog (
	log As TextLog
)
Parameters
log
Type: Rhino.FileIO.TextLog
[Missing <param name="log"/> documentation for "M:Rhino.FileIO.File3dm.DumpToTextLog(Rhino.FileIO.TextLog)"]
See Also
Reference
File3dm Class
Rhino.FileIO Namespace