RhinoCommon API
ObjectTable.AddTextDot Method (TextDot, ObjectAttributes)
Adds a text dot object to Rhino.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddTextDot(
	TextDot dot,
	ObjectAttributes attributes
)
Public Function AddTextDot (
	dot As TextDot,
	attributes As ObjectAttributes
) As Guid
Parameters
dot
Type: Rhino.Geometry.TextDot
A text dot that will be copied.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to text dot.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddTextDot Overload
Rhino.DocObjects.Tables Namespace