RhinoCommon API
Surface.RefitSplit Method
 Splits the surface into two and refits the split edge
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int RefitSplit(
	Curve curve,
	Vector3d trimProjectionDir,
	double tolerance,
	IEnumerable<double> Knots,
	bool bMeetCurve,
	bool divideIntoSections,
	List<Surface> srfLower,
	List<Surface> srfUpper,
	List<Curve> edgeCurve,
	ref Curve trimCurveOnSurface,
	ref Curve splitCurve
)
Public Function RefitSplit (
	curve As Curve,
	trimProjectionDir As Vector3d,
	tolerance As Double,
	Knots As IEnumerable(Of Double),
	bMeetCurve As Boolean,
	divideIntoSections As Boolean,
	srfLower As List(Of Surface),
	srfUpper As List(Of Surface),
	edgeCurve As List(Of Curve),
	ByRef trimCurveOnSurface As Curve,
	ByRef splitCurve As Curve
) As Integer
Parameters
curve
Type: Rhino.Geometry.Curve
The curve used to split the surface. It must be a simple division, from one edge of the parametric space to the opposite edge.
trimProjectionDir
Type: Rhino.Geometry.Vector3d
Vector for projection, or zero vector for no projection
tolerance
Type: System.Double
3d tolerance for projection, splitting, fitting...
Knots
Type: System.Collections.Generic.IEnumerable<Double>
[Missing <param name="Knots"/> documentation for "M:Rhino.Geometry.Surface.RefitSplit(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,System.Double,System.Collections.Generic.IEnumerable{System.Double},System.Boolean,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Surface},System.Collections.Generic.List{Rhino.Geometry.Surface},System.Collections.Generic.List{Rhino.Geometry.Curve},Rhino.Geometry.Curve@,Rhino.Geometry.Curve@)"]
bMeetCurve
Type: System.Boolean
[Missing <param name="bMeetCurve"/> documentation for "M:Rhino.Geometry.Surface.RefitSplit(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,System.Double,System.Collections.Generic.IEnumerable{System.Double},System.Boolean,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Surface},System.Collections.Generic.List{Rhino.Geometry.Surface},System.Collections.Generic.List{Rhino.Geometry.Curve},Rhino.Geometry.Curve@,Rhino.Geometry.Curve@)"]
divideIntoSections
Type: System.Boolean
If true, the surface is divided at each knot
srfLower
Type: System.Collections.Generic.List<Surface>
Surfaces below trim curve in srf's (u,v) domain
srfUpper
Type: System.Collections.Generic.List<Surface>
Surfaces below trim curve in srf's (u,v) domain
edgeCurve
Type: System.Collections.Generic.List<Curve>
Curves (# = nSections) fit to trim curve with srf's u/v parameter
trimCurveOnSurface
Type: Rhino.Geometry.Curve
the actual trim curve as it is projected on or pulled to the surface
splitCurve
Type: Rhino.Geometry.Curve
the actual fit curve the split the surface
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Geometry.Surface.RefitSplit(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,System.Double,System.Collections.Generic.IEnumerable{System.Double},System.Boolean,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Surface},System.Collections.Generic.List{Rhino.Geometry.Surface},System.Collections.Generic.List{Rhino.Geometry.Curve},Rhino.Geometry.Curve@,Rhino.Geometry.Curve@)"]
See Also
Reference
Surface Class
Rhino.Geometry Namespace