RhinoCommon API
SurfaceDirectionIndicators.Draw Method
 Draw the surface directions.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Draw(
	DisplayPipeline dp
)
Public Function Draw (
	dp As DisplayPipeline
) As Boolean
Parameters
dp
Type: Rhino.Display.DisplayPipeline
[Missing <param name="dp"/> documentation for "M:Rhino.Geometry.SurfaceDirectionIndicators.Draw(Rhino.Display.DisplayPipeline)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SurfaceDirectionIndicators.Draw(Rhino.Display.DisplayPipeline)"]
See Also
Reference
SurfaceDirectionIndicators Class
Rhino.Geometry Namespace