RhinoCommon API
RenderEndEventArgs Constructor
Initializes a new instance of the RenderEndEventArgs class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderEndEventArgs()
Public Sub New
See Also
Reference
RenderEndEventArgs Class
Rhino.Render Namespace