RhinoCommon API
ObjectAttributes.RemoveFromAllGroups Method
Removes object from all groups.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void RemoveFromAllGroups()
Public Sub RemoveFromAllGroups
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace