RhinoCommon API
FileSettings.AddSearchPath Method
 Adds a new imagePath to Rhino's search imagePath list. See "Options Files settings" in the Rhino help file for more details.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int AddSearchPath(
	string folder,
	int index
)
Public Shared Function AddSearchPath (
	folder As String,
	index As Integer
) As Integer
Parameters
folder
Type: System.String
[in] The valid folder, or imagePath, to add.
index
Type: System.Int32
 [in] A zero-based position index in the search imagePath list to insert the string. If -1, the imagePath will be appended to the end of the list.
Return Value
Type: Int32
 The index where the item was inserted if success.
-1 on failure.
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace