RhinoCommon API
InstanceDefinitionTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override IEnumerator<InstanceDefinition> GetEnumerator()
Public Overrides Function GetEnumerator As IEnumerator(Of InstanceDefinition)
Return Value
Type: IEnumerator<InstanceDefinition>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace