RhinoCommon API
GroupTable.GroupNames Method
 Returns an array of all group names.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string[] GroupNames(
	bool ignoreDeletedGroups
)
Public Function GroupNames (
	ignoreDeletedGroups As Boolean
) As String()
Parameters
ignoreDeletedGroups
Type: System.Boolean
Ignore any groups that were deleted.
Return Value
Type: String[]
An array if group names if successful, null if there are no groups.
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace