RhinoCommon API
BinaryArchiveReader.ReadRenderSettings Method
 Reads a RenderSettings-derived object from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderSettings ReadRenderSettings()
Public Function ReadRenderSettings As RenderSettings
Return Value
Type: RenderSettings
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace