RhinoCommon API
RenderTexture.SimulateTexture Method (SimulatedTexture, RenderTexture.TextureGeneration, Int32, RhinoObject)
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.SimulateTexture(Rhino.Render.SimulatedTexture@,Rhino.Render.RenderTexture.TextureGeneration,System.Int32,Rhino.DocObjects.RhinoObject)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual void SimulateTexture(
	ref SimulatedTexture simulation,
	RenderTexture.TextureGeneration tg,
	int size = -1,
	RhinoObject obj = null
)
Public Overridable Sub SimulateTexture (
	ByRef simulation As SimulatedTexture,
	tg As RenderTexture.TextureGeneration,
	Optional size As Integer = -1,
	Optional obj As RhinoObject = Nothing
)
Parameters
simulation
Type: Rhino.Render.SimulatedTexture
[Missing <param name="simulation"/> documentation for "M:Rhino.Render.RenderTexture.SimulateTexture(Rhino.Render.SimulatedTexture@,Rhino.Render.RenderTexture.TextureGeneration,System.Int32,Rhino.DocObjects.RhinoObject)"]
tg
Type: Rhino.Render.RenderTexture.TextureGeneration
[Missing <param name="tg"/> documentation for "M:Rhino.Render.RenderTexture.SimulateTexture(Rhino.Render.SimulatedTexture@,Rhino.Render.RenderTexture.TextureGeneration,System.Int32,Rhino.DocObjects.RhinoObject)"]
size (Optional)
Type: System.Int32
[Missing <param name="size"/> documentation for "M:Rhino.Render.RenderTexture.SimulateTexture(Rhino.Render.SimulatedTexture@,Rhino.Render.RenderTexture.TextureGeneration,System.Int32,Rhino.DocObjects.RhinoObject)"]
obj (Optional)
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="obj"/> documentation for "M:Rhino.Render.RenderTexture.SimulateTexture(Rhino.Render.SimulatedTexture@,Rhino.Render.RenderTexture.TextureGeneration,System.Int32,Rhino.DocObjects.RhinoObject)"]
See Also
Reference
RenderTexture Class
SimulateTexture Overload
Rhino.Render Namespace