RhinoCommon API
ViewSettings.RestoreDefaults Method
 Updates from the default setting state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void RestoreDefaults()
Public Shared Sub RestoreDefaults
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace