RhinoCommon API
ColorRGBA.ApplyGamma Method
[Missing <summary> documentation for "M:Rhino.Display.ColorRGBA.ApplyGamma(Rhino.Display.ColorRGBA,System.Double)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static ColorRGBA ApplyGamma(
	ColorRGBA col,
	double gamma
)
Public Shared Function ApplyGamma (
	col As ColorRGBA,
	gamma As Double
) As ColorRGBA
Parameters
col
Type: Rhino.Display.ColorRGBA
[Missing <param name="col"/> documentation for "M:Rhino.Display.ColorRGBA.ApplyGamma(Rhino.Display.ColorRGBA,System.Double)"]
gamma
Type: System.Double
[Missing <param name="gamma"/> documentation for "M:Rhino.Display.ColorRGBA.ApplyGamma(Rhino.Display.ColorRGBA,System.Double)"]
Return Value
Type: ColorRGBA
[Missing <returns> documentation for "M:Rhino.Display.ColorRGBA.ApplyGamma(Rhino.Display.ColorRGBA,System.Double)"]
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace