RhinoCommon API
CommonComponentTable<T>.GetEnumerator Method
 Returns the enumerator that yields all items.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual IEnumerator<T> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of T)
Return Value
Type: IEnumerator<T>
[Missing <returns> documentation for "M:Rhino.FileIO.CommonComponentTable`1.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
CommonComponentTable<T> Class
Rhino.FileIO Namespace