RhinoCommon API
SubD.UpdateAllTagsAndSectorCoefficients Method
 Updates vertex tag, edge tag, and edge coefficient values on the active level. After completing custom editing operations that modify the topology of the SubD control net or changing values of vertex or edge tags, the tag and sector coefficients information on nearby components in the edited areas need to be updated.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public uint UpdateAllTagsAndSectorCoefficients()
Public Function UpdateAllTagsAndSectorCoefficients As UInteger
Return Value
Type: UInt32
 Number of vertices and edges that were changed during the update.
See Also
Reference
SubD Class
Rhino.Geometry Namespace