RhinoCommon API
DisplayPipeline.DrawLine Method (Line, Color)
 Draws a single line object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DrawLine(
	Line line,
	Color color
)
Public Sub DrawLine (
	line As Line,
	color As Color
)
Parameters
line
Type: Rhino.Geometry.Line
Line to draw.
color
Type: System.Drawing.Color
Color to draw line in.
See Also
Reference
DisplayPipeline Class
DrawLine Overload
Rhino.Display Namespace