RhinoCommon API
PageViewGroup.GetUserString Method
 Gets user string from this component.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string GetUserString(
	string key
)
Public Function GetUserString (
	key As String
) As String
Parameters
key
Type: System.String
id used to retrieve the string.
Return Value
Type: String
string associated with the key if successful. null if no key was found.
See Also
Reference
PageViewGroup Class
Rhino.DocObjects Namespace