RhinoCommon API
InstanceDefinition.UseCount Method (Int32, Int32)
 Returns the number of references of this instance definition in the model. Both top-level references and nested instances are included in the count.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
public int UseCount(
	out int topLevelReferenceCount,
	out int nestedReferenceCount
)
Public Function UseCount (
	<OutAttribute> ByRef topLevelReferenceCount As Integer,
	<OutAttribute> ByRef nestedReferenceCount As Integer
) As Integer
Parameters
topLevelReferenceCount
Type: System.Int32
The number of top-level references.
nestedReferenceCount
Type: System.Int32
The number of nested instances.
Return Value
Type: Int32
The number of references of this instance definition in the model.
See Also
Reference
InstanceDefinition Class
UseCount Overload
Rhino.DocObjects Namespace