RhinoCommon API
Brep.CullUnusedVertices Method
Culls vertices with m_vertex_index == -1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool CullUnusedVertices()
Public Function CullUnusedVertices As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace