RhinoCommon API
Matrix.Zero Method
 Sets all values inside the matrix to zero.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Zero()
Public Sub Zero
See Also
Reference
Matrix Class
Rhino.Geometry Namespace