RhinoCommon API
CurveKinkDefinition.IsTangentKink Method (Curve, Double)
 True if there is a tangent discontinuity at curve(t) and the agnle between the two tangents is > KinkAngleDegrees
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsTangentKink(
	Curve curve,
	double t
)
Public Function IsTangentKink (
	curve As Curve,
	t As Double
) As Boolean
Parameters
curve
Type: Rhino.Geometry.Curve
t
Type: System.Double
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.CurveKinkDefinition.IsTangentKink(Rhino.Geometry.Curve,System.Double)"]
See Also
Reference
CurveKinkDefinition Class
IsTangentKink Overload
Rhino.Geometry Namespace