RhinoCommon API
PageViewGroupTable.GetUnusedName Method (String)
 Gets an unused page view group name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string GetUnusedName(
	string rootName
)
Public Function GetUnusedName (
	rootName As String
) As String
Parameters
rootName
Type: System.String
The name's root or prefix.
Return Value
Type: String
An unused page view group name
See Also
Reference
PageViewGroupTable Class
GetUnusedName Overload
Rhino.DocObjects.Tables Namespace