RhinoCommon API
SimpleArrayByte.CopyTo Method
 Copies the contents of a SimpleArrayByte into another SimpleArrayByte.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void CopyTo(
	SimpleArrayByte other
)
Public Sub CopyTo (
	other As SimpleArrayByte
)
Parameters
other
Type: Rhino.Runtime.InteropWrappers.SimpleArrayByte
[Missing <param name="other"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayByte.CopyTo(Rhino.Runtime.InteropWrappers.SimpleArrayByte)"]
See Also
Reference
SimpleArrayByte Class
Rhino.Runtime.InteropWrappers Namespace