RhinoCommon API
BrepFace.DraftAnglePoint Method
 Returns the surface draft angle and point at a parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DraftAnglePoint(
	Point2d testPoint,
	double testAngle,
	Vector3d pullDirection,
	bool edge,
	out Point3d draftPoint,
	out double draftAngle
)
Public Function DraftAnglePoint (
	testPoint As Point2d,
	testAngle As Double,
	pullDirection As Vector3d,
	edge As Boolean,
	<OutAttribute> ByRef draftPoint As Point3d,
	<OutAttribute> ByRef draftAngle As Double
) As Boolean
Parameters
testPoint
Type: Rhino.Geometry.Point2d
The u,v parameter on the face to evaluate.
testAngle
Type: System.Double
The angle in radians to test.
pullDirection
Type: Rhino.Geometry.Vector3d
The pull direction.
edge
Type: System.Boolean
Restricts the point placement to an edge.
draftPoint
Type: Rhino.Geometry.Point3d
The draft angle point.
draftAngle
Type: System.Double
The draft angle in radians.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace