RhinoCommon API
MeshClash.Search Method (IEnumerable<RhinoObject>, IEnumerable<RhinoObject>, Double, MeshType, MeshingParameters)
 Searches for locations where the distance from a RhinoObject, in one set of objects, is less than the specified distance to another RhinoObject in a second set of objects. This function uses the object's mesh to calculate the interferences. Acceptable object types include: BrepObject, ExtrusionObject, MeshObject, and SubDObject.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static MeshInterference[] Search(
	IEnumerable<RhinoObject> setA,
	IEnumerable<RhinoObject> setB,
	double distance,
	MeshType meshType,
	MeshingParameters meshingParameters
)
Public Shared Function Search (
	setA As IEnumerable(Of RhinoObject),
	setB As IEnumerable(Of RhinoObject),
	distance As Double,
	meshType As MeshType,
	meshingParameters As MeshingParameters
) As MeshInterference()
Parameters
setA
Type: System.Collections.Generic.IEnumerable<RhinoObject>
The first set of Rhino objects.
setB
Type: System.Collections.Generic.IEnumerable<RhinoObject>
The second set of Rhino objects.
distance
Type: System.Double
The largest distance at which a clash can occur.
meshType
Type: Rhino.Geometry.MeshType
The type of mesh to be used for the calculation.
meshingParameters
Type: Rhino.Geometry.MeshingParameters
The meshing parameters used to generate meshes for the calculation.
Return Value
Type: MeshInterference[]
An array of mesh interference object if successful, or an empty array on failure.
See Also
Reference
MeshClash Class
Search Overload
Rhino.Geometry.Intersect Namespace