RhinoCommon API
SubDEdge.GetSharpness Method (Boolean)
 Gets the sharpness of this edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDEdgeSharpness GetSharpness(
	bool useCreaseSharpness
)
Public Function GetSharpness (
	useCreaseSharpness As Boolean
) As SubDEdgeSharpness
Parameters
useCreaseSharpness
Type: System.Boolean
 If this edge is a crease and useCreaseSharpness is true, then Crease is returned. If it is a crease and useCreaseSharpness is false, then Smooth is returned.
Return Value
Type: SubDEdgeSharpness
 The sharpness of a smooth edge, Crease for a crease edge when useCreaseSharpness is true, and Smooth in every other case.
See Also
Reference
SubDEdge Class
GetSharpness Overload
Rhino.Geometry Namespace