RhinoCommon API
SupportOptions.BlockContent_SetInitialLocationCustomFolder Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.BlockContent_SetInitialLocationCustomFolder(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void BlockContent_SetInitialLocationCustomFolder(
	string path
)
Public Shared Sub BlockContent_SetInitialLocationCustomFolder (
	path As String
)
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.Render.SupportOptions.BlockContent_SetInitialLocationCustomFolder(System.String)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace