RhinoCommon API
IStackedDialogPageService.GetImageHandle Method (Icon, Boolean)
 Convert image to platform specific unmanaged pointer
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
IntPtr GetImageHandle(
	Icon icon,
	bool canBeNull
)
Function GetImageHandle (
	icon As Icon,
	canBeNull As Boolean
) As IntPtr
Parameters
icon
Type: System.Drawing.Icon
[Missing <param name="icon"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetImageHandle(System.Drawing.Icon,System.Boolean)"]
canBeNull
Type: System.Boolean
[Missing <param name="canBeNull"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetImageHandle(System.Drawing.Icon,System.Boolean)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.GetImageHandle(System.Drawing.Icon,System.Boolean)"]
See Also
Reference
IStackedDialogPageService Interface
GetImageHandle Overload
Rhino.UI Namespace