RhinoCommon API
Material Constructor
Initializes a new instance of the Material class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Material()
Public Sub New
See Also
Reference
Material Class
Material Overload
Rhino.DocObjects Namespace