RhinoCommon API
HostUtils.GetPrinterFormSize Method
 Get the size of a sheet for a given form name / printer combination
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool GetPrinterFormSize(
	string printerName,
	string formName,
	out double widthMillimeters,
	out double heightMillimeters
)
Public Shared Function GetPrinterFormSize (
	printerName As String,
	formName As String,
	<OutAttribute> ByRef widthMillimeters As Double,
	<OutAttribute> ByRef heightMillimeters As Double
) As Boolean
Parameters
printerName
Type: System.String
[Missing <param name="printerName"/> documentation for "M:Rhino.Runtime.HostUtils.GetPrinterFormSize(System.String,System.String,System.Double@,System.Double@)"]
formName
Type: System.String
[Missing <param name="formName"/> documentation for "M:Rhino.Runtime.HostUtils.GetPrinterFormSize(System.String,System.String,System.Double@,System.Double@)"]
widthMillimeters
Type: System.Double
[Missing <param name="widthMillimeters"/> documentation for "M:Rhino.Runtime.HostUtils.GetPrinterFormSize(System.String,System.String,System.Double@,System.Double@)"]
heightMillimeters
Type: System.Double
[Missing <param name="heightMillimeters"/> documentation for "M:Rhino.Runtime.HostUtils.GetPrinterFormSize(System.String,System.String,System.Double@,System.Double@)"]
Return Value
Type: Boolean
true on success
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace