RhinoCommon API
RhinoObject.DeleteHistoryRecord Method
 For expert use only. Deletes existing history record
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool DeleteHistoryRecord()
Public Function DeleteHistoryRecord As Boolean
Return Value
Type: Boolean
true if history record was purged
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace