RhinoCommon API
Surface.ToNurbsSurface Method
 Gets a NURBS surface representation of this surface. Default tolerance of 0.0 is used.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public NurbsSurface ToNurbsSurface()
Public Function ToNurbsSurface As NurbsSurface
Return Value
Type: NurbsSurface
NurbsSurface on success, null on failure.
See Also
Reference
Surface Class
ToNurbsSurface Overload
Rhino.Geometry Namespace