RhinoCommon API
DisplayMaterial Constructor (Material)
Initializes a new instance of the DisplayMaterial class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DisplayMaterial(
	Material material
)
Public Sub New (
	material As Material
)
Parameters
material
Type: Rhino.DocObjects.Material
[Missing <param name="material"/> documentation for "M:Rhino.Display.DisplayMaterial.#ctor(Rhino.DocObjects.Material)"]
See Also
Reference
DisplayMaterial Class
DisplayMaterial Overload
Rhino.Display Namespace