RhinoCommon API
Mesh.CreateFromSubD Method (SubD, Int32)
 Create a mesh from a SubD limit surface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Mesh CreateFromSubD(
	SubD subd,
	int displayDensity
)
Public Shared Function CreateFromSubD (
	subd As SubD,
	displayDensity As Integer
) As Mesh
Parameters
subd
Type: Rhino.Geometry.SubD
SubD to mesh
displayDensity
Type: System.Int32
 Adaptive display density value to use. If in doubt, pass DefaultDensity: this is what the cache uses.
Return Value
Type: Mesh
New mesh representing the SubD
See Also
Reference
Mesh Class
CreateFromSubD Overload
Rhino.Geometry Namespace
SubD.UpdateSurfaceMeshCache(Boolean)