RhinoCommon API
RenderContentCollection.Count Method
 The number of items in the collection.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Count()
Public Function Count As Integer
Return Value
Type: Int32
The number of items in the collection.
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace