RhinoCommon API
WorksessionModel.ToString Method
 Returns the model's alias, or its path when it has no alias.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.WorksessionModel.ToString"]
See Also
Reference
WorksessionModel Class
Rhino.DocObjects Namespace