RhinoCommon API
PostEffectExecutionControl.ReadyToExecutePostEffect Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffectExecutionControl.ReadyToExecutePostEffect(System.Guid)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public abstract bool ReadyToExecutePostEffect(
	Guid pep_id
)
Public MustOverride Function ReadyToExecutePostEffect (
	pep_id As Guid
) As Boolean
Parameters
pep_id
Type: System.Guid
[Missing <param name="pep_id"/> documentation for "M:Rhino.Render.PostEffects.PostEffectExecutionControl.ReadyToExecutePostEffect(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectExecutionControl.ReadyToExecutePostEffect(System.Guid)"]
See Also
Reference
PostEffectExecutionControl Class
Rhino.Render.PostEffects Namespace