RhinoCommon API
UserInterfaceGrid.GetColumnWidth Method
 Width of a column in logical pixels as of the most recent layout. This is 0 until the grid has been drawn once.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double GetColumnWidth(
	int column
)
Public Function GetColumnWidth (
	column As Integer
) As Double
Parameters
column
Type: System.Int32
[Missing <param name="column"/> documentation for "M:Rhino.UI.UserInterfaceGrid.GetColumnWidth(System.Int32)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.UI.UserInterfaceGrid.GetColumnWidth(System.Int32)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace