RhinoCommon API
StackedDialogPage.SetEnglishPageTitle Method
 Change the title passed to the constructor and, this will cause LocalPageTitle to get called also.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetEnglishPageTitle(
	string newPageTile
)
Public Sub SetEnglishPageTitle (
	newPageTile As String
)
Parameters
newPageTile
Type: System.String
[Missing <param name="newPageTile"/> documentation for "M:Rhino.UI.StackedDialogPage.SetEnglishPageTitle(System.String)"]
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace