RhinoCommon API
NurbsCurve.CreateFromCircle Method (Circle, Int32, Int32)
 Create a uniform non-rational cubic NURBS approximation of a circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static NurbsCurve CreateFromCircle(
	Circle circle,
	int degree,
	int cvCount
)
Public Shared Function CreateFromCircle (
	circle As Circle,
	degree As Integer,
	cvCount As Integer
) As NurbsCurve
Parameters
circle
Type: Rhino.Geometry.Circle
[Missing <param name="circle"/> documentation for "M:Rhino.Geometry.NurbsCurve.CreateFromCircle(Rhino.Geometry.Circle,System.Int32,System.Int32)"]
degree
Type: System.Int32
>=1
cvCount
Type: System.Int32
CV count >=5
Return Value
Type: NurbsCurve
NURBS curve approximation of a circle on success
See Also
Reference
NurbsCurve Class
CreateFromCircle Overload
Rhino.Geometry Namespace