RhinoCommon API
BrepFaceList.SplitKinkyFaces Method
 Splits any faces with creases into G1 pieces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SplitKinkyFaces()
Public Function SplitKinkyFaces As Boolean
Return Value
Type: Boolean
true on success, false on failure.
Remarks
If you need to detect whether splitting occurred, compare the before and after values of Faces.Count
See Also
Reference
BrepFaceList Class
SplitKinkyFaces Overload
Rhino.Geometry.Collections Namespace