RhinoCommon API
FileImportPlugIn Constructor
Initializes a new instance of the FileImportPlugIn class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected FileImportPlugIn()
Protected Sub New
See Also
Reference
FileImportPlugIn Class
Rhino.PlugIns Namespace