RhinoCommon API
Extrusion.GetBrepFormComponentIndex Method
 Convert a component index that identifies a part of this extrusion to a component index that identifies a part of the Brep created by Extrusion.ToBrep(false).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.1
Syntax
public ComponentIndex GetBrepFormComponentIndex(
	ComponentIndex extrusionComponentIndex
)
Public Function GetBrepFormComponentIndex (
	extrusionComponentIndex As ComponentIndex
) As ComponentIndex
Parameters
extrusionComponentIndex
Type: Rhino.Geometry.ComponentIndex
The extrusion component index.
Return Value
Type: ComponentIndex
The Brep component index if successful. Otherwise, Unset is returned.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace