RhinoCommon API
HostUtils.GetPrinterFormMargins Method
 Get limit margins for a given form (page size) and a given printer. This is the physical limit area that a printer can print on a given page
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public static bool GetPrinterFormMargins(
	string printerName,
	string formName,
	bool portrait,
	out double leftMillimeters,
	out double topMillimeters,
	out double rightMillimeters,
	out double bottomMillimeters
)
Public Shared Function GetPrinterFormMargins (
	printerName As String,
	formName As String,
	portrait As Boolean,
	<OutAttribute> ByRef leftMillimeters As Double,
	<OutAttribute> ByRef topMillimeters As Double,
	<OutAttribute> ByRef rightMillimeters As Double,
	<OutAttribute> ByRef bottomMillimeters As Double
) As Boolean
Parameters
printerName
Type: System.String
[Missing <param name="printerName"/> documentation for "M:Rhino.Runtime.HostUtils.GetPrinterFormMargins(System.String,System.String,System.Boolean,System.Double@,System.Double@,System.Double@,System.Double@)"]
formName
Type: System.String
[Missing <param name="formName"/> documentation for "M:Rhino.Runtime.HostUtils.GetPrinterFormMargins(System.String,System.String,System.Boolean,System.Double@,System.Double@,System.Double@,System.Double@)"]
portrait
Type: System.Boolean
[Missing <param name="portrait"/> documentation for "M:Rhino.Runtime.HostUtils.GetPrinterFormMargins(System.String,System.String,System.Boolean,System.Double@,System.Double@,System.Double@,System.Double@)"]
leftMillimeters
Type: System.Double
[Missing <param name="leftMillimeters"/> documentation for "M:Rhino.Runtime.HostUtils.GetPrinterFormMargins(System.String,System.String,System.Boolean,System.Double@,System.Double@,System.Double@,System.Double@)"]
topMillimeters
Type: System.Double
[Missing <param name="topMillimeters"/> documentation for "M:Rhino.Runtime.HostUtils.GetPrinterFormMargins(System.String,System.String,System.Boolean,System.Double@,System.Double@,System.Double@,System.Double@)"]
rightMillimeters
Type: System.Double
[Missing <param name="rightMillimeters"/> documentation for "M:Rhino.Runtime.HostUtils.GetPrinterFormMargins(System.String,System.String,System.Boolean,System.Double@,System.Double@,System.Double@,System.Double@)"]
bottomMillimeters
Type: System.Double
[Missing <param name="bottomMillimeters"/> documentation for "M:Rhino.Runtime.HostUtils.GetPrinterFormMargins(System.String,System.String,System.Boolean,System.Double@,System.Double@,System.Double@,System.Double@)"]
Return Value
Type: Boolean
true on success
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace