RhinoCommon API
FileTxtReadOptions Constructor
Initializes a new instance of the FileTxtReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileTxtReadOptions()
Public Sub New
See Also
Reference
FileTxtReadOptions Class
Rhino.FileIO Namespace