RhinoCommon API
FilePdf.Write Method (String)
 Write PDF to a file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract void Write(
	string filename
)
Public MustOverride Sub Write (
	filename As String
)
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.FileIO.FilePdf.Write(System.String)"]
See Also
Reference
FilePdf Class
Write Overload
Rhino.FileIO Namespace