RhinoCommon API
ObjectTable.AddTextDot Method (String, Point3d, ObjectAttributes)
Adds a text dot object to Rhino.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddTextDot(
	string text,
	Point3d location,
	ObjectAttributes attributes
)
Public Function AddTextDot (
	text As String,
	location As Point3d,
	attributes As ObjectAttributes
) As Guid
Parameters
text
Type: System.String
A text string.
location
Type: Rhino.Geometry.Point3d
A point position.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to curve.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddTextDot Overload
Rhino.DocObjects.Tables Namespace