RhinoCommon API
SupportOptions.FileExplorer_InitialLocation Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.FileExplorer_InitialLocation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static SupportOptions.RdkInitialLocation FileExplorer_InitialLocation()
Public Shared Function FileExplorer_InitialLocation As SupportOptions.RdkInitialLocation
Return Value
Type: SupportOptions.RdkInitialLocation
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.FileExplorer_InitialLocation"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace