RhinoCommon API
PersistentSettingsConverter.TryParseStringList Method
 Attempts to convert a string to a string value list.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool TryParseStringList(
	string s,
	out string[] value
)
Public Shared Function TryParseStringList (
	s As String,
	<OutAttribute> ByRef value As String()
) As Boolean
Parameters
s
Type: System.String
String to parse
value
Type: System.String[]
 Result will get copied here, if the string is null or empty then this will be an empty list, if there was an error parsing then this will be null otherwise it will be the string parsed as a list.
Return Value
Type: Boolean
 Returns true if the string is not empty and properly formatted as a string list otherwise returns false.
See Also
Reference
PersistentSettingsConverter Class
Rhino Namespace