RhinoCommon API
StdVectorFloat Constructor (StdVectorFloat)
 Initializes a new StdVectorFloat with the contents of another SimpleArrayFloat.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.26
Syntax
public StdVectorFloat(
	StdVectorFloat other
)
Public Sub New (
	other As StdVectorFloat
)
Parameters
other
Type: Rhino.Runtime.InteropWrappers.StdVectorFloat
[Missing <param name="other"/> documentation for "M:Rhino.Runtime.InteropWrappers.StdVectorFloat.#ctor(Rhino.Runtime.InteropWrappers.StdVectorFloat)"]
See Also
Reference
StdVectorFloat Class
StdVectorFloat Overload
Rhino.Runtime.InteropWrappers Namespace