RhinoCommon API
Mesh.DiscreteGaussianCurvatures Method
 Compute the (discrete) Gaussian curvatures of the mesh vertices. This method computes the discrete Gaussian curvatures, by taking the angle defects at each vertex and dividing them by the face areas, and taking care of the mesh topology. This method will not yield meaningful values on nonmanifold vertices.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public double[] DiscreteGaussianCurvatures()
Public Function DiscreteGaussianCurvatures As Double()
Return Value
Type: Double[]
An array of curvatures whose size is the vertex count on success, or null on failure.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace