RhinoCommon API
RadialDimension.Create Method
 Initialize Dimension parameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RadialDimension Create(
	DimensionStyle dimStyle,
	AnnotationType dimtype,
	Plane plane,
	Point3d centerpoint,
	Point3d radiuspoint,
	Point3d dimlinepoint
)
Public Shared Function Create (
	dimStyle As DimensionStyle,
	dimtype As AnnotationType,
	plane As Plane,
	centerpoint As Point3d,
	radiuspoint As Point3d,
	dimlinepoint As Point3d
) As RadialDimension
Parameters
dimStyle
Type: Rhino.DocObjects.DimensionStyle
Dimension's dimstyle
dimtype
Type: Rhino.Geometry.AnnotationType
AnnotationType.Diameter or AnnotationType.Radius
plane
Type: Rhino.Geometry.Plane
Dimension's plane
centerpoint
Type: Rhino.Geometry.Point3d
Dimension's center point
radiuspoint
Type: Rhino.Geometry.Point3d
Point on dimension radius
dimlinepoint
Type: Rhino.Geometry.Point3d
Point on dimension line
Return Value
Type: RadialDimension
[Missing <returns> documentation for "M:Rhino.Geometry.RadialDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.AnnotationType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace