RhinoCommon API
SimpleArrayUint.ToArray Method
 Returns the managed counterpart of the unmanaged array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint[] ToArray()
Public Function ToArray As UInteger()
Return Value
Type: UInt32[]
The managed array.
See Also
Reference
SimpleArrayUint Class
Rhino.Runtime.InteropWrappers Namespace