RhinoCommon API
DisplayPipeline.DrawParticles Method (ParticleSystem)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawParticles(Rhino.Geometry.ParticleSystem)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DrawParticles(
	ParticleSystem particles
)
Public Sub DrawParticles (
	particles As ParticleSystem
)
Parameters
particles
Type: Rhino.Geometry.ParticleSystem
[Missing <param name="particles"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawParticles(Rhino.Geometry.ParticleSystem)"]
See Also
Reference
DisplayPipeline Class
DrawParticles Overload
Rhino.Display Namespace