RhinoCommon API
ViewCaptureWriter.DrawPath Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[],Rhino.Runtime.ViewCaptureWriter.Pen,System.Boolean,Rhino.Display.ColorStop[],Rhino.Geometry.Point2d[],System.Double)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract void DrawPath(
	ViewCaptureWriter.PathPoint[] points,
	ViewCaptureWriter.Pen pen,
	bool linearGradient,
	ColorStop[] stops,
	Point2d[] gradientPoints,
	double pointScale
)
Protected MustOverride Sub DrawPath (
	points As ViewCaptureWriter.PathPoint(),
	pen As ViewCaptureWriter.Pen,
	linearGradient As Boolean,
	stops As ColorStop(),
	gradientPoints As Point2d(),
	pointScale As Double
)
Parameters
points
Type: Rhino.Runtime.ViewCaptureWriter.PathPoint[]
[Missing <param name="points"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[],Rhino.Runtime.ViewCaptureWriter.Pen,System.Boolean,Rhino.Display.ColorStop[],Rhino.Geometry.Point2d[],System.Double)"]
pen
Type: Rhino.Runtime.ViewCaptureWriter.Pen
[Missing <param name="pen"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[],Rhino.Runtime.ViewCaptureWriter.Pen,System.Boolean,Rhino.Display.ColorStop[],Rhino.Geometry.Point2d[],System.Double)"]
linearGradient
Type: System.Boolean
[Missing <param name="linearGradient"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[],Rhino.Runtime.ViewCaptureWriter.Pen,System.Boolean,Rhino.Display.ColorStop[],Rhino.Geometry.Point2d[],System.Double)"]
stops
Type: Rhino.Display.ColorStop[]
[Missing <param name="stops"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[],Rhino.Runtime.ViewCaptureWriter.Pen,System.Boolean,Rhino.Display.ColorStop[],Rhino.Geometry.Point2d[],System.Double)"]
gradientPoints
Type: Rhino.Geometry.Point2d[]
[Missing <param name="gradientPoints"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[],Rhino.Runtime.ViewCaptureWriter.Pen,System.Boolean,Rhino.Display.ColorStop[],Rhino.Geometry.Point2d[],System.Double)"]
pointScale
Type: System.Double
[Missing <param name="pointScale"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[],Rhino.Runtime.ViewCaptureWriter.Pen,System.Boolean,Rhino.Display.ColorStop[],Rhino.Geometry.Point2d[],System.Double)"]
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace