RhinoCommon API
ViewportInfo.GetFramePlaneCorners Method
 Gets the corners of the frame plane rectangle at specified depth. 4 points are returned in the order of bottom left, bottom right, top left, top right.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Point3d[] GetFramePlaneCorners(
	double depth
)
Public Function GetFramePlaneCorners (
	depth As Double
) As Point3d()
Parameters
depth
Type: System.Double
Distance from camera location.
Return Value
Type: Point3d[]
 Four corner points on success. Empty array if viewport is not valid.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace