RhinoCommon API
PersistentSettings.GetBool Method (String, Boolean)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetBool(System.String,System.Boolean)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool GetBool(
	string key,
	bool defaultValue
)
Public Function GetBool (
	key As String,
	defaultValue As Boolean
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetBool(System.String,System.Boolean)"]
defaultValue
Type: System.Boolean
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetBool(System.String,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetBool(System.String,System.Boolean)"]
See Also
Reference
PersistentSettings Class
GetBool Overload
Rhino Namespace