RhinoCommon API
InstanceDefinitionTable.Export Method
 Exports the block definition's component objects to one of the file formats supported by Rhino.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Export(
	int idefIndex,
	string filename
)
Public Function Export (
	idefIndex As Integer,
	filename As String
) As Boolean
Parameters
idefIndex
Type: System.Int32
Index of the instance definition to export.
filename
Type: System.String
Name of the file to create.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.Export(System.Int32,System.String)"]
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace