RhinoCommon API
SimpleArrayVector3d Constructor
 Initializes a new empty SimpleArrayVector3d instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SimpleArrayVector3d()
Public Sub New
See Also
Reference
SimpleArrayVector3d Class
SimpleArrayVector3d Overload
Rhino.Runtime.InteropWrappers Namespace