RhinoCommon API
DisplayPipeline.DrawLight Method
 Draws a light.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public void DrawLight(
	Light light,
	Color wireframeColor
)
Public Sub DrawLight (
	light As Light,
	wireframeColor As Color
)
Parameters
light
Type: Rhino.Geometry.Light
The light to draw.
wireframeColor
Type: System.Drawing.Color
The wireframe color.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace