RhinoCommon API
DisplayPipeline.DrawInstanceDefinition Method (InstanceDefinition, Transform)
 Draws an InstanceDefinition.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.15
Syntax
public void DrawInstanceDefinition(
	InstanceDefinition instanceDefinition,
	Transform xform
)
Public Sub DrawInstanceDefinition (
	instanceDefinition As InstanceDefinition,
	xform As Transform
)
Parameters
instanceDefinition
Type: Rhino.DocObjects.InstanceDefinition
The instance definition.
xform
Type: Rhino.Geometry.Transform
The transformation.
See Also
Reference
DisplayPipeline Class
DrawInstanceDefinition Overload
Rhino.Display Namespace