RhinoCommon API
ObjectTable.AddSubD Method (SubD)
Adds a SubD object to Rhino.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Guid AddSubD(
	SubD subD
)
Public Function AddSubD (
	subD As SubD
) As Guid
Parameters
subD
Type: Rhino.Geometry.SubD
A duplicate of this SubD is added to Rhino.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddSubD Overload
Rhino.DocObjects.Tables Namespace