RhinoCommon API
ObjRef.SelectionViewDetailSerialNumber Method
 If the object was interactively selected in a page space detail view, then SelectionViewDetailSerialNumber() returns the CRhinoObject serial number of the detail view object. Use SelectionView() to get the page view that contains the detail view object. If SelectionViewDetailSerialNumber() returns 0, then the selection did not happen in a detail view.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public uint SelectionViewDetailSerialNumber()
Public Function SelectionViewDetailSerialNumber As UInteger
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjRef.SelectionViewDetailSerialNumber"]
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace