RhinoCommon API
Surface.Evaluate Method
 Evaluates a surface mathematically.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Evaluate(
	double u,
	double v,
	int numberDerivatives,
	out Point3d point,
	out Vector3d[] derivatives
)
Public Function Evaluate (
	u As Double,
	v As Double,
	numberDerivatives As Integer,
	<OutAttribute> ByRef point As Point3d,
	<OutAttribute> ByRef derivatives As Vector3d()
) As Boolean
Parameters
u
Type: System.Double
A U parameter.
v
Type: System.Double
A V parameter.
numberDerivatives
Type: System.Int32
The number of derivatives.
point
Type: Rhino.Geometry.Point3d
A point. This out parameter will be assigned during this call.
derivatives
Type: Rhino.Geometry.Vector3d[]
A vector array. This out parameter will be assigned during this call. This can be null.
Return Value
Type: Boolean
true if the operation succeeded; false otherwise.
Remarks
 The partial derivatives will be in the order {Su, Sv} for numberDerivatives = 1, {Su, Sv, Suu, Suv, Svv} for 2, {Su, Sv, Suu, Suv, Svv, Suuu, Suuv, Suvv, Svvv} for 3, and similar for higher counts.
See Also
Reference
Surface Class
Rhino.Geometry Namespace