RhinoCommon API
RenderMeshProvider.Finalize Method
 Finalizer to ensure correctly implemented dispose pattern.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace