RhinoCommon API
PostEffectData.GetParameter Method
 Get an arbitrary parameter from this post effect by its name. If the parameter is not known to the post effect, the method will fail. Returns a variant object if successful or null on failure.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IConvertible GetParameter(
	string param_name
)
Public Function GetParameter (
	param_name As String
) As IConvertible
Parameters
param_name
Type: System.String
[Missing <param name="param_name"/> documentation for "M:Rhino.Render.PostEffects.PostEffectData.GetParameter(System.String)"]
Return Value
Type: IConvertible
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectData.GetParameter(System.String)"]
See Also
Reference
PostEffectData Class
Rhino.Render.PostEffects Namespace