RhinoCommon API
RhinoCore.RaiseIdle Method
 Raises the Idle event.
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void RaiseIdle()
Public Sub RaiseIdle
See Also
Reference
RhinoCore Class
Rhino.Runtime.InProcess Namespace