RhinoCommon API
RenderContent.AddAutomaticUserInterfaceSection Method
 Add a new automatic user interface section, Field values which include prompts will be automatically added to this section.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public bool AddAutomaticUserInterfaceSection(
	string caption,
	int id
)
Public Function AddAutomaticUserInterfaceSection (
	caption As String,
	id As Integer
) As Boolean
Parameters
caption
Type: System.String
Expandable tab caption.
id
Type: System.Int32
Tab id which may be used later on to reference this tab.
Return Value
Type: Boolean
 Returns true if the automatic tab section was added otherwise; returns false on error.
See Also
Reference
RenderContent Class
Rhino.Render Namespace