RhinoCommon API
FileCsvDocument.Save Method (String, Encoding)
 Writes the document to a file on disk using the specified encoding.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Save(
	string path,
	Encoding encoding
)
Public Sub Save (
	path As String,
	encoding As Encoding
)
Parameters
path
Type: System.String
The path of the file to write.
encoding
Type: System.Text.Encoding
 The character encoding to use, for example ASCII or UTF8. Note that UTF8 emits a byte order mark; use new UTF8Encoding(false) to write UTF-8 without one.
See Also
Reference
FileCsvDocument Class
Save Overload
Rhino.FileIO Namespace