RhinoCommon API
DisplayPipeline.PopModelTransform Method
 Pop a model transformation off the engine's model transform stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void PopModelTransform()
Public Sub PopModelTransform
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace