RhinoCommon API
UserInterfaceGrid.InsertChild Method
 Insert a control at a cell index, shifting the controls after it along.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void InsertChild(
	UserInterfaceControl child,
	int index
)
Public Sub InsertChild (
	child As UserInterfaceControl,
	index As Integer
)
Parameters
child
Type: Rhino.UI.UserInterfaceControl
[Missing <param name="child"/> documentation for "M:Rhino.UI.UserInterfaceGrid.InsertChild(Rhino.UI.UserInterfaceControl,System.Int32)"]
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.UserInterfaceGrid.InsertChild(Rhino.UI.UserInterfaceControl,System.Int32)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace