RhinoCommon API
Mesh.CreateFromPlanarBoundary Method (Curve, MeshingParameters, Double)
 Attempts to construct a mesh from a closed planar curve.RhinoMakePlanarMeshes
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Mesh CreateFromPlanarBoundary(
	Curve boundary,
	MeshingParameters parameters,
	double tolerance
)
Public Shared Function CreateFromPlanarBoundary (
	boundary As Curve,
	parameters As MeshingParameters,
	tolerance As Double
) As Mesh
Parameters
boundary
Type: Rhino.Geometry.Curve
must be a closed planar curve.
parameters
Type: Rhino.Geometry.MeshingParameters
parameters used for creating the mesh.
tolerance
Type: System.Double
Tolerance to use during operation.
Return Value
Type: Mesh
 New mesh on success or null on failure.
See Also
Reference
Mesh Class
CreateFromPlanarBoundary Overload
Rhino.Geometry Namespace