RhinoCommon API
MeshNgonList.IsValid Method (Int32, TextLog)
 Tests an ngon to see if the vertex and face references are valid and pass partial boundary validity checks.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint IsValid(
	int index,
	TextLog textLog
)
Public Function IsValid (
	index As Integer,
	textLog As TextLog
) As UInteger
Parameters
index
Type: System.Int32
The index of the ngon to test.
textLog
Type: Rhino.FileIO.TextLog
A text log for collecting information about problems.
Return Value
Type: UInt32
0 if the ngon is not valid, otherwise the number of boundary edges.
Remarks
If the return value is > MeshNgon.BoundaryVertexCount, then the ngon has either inner boundaries or duplicate vertices.
See Also
Reference
MeshNgonList Class
IsValid Overload
Rhino.Geometry.Collections Namespace