RhinoCommon API
DisplayDeviceInfo.GpuDeviceInfos Method
 Get a list of GpuDeviceInfo for GPUs found on this machine.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public static List<GpuDeviceInfo> GpuDeviceInfos()
Public Shared Function GpuDeviceInfos As List(Of GpuDeviceInfo)
Return Value
Type: List<GpuDeviceInfo>
List of GpuDeviceInfo
See Also
Reference
DisplayDeviceInfo Class
Rhino Namespace