RhinoCommon API
SubDCreationOptions Constructor
 Create default options
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDCreationOptions()
Public Sub New
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace