RhinoCommon API
UserDataListEnumerator.Reset Method
 Reset the enumerator
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Reset()
Public Sub Reset
Implements
IEnumerator.Reset()
See Also
Reference
UserDataListEnumerator Class
Rhino.DocObjects.Custom Namespace