RhinoCommon API
DrawingUtilities.CreateMeshPreviewImage Method (Mesh, Color, Size)
 Creates a preview image of a mesh.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Bitmap CreateMeshPreviewImage(
	Mesh mesh,
	Color color,
	Size size
)
Public Shared Function CreateMeshPreviewImage (
	mesh As Mesh,
	color As Color,
	size As Size
) As Bitmap
Parameters
mesh
Type: Rhino.Geometry.Mesh
The mesh.
color
Type: System.Drawing.Color
The draw color.
size
Type: System.Drawing.Size
The size of the preview image.
Return Value
Type: Bitmap
A bitmap if successful, null otherwise.
See Also
Reference
DrawingUtilities Class
CreateMeshPreviewImage Overload
Rhino.UI Namespace