RhinoCommon API
RhinoDocUndoRecord.Dispose Method
 IDisposable implementaton
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.23
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RhinoDocUndoRecord Class
Rhino Namespace