RhinoCommon API
Vector2f.Addition Operator (Vector2f, Vector2f)
 Computes the sum between two vectors.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector2f operator +(
	Vector2f a,
	Vector2f b
)
Public Shared Operator + (
	a As Vector2f,
	b As Vector2f
) As Vector2f
Parameters
a
Type: Rhino.Geometry.Vector2f
First vector.
b
Type: Rhino.Geometry.Vector2f
Second vector.
Return Value
Type: Vector2f
The difference.
See Also
Reference
Vector2f Structure
Addition Overload
Rhino.Geometry Namespace