RhinoCommon API
ObjRef Constructor (RhinoDoc, Guid)
 Initializes a new object reference from a globally unique identifier (Guid).
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public ObjRef(
	RhinoDoc doc,
	Guid id
)
Public Sub New (
	doc As RhinoDoc,
	id As Guid
)
Parameters
doc
Type: Rhino.RhinoDoc
The Rhino document
id
Type: System.Guid
The ID.
See Also
Reference
ObjRef Class
ObjRef Overload
Rhino.DocObjects Namespace