RhinoCommon API
NamedViewTable.RestoreAnimatedConstantTime Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimatedConstantTime(System.Int32,Rhino.Display.RhinoViewport,System.Int32,System.Int32)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool RestoreAnimatedConstantTime(
	int index,
	RhinoViewport viewport,
	int frames,
	int ms_delay
)
Public Function RestoreAnimatedConstantTime (
	index As Integer,
	viewport As RhinoViewport,
	frames As Integer,
	ms_delay As Integer
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimatedConstantTime(System.Int32,Rhino.Display.RhinoViewport,System.Int32,System.Int32)"]
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimatedConstantTime(System.Int32,Rhino.Display.RhinoViewport,System.Int32,System.Int32)"]
frames
Type: System.Int32
[Missing <param name="frames"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimatedConstantTime(System.Int32,Rhino.Display.RhinoViewport,System.Int32,System.Int32)"]
ms_delay
Type: System.Int32
[Missing <param name="ms_delay"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimatedConstantTime(System.Int32,Rhino.Display.RhinoViewport,System.Int32,System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimatedConstantTime(System.Int32,Rhino.Display.RhinoViewport,System.Int32,System.Int32)"]
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace