RhinoCommon API
CustomObjectGrips.NurbsSurface Method
 If the grips control a NURBS surface, this returns a pointer to that surface. You can look at but you must NEVER change this surface. Return a surface held in a field, never a temporary: Rhino keeps the underlying pointer after this call returns.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual NurbsSurface NurbsSurface()
Protected Overridable Function NurbsSurface As NurbsSurface
Return Value
Type: NurbsSurface
A pointer to a NURBS surface or null.
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace