RhinoCommon API
ObjectTable.AddExplodedInstancePieces Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddExplodedInstancePieces(Rhino.DocObjects.InstanceObject,System.Boolean,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public Guid[] AddExplodedInstancePieces(
	InstanceObject instance,
	bool explodeNestedInstances = true,
	bool deleteInstance = false
)
Public Function AddExplodedInstancePieces (
	instance As InstanceObject,
	Optional explodeNestedInstances As Boolean = true,
	Optional deleteInstance As Boolean = false
) As Guid()
Parameters
instance
Type: Rhino.DocObjects.InstanceObject
[Missing <param name="instance"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddExplodedInstancePieces(Rhino.DocObjects.InstanceObject,System.Boolean,System.Boolean)"]
explodeNestedInstances (Optional)
Type: System.Boolean
[Missing <param name="explodeNestedInstances"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddExplodedInstancePieces(Rhino.DocObjects.InstanceObject,System.Boolean,System.Boolean)"]
deleteInstance (Optional)
Type: System.Boolean
[Missing <param name="deleteInstance"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddExplodedInstancePieces(Rhino.DocObjects.InstanceObject,System.Boolean,System.Boolean)"]
Return Value
Type: Guid[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddExplodedInstancePieces(Rhino.DocObjects.InstanceObject,System.Boolean,System.Boolean)"]
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace