RhinoCommon API
Curve.InflectionPoints Method (Double[])
 Returns a curve's inflection points. An inflection point is a location on a curve at which the sign of the curvature (i.e., the concavity) changes. The curvature at these locations is always 0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public Point3d[] InflectionPoints(
	out double[] curveParameters
)
Public Function InflectionPoints (
	<OutAttribute> ByRef curveParameters As Double()
) As Point3d()
Parameters
curveParameters
Type: System.Double[]
An array of curve parameters at the inflection points.
Return Value
Type: Point3d[]
An array of points if successful, null if not successful or on error.
See Also
Reference
Curve Class
InflectionPoints Overload
Rhino.Geometry Namespace