RhinoCommon API
DracoCompression.DecompressBase64String Method
 Decompress base64 encoded version of Draco data into either a mesh or point cloud
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static GeometryBase DecompressBase64String(
	string encoded
)
Public Shared Function DecompressBase64String (
	encoded As String
) As GeometryBase
Parameters
encoded
Type: System.String
compressed Draco data
Return Value
Type: GeometryBase
Mesh or point cloud on success. null on failure
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace