RhinoCommon API
GumballAppearanceSettings Constructor
Initializes a new instance of the GumballAppearanceSettings class
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GumballAppearanceSettings()
Public Sub New
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace