RhinoCommon API
Cylinder.CircleAt Method
 Compute the circle at the given elevation parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Circle CircleAt(
	double linearParameter
)
Public Function CircleAt (
	linearParameter As Double
) As Circle
Parameters
linearParameter
Type: System.Double
Height parameter for circle section.
Return Value
Type: Circle
[Missing <returns> documentation for "M:Rhino.Geometry.Cylinder.CircleAt(System.Double)"]
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace