RhinoCommon API
ViewCaptureSettings.Save Method
[Missing <summary> documentation for "M:Rhino.Display.ViewCaptureSettings.Save(System.String,Rhino.PersistentSettings)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.1
Syntax
public void Save(
	string name,
	PersistentSettings settings
)
Public Sub Save (
	name As String,
	settings As PersistentSettings
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Display.ViewCaptureSettings.Save(System.String,Rhino.PersistentSettings)"]
settings
Type: Rhino.PersistentSettings
[Missing <param name="settings"/> documentation for "M:Rhino.Display.ViewCaptureSettings.Save(System.String,Rhino.PersistentSettings)"]
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace