RhinoCommon API
PlugIn.GetCommands Method
 All of the commands associated with this plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Command[] GetCommands()
Public Function GetCommands As Command()
Return Value
Type: Command[]
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.GetCommands"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace