RhinoCommon API
CustomRenderMeshProvider Constructor
 Default constructor
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CustomRenderMeshProvider()
Protected Sub New
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace