RhinoCommon API
LengthMassProperties.Sum Method (LengthMassProperties)
 Sum mass properties together to get an aggregate mass.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Sum(
	LengthMassProperties summand
)
Public Function Sum (
	summand As LengthMassProperties
) As Boolean
Parameters
summand
Type: Rhino.Geometry.LengthMassProperties
mass properties to add.
Return Value
Type: Boolean
true if successful.
See Also
Reference
LengthMassProperties Class
Sum Overload
Rhino.Geometry Namespace