RhinoCommon API
PickContext Constructor
Initializes a new instance of the PickContext class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PickContext()
Public Sub New
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace