RhinoCommon API
PersistentSettings.TryGetDefault Method (String, Color)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Drawing.Color@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetDefault(
	string key,
	out Color value
)
Public Function TryGetDefault (
	key As String,
	<OutAttribute> ByRef value As Color
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Drawing.Color@)"]
value
Type: System.Drawing.Color
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Drawing.Color@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Drawing.Color@)"]
See Also
Reference
PersistentSettings Class
TryGetDefault Overload
Rhino Namespace