RhinoCommon API
SimpleArrayInt.ToArray Method
 Returns the managed counterpart of the unmanaged array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int[] ToArray()
Public Function ToArray As Integer()
Return Value
Type: Int32[]
The managed array.
See Also
Reference
SimpleArrayInt Class
Rhino.Runtime.InteropWrappers Namespace