RhinoCommon API
PageViewGroup.GetMembers Method
 Get an array of all of the page views in this page view group.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RhinoPageView[] GetMembers()
Public Function GetMembers As RhinoPageView()
Return Value
Type: RhinoPageView[]
Array page views if successful, otherwise an empty array.
See Also
Reference
PageViewGroup Class
Rhino.DocObjects Namespace