RhinoCommon API
ViewCaptureSettings.SetWindowRect Method (Point2d, Point2d)
 Set the print area to a window selection based on two points in screen coordinates
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
public void SetWindowRect(
	Point2d screenPoint1,
	Point2d screenPoint2
)
Public Sub SetWindowRect (
	screenPoint1 As Point2d,
	screenPoint2 As Point2d
)
Parameters
screenPoint1
Type: Rhino.Geometry.Point2d
 first point; it doesn't matter what corner of the rectangle this point represents
screenPoint2
Type: Rhino.Geometry.Point2d
point representing opposite corner of rectangle from screenPoint1
See Also
Reference
ViewCaptureSettings Class
SetWindowRect Overload
Rhino.Display Namespace