RhinoCommon API
ViewportInfo.GetViewScale Method
 Get scaling applied to this viewport projection. Reflected ceiling projections will return the values 1,1,-1
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double[] GetViewScale()
Public Function GetViewScale As Double()
Return Value
Type: Double[]
[Missing <returns> documentation for "M:Rhino.DocObjects.ViewportInfo.GetViewScale"]
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace