RhinoCommon API
Triangle3d.WithC Method
 Replace the C corner.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Triangle3d WithC(
	Point3d c
)
Public Function WithC (
	c As Point3d
) As Triangle3d
Parameters
c
Type: Rhino.Geometry.Point3d
[Missing <param name="c"/> documentation for "M:Rhino.Geometry.Triangle3d.WithC(Rhino.Geometry.Point3d)"]
Return Value
Type: Triangle3d
[Missing <returns> documentation for "M:Rhino.Geometry.Triangle3d.WithC(Rhino.Geometry.Point3d)"]
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace