RhinoCommon API
MeshExtruder.Dispose Method
 Dispose of this object and any unmanaged memory associated with it.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace