RhinoCommon API
MeshPrincipalCurvatureList.GetCurvatureStats Method
 Gets the mesh's curvature statistics.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public MeshCurvatureStats GetCurvatureStats(
	CurvatureStyle curvatureStyle
)
Public Function GetCurvatureStats (
	curvatureStyle As CurvatureStyle
) As MeshCurvatureStats
Parameters
curvatureStyle
Type: Rhino.Geometry.CurvatureStyle
The curvature style.
Return Value
Type: MeshCurvatureStats
The mesh's curvature statistics.
Remarks
 If the mesh carries no principal curvatures, the result is a zero range with Count 0 rather than an error.
See Also
Reference
MeshPrincipalCurvatureList Class
Rhino.Geometry.Collections Namespace