RhinoCommon API
ColorRGBA.GetHashCode Method
[Missing <summary> documentation for "M:Rhino.Display.ColorRGBA.GetHashCode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Display.ColorRGBA.GetHashCode"]
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace