RhinoCommon API
Squisher.SquishSurface Method (SquishParameters, Surface, IEnumerable<GeometryBase>, List<GeometryBase>)
 Squish the surface into a flat brep
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public Brep SquishSurface(
	SquishParameters sp,
	Surface surface,
	IEnumerable<GeometryBase> marks,
	List<GeometryBase> squished_marks_out
)
Public Function SquishSurface (
	sp As SquishParameters,
	surface As Surface,
	marks As IEnumerable(Of GeometryBase),
	squished_marks_out As List(Of GeometryBase)
) As Brep
Parameters
sp
Type: Rhino.Geometry.SquishParameters
The parameters for the squish operation
surface
Type: Rhino.Geometry.Surface
The surface to be squished
marks
Type: System.Collections.Generic.IEnumerable<GeometryBase>
Point, PountCloud, TextDot, and Curve objects to squish. Can be null.
squished_marks_out
Type: System.Collections.Generic.List<GeometryBase>
A list of the squished marks, with null entries for marks that fail to squish. Can be null.
Return Value
Type: Brep
A brep representing the flattened surface
Remarks
NB: If you are using this function from Grasshopper, which does not have a type that can hold a trimmed surface, you will need to pass a Brep to your component and get the face of interest from this Brep into this function. Otherwise you will lose all trimming information. Example: `brep_out = SquishSurface(sp, brep.Faces[0], marks_in, marks_out)`
See Also
Reference
Squisher Class
SquishSurface Overload
Rhino.Geometry Namespace