RhinoCommon API
IRhRdkContentThumbnail.GroupId Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnail.GroupId"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
Guid GroupId()
Function GroupId As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnail.GroupId"]
See Also
Reference
IRhRdkContentThumbnail Interface
Rhino.UI.Controls.ThumbnailUI Namespace