RhinoCommon API
Layer.PerViewportPlotWeight Method
 Gets the plot weight, in millimeters, for this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double PerViewportPlotWeight(
	Guid viewportId
)
Public Function PerViewportPlotWeight (
	viewportId As Guid
) As Double
Parameters
viewportId
Type: System.Guid
If not Guid.Empty, then the setting applies only to the viewport with the specified id.
Return Value
Type: Double
The plot color.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace