RhinoCommon API
SimulatedEnvironment.StringFromProjection Method
[Missing <summary> documentation for "M:Rhino.Render.SimulatedEnvironment.StringFromProjection(Rhino.Render.SimulatedEnvironment.BackgroundProjections)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public static string StringFromProjection(
	SimulatedEnvironment.BackgroundProjections projection
)
Public Shared Function StringFromProjection (
	projection As SimulatedEnvironment.BackgroundProjections
) As String
Parameters
projection
Type: Rhino.Render.SimulatedEnvironment.BackgroundProjections
[Missing <param name="projection"/> documentation for "M:Rhino.Render.SimulatedEnvironment.StringFromProjection(Rhino.Render.SimulatedEnvironment.BackgroundProjections)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.SimulatedEnvironment.StringFromProjection(Rhino.Render.SimulatedEnvironment.BackgroundProjections)"]
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace