RhinoCommon API
WorksessionFile.Dispose Method
Releases the native worksession.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace