RhinoCommon API
MouseState.IsMouseOver Method (Point3d)
 Test if the mouse is currently over a 3d location
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsMouseOver(
	Point3d point
)
Public Function IsMouseOver (
	point As Point3d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
Location to test
Return Value
Type: Boolean
true if the mouse is over point
See Also
Reference
MouseState Class
IsMouseOver Overload
Rhino.UI Namespace