RhinoCommon API
File3dm.FromByteArray Method
 Read a 3dm file from a byte array
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static File3dm FromByteArray(
	byte[] bytes
)
Public Shared Function FromByteArray (
	bytes As Byte()
) As File3dm
Parameters
bytes
Type: System.Byte[]
[Missing <param name="bytes"/> documentation for "M:Rhino.FileIO.File3dm.FromByteArray(System.Byte[])"]
Return Value
Type: File3dm
New File3dm on success, null on error.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace