RhinoCommon API
FileCsvDocument.TryGetColor Method (Int32, Int32, Color)
 Retrieves the value of a cell as a color from its 32-bit ARGB integer (FromArgb(Int32)), as written by Set(Int32, Int32, Color).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetColor(
	int column,
	int row,
	out Color value
)
Public Function TryGetColor (
	column As Integer,
	row As Integer,
	<OutAttribute> ByRef value As Color
) As Boolean
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.Drawing.Color
The parsed value, or Empty if the cell does not exist or cannot be parsed.
Return Value
Type: Boolean
true if the cell exists and was parsed; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetColor Overload
Rhino.FileIO Namespace