RhinoCommon API
GeneralSettings.GetDefaultState Method
 Gets the factory settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static GeneralSettingsState GetDefaultState()
Public Shared Function GetDefaultState As GeneralSettingsState
Return Value
Type: GeneralSettingsState
A new general state with factory settings.
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace