RhinoCommon API
RenderPrimitive.TryGetPlane Method
 Call this method to get a Plane primitive for this mesh. If this meshes PrimitiveType is not a Plane then the plane parameter is set to null.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool TryGetPlane(
	out PlaneSurface plane
)
Public Function TryGetPlane (
	<OutAttribute> ByRef plane As PlaneSurface
) As Boolean
Parameters
plane
Type: Rhino.Geometry.PlaneSurface
 Gets set to the plane primitive for this object on success or null on error.
Return Value
Type: Boolean
 Returns true if PrimitiveType is Plane and the plane parameter was initialized otherwise returns false.
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace