RhinoCommon API
BinaryArchiveReader.ReadVector3f Method
 Reads a Vector3f from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3f ReadVector3f()
Public Function ReadVector3f As Vector3f
Return Value
Type: Vector3f
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace