RhinoCommon API
SnapShotsClient.RestoreObject Method
 Called when the user restores a snapshot and SupportsObjects() and SupportsObject(Rhino.DocObjects.RhinoObject doc_object) returns true.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool RestoreObject(
	RhinoDoc doc,
	RhinoObject doc_object,
	ref Transform transform,
	BinaryArchiveReader archive
)
Public MustOverride Function RestoreObject (
	doc As RhinoDoc,
	doc_object As RhinoObject,
	ByRef transform As Transform,
	archive As BinaryArchiveReader
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
doc is the current document.
doc_object
Type: Rhino.DocObjects.RhinoObject
doc_obj is the current object.
transform
Type: Rhino.Geometry.Transform
transform is a transformation matrix. The matrix is set to identity the first time an object is associated with a snapshot. After that the matrix is updated when the object is transformed(scale, rotate etc.).
archive
Type: Rhino.FileIO.BinaryArchiveReader
archive is the archive to read the data from.
Return Value
Type: Boolean
true if successful, otherwise false.
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace