RhinoCommon API
RenderMeshProvider.RegisterProviders Method (Assembly, PlugIn)
 Register RenderMeshProviders without relying on the auto-plug-in registration
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void RegisterProviders(
	Assembly assembly,
	PlugIn plugin
)
Public Shared Sub RegisterProviders (
	assembly As Assembly,
	plugin As PlugIn
)
Parameters
assembly
Type: System.Reflection.Assembly
[Missing <param name="assembly"/> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshProvider.RegisterProviders(System.Reflection.Assembly,Rhino.PlugIns.PlugIn)"]
plugin
Type: Rhino.PlugIns.PlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshProvider.RegisterProviders(System.Reflection.Assembly,Rhino.PlugIns.PlugIn)"]
See Also
Reference
RenderMeshProvider Class
RegisterProviders Overload
Rhino.Render.CustomRenderMeshes Namespace