RhinoCommon API
FileCsvDocument.TryGetPoint Method
 Retrieves a row as a 3-D point. This succeeds only when ColumnCount is 3: the row's three fields are joined and passed to TryParse(String, Point3d).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetPoint(
	int row,
	out Point3d point
)
Public Function TryGetPoint (
	row As Integer,
	<OutAttribute> ByRef point As Point3d
) As Boolean
Parameters
row
Type: System.Int32
The zero-based row index (y).
point
Type: Rhino.Geometry.Point3d
The parsed point, or Unset if the row could not be parsed.
Return Value
Type: Boolean
true if the document has 3 columns and the row parsed as a point; otherwise false.
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace