RhinoCommon API
ICollapsibleSectionHolder.Add Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.Add(Rhino.UI.Controls.ICollapsibleSection)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void Add(
	ICollapsibleSection section
)
Sub Add (
	section As ICollapsibleSection
)
Parameters
section
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="section"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.Add(Rhino.UI.Controls.ICollapsibleSection)"]
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace