RhinoCommon API
StringHolder.GetString Method
 Gets managed string from unmanaged ON_wString pointer.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public static string GetString(
	IntPtr pStringHolder
)
Public Shared Function GetString (
	pStringHolder As IntPtr
) As String
Parameters
pStringHolder
Type: System.IntPtr
Return Value
Type: String
Null if pStringHolder has no reference, otherwise, the string. This may be an empty string, if setting an empty string is possible.
See Also
Reference
StringHolder Class
Rhino.Runtime.InteropWrappers Namespace