RhinoCommon API
ViewUserInterfaceTable.RemoveByGroupId Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.RemoveByGroupId(System.Guid)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int RemoveByGroupId(
	Guid userInterfaceGroupId
)
Public Function RemoveByGroupId (
	userInterfaceGroupId As Guid
) As Integer
Parameters
userInterfaceGroupId
Type: System.Guid
[Missing <param name="userInterfaceGroupId"/> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.RemoveByGroupId(System.Guid)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.RemoveByGroupId(System.Guid)"]
See Also
Reference
ViewUserInterfaceTable Class
Rhino.DocObjects.Tables Namespace