RhinoCommon API
Box Constructor (Plane, IEnumerable<Point3d>)
 Initializes the smallest box that contains a set of points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Box(
	Plane basePlane,
	IEnumerable<Point3d> points
)
Public Sub New (
	basePlane As Plane,
	points As IEnumerable(Of Point3d)
)
Parameters
basePlane
Type: Rhino.Geometry.Plane
Orientation of the box.
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to include, Invalid points will be ignored.
See Also
Reference
Box Structure
Box Overload
Rhino.Geometry Namespace