RhinoCommon API
File3dmLinetypeTable.FindIndex Method
 Retrieves a Linetype object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Linetype FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As Linetype
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: Linetype
A Linetype, or null if none was found.
See Also
Reference
File3dmLinetypeTable Class
Rhino.FileIO Namespace