RhinoCommon API
RhinoMath.Integrate Method (Func<Object, Int32, Double, Double, Double>, Object, Surface, Double, Double, Double)
[Missing <summary> documentation for "M:Rhino.RhinoMath.Integrate(System.Func{System.Object,System.Int32,System.Double,System.Double,System.Double},System.Object,Rhino.Geometry.Surface,System.Double,System.Double,System.Double@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double Integrate(
	Func<Object, int, double, double, double> integrandFunction,
	Object context,
	Surface surface,
	double relativeTolerance,
	double absoluteTolerance,
	out double errorBound
)
Public Shared Function Integrate (
	integrandFunction As Func(Of Object, Integer, Double, Double, Double),
	context As Object,
	surface As Surface,
	relativeTolerance As Double,
	absoluteTolerance As Double,
	<OutAttribute> ByRef errorBound As Double
) As Double
Parameters
integrandFunction
Type: System.Func<Object, Int32, Double, Double, Double>
context
Type: System.Object
surface
Type: Rhino.Geometry.Surface
relativeTolerance
Type: System.Double
absoluteTolerance
Type: System.Double
errorBound
Type: System.Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.RhinoMath.Integrate(System.Func{System.Object,System.Int32,System.Double,System.Double,System.Double},System.Object,Rhino.Geometry.Surface,System.Double,System.Double,System.Double@)"]
See Also
Reference
RhinoMath Class
Integrate Overload
Rhino Namespace