RhinoCommon API
Skin.OnBeginLoadPlugIn Method
Is called when a specific plug-in is going to be loaded.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnBeginLoadPlugIn(
	string description
)
Protected Overridable Sub OnBeginLoadPlugIn (
	description As String
)
Parameters
description
Type: System.String
The plug-in description.
See Also
Reference
Skin Class
Rhino.Runtime Namespace