RhinoCommon API
LightTable.FindNameHash Method
 Finds a LightObject given its name hash.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LightObject FindNameHash(
	NameHash nameHash
)
Public Function FindNameHash (
	nameHash As NameHash
) As LightObject
Parameters
nameHash
Type: Rhino.FileIO.NameHash
The name hash of the LightObject to be searched.
Return Value
Type: LightObject
A LightObject, or null on error.
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace