RhinoCommon API
TransformObjectList.ObjectArray Method
 Gets access to the internal RhinoObject array of the TransformObjectList object.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RhinoObject[] ObjectArray()
Public Function ObjectArray As RhinoObject()
Return Value
Type: RhinoObject[]
An array of Rhino objects, or an empty array if there were no Rhino objects.
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace