RhinoCommon API
MeshUnsafeLock.VertexColorsArray Method
 Retrieves a pointer to the raw mesh vertex colors array, which uses RGBA integers or throws an exception if none is available.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.1
Syntax
public int* VertexColorsArray(
	out int length
)
Visual Basic does not support APIs that consume or return unsafe types.
Parameters
length
Type: System.Int32
The length of the array. This value is returned by reference (out in C#).
Return Value
Type: Int32*
The beginning of the vertex array. Item 0 is the first vertex, and item length-1 is the last valid one.
Exceptions
Exception | Condition
InvalidOperationException | The mesh does not have vertex normals.
See Also
Reference
MeshUnsafeLock Class
Rhino.Geometry Namespace