RhinoCommon API
FileCsvDocument.Set Method (Int32, Int32, Int64)
 Sets the value of a specific cell to a 64-bit integer, formatted using the invariant culture.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Set(
	int column,
	int row,
	long value
)
Public Sub Set (
	column As Integer,
	row As Integer,
	value As Long
)
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.Int64
The value to store.
See Also
Reference
FileCsvDocument Class
Set Overload
Rhino.FileIO Namespace