RhinoCommon API
DisplayConduit.SetObjectIdFilter Method (IEnumerable<Guid>)
 Set object Ids that this conduit's per-object functions will only be called for
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SetObjectIdFilter(
	IEnumerable<Guid> ids
)
Public Sub SetObjectIdFilter (
	ids As IEnumerable(Of Guid)
)
Parameters
ids
Type: System.Collections.Generic.IEnumerable<Guid>
[Missing <param name="ids"/> documentation for "M:Rhino.Display.DisplayConduit.SetObjectIdFilter(System.Collections.Generic.IEnumerable{System.Guid})"]
See Also
Reference
DisplayConduit Class
SetObjectIdFilter Overload
Rhino.Display Namespace