RhinoCommon API
WorksessionFile.RemoveModelAt Method
Removes a model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void RemoveModelAt(
	int index
)
Public Sub RemoveModelAt (
	index As Integer
)
Parameters
index
Type: System.Int32
Index of the model to remove.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If index is out of range.
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace