RhinoCommon API
FileSettings.UpdateFromState Method
 Sets all settings to a particular defined joined state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void UpdateFromState(
	FileSettingsState state
)
Public Shared Sub UpdateFromState (
	state As FileSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.FileSettingsState
A joined settings object.
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace