RhinoCommon API
BezierCurve.Split Method
 Divides the Bezier curve at the specified parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Split(
	double t,
	out BezierCurve left,
	out BezierCurve right
)
Public Function Split (
	t As Double,
	<OutAttribute> ByRef left As BezierCurve,
	<OutAttribute> ByRef right As BezierCurve
) As Boolean
Parameters
t
Type: System.Double
parameter must satisfy 0 < t < 1
left
Type: Rhino.Geometry.BezierCurve
right
Type: Rhino.Geometry.BezierCurve
Return Value
Type: Boolean
true on success
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace