RhinoCommon API
NurbsSurface.CreateFromTorus Method
 Constructs a new NURBS surfaces from torus data.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static NurbsSurface CreateFromTorus(
	Torus torus
)
Public Shared Function CreateFromTorus (
	torus As Torus
) As NurbsSurface
Parameters
torus
Type: Rhino.Geometry.Torus
A torus value.
Return Value
Type: NurbsSurface
A new NURBS surface, or null on error.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace