RhinoCommon API
FileTxt.Read Method
Read a Txt file into a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	FileTxtReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As FileTxtReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.FileTxtReadOptions
options used for importing the Txt file
Return Value
Type: Boolean
true on success
See Also
Reference
FileTxt Class
Rhino.FileIO Namespace