RhinoCommon API
Fonts Constructor
Initializes a new instance of the Fonts class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Fonts()
Public Sub New
See Also
Reference
Fonts Class
Rhino.UI Namespace