RhinoCommon API
GumballSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static GumballSettingsState GetCurrentState()
Public Shared Function GetCurrentState As GumballSettingsState
Return Value
Type: GumballSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.GumballSettings.GetCurrentState"]
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace