RhinoCommon API
Circle Constructor (Point3d, Point3d, Point3d)
 Initializes a circle through three 3d points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Circle(
	Point3d point1,
	Point3d point2,
	Point3d point3
)
Public Sub New (
	point1 As Point3d,
	point2 As Point3d,
	point3 As Point3d
)
Parameters
point1
Type: Rhino.Geometry.Point3d
The start/end of the circle is at point1.
point2
Type: Rhino.Geometry.Point3d
Second point on the circle.
point3
Type: Rhino.Geometry.Point3d
Third point on the circle.
See Also
Reference
Circle Structure
Circle Overload
Rhino.Geometry Namespace