RhinoCommon API
Field.ValueAsPoint4d Method
 Return field as a Rhino.Geometry.Point4d color value.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Point4d ValueAsPoint4d()
Protected Function ValueAsPoint4d As Point4d
Return Value
Type: Point4d
Return field as a Rhino.Geometry.Point4d color value.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace