RhinoCommon API
SurfaceCurvature.Kappa Method
 Gets the principal curvature values: kappa1 - Principal curvature with maximum absolute value. kappa2 - Principal curvature with minimum absolute value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Kappa(
	int direction
)
Public Function Kappa (
	direction As Integer
) As Double
Parameters
direction
Type: System.Int32
Kappa index, valid values are 0 (kappa1) and 1 (kappa2).
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Geometry.SurfaceCurvature.Kappa(System.Int32)"]
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace