RhinoCommon API
SnapShotsClient.ViewsCategory Method
 Predefined views category
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string ViewsCategory()
Public Shared Function ViewsCategory As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.ViewsCategory"]
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace