RhinoCommon API
SectionStyle.GetBoundaryLinetype Method
 Get an optional custom linetype associated with this section style. If null, then the linetype will come from the parent attributes or layer
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Linetype GetBoundaryLinetype()
Public Function GetBoundaryLinetype As Linetype
Return Value
Type: Linetype
[Missing <returns> documentation for "M:Rhino.DocObjects.SectionStyle.GetBoundaryLinetype"]
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace