RhinoCommon API
Panels.IsPanelVisible Method (Type, Boolean)
 Check to see if a panel is currently visible, if isSelectedTab is true then the tab must be the active tab as well.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool IsPanelVisible(
	Type panelType,
	bool isSelectedTab
)
Public Shared Function IsPanelVisible (
	panelType As Type,
	isSelectedTab As Boolean
) As Boolean
Parameters
panelType
Type: System.Type
 Type of panel to check for, this type must include a GUID attribute.
isSelectedTab
Type: System.Boolean
 This parameter is ignored on Mac. If Windows and true the panel must be visible in a container and if it is a tabbed container it must be the active tab to be true.
Return Value
Type: Boolean
 On Windows: The return value is dependent on the isSelectedTab value. If isSelectedTab is true then the panel must be included in a visible tabbed container and must also be the active tab to be true. If isSelectedTab is false then the panel only has to be included in a visible tabbed container to be true. On Mac: isSelected is ignored and true is returned if the panel appears in any inspector panel.
See Also
Reference
Panels Class
IsPanelVisible Overload
Rhino.UI Namespace