RhinoCommon API
SubDEdgeSharpness.SharpnessFromSliderValue Method
 Converts a user facing slider value to an edge end sharpness value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static double SharpnessFromSliderValue(
	Interval sliderDomain,
	double sliderValue,
	double invalidInputResult
)
Public Shared Function SharpnessFromSliderValue (
	sliderDomain As Interval,
	sliderValue As Double,
	invalidInputResult As Double
) As Double
Parameters
sliderDomain
Type: Rhino.Geometry.Interval
 The non empty domain of the slider, often ZeroToOne.
sliderValue
Type: System.Double
 A value in sliderDomain. sliderDomain.T0 maps to 0.0 and sliderDomain.T1 maps to MaximumValue.
invalidInputResult
Type: System.Double
The value to return when the input is not valid.
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgeSharpness.SharpnessFromSliderValue(Rhino.Geometry.Interval,System.Double,System.Double)"]
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace