RhinoCommon API
IRhinoUiDialogService.ShowLineTypes Method (String, String, RhinoDoc)
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
Object ShowLineTypes(
	string title,
	string message,
	RhinoDoc doc
)
Function ShowLineTypes (
	title As String,
	message As String,
	doc As RhinoDoc
) As Object
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)"]
See Also
Reference
IRhinoUiDialogService Interface
ShowLineTypes Overload
Rhino.UI Namespace