RhinoCommon API
ViewUserInterfaceTable.Remove Method (IEnumerable<UserInterfaceObjectBase>)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Remove(System.Collections.Generic.IEnumerable{Rhino.UI.UserInterfaceObjectBase})"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Remove(
	IEnumerable<UserInterfaceObjectBase> items
)
Public Function Remove (
	items As IEnumerable(Of UserInterfaceObjectBase)
) As Integer
Parameters
items
Type: System.Collections.Generic.IEnumerable<UserInterfaceObjectBase>
[Missing <param name="items"/> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Remove(System.Collections.Generic.IEnumerable{Rhino.UI.UserInterfaceObjectBase})"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Remove(System.Collections.Generic.IEnumerable{Rhino.UI.UserInterfaceObjectBase})"]
See Also
Reference
ViewUserInterfaceTable Class
Remove Overload
Rhino.DocObjects.Tables Namespace