RhinoCommon API
DracoCompression.Compress Method (PointCloud)
 Compress a point cloud
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static DracoCompression Compress(
	PointCloud pointCloud
)
Public Shared Function Compress (
	pointCloud As PointCloud
) As DracoCompression
Parameters
pointCloud
Type: Rhino.Geometry.PointCloud
point cloud to compress
Return Value
Type: DracoCompression
instance of class representing the compressed data
See Also
Reference
DracoCompression Class
Compress Overload
Rhino.FileIO Namespace