RhinoCommon API
TrulyObservableOrderedSet<T>.RemoveAt Method
 Removes an element at the specified index from the set.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RemoveAt(
	int index
)
Public Sub RemoveAt (
	index As Integer
)
Parameters
index
Type: System.Int32
The index of the element to remove.
Implements
IList<T>.RemoveAt(Int32)
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown if the index passed is out of bounds.
InvalidOperationException | Thrown if the item that will be removed cannot be modified by the current assembly.
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace