RhinoCommon API
Transform2d Constructor (Double, Double, Double, Double, Double, Double)
 Initializes a new transform matrix from its six values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Transform2d(
	double m00,
	double m01,
	double m02,
	double m10,
	double m11,
	double m12
)
Public Sub New (
	m00 As Double,
	m01 As Double,
	m02 As Double,
	m10 As Double,
	m11 As Double,
	m12 As Double
)
Parameters
m00
Type: System.Double
Value at [0,0].
m01
Type: System.Double
Value at [0,1].
m02
Type: System.Double
Value at [0,2], the X translation.
m10
Type: System.Double
Value at [1,0].
m11
Type: System.Double
Value at [1,1].
m12
Type: System.Double
Value at [1,2], the Y translation.
See Also
Reference
Transform2d Structure
Transform2d Overload
Rhino.Geometry Namespace