RhinoCommon API
SubDDisplayParameters.CreateFromDisplayDensity Method
 In most applications, the caller sets the mesh density and leaves the other parameters set to the default values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static SubDDisplayParameters CreateFromDisplayDensity(
	uint adaptiveSubDDisplayDensity
)
Public Shared Function CreateFromDisplayDensity (
	adaptiveSubDDisplayDensity As UInteger
) As SubDDisplayParameters
Parameters
adaptiveSubDDisplayDensity
Type: System.UInt32
 A value <= SubDDisplayParameters.Density.MaximumDensity. When in doubt, pass SubDDisplayParameters.Density.DefaultDensity. Values < SubDDisplayParameters.Density.MinimumAdaptiveDensity are treated as SubDDisplayParameters.Density.MinimumAdaptiveDensity. All other invalid input values are treated as SubDDisplayParameters.Density.DefaultDensity.
Return Value
Type: SubDDisplayParameters
The SubD display parameters.
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace