RhinoCommon API
DisplayPipeline.EnableDepthWriting Method
 Enable or disable the DepthWriting behavior of the engine. When DepthWriting is disabled, drawn geometry does not affect the Z-Buffer.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void EnableDepthWriting(
	bool enable
)
Public Sub EnableDepthWriting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true to enable DepthWriting, false to disable.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace