RhinoCommon API
RenderTexture Constructor
Initializes a new instance of the RenderTexture class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected RenderTexture()
Protected Sub New
See Also
Reference
RenderTexture Class
Rhino.Render Namespace