RhinoCommon API
Mesh.Smooth Method (Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem)
 Smooths a mesh by averaging the positions of mesh vertices in a specified region.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Smooth(
	double smoothFactor,
	bool bXSmooth,
	bool bYSmooth,
	bool bZSmooth,
	bool bFixBoundaries,
	SmoothingCoordinateSystem coordinateSystem
)
Public Function Smooth (
	smoothFactor As Double,
	bXSmooth As Boolean,
	bYSmooth As Boolean,
	bZSmooth As Boolean,
	bFixBoundaries As Boolean,
	coordinateSystem As SmoothingCoordinateSystem
) As Boolean
Parameters
smoothFactor
Type: System.Double
The smoothing factor, which controls how much vertices move towards the average of the neighboring vertices.
bXSmooth
Type: System.Boolean
When true vertices move in X axis direction.
bYSmooth
Type: System.Boolean
When true vertices move in Y axis direction.
bZSmooth
Type: System.Boolean
When true vertices move in Z axis direction.
bFixBoundaries
Type: System.Boolean
When true vertices along naked edges will not be modified.
coordinateSystem
Type: Rhino.Geometry.SmoothingCoordinateSystem
The coordinates to determine the direction of the smoothing.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
Mesh Class
Smooth Overload
Rhino.Geometry Namespace