RhinoCommon API
SHA1OpenNURBS.FileSystemPathHash Method
 Computes the SHA1 hash of a file system path, converted to UTF8.
These file system paths have identical values of FileSystemPathHash():
/x/y/z/name.ext
\x\y\z\name.ext
/x//y//z/name.ext
/x/y/a/b/c/../../../z/name.ext
/X/Y/Z/NAME.EXT (When ignoreCase is true)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static byte[] FileSystemPathHash(
	string path,
	bool? ignoreCase = null
)
Public Shared Function FileSystemPathHash (
	path As String,
	Optional ignoreCase As Boolean? = Nothing
) As Byte()
Parameters
path
Type: System.String
A non-null path string.
ignoreCase (Optional)
Type: System.Nullable<Boolean>
If case should be ignored. If this is null or unspecified, the operating system default is used.
Return Value
Type: Byte[]
A 20-byte long SHA1 hash.
Exceptions
Exception | Condition
ArgumentNullException | When input is null.
See Also
Reference
SHA1OpenNURBS Class
Rhino.FileIO Namespace