RhinoCommon API
RhinoDoc.Dispose Method
Releases all resources used by the RhinoDoc
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RhinoDoc Class
Rhino Namespace