RhinoCommon API
NurbsCurveFitParameters.GetUniformityCoefficientFromIntensity Method
 Returns the uniformity coefficient that corresponds to a given NurbsCurveFitParameters.Intensity value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double GetUniformityCoefficientFromIntensity(
	NurbsCurveFitParameters.Intensity intensity
)
Public Function GetUniformityCoefficientFromIntensity (
	intensity As NurbsCurveFitParameters.Intensity
) As Double
Parameters
intensity
Type: Rhino.Geometry.NurbsCurveFitParameters.Intensity
[Missing <param name="intensity"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.GetUniformityCoefficientFromIntensity(Rhino.Geometry.NurbsCurveFitParameters.Intensity)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.GetUniformityCoefficientFromIntensity(Rhino.Geometry.NurbsCurveFitParameters.Intensity)"]
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace