RhinoCommon API
RhinoObject.HighlightSubObject Method
 Highlights a sub-object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool HighlightSubObject(
	ComponentIndex componentIndex,
	bool highlight
)
Public Function HighlightSubObject (
	componentIndex As ComponentIndex,
	highlight As Boolean
) As Boolean
Parameters
componentIndex
Type: Rhino.Geometry.ComponentIndex
A sub-object component index.
highlight
Type: System.Boolean
true if the sub-object should be highlighted.
Return Value
Type: Boolean
true if the sub-object is now highlighted.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace