RhinoCommon API
SubDDisplayParameters.SetAdaptiveDisplayDensity Method
 Set an adaptive SubD display density that caps display mesh quad count at SubDDisplayParameters.AdaptiveDisplayMeshQuadMaximum.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public void SetAdaptiveDisplayDensity(
	uint adaptiveDisplayDensity
)
Public Sub SetAdaptiveDisplayDensity (
	adaptiveDisplayDensity As UInteger
)
Parameters
adaptiveDisplayDensity
Type: System.UInt32
 adaptiveDisplayDensity <= SubDDisplayParameters.Density.MaximumDensity. Values <= SubDDisplayParameters.Density.MinimumAdaptiveDensity will never be adaptively reduced during display mesh creation.
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace