RhinoCommon API
MeshFace.GetHashCode Method
 Returns a runtime-stable hash code for the current mesh face. You are not allowed to rely on persistence of this hash code in serialization, but for each version of RhinoCommon, this hash code will be the same for each mesh face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A non-unique integer that represents this mesh face.
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace