RhinoCommon API
CurveKinkDefinition.IsCurvatureZero Method (Double)
 Returns true if the curvature vector is considered to be zero given the CurvatureKinkZeroTolerance
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsCurvatureZero(
	double curvature
)
Public Function IsCurvatureZero (
	curvature As Double
) As Boolean
Parameters
curvature
Type: System.Double
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.CurveKinkDefinition.IsCurvatureZero(System.Double)"]
See Also
Reference
CurveKinkDefinition Class
IsCurvatureZero Overload
Rhino.Geometry Namespace