RhinoCommon API
BrepEdgeFilletDistance Constructor
 Construct a fillet distance
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public BrepEdgeFilletDistance(
	double edgeParameter,
	double filletDistance
)
Public Sub New (
	edgeParameter As Double,
	filletDistance As Double
)
Parameters
edgeParameter
Type: System.Double
The parameter along the edge where to apply the fillet distance
filletDistance
Type: System.Double
The distance to apply
See Also
Reference
BrepEdgeFilletDistance Class
Rhino.Geometry Namespace