RhinoCommon API
Brep.CreateTrimmedPlane Method (Plane, IEnumerable<Curve>)
 Create a Brep trimmed plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep CreateTrimmedPlane(
	Plane plane,
	IEnumerable<Curve> curves
)
Public Shared Function CreateTrimmedPlane (
	plane As Plane,
	curves As IEnumerable(Of Curve)
) As Brep
Parameters
plane
Type: Rhino.Geometry.Plane
Plane that will be trimmed.
curves
Type: System.Collections.Generic.IEnumerable<Curve>
A list of curves that form a simple (no self intersections) closed curve that defines the outer boundary of the trimmed plane.
Return Value
Type: Brep
Resulting brep or null on failure.
See Also
Reference
Brep Class
CreateTrimmedPlane Overload
Rhino.Geometry Namespace