RhinoCommon API
ArchivableDictionary.GetBool Method (String, Boolean)
 Get value as Boolean, will return defaultValue unless value was created using Set(string key, Boolean value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool GetBool(
	string key,
	bool defaultValue
)
Public Function GetBool (
	key As String,
	defaultValue As Boolean
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetBool(System.String,System.Boolean)"]
defaultValue
Type: System.Boolean
[Missing <param name="defaultValue"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetBool(System.String,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetBool(System.String,System.Boolean)"]
See Also
Reference
ArchivableDictionary Class
GetBool Overload
Rhino.Collections Namespace