RhinoCommon API
PostEffectCollection.SetSelectedPostEffect Method
 Sets the selected post effect for a certain type.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetSelectedPostEffect(
	PostEffectType type,
	Guid id
)
Public Sub SetSelectedPostEffect (
	type As PostEffectType,
	id As Guid
)
Parameters
type
Type: Rhino.Render.PostEffects.PostEffectType
[Missing <param name="type"/> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.SetSelectedPostEffect(Rhino.Render.PostEffects.PostEffectType,System.Guid)"]
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.SetSelectedPostEffect(Rhino.Render.PostEffects.PostEffectType,System.Guid)"]
See Also
Reference
PostEffectCollection Class
Rhino.Render.PostEffects Namespace