RhinoCommon API
SubDSurfaceInterpolator.IsInterpolatedVertex Method (SubDVertex)
[Missing <summary> documentation for "M:Rhino.Geometry.SubDSurfaceInterpolator.IsInterpolatedVertex(Rhino.Geometry.SubDVertex)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsInterpolatedVertex(
	SubDVertex vertex
)
Public Function IsInterpolatedVertex (
	vertex As SubDVertex
) As Boolean
Parameters
vertex
Type: Rhino.Geometry.SubDVertex
[Missing <param name="vertex"/> documentation for "M:Rhino.Geometry.SubDSurfaceInterpolator.IsInterpolatedVertex(Rhino.Geometry.SubDVertex)"]
Return Value
Type: Boolean
True if the vertex surface point is being interpolated.
See Also
Reference
SubDSurfaceInterpolator Class
IsInterpolatedVertex Overload
Rhino.Geometry Namespace