RhinoCommon API
DigitizerPlugIn Constructor
Initializes a new instance of the DigitizerPlugIn class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected DigitizerPlugIn()
Protected Sub New
See Also
Reference
DigitizerPlugIn Class
Rhino.PlugIns Namespace