RhinoCommon API
RenderTexture.SetRotation Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.SetRotation(Rhino.Geometry.Vector3d,Rhino.Render.RenderContent.ChangeContexts)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual void SetRotation(
	Vector3d value,
	RenderContent.ChangeContexts changeContext
)
Public Overridable Sub SetRotation (
	value As Vector3d,
	changeContext As RenderContent.ChangeContexts
)
Parameters
value
Type: Rhino.Geometry.Vector3d
[Missing <param name="value"/> documentation for "M:Rhino.Render.RenderTexture.SetRotation(Rhino.Geometry.Vector3d,Rhino.Render.RenderContent.ChangeContexts)"]
changeContext
Type: Rhino.Render.RenderContent.ChangeContexts
[Missing <param name="changeContext"/> documentation for "M:Rhino.Render.RenderTexture.SetRotation(Rhino.Geometry.Vector3d,Rhino.Render.RenderContent.ChangeContexts)"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace