RhinoCommon API
RhinoDoc.SetGridDefaults Method
[Missing <summary> documentation for "M:Rhino.RhinoDoc.SetGridDefaults(Rhino.DocObjects.ConstructionPlaneGridDefaults)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public void SetGridDefaults(
	ConstructionPlaneGridDefaults defaults
)
Public Sub SetGridDefaults (
	defaults As ConstructionPlaneGridDefaults
)
Parameters
defaults
Type: Rhino.DocObjects.ConstructionPlaneGridDefaults
[Missing <param name="defaults"/> documentation for "M:Rhino.RhinoDoc.SetGridDefaults(Rhino.DocObjects.ConstructionPlaneGridDefaults)"]
See Also
Reference
RhinoDoc Class
Rhino Namespace