RhinoCommon API
ZebraAnalysisSettings.UpdateFromState Method
 Sets all settings to a particular defined joined state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public static void UpdateFromState(
	ZebraAnalysisSettingsState state
)
Public Shared Sub UpdateFromState (
	state As ZebraAnalysisSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.ZebraAnalysisSettingsState
The particular state.
See Also
Reference
ZebraAnalysisSettings Class
Rhino.ApplicationSettings Namespace