RhinoCommon API
WorksessionFileLayerOverride Constructor (WorksessionFileLayerOverride)
Creates a copy of another layer override.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFileLayerOverride(
	WorksessionFileLayerOverride other
)
Public Sub New (
	other As WorksessionFileLayerOverride
)
Parameters
other
Type: Rhino.FileIO.WorksessionFileLayerOverride
The layer override to copy.
Exceptions
Exception | Condition
ArgumentNullException | If other is null.
See Also
Reference
WorksessionFileLayerOverride Class
WorksessionFileLayerOverride Overload
Rhino.FileIO Namespace