RhinoCommon API
SubDDisplayParameters.DisplayDensity Method
 Gets the absolute display density to use when creating display meshes for SubD. When adaptive reduction is enabled, subd.Faces.Count is used to determine the appropriate display density.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public uint DisplayDensity(
	SubD subd
)
Public Function DisplayDensity (
	subd As SubD
) As UInteger
Parameters
subd
Type: Rhino.Geometry.SubD
The SubD object.
Return Value
Type: UInt32
The display density.
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace