RhinoCommon API
PolylineCurve.SetParameter Method
 Sets a parameter at a specified index in the polyline curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetParameter(
	int index,
	double parameter
)
Public Sub SetParameter (
	index As Integer,
	parameter As Double
)
Parameters
index
Type: System.Int32
An index.
parameter
Type: System.Double
A parameter to set.
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace