RhinoCommon API
FieldDictionary.Add Method (String, Color)
 Add a new Color4fField to the dictionary. This will be a data only field and not show up in the content browsers.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Color4fField Add(
	string key,
	Color value
)
Public Function Add (
	key As String,
	value As Color
) As Color4fField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: System.Drawing.Color
Initial value for this field.
Return Value
Type: Color4fField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Drawing.Color)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace