RhinoCommon API
Layer.Equals Method (Object)
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.Equals(System.Object)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
[Missing <param name="obj"/> documentation for "M:Rhino.DocObjects.Layer.Equals(System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.Equals(System.Object)"]
See Also
Reference
Layer Class
Equals Overload
Rhino.DocObjects Namespace