RhinoCommon API
EmapAnalysisSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static EmapAnalysisSettingsState GetCurrentState()
Public Shared Function GetCurrentState As EmapAnalysisSettingsState
Return Value
Type: EmapAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.EmapAnalysisSettings.GetCurrentState"]
See Also
Reference
EmapAnalysisSettings Class
Rhino.ApplicationSettings Namespace