RhinoCommon API
GumballDisplayConduit Constructor
Note: This API is now obsolete.
Initializes a new instance of the GumballDisplayConduit class
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute]
public GumballDisplayConduit()
<ObsoleteAttribute>
Public Sub New
See Also
Reference
GumballDisplayConduit Class
GumballDisplayConduit Overload
Rhino.UI.Gumball Namespace