RhinoCommon API
ContentHash.Equals Method (Object)
 Determines if another object is a content hash with same value.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
The other content hash to compare.
Return Value
Type: Boolean
True if the two hashes are equal.
See Also
Reference
ContentHash Class
Equals Overload
Rhino.FileIO Namespace