RhinoCommon API
CurveBooleanRegions.SegmentCount Method
 Returns the number of segments in a boundary curve in a curve region.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int SegmentCount(
	int regionIndex,
	int boundaryIndex
)
Public Function SegmentCount (
	regionIndex As Integer,
	boundaryIndex As Integer
) As Integer
Parameters
regionIndex
Type: System.Int32
The curve region index.
boundaryIndex
Type: System.Int32
The boundary curve index.
Return Value
Type: Int32
The number of curve segments in th boundary curves.
See Also
Reference
CurveBooleanRegions Class
Rhino.Geometry Namespace