RhinoCommon API
DisplayPipelineAttributes.GetCurveThicknessUsage Method
 Gets current usage, pixel thickness (CurveThickness) or a scale thickness (CurveThicknessScale)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPipelineAttributes.CurveThicknessUse GetCurveThicknessUsage()
Public Function GetCurveThicknessUsage As DisplayPipelineAttributes.CurveThicknessUse
Return Value
Type: DisplayPipelineAttributes.CurveThicknessUse
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipelineAttributes.GetCurveThicknessUsage"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace