RhinoCommon API
PersistentSettings.RegisterSettingsValidator<T> Method
 Sets a validator for a given key.
Note to implementers: T should be one of the supported types for the PersistentSettings class and should match the type associated with the key.
This method allows to use anonymous methods and lambda expressions.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RegisterSettingsValidator<T>(
	string key,
	EventHandler<PersistentSettingsEventArgs<T>> validator
)
Public Sub RegisterSettingsValidator(Of T) (
	key As String,
	validator As EventHandler(Of PersistentSettingsEventArgs(Of T))
)
Parameters
key
Type: System.String
The key to which to bind the validator.
validator
Type: System.EventHandler<PersistentSettingsEventArgs<T>>
A validator instance of your own class.
Type Parameters
T
See Also
Reference
PersistentSettings Class
Rhino Namespace