RhinoCommon API
File3dmViewTable.Delete Method (Int32)
 Removes an item.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Delete(
	int index
)
Public Function Delete (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
The index of the item to remove.
Return Value
Type: Boolean
True if the item was removed.
See Also
Reference
File3dmViewTable Class
Delete Overload
Rhino.FileIO Namespace