RhinoCommon API
Color4f.FromArgb Method (Single, Color4f)
[Missing <summary> documentation for "M:Rhino.Display.Color4f.FromArgb(System.Single,Rhino.Display.Color4f)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public static Color4f FromArgb(
	float a,
	Color4f color
)
Public Shared Function FromArgb (
	a As Single,
	color As Color4f
) As Color4f
Parameters
a
Type: System.Single
[Missing <param name="a"/> documentation for "M:Rhino.Display.Color4f.FromArgb(System.Single,Rhino.Display.Color4f)"]
color
Type: Rhino.Display.Color4f
[Missing <param name="color"/> documentation for "M:Rhino.Display.Color4f.FromArgb(System.Single,Rhino.Display.Color4f)"]
Return Value
Type: Color4f
[Missing <returns> documentation for "M:Rhino.Display.Color4f.FromArgb(System.Single,Rhino.Display.Color4f)"]
See Also
Reference
Color4f Structure
FromArgb Overload
Rhino.Display Namespace