RhinoCommon API
LinearWorkflow.Dispose Method
Releases all resources used by the LinearWorkflow
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace