RhinoCommon API
RhinoApp.GetDataDirectory Method (Boolean, Boolean, String)
 Gets the data directory.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string GetDataDirectory(
	bool localUser,
	bool forceDirectoryCreation,
	string subDirectory
)
Public Shared Function GetDataDirectory (
	localUser As Boolean,
	forceDirectoryCreation As Boolean,
	subDirectory As String
) As String
Parameters
localUser
Type: System.Boolean
If set to true local user.
forceDirectoryCreation
Type: System.Boolean
If set to true force directory creation.
subDirectory
Type: System.String
 Sub directory, will get appended to the end of the data directory. if forceDirectoryCreation is true then this directory will get created and writable.
Return Value
Type: String
The data directory.
See Also
Reference
RhinoApp Class
GetDataDirectory Overload
Rhino Namespace