RhinoCommon API
Notification.Editable Method
 Determines whether an assembly can modify the instance. Any code that modifies an assembly protected notification must be wrapped in a ExecuteAssemblyProtectedCode(Action) method.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public bool Editable()
Public Function Editable As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.Notifications.Notification.Editable"]
Implements
IAssemblyRestrictedObject.Editable()
Remarks
Before modifying a notification you are not sure you created (such as a notification returned from a LINQ query), you should call this method first to ensure you can indeed edit the object.
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace