RhinoCommon API
ViewCaptureSettings.SetMarginTop Method
 Set the distance from the top edge of the paper to the CropRectangle
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public bool SetMarginTop(
	UnitSystem lengthUnits,
	double distance
)
Public Function SetMarginTop (
	lengthUnits As UnitSystem,
	distance As Double
) As Boolean
Parameters
lengthUnits
Type: Rhino.UnitSystem
units that distance is defined in
distance
Type: System.Double
distance to set
Return Value
Type: Boolean
 True if successful. False if unsuccessful (this could happen if there is no set device_dpi)
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace