RhinoCommon API
FileX_TWriteOptions Constructor
Initializes a new instance of the FileX_TWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileX_TWriteOptions()
Public Sub New
See Also
Reference
FileX_TWriteOptions Class
Rhino.FileIO Namespace