RhinoCommon API
BrepRegion.NonConstOperation Method
[Missing <summary> documentation for "M:Rhino.Geometry.BrepRegion.NonConstOperation"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void NonConstOperation()
Protected Overrides Sub NonConstOperation
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace