RhinoCommon API
PersistentSettings.TryGetInteger Method (String, Int32, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetInteger(System.String,System.Int32@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetInteger(
	string key,
	out int value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetInteger (
	key As String,
	<OutAttribute> ByRef value As Integer,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetInteger(System.String,System.Int32@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: System.Int32
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetInteger(System.String,System.Int32@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetInteger(System.String,System.Int32@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetInteger(System.String,System.Int32@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetInteger Overload
Rhino Namespace