RhinoCommon API
GripObject.UndoMove Method
 Undoes any grip moves made by calling Move.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void UndoMove()
Public Sub UndoMove
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace