RhinoCommon API
PythonScript.ExecuteFileInScope Method
 Executes a Python file in the calling script scope. All old variables are kept.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public abstract bool ExecuteFileInScope(
	string path
)
Public MustOverride Function ExecuteFileInScope (
	path As String
) As Boolean
Parameters
path
Type: System.String
The path to the file.
Return Value
Type: Boolean
true if the file executed. This method can throw scripting-runtime based exceptions.
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace