RhinoCommon API
RenderPipeline.SaveImage Method
 Saves the rendered image to a file. Does not prompt the user in any way.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.14
Syntax
public bool SaveImage(
	string fileName,
	bool saveAlpha
)
Public Function SaveImage (
	fileName As String,
	saveAlpha As Boolean
) As Boolean
Parameters
fileName
Type: System.String
 Full path to the file name to save to.
saveAlpha
Type: System.Boolean
 Determines if alpha will be saved in files that support it (e.g., PNG).
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.SaveImage(System.String,System.Boolean)"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace