RhinoCommon API
IPanelsService.StartDraggingDockBar Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.StartDraggingDockBar(System.Guid,System.Drawing.Point,System.Drawing.Point)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
bool StartDraggingDockBar(
	Guid barId,
	Point mouseDownPoint,
	Point screenStartPoint
)
Function StartDraggingDockBar (
	barId As Guid,
	mouseDownPoint As Point,
	screenStartPoint As Point
) As Boolean
Parameters
barId
Type: System.Guid
[Missing <param name="barId"/> documentation for "M:Rhino.UI.IPanelsService.StartDraggingDockBar(System.Guid,System.Drawing.Point,System.Drawing.Point)"]
mouseDownPoint
Type: System.Drawing.Point
[Missing <param name="mouseDownPoint"/> documentation for "M:Rhino.UI.IPanelsService.StartDraggingDockBar(System.Guid,System.Drawing.Point,System.Drawing.Point)"]
screenStartPoint
Type: System.Drawing.Point
[Missing <param name="screenStartPoint"/> documentation for "M:Rhino.UI.IPanelsService.StartDraggingDockBar(System.Guid,System.Drawing.Point,System.Drawing.Point)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.StartDraggingDockBar(System.Guid,System.Drawing.Point,System.Drawing.Point)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace