RhinoCommon API
IPanel.PanelClosing Method
[Missing <summary> documentation for "M:Rhino.UI.IPanel.PanelClosing(System.UInt32,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void PanelClosing(
	uint documentSerialNumber,
	bool onCloseDocument
)
Sub PanelClosing (
	documentSerialNumber As UInteger,
	onCloseDocument As Boolean
)
Parameters
documentSerialNumber
Type: System.UInt32
[Missing <param name="documentSerialNumber"/> documentation for "M:Rhino.UI.IPanel.PanelClosing(System.UInt32,System.Boolean)"]
onCloseDocument
Type: System.Boolean
[Missing <param name="onCloseDocument"/> documentation for "M:Rhino.UI.IPanel.PanelClosing(System.UInt32,System.Boolean)"]
See Also
Reference
IPanel Interface
Rhino.UI Namespace