RhinoCommon API
PersistentSettings.GetPoint3d Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetPoint3d(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d GetPoint3d(
	string key
)
Public Function GetPoint3d (
	key As String
) As Point3d
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetPoint3d(System.String)"]
Return Value
Type: Point3d
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetPoint3d(System.String)"]
See Also
Reference
PersistentSettings Class
GetPoint3d Overload
Rhino Namespace