RhinoCommon API
Linetype.SetSegments Method
Set all segments.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public bool SetSegments(
	IEnumerable<double> segments
)
Public Function SetSegments (
	segments As IEnumerable(Of Double)
) As Boolean
Parameters
segments
Type: System.Collections.Generic.IEnumerable<Double>
 An array of segments lengths. Lengths >= 0 are interpreted as a line. Lengths < 0 are interpreted as a space.
Return Value
Type: Boolean
true if the segments were replaced
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace