RhinoCommon API
Triangle3d.PointAlongBoundary Method
 Gets the point along the boundary of the triangle. The triangle boundary has a domain [0, 3] where each subsequent unit domain maps to a different edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Point3d PointAlongBoundary(
	double t
)
Public Function PointAlongBoundary (
	t As Double
) As Point3d
Parameters
t
Type: System.Double
Parameter along boundary.
Return Value
Type: Point3d
[Missing <returns> documentation for "M:Rhino.Geometry.Triangle3d.PointAlongBoundary(System.Double)"]
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace