RhinoCommon API
HatchPatternTable.FindIndex Method
 Retrieves a HatchPattern object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public HatchPattern FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As HatchPattern
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: HatchPattern
A HatchPattern object, or null if none was found.
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace