RhinoCommon API
Mesh.CreateFromCone Method (Cone, Int32, Int32, Boolean)
Constructs a mesh cone.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public static Mesh CreateFromCone(
	Cone cone,
	int vertical,
	int around,
	bool solid
)
Public Shared Function CreateFromCone (
	cone As Cone,
	vertical As Integer,
	around As Integer,
	solid As Boolean
) As Mesh
Parameters
cone
Type: Rhino.Geometry.Cone
[Missing <param name="cone"/> documentation for "M:Rhino.Geometry.Mesh.CreateFromCone(Rhino.Geometry.Cone,System.Int32,System.Int32,System.Boolean)"]
vertical
Type: System.Int32
Number of faces in the top-to-bottom direction.
around
Type: System.Int32
Number of faces around the cone.
solid
Type: System.Boolean
If false the mesh will be open with no faces on the circular planar portion.
Return Value
Type: Mesh
A valid mesh if successful.
Exceptions
Exception | Condition
ArgumentException | Thrown when cone is invalid.
See Also
Reference
Mesh Class
CreateFromCone Overload
Rhino.Geometry Namespace