RhinoCommon API
OptionColor.Dispose Method
Releases all resources used by the OptionColor
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
OptionColor Class
Dispose Overload
Rhino.Input.Custom Namespace