RhinoCommon API
SubD.NonConstOperation Method
 Destroy cache handle
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void NonConstOperation()
Protected Overrides Sub NonConstOperation
See Also
Reference
SubD Class
Rhino.Geometry Namespace