RhinoCommon API
Mesh.CreateFromSubD Method (SubD)
 Create a mesh from a SubD limit surface, using the default meshing density for SubDs.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Mesh CreateFromSubD(
	SubD subd
)
Public Shared Function CreateFromSubD (
	subd As SubD
) As Mesh
Parameters
subd
Type: Rhino.Geometry.SubD
SubD to mesh
Return Value
Type: Mesh
New mesh representing the SubD
See Also
Reference
Mesh Class
CreateFromSubD Overload
Rhino.Geometry Namespace
SubD.UpdateSurfaceMeshCache(Boolean)