RhinoCommon API
Mesh.NormalAt Method (MeshPoint)
 Evaluate a mesh normal at a set of barycentric coordinates.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d NormalAt(
	MeshPoint meshPoint
)
Public Function NormalAt (
	meshPoint As MeshPoint
) As Vector3d
Parameters
meshPoint
Type: Rhino.Geometry.MeshPoint
MeshPoint instance containing a valid Face Index and Barycentric coordinates.
Return Value
Type: Vector3d
A Normal vector to the mesh or Vector3d.Unset if the faceIndex is not valid or if the barycentric coordinates could not be evaluated.
See Also
Reference
Mesh Class
NormalAt Overload
Rhino.Geometry Namespace