RhinoCommon API
ZebraAnalysisSettings.RestoreDefaults Method
 Commits the default settings as the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public static void RestoreDefaults()
Public Shared Sub RestoreDefaults
See Also
Reference
ZebraAnalysisSettings Class
Rhino.ApplicationSettings Namespace