RhinoCommon API
GetCone.Get Method
 Prompt for the getting of a cone.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Result Get(
	out Cone cone
)
Public Function Get (
	<OutAttribute> ByRef cone As Cone
) As Result
Parameters
cone
Type: Rhino.Geometry.Cone
The cone geometry defined by the user.
Return Value
Type: Result
The result of the getting operation.
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace