RhinoCommon API
MeshVertexColorList.AddRange Method
 Adds an enumerable of colors to the to the vertex color list. For the Mesh to be valid, the number of colors must match the number of vertices.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public bool AddRange(
	IEnumerable<Color> colors
)
Public Function AddRange (
	colors As IEnumerable(Of Color)
) As Boolean
Parameters
colors
Type: System.Collections.Generic.IEnumerable<Color>
Colors to append.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace