RhinoCommon API
Brep.CreateFilletSurface Method (BrepFace, Point2d, BrepFace, Point2d, Brep.FilletSurfaceSettings, Brep.FilletSurfaceResults)
 Create a fillet (rational arcs or non-rational arc approxiation or chamfered surface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool CreateFilletSurface(
	BrepFace face0,
	Point2d uv0,
	BrepFace face1,
	Point2d uv1,
	Brep.FilletSurfaceSettings settings,
	out Brep.FilletSurfaceResults results
)
Public Shared Function CreateFilletSurface (
	face0 As BrepFace,
	uv0 As Point2d,
	face1 As BrepFace,
	uv1 As Point2d,
	settings As Brep.FilletSurfaceSettings,
	<OutAttribute> ByRef results As Brep.FilletSurfaceResults
) As Boolean
Parameters
face0
Type: Rhino.Geometry.BrepFace
First face to fillet from.
uv0
Type: Rhino.Geometry.Point2d
A parameter face0 at the side you want to keep after filleting.
face1
Type: Rhino.Geometry.BrepFace
Second face to fillet from.
uv1
Type: Rhino.Geometry.Point2d
A parameter face1 at the side you want to keep after filleting.
settings
Type: Rhino.Geometry.Brep.FilletSurfaceSettings
The settings to use for filleting/chamfering
results
Type: Rhino.Geometry.Brep.FilletSurfaceResults
If true is returned, this contains the fillet results.
Return Value
Type: Boolean
true if successful
Exceptions
Exception | Condition
ArgumentNullException
See Also
Reference
Brep Class
CreateFilletSurface Overload
Rhino.Geometry Namespace