RhinoCommon API
ContentFactories.FirstFactory Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.ContentFactories.FirstFactory"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public ContentFactory FirstFactory()
Public Function FirstFactory As ContentFactory
Return Value
Type: ContentFactory
[Missing <returns> documentation for "M:Rhino.Render.DataSources.ContentFactories.FirstFactory"]
See Also
Reference
ContentFactories Class
Rhino.Render.DataSources Namespace