RhinoCommon API
Interop.NativeNonConstPointer Method (GetPoint)
 Get CRhinoGetPoint* from a GetPoint instance
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static IntPtr NativeNonConstPointer(
	GetPoint getPoint
)
Public Shared Function NativeNonConstPointer (
	getPoint As GetPoint
) As IntPtr
Parameters
getPoint
Type: Rhino.Input.Custom.GetPoint
[Missing <param name="getPoint"/> documentation for "M:Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Input.Custom.GetPoint)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Input.Custom.GetPoint)"]
See Also
Reference
Interop Class
NativeNonConstPointer Overload
Rhino.Runtime Namespace