RhinoCommon API
DimStyleTable.Delete Method (Int32, Boolean)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Delete(System.Int32,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Delete(
	int index,
	bool quiet
)
Public Function Delete (
	index As Integer,
	quiet As Boolean
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Delete(System.Int32,System.Boolean)"]
quiet
Type: System.Boolean
[Missing <param name="quiet"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Delete(System.Int32,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Delete(System.Int32,System.Boolean)"]
See Also
Reference
DimStyleTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace