RhinoCommon API
DisplayPipeline.DrawLine Method (Point3d, Point3d, Color)
 Draws a single line object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DrawLine(
	Point3d from,
	Point3d to,
	Color color
)
Public Sub DrawLine (
	from As Point3d,
	to As Point3d,
	color As Color
)
Parameters
from
Type: Rhino.Geometry.Point3d
Line from point.
to
Type: Rhino.Geometry.Point3d
Line to point.
color
Type: System.Drawing.Color
Color to draw line in.
See Also
Reference
DisplayPipeline Class
DrawLine Overload
Rhino.Display Namespace