RhinoCommon API
ContentFactories.Dispose Method
Releases all resources used by the ContentFactories
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ContentFactories Class
Rhino.Render.DataSources Namespace