RhinoCommon API
Surface.CreatePeriodicSurface Method (Surface, Int32)
 Constructs a periodic surface from a base surface and a direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Surface CreatePeriodicSurface(
	Surface surface,
	int direction
)
Public Shared Function CreatePeriodicSurface (
	surface As Surface,
	direction As Integer
) As Surface
Parameters
surface
Type: Rhino.Geometry.Surface
The surface to make periodic.
direction
Type: System.Int32
The direction to make periodic, either 0 = U, or 1 = V.
Return Value
Type: Surface
A Surface on success or null on failure.
See Also
Reference
Surface Class
CreatePeriodicSurface Overload
Rhino.Geometry Namespace