RhinoCommon API
BezierCurve.ChangeDimension Method
Change dimension of bezier.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ChangeDimension(
	int desiredDimension
)
Public Function ChangeDimension (
	desiredDimension As Integer
) As Boolean
Parameters
desiredDimension
Type: System.Int32
Return Value
Type: Boolean
true if successful. false if desired_dimension < 1
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace