RhinoCommon API
RhinoMath.MetersPerUnit Method
 Return number of meters per one unit of a given unit system
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public static double MetersPerUnit(
	UnitSystem units
)
Public Shared Function MetersPerUnit (
	units As UnitSystem
) As Double
Parameters
units
Type: Rhino.UnitSystem
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.RhinoMath.MetersPerUnit(Rhino.UnitSystem)"]
See Also
Reference
RhinoMath Class
Rhino Namespace