RhinoCommon API
HiddenLineDrawing.Compute Method (HiddenLineDrawingParameters, Boolean, IProgress<Double>, CancellationToken)
 Perform the hidden line drawing calculation based on input parameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static HiddenLineDrawing Compute(
	HiddenLineDrawingParameters parameters,
	bool multipleThreads,
	IProgress<double> progress,
	CancellationToken cancelToken
)
Public Shared Function Compute (
	parameters As HiddenLineDrawingParameters,
	multipleThreads As Boolean,
	progress As IProgress(Of Double),
	cancelToken As CancellationToken
) As HiddenLineDrawing
Parameters
parameters
Type: Rhino.Geometry.HiddenLineDrawingParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.HiddenLineDrawing.Compute(Rhino.Geometry.HiddenLineDrawingParameters,System.Boolean,System.IProgress{System.Double},System.Threading.CancellationToken)"]
multipleThreads
Type: System.Boolean
[Missing <param name="multipleThreads"/> documentation for "M:Rhino.Geometry.HiddenLineDrawing.Compute(Rhino.Geometry.HiddenLineDrawingParameters,System.Boolean,System.IProgress{System.Double},System.Threading.CancellationToken)"]
progress
Type: System.IProgress<Double>
[Missing <param name="progress"/> documentation for "M:Rhino.Geometry.HiddenLineDrawing.Compute(Rhino.Geometry.HiddenLineDrawingParameters,System.Boolean,System.IProgress{System.Double},System.Threading.CancellationToken)"]
cancelToken
Type: System.Threading.CancellationToken
[Missing <param name="cancelToken"/> documentation for "M:Rhino.Geometry.HiddenLineDrawing.Compute(Rhino.Geometry.HiddenLineDrawingParameters,System.Boolean,System.IProgress{System.Double},System.Threading.CancellationToken)"]
Return Value
Type: HiddenLineDrawing
Results of calculation on success, null on failure or cancellation
See Also
Reference
HiddenLineDrawing Class
Compute Overload
Rhino.Geometry Namespace