RhinoCommon API
RhinoApp.SetCommandPromptMessage Method
 Set the text that appears in the Rhino command prompt. In general, you should use the SetCommandPrompt functions. In rare cases, like worker thread messages, the message that appears in the prompt has non-standard formatting. In these rare cases, SetCommandPromptMessage can be used to literally specify the text that appears in the command prompt window.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void SetCommandPromptMessage(
	string prompt
)
Public Shared Sub SetCommandPromptMessage (
	prompt As String
)
Parameters
prompt
Type: System.String
A literal text for the command prompt window.
See Also
Reference
RhinoApp Class
Rhino Namespace