RhinoCommon API
LengthValue.Create Method (Double, UnitSystem, LengthValue.StringFormat)
Create from Length and UnitSystem
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static LengthValue Create(
	double length,
	UnitSystem us,
	LengthValue.StringFormat format
)
Public Shared Function Create (
	length As Double,
	us As UnitSystem,
	format As LengthValue.StringFormat
) As LengthValue
Parameters
length
Type: System.Double
Numeric length value
us
Type: Rhino.UnitSystem
Unit system
format
Type: Rhino.LengthValue.StringFormat
[Missing <param name="format"/> documentation for "M:Rhino.LengthValue.Create(System.Double,Rhino.UnitSystem,Rhino.LengthValue.StringFormat)"]
Return Value
Type: LengthValue
[Missing <returns> documentation for "M:Rhino.LengthValue.Create(System.Double,Rhino.UnitSystem,Rhino.LengthValue.StringFormat)"]
See Also
Reference
LengthValue Class
Create Overload
Rhino Namespace