RhinoCommon API
ThumbnailViewModelFactory Constructor
Initializes a new instance of the ThumbnailViewModelFactory class
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ThumbnailViewModelFactory()
Public Sub New
See Also
Reference
ThumbnailViewModelFactory Class
Rhino.UI.Controls.ThumbnailUI Namespace