RhinoCommon API
RhinoPageView.Duplicate Method
Copies a page view.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public RhinoPageView Duplicate(
	bool duplicatePageGeometry
)
Public Function Duplicate (
	duplicatePageGeometry As Boolean
) As RhinoPageView
Parameters
duplicatePageGeometry
Type: System.Boolean
Set true if you want the page view geometry copied, along with the view.
Return Value
Type: RhinoPageView
The new page view if successful, null otherwise.
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace