RhinoCommon API
Mesh.CreateFromSurface Method (Surface)
 Constructs a mesh from a surface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public static Mesh CreateFromSurface(
	Surface surface
)
Public Shared Function CreateFromSurface (
	surface As Surface
) As Mesh
Parameters
surface
Type: Rhino.Geometry.Surface
Surface to approximate
Return Value
Type: Mesh
New mesh representing the surface
See Also
Reference
Mesh Class
CreateFromSurface Overload
Rhino.Geometry Namespace