RhinoCommon API
StatusBar.SetNumberPane Method
 Sets the number pane to a number value
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void SetNumberPane(
	double number
)
Public Shared Sub SetNumberPane (
	number As Double
)
Parameters
number
Type: System.Double
[Missing <param name="number"/> documentation for "M:Rhino.UI.StatusBar.SetNumberPane(System.Double)"]
See Also
Reference
StatusBar Class
Rhino.UI Namespace