RhinoCommon API
SimpleArraySurfacePointer.ToNonConstArray Method
 Copies the unmanaged array to a managed counterpart. Elements are made non-constant.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Surface[] ToNonConstArray()
Public Function ToNonConstArray As Surface()
Return Value
Type: Surface[]
The managed array.
See Also
Reference
SimpleArraySurfacePointer Class
Rhino.Runtime.InteropWrappers Namespace