RhinoCommon API
UserInterfaceGrid.SetColumnFixedWidth Method
 Give a column a width in logical pixels that is never resized.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetColumnFixedWidth(
	int column,
	double width
)
Public Sub SetColumnFixedWidth (
	column As Integer,
	width As Double
)
Parameters
column
Type: System.Int32
[Missing <param name="column"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetColumnFixedWidth(System.Int32,System.Double)"]
width
Type: System.Double
[Missing <param name="width"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetColumnFixedWidth(System.Int32,System.Double)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace