RhinoCommon API
Dialogs.ShowEditBox Method
 Displays Rhino's string edit box.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool ShowEditBox(
	string title,
	string message,
	string defaultText,
	bool multiline,
	out string text
)
Public Shared Function ShowEditBox (
	title As String,
	message As String,
	defaultText As String,
	multiline As Boolean,
	<OutAttribute> ByRef text As String
) As Boolean
Parameters
title
Type: System.String
The dialog title.
message
Type: System.String
The dialog message.
defaultText
Type: System.String
The default text.
multiline
Type: System.Boolean
Set true for multi line editing.
text
Type: System.String
The modified text.
Return Value
Type: Boolean
true of OK was clicked, false otherwise.
See Also
Reference
Dialogs Class
Rhino.UI Namespace