RhinoCommon API
Transform.PlanarProjection Method
 Constructs a projection transformation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Transform PlanarProjection(
	Plane plane
)
Public Shared Function PlanarProjection (
	plane As Plane
) As Transform
Parameters
plane
Type: Rhino.Geometry.Plane
Plane onto which everything will be perpendicularly projected.
Return Value
Type: Transform
A transformation matrix which projects geometry onto a specified plane.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace