RhinoCommon API
PolyCurve.Duplicate Method
 Duplicates this polycurve.
When not overridden in a derived class, this calls DuplicatePolyCurve().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override GeometryBase Duplicate()
Public Overrides Function Duplicate As GeometryBase
Return Value
Type: GeometryBase
An exact duplicate of this curve.
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace