RhinoCommon API
TextureCache.GetSize Method
 Gets the pixel size of the texture registered under the given name.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Size GetSize(
	string name
)
Public Shared Function GetSize (
	name As String
) As Size
Parameters
name
Type: System.String
The name to look for.
Return Value
Type: Size
 The size of the texture, or Empty if nothing is registered under this name.
See Also
Reference
TextureCache Class
Rhino.Display Namespace