RhinoCommon API
RenderPipeline.GetRenderWindow Method (ViewportInfo, Boolean)
 As GetRenderWindow(). The parameter withWireframeChannel controls whether the returned RenderWindow will have the channel added. The parameter fromRenderViewSource controls from where the RenderSize is queried. The viewportInfo instance will be used to set up wireframe channel. This is necessary for rendering different view than is currently active in the viewport
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public RenderWindow GetRenderWindow(
	ViewportInfo viewportInfo,
	bool fromRenderViewSource
)
Public Function GetRenderWindow (
	viewportInfo As ViewportInfo,
	fromRenderViewSource As Boolean
) As RenderWindow
Parameters
viewportInfo
Type: Rhino.DocObjects.ViewportInfo
ViewportInfo used to generate the wireframe channel for
fromRenderViewSource
Type: System.Boolean
true if the RenderWindow size needs to be set from RenderViewSource size. false will use the active view.
Return Value
Type: RenderWindow
RenderWindow if one exists, null otherwise (i.e. rendering has already completed).
See Also
Reference
RenderPipeline Class
GetRenderWindow Overload
Rhino.Render Namespace