RhinoCommon API
UserInterfaceButton.OnMouseClick Method
[Missing <summary> documentation for "M:Rhino.UI.UserInterfaceButton.OnMouseClick(Rhino.UI.MouseState)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void OnMouseClick(
	MouseState mouse
)
Protected Overrides Sub OnMouseClick (
	mouse As MouseState
)
Parameters
mouse
Type: Rhino.UI.MouseState
[Missing <param name="mouse"/> documentation for "M:Rhino.UI.UserInterfaceButton.OnMouseClick(Rhino.UI.MouseState)"]
See Also
Reference
UserInterfaceButton Class
Rhino.UI Namespace