RhinoCommon API
SimpleArrayArrayPoint3d.ConstPointer Method
 Gets the constant (immutable) pointer of this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
The constant pointer.
See Also
Reference
SimpleArrayArrayPoint3d Class
Rhino.Runtime.InteropWrappers Namespace