RhinoCommon API
MeshingParameters Constructor (MeshingParameters)
 Initializes a new instance copying values from source.
Initial values are same as Default.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public MeshingParameters(
	MeshingParameters source
)
Public Sub New (
	source As MeshingParameters
)
Parameters
source
Type: Rhino.Geometry.MeshingParameters
[Missing <param name="source"/> documentation for "M:Rhino.Geometry.MeshingParameters.#ctor(Rhino.Geometry.MeshingParameters)"]
See Also
Reference
MeshingParameters Class
MeshingParameters Overload
Rhino.Geometry Namespace