RhinoCommon API
IZooClientUtilities.ShowLicenseValidationUi Method
 Shows user interface to validate and register a license. Returns true if the license is successfully validated; false otherwise
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool ShowLicenseValidationUi(
	Object verify,
	string cdkey
)
Function ShowLicenseValidationUi (
	verify As Object,
	cdkey As String
) As Boolean
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.ShowLicenseValidationUi(System.Object,System.String)"]
cdkey
Type: System.String
[Missing <param name="cdkey"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.ShowLicenseValidationUi(System.Object,System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.ShowLicenseValidationUi(System.Object,System.String)"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace