RhinoCommon API
ArchivableDictionary.GetInteger Method (String, Int32)
 Get value as int, will return defaultValue unless value was created using Set(string key, int value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int GetInteger(
	string key,
	int defaultValue
)
Public Function GetInteger (
	key As String,
	defaultValue As Integer
) As Integer
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetInteger(System.String,System.Int32)"]
defaultValue
Type: System.Int32
[Missing <param name="defaultValue"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetInteger(System.String,System.Int32)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetInteger(System.String,System.Int32)"]
See Also
Reference
ArchivableDictionary Class
GetInteger Overload
Rhino.Collections Namespace