RhinoCommon API
LinetypeTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LinetypeTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override IEnumerator<Linetype> GetEnumerator()
Public Overrides Function GetEnumerator As IEnumerator(Of Linetype)
Return Value
Type: IEnumerator<Linetype>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LinetypeTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
IEnumerable<T>.GetEnumerator()
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace