RhinoCommon API
PolylineCurve.ToArray Method
 Returns the underlying Polyline points as an array.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public Point3d[] ToArray()
Public Function ToArray As Point3d()
Return Value
Type: Point3d[]
An array of 3d points.
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace