RhinoCommon API
RenderContent.FromXml Method (String, RhinoDoc)
 Creates a new content from the XML data. The resulting content will not be attached to the document.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public static RenderContent FromXml(
	string xml,
	RhinoDoc doc
)
Public Shared Function FromXml (
	xml As String,
	doc As RhinoDoc
) As RenderContent
Parameters
xml
Type: System.String
The input XML data.
doc
Type: Rhino.RhinoDoc
The document that the content will be associated with for units, linear workflow purposes.
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.FromXml(System.String,Rhino.RhinoDoc)"]
See Also
Reference
RenderContent Class
FromXml Overload
Rhino.Render Namespace