RhinoCommon API
RenderContent.CreateDynamicField Method
 Create a dynamic field with an initial value and min and max limits.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool CreateDynamicField(
	string internalName,
	string localName,
	string englishName,
	Object value,
	Object minValue,
	Object maxValue,
	int sectionId
)
Public Function CreateDynamicField (
	internalName As String,
	localName As String,
	englishName As String,
	value As Object,
	minValue As Object,
	maxValue As Object,
	sectionId As Integer
) As Boolean
Parameters
internalName
Type: System.String
 is the internal name of the field. Not localized.
localName
Type: System.String
 is the localized user-friendly name of the field.
englishName
Type: System.String
 is the English user-friendly name of the field.
value
Type: System.Object
 is the initial value of the field.
minValue
Type: System.Object
 is the minimum value of the field. Must be the same type as vValue.
maxValue
Type: System.Object
 is the maximum value of the field. Must be the same type as vValue.
sectionId
Type: System.Int32
 is used for filtering fields between sections. Zero if not needed.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.CreateDynamicField(System.String,System.String,System.String,System.Object,System.Object,System.Object,System.Int32)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace