RhinoCommon API
FileSettings.DeleteSearchPath Method
 Removes an existing imagePath from Rhino's search imagePath list. See "Options Files settings" in the Rhino help file for more details.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool DeleteSearchPath(
	string folder
)
Public Shared Function DeleteSearchPath (
	folder As String
) As Boolean
Parameters
folder
Type: System.String
[in] The valid folder, or imagePath, to remove.
Return Value
Type: Boolean
true or false indicating success or failure.
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace