RhinoCommon API
Skin.OnBuiltInCommandsRegistered Method
Is called when built-in commands are registered.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnBuiltInCommandsRegistered()
Protected Overridable Sub OnBuiltInCommandsRegistered
See Also
Reference
Skin Class
Rhino.Runtime Namespace