RhinoCommon API
RenderTexture.GetEnvironmentMappingMode Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetEnvironmentMappingMode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public TextureEnvironmentMappingMode GetEnvironmentMappingMode()
Public Function GetEnvironmentMappingMode As TextureEnvironmentMappingMode
Return Value
Type: TextureEnvironmentMappingMode
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetEnvironmentMappingMode"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace