RhinoCommon API
File3dmRenderMaterials.Find Method
 Finds a material by its id, if possible. Returns null on failure.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmRenderMaterial Find(
	Guid g
)
Public Function Find (
	g As Guid
) As File3dmRenderMaterial
Parameters
g
Type: System.Guid
[Missing <param name="g"/> documentation for "M:Rhino.FileIO.File3dmRenderMaterials.Find(System.Guid)"]
Return Value
Type: File3dmRenderMaterial
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderMaterials.Find(System.Guid)"]
See Also
Reference
File3dmRenderMaterials Class
Rhino.FileIO Namespace