RhinoCommon API
PointCloud.AddRange Method (IEnumerable<Point3d>, IEnumerable<Color>)
 Appends a collection of points and normal vectors to this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void AddRange(
	IEnumerable<Point3d> points,
	IEnumerable<Color> colors
)
Public Sub AddRange (
	points As IEnumerable(Of Point3d),
	colors As IEnumerable(Of Color)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to append.
colors
Type: System.Collections.Generic.IEnumerable<Color>
Colors to append.
See Also
Reference
PointCloud Class
AddRange Overload
Rhino.Geometry Namespace