RhinoCommon API
IRdkViewModel.GetData Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRdkViewModel.GetData(System.Guid,System.Boolean,System.Boolean)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
Object GetData(
	Guid uuidDataType,
	bool bForWrite,
	bool bAutoChangeBracket
)
Function GetData (
	uuidDataType As Guid,
	bForWrite As Boolean,
	bAutoChangeBracket As Boolean
) As Object
Parameters
uuidDataType
Type: System.Guid
[Missing <param name="uuidDataType"/> documentation for "M:Rhino.UI.Controls.IRdkViewModel.GetData(System.Guid,System.Boolean,System.Boolean)"]
bForWrite
Type: System.Boolean
[Missing <param name="bForWrite"/> documentation for "M:Rhino.UI.Controls.IRdkViewModel.GetData(System.Guid,System.Boolean,System.Boolean)"]
bAutoChangeBracket
Type: System.Boolean
[Missing <param name="bAutoChangeBracket"/> documentation for "M:Rhino.UI.Controls.IRdkViewModel.GetData(System.Guid,System.Boolean,System.Boolean)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRdkViewModel.GetData(System.Guid,System.Boolean,System.Boolean)"]
See Also
Reference
IRdkViewModel Interface
Rhino.UI.Controls Namespace