RhinoCommon API
RenderPlugIn.RegisterRenderPanels Method
 Override this method and call RegisterPanel(PlugIn, RenderPanelType, Type, String, Boolean, Boolean) to add custom render UI to the render output window.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void RegisterRenderPanels(
	RenderPanels panels
)
Protected Overridable Sub RegisterRenderPanels (
	panels As RenderPanels
)
Parameters
panels
Type: Rhino.Render.RenderPanels
[Missing <param name="panels"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.RegisterRenderPanels(Rhino.Render.RenderPanels)"]
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace