RhinoCommon API
EmapAnalysisSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static EmapAnalysisSettingsState GetDefaultState()
Public Shared Function GetDefaultState As EmapAnalysisSettingsState
Return Value
Type: EmapAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.EmapAnalysisSettings.GetDefaultState"]
See Also
Reference
EmapAnalysisSettings Class
Rhino.ApplicationSettings Namespace