RhinoCommon API
Intersection.PlaneBoundingBox Method
 Intersects a plane and a bounding box.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool PlaneBoundingBox(
	Plane plane,
	BoundingBox boundingBox,
	out Polyline polyline
)
Public Shared Function PlaneBoundingBox (
	plane As Plane,
	boundingBox As BoundingBox,
	<OutAttribute> ByRef polyline As Polyline
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
The plane.
boundingBox
Type: Rhino.Geometry.BoundingBox
The bounding box.
polyline
Type: Rhino.Geometry.Polyline
The output polyline if successful.
Return Value
Type: Boolean
 True if successful, false otherwise.
Remarks
 Intersects the four bounding box infinite lines in the direction of the max coordinate with the plane. Point and single line intersections are ignored.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace