RhinoCommon API
Point4d.Equality Operator
 Determines whether two Point4d have equal values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool operator ==(
	Point4d a,
	Point4d b
)
Public Shared Operator = (
	a As Point4d,
	b As Point4d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point4d
The first point.
b
Type: Rhino.Geometry.Point4d
The second point.
Return Value
Type: Boolean
true if the coordinates of the two points are equal; otherwise false.
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace