RhinoCommon API
Extrusion.Create Method (Curve, Plane, Double, Boolean)
 Create an extrusion from a 3d curve, a plane and a height.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Extrusion Create(
	Curve curve,
	Plane plane,
	double height,
	bool cap
)
Public Shared Function Create (
	curve As Curve,
	plane As Plane,
	height As Double,
	cap As Boolean
) As Extrusion
Parameters
curve
Type: Rhino.Geometry.Curve
A continuous 3d curve.
plane
Type: Rhino.Geometry.Plane
A plane. The 3d curve is projected to this plane and the result is passed to SetOuterProfile(Curve, Boolean).
height
Type: System.Double
 If the height > 0, the bottom of the extrusion will be in plane and the top will be height units above the plane. If the height < 0, the top of the extrusion will be in plane and the bottom will be height units below the plane. The plane used is the one that is returned from the curve's TryGetPlane function.
cap
Type: System.Boolean
 If the curve is closed and cap is true, then the resulting extrusion is capped.
Return Value
Type: Extrusion
 If the input is valid, then a new extrusion is returned. Otherwise null is returned
See Also
Reference
Extrusion Class
Create Overload
Rhino.Geometry Namespace