RhinoCommon API
ObjectTable.AddAngularDimension Method (AngularDimension, ObjectAttributes)
 Adds a angular dimension object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddAngularDimension(
	AngularDimension dimension,
	ObjectAttributes attributes
)
Public Function AddAngularDimension (
	dimension As AngularDimension,
	attributes As ObjectAttributes
) As Guid
Parameters
dimension
Type: Rhino.Geometry.AngularDimension
Dimension object to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddAngularDimension(Rhino.Geometry.AngularDimension,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddAngularDimension Overload
Rhino.DocObjects.Tables Namespace