RhinoCommon API
GetArc Constructor
Initializes a new instance of the GetArc class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public GetArc()
Public Sub New
See Also
Reference
GetArc Class
Rhino.Input.Custom Namespace