RhinoCommon API
RhinoDoc.Equals Method
[Missing <summary> documentation for "M:Rhino.RhinoDoc.Equals(System.Object)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
[Missing <param name="obj"/> documentation for "M:Rhino.RhinoDoc.Equals(System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoDoc.Equals(System.Object)"]
See Also
Reference
RhinoDoc Class
Rhino Namespace