RhinoCommon API
NurbsCurve.ConvertSpanToBezier Method
 Converts a span of the NURBS curve into a Bezier.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.25
Syntax
public BezierCurve ConvertSpanToBezier(
	int spanIndex
)
Public Function ConvertSpanToBezier (
	spanIndex As Integer
) As BezierCurve
Parameters
spanIndex
Type: System.Int32
The span index, where (0 <= spanIndex <= Points.Count - Order).
Return Value
Type: BezierCurve
Bezier curve if successful, null otherwise.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace