RhinoCommon API
GetTransform Constructor
Initializes a new instance of the GetTransform class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected GetTransform()
Protected Sub New
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace