RhinoCommon API
FileCsvDocument.GetEnumerator Method
 Returns an enumerator that iterates over the committed rows of the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IEnumerator<string[]> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of String())
Return Value
Type: IEnumerator<String[]>
[Missing <returns> documentation for "M:Rhino.FileIO.FileCsvDocument.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace