RhinoCommon API
CustomPointObject.Dispose Method
Releases all resources used by the CustomPointObject
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
CustomPointObject Class
Dispose Overload
Rhino.DocObjects.Custom Namespace