RhinoCommon API
IZooClientUtilities.GetCurrentTime Method
 Gets the current time, trying to access an NTP server before using local time.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
DateTime GetCurrentTime()
Function GetCurrentTime As DateTime
Return Value
Type: DateTime
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.GetCurrentTime"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace