RhinoCommon API
PlugIn.ReturnLicense Method
 Returns, or releases, a product license that was obtained from the Rhino licensing system. Note, most plug-ins do not need to call this as the Rhino licensing system will return all licenses when Rhino shuts down.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
protected bool ReturnLicense()
Protected Function ReturnLicense As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.ReturnLicense"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace