RhinoCommon API
MeshNgon.FaceIndexList Method
 Get the ngon's mesh face index list.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint[] FaceIndexList()
Public Function FaceIndexList As UInteger()
Return Value
Type: UInt32[]
A list of mesh face indexes.
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace