RhinoCommon API
BinaryArchiveWriter.WriteGeometryArray Method
[Missing <summary> documentation for "M:Rhino.FileIO.BinaryArchiveWriter.WriteGeometryArray(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void WriteGeometryArray(
	IEnumerable<GeometryBase> geometry
)
Public Sub WriteGeometryArray (
	geometry As IEnumerable(Of GeometryBase)
)
Parameters
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
[Missing <param name="geometry"/> documentation for "M:Rhino.FileIO.BinaryArchiveWriter.WriteGeometryArray(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})"]
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace