RhinoCommon API
SubD.CreateSubDBox Method (IEnumerable<Point3d>, Double, UInt32, UInt32, UInt32)
 Creates a SubD box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static SubD CreateSubDBox(
	IEnumerable<Point3d> corners,
	double edgeSharpness,
	uint faceCountX,
	uint faceCountY,
	uint faceCountZ
)
Public Shared Function CreateSubDBox (
	corners As IEnumerable(Of Point3d),
	edgeSharpness As Double,
	faceCountX As UInteger,
	faceCountY As UInteger,
	faceCountZ As UInteger
) As SubD
Parameters
corners
Type: System.Collections.Generic.IEnumerable<Point3d>
 The eight box corners. The first four are the bottom face, in order around it, and the last four are the top face, in the same order.
edgeSharpness
Type: System.Double
 The sharpness to give the edges where box sides meet. SmoothValue leaves them smooth and CreaseValue makes them creases.
faceCountX
Type: System.UInt32
Number of faces along the first bottom edge.
faceCountY
Type: System.UInt32
Number of faces along the second bottom edge.
faceCountZ
Type: System.UInt32
Number of faces from the bottom face to the top face.
Return Value
Type: SubD
A new SubD box, or null if the input is not valid.
See Also
Reference
SubD Class
CreateSubDBox Overload
Rhino.Geometry Namespace