RhinoCommon API
CurvatureAnalysisSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static CurvatureAnalysisSettingsState GetDefaultState()
Public Shared Function GetDefaultState As CurvatureAnalysisSettingsState
Return Value
Type: CurvatureAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.CurvatureAnalysisSettings.GetDefaultState"]
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace