RhinoCommon API
CommonObject.IsValidWithLog Method
 Determines if an object is valid. Also provides a report on errors if this object happens not to be valid.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsValidWithLog(
	out string log
)
Public Function IsValidWithLog (
	<OutAttribute> ByRef log As String
) As Boolean
Parameters
log
Type: System.String
A textual log. This out parameter is assigned during this call.
Return Value
Type: Boolean
true if this object is valid; false otherwise.
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace