RhinoCommon API
ArchivableDictionary.Set Method (String, Single)
 Sets a Single.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Set(
	string key,
	float val
)
Public Function Set (
	key As String,
	val As Single
) As Boolean
Parameters
key
Type: System.String
The text key.
val
Type: System.Single
A Single.
Because Single has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
true if set operation succeeded, otherwise false.
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace