RhinoCommon API
PageViewGroupTable.FindIndex Method
 Finds a page view group given its index.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PageViewGroup FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As PageViewGroup
Parameters
index
Type: System.Int32
Zero-based page view group index.
Return Value
Type: PageViewGroup
An page view group, or null if not found or on error.
See Also
Reference
PageViewGroupTable Class
Rhino.DocObjects.Tables Namespace