RhinoCommon API
CommandLineOption.ListOptions Method
 If this OptionType is a list, then the option should contain a list of values that the user can pick from.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string[] ListOptions(
	bool english
)
Public Function ListOptions (
	english As Boolean
) As String()
Parameters
english
Type: System.Boolean
return the English or local versions of the list options
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.Input.Custom.CommandLineOption.ListOptions(System.Boolean)"]
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace