RhinoCommon API
UserInterfaceObjectBase.OnMouseLeave Method
 Called when the mouse leaves this object
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnMouseLeave(
	MouseState mouse
)
Protected Overridable Sub OnMouseLeave (
	mouse As MouseState
)
Parameters
mouse
Type: Rhino.UI.MouseState
[Missing <param name="mouse"/> documentation for "M:Rhino.UI.UserInterfaceObjectBase.OnMouseLeave(Rhino.UI.MouseState)"]
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace