RhinoCommon API
PlugIn.GetPluginSettings Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.GetPluginSettings(System.Guid,System.Boolean)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static PersistentSettings GetPluginSettings(
	Guid plugInId,
	bool load
)
Public Shared Function GetPluginSettings (
	plugInId As Guid,
	load As Boolean
) As PersistentSettings
Parameters
plugInId
Type: System.Guid
[Missing <param name="plugInId"/> documentation for "M:Rhino.PlugIns.PlugIn.GetPluginSettings(System.Guid,System.Boolean)"]
load
Type: System.Boolean
[Missing <param name="load"/> documentation for "M:Rhino.PlugIns.PlugIn.GetPluginSettings(System.Guid,System.Boolean)"]
Return Value
Type: PersistentSettings
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.GetPluginSettings(System.Guid,System.Boolean)"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace