RhinoCommon API
DimensionStyle.CreatePreviewBitmap Method (Int32, Int32)
[Missing <summary> documentation for "M:Rhino.DocObjects.DimensionStyle.CreatePreviewBitmap(System.Int32,System.Int32)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Bitmap CreatePreviewBitmap(
	int width,
	int height
)
Public Function CreatePreviewBitmap (
	width As Integer,
	height As Integer
) As Bitmap
Parameters
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.DocObjects.DimensionStyle.CreatePreviewBitmap(System.Int32,System.Int32)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.DocObjects.DimensionStyle.CreatePreviewBitmap(System.Int32,System.Int32)"]
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.DocObjects.DimensionStyle.CreatePreviewBitmap(System.Int32,System.Int32)"]
See Also
Reference
DimensionStyle Class
CreatePreviewBitmap Overload
Rhino.DocObjects Namespace