RhinoCommon API
DisplayPoint.WithAttributes Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayPoint.WithAttributes(Rhino.Display.DisplayPointAttributes)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public DisplayPoint WithAttributes(
	DisplayPointAttributes attributes
)
Public Function WithAttributes (
	attributes As DisplayPointAttributes
) As DisplayPoint
Parameters
attributes
Type: Rhino.Display.DisplayPointAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.Display.DisplayPoint.WithAttributes(Rhino.Display.DisplayPointAttributes)"]
Return Value
Type: DisplayPoint
[Missing <returns> documentation for "M:Rhino.Display.DisplayPoint.WithAttributes(Rhino.Display.DisplayPointAttributes)"]
See Also
Reference
DisplayPoint Class
Rhino.Display Namespace