RhinoCommon API
RenderPrimitive.TryGetCone Method
 Call this method to get a Cone primitive for this mesh. If this meshes PrimitiveType is not a Cone then the cone parameter is set to Unset and the truncation parameter is set to Unset.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool TryGetCone(
	out Cone cone,
	out Plane truncation
)
Public Function TryGetCone (
	<OutAttribute> ByRef cone As Cone,
	<OutAttribute> ByRef truncation As Plane
) As Boolean
Parameters
cone
Type: Rhino.Geometry.Cone
 Gets set to the cone primitive for this object on success or Unset on error.
truncation
Type: Rhino.Geometry.Plane
 Gets set to the truncation plane for this object on success or Unset on error.
Return Value
Type: Boolean
 Returns true if PrimitiveType is Cone and the cone and truncation parameters were initialized otherwise returns false.
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace