RhinoCommon API
ViewportInfo.GetScreenPort Method
 Gets the location of viewport in pixels. See documentation for SetScreenPort.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Rectangle GetScreenPort()
Public Function GetScreenPort As Rectangle
Return Value
Type: Rectangle
The rectangle, or Empty rectangle on error.
See Also
Reference
ViewportInfo Class
GetScreenPort Overload
Rhino.DocObjects Namespace