RhinoCommon API
ContentUI.Finalize Method
 ContentUI destructor
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
ContentUI Class
Rhino.UI.Controls Namespace