RhinoCommon API
FieldDictionary.Add Method (String, DateTime, String, Int32)
 Add a new DateTimeField to the dictionary.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public DateTimeField Add(
	string key,
	DateTime value,
	string prompt,
	int sectionId
)
Public Function Add (
	key As String,
	value As DateTime,
	prompt As String,
	sectionId As Integer
) As DateTimeField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: System.DateTime
Initial value for this field.
prompt
Type: System.String
 Prompt to display in the user interface (Content Browsers) if this is null or an empty string the this field is a data only field and will not appear in the user interface.
sectionId
Type: System.Int32
The id of the section containing the field
Return Value
Type: DateTimeField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,System.DateTime,System.String,System.Int32)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace