RhinoCommon API
RenderContentCollection.Set Method
 Set an array of const contents as the collection.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Set(
	RenderContentCollection collection
)
Public Sub Set (
	collection As RenderContentCollection
)
Parameters
collection
Type: Rhino.Render.RenderContentCollection
The array of contents to set.
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace