RhinoCommon API
ObjectTable.AddRhinoObject Method (CustomBrepObject, HistoryRecord)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomBrepObject,Rhino.DocObjects.HistoryRecord)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public void AddRhinoObject(
	CustomBrepObject brepObject,
	HistoryRecord history
)
Public Sub AddRhinoObject (
	brepObject As CustomBrepObject,
	history As HistoryRecord
)
Parameters
brepObject
Type: Rhino.DocObjects.Custom.CustomBrepObject
[Missing <param name="brepObject"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomBrepObject,Rhino.DocObjects.HistoryRecord)"]
history
Type: Rhino.DocObjects.HistoryRecord
[Missing <param name="history"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomBrepObject,Rhino.DocObjects.HistoryRecord)"]
See Also
Reference
ObjectTable Class
AddRhinoObject Overload
Rhino.DocObjects.Tables Namespace