RhinoCommon API
ColorHSV Implicit Conversion (ColorHSV to Color)
 Implicitly converts a ColorHSV in a .Net library color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static implicit operator Color (
	ColorHSV hsv
)
Public Shared Widening Operator CType (
	hsv As ColorHSV
) As Color
Parameters
hsv
Type: Rhino.Display.ColorHSV
A HSV color.
Return Value
Type: Color
A ARGB .Net library color.
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace