RhinoCommon API
SubDEdgeChain.ToNurbsCurve Method
 Gets a NURBS curve on the SubD surface following this chain.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public NurbsCurve ToNurbsCurve()
Public Function ToNurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
The curve, or null if the chain is not valid.
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace