RhinoCommon API
RenderPlugIn.RenderWindow Method (RhinoDoc, RunMode, Boolean, RhinoView, Rectangle, Boolean)
 This function is obsolete and only exists for legacy purposes. Do not override this function - prefer overriding the version with the blowup parameter.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual Result RenderWindow(
	RhinoDoc doc,
	RunMode modes,
	bool fastPreview,
	RhinoView view,
	Rectangle rect,
	bool inWindow
)
Protected Overridable Function RenderWindow (
	doc As RhinoDoc,
	modes As RunMode,
	fastPreview As Boolean,
	view As RhinoView,
	rect As Rectangle,
	inWindow As Boolean
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.RenderWindow(Rhino.RhinoDoc,Rhino.Commands.RunMode,System.Boolean,Rhino.Display.RhinoView,System.Drawing.Rectangle,System.Boolean)"]
modes
Type: Rhino.Commands.RunMode
[Missing <param name="modes"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.RenderWindow(Rhino.RhinoDoc,Rhino.Commands.RunMode,System.Boolean,Rhino.Display.RhinoView,System.Drawing.Rectangle,System.Boolean)"]
fastPreview
Type: System.Boolean
[Missing <param name="fastPreview"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.RenderWindow(Rhino.RhinoDoc,Rhino.Commands.RunMode,System.Boolean,Rhino.Display.RhinoView,System.Drawing.Rectangle,System.Boolean)"]
view
Type: Rhino.Display.RhinoView
[Missing <param name="view"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.RenderWindow(Rhino.RhinoDoc,Rhino.Commands.RunMode,System.Boolean,Rhino.Display.RhinoView,System.Drawing.Rectangle,System.Boolean)"]
rect
Type: System.Drawing.Rectangle
[Missing <param name="rect"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.RenderWindow(Rhino.RhinoDoc,Rhino.Commands.RunMode,System.Boolean,Rhino.Display.RhinoView,System.Drawing.Rectangle,System.Boolean)"]
inWindow
Type: System.Boolean
[Missing <param name="inWindow"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.RenderWindow(Rhino.RhinoDoc,Rhino.Commands.RunMode,System.Boolean,Rhino.Display.RhinoView,System.Drawing.Rectangle,System.Boolean)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.PlugIns.RenderPlugIn.RenderWindow(Rhino.RhinoDoc,Rhino.Commands.RunMode,System.Boolean,Rhino.Display.RhinoView,System.Drawing.Rectangle,System.Boolean)"]
See Also
Reference
RenderPlugIn Class
RenderWindow Overload
Rhino.PlugIns Namespace