RhinoCommon API
IRhinoUiDialogService.ShowEditBox Method
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowEditBox(System.String,System.String,System.String,System.Boolean,System.String@)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool ShowEditBox(
	string title,
	string message,
	string defaultText,
	bool multiline,
	out string text
)
Function ShowEditBox (
	title As String,
	message As String,
	defaultText As String,
	multiline As Boolean,
	<OutAttribute> ByRef text As String
) As Boolean
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowEditBox(System.String,System.String,System.String,System.Boolean,System.String@)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowEditBox(System.String,System.String,System.String,System.Boolean,System.String@)"]
defaultText
Type: System.String
[Missing <param name="defaultText"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowEditBox(System.String,System.String,System.String,System.Boolean,System.String@)"]
multiline
Type: System.Boolean
[Missing <param name="multiline"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowEditBox(System.String,System.String,System.String,System.Boolean,System.String@)"]
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowEditBox(System.String,System.String,System.String,System.Boolean,System.String@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowEditBox(System.String,System.String,System.String,System.Boolean,System.String@)"]
See Also
Reference
IRhinoUiDialogService Interface
Rhino.UI Namespace