RhinoCommon API
PythonScript.GetVariable Method
 Gets the object associated with a variable name in the main scripting context.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public abstract Object GetVariable(
	string name
)
Public MustOverride Function GetVariable (
	name As String
) As Object
Parameters
name
Type: System.String
A variable name.
Return Value
Type: Object
The variable object.
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace