RhinoCommon API
PersistentSettings.GetDate Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetDate(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DateTime GetDate(
	string key
)
Public Function GetDate (
	key As String
) As DateTime
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetDate(System.String)"]
Return Value
Type: DateTime
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetDate(System.String)"]
See Also
Reference
PersistentSettings Class
GetDate Overload
Rhino Namespace