RhinoCommon API
Panels.GetPanel<T> Method (RhinoDoc)
 Return an instance of a .Net panel
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static T GetPanel<T>(
	RhinoDoc rhinoDoc
)
where T : class
Public Shared Function GetPanel(Of T As Class) (
	rhinoDoc As RhinoDoc
) As T
Parameters
rhinoDoc
Type: Rhino.RhinoDoc
 Runtime document Id associated with the requested panel.
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.UI.Panels.GetPanel``1(Rhino.RhinoDoc)"]
Return Value
Type: T
[Missing <returns> documentation for "M:Rhino.UI.Panels.GetPanel``1(Rhino.RhinoDoc)"]
See Also
Reference
Panels Class
GetPanel Overload
Rhino.UI Namespace