RhinoCommon API
SnapShotsClient.DocumentCategory Method
 Predefined document category
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string DocumentCategory()
Public Shared Function DocumentCategory As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.DocumentCategory"]
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace