RhinoCommon API
Mesh.GetCachedTextureCoordinates Method (Guid)
 Call this method to get cached texture coordinates for a texture mapping with the specified Id.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public CachedTextureCoordinates GetCachedTextureCoordinates(
	Guid textureMappingId
)
Public Function GetCachedTextureCoordinates (
	textureMappingId As Guid
) As CachedTextureCoordinates
Parameters
textureMappingId
Type: System.Guid
 Texture mapping Id
Return Value
Type: CachedTextureCoordinates
 Object which allows access to coordinates and other props.
See Also
Reference
Mesh Class
GetCachedTextureCoordinates Overload
Rhino.Geometry Namespace