RhinoCommon API
ViewInfo.SetWindowPosition Method
 Sets the position of the view window in the frame window, expressed as fractions (0 to 1) of the frame window size. The Maximized state is preserved.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetWindowPosition(
	double left,
	double right,
	double top,
	double bottom
)
Public Sub SetWindowPosition (
	left As Double,
	right As Double,
	top As Double,
	bottom As Double
)
Parameters
left
Type: System.Double
Left edge fraction.
right
Type: System.Double
Right edge fraction.
top
Type: System.Double
Top edge fraction.
bottom
Type: System.Double
Bottom edge fraction.
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace