RhinoCommon API
SupportOptions.CheckSupportFilesBeforeRendering Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.CheckSupportFilesBeforeRendering"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool CheckSupportFilesBeforeRendering()
Public Shared Function CheckSupportFilesBeforeRendering As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.CheckSupportFilesBeforeRendering"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace