RhinoCommon API
RhinoAccountsAuthTokenMismatchException Constructor (String, String, Exception)
 Generates a new instance of the exception.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RhinoAccountsAuthTokenMismatchException(
	string currentUsername,
	string newUsername,
	Exception innerException = null
)
Public Sub New (
	currentUsername As String,
	newUsername As String,
	Optional innerException As Exception = Nothing
)
Parameters
currentUsername
Type: System.String
The name of the currently logged in user.
newUsername
Type: System.String
The name of the newly logged in user.
innerException (Optional)
Type: System.Exception
The inner exception.
See Also
Reference
RhinoAccountsAuthTokenMismatchException Class
RhinoAccountsAuthTokenMismatchException Overload
Rhino.Runtime.RhinoAccounts Namespace