RhinoCommon API
Vector3f.Divide Method (Vector3f, Double)
 Divides a Vector3f by a number, having the effect of shrinking it, t times.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Vector3f Divide(
	Vector3f vector,
	double t
)
Public Shared Function Divide (
	vector As Vector3f,
	t As Double
) As Vector3f
Parameters
vector
Type: Rhino.Geometry.Vector3f
A vector.
t
Type: System.Double
A number.
Return Value
Type: Vector3f
A new vector that is component-wise divided by t.
See Also
Reference
Vector3f Structure
Divide Overload
Rhino.Geometry Namespace