RhinoCommon API
Mesh.CreateIcoSphere Method
 Constructs a icospherical mesh. A mesh icosphere differs from a standard UV mesh sphere in that it's vertices are evenly distributed. A mesh icosphere starts from an icosahedron (a regular polyhedron with 20 equilateral triangles). It is then refined by splitting each triangle into 4 smaller triangles. This splitting can be done several times.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Mesh CreateIcoSphere(
	Sphere sphere,
	int subdivisions
)
Public Shared Function CreateIcoSphere (
	sphere As Sphere,
	subdivisions As Integer
) As Mesh
Parameters
sphere
Type: Rhino.Geometry.Sphere
The input sphere provides the orienting plane and radius.
subdivisions
Type: System.Int32
 The number of times you want the faces split, where 0 <= subdivisions <= 7. Note, the total number of mesh faces produces is: 20 * (4 ^ subdivisions)
Return Value
Type: Mesh
A welded mesh icosphere if successful, or null on failure.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace