RhinoCommon API
ViewSettings.GetDefaultState Method
 Gets the view factory settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static ViewSettingsState GetDefaultState()
Public Shared Function GetDefaultState As ViewSettingsState
Return Value
Type: ViewSettingsState
A new view state with factory settings.
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace