RhinoCommon API
MeshPrincipalCurvatureList.Add Method
 Adds a new principal curvature to the end of the principal curvature list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Add(
	SurfaceCurvature surfaceCurvature
)
Public Function Add (
	surfaceCurvature As SurfaceCurvature
) As Integer
Parameters
surfaceCurvature
Type: Rhino.Geometry.SurfaceCurvature
Principal curvature to append.
Return Value
Type: Int32
The index of the newly added principal curvature.
See Also
Reference
MeshPrincipalCurvatureList Class
Rhino.Geometry.Collections Namespace