RhinoCommon API
PreviewLighting Constructor
 Constructor for PreivewLighting
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PreviewLighting(
	IntPtr pPreviewLighting
)
Public Sub New (
	pPreviewLighting As IntPtr
)
Parameters
pPreviewLighting
Type: System.IntPtr
[Missing <param name="pPreviewLighting"/> documentation for "M:Rhino.Render.PreviewLighting.#ctor(System.IntPtr)"]
See Also
Reference
PreviewLighting Class
Rhino.Render Namespace