RhinoCommon API
RenderContent.NewPreviewSceneServer Method
 Gets the PreviewSceneServer of the content
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PreviewSceneServer NewPreviewSceneServer(
	SceneServerData ssd
)
Public Function NewPreviewSceneServer (
	ssd As SceneServerData
) As PreviewSceneServer
Parameters
ssd
Type: Rhino.Render.SceneServerData
SceneServerData
Return Value
Type: PreviewSceneServer
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.NewPreviewSceneServer(Rhino.Render.SceneServerData)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace