RhinoCommon API
ViewTable.EnableCameraIcon Method
 Use to turn camera icon on and off
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void EnableCameraIcon(
	RhinoView view
)
Public Sub EnableCameraIcon (
	view As RhinoView
)
Parameters
view
Type: Rhino.Display.RhinoView
 If null, any camera icon is turned off. If not null, the camera icon for that view is turned on.
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace