RhinoCommon API
DisplayPipelineAttributes.GetSurfaceNakedEdgeThicknessUsage Method
 This is a helper function that combines getting SurfaceNakeEdgeUseNormalThickness and SurfaceNakedEdgeThicknessUsageFlags settings to correspond to the behavor of the Settings page.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public DisplayPipelineAttributes.SurfaceNakedEdgeThicknessUse GetSurfaceNakedEdgeThicknessUsage()
Public Function GetSurfaceNakedEdgeThicknessUsage As DisplayPipelineAttributes.SurfaceNakedEdgeThicknessUse
Return Value
Type: DisplayPipelineAttributes.SurfaceNakedEdgeThicknessUse
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipelineAttributes.GetSurfaceNakedEdgeThicknessUsage"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace