RhinoCommon API
DetailViewObject.GetFormattedScale Method
 Returns the detail view object's scale as a formatted string. The detail view object's viewport must be to parallel projection.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool GetFormattedScale(
	DetailViewObject.ScaleFormat format,
	out string value
)
Public Function GetFormattedScale (
	format As DetailViewObject.ScaleFormat,
	<OutAttribute> ByRef value As String
) As Boolean
Parameters
format
Type: Rhino.DocObjects.DetailViewObject.ScaleFormat
The scale format.
value
Type: System.String
The formatted string
Return Value
Type: Boolean
true if successful, false otherwise
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace