RhinoCommon API
WorksessionFile Constructor
Creates an empty worksession with no models.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFile()
Public Sub New
See Also
Reference
WorksessionFile Class
WorksessionFile Overload
Rhino.FileIO Namespace