RhinoCommon API
PersistentSettings.TryGetBool Method (String, Boolean, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetBool(System.String,System.Boolean@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetBool(
	string key,
	out bool value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetBool (
	key As String,
	<OutAttribute> ByRef value As Boolean,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetBool(System.String,System.Boolean@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetBool(System.String,System.Boolean@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetBool(System.String,System.Boolean@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetBool(System.String,System.Boolean@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetBool Overload
Rhino Namespace