RhinoCommon API
DisplayPipeline.RemoveClippingPlane Method
 Remove a clipping plane from the pipeline for this frame
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public void RemoveClippingPlane(
	int index
)
Public Sub RemoveClippingPlane (
	index As Integer
)
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Display.DisplayPipeline.RemoveClippingPlane(System.Int32)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace