RhinoCommon API
NotLicensedException Constructor (String, Exception)
 Create a new instance with a custom message and an inner exception
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public NotLicensedException(
	string message,
	Exception inner
)
Public Sub New (
	message As String,
	inner As Exception
)
Parameters
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.Runtime.NotLicensedException.#ctor(System.String,System.Exception)"]
inner
Type: System.Exception
[Missing <param name="inner"/> documentation for "M:Rhino.Runtime.NotLicensedException.#ctor(System.String,System.Exception)"]
See Also
Reference
NotLicensedException Class
NotLicensedException Overload
Rhino.Runtime Namespace