RhinoCommon API
PreviewJobSignature.ImageWidth Method
 The Width of the rendered preview image
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public int ImageWidth()
Public Function ImageWidth As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.PreviewJobSignature.ImageWidth"]
See Also
Reference
PreviewJobSignature Class
Rhino.Render Namespace