RhinoCommon API
PreviewSceneServer Constructor
Note: This API is now obsolete.
 Constructor for PreviewSceneServer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Do not use - will cause bugs.")]
public PreviewSceneServer(
	IntPtr pPreviewSceneServer
)
<ObsoleteAttribute("Do not use - will cause bugs.")>
Public Sub New (
	pPreviewSceneServer As IntPtr
)
Parameters
pPreviewSceneServer
Type: System.IntPtr
[Missing <param name="pPreviewSceneServer"/> documentation for "M:Rhino.Render.PreviewSceneServer.#ctor(System.IntPtr)"]
See Also
Reference
PreviewSceneServer Class
Rhino.Render Namespace