RhinoCommon API
Brep.WireCut Method (Curve, Vector3d, Vector3d, Double, Double, Boolean, Boolean, Double, Boolean, Brep[], Brep[])
 Cuts this solid brep with a single open cutting curve. The curve is extruded along direction into a sheet, then along trimDirection to close the sheet into a solid cutter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool WireCut(
	Curve openCurve,
	Vector3d direction,
	Vector3d trimDirection,
	double depth,
	double trimDepth,
	bool bothSides,
	bool trimBothSides,
	double tolerance,
	bool splitKinkyFaces,
	out Brep[] keptPieces,
	out Brep[] cutAwayPieces
)
Public Function WireCut (
	openCurve As Curve,
	direction As Vector3d,
	trimDirection As Vector3d,
	depth As Double,
	trimDepth As Double,
	bothSides As Boolean,
	trimBothSides As Boolean,
	tolerance As Double,
	splitKinkyFaces As Boolean,
	<OutAttribute> ByRef keptPieces As Brep(),
	<OutAttribute> ByRef cutAwayPieces As Brep()
) As Boolean
Parameters
openCurve
Type: Rhino.Geometry.Curve
Open cutting curve.
direction
Type: Rhino.Geometry.Vector3d
First extrusion direction (the wire sweep).
trimDirection
Type: Rhino.Geometry.Vector3d
Second extrusion direction that closes the cutter.
depth
Type: System.Double
Depth along direction. RhinoMath.UnsetValue or a value <= 0 cuts through and skips trim capping.
trimDepth
Type: System.Double
Depth along trimDirection. Ignored when cutting through.
bothSides
Type: System.Boolean
Extrude both ways along direction.
trimBothSides
Type: System.Boolean
Extrude both ways along trimDirection.
tolerance
Type: System.Double
Intersection and boolean tolerance, typically the document absolute tolerance.
splitKinkyFaces
Type: System.Boolean
Split output pieces along creases.
keptPieces
Type: Rhino.Geometry.Brep[]
Pieces that remain after the cut (boolean difference side).
cutAwayPieces
Type: Rhino.Geometry.Brep[]
The cut-away pieces (boolean intersection side).
Return Value
Type: Boolean
true if successful.
See Also
Reference
Brep Class
WireCut Overload
Rhino.Geometry Namespace