RhinoCommon API
RenderPipeline.IgnoreRhinoObject Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.IgnoreRhinoObject(Rhino.DocObjects.RhinoObject)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool IgnoreRhinoObject(
	RhinoObject obj
)
Protected Overridable Function IgnoreRhinoObject (
	obj As RhinoObject
) As Boolean
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="obj"/> documentation for "M:Rhino.Render.RenderPipeline.IgnoreRhinoObject(Rhino.DocObjects.RhinoObject)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.IgnoreRhinoObject(Rhino.DocObjects.RhinoObject)"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace