RhinoCommon API
ObjectAttributes.RemoveCustomLinetype Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.RemoveCustomLinetype"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void RemoveCustomLinetype()
Public Sub RemoveCustomLinetype
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace