RhinoCommon API
RhinoObject.UnhighlightAllSubObjects Method
 Removes highlighting from all sub-objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int UnhighlightAllSubObjects()
Public Function UnhighlightAllSubObjects As Integer
Return Value
Type: Int32
The number of changed sub-objects.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace