RhinoCommon API
GetTruncatedCone Constructor
Initializes a new instance of the GetTruncatedCone class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public GetTruncatedCone()
Public Sub New
See Also
Reference
GetTruncatedCone Class
Rhino.Input.Custom Namespace