RhinoCommon API
RhinoObject.CreateSlices Method
 Generate slices by intersecting a plane with an object of type Brep, Extrusion, SubD , Mesh, or Block Instance.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public GeometryBase[] CreateSlices(
	Plane centerPlane,
	string name,
	double thickness,
	double tolerance,
	out ObjectAttributes[] objectAttributes
)
Public Function CreateSlices (
	centerPlane As Plane,
	name As String,
	thickness As Double,
	tolerance As Double,
	<OutAttribute> ByRef objectAttributes As ObjectAttributes()
) As GeometryBase()
Parameters
centerPlane
Type: Rhino.Geometry.Plane
Intesecting plane.
name
Type: System.String
Name for section of objects.
thickness
Type: System.Double
Thickness of the slice. If thickness is less than tolerance, a surface will be created instead of a solid slice.
tolerance
Type: System.Double
The intersection tolerance. When in doubt, use the document's model absolute tolerance.
objectAttributes
Type: Rhino.DocObjects.ObjectAttributes[]
Object attributes, one for each returned geometry item.
Return Value
Type: GeometryBase[]
Slice geometry in the form of Breps, Extrusions, Meshes, and Curves if successful. An empty array if unsuccessful.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace