RhinoCommon API
File3dmWriteOptions Constructor
 Initializes properties to defaults.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public File3dmWriteOptions()
Public Sub New
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace