RhinoCommon API
RenderWindow.AddChannel Method
 Add a channel to the frame buffer in addition to the fixed Red, Green, Blue and Alpha channels.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool AddChannel(
	RenderWindow.StandardChannels channel
)
Public Function AddChannel (
	channel As RenderWindow.StandardChannels
) As Boolean
Parameters
channel
Type: Rhino.Render.RenderWindow.StandardChannels
Channel to add
Return Value
Type: Boolean
If the channel existed then true is returned otherwise; returns true if the channel was added or false if not.
See Also
Reference
RenderWindow Class
Rhino.Render Namespace