RhinoCommon API
FileSlcWriteOptions Constructor
Initializes a new instance of the FileSlcWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileSlcWriteOptions()
Public Sub New
See Also
Reference
FileSlcWriteOptions Class
Rhino.FileIO Namespace