RhinoCommon API
SimpleArrayArrayPoint3d.PolylineAt Method
 Gets a polyline at an index.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Polyline PolylineAt(
	int index
)
Public Function PolylineAt (
	index As Integer
) As Polyline
Parameters
index
Type: System.Int32
The index.
Return Value
Type: Polyline
The polyline if successful, null otherwise.
See Also
Reference
SimpleArrayArrayPoint3d Class
Rhino.Runtime.InteropWrappers Namespace