RhinoCommon API
NurbsCurvePointList.ValidateSpacing Method
 Simple check of distance between adjacent control points
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ValidateSpacing(
	double closeTolerance,
	double stackTolerance,
	out int[] closeIndices,
	out int[] stackedIndices
)
Public Function ValidateSpacing (
	closeTolerance As Double,
	stackTolerance As Double,
	<OutAttribute> ByRef closeIndices As Integer(),
	<OutAttribute> ByRef stackedIndices As Integer()
) As Boolean
Parameters
closeTolerance
Type: System.Double
tolerance to use for determining if control points are 'close'
stackTolerance
Type: System.Double
tolerance to use for determining if control points are 'stacked'
closeIndices
Type: System.Int32[]
indices of 'close' points are returned in this array
stackedIndices
Type: System.Int32[]
indices of 'stacked' points are returned in this array
Return Value
Type: Boolean
true if close or stacked indices are found
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace