RhinoCommon API
RhinoList<T>.ConvertAll<TOutput> Method
 Aggregates all results of a conversion function over this table into a new list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoList<TOutput> ConvertAll<TOutput>(
	Converter<T, TOutput> converter
)
Public Function ConvertAll(Of TOutput) (
	converter As Converter(Of T, TOutput)
) As RhinoList(Of TOutput)
Parameters
converter
Type: System.Converter<T, TOutput>
A conversion function that can transform from T to TOutput.
Type Parameters
TOutput
The type returned by the function.
Return Value
Type: RhinoList<TOutput>
The new list.
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace