RhinoCommon API
Surface.VariableOffset Method (Double, Double, Double, Double, IEnumerable<Point2d>, IEnumerable<Double>, Double)
 Copies a surface so that all locations at the corners, and from specified interior locations, of the copied surface are specified distances from the original surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.13
Syntax
public Surface VariableOffset(
	double uMinvMin,
	double uMinvMax,
	double uMaxvMin,
	double uMaxvMax,
	IEnumerable<Point2d> interiorParameters,
	IEnumerable<double> interiorDistances,
	double tolerance
)
Public Function VariableOffset (
	uMinvMin As Double,
	uMinvMax As Double,
	uMaxvMin As Double,
	uMaxvMax As Double,
	interiorParameters As IEnumerable(Of Point2d),
	interiorDistances As IEnumerable(Of Double),
	tolerance As Double
) As Surface
Parameters
uMinvMin
Type: System.Double
Offset distance at Domain(0).Min, Domain(1).Min.
uMinvMax
Type: System.Double
Offset distance at Domain(0).Min, Domain(1).Max.
uMaxvMin
Type: System.Double
Offset distance at Domain(0).Max, Domain(1).Min.
uMaxvMax
Type: System.Double
Offset distance at Domain(0).Max, Domain(1).Max.
interiorParameters
Type: System.Collections.Generic.IEnumerable<Point2d>
An array of interior UV parameters to offset from.
interiorDistances
Type: System.Collections.Generic.IEnumerable<Double>
>An array of offset distances at the interior UV parameters.
tolerance
Type: System.Double
The offset tolerance.
Return Value
Type: Surface
The offset surface if successful, null otherwise.
See Also
Reference
Surface Class
VariableOffset Overload
Rhino.Geometry Namespace