RhinoCommon API
BinaryArchiveReader.ReadPoint2d Method
 Reads a Point2d from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point2d ReadPoint2d()
Public Function ReadPoint2d As Point2d
Return Value
Type: Point2d
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace