RhinoCommon API
PreviewSceneServer.SetSceneScale Method
 Set Scene Server Scale
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SetSceneScale(
	double scale
)
Public Sub SetSceneScale (
	scale As Double
)
Parameters
scale
Type: System.Double
[Missing <param name="scale"/> documentation for "M:Rhino.Render.PreviewSceneServer.SetSceneScale(System.Double)"]
See Also
Reference
PreviewSceneServer Class
Rhino.Render Namespace