RhinoCommon API
SubD.CreateFromSurface Method
 Create a SubD that approximates the surface. If the surface is a SubD friendly NURBS surface and withCorners is true, then the SubD and input surface will have the same geometry.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public static SubD CreateFromSurface(
	Surface surface,
	SubDFromSurfaceMethods method,
	bool corners
)
Public Shared Function CreateFromSurface (
	surface As Surface,
	method As SubDFromSurfaceMethods,
	corners As Boolean
) As SubD
Parameters
surface
Type: Rhino.Geometry.Surface
[Missing <param name="surface"/> documentation for "M:Rhino.Geometry.SubD.CreateFromSurface(Rhino.Geometry.Surface,Rhino.Geometry.SubDFromSurfaceMethods,System.Boolean)"]
method
Type: Rhino.Geometry.SubDFromSurfaceMethods
Selects the method used to calculate the SubD.
corners
Type: System.Boolean
 If the surface is open, then the corner vertices with be tagged as VertexTagCorner. This makes the resulting SubD have sharp corners to match the appearance of the input surface.
Return Value
Type: SubD
[Missing <returns> documentation for "M:Rhino.Geometry.SubD.CreateFromSurface(Rhino.Geometry.Surface,Rhino.Geometry.SubDFromSurfaceMethods,System.Boolean)"]
See Also
Reference
SubD Class
Rhino.Geometry Namespace