RhinoCommon API
Skin.OnLicenseCheckCompleted Method
Is called when the license check is completed.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnLicenseCheckCompleted()
Protected Overridable Sub OnLicenseCheckCompleted
See Also
Reference
Skin Class
Rhino.Runtime Namespace