RhinoCommon API
GetEllipse.Dispose Method
 Actively releases the unmanaged object.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
GetEllipse Class
Dispose Overload
Rhino.Input.Custom Namespace