RhinoCommon API
RadialDimension.GetDistanceDisplayText Method (LengthUnit, DimensionStyle)
[Missing <summary> documentation for "M:Rhino.Geometry.RadialDimension.GetDistanceDisplayText(Rhino.LengthUnit,Rhino.DocObjects.DimensionStyle)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string GetDistanceDisplayText(
	LengthUnit units,
	DimensionStyle style
)
Public Function GetDistanceDisplayText (
	units As LengthUnit,
	style As DimensionStyle
) As String
Parameters
units
Type: Rhino.LengthUnit
[Missing <param name="units"/> documentation for "M:Rhino.Geometry.RadialDimension.GetDistanceDisplayText(Rhino.LengthUnit,Rhino.DocObjects.DimensionStyle)"]
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.RadialDimension.GetDistanceDisplayText(Rhino.LengthUnit,Rhino.DocObjects.DimensionStyle)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Geometry.RadialDimension.GetDistanceDisplayText(Rhino.LengthUnit,Rhino.DocObjects.DimensionStyle)"]
See Also
Reference
RadialDimension Class
GetDistanceDisplayText Overload
Rhino.Geometry Namespace