RhinoCommon API
NamedViewTable.Rename Method (String, String)
 Renames a named view.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Rename(
	string oldName,
	string newName
)
Public Function Rename (
	oldName As String,
	newName As String
) As Boolean
Parameters
oldName
Type: System.String
The name of a named view in the named view table.
newName
Type: System.String
The new name.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
NamedViewTable Class
Rename Overload
Rhino.DocObjects.Tables Namespace