RhinoCommon API
ComponentFunctionInfo.ToString Method
 Returns a string representing this function.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The namespace and the name.
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace