RhinoCommon API
SimpleArrayByte Constructor (Int32)
 Initializes a new SimpleArrayByte class. Initial size of the array - all values are set to zero.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SimpleArrayByte(
	int initialSize
)
Public Sub New (
	initialSize As Integer
)
Parameters
initialSize
Type: System.Int32
[Missing <param name="initialSize"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayByte.#ctor(System.Int32)"]
See Also
Reference
SimpleArrayByte Class
SimpleArrayByte Overload
Rhino.Runtime.InteropWrappers Namespace