RhinoCommon API
LinearDimension.Create Method
 Initialize Dimension parameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static LinearDimension Create(
	AnnotationType dimtype,
	DimensionStyle dimStyle,
	Plane plane,
	Vector3d horizontal,
	Point3d defpoint1,
	Point3d defpoint2,
	Point3d dimlinepoint,
	double rotationInPlane
)
Public Shared Function Create (
	dimtype As AnnotationType,
	dimStyle As DimensionStyle,
	plane As Plane,
	horizontal As Vector3d,
	defpoint1 As Point3d,
	defpoint2 As Point3d,
	dimlinepoint As Point3d,
	rotationInPlane As Double
) As LinearDimension
Parameters
dimtype
Type: Rhino.Geometry.AnnotationType
AnnotationType.Rotated or AnnotationType.Aligned
dimStyle
Type: Rhino.DocObjects.DimensionStyle
Dimension's DimensionStyle
plane
Type: Rhino.Geometry.Plane
Dimension's plane
horizontal
Type: Rhino.Geometry.Vector3d
Horizontal reference direction
defpoint1
Type: Rhino.Geometry.Point3d
First definition point
defpoint2
Type: Rhino.Geometry.Point3d
Second definition point
dimlinepoint
Type: Rhino.Geometry.Point3d
Point on dimension line
rotationInPlane
Type: System.Double
For Rotated style
Return Value
Type: LinearDimension
[Missing <returns> documentation for "M:Rhino.Geometry.LinearDimension.Create(Rhino.Geometry.AnnotationType,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace