RhinoCommon API
SupportOptions.TextureSize Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.TextureSize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static int TextureSize()
Public Shared Function TextureSize As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.TextureSize"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace