RhinoCommon API
NurbsCurve.MakePiecewiseBezier Method
 Clamps ends and adds knots so the NURBS curve has Bezier spans (all distinct knots have multiplicity = degree).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool MakePiecewiseBezier(
	bool setEndWeightsToOne
)
Public Function MakePiecewiseBezier (
	setEndWeightsToOne As Boolean
) As Boolean
Parameters
setEndWeightsToOne
Type: System.Boolean
 If true and the first or last weight is not one, then the first and last spans are re-parameterized so that the end weights are one.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace