RhinoCommon API
RhinoObject.MeshObjects Method (IEnumerable<RhinoObject>, MeshingParameters, Boolean, Mesh[], ObjectAttributes[])
Meshes Rhino objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public static Result MeshObjects(
	IEnumerable<RhinoObject> rhinoObjects,
	ref MeshingParameters parameters,
	ref bool simpleDialog,
	out Mesh[] meshes,
	out ObjectAttributes[] attributes
)
Public Shared Function MeshObjects (
	rhinoObjects As IEnumerable(Of RhinoObject),
	ByRef parameters As MeshingParameters,
	ByRef simpleDialog As Boolean,
	<OutAttribute> ByRef meshes As Mesh(),
	<OutAttribute> ByRef attributes As ObjectAttributes()
) As Result
Parameters
rhinoObjects
Type: System.Collections.Generic.IEnumerable<RhinoObject>
The Rhino objects to mesh.
parameters
Type: Rhino.Geometry.MeshingParameters
The parameters used to create the meshes. The meshing parameters may change.
simpleDialog
Type: System.Boolean
true to display the simple mesh parameters dialog, false to display the detailed mesh parameters dialog.
meshes
Type: Rhino.Geometry.Mesh[]
The created meshes are appended to this array.
attributes
Type: Rhino.DocObjects.ObjectAttributes[]
The object attributes that coincide with each created mesh are appended to this array.
Return Value
Type: Result
The results of the calculation.
See Also
Reference
RhinoObject Class
MeshObjects Overload
Rhino.DocObjects Namespace