RhinoCommon API
Skin.HideSplash Method
Is called when the splash screen should be hidden.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void HideSplash()
Protected Overridable Sub HideSplash
See Also
Reference
Skin Class
Rhino.Runtime Namespace