RhinoCommon API
Mesh.PullCurve Method
 Gets a polyline approximation of the input curve and then moves its control points to the closest point on the mesh. Then it "connects the points" over edges so that a polyline on the mesh is formed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PolylineCurve PullCurve(
	Curve curve,
	double tolerance
)
Public Function PullCurve (
	curve As Curve,
	tolerance As Double
) As PolylineCurve
Parameters
curve
Type: Rhino.Geometry.Curve
A curve to pull.
tolerance
Type: System.Double
A tolerance value.
Return Value
Type: PolylineCurve
A polyline curve, or null if none could be constructed.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace