RhinoCommon API
SimpleArrayVector3d.Add Method
 Adds a vector to the list
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Add(
	Vector3d v
)
Public Sub Add (
	v As Vector3d
)
Parameters
v
Type: Rhino.Geometry.Vector3d
[Missing <param name="v"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayVector3d.Add(Rhino.Geometry.Vector3d)"]
See Also
Reference
SimpleArrayVector3d Class
Rhino.Runtime.InteropWrappers Namespace