RhinoCommon API
GetPoint.ConstrainToTargetPlane Method
 Constrains point to lie on a plane that is parallel to the viewing plane and passes through the view's target point.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void ConstrainToTargetPlane()
Public Sub ConstrainToTargetPlane
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace