RhinoCommon API
DisplayPipeline.Draw3dText Method (String, Color, Plane, Double, String, Boolean, Boolean)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Draw3dText(
	string text,
	Color color,
	Plane textPlane,
	double height,
	string fontface,
	bool bold,
	bool italic
)
Public Sub Draw3dText (
	text As String,
	color As Color,
	textPlane As Plane,
	height As Double,
	fontface As String,
	bold As Boolean,
	italic As Boolean
)
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean)"]
textPlane
Type: Rhino.Geometry.Plane
[Missing <param name="textPlane"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean)"]
height
Type: System.Double
[Missing <param name="height"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean)"]
fontface
Type: System.String
[Missing <param name="fontface"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean)"]
bold
Type: System.Boolean
[Missing <param name="bold"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean)"]
italic
Type: System.Boolean
[Missing <param name="italic"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean)"]
See Also
Reference
DisplayPipeline Class
Draw3dText Overload
Rhino.Display Namespace