RhinoCommon API
SimpleArrayLine Constructor
 Initializes a new SimpleArrayLine instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SimpleArrayLine()
Public Sub New
See Also
Reference
SimpleArrayLine Class
SimpleArrayLine Overload
Rhino.Runtime.InteropWrappers Namespace