RhinoCommon API
WorksessionFile.Write Method (String)
 Writes a version 5 worksession file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Write(
	string path
)
Public Function Write (
	path As String
) As Boolean
Parameters
path
Type: System.String
The file to write.
Return Value
Type: Boolean
 True if the file was written. If false is returned, an existing file is left as it was.
Exceptions
Exception | Condition
ArgumentNullException | If path is null.
Remarks
 The first active model is written first and the other models follow in order. Models with an empty full path are not written. Paths are written as they are, and are not checked or changed.
See Also
Reference
WorksessionFile Class
Write Overload
Rhino.FileIO Namespace