RhinoCommon API
GripUserInterfaceObject.ClearSnapPoints Method
[Missing <summary> documentation for "M:Rhino.UI.GripUserInterfaceObject.ClearSnapPoints"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void ClearSnapPoints()
Public Sub ClearSnapPoints
See Also
Reference
GripUserInterfaceObject Class
Rhino.UI Namespace