RhinoCommon API
Layer.UnsetPerViewportPersistentVisibility Method
 Remove any per viewport persistent visibility setting so the layer's overall setting will be used for all viewports.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void UnsetPerViewportPersistentVisibility(
	Guid viewportId
)
Public Sub UnsetPerViewportPersistentVisibility (
	viewportId As Guid
)
Parameters
viewportId
Type: System.Guid
 If not Guid.Empty, then the setting for this viewport will be deleted. If Guid.Empty, the all per viewport visibility settings will be removed.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace