RhinoCommon API
SubDEdge.GetSharpness Method
 Gets the sharpness of this edge, reporting Crease for a crease edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDEdgeSharpness GetSharpness()
Public Function GetSharpness As SubDEdgeSharpness
Return Value
Type: SubDEdgeSharpness
The sharpness of this edge.
See Also
Reference
SubDEdge Class
GetSharpness Overload
Rhino.Geometry Namespace