RhinoCommon API
OrdinateDimension.Create Method
 Initialize Dimension parameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static OrdinateDimension Create(
	DimensionStyle dimStyle,
	Plane plane,
	OrdinateDimension.MeasuredDirection direction,
	Point3d basepoint,
	Point3d defpoint,
	Point3d leaderpoint,
	double kinkoffset1,
	double kinkoffset2
)
Public Shared Function Create (
	dimStyle As DimensionStyle,
	plane As Plane,
	direction As OrdinateDimension.MeasuredDirection,
	basepoint As Point3d,
	defpoint As Point3d,
	leaderpoint As Point3d,
	kinkoffset1 As Double,
	kinkoffset2 As Double
) As OrdinateDimension
Parameters
dimStyle
Type: Rhino.DocObjects.DimensionStyle
Dimension's AnnotationStyle
plane
Type: Rhino.Geometry.Plane
Dimension's plane
direction
Type: Rhino.Geometry.OrdinateDimension.MeasuredDirection
MeasuredDirection.XAxis or MeasuredDirection.YAxis
basepoint
Type: Rhino.Geometry.Point3d
Dimension's base point
defpoint
Type: Rhino.Geometry.Point3d
Dimension's definition point
leaderpoint
Type: Rhino.Geometry.Point3d
Point at tail of leader
kinkoffset1
Type: System.Double
Distance to first jog
kinkoffset2
Type: System.Double
Distance to second jog
Return Value
Type: OrdinateDimension
[Missing <returns> documentation for "M:Rhino.Geometry.OrdinateDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)"]
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace