RhinoCommon API
Point3f.ToString Method
 Constructs the string representation for the current point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The point representation in the form X,Y,Z.
See Also
Reference
Point3f Structure
ToString Overload
Rhino.Geometry Namespace