RhinoCommon API
NamedLayerStateTable.Rename Method
 Renames an existing named layer state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public bool Rename(
	string oldName,
	string newName
)
Public Function Rename (
	oldName As String,
	newName As String
) As Boolean
Parameters
oldName
Type: System.String
The name of the layer state.
newName
Type: System.String
The new name
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
NamedLayerStateTable Class
Rhino.DocObjects.Tables Namespace