RhinoCommon API
Mesh.PartitionMesh Method
 Some file formats and rendering engines are only able to process small batches of triangles. Use this function to partition the mesh into subsets of vertices and faces that those file formats and rendering engines can handle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.25
Syntax
public static Mesh[] PartitionMesh(
	Mesh mesh,
	int maxVertexCount,
	int maxFaceCount
)
Public Shared Function PartitionMesh (
	mesh As Mesh,
	maxVertexCount As Integer,
	maxFaceCount As Integer
) As Mesh()
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to partition.
maxVertexCount
Type: System.Int32
Maximum number of vertices in a partition.///
maxFaceCount
Type: System.Int32
Maximum number of faces in a partition.
Return Value
Type: Mesh[]
An array of sub-meshes if successful, otherwise an empty array.
Remarks
 The resulting sub-meshes tend to be less disjoint than the output of . The less disjoint meshes will take more time to compute.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace
Mesh.SplitMesh(Mesh, Int32, Boolean, Boolean)