RhinoCommon API
ToolbarFile.Save Method
 Saves the toolbar file.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Save()
Public Function Save As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFile.Save"]
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace