RhinoCommon API
LightTable.FindIndex Method
 Retrieves a object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LightObject FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As LightObject
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: LightObject
A object, or null if none was found.
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace