RhinoCommon API
NurbsCurveFitParameters.ValidInput Method
 returns true if the input values are within the acceptable ranges for NURBS curve fitting. If false is returned, the input values should be adjusted before calling the curve fitting function. See also MinimumPointCountForDegree() and MaximumPointCountForDegree().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ValidInput(
	long sample_point_count,
	int degree,
	int control_point_count,
	bool bClosed,
	Interval curve_domain
)
Public Shared Function ValidInput (
	sample_point_count As Long,
	degree As Integer,
	control_point_count As Integer,
	bClosed As Boolean,
	curve_domain As Interval
) As Boolean
Parameters
sample_point_count
Type: System.Int64
[Missing <param name="sample_point_count"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.ValidInput(System.Int64,System.Int32,System.Int32,System.Boolean,Rhino.Geometry.Interval)"]
degree
Type: System.Int32
[Missing <param name="degree"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.ValidInput(System.Int64,System.Int32,System.Int32,System.Boolean,Rhino.Geometry.Interval)"]
control_point_count
Type: System.Int32
[Missing <param name="control_point_count"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.ValidInput(System.Int64,System.Int32,System.Int32,System.Boolean,Rhino.Geometry.Interval)"]
bClosed
Type: System.Boolean
[Missing <param name="bClosed"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.ValidInput(System.Int64,System.Int32,System.Int32,System.Boolean,Rhino.Geometry.Interval)"]
curve_domain
Type: Rhino.Geometry.Interval
[Missing <param name="curve_domain"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.ValidInput(System.Int64,System.Int32,System.Int32,System.Boolean,Rhino.Geometry.Interval)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.ValidInput(System.Int64,System.Int32,System.Int32,System.Boolean,Rhino.Geometry.Interval)"]
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace