RhinoCommon API
RhinoGet.InGetPoint Method
Returns true if currently in a GetPoint.Get()
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool InGetPoint(
	RhinoDoc doc
)
Public Shared Function InGetPoint (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Input.RhinoGet.InGetPoint(Rhino.RhinoDoc)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.InGetPoint(Rhino.RhinoDoc)"]
See Also
Reference
RhinoGet Class
Rhino.Input Namespace