RhinoCommon API
HostUtils.LoadAssemblyFromStream Method
 Calls Assembly.Load(byte[]) in .NET 4.8. May call a different routine under .NET Core
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.23
Syntax
public static Assembly LoadAssemblyFromStream(
	Stream stream
)
Public Shared Function LoadAssemblyFromStream (
	stream As Stream
) As Assembly
Parameters
stream
Type: System.IO.Stream
[Missing <param name="stream"/> documentation for "M:Rhino.Runtime.HostUtils.LoadAssemblyFromStream(System.IO.Stream)"]
Return Value
Type: Assembly
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.LoadAssemblyFromStream(System.IO.Stream)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace