RhinoCommon API
RenderTexture.GetWcsBoxMapping Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetWcsBoxMapping(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public static Point3d GetWcsBoxMapping(
	Point3d worldXyz,
	Vector3d normal
)
Public Shared Function GetWcsBoxMapping (
	worldXyz As Point3d,
	normal As Vector3d
) As Point3d
Parameters
worldXyz
Type: Rhino.Geometry.Point3d
[Missing <param name="worldXyz"/> documentation for "M:Rhino.Render.RenderTexture.GetWcsBoxMapping(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)"]
normal
Type: Rhino.Geometry.Vector3d
[Missing <param name="normal"/> documentation for "M:Rhino.Render.RenderTexture.GetWcsBoxMapping(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)"]
Return Value
Type: Point3d
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetWcsBoxMapping(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace