RhinoCommon API
PageViewGroupTable.Delete Method (PageViewGroup)
 Deletes a page view group.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public override bool Delete(
	PageViewGroup group
)
Public Overrides Function Delete (
	group As PageViewGroup
) As Boolean
Parameters
group
Type: Rhino.DocObjects.PageViewGroup
PageViewGroup to delete.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.PageViewGroupTable.Delete(Rhino.DocObjects.PageViewGroup)"]
See Also
Reference
PageViewGroupTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace