RhinoCommon API
PageViewGroup Constructor
 Constructs a new page view group.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PageViewGroup()
Public Sub New
See Also
Reference
PageViewGroup Class
Rhino.DocObjects Namespace