RhinoCommon API
Layer.UnsetPersistentVisibility Method
 Remove any explicit persistent visibility setting from this layer
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.5
Syntax
public void UnsetPersistentVisibility()
Public Sub UnsetPersistentVisibility
See Also
Reference
Layer Class
Rhino.DocObjects Namespace