RhinoCommon API
Mesh.QuadRemesh Method (QuadRemeshParameters)
 Quad remesh this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Mesh QuadRemesh(
	QuadRemeshParameters parameters
)
Public Function QuadRemesh (
	parameters As QuadRemeshParameters
) As Mesh
Parameters
parameters
Type: Rhino.Geometry.QuadRemeshParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemesh(Rhino.Geometry.QuadRemeshParameters)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.QuadRemesh(Rhino.Geometry.QuadRemeshParameters)"]
See Also
Reference
Mesh Class
QuadRemesh Overload
Rhino.Geometry Namespace