RhinoCommon API
PostEffect.ResetToFactoryDefaults Method
 Reset the state to factory defaults.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public abstract void ResetToFactoryDefaults()
Public MustOverride Sub ResetToFactoryDefaults
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace