RhinoCommon API
SmartTrackSettings.GetCurrentState Method
 Gets the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static SmartTrackSettingsState GetCurrentState()
Public Shared Function GetCurrentState As SmartTrackSettingsState
Return Value
Type: SmartTrackSettingsState
A new Smart Track state with current settings.
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace