RhinoCommon API
IndexPair.Contains Method
 Determines whether the IndexPair contains a specific value.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Contains(
	int item
)
Public Function Contains (
	item As Integer
) As Boolean
Parameters
item
Type: System.Int32
The number to locate in the IndexPair.
Return Value
Type: Boolean
 true if item is found in the IndexPair; otherwise, false.
Implements
ICollection<T>.Contains(T)
See Also
Reference
IndexPair Structure
Rhino Namespace