RhinoCommon API
ObjectTable.AddRhinoObject Method (CustomMeshObject, HistoryRecord)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomMeshObject,Rhino.DocObjects.HistoryRecord)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public void AddRhinoObject(
	CustomMeshObject meshObject,
	HistoryRecord history
)
Public Sub AddRhinoObject (
	meshObject As CustomMeshObject,
	history As HistoryRecord
)
Parameters
meshObject
Type: Rhino.DocObjects.Custom.CustomMeshObject
[Missing <param name="meshObject"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomMeshObject,Rhino.DocObjects.HistoryRecord)"]
history
Type: Rhino.DocObjects.HistoryRecord
[Missing <param name="history"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomMeshObject,Rhino.DocObjects.HistoryRecord)"]
See Also
Reference
ObjectTable Class
AddRhinoObject Overload
Rhino.DocObjects.Tables Namespace