RhinoCommon API
ObjRef.SubDEdge Method
 Gets the SubDEdge if the referenced geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public SubDEdge SubDEdge()
Public Function SubDEdge As SubDEdge
Return Value
Type: SubDEdge
A SubDEdge; or null if the referenced object is not a SubDEdge, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace