RhinoCommon API
ChangeQueue.Dispose Method
 Dispose our ChangeQueue
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ChangeQueue Class
Dispose Overload
Rhino.Render.ChangeQueue Namespace