RhinoCommon API
Linetype.RemoveSegment Method
Removes a segment in the linetype.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool RemoveSegment(
	int index
)
Public Function RemoveSegment (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
Zero based index of the segment to remove.
Return Value
Type: Boolean
true if the segment index was removed.
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace