RhinoCommon API
LightManagerSupport.LightDescription Method
 Gets the string representation of the light description
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract string LightDescription(
	RhinoDoc doc,
	ref Light light
)
Public MustOverride Function LightDescription (
	doc As RhinoDoc,
	ByRef light As Light
) As String
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.LightManagerSupport.LightDescription(Rhino.RhinoDoc,Rhino.Geometry.Light@)"]
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.LightManagerSupport.LightDescription(Rhino.RhinoDoc,Rhino.Geometry.Light@)"]
Return Value
Type: String
Returns the string representation of the light description
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace