RhinoCommon API
SoftTransformSettingsState Constructor
Initializes a new instance of the SoftTransformSettingsState class
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SoftTransformSettingsState()
Public Sub New
See Also
Reference
SoftTransformSettingsState Class
Rhino.ApplicationSettings Namespace