RhinoCommon API
MeshingParameters.FromEncodedString Method
 Converts encoded serialized string into a MeshingParameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static MeshingParameters FromEncodedString(
	string value
)
Public Shared Function FromEncodedString (
	value As String
) As MeshingParameters
Parameters
value
Type: System.String
 Encoded string returned by MeshingParameters.ToString()
Return Value
Type: MeshingParameters
 Returns a new MeshingParameters created by decoding and deserializing the string or null if value is invalid.
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace