RhinoCommon API
PersistentSettings.GetGuid Method (String, Guid, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetGuid(System.String,System.Guid,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid GetGuid(
	string key,
	Guid defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetGuid (
	key As String,
	defaultValue As Guid,
	legacyKeyList As IEnumerable(Of String)
) As Guid
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetGuid(System.String,System.Guid,System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.Guid
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetGuid(System.String,System.Guid,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetGuid(System.String,System.Guid,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetGuid(System.String,System.Guid,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetGuid Overload
Rhino Namespace