RhinoCommon API
StringHolder.ToString Method
 Marshals unmanaged ON_wString to a managed .NET string
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.InteropWrappers.StringHolder.ToString"]
See Also
Reference
StringHolder Class
Rhino.Runtime.InteropWrappers Namespace