RhinoCommon API
MeshFaceList.ExtractFaces Method
 Extracts, or removes, faces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Mesh ExtractFaces(
	IEnumerable<int> faceIndices
)
Public Function ExtractFaces (
	faceIndices As IEnumerable(Of Integer)
) As Mesh
Parameters
faceIndices
Type: System.Collections.Generic.IEnumerable<Int32>
The face indices to be extracted.
Return Value
Type: Mesh
A mesh containing the extracted faces if successful, null otherwise.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace