RhinoCommon API
RenderPlugIn.CurrentRendererSupportsFeature Method
[Missing <summary> documentation for "M:Rhino.PlugIns.RenderPlugIn.CurrentRendererSupportsFeature(Rhino.PlugIns.RenderPlugIn.RenderFeature)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public static bool CurrentRendererSupportsFeature(
	RenderPlugIn.RenderFeature feature
)
Public Shared Function CurrentRendererSupportsFeature (
	feature As RenderPlugIn.RenderFeature
) As Boolean
Parameters
feature
Type: Rhino.PlugIns.RenderPlugIn.RenderFeature
[Missing <param name="feature"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.CurrentRendererSupportsFeature(Rhino.PlugIns.RenderPlugIn.RenderFeature)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.RenderPlugIn.CurrentRendererSupportsFeature(Rhino.PlugIns.RenderPlugIn.RenderFeature)"]
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace