RhinoCommon API
PolyCurve.Explode Method
 Explodes this PolyCurve into a list of Curve segments. This will not explode nested polycurves. Call RemoveNesting() first if you need all individual segments.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Curve[] Explode()
Public Function Explode As Curve()
Return Value
Type: Curve[]
An array of polycurve segments.
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace