RhinoCommon API
ArchivableDictionary.Clear Method
 Removes all keys and values from the dictionary.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace