RhinoCommon API
RenderPrimitiveList.TryGetBox Method
 Call this method to get a box at the specified index.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool TryGetBox(
	int index,
	out Box box
)
Public Function TryGetBox (
	index As Integer,
	<OutAttribute> ByRef box As Box
) As Boolean
Parameters
index
Type: System.Int32
 The zero based index of the item in the list. Valid values are greater than or equal to 0 and less than Count.
box
Type: Rhino.Geometry.Box
 Will contain the box at the requested index if the index is in range and the primitive at the requested index is a box.
Return Value
Type: Boolean
 Return true if the index is in range and the primitive at the requested index is a box otherwise returns false.
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace