RhinoCommon API
TextFields.LayerName Method
 Returns the name of a layer based on the layers guid
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string LayerName(
	string layerId
)
Public Shared Function LayerName (
	layerId As String
) As String
Parameters
layerId
Type: System.String
[Missing <param name="layerId"/> documentation for "M:Rhino.Runtime.TextFields.LayerName(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.LayerName(System.String)"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace