RhinoCommon API
PersistentSettings.GetString Method (String, String, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetString(System.String,System.String,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string GetString(
	string key,
	string defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetString (
	key As String,
	defaultValue As String,
	legacyKeyList As IEnumerable(Of String)
) As String
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetString(System.String,System.String,System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.String
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetString(System.String,System.String,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetString(System.String,System.String,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetString(System.String,System.String,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetString Overload
Rhino Namespace