RhinoCommon API
TwoColorRenderTexture.AddAdditionalUISections Method
[Missing <summary> documentation for "M:Rhino.Render.TwoColorRenderTexture.AddAdditionalUISections"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract void AddAdditionalUISections()
Protected MustOverride Sub AddAdditionalUISections
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace