RhinoCommon API
ObjectTable.Replace Method (ObjRef, Point)
Replaces one object with new point object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Replace(
	ObjRef objref,
	Point point
)
Public Function Replace (
	objref As ObjRef,
	point As Point
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
point
Type: Rhino.Geometry.Point
new point to be added. The point is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace