RhinoCommon API
EdgeAnalysisSettings.RestoreDefaults Method
 Commits the default settings as the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void RestoreDefaults()
Public Shared Sub RestoreDefaults
See Also
Reference
EdgeAnalysisSettings Class
Rhino.ApplicationSettings Namespace