RhinoCommon API
ArchivableDictionary.GetGuid Method (String, Guid)
 Get value as Guid, will return defaultValue unless value was created using Set(string key, Guid value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid GetGuid(
	string key,
	Guid defaultValue
)
Public Function GetGuid (
	key As String,
	defaultValue As Guid
) As Guid
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetGuid(System.String,System.Guid)"]
defaultValue
Type: System.Guid
[Missing <param name="defaultValue"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetGuid(System.String,System.Guid)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetGuid(System.String,System.Guid)"]
See Also
Reference
ArchivableDictionary Class
GetGuid Overload
Rhino.Collections Namespace