RhinoCommon API
CustomCurveObject Constructor
Initializes a new instance of the CustomCurveObject class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CustomCurveObject()
Protected Sub New
See Also
Reference
CustomCurveObject Class
CustomCurveObject Overload
Rhino.DocObjects.Custom Namespace