RhinoCommon API
RenderPipeline.RenderSize Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.RenderSize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute]
public static Size RenderSize()
<ObsoleteAttribute>
Public Shared Function RenderSize As Size
Return Value
Type: Size
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.RenderSize"]
See Also
Reference
RenderPipeline Class
RenderSize Overload
Rhino.Render Namespace