RhinoCommon API
Mesh.SetTextureCoordinates Method (TextureMapping, Transform, Boolean)
 Sets texture coordinates using the given texture mapping and transform.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetTextureCoordinates(
	TextureMapping tm,
	Transform xf,
	bool lazy
)
Public Sub SetTextureCoordinates (
	tm As TextureMapping,
	xf As Transform,
	lazy As Boolean
)
Parameters
tm
Type: Rhino.Render.TextureMapping
Texture mapping
xf
Type: Rhino.Geometry.Transform
Transform to apply to the texture mapping
lazy
Type: System.Boolean
 If true and the mesh's texture coordinates were already computed from this same mapping and transform, no calculation is performed. If false, texture coordinates are always recalculated.
See Also
Reference
Mesh Class
SetTextureCoordinates Overload
Rhino.Geometry Namespace