RhinoCommon API
PlaneIntersectionCache.Dispose Method
 Releases the native cache.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PlaneIntersectionCache Class
Rhino.Geometry.Intersect Namespace