RhinoCommon API
ObjectPropertiesPage.AnySelectedObject<T> Method (Boolean)
 Return true if any of the selected objects match the given type
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public bool AnySelectedObject<T>(
	bool allMustMatch
)
where T : RhinoObject
Public Function AnySelectedObject(Of T As RhinoObject) (
	allMustMatch As Boolean
) As Boolean
Parameters
allMustMatch
Type: System.Boolean
 If true then every selected object must match the object type otherwise; only a single object has to be of the specified type
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.AnySelectedObject``1(System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPage.AnySelectedObject``1(System.Boolean)"]
See Also
Reference
ObjectPropertiesPage Class
AnySelectedObject Overload
Rhino.UI Namespace