RhinoCommon API
Mesh.Split Method (IEnumerable<Mesh>, MeshSplitOptions)
 Split a mesh with a collection of meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Mesh[] Split(
	IEnumerable<Mesh> meshes,
	MeshSplitOptions options
)
Public Function Split (
	meshes As IEnumerable(Of Mesh),
	options As MeshSplitOptions
) As Mesh()
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
Meshes to split with.
options
Type: Rhino.Geometry.MeshSplitOptions
The split option instance, or null for the defaults.
Because MeshBooleanOptions derives from MeshSplitOptions, an instance used for mesh booleans can be passed here directly.
Return Value
Type: Mesh[]
An array of mesh parts representing the split result, or null: when no mesh intersected, or if a cancel stopped the computation.
See Also
Reference
Mesh Class
Split Overload
Rhino.Geometry Namespace