RhinoCommon API
LightManagerSupport.RegisterProviders Method
 Find and register classes that derive from RealtimeDisplayMode from the given plug-in. The plug-in is found in the given assembly
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void RegisterProviders(
	Assembly assembly,
	Guid pluginId
)
Public Shared Sub RegisterProviders (
	assembly As Assembly,
	pluginId As Guid
)
Parameters
assembly
Type: System.Reflection.Assembly
[Missing <param name="assembly"/> documentation for "M:Rhino.Render.LightManagerSupport.RegisterProviders(System.Reflection.Assembly,System.Guid)"]
pluginId
Type: System.Guid
[Missing <param name="pluginId"/> documentation for "M:Rhino.Render.LightManagerSupport.RegisterProviders(System.Reflection.Assembly,System.Guid)"]
Return Value
Type:
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace