RhinoCommon API
TrulyObservableOrderedSet<T>.Contains Method
 Determines whether an element is in the set.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Contains(
	T item
)
Public Function Contains (
	item As T
) As Boolean
Parameters
item
Type: T
The item to check for inclusion.
Return Value
Type: Boolean
True if the item is in the set; otherwise false.
Implements
ICollection<T>.Contains(T)
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace