RhinoCommon API
ArchivableDictionary.GetString Method (String, String)
 Get value as string, will return defaultValue unless value was created using Set(string key, string value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string GetString(
	string key,
	string defaultValue
)
Public Function GetString (
	key As String,
	defaultValue As String
) As String
Parameters
key
Type: System.String
The key which points to the string
defaultValue
Type: System.String
The string
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetString(System.String,System.String)"]
See Also
Reference
ArchivableDictionary Class
GetString Overload
Rhino.Collections Namespace