RhinoCommon API
RhinoDoc.Export Method (String, ArchivableDictionary)
 Export the entire document to a file. All file formats that Rhino can export to are supported by this function.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Export(
	string filePath,
	ArchivableDictionary options
)
Public Function Export (
	filePath As String,
	options As ArchivableDictionary
) As Boolean
Parameters
filePath
Type: System.String
[Missing <param name="filePath"/> documentation for "M:Rhino.RhinoDoc.Export(System.String,Rhino.Collections.ArchivableDictionary)"]
options
Type: Rhino.Collections.ArchivableDictionary
 Options to help define how data should be exported.
Return Value
Type: Boolean
true on success
See Also
Reference
RhinoDoc Class
Export Overload
Rhino Namespace