RhinoCommon API
FileCsvDocument.TryGetDouble Method (Int32, Int32, Double)
 Retrieves the value of a cell as a double-precision number. The cell is evaluated with TryParseNumber(String, Double), so command-line math expressions (for example "1/2") are supported.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetDouble(
	int column,
	int row,
	out double value
)
Public Function TryGetDouble (
	column As Integer,
	row As Integer,
	<OutAttribute> ByRef value As Double
) As Boolean
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.Double
The parsed value, or 0.0 if the cell does not exist or cannot be parsed.
Return Value
Type: Boolean
true if the cell exists and was parsed; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetDouble Overload
Rhino.FileIO Namespace