RhinoCommon API
BrepEdgeList.GetEnumerator Method
 Gets an enumerator that visits all edges.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IEnumerator<BrepEdge> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepEdge)
Return Value
Type: IEnumerator<BrepEdge>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
BrepEdgeList Class
Rhino.Geometry.Collections Namespace