RhinoCommon API
SubD.DeleteComponents Method (IEnumerable<SubDComponent>)
 Deletes components from this SubD, leaving the edges that bounded any deleted face unmarked. See DeleteComponents(IEnumerable<SubDComponent>, Boolean).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool DeleteComponents(
	IEnumerable<SubDComponent> components
)
Public Function DeleteComponents (
	components As IEnumerable(Of SubDComponent)
) As Boolean
Parameters
components
Type: System.Collections.Generic.IEnumerable<SubDComponent>
The components to delete.
Return Value
Type: Boolean
True if the deletion succeeded.
See Also
Reference
SubD Class
DeleteComponents Overload
Rhino.Geometry Namespace