RhinoCommon API
SubDFace.VertexAt Method
 Get a vertex that this face uses by index
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDVertex VertexAt(
	int index
)
Public Function VertexAt (
	index As Integer
) As SubDVertex
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Geometry.SubDFace.VertexAt(System.Int32)"]
Return Value
Type: SubDVertex
[Missing <returns> documentation for "M:Rhino.Geometry.SubDFace.VertexAt(System.Int32)"]
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace