RhinoCommon API
ObjectPropertiesPageEventArgs.GetObjects Method (ObjectType)
 Get selected objects that match a given filter
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoObject[] GetObjects(
	ObjectType filter
)
Public Function GetObjects (
	filter As ObjectType
) As RhinoObject()
Parameters
filter
Type: Rhino.DocObjects.ObjectType
[Missing <param name="filter"/> documentation for "M:Rhino.UI.ObjectPropertiesPageEventArgs.GetObjects(Rhino.DocObjects.ObjectType)"]
Return Value
Type: RhinoObject[]
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPageEventArgs.GetObjects(Rhino.DocObjects.ObjectType)"]
See Also
Reference
ObjectPropertiesPageEventArgs Class
GetObjects Overload
Rhino.UI Namespace