RhinoCommon API
CurveObject.GetLinetypeSegments Method
 Converts the linetype pattern of the curve into curve segments and points based on the active Rhino viewport.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public GeometryBase[] GetLinetypeSegments()
Public Function GetLinetypeSegments As GeometryBase()
Return Value
Type: GeometryBase[]
An array of curve and point objects if successful.
See Also
Reference
CurveObject Class
GetLinetypeSegments Overload
Rhino.DocObjects Namespace