RhinoCommon API
FileGtsWriteOptions Constructor
Initializes a new instance of the FileGtsWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileGtsWriteOptions()
Public Sub New
See Also
Reference
FileGtsWriteOptions Class
Rhino.FileIO Namespace