RhinoCommon API
MeshingParameters.Equality Operator
 Determines whether the two MeshingParameters have equal values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool operator ==(
	MeshingParameters mp1,
	MeshingParameters mp2
)
Public Shared Operator = (
	mp1 As MeshingParameters,
	mp2 As MeshingParameters
) As Boolean
Parameters
mp1
Type: Rhino.Geometry.MeshingParameters
The first MeshingParameters.
mp2
Type: Rhino.Geometry.MeshingParameters
The second MeshingParameters.
Return Value
Type: Boolean
true if all of components of the two MeshingParameters are equal; otherwise false.
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace