RhinoCommon API
RenderTexture.GetProceduralImpulseNoiseArrayPointer Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetProceduralImpulseNoiseArrayPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static IntPtr GetProceduralImpulseNoiseArrayPointer()
Public Shared Function GetProceduralImpulseNoiseArrayPointer As IntPtr
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetProceduralImpulseNoiseArrayPointer"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace