RhinoCommon API
Transform2d.Translation Method (Double, Double)
 Constructs a new translation (move) transformation. Right column is (dx, dy).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d Translation(
	double dx,
	double dy
)
Public Shared Function Translation (
	dx As Double,
	dy As Double
) As Transform2d
Parameters
dx
Type: System.Double
Distance to translate (move) geometry along the world X axis.
dy
Type: System.Double
Distance to translate (move) geometry along the world Y axis.
Return Value
Type: Transform2d
A transform matrix which moves geometry with the specified distances.
See Also
Reference
Transform2d Structure
Translation Overload
Rhino.Geometry Namespace