RhinoCommon API
RhinoApp.SetCommandPrompt Method (String, String)
Sets the command prompt in Rhino.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void SetCommandPrompt(
	string prompt,
	string promptDefault
)
Public Shared Sub SetCommandPrompt (
	prompt As String,
	promptDefault As String
)
Parameters
prompt
Type: System.String
The new prompt text.
promptDefault
Type: System.String
 Text that appears in angle brackets and indicates what will happen if the user pressed ENTER.
See Also
Reference
RhinoApp Class
SetCommandPrompt Overload
Rhino Namespace