RhinoCommon API
RhinoAccountsOperationInProgressException Constructor (Assembly, Exception)
 Generates a new instance of the exception.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RhinoAccountsOperationInProgressException(
	Assembly assembly,
	Exception innerException = null
)
Public Sub New (
	assembly As Assembly,
	Optional innerException As Exception = Nothing
)
Parameters
assembly
Type: System.Reflection.Assembly
The assembly that is currently performing an operation.
innerException (Optional)
Type: System.Exception
The inner exception.
See Also
Reference
RhinoAccountsOperationInProgressException Class
RhinoAccountsOperationInProgressException Overload
Rhino.Runtime.RhinoAccounts Namespace