RhinoCommon API
SimpleArray2dex Constructor (IEnumerable<IndexPair>)
 Initializes a new SimpleArray2dex class
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public SimpleArray2dex(
	IEnumerable<IndexPair> values
)
Public Sub New (
	values As IEnumerable(Of IndexPair)
)
Parameters
values
Type: System.Collections.Generic.IEnumerable<IndexPair>
initial set of integer pairs to add to the array
See Also
Reference
SimpleArray2dex Class
SimpleArray2dex Overload
Rhino.Runtime.InteropWrappers Namespace