RhinoCommon API
Skylight.ToString Method
 Textual representation of Skylight
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.Skylight.ToString"]
See Also
Reference
Skylight Class
Rhino.Render.ChangeQueue Namespace