RhinoCommon API
PreviewBackground.EnvironmentInstanceId Method
 EnvironmentInstanceId
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid EnvironmentInstanceId()
Public Function EnvironmentInstanceId As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.PreviewBackground.EnvironmentInstanceId"]
See Also
Reference
PreviewBackground Class
Rhino.Render Namespace