RhinoCommon API
PolyCurve Constructor
 Initializes a new, empty polycurve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PolyCurve()
Public Sub New
See Also
Reference
PolyCurve Class
PolyCurve Overload
Rhino.Geometry Namespace