RhinoCommon API
DisplayPipeline.DrawExtrusionWires Method (Extrusion, Color, Int32)
 Draws all the wireframe curves of an extrusion object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawExtrusionWires(
	Extrusion extrusion,
	Color color,
	int wireDensity
)
Public Sub DrawExtrusionWires (
	extrusion As Extrusion,
	color As Color,
	wireDensity As Integer
)
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
Extrusion to draw.
color
Type: System.Drawing.Color
Color of Wireframe curves.
wireDensity
Type: System.Int32
 "Density" of wireframe curves.
-1 = no internal wires.
 0 = default internal wires.
>0 = custom high density.
See Also
Reference
DisplayPipeline Class
DrawExtrusionWires Overload
Rhino.Display Namespace