RhinoCommon API
Instance Constructor
 Construct a new Instance object
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Instance()
Public Sub New
See Also
Reference
Instance Class
Rhino.Render.CustomRenderMeshes Namespace