RhinoCommon API
GetBaseClass.AddOption Method (LocalizeStringPair, LocalizeStringPair, Boolean)
 Adds a command line option.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.9
Syntax
public int AddOption(
	LocalizeStringPair optionName,
	LocalizeStringPair optionValue,
	bool hiddenOption
)
Public Function AddOption (
	optionName As LocalizeStringPair,
	optionValue As LocalizeStringPair,
	hiddenOption As Boolean
) As Integer
Parameters
optionName
Type: Rhino.UI.LocalizeStringPair
Must only consist of letters and numbers (no characters list periods, spaces, or dashes).
optionValue
Type: Rhino.UI.LocalizeStringPair
The localized value visualized after an equality sign.
hiddenOption
Type: System.Boolean
If true, the option is not displayed on the command line and the full option name must be typed in order to activate the option.
Return Value
Type: Int32
option index value (>0) or 0 if option cannot be added.
See Also
Reference
GetBaseClass Class
AddOption Overload
Rhino.Input.Custom Namespace