RhinoCommon API
ComponentFunctionInfo.Evaluate Method
 Evaluates the component with a set of arguments. There needs to be an argument for each input param, and each output param gives an entry in the output array.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract Object[] Evaluate(
	IEnumerable args,
	bool keepTree,
	out string[] warnings
)
Public MustOverride Function Evaluate (
	args As IEnumerable,
	keepTree As Boolean,
	<OutAttribute> ByRef warnings As String()
) As Object()
Parameters
args
Type: System.Collections.IEnumerable
The arguments list. Each item is assigned to each input param, in order.
keepTree
Type: System.Boolean
A value indicating whether trees should be considered valid inputs, and should be returned. In this case, output variables are not simplified to common types.
warnings
Type: System.String[]
A possible list of warnings, or null.
Return Value
Type: Object[]
An array of objects, each representing an output result.
Remarks
For component that store no state, this method is thread safe.
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace