RhinoCommon API
SimpleArrayLinetypePointer.Dispose Method (Boolean)
 Dispose
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
SimpleArrayLinetypePointer Class
Dispose Overload
Rhino.Runtime.InteropWrappers Namespace