RhinoCommon API
PageSettings Constructor
Initializes a new instance of the PageSettings class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PageSettings()
Public Sub New
See Also
Reference
PageSettings Class
Rhino.DocObjects Namespace