RhinoCommon API
RenderContentKindList.Finalize Method
 Kind list finalizer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RenderContentKindList Class
Rhino.Render Namespace