RhinoCommon API
DisplayPipelineAttributes.GetSurfaceIsoThicknessUsage Method
 This is a helper function that combines getting IsoThicknessUsed and SurfaceNakedEdgeThicknessUsageFlags settings to correspond to the behavor of the Settings page.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public DisplayPipelineAttributes.SurfaceIsoThicknessUse GetSurfaceIsoThicknessUsage()
Public Function GetSurfaceIsoThicknessUsage As DisplayPipelineAttributes.SurfaceIsoThicknessUse
Return Value
Type: DisplayPipelineAttributes.SurfaceIsoThicknessUse
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipelineAttributes.GetSurfaceIsoThicknessUsage"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace