RhinoCommon API
ArchivableDictionary.GetDouble Method (String, Double)
 Get value as double, will only succeed if value was created using Set(string key, double value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public double GetDouble(
	string key,
	double defaultValue
)
Public Function GetDouble (
	key As String,
	defaultValue As Double
) As Double
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetDouble(System.String,System.Double)"]
defaultValue
Type: System.Double
[Missing <param name="defaultValue"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetDouble(System.String,System.Double)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetDouble(System.String,System.Double)"]
See Also
Reference
ArchivableDictionary Class
GetDouble Overload
Rhino.Collections Namespace