RhinoCommon API
RhinoPageView.SetPageViewGroupSortIndex Method
 Sets this page view's sort index (position) within a page view group, repositioning it among the group's members and renumbering the rest so the group stays contiguously ordered. A sort index at or beyond the member count moves the page view to the end. If the page view is not yet in the group, it is added.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetPageViewGroupSortIndex(
	int pageViewGroupIndex,
	int sortIndex
)
Public Sub SetPageViewGroupSortIndex (
	pageViewGroupIndex As Integer,
	sortIndex As Integer
)
Parameters
pageViewGroupIndex
Type: System.Int32
Zero-based index of the page view group.
sortIndex
Type: System.Int32
The desired zero-based position within the group.
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace