RhinoCommon API
Linetype.RemoveAllShapes Method
 Remove all shapes from this linetype
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void RemoveAllShapes()
Public Sub RemoveAllShapes
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace