RhinoCommon API
Brep.CreateBooleanDifference Method (Brep, Brep, Double, Boolean)
 Compute the Solid Difference of two Breps.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep[] CreateBooleanDifference(
	Brep firstBrep,
	Brep secondBrep,
	double tolerance,
	bool manifoldOnly
)
Public Shared Function CreateBooleanDifference (
	firstBrep As Brep,
	secondBrep As Brep,
	tolerance As Double,
	manifoldOnly As Boolean
) As Brep()
Parameters
firstBrep
Type: Rhino.Geometry.Brep
First Brep for boolean difference.
secondBrep
Type: Rhino.Geometry.Brep
Second Brep for boolean difference.
tolerance
Type: System.Double
Tolerance to use for difference operation.
manifoldOnly
Type: System.Boolean
If true, non-manifold input breps are ignored.
Return Value
Type: Brep[]
An array of Brep results or null on failure.
Remarks
 The solid orientation of the breps make a difference when calling this function. Breps that have never been added to a document may need preparing first, or this method can fail, or return an unexpected result. See PrepareForBooleans().
See Also
Reference
Brep Class
CreateBooleanDifference Overload
Rhino.Geometry Namespace
Brep.PrepareForBooleans()