RhinoCommon API
Plane.CreateFromFrame Method
 Constructs a plane from a point, and two vectors in the plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Plane CreateFromFrame(
	Point3d origin,
	Vector3d xDirection,
	Vector3d yDirection
)
Public Shared Function CreateFromFrame (
	origin As Point3d,
	xDirection As Vector3d,
	yDirection As Vector3d
) As Plane
Parameters
origin
Type: Rhino.Geometry.Point3d
Point on the plane.
xDirection
Type: Rhino.Geometry.Vector3d
Non-zero vector in the plane that determines the XAxis direction.
yDirection
Type: Rhino.Geometry.Vector3d
 Non-zero vector not parallel to xDirection that is used to determine the YAxis direction. Note, yDirection does not have to be perpendicular to xDirection.
Return Value
Type: Plane
A valid plane if successful, or Plane.Unset on failure.
See Also
Reference
Plane Structure
Rhino.Geometry Namespace