RhinoCommon API
TextEntity.CreatePolysurfacesGrouped Method (DimensionStyle, Boolean, Double, Double, Double)
 Creates 3d Breps from text outline curves. Breps are grouped such that each element in the list being returned represents a single character.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public List<Brep[]> CreatePolysurfacesGrouped(
	DimensionStyle dimstyle,
	bool makeSmallCaps,
	double smallCapsScale,
	double height,
	double spacing
)
Public Function CreatePolysurfacesGrouped (
	dimstyle As DimensionStyle,
	makeSmallCaps As Boolean,
	smallCapsScale As Double,
	height As Double,
	spacing As Double
) As List(Of Brep())
Parameters
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.TextEntity.CreatePolysurfacesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double,System.Double)"]
makeSmallCaps
Type: System.Boolean
[Missing <param name="makeSmallCaps"/> documentation for "M:Rhino.Geometry.TextEntity.CreatePolysurfacesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double,System.Double)"]
smallCapsScale
Type: System.Double
[Missing <param name="smallCapsScale"/> documentation for "M:Rhino.Geometry.TextEntity.CreatePolysurfacesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double,System.Double)"]
height
Type: System.Double
[Missing <param name="height"/> documentation for "M:Rhino.Geometry.TextEntity.CreatePolysurfacesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double,System.Double)"]
spacing
Type: System.Double
[Missing <param name="spacing"/> documentation for "M:Rhino.Geometry.TextEntity.CreatePolysurfacesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double,System.Double)"]
Return Value
Type: List<Brep[]>
[Missing <returns> documentation for "M:Rhino.Geometry.TextEntity.CreatePolysurfacesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double,System.Double)"]
See Also
Reference
TextEntity Class
CreatePolysurfacesGrouped Overload
Rhino.Geometry Namespace