RhinoCommon API
IPostEffects.PostEffectFromId Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.IPostEffects.PostEffectFromId(System.Guid)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
PostEffect PostEffectFromId(
	Guid uuid
)
Function PostEffectFromId (
	uuid As Guid
) As PostEffect
Parameters
uuid
Type: System.Guid
[Missing <param name="uuid"/> documentation for "M:Rhino.Render.PostEffects.IPostEffects.PostEffectFromId(System.Guid)"]
Return Value
Type: PostEffect
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.IPostEffects.PostEffectFromId(System.Guid)"]
See Also
Reference
IPostEffects Interface
Rhino.Render.PostEffects Namespace