RhinoCommon API
BinaryArchiveReader.ReadSingle Method
 Reads a Single from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public float ReadSingle()
Public Function ReadSingle As Single
Return Value
Type: Single
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace