RhinoCommon API
PlugIn.CreateCommands Method
 Called right after plug-in is created and is responsible for creating all of the commands in a given plug-in. The base class implementation Constructs an instance of every publicly exported command class in your plug-in's assembly.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void CreateCommands()
Protected Overridable Sub CreateCommands
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace