RhinoCommon API
BinaryArchiveWriter.WriteLine Method
 Writes a Line value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteLine(
	Line value
)
Public Sub WriteLine (
	value As Line
)
Parameters
value
Type: Rhino.Geometry.Line
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace