RhinoCommon API
Vector3f.ToString Method
 Constructs the string representation of the current vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The vector representation in the form X,Y,Z.
See Also
Reference
Vector3f Structure
ToString Overload
Rhino.Geometry Namespace