RhinoCommon API
MeshNgonList.AddPlanarNgons Method (Double, Int32, Int32, Boolean)
 Add an ngon for each group of connected coplanar faces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int AddPlanarNgons(
	double planarTolerance,
	int minimumNgonVertexCount,
	int minimumNgonFaceCount,
	bool allowHoles
)
Public Function AddPlanarNgons (
	planarTolerance As Double,
	minimumNgonVertexCount As Integer,
	minimumNgonFaceCount As Integer,
	allowHoles As Boolean
) As Integer
Parameters
planarTolerance
Type: System.Double
3d distance tolerance for coplanar test.
minimumNgonVertexCount
Type: System.Int32
Minimum number of vertices for an ngon.
minimumNgonFaceCount
Type: System.Int32
Minimum number of faces for an ngon.
allowHoles
Type: System.Boolean
Determines whether the ngon can have inner boundaries.
Return Value
Type: Int32
Number of ngons added to the mesh.
See Also
Reference
MeshNgonList Class
AddPlanarNgons Overload
Rhino.Geometry.Collections Namespace