RhinoCommon API
SafeFrame Constructor (SafeFrame)
 Create a utility object not associated with any document from another object
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public SafeFrame(
	SafeFrame sf
)
Public Sub New (
	sf As SafeFrame
)
Parameters
sf
Type: Rhino.Render.SafeFrame
[Missing <param name="sf"/> documentation for "M:Rhino.Render.SafeFrame.#ctor(Rhino.Render.SafeFrame)"]
See Also
Reference
SafeFrame Class
SafeFrame Overload
Rhino.Render Namespace