RhinoCommon API
Plane.Flip Method
 Flip this plane by swapping out the X and Y axes and inverting the Z axis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Flip()
Public Sub Flip
See Also
Reference
Plane Structure
Rhino.Geometry Namespace