RhinoCommon API
ChangeQueue.BakingSize Method
 Override this if you need to control the size of the baked bitmaps for textures. By default the value returned is 2048.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual int BakingSize(
	RhinoObject ro,
	RenderMaterial material,
	TextureType type
)
Protected Overridable Function BakingSize (
	ro As RhinoObject,
	material As RenderMaterial,
	type As TextureType
) As Integer
Parameters
ro
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="ro"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.BakingSize(Rhino.DocObjects.RhinoObject,Rhino.Render.RenderMaterial,Rhino.DocObjects.TextureType)"]
material
Type: Rhino.Render.RenderMaterial
[Missing <param name="material"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.BakingSize(Rhino.DocObjects.RhinoObject,Rhino.Render.RenderMaterial,Rhino.DocObjects.TextureType)"]
type
Type: Rhino.DocObjects.TextureType
[Missing <param name="type"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.BakingSize(Rhino.DocObjects.RhinoObject,Rhino.Render.RenderMaterial,Rhino.DocObjects.TextureType)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.BakingSize(Rhino.DocObjects.RhinoObject,Rhino.Render.RenderMaterial,Rhino.DocObjects.TextureType)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace