RhinoCommon API
StdVectorGuid.ToArray Method
 Returns the managed counterpart of the unmanaged vector.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid[] ToArray()
Public Function ToArray As Guid()
Return Value
Type: Guid[]
The managed array.
See Also
Reference
StdVectorGuid Class
Rhino.Runtime.InteropWrappers Namespace