RhinoCommon API
TransformObjectList Constructor
Initializes a new instance of the TransformObjectList class
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public TransformObjectList()
Public Sub New
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace