RhinoCommon API
NodeInCodeTable.TryGetMember Method
 Dynamically binds the table to property-like access via its item names.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override bool TryGetMember(
	GetMemberBinder binder,
	out Object result
)
Public Overrides Function TryGetMember (
	binder As GetMemberBinder,
	<OutAttribute> ByRef result As Object
) As Boolean
Parameters
binder
Type: System.Dynamic.GetMemberBinder
The dynamic binder.
result
Type: System.Object
Returns the result.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.NodeInCode.NodeInCodeTable.TryGetMember(System.Dynamic.GetMemberBinder,System.Object@)"]
See Also
Reference
NodeInCodeTable Class
Rhino.NodeInCode Namespace