RhinoCommon API
DirectionGripUserInterfaceObject Constructor
 Create a direction grip located at location and constrained to a direction
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public DirectionGripUserInterfaceObject(
	Point3d location,
	Vector3d direction
)
Public Sub New (
	location As Point3d,
	direction As Vector3d
)
Parameters
location
Type: Rhino.Geometry.Point3d
Grip location
direction
Type: Rhino.Geometry.Vector3d
Line constraint for the grip
See Also
Reference
DirectionGripUserInterfaceObject Class
Rhino.UI Namespace