RhinoCommon API
Centermark Constructor (Plane, Point3d, Double)
 Constructs a new center mark dimension.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Centermark(
	Plane plane,
	Point3d centerPoint,
	double radius
)
Public Sub New (
	plane As Plane,
	centerPoint As Point3d,
	radius As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
Dimension's plane.
centerPoint
Type: Rhino.Geometry.Point3d
Dimension's center point.
radius
Type: System.Double
Center mark's radius.
See Also
Reference
Centermark Class
Centermark Overload
Rhino.Geometry Namespace