RhinoCommon API
Brep.CreateFromTaperedExtrudeWithRef Method
 Creates one or more Breps by extruding a curve a distance along an axis with draft angle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public static Brep[] CreateFromTaperedExtrudeWithRef(
	Curve curve,
	Vector3d direction,
	double distance,
	double draftAngle,
	Plane plane,
	double tolerance
)
Public Shared Function CreateFromTaperedExtrudeWithRef (
	curve As Curve,
	direction As Vector3d,
	distance As Double,
	draftAngle As Double,
	plane As Plane,
	tolerance As Double
) As Brep()
Parameters
curve
Type: Rhino.Geometry.Curve
The curve to extrude.
direction
Type: Rhino.Geometry.Vector3d
The extrusion direction.
distance
Type: System.Double
The extrusion distance.
draftAngle
Type: System.Double
The extrusion draft angle in radians.
plane
Type: Rhino.Geometry.Plane
 The end of the extrusion will be parallel to this plane, and "distance" from the plane's origin. The plane's origin is generally be a point on the curve. For planar curves, a natural choice for the plane's normal direction will be the normal direction of the curve's plane. In any case, plane.Normal = direction may make sense.
tolerance
Type: System.Double
The intersecting and trimming tolerance.
Return Value
Type: Brep[]
An array of Breps if successful.
See Also
Reference
Brep Class
Rhino.Geometry Namespace