RhinoCommon API
SubDEdgeChain.SortEdgesIntoEdgeChains Method
 Sorts a set of edges into chains.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static SubDEdge[][] SortEdgesIntoEdgeChains(
	SubD subd,
	IEnumerable<SubDEdge> edges
)
Public Shared Function SortEdgesIntoEdgeChains (
	subd As SubD,
	edges As IEnumerable(Of SubDEdge)
) As SubDEdge()()
Parameters
subd
Type: Rhino.Geometry.SubD
The SubD the edges belong to.
edges
Type: System.Collections.Generic.IEnumerable<SubDEdge>
 The edges to sort. Where three or more of them meet at one vertex, no chain passes through that vertex.
Return Value
Type: SubDEdge[][]
 One array of edges per chain, in chain order. Each returned edge carries the direction its chain traverses it with.
Remarks
 This uses the mark bits on the edges and vertices involved, so it must not run on the same SubD from more than one thread at a time.
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace