RhinoCommon API
Rectangle3d.CreateFromPolyline Method (IEnumerable<Point3d>, Double, Double)
 Attempts to create a rectangle from a polyline. This method only works well for polylines that already closely resemble rectangles. If the polyline contains more than four vertices, the least significant ones will be ignored. If the polylines is non-orthogonal, the discrepancies will be averaged away. This method should not be used as a Rectangle fitter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Rectangle3d CreateFromPolyline(
	IEnumerable<Point3d> polyline,
	out double deviation,
	out double angleDeviation
)
Public Shared Function CreateFromPolyline (
	polyline As IEnumerable(Of Point3d),
	<OutAttribute> ByRef deviation As Double,
	<OutAttribute> ByRef angleDeviation As Double
) As Rectangle3d
Parameters
polyline
Type: System.Collections.Generic.IEnumerable<Point3d>
Polyline to parse.
deviation
Type: System.Double
On success, the deviation will contain the largest deviation between the polyline and the rectangle.
angleDeviation
Type: System.Double
On success, the angleDeviation will contain the largest deviation (in radians) between the polyline edges and the rectangle edges.
Return Value
Type: Rectangle3d
A rectangle that is shaped similarly to the polyline or Rectangle3d.Unset if the polyline does not represent a rectangle.
See Also
Reference
Rectangle3d Structure
CreateFromPolyline Overload
Rhino.Geometry Namespace