RhinoCommon API
FileTypeList.AddFileType Method (String, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int AddFileType(
	string description,
	IEnumerable<string> extensions
)
Public Function AddFileType (
	description As String,
	extensions As IEnumerable(Of String)
) As Integer
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.Collections.Generic.IEnumerable{System.String})"]
extensions
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="extensions"/> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
FileTypeList Class
AddFileType Overload
Rhino.PlugIns Namespace