RhinoCommon API
InstanceDefinitionGeometry.DeleteUserString Method
 Deletes the user string with the specified key from this geometry.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public bool DeleteUserString(
	string key
)
Public Function DeleteUserString (
	key As String
) As Boolean
Parameters
key
Type: System.String
The key of the user string to delete.
Return Value
Type: Boolean
True if the user string was deleted or did not exist; otherwise, false.
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace