RhinoCommon API
ContentHash.CreateFromFile Method
 Creates a new ContentHash, representing the content of a file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ContentHash CreateFromFile(
	string path
)
Public Shared Function CreateFromFile (
	path As String
) As ContentHash
Parameters
path
Type: System.String
A path. This can be null and can refer to a non-existing path.
Return Value
Type: ContentHash
[Missing <returns> documentation for "M:Rhino.FileIO.ContentHash.CreateFromFile(System.String)"]
See Also
Reference
ContentHash Class
Rhino.FileIO Namespace