RhinoCommon API
Mesh.CreateFromIsosurface Method
 Create an isosurface mesh based on a scalar field evaluator
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Mesh CreateFromIsosurface(
	Func<Point3d, double> scalarFieldEvaluator,
	BoundingBox box,
	int resolution,
	int RootFindingMaxSteps
)
Public Shared Function CreateFromIsosurface (
	scalarFieldEvaluator As Func(Of Point3d, Double),
	box As BoundingBox,
	resolution As Integer,
	RootFindingMaxSteps As Integer
) As Mesh
Parameters
scalarFieldEvaluator
Type: System.Func<Point3d, Double>
[Missing <param name="scalarFieldEvaluator"/> documentation for "M:Rhino.Geometry.Mesh.CreateFromIsosurface(System.Func{Rhino.Geometry.Point3d,System.Double},Rhino.Geometry.BoundingBox,System.Int32,System.Int32)"]
box
Type: Rhino.Geometry.BoundingBox
[Missing <param name="box"/> documentation for "M:Rhino.Geometry.Mesh.CreateFromIsosurface(System.Func{Rhino.Geometry.Point3d,System.Double},Rhino.Geometry.BoundingBox,System.Int32,System.Int32)"]
resolution
Type: System.Int32
[Missing <param name="resolution"/> documentation for "M:Rhino.Geometry.Mesh.CreateFromIsosurface(System.Func{Rhino.Geometry.Point3d,System.Double},Rhino.Geometry.BoundingBox,System.Int32,System.Int32)"]
RootFindingMaxSteps
Type: System.Int32
[Missing <param name="RootFindingMaxSteps"/> documentation for "M:Rhino.Geometry.Mesh.CreateFromIsosurface(System.Func{Rhino.Geometry.Point3d,System.Double},Rhino.Geometry.BoundingBox,System.Int32,System.Int32)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.CreateFromIsosurface(System.Func{Rhino.Geometry.Point3d,System.Double},Rhino.Geometry.BoundingBox,System.Int32,System.Int32)"]
See Also
Reference
Mesh Class
Rhino.Geometry Namespace