RhinoCommon API
TextFields.Date Method (String)
 Current date in a specified format
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Date(
	string dateFormat
)
Public Shared Function Date (
	dateFormat As String
) As String
Parameters
dateFormat
Type: System.String
[Missing <param name="dateFormat"/> documentation for "M:Rhino.Runtime.TextFields.Date(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.Date(System.String)"]
See Also
Reference
TextFields Class
Date Overload
Rhino.Runtime Namespace