RhinoCommon API
IShrinkWrapService.ShrinkWrap Method (PointCloud, ShrinkWrapParameters)
 Create mesh from point cloud input. Null on error or incompatible settings
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
Mesh ShrinkWrap(
	PointCloud pointCloud,
	ShrinkWrapParameters parameters
)
Function ShrinkWrap (
	pointCloud As PointCloud,
	parameters As ShrinkWrapParameters
) As Mesh
Parameters
pointCloud
Type: Rhino.Geometry.PointCloud
[Missing <param name="pointCloud"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters)"]
parameters
Type: Rhino.Geometry.ShrinkWrapParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters)"]
See Also
Reference
IShrinkWrapService Interface
ShrinkWrap Overload
Rhino.Runtime Namespace