RhinoCommon API
CollapsibleSectionImpl.Dispose Method
Releases all resources used by the CollapsibleSectionImpl
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace