RhinoCommon API
TwistSpaceMorph.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
TwistSpaceMorph Class
Dispose Overload
Rhino.Geometry.Morphs Namespace