RhinoCommon API
GetInteger.Get Method
 Call to get an integer.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GetResult Get()
Public Function Get As GetResult
Return Value
Type: GetResult
If the user chose a number, then Number; another enumeration value otherwise.
See Also
Reference
GetInteger Class
Rhino.Input.Custom Namespace