RhinoCommon API
Dialogs.ShowSunDialog Method
Show the modal sun dialog.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool ShowSunDialog(
	Sun sun
)
Public Shared Function ShowSunDialog (
	sun As Sun
) As Boolean
Parameters
sun
Type: Rhino.Render.Sun
[Missing <param name="sun"/> documentation for "M:Rhino.UI.Dialogs.ShowSunDialog(Rhino.Render.Sun)"]
Return Value
Type: Boolean
 Returns true if the user clicked OK, or false if the user canceled.
See Also
Reference
Dialogs Class
Rhino.UI Namespace