RhinoCommon API
Curve.PullToMesh Method (Mesh, Double, Boolean)
 Projects this curve onto a mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.17
Syntax
public Curve PullToMesh(
	Mesh mesh,
	double tolerance,
	bool loose
)
Public Function PullToMesh (
	mesh As Mesh,
	tolerance As Double,
	loose As Boolean
) As Curve
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to project onto.
tolerance
Type: System.Double
Input tolerance. When in doubt, the document's model absolute tolerance.
loose
Type: System.Boolean
 If true, the curve's edit points are pulled back to the mesh. If any edit point misses the mesh, the curve will not be created.
Return Value
Type: Curve
A curve if success, or null on failure.
See Also
Reference
Curve Class
PullToMesh Overload
Rhino.Geometry Namespace