RhinoCommon API
ObjectTable.GetObjectsByType<T> Method (ObjectEnumeratorSettings)
 Returns Rhino object by type.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IEnumerable<T> GetObjectsByType<T>(
	ObjectEnumeratorSettings settings
)
where T : RhinoObject
Public Function GetObjectsByType(Of T As RhinoObject) (
	settings As ObjectEnumeratorSettings
) As IEnumerable(Of T)
Parameters
settings
Type: Rhino.DocObjects.ObjectEnumeratorSettings
[Missing <param name="settings"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1(Rhino.DocObjects.ObjectEnumeratorSettings)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1(Rhino.DocObjects.ObjectEnumeratorSettings)"]
Return Value
Type: IEnumerable<T>
The enumerable.
See Also
Reference
ObjectTable Class
GetObjectsByType Overload
Rhino.DocObjects.Tables Namespace