RhinoCommon API
RenderMeshProvider Constructor
Initializes a new instance of the RenderMeshProvider class
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected RenderMeshProvider()
Protected Sub New
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace