RhinoCommon API
SporphSpaceMorph Constructor (Surface, Surface)
 Constructs a Sporph space morph.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public SporphSpaceMorph(
	Surface surface0,
	Surface surface1
)
Public Sub New (
	surface0 As Surface,
	surface1 As Surface
)
Parameters
surface0
Type: Rhino.Geometry.Surface
Base surface.
surface1
Type: Rhino.Geometry.Surface
Target surface.
See Also
Reference
SporphSpaceMorph Class
SporphSpaceMorph Overload
Rhino.Geometry.Morphs Namespace