RhinoCommon API
RhinoList<T>.Duplicate Method
 Returns a shallow copy of this instance. If the generic type is comprised of only value types (struct, enum, ptr), then the result will be a deep copy.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoList<T> Duplicate()
Public Function Duplicate As RhinoList(Of T)
Return Value
Type: RhinoList<T>
The duplicated list.
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace