RhinoCommon API
BrepVertexList.Add Method
 Create and add a new vertex to this list
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public BrepVertex Add()
Public Function Add As BrepVertex
Return Value
Type: BrepVertex
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.BrepVertexList.Add"]
See Also
Reference
BrepVertexList Class
Add Overload
Rhino.Geometry.Collections Namespace