RhinoCommon API
PostEffectPipeline.Dimensions Method
 Get the dimensions of the frame buffer. All channels in the frame buffer have the same dimensions.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Size Dimensions()
Public Function Dimensions As Size
Return Value
Type: Size
Dimension as Size
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace