RhinoCommon API
File3dmRenderEnvironments Constructor
Initializes a new instance of the File3dmRenderEnvironments class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmRenderEnvironments(
	File3dm f
)
Public Sub New (
	f As File3dm
)
Parameters
f
Type: Rhino.FileIO.File3dm
[Missing <param name="f"/> documentation for "M:Rhino.FileIO.File3dmRenderEnvironments.#ctor(Rhino.FileIO.File3dm)"]
See Also
Reference
File3dmRenderEnvironments Class
Rhino.FileIO Namespace