RhinoCommon API
FileCsvDocument.TryGetGuid Method (Int32, Int32, Guid)
 Retrieves the value of a cell as a globally unique identifier. Accepts any of the formats understood by TryParse(String, Guid) (with or without hyphens or braces).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetGuid(
	int column,
	int row,
	out Guid value
)
Public Function TryGetGuid (
	column As Integer,
	row As Integer,
	<OutAttribute> ByRef value As Guid
) As Boolean
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.Guid
The parsed value, or Empty if the cell does not exist or cannot be parsed.
Return Value
Type: Boolean
true if the cell exists and was parsed; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetGuid Overload
Rhino.FileIO Namespace