RhinoCommon API
MouseCallback Constructor
Initializes a new instance of the MouseCallback class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected MouseCallback()
Protected Sub New
See Also
Reference
MouseCallback Class
Rhino.UI Namespace