RhinoCommon API
AngularDimension.AdjustFromPoints Method (Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Update angular dimension from point locations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AdjustFromPoints(
	Plane plane,
	Point3d extpoint1,
	Point3d extpoint2,
	Point3d dirpoint1,
	Point3d dirpoint2,
	Point3d dimlinepoint
)
Public Function AdjustFromPoints (
	plane As Plane,
	extpoint1 As Point3d,
	extpoint2 As Point3d,
	dirpoint1 As Point3d,
	dirpoint2 As Point3d,
	dimlinepoint As Point3d
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
Dimension's plane
extpoint1
Type: Rhino.Geometry.Point3d
Start of first extension line.
extpoint2
Type: Rhino.Geometry.Point3d
start of second extension line.
dirpoint1
Type: Rhino.Geometry.Point3d
point on first extension vector.
dirpoint2
Type: Rhino.Geometry.Point3d
Spoint on second extension vector.
dimlinepoint
Type: Rhino.Geometry.Point3d
point on dimension line.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
AngularDimension Class
AdjustFromPoints Overload
Rhino.Geometry Namespace