RhinoCommon API
BezierCurve.CreateBeziers Method
 Create an array of Bezier curves that fit to an existing curve. Please note, these Beziers can be of any order and may be rational.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static BezierCurve[] CreateBeziers(
	Curve sourceCurve
)
Public Shared Function CreateBeziers (
	sourceCurve As Curve
) As BezierCurve()
Parameters
sourceCurve
Type: Rhino.Geometry.Curve
The curve to fit Beziers to
Return Value
Type: BezierCurve[]
A new array of Bezier curves
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace