RhinoCommon API
UserInterfaceGrid.GetColumnSizing Method
[Missing <summary> documentation for "M:Rhino.UI.UserInterfaceGrid.GetColumnSizing(System.Int32)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceGridColumnSizing GetColumnSizing(
	int column
)
Public Function GetColumnSizing (
	column As Integer
) As UserInterfaceGridColumnSizing
Parameters
column
Type: System.Int32
[Missing <param name="column"/> documentation for "M:Rhino.UI.UserInterfaceGrid.GetColumnSizing(System.Int32)"]
Return Value
Type: UserInterfaceGridColumnSizing
[Missing <returns> documentation for "M:Rhino.UI.UserInterfaceGrid.GetColumnSizing(System.Int32)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace