RhinoCommon API
DisplayPipeline.DrawDot Method (TextDot, Color, Color, Color)
 Draw a text dot as defined by the text dot class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawDot(
	TextDot dot,
	Color fillColor,
	Color textColor,
	Color borderColor
)
Public Sub DrawDot (
	dot As TextDot,
	fillColor As Color,
	textColor As Color,
	borderColor As Color
)
Parameters
dot
Type: Rhino.Geometry.TextDot
[Missing <param name="dot"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawDot(Rhino.Geometry.TextDot,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)"]
fillColor
Type: System.Drawing.Color
[Missing <param name="fillColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawDot(Rhino.Geometry.TextDot,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)"]
textColor
Type: System.Drawing.Color
[Missing <param name="textColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawDot(Rhino.Geometry.TextDot,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)"]
borderColor
Type: System.Drawing.Color
[Missing <param name="borderColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawDot(Rhino.Geometry.TextDot,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
DrawDot Overload
Rhino.Display Namespace