RhinoCommon API
RhinoDoc.GetAnalysisMeshingParameters Method
 Get analysis meshing parameters currently used by the document
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public MeshingParameters GetAnalysisMeshingParameters()
Public Function GetAnalysisMeshingParameters As MeshingParameters
Return Value
Type: MeshingParameters
[Missing <returns> documentation for "M:Rhino.RhinoDoc.GetAnalysisMeshingParameters"]
See Also
Reference
RhinoDoc Class
Rhino Namespace