RhinoCommon API
DisplayPipeline.Draw2dPolyline Method (Point2f[], DisplayPen, Boolean)
 Draws a polyline whose coordinates are viewport pixels rather than world units. The origin is the top left of the frame, with y increasing downwards - the same space Draw2dText and DrawBitmap work in.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Draw2dPolyline(
	Point2f[] points,
	DisplayPen pen,
	bool closed
)
Public Sub Draw2dPolyline (
	points As Point2f(),
	pen As DisplayPen,
	closed As Boolean
)
Parameters
points
Type: Rhino.Geometry.Point2f[]
The polyline vertices, in screen coordinates. Fewer than two draws nothing.
pen
Type: Rhino.Display.DisplayPen
Pen to stroke the polyline with.
closed
Type: System.Boolean
 When true the polyline is closed back to its first point as part of the same figure, so that corner is stroked as a join rather than as two loose ends. Do not repeat the first point at the end when passing true.
See Also
Reference
DisplayPipeline Class
Draw2dPolyline Overload
Rhino.Display Namespace