RhinoCommon API
GetTruncatedCone.Get Method
 Prompt for the getting of a truncated cone.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Result Get(
	out Brep truncatedCone
)
Public Function Get (
	<OutAttribute> ByRef truncatedCone As Brep
) As Result
Parameters
truncatedCone
Type: Rhino.Geometry.Brep
The truncated cone in Brep form.
Return Value
Type: Result
The result of the getting operation.
See Also
Reference
GetTruncatedCone Class
Rhino.Input.Custom Namespace