RhinoCommon API
EdgeAnalysisSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static EdgeAnalysisSettingsState GetDefaultState()
Public Shared Function GetDefaultState As EdgeAnalysisSettingsState
Return Value
Type: EdgeAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.EdgeAnalysisSettings.GetDefaultState"]
See Also
Reference
EdgeAnalysisSettings Class
Rhino.ApplicationSettings Namespace