RhinoCommon API
RenderSourceView.GetViewInfo Method
 Get the ViewInfo as specified by the render source view settings.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ViewInfo GetViewInfo()
Public Function GetViewInfo As ViewInfo
Return Value
Type: ViewInfo
ViewInfo if view was found, null otherwise
See Also
Reference
RenderSourceView Class
Rhino.Render Namespace