RhinoCommon API
SupportOptions.CustomPaths Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.CustomPaths"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_CustomPathList' instead")]
public static string CustomPaths()
<ObsoleteAttribute("Use 'Libraries_CustomPathList' instead")>
Public Shared Function CustomPaths As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.CustomPaths"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace