RhinoCommon API
PersistentSettings.GetInteger Method (String, Int32, Int32, Boolean)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Int32,System.Boolean)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int GetInteger(
	string key,
	int defaultValue,
	int bound,
	bool boundIsLower
)
Public Function GetInteger (
	key As String,
	defaultValue As Integer,
	bound As Integer,
	boundIsLower As Boolean
) As Integer
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Int32,System.Boolean)"]
defaultValue
Type: System.Int32
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Int32,System.Boolean)"]
bound
Type: System.Int32
[Missing <param name="bound"/> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Int32,System.Boolean)"]
boundIsLower
Type: System.Boolean
[Missing <param name="boundIsLower"/> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Int32,System.Boolean)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Int32,System.Boolean)"]
See Also
Reference
PersistentSettings Class
GetInteger Overload
Rhino Namespace