RhinoCommon API
SimpleArrayPoint2d Constructor
 Initializes a new empty SimpleArrayPoint3d instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public SimpleArrayPoint2d()
Public Sub New
See Also
Reference
SimpleArrayPoint2d Class
Rhino.Runtime.InteropWrappers Namespace