RhinoCommon API
MeshFaceList.GetZeroAreaFaces Method
 Examines and adds face indexes to whollyDegenerateFaces if the face is a triangle with zero area or a quad both triangles have zero area. Face indexes are added to partiallyDegenerateFaces when a quad has one triangle with zero area.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GetZeroAreaFaces(
	out int[] whollyDegenerateFaces,
	out int[] partiallyDegenerateFaces
)
Public Function GetZeroAreaFaces (
	<OutAttribute> ByRef whollyDegenerateFaces As Integer(),
	<OutAttribute> ByRef partiallyDegenerateFaces As Integer()
) As Boolean
Parameters
whollyDegenerateFaces
Type: System.Int32[]
Array of indexes for faces, both triangles and quads, that have zero area.
partiallyDegenerateFaces
Type: System.Int32[]
Array of indexes for quad faces, that have one triangle with zero area.
Return Value
Type: Boolean
Returns true if the mesh has wholly or partially degenerate faces, false otherwise.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace