RhinoCommon API
ClippingPlaneSurface Constructor (PlaneSurface)
 Constructs a ClippingPlaneSurface from a PlaneSurface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public ClippingPlaneSurface(
	PlaneSurface planeSurface
)
Public Sub New (
	planeSurface As PlaneSurface
)
Parameters
planeSurface
Type: Rhino.Geometry.PlaneSurface
[Missing <param name="planeSurface"/> documentation for "M:Rhino.Geometry.ClippingPlaneSurface.#ctor(Rhino.Geometry.PlaneSurface)"]
See Also
Reference
ClippingPlaneSurface Class
ClippingPlaneSurface Overload
Rhino.Geometry Namespace