RhinoCommon API
FileGts.Write Method
Write a Gts file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	FileGtsWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As FileGtsWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileGtsWriteOptions
options used for generating the Gts file
Return Value
Type: Boolean
true on success
See Also
Reference
FileGts Class
Rhino.FileIO Namespace