RhinoCommon API
MeshSplitOptions Constructor
Initializes a new instance of the MeshSplitOptions class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshSplitOptions()
Public Sub New
See Also
Reference
MeshSplitOptions Class
Rhino.Geometry Namespace