RhinoCommon API
DisplayPipelineAttributes.HasColorFadeEffect Method
 Returns TRUE if there is a color fade effect enabled with a color fade effect amount larger than 0.0, FALSE otherwise.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool HasColorFadeEffect()
Public Function HasColorFadeEffect As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipelineAttributes.HasColorFadeEffect"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace