RhinoCommon API
RhinoCore.DoEvents Method
 If a Rhino owned window is active processes all Windows messages currently in the message queue.
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool DoEvents()
Public Function DoEvents As Boolean
Return Value
Type: Boolean
Returns true if a Rhino owned window is still active or Idle tasks are pending.
See Also
Reference
RhinoCore Class
Rhino.Runtime.InProcess Namespace