RhinoCommon API
DisplayPipeline.PopDepthWriting Method
 Pop a DepthWriting flag off the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void PopDepthWriting()
Public Sub PopDepthWriting
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace