RhinoCommon API
Extrusion.WallEdge Method
 Gets one of the longitudinal curves along the beam or extrusion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Curve WallEdge(
	ComponentIndex ci
)
Public Function WallEdge (
	ci As ComponentIndex
) As Curve
Parameters
ci
Type: Rhino.Geometry.ComponentIndex
The index of this profile.
Return Value
Type: Curve
The profile.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace