RhinoCommon API
CommandAliasList.FindAlias Method
 Find an existing CommandAlias given the alias string
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static CommandAlias FindAlias(
	string alias
)
Public Shared Function FindAlias (
	alias As String
) As CommandAlias
Parameters
alias
Type: System.String
[Missing <param name="alias"/> documentation for "M:Rhino.ApplicationSettings.CommandAliasList.FindAlias(System.String)"]
Return Value
Type: CommandAlias
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.CommandAliasList.FindAlias(System.String)"]
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace