RhinoCommon API
SectionStyleTable.Delete Method (SectionStyle)
 Deletes a section style.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public override bool Delete(
	SectionStyle item
)
Public Overrides Function Delete (
	item As SectionStyle
) As Boolean
Parameters
item
Type: Rhino.DocObjects.SectionStyle
The section style to delete.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
SectionStyleTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace