RhinoCommon API
Squisher.SquishMesh Method (SquishParameters, Mesh, IEnumerable<GeometryBase>, List<GeometryBase>)
 Squish the given mesh into a flat mesh
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public Mesh SquishMesh(
	SquishParameters sp,
	Mesh mesh3d,
	IEnumerable<GeometryBase> marks,
	List<GeometryBase> squished_marks_out
)
Public Function SquishMesh (
	sp As SquishParameters,
	mesh3d As Mesh,
	marks As IEnumerable(Of GeometryBase),
	squished_marks_out As List(Of GeometryBase)
) As Mesh
Parameters
sp
Type: Rhino.Geometry.SquishParameters
The parameters for the squish operation
mesh3d
Type: Rhino.Geometry.Mesh
The mesh to squish
marks
Type: System.Collections.Generic.IEnumerable<GeometryBase>
Points, Curves, PoiuntClouds, and TextDots to squish. Can be null.
squished_marks_out
Type: System.Collections.Generic.List<GeometryBase>
The squished marks. If a mark fails to squish, it will have a null entry in the list.
Return Value
Type: Mesh
A flattened mesh
See Also
Reference
Squisher Class
SquishMesh Overload
Rhino.Geometry Namespace