RhinoCommon API
Curve.DivideByCount Method (Int32, Boolean)
 Divide the curve into a number of equal-length segments.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double[] DivideByCount(
	int segmentCount,
	bool includeEnds
)
Public Function DivideByCount (
	segmentCount As Integer,
	includeEnds As Boolean
) As Double()
Parameters
segmentCount
Type: System.Int32
Segment count. Note that the number of division points may differ from the segment count.
includeEnds
Type: System.Boolean
If true, then the point at the start of the first division segment is returned.
Return Value
Type: Double[]
 List of curve parameters at the division points on success, null on failure.
See Also
Reference
Curve Class
DivideByCount Overload
Rhino.Geometry Namespace