RhinoCommon API
TextFields.BlockAttributeText Method
 User text associated with a block
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string BlockAttributeText(
	string key,
	string prompt,
	string defaultValue
)
Public Shared Function BlockAttributeText (
	key As String,
	prompt As String,
	defaultValue As String
) As String
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Runtime.TextFields.BlockAttributeText(System.String,System.String,System.String)"]
prompt
Type: System.String
[Missing <param name="prompt"/> documentation for "M:Rhino.Runtime.TextFields.BlockAttributeText(System.String,System.String,System.String)"]
defaultValue
Type: System.String
[Missing <param name="defaultValue"/> documentation for "M:Rhino.Runtime.TextFields.BlockAttributeText(System.String,System.String,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.BlockAttributeText(System.String,System.String,System.String)"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace