RhinoCommon API
Surface.TryGetExtrusion Method (Extrusion)
Tests a surface to see if it is an extrusion within RhinoMath.ZeroTolerance and returns the extrusion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetExtrusion(
	out Extrusion extrusion
)
Public Function TryGetExtrusion (
	<OutAttribute> ByRef extrusion As Extrusion
) As Boolean
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
On success, the extrusion parameters are filled in.
Return Value
Type: Boolean
true if the surface is an extrusion.
See Also
Reference
Surface Class
TryGetExtrusion Overload
Rhino.Geometry Namespace