RhinoCommon API
DimensionStyle.Duplicate Method
 Construct a deep (full) copy of this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle Duplicate()
Public Function Duplicate As DimensionStyle
Return Value
Type: DimensionStyle
An object of the same type as this, with the same properties and behavior.
See Also
Reference
DimensionStyle Class
Duplicate Overload
Rhino.DocObjects Namespace