RhinoCommon API
ManifestTable.FindNameHash Method (NameHash, ModelComponentType)
 Uses the hash of the name to find a model component. Deleted objects have no name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract ModelComponent FindNameHash(
	NameHash nameHash,
	ModelComponentType type
)
Public MustOverride Function FindNameHash (
	nameHash As NameHash,
	type As ModelComponentType
) As ModelComponent
Parameters
nameHash
Type: Rhino.FileIO.NameHash
NameHash of model component to search for.
type
Type: Rhino.DocObjects.ModelComponentType
The type to be searched. Cannot be Unset.
Return Value
Type: ModelComponent
Reference to the rhino object or null if no such object could be found.
See Also
Reference
ManifestTable Class
FindNameHash Overload
Rhino.FileIO Namespace