RhinoCommon API
ChangeQueue.NotifyEndUpdates Method
 Override this when you want to be notified when change notifications have ended.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void NotifyEndUpdates()
Protected Overridable Sub NotifyEndUpdates
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace