RhinoCommon API
WorksessionFileModel.ClearLayerOverrides Method
Removes all of the layer overrides.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void ClearLayerOverrides()
Public Sub ClearLayerOverrides
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace