RhinoCommon API
PythonScript.SetupScriptContext Method
 Setups the script context. Use a RhinoDoc instance unless unsure.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual void SetupScriptContext(
	Object doc
)
Public Overridable Sub SetupScriptContext (
	doc As Object
)
Parameters
doc
Type: System.Object
Document.
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace