RhinoCommon API
WorksessionFile.Read Method
Reads a worksession file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static WorksessionFile Read(
	string path
)
Public Shared Function Read (
	path As String
) As WorksessionFile
Parameters
path
Type: System.String
The file to read.
Return Value
Type: WorksessionFile
 The worksession, or null if the file could not be read. That includes a worksession file from a newer version of Rhino: ReadFileVersion(String) returns a version greater than CurrentVersion for those, and 0 for a file that is not a worksession file.
Exceptions
Exception | Condition
ArgumentNullException | If path is null.
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace