RhinoCommon API
RealtimeDisplayMode.ShowCaptureProgress Method
 Override if you want to i.e. hide the progress dialog for capture progress.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool ShowCaptureProgress()
Public Overridable Function ShowCaptureProgress As Boolean
Return Value
Type: Boolean
Return true to show, false to hide
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace