RhinoCommon API
InstanceDefinition.CreatePreviewBitmap Method (Guid, DefinedViewportProjection, DisplayMode, Size, Boolean)
 Creates a preview bitmap of the instance definition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.21
Syntax
public Bitmap CreatePreviewBitmap(
	Guid definitionObjectId,
	DefinedViewportProjection viewportProjection,
	DisplayMode displayMode,
	Size bitmapSize,
	bool applyDpiScaling
)
Public Function CreatePreviewBitmap (
	definitionObjectId As Guid,
	viewportProjection As DefinedViewportProjection,
	displayMode As DisplayMode,
	bitmapSize As Size,
	applyDpiScaling As Boolean
) As Bitmap
Parameters
definitionObjectId
Type: System.Guid
Id of one of this definition's objects to draw selected.
viewportProjection
Type: Rhino.Display.DefinedViewportProjection
The view projection.
displayMode
Type: Rhino.DocObjects.DisplayMode
The display mode.
bitmapSize
Type: System.Drawing.Size
The bitmap size in pixels.
applyDpiScaling
Type: System.Boolean
Specify true to apply DPI scaling (Windows-only).
Return Value
Type: Bitmap
The preview bitmap if successful, null otherwise.
See Also
Reference
InstanceDefinition Class
CreatePreviewBitmap Overload
Rhino.DocObjects Namespace