RhinoCommon API
Surface.CreatePeriodicSurface Method (Surface, Int32, Boolean)
 Constructs a periodic surface from a base surface and a direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Surface CreatePeriodicSurface(
	Surface surface,
	int direction,
	bool bSmooth
)
Public Shared Function CreatePeriodicSurface (
	surface As Surface,
	direction As Integer,
	bSmooth As Boolean
) As Surface
Parameters
surface
Type: Rhino.Geometry.Surface
The surface to make periodic.
direction
Type: System.Int32
The direction to make periodic, either 0 = U, or 1 = V.
bSmooth
Type: System.Boolean
 Controls kink removal. If true, smooths any kinks in the surface and moves control points to make a smooth surface. If false, control point locations are not changed or changed minimally (only one point may move) and only the knot vector is altered.
Return Value
Type: Surface
A periodic surface if successful, null on failure.
See Also
Reference
Surface Class
CreatePeriodicSurface Overload
Rhino.Geometry Namespace