RhinoCommon API
GroupTable.FindName Method
 Finds a group given its name. Returns the instance, rather than the index.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Group FindName(
	string name
)
Public Function FindName (
	name As String
) As Group
Parameters
name
Type: System.String
The name of the group to be searched.
Return Value
Type: Group
An group, or null on error.
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace