RhinoCommon API
FieldDictionary.AddTextured Method (String, Double, String, Boolean, Int32)
 Add a new DoubleField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public DoubleField AddTextured(
	string key,
	double value,
	string prompt,
	bool treatAsLinear,
	int sectionId
)
Public Function AddTextured (
	key As String,
	value As Double,
	prompt As String,
	treatAsLinear As Boolean,
	sectionId As Integer
) As DoubleField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: System.Double
Initial value for this field.
prompt
Type: System.String
 Prompt to display in the user interface (Content Browsers) if this is null or an empty string the this field is a data only field and will not appear in the user interface.
treatAsLinear
Type: System.Boolean
Determines whether the texture in this slot will be treated as linear by rendering engines (ie - not gamma packed).
sectionId
Type: System.Int32
The id of the section containing the field
Return Value
Type: DoubleField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Double,System.String,System.Boolean,System.Int32)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
AddTextured Overload
Rhino.Render.Fields Namespace