RhinoCommon API
RdkSelectionNavigator.CanGoForwards Method
 Check the forwards status of the navigator
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool CanGoForwards()
Public Function CanGoForwards As Boolean
Return Value
Type: Boolean
True if it is possible to navigate forwards, else false
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace