RhinoCommon API
ArchivableDictionary.Clone Method
 Constructs a deep copy of this object.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ArchivableDictionary Clone()
Public Function Clone As ArchivableDictionary
Return Value
Type: ArchivableDictionary
The copy of this object.
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace