RhinoCommon API
StdVectorByte Constructor (StdVectorByte)
 Initializes a new SimpleArrayByte with the contents of another SimpleArrayByte.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.26
Syntax
public StdVectorByte(
	StdVectorByte other
)
Public Sub New (
	other As StdVectorByte
)
Parameters
other
Type: Rhino.Runtime.InteropWrappers.StdVectorByte
[Missing <param name="other"/> documentation for "M:Rhino.Runtime.InteropWrappers.StdVectorByte.#ctor(Rhino.Runtime.InteropWrappers.StdVectorByte)"]
See Also
Reference
StdVectorByte Class
StdVectorByte Overload
Rhino.Runtime.InteropWrappers Namespace