RhinoCommon API
DraftAngleAnalysisSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static DraftAngleAnalysisSettingsState GetDefaultState()
Public Shared Function GetDefaultState As DraftAngleAnalysisSettingsState
Return Value
Type: DraftAngleAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.DraftAngleAnalysisSettings.GetDefaultState"]
See Also
Reference
DraftAngleAnalysisSettings Class
Rhino.ApplicationSettings Namespace