RhinoCommon API
PersistentSettings.SetDefault Method (String, Nullable<Color>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Nullable{System.Drawing.Color})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDefault(
	string key,
	Color? value
)
Public Sub SetDefault (
	key As String,
	value As Color?
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Nullable{System.Drawing.Color})"]
value
Type: System.Nullable<Color>
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Nullable{System.Drawing.Color})"]
See Also
Reference
PersistentSettings Class
SetDefault Overload
Rhino Namespace