RhinoCommon API
FileWriteOptions.GetFileName Method
[Missing <summary> documentation for "M:Rhino.FileIO.FileWriteOptions.GetFileName"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string GetFileName()
Public Function GetFileName As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.FileIO.FileWriteOptions.GetFileName"]
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace