RhinoCommon API
Layer.DeleteModelVisible Method
 Remove any model visibility setting so the layer's global setting will be used for all viewports.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void DeleteModelVisible()
Public Sub DeleteModelVisible
See Also
Reference
Layer Class
Rhino.DocObjects Namespace