RhinoCommon API
LengthUnit.FromCustomUnitSystem Method
 Creates a custom LengthUnit based on its size expressed on a known UnitSystem.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static LengthUnit FromCustomUnitSystem(
	string name,
	double customUnitSize,
	UnitSystem knownUnitSystem = UnitSystem.Meters
)
Public Shared Function FromCustomUnitSystem (
	name As String,
	customUnitSize As Double,
	Optional knownUnitSystem As UnitSystem = UnitSystem.Meters
) As LengthUnit
Parameters
name
Type: System.String
Name of the custom unit
customUnitSize
Type: System.Double
Meters per custom unit in case knownUnitSystem is omitted
knownUnitSystem (Optional)
Type: Rhino.UnitSystem
A known unit system. Meters when omitted
Return Value
Type: LengthUnit
[Missing <returns> documentation for "M:Rhino.LengthUnit.FromCustomUnitSystem(System.String,System.Double,Rhino.UnitSystem)"]
Exceptions
Exception | Condition
ArgumentNullException | When name is null
ArgumentException | When customUnitSize is not a positive finite number
See Also
Reference
LengthUnit Structure
Rhino Namespace