RhinoCommon API
StatusBar.HideProgressMeter Method
 Ends, or hides, Rhino's status bar progress meter.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void HideProgressMeter()
Public Shared Sub HideProgressMeter
See Also
Reference
StatusBar Class
HideProgressMeter Overload
Rhino.UI Namespace