RhinoCommon API
SupportOptions.ShowDocuments Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.ShowDocuments"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_ShowDocuments' instead")]
public static bool ShowDocuments()
<ObsoleteAttribute("Use 'Libraries_ShowDocuments' instead")>
Public Shared Function ShowDocuments As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.ShowDocuments"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace