RhinoCommon API
RenderTabs.SessionIdFromTab Method
 Get the render session id that created the specified tab object. Only applies to tabs in the context of a render window, not other contexts like Rhino Options or View Properties. It actually returns the identifier associated with the side pane UI which is typically the same as the render session id.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public static Guid SessionIdFromTab(
	Object tab
)
Public Shared Function SessionIdFromTab (
	tab As Object
) As Guid
Parameters
tab
Type: System.Object
[Missing <param name="tab"/> documentation for "M:Rhino.Render.RenderTabs.SessionIdFromTab(System.Object)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.RenderTabs.SessionIdFromTab(System.Object)"]
See Also
Reference
RenderTabs Class
Rhino.Render Namespace