RhinoCommon API
Brep.Compact Method
 Deletes any unreferenced objects from arrays, re-indexes as needed, and shrinks arrays to minimum required size. Uses CUllUnused* members to delete any unreferenced objects from arrays.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Compact()
Public Sub Compact
See Also
Reference
Brep Class
Rhino.Geometry Namespace