RhinoCommon API
ObjectTable.AddMorphControl Method (MorphControl, ObjectAttributes, HistoryRecord, Boolean)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid AddMorphControl(
	MorphControl morphControl,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddMorphControl (
	morphControl As MorphControl,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
morphControl
Type: Rhino.Geometry.MorphControl
[Missing <param name="morphControl"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
history
Type: Rhino.DocObjects.HistoryRecord
[Missing <param name="history"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
reference
Type: System.Boolean
[Missing <param name="reference"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
See Also
Reference
ObjectTable Class
AddMorphControl Overload
Rhino.DocObjects.Tables Namespace