RhinoCommon API
ObjectTable.GetObjectList Method (ObjectEnumeratorSettings)
 Returns an enumerable based on a ObjectEnumeratorSettings filter.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerable<RhinoObject> GetObjectList(
	ObjectEnumeratorSettings settings
)
Public Function GetObjectList (
	settings As ObjectEnumeratorSettings
) As IEnumerable(Of RhinoObject)
Parameters
settings
Type: Rhino.DocObjects.ObjectEnumeratorSettings
The ObjectEnumeratorSettings settings.
Return Value
Type: IEnumerable<RhinoObject>
The enumerable.
See Also
Reference
ObjectTable Class
GetObjectList Overload
Rhino.DocObjects.Tables Namespace