RhinoCommon API
PersistentSettingsConverter.TryParseDouble Method
 Converts the string representation of a number to its double-precision floating-point number equivalent. A return value indicates whether the conversion succeeded or failed. system culture.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public static bool TryParseDouble(
	string s,
	out double value
)
Public Shared Function TryParseDouble (
	s As String,
	<OutAttribute> ByRef value As Double
) As Boolean
Parameters
s
Type: System.String
A string containing a number to convert.
value
Type: System.Double
 When this method returns, contains the double-precision floating-point number equivalent of the s parameter, if the conversion succeeded, or zero if the conversion failed. The conversion fails if the s parameter is null or Empty, is not a number in a valid format, or represents a number less than MinValue or greater than MaxValue. This parameter is passed uninitialized; any value originally supplied in result will be overwritten.
Return Value
Type: Boolean
 Returns true if s was converted successfully; otherwise, false..
See Also
Reference
PersistentSettingsConverter Class
Rhino Namespace