RhinoCommon API
Transform.RotationZYX Method
 Create rotation transformation From Tait-Byran angles (also loosely known as Euler angles).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public static Transform RotationZYX(
	double yaw,
	double pitch,
	double roll
)
Public Shared Function RotationZYX (
	yaw As Double,
	pitch As Double,
	roll As Double
) As Transform
Parameters
yaw
Type: System.Double
Angle, in radians, to rotate about the Z axis.
pitch
Type: System.Double
Angle, in radians, to rotate about the Y axis.
roll
Type: System.Double
Angle, in radians, to rotate about the X axis.
Return Value
Type: Transform
A transform matrix from Tait-Byran angles.
Remarks
 RotationZYX(yaw, pitch, roll) = R_z(yaw) * R_y(pitch) * R_x(roll) where R_*(angle) is rotation of angle radians about the corresponding world coordinate axis.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace