RhinoCommon API
PlugIn.GetPlugInInfo Method
 Returns detailed information about an installed Rhino plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static PlugInInfo GetPlugInInfo(
	Guid pluginId
)
Public Shared Function GetPlugInInfo (
	pluginId As Guid
) As PlugInInfo
Parameters
pluginId
Type: System.Guid
The id of the plug-in.
Return Value
Type: PlugInInfo
Detailed information about an installed Rhino plug-in if successful, null otherwise.
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace