RhinoCommon API
ScaleValue.Dispose Method
actively reclaim native allocated ON_SacleValue*
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ScaleValue Class
Rhino Namespace