RhinoCommon API
SimulatedTexture.MetersToUnits Method (RhinoDoc, Double)
[Missing <summary> documentation for "M:Rhino.Render.SimulatedTexture.MetersToUnits(Rhino.RhinoDoc,System.Double)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double MetersToUnits(
	RhinoDoc doc,
	double units
)
Public Function MetersToUnits (
	doc As RhinoDoc,
	units As Double
) As Double
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.SimulatedTexture.MetersToUnits(Rhino.RhinoDoc,System.Double)"]
units
Type: System.Double
[Missing <param name="units"/> documentation for "M:Rhino.Render.SimulatedTexture.MetersToUnits(Rhino.RhinoDoc,System.Double)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.SimulatedTexture.MetersToUnits(Rhino.RhinoDoc,System.Double)"]
See Also
Reference
SimulatedTexture Class
MetersToUnits Overload
Rhino.Render Namespace