RhinoCommon API
Curve.GetConicSectionType Method
 Returns the type of conic section based on the curve's shape.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ConicSectionType GetConicSectionType()
Public Function GetConicSectionType As ConicSectionType
Return Value
Type: ConicSectionType
[Missing <returns> documentation for "M:Rhino.Geometry.Curve.GetConicSectionType"]
See Also
Reference
Curve Class
GetConicSectionType Overload
Rhino.Geometry Namespace