RhinoCommon API
RhinoList<T>.AddRange Method (IEnumerable)
 Adds the elements of the specified collection to the end of the List.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddRange(
	IEnumerable collection
)
Public Sub AddRange (
	collection As IEnumerable
)
Parameters
collection
Type: System.Collections.IEnumerable
The collection whose elements should be added to the end of the List. The collection itself cannot be a null reference (Nothing in Visual Basic), but it can contain elements that are a null reference (Nothing in Visual Basic). Objects in collection which cannot be represented as T will throw exceptions.
See Also
Reference
RhinoList<T> Class
AddRange Overload
Rhino.Collections Namespace