RhinoCommon API
SubD.DeleteComponents Method (IEnumerable<SubDComponent>, Boolean)
 Deletes components from this SubD.
 Deleting a vertex deletes every edge and face attached to it. Deleting an edge deletes every face attached to it. Deleting a face deletes only that face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool DeleteComponents(
	IEnumerable<SubDComponent> components,
	bool markDeletedFaceEdges
)
Public Function DeleteComponents (
	components As IEnumerable(Of SubDComponent),
	markDeletedFaceEdges As Boolean
) As Boolean
Parameters
components
Type: System.Collections.Generic.IEnumerable<SubDComponent>
The components to delete.
markDeletedFaceEdges
Type: System.Boolean
 If true, edges that survive the deletion of a face they bounded get their runtime mark set, so the caller can find the boundary of the hole that was opened.
Return Value
Type: Boolean
True if the deletion succeeded.
See Also
Reference
SubD Class
DeleteComponents Overload
Rhino.Geometry Namespace