RhinoCommon API
UserDataListEnumerator Constructor
 Create new UserDataListEnumerator
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public UserDataListEnumerator(
	UserDataList udl
)
Public Sub New (
	udl As UserDataList
)
Parameters
udl
Type: Rhino.DocObjects.Custom.UserDataList
UserDataList to enumerate
See Also
Reference
UserDataListEnumerator Class
Rhino.DocObjects.Custom Namespace