RhinoCommon API
File3dmCommonComponentTable<T>.Delete Method (T)
 Flags a component as deleted.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Delete(
	T item
)
Public Overrides Function Delete (
	item As T
) As Boolean
Parameters
item
Type: T
The item to flag.
Return Value
Type: Boolean
True on success.
See Also
Reference
File3dmCommonComponentTable<T> Class
Delete Overload
Rhino.FileIO Namespace