RhinoCommon API
RenderTexture.SetPreviewLocalMapping Method (Boolean)
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.SetPreviewLocalMapping(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetPreviewLocalMapping(
	bool value
)
Public Sub SetPreviewLocalMapping (
	value As Boolean
)
Parameters
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.Render.RenderTexture.SetPreviewLocalMapping(System.Boolean)"]
See Also
Reference
RenderTexture Class
SetPreviewLocalMapping Overload
Rhino.Render Namespace