RhinoCommon API
Box.Contains Method (BoundingBox)
 Determines whether a BoundingBox is inside this Box, including its boundary. This is the same as calling Contains(box,false). Invalid boxes contain nothing. Invalid bounding boxes are never contained.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Contains(
	BoundingBox box
)
Public Function Contains (
	box As BoundingBox
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
BoundingBox to test.
Return Value
Type: Boolean
true if all corners of the BoundingBox are non-strictly inside this Box. false if this Box or the BoundingBox are invalid.
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace