RhinoCommon API
SimpleArrayGeometryPointer.ToNonConstArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GeometryBase[] ToNonConstArray()
Public Function ToNonConstArray As GeometryBase()
Return Value
Type: GeometryBase[]
The managed array.
See Also
Reference
SimpleArrayGeometryPointer Class
Rhino.Runtime.InteropWrappers Namespace