RhinoCommon API
FileDstReadOptions Constructor
Initializes a new instance of the FileDstReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileDstReadOptions()
Public Sub New
See Also
Reference
FileDstReadOptions Class
Rhino.FileIO Namespace