RhinoCommon API
CustomGripObject.EvaluateGripDirections Method
 Evaluates this grip's directions. For a surface control point these are the two surface tangents and the normal; for a curve control point, the tangent and a frame around it. Rhino caches the result per grip and does not ask again, so the directions must not change once reported.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool EvaluateGripDirections(
	out Vector3d x,
	out Vector3d y,
	out Vector3d z
)
Protected Overridable Function EvaluateGripDirections (
	<OutAttribute> ByRef x As Vector3d,
	<OutAttribute> ByRef y As Vector3d,
	<OutAttribute> ByRef z As Vector3d
) As Boolean
Parameters
x
Type: Rhino.Geometry.Vector3d
First direction.
y
Type: Rhino.Geometry.Vector3d
Second direction.
z
Type: Rhino.Geometry.Vector3d
Third direction.
Return Value
Type: Boolean
true if the directions were set. The default implementation returns false.
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace