RhinoCommon API
RhinoViewport.SetClippingPlanes Method
 Sets optimal clipping planes to view objects in a world coordinate 3d bounding box.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetClippingPlanes(
	BoundingBox box
)
Public Sub SetClippingPlanes (
	box As BoundingBox
)
Parameters
box
Type: Rhino.Geometry.BoundingBox
The bounding box
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace