RhinoCommon API
UserInterfaceSlider.ValueAsFormattedString Method
 Formatted string shown based on value and digit precision
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string ValueAsFormattedString()
Public Function ValueAsFormattedString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.UserInterfaceSlider.ValueAsFormattedString"]
See Also
Reference
UserInterfaceSlider Class
Rhino.UI Namespace