RhinoCommon API
Surface.RebuildOneDirection Method
 Rebuilds an existing surface with a new surface to a given point count in either the u or v directions independently.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public NurbsSurface RebuildOneDirection(
	int direction,
	int pointCount,
	LoftType loftType,
	double refitTolerance
)
Public Function RebuildOneDirection (
	direction As Integer,
	pointCount As Integer,
	loftType As LoftType,
	refitTolerance As Double
) As NurbsSurface
Parameters
direction
Type: System.Int32
The direction (0 = U, 1 = V).
pointCount
Type: System.Int32
The number of points in the output surface in the "direction" direction.
loftType
Type: Rhino.Geometry.LoftType
The loft type
refitTolerance
Type: System.Double
The refit tolerance. When in doubt, use the document's model absolute tolerance.
Return Value
Type: NurbsSurface
new rebuilt surface on success. null on failure.
See Also
Reference
Surface Class
Rhino.Geometry Namespace