RhinoCommon API
BezierCurve.MakeNonRational Method
Make bezier non-rational
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool MakeNonRational()
Public Function MakeNonRational As Boolean
Return Value
Type: Boolean
true if successful
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace