RhinoCommon API
TrulyObservableOrderedSet<T>.RemoveRange Method
 Remove a number of items. If at least one item was removed, one CollectionChanged event is fired.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RemoveRange(
	IEnumerable<T> items
)
Public Function RemoveRange (
	items As IEnumerable(Of T)
) As Boolean
Parameters
items
Type: System.Collections.Generic.IEnumerable<T>
[Missing <param name="items"/> documentation for "M:Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.RemoveRange(System.Collections.Generic.IEnumerable{`0})"]
Return Value
Type: Boolean
true if at least one item was removed
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace