RhinoCommon API
RhinoApp.IsInstallationBeta Method
 If licenseType is a beta license, returns true. A beta license grants full use of the product during the pre-release development period.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public static bool IsInstallationBeta(
	Installation licenseType
)
Public Shared Function IsInstallationBeta (
	licenseType As Installation
) As Boolean
Parameters
licenseType
Type: Rhino.ApplicationSettings.Installation
[Missing <param name="licenseType"/> documentation for "M:Rhino.RhinoApp.IsInstallationBeta(Rhino.ApplicationSettings.Installation)"]
Return Value
Type: Boolean
true if licenseType is a beta license. false otherwise
See Also
Reference
RhinoApp Class
Rhino Namespace
Rhino.ApplicationSettings.Installation