RhinoCommon API
ChangeQueue.TextureFromOriginalInstanceId Method
 Get the RenderTexture from the ChangeQueue content cache from the original instance id
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public RenderTexture TextureFromOriginalInstanceId(
	Guid id
)
Public Function TextureFromOriginalInstanceId (
	id As Guid
) As RenderTexture
Parameters
id
Type: System.Guid
The original instance id
Return Value
Type: RenderTexture
RenderTexture
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace