RhinoCommon API
CurvatureAnalysisSettings.CalculateCurvatureMaxRange Method
 Calculates the full range of curvature values found on the analysis meshes. On success the range is written to the range of settings that matches settings.Style.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool CalculateCurvatureMaxRange(
	IEnumerable<Mesh> meshes,
	CurvatureAnalysisSettingsState settings
)
Public Shared Function CalculateCurvatureMaxRange (
	meshes As IEnumerable(Of Mesh),
	settings As CurvatureAnalysisSettingsState
) As Boolean
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
The analysis meshes to measure. Brep.CreateCurvatureAnalysisMesh creates them.
settings
Type: Rhino.ApplicationSettings.CurvatureAnalysisSettingsState
Supplies the curvature style, and receives the calculated range.
Return Value
Type: Boolean
true if the range was calculated.
Exceptions
Exception | Condition
ArgumentNullException
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace