RhinoCommon API
ObjectTable.SelectGrips Method (IEnumerable<GripObject>, Boolean, Boolean, Boolean)
 Selects or deselects a collection of grips in one pass, so a native CRhinoOnChangeObjectSelectState watcher sees one change rather than one per grip.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int SelectGrips(
	IEnumerable<GripObject> grips,
	bool select,
	bool syncHighlight,
	bool persistentSelect
)
Public Function SelectGrips (
	grips As IEnumerable(Of GripObject),
	select As Boolean,
	syncHighlight As Boolean,
	persistentSelect As Boolean
) As Integer
Parameters
grips
Type: System.Collections.Generic.IEnumerable<GripObject>
 Grips to select or deselect, from GetGrips(). They may belong to several objects. Grips whose owner has since had its grips turned off, and anything in the collection that is not a grip, are skipped. null selects nothing, which is what GetGrips() hands back for an object with no grips.
select
Type: System.Boolean
If true, the grips will be selected, otherwise deselected.
syncHighlight
Type: System.Boolean
 If true, then a grip is highlighted if it is selected and unhighlighted if it is not.
persistentSelect
Type: System.Boolean
 Grips that are persistently selected stay selected when a command terminates.
Return Value
Type: Int32
Number of grips successfully selected or deselected.
Remarks
SelectObjects and DeselectObjects do not report grips whichever way they are selected; the old event watchers have filtered grips out since Rhino 5 because grip pointers do not outlive the selection.
See Also
Reference
ObjectTable Class
SelectGrips Overload
Rhino.DocObjects.Tables Namespace