RhinoCommon API
File3dmRenderTextures Constructor
Initializes a new instance of the File3dmRenderTextures class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmRenderTextures(
	File3dm f
)
Public Sub New (
	f As File3dm
)
Parameters
f
Type: Rhino.FileIO.File3dm
[Missing <param name="f"/> documentation for "M:Rhino.FileIO.File3dmRenderTextures.#ctor(Rhino.FileIO.File3dm)"]
See Also
Reference
File3dmRenderTextures Class
Rhino.FileIO Namespace