RhinoCommon API
IZooClientUtilities.GetRegisteredOwnerInfo Method
 Returns the registered owner and organization of a license 4-Sept-2014 Dale Fugier, http://mcneel.myjetbrains.com/youtrack/issue/RH-28623
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool GetRegisteredOwnerInfo(
	Object verify,
	Guid productId,
	ref string registeredOwner,
	ref string registeredOrganization
)
Function GetRegisteredOwnerInfo (
	verify As Object,
	productId As Guid,
	ByRef registeredOwner As String,
	ByRef registeredOrganization As String
) As Boolean
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.GetRegisteredOwnerInfo(System.Object,System.Guid,System.String@,System.String@)"]
productId
Type: System.Guid
[Missing <param name="productId"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.GetRegisteredOwnerInfo(System.Object,System.Guid,System.String@,System.String@)"]
registeredOwner
Type: System.String
[Missing <param name="registeredOwner"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.GetRegisteredOwnerInfo(System.Object,System.Guid,System.String@,System.String@)"]
registeredOrganization
Type: System.String
[Missing <param name="registeredOrganization"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.GetRegisteredOwnerInfo(System.Object,System.Guid,System.String@,System.String@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.GetRegisteredOwnerInfo(System.Object,System.Guid,System.String@,System.String@)"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace