RhinoCommon API
Mesh.CreateBooleanUnion Method (IEnumerable<Mesh>, Double)
 Computes the solid union of a set of meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Mesh[] CreateBooleanUnion(
	IEnumerable<Mesh> meshes,
	double tolerance
)
Public Shared Function CreateBooleanUnion (
	meshes As IEnumerable(Of Mesh),
	tolerance As Double
) As Mesh()
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
Meshes to union.
tolerance
Type: System.Double
A valid tolerance value. See MeshIntersectionsTolerancesCoefficient
Return Value
Type: Mesh[]
An array of Mesh results or null on failure.
See Also
Reference
Mesh Class
CreateBooleanUnion Overload
Rhino.Geometry Namespace