RhinoCommon API
Point3d Constructor (Point3f)
 Initializes a new point by copying coordinates from a single-precision point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d(
	Point3f point
)
Public Sub New (
	point As Point3f
)
Parameters
point
Type: Rhino.Geometry.Point3f
A point.
See Also
Reference
Point3d Structure
Point3d Overload
Rhino.Geometry Namespace