RhinoCommon API
NurbsCurve.CreateSubDFriendly Method (Curve)
 Create a NURBS curve, that is suitable for calculations like lofting SubD objects, from an existing curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static NurbsCurve CreateSubDFriendly(
	Curve curve
)
Public Shared Function CreateSubDFriendly (
	curve As Curve
) As NurbsCurve
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to rebuild as a SubD friendly curve.
Return Value
Type: NurbsCurve
A SubD friendly NURBS curve is successful, null otherwise.
See Also
Reference
NurbsCurve Class
CreateSubDFriendly Overload
Rhino.Geometry Namespace