RhinoCommon API
SupportOptions.Libraries_SetCustomPathList Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.Libraries_SetCustomPathList(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void Libraries_SetCustomPathList(
	string path
)
Public Shared Sub Libraries_SetCustomPathList (
	path As String
)
Parameters
path
Type: System.String
Semicolon delimited string of paths.
See Also
Reference
SupportOptions Class
Rhino.Render Namespace