RhinoCommon API
BrepFace.SetPackId Method
 Used by SubD functions that create breps to transmit the subd face SubDFace.PackId value to the brep face or faces generated from the subd face. Unless you are an expert and doing something very carefully and very fancy, to not call this function.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.19
Syntax
public void SetPackId(
	uint packId
)
Public Sub SetPackId (
	packId As UInteger
)
Parameters
packId
Type: System.UInt32
The pack id.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace