RhinoCommon API
Brep.CreateFromSweep Method (Curve, IEnumerable<Curve>, Boolean, Double)
 Sweep1 function that fits a surface through profile curves that define the surface cross-sections and one curve that defines a surface edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Brep[] CreateFromSweep(
	Curve rail,
	IEnumerable<Curve> shapes,
	bool closed,
	double tolerance
)
Public Shared Function CreateFromSweep (
	rail As Curve,
	shapes As IEnumerable(Of Curve),
	closed As Boolean,
	tolerance As Double
) As Brep()
Parameters
rail
Type: Rhino.Geometry.Curve
Rail to sweep shapes along.
shapes
Type: System.Collections.Generic.IEnumerable<Curve>
Shape curves.
closed
Type: System.Boolean
Only matters if shapes are closed.
tolerance
Type: System.Double
Tolerance for fitting surface and rails.
Return Value
Type: Brep[]
Array of Brep sweep results.
Remarks
Rhino's Sweep1 command uses this when the "refit rail" option is enabled (true).
See Also
Reference
Brep Class
CreateFromSweep Overload
Rhino.Geometry Namespace