RhinoCommon API
ObjectTable.Delete Method (ObjRef, Boolean, Boolean)
 Deletes objref.Object(). The deletion can be undone by calling UndeleteObject().
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Delete(
	ObjRef objref,
	bool quiet,
	bool ignoreModes
)
Public Function Delete (
	objref As ObjRef,
	quiet As Boolean,
	ignoreModes As Boolean
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
objref.Object() will be deleted.
quiet
Type: System.Boolean
If false, a message box will appear when an object cannot be deleted.
ignoreModes
Type: System.Boolean
 If true, locked and hidden objects are deleted. If false objects that are locked, hidden, or on locked or hidden layers are not deleted.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
ObjectTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace