RhinoCommon API
LOC.STR Method (String, Object)
 Similar to Format(String, Object) function.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string STR(
	string english,
	Object assemblyOrObject
)
Public Shared Function STR (
	english As String,
	assemblyOrObject As Object
) As String
Parameters
english
Type: System.String
The English name.
assemblyOrObject
Type: System.Object
Unused.
Return Value
Type: String
English name.
See Also
Reference
LOC Class
STR Overload
Rhino.UI Namespace