RhinoCommon API
SimpleArrayArrayPoint3d Constructor
 Initializes a new empty SimpleArrayArrayPoint3d instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SimpleArrayArrayPoint3d()
Public Sub New
See Also
Reference
SimpleArrayArrayPoint3d Class
Rhino.Runtime.InteropWrappers Namespace