RhinoCommon API
File3dm.WriteMultipleObjects Method
 Creates a simple 3dm file that contains a multiple geometric objects.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool WriteMultipleObjects(
	string path,
	IEnumerable<GeometryBase> geometry
)
Public Shared Function WriteMultipleObjects (
	path As String,
	geometry As IEnumerable(Of GeometryBase)
) As Boolean
Parameters
path
Type: System.String
Path to the 3dm file to create.
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
 The geometry to be saved in the archive's object table. This is typically some Curves, Surfaces, Breps, Meshs, or SubDs.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace