RhinoCommon API
SectionStyleTable.FindName Method
Finds the section style with a given name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SectionStyle FindName(
	string name
)
Public Function FindName (
	name As String
) As SectionStyle
Parameters
name
Type: System.String
The name of the section style to find.
Return Value
Type: SectionStyle
 The section style if found; otherwise null.
See Also
Reference
SectionStyleTable Class
Rhino.DocObjects.Tables Namespace