RhinoCommon API
ObjRef.Trim Method
 If the referenced geometry is an edge of a surface, this returns the associated brep trim.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public BrepTrim Trim()
Public Function Trim As BrepTrim
Return Value
Type: BrepTrim
A boundary representation trim; or null on error
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace