RhinoCommon API
RhinoDoc.CreateHeadless Method
 Create a new headless RhinoDoc from a template file
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static RhinoDoc CreateHeadless(
	string file3dmTemplatePath
)
Public Shared Function CreateHeadless (
	file3dmTemplatePath As String
) As RhinoDoc
Parameters
file3dmTemplatePath
Type: System.String
 Name of a Rhino model to use as a template to initialize the document. If null, an empty document is created
Return Value
Type: RhinoDoc
 New RhinoDoc on success. Note that this is a "headless" RhinoDoc and it's lifetime is under your control.
See Also
Reference
RhinoDoc Class
Rhino Namespace