RhinoCommon API
File3dmGroupTable.GroupMembers Method
 Gets an array of all of the objects in a group.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.20
Syntax
public File3dmObject[] GroupMembers(
	int groupIndex
)
Public Function GroupMembers (
	groupIndex As Integer
) As File3dmObject()
Parameters
groupIndex
Type: System.Int32
The index of the group in this table.
Return Value
Type: File3dmObject[]
Array of objects that belong to the specified group or empty array if no objects could be found.
See Also
Reference
File3dmGroupTable Class
Rhino.FileIO Namespace