RhinoCommon API
PageViewGroupTable.UndoModify Method (Int32, UInt32)
 If the page view group has been modified and the modification can be undone, then this will restore the page view group to its previous state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UndoModify(
	int index,
	uint undoRecordSerialNumber
)
Public Function UndoModify (
	index As Integer,
	undoRecordSerialNumber As UInteger
) As Boolean
Parameters
index
Type: System.Int32
Zero-based index of page view group.
undoRecordSerialNumber
Type: System.UInt32
Undo record serial number.
Return Value
Type: Boolean
>true if successful, false otherwise.
See Also
Reference
PageViewGroupTable Class
UndoModify Overload
Rhino.DocObjects.Tables Namespace