RhinoCommon API
RhinoViewport.SetScreenPort Method
 Location of viewport in pixels. These are provided so you can set the port you are using and get the appropriate transformations to and from screen space.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SetScreenPort(
	int portLeft,
	int portRight,
	int portBottom,
	int portTop,
	int portNear = 0,
	int portFar = 0
)
Public Function SetScreenPort (
	portLeft As Integer,
	portRight As Integer,
	portBottom As Integer,
	portTop As Integer,
	Optional portNear As Integer = 0,
	Optional portFar As Integer = 0
) As Boolean
Parameters
portLeft
Type: System.Int32
portLeft != portRight.
portRight
Type: System.Int32
portLeft != portRight.
portBottom
Type: System.Int32
portTop != portBottom.
portTop
Type: System.Int32
portTop != portBottom.
portNear (Optional)
Type: System.Int32
The viewport near value.
portFar (Optional)
Type: System.Int32
The viewport far value.
Return Value
Type: Boolean
true if the operation is successful.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace