RhinoCommon API
PostEffectExecutionControl Constructor
Initializes a new instance of the PostEffectExecutionControl class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public PostEffectExecutionControl()
Public Sub New
See Also
Reference
PostEffectExecutionControl Class
Rhino.Render.PostEffects Namespace