RhinoCommon API
Curve.JoinCurves Method (IEnumerable<Curve>)
 Joins a collection of curve segments together.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Curve[] JoinCurves(
	IEnumerable<Curve> inputCurves
)
Public Shared Function JoinCurves (
	inputCurves As IEnumerable(Of Curve)
) As Curve()
Parameters
inputCurves
Type: System.Collections.Generic.IEnumerable<Curve>
Curve segments to join.
Return Value
Type: Curve[]
An array of joined curves. This array can be empty.
See Also
Reference
Curve Class
JoinCurves Overload
Rhino.Geometry Namespace