RhinoCommon API
File3dmDisplacement.SetSubItemWhitePoint Method
 Sets the override for displacement 'white-point'. face_index is the index of the face on the polysurface/SubD.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetSubItemWhitePoint(
	int face_index,
	double white_point
)
Public Sub SetSubItemWhitePoint (
	face_index As Integer,
	white_point As Double
)
Parameters
face_index
Type: System.Int32
[Missing <param name="face_index"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.SetSubItemWhitePoint(System.Int32,System.Double)"]
white_point
Type: System.Double
[Missing <param name="white_point"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.SetSubItemWhitePoint(System.Int32,System.Double)"]
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace