RhinoCommon API
Surface.ToBrep Method
 Converts the surface into a Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep ToBrep()
Public Function ToBrep As Brep
Return Value
Type: Brep
A Brep with a similar shape like this surface or null.
See Also
Reference
Surface Class
Rhino.Geometry Namespace