RhinoCommon API
InstanceDefinitionTable.Add Method (String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>, Boolean)
 Adds an instance definition to the instance definition table, optionally replacing an existing definition of the same name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Add(
	string name,
	string description,
	Point3d basePoint,
	IEnumerable<GeometryBase> geometry,
	IEnumerable<ObjectAttributes> attributes,
	bool overrideExisting
)
Public Function Add (
	name As String,
	description As String,
	basePoint As Point3d,
	geometry As IEnumerable(Of GeometryBase),
	attributes As IEnumerable(Of ObjectAttributes),
	overrideExisting As Boolean
) As Integer
Parameters
name
Type: System.String
The definition name.
description
Type: System.String
The definition description.
basePoint
Type: Rhino.Geometry.Point3d
A base point.
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
An array, a list or any enumerable set of geometry.
attributes
Type: System.Collections.Generic.IEnumerable<ObjectAttributes>
An array, a list or any enumerable set of attributes.
overrideExisting
Type: System.Boolean
 If true and a definition with this name exists, its geometry and description are replaced. The definition keeps its index, id, name, URL and user data, and every existing instance reference keeps its transform. Linked and reference definitions cannot be replaced this way, and -1 is returned for those, as it is for geometry that would make the definition reference itself. If false, a name already in use is an error: -1 is returned and a message naming the definition is printed to the command line.
Return Value
Type: Int32
 >=0 index of instance definition in the instance definition table. -1 on failure.
See Also
Reference
InstanceDefinitionTable Class
Add Overload
Rhino.DocObjects.Tables Namespace