RhinoCommon API
PersistentSettings.TryGetSettingType Method
 Get the type of the last value passed to Set... or Get... for the specified setting.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetSettingType(
	string key,
	out Type type
)
Public Function TryGetSettingType (
	key As String,
	<OutAttribute> ByRef type As Type
) As Boolean
Parameters
key
Type: System.String
 Key name for which to search.
type
Type: System.Type
 Type of the last value passed to Set... or Get... for the specified setting.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetSettingType(System.String,System.Type@)"]
See Also
Reference
PersistentSettings Class
Rhino Namespace