RhinoCommon API
ZBufferCapture.ShowLights Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowLights(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public void ShowLights(
	bool on
)
Public Sub ShowLights (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowLights(System.Boolean)"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace