RhinoCommon API
ViewCaptureSettings Constructor (RhinoPageView, Double)
Constructor
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ViewCaptureSettings(
	RhinoPageView sourcePageView,
	double dpi
)
Public Sub New (
	sourcePageView As RhinoPageView,
	dpi As Double
)
Parameters
sourcePageView
Type: Rhino.Display.RhinoPageView
The Rhino page view to capture or print.
dpi
Type: System.Double
Capture "density" in dots per inch.
See Also
Reference
ViewCaptureSettings Class
ViewCaptureSettings Overload
Rhino.Display Namespace