RhinoCommon API
RealtimeDisplayMode.HudShowControls Method
 Show control buttons on the realtime display HUD. By default these are shown, override this function and return false if HUD controls aren't needed.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool HudShowControls()
Public Overridable Function HudShowControls As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudShowControls"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace