RhinoCommon API
TransformObjectList.Finalize Method
[Missing <summary> documentation for "M:Rhino.Collections.TransformObjectList.Finalize"]
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace