RhinoCommon API
OpenGLSettings.GetDefaultState Method
 Gets the OpenGL factory settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public static OpenGLSettingsState GetDefaultState()
Public Shared Function GetDefaultState As OpenGLSettingsState
Return Value
Type: OpenGLSettingsState
A new OpenGL state with factory settings.
See Also
Reference
OpenGLSettings Class
Rhino.ApplicationSettings Namespace