RhinoCommon API
SubDEdgeSharpness.GetHashCode Method
 Gets a hash code for this sharpness.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgeSharpness.GetHashCode"]
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace