RhinoCommon API
Intersection.BrepSurface Method (Brep, Surface, Double, Boolean, Curve[], Point3d[])
 Intersects a Brep and a Surface.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public static bool BrepSurface(
	Brep brep,
	Surface surface,
	double tolerance,
	bool joinCurves,
	out Curve[] intersectionCurves,
	out Point3d[] intersectionPoints
)
Public Shared Function BrepSurface (
	brep As Brep,
	surface As Surface,
	tolerance As Double,
	joinCurves As Boolean,
	<OutAttribute> ByRef intersectionCurves As Curve(),
	<OutAttribute> ByRef intersectionPoints As Point3d()
) As Boolean
Parameters
brep
Type: Rhino.Geometry.Brep
A brep to be intersected.
surface
Type: Rhino.Geometry.Surface
A surface to be intersected.
tolerance
Type: System.Double
A tolerance value.
joinCurves
Type: System.Boolean
If true, join the resulting curves where possible.
intersectionCurves
Type: Rhino.Geometry.Curve[]
The intersection curves array argument. This out reference is assigned during the call.
intersectionPoints
Type: Rhino.Geometry.Point3d[]
The intersection points array argument. This out reference is assigned during the call.
Return Value
Type: Boolean
 true if the operation was success, false otherwise. Check the output arrays to determine how the input intersects.
See Also
Reference
Intersection Class
BrepSurface Overload
Rhino.Geometry.Intersect Namespace