RhinoCommon API
ICollapsibleSectionHolder.ExpandSection Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.ExpandSection(Rhino.UI.Controls.ICollapsibleSection,System.Boolean,System.Boolean)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void ExpandSection(
	ICollapsibleSection section,
	bool expand,
	bool ensureVisible
)
Sub ExpandSection (
	section As ICollapsibleSection,
	expand As Boolean,
	ensureVisible As Boolean
)
Parameters
section
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="section"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.ExpandSection(Rhino.UI.Controls.ICollapsibleSection,System.Boolean,System.Boolean)"]
expand
Type: System.Boolean
[Missing <param name="expand"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.ExpandSection(Rhino.UI.Controls.ICollapsibleSection,System.Boolean,System.Boolean)"]
ensureVisible
Type: System.Boolean
[Missing <param name="ensureVisible"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.ExpandSection(Rhino.UI.Controls.ICollapsibleSection,System.Boolean,System.Boolean)"]
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace