RhinoCommon API
Vector3d Constructor (Double, Double, Double)
 Initializes a new instance of a vector, using its three components.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d(
	double x,
	double y,
	double z
)
Public Sub New (
	x As Double,
	y As Double,
	z As Double
)
Parameters
x
Type: System.Double
The X (first) component.
y
Type: System.Double
The Y (second) component.
z
Type: System.Double
The Z (third) component.
See Also
Reference
Vector3d Structure
Vector3d Overload
Rhino.Geometry Namespace