RhinoCommon API
FileVdaWriteOptions Constructor
Initializes a new instance of the FileVdaWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileVdaWriteOptions()
Public Sub New
See Also
Reference
FileVdaWriteOptions Class
Rhino.FileIO Namespace