RhinoCommon API
Vector2f.Add Method (Vector2f, Vector2f)
 Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static Vector2f Add(
	Vector2f vector1,
	Vector2f vector2
)
Public Shared Function Add (
	vector1 As Vector2f,
	vector2 As Vector2f
) As Vector2f
Parameters
vector1
Type: Rhino.Geometry.Vector2f
A vector.
vector2
Type: Rhino.Geometry.Vector2f
A second vector.
Return Value
Type: Vector2f
A new vector that results from the component-wise addition of the two vectors.
See Also
Reference
Vector2f Structure
Add Overload
Rhino.Geometry Namespace