RhinoCommon API
MeshFace.Flip Method
 Reverses the orientation of the face by swapping corners. The first corner is always maintained.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public MeshFace Flip()
Public Function Flip As MeshFace
Return Value
Type: MeshFace
[Missing <returns> documentation for "M:Rhino.Geometry.MeshFace.Flip"]
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace