RhinoCommon API
RenderTexture.GetInternalEnvironmentMappingMode Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetInternalEnvironmentMappingMode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public TextureEnvironmentMappingMode GetInternalEnvironmentMappingMode()
Public Function GetInternalEnvironmentMappingMode As TextureEnvironmentMappingMode
Return Value
Type: TextureEnvironmentMappingMode
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetInternalEnvironmentMappingMode"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace