RhinoCommon API
DisplayConduit.OnEnable Method
 Called when the enabled state changes for this class instance
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
protected virtual void OnEnable(
	bool enable
)
Protected Overridable Sub OnEnable (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
[Missing <param name="enable"/> documentation for "M:Rhino.Display.DisplayConduit.OnEnable(System.Boolean)"]
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace