RhinoCommon API
RhinoMath.CRC32 Method (UInt32, Int32)
 Advances the cyclic redundancy check value remainder given a Int32. http://en.wikipedia.org/wiki/Cyclic_redundancy_check.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static uint CRC32(
	uint currentRemainder,
	int value
)
Public Shared Function CRC32 (
	currentRemainder As UInteger,
	value As Integer
) As UInteger
Parameters
currentRemainder
Type: System.UInt32
The remainder from which to start.
value
Type: System.Int32
The value to add to the current remainder.
Return Value
Type: UInt32
The new current remainder.
See Also
Reference
RhinoMath Class
CRC32 Overload
Rhino Namespace