RhinoCommon API
MeshBooleanOptions Constructor
Initializes a new instance of the MeshBooleanOptions class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshBooleanOptions()
Public Sub New
See Also
Reference
MeshBooleanOptions Class
Rhino.Geometry Namespace