RhinoCommon API
LightManagerSupport Constructor
 Default constructor
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected LightManagerSupport()
Protected Sub New
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace