RhinoCommon API
RenderWindow.GetAdjust Method
Note: This API is now obsolete.
 OBSOLETE. NOT IMPLEMENTED.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("The Render Window UI now uses post effects for gamma, tone mapping, etc.")]
public RenderWindow.ImageAdjust GetAdjust()
<ObsoleteAttribute("The Render Window UI now uses post effects for gamma, tone mapping, etc.")>
Public Function GetAdjust As RenderWindow.ImageAdjust
Return Value
Type: RenderWindow.ImageAdjust
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.GetAdjust"]
See Also
Reference
RenderWindow Class
Rhino.Render Namespace