RhinoCommon API
RenderContent.OnAddUserInterfaceSections Method
 Override to provide UI sections to display in the editor.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnAddUserInterfaceSections()
Protected Overridable Sub OnAddUserInterfaceSections
See Also
Reference
RenderContent Class
Rhino.Render Namespace