RhinoCommon API
FileCsvDocument.Set Method (Int32, Int32, Guid)
 Sets the value of a cell to a globally unique identifier, formatted with hyphens and no braces (the "D" format, for example "11f820ff-952a-4b0b-b10a-59f82c2eb1f4").
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Set(
	int column,
	int row,
	Guid value
)
Public Sub Set (
	column As Integer,
	row As Integer,
	value As Guid
)
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.Guid
The value to store.
See Also
Reference
FileCsvDocument Class
Set Overload
Rhino.FileIO Namespace