RhinoCommon API
BrepFace.AdjacentEdges Method
 Gets the indices of all the BrepEdges that delineate this Face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int[] AdjacentEdges()
Public Function AdjacentEdges As Integer()
Return Value
Type: Int32[]
[Missing <returns> documentation for "M:Rhino.Geometry.BrepFace.AdjacentEdges"]
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace