RhinoCommon API
NurbsSurfacePointList.SetPoint Method (Int32, Int32, Double, Double, Double, Double)
 Sets a homogeneous control point at the given (u, v) index, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SetPoint(
	int u,
	int v,
	double x,
	double y,
	double z,
	double weight
)
Public Function SetPoint (
	u As Integer,
	v As Integer,
	x As Double,
	y As Double,
	z As Double,
	weight As Double
) As Boolean
Parameters
u
Type: System.Int32
Index of control point in the surface U direction.
v
Type: System.Int32
Index of control point in the surface V direction.
x
Type: System.Double
X coordinate of control point.
y
Type: System.Double
Y coordinate of control point.
z
Type: System.Double
Z coordinate of control point.
weight
Type: System.Double
Weight of control point.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
 For expert use only. If you do not understand homogeneous coordinates, then use an override that accepts world 3-D, or Euclidean, coordinates as input.
See Also
Reference
NurbsSurfacePointList Class
SetPoint Overload
Rhino.Geometry.Collections Namespace