RhinoCommon API
ObjectTable.AddText Method (TextEntity, ObjectAttributes)
 Adds a text object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddText(
	TextEntity text,
	ObjectAttributes attributes
)
Public Function AddText (
	text As TextEntity,
	attributes As ObjectAttributes
) As Guid
Parameters
text
Type: Rhino.Geometry.TextEntity
Text object to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Geometry.TextEntity,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Guid
The Id of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddText Overload
Rhino.DocObjects.Tables Namespace