RhinoCommon API
Text3d Constructor (String, Plane, Double)
 Constructs a new instance of Text3d.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Text3d(
	string text,
	Plane plane,
	double height
)
Public Sub New (
	text As String,
	plane As Plane,
	height As Double
)
Parameters
text
Type: System.String
Text string.
plane
Type: Rhino.Geometry.Plane
3D Plane for text.
height
Type: System.Double
Height (in units) for text.
See Also
Reference
Text3d Class
Text3d Overload
Rhino.Display Namespace