RhinoCommon API
Brep.GetRegions Method
 Gets an array containing all regions in this brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BrepRegion[] GetRegions()
Public Function GetRegions As BrepRegion()
Return Value
Type: BrepRegion[]
An array of regions in this brep. This array can be empty, but not null.
See Also
Reference
Brep Class
Rhino.Geometry Namespace