RhinoCommon API
SoftTransformSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static SoftTransformSettingsState GetCurrentState()
Public Shared Function GetCurrentState As SoftTransformSettingsState
Return Value
Type: SoftTransformSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.SoftTransformSettings.GetCurrentState"]
See Also
Reference
SoftTransformSettings Class
Rhino.ApplicationSettings Namespace