RhinoCommon API
AppearanceSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static AppearanceSettingsState GetCurrentState()
Public Shared Function GetCurrentState As AppearanceSettingsState
Return Value
Type: AppearanceSettingsState
An instance of a class that represents all the settings as they appear in the Rhino _Options dialog, joined in a single class.
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace