RhinoCommon API
FileWriteOptions Constructor
Initializes a new instance of the FileWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public FileWriteOptions()
Public Sub New
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace