RhinoCommon API
ObjectTable.AddLinearDimension Method (LinearDimension, ObjectAttributes, HistoryRecord, Boolean)
 Adds a linear dimension object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddLinearDimension(
	LinearDimension dimension,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddLinearDimension (
	dimension As LinearDimension,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
dimension
Type: Rhino.Geometry.LinearDimension
Dimension object to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to dimension.
history
Type: Rhino.DocObjects.HistoryRecord
Object history to save.
reference
Type: System.Boolean
If reference, then object will not be saved into the 3dm file.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddLinearDimension Overload
Rhino.DocObjects.Tables Namespace