RhinoCommon API
Curve.RibbonOffset Method (Double, Double, Point3d, Vector3d, Double, Double[], Double[])
 Offsets a closed curve in the following way: pProject the curve to a plane with given normal. Then, loose Offset the projection by distance + blend_radius and trim off self-intersection. THen, Offset the remaining curve back in the opposite direction by blend_radius, filling gaps with blends. Finally, use the elevations of the input curve to get the correct elevations of the result.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Curve RibbonOffset(
	double distance,
	double blendRadius,
	Point3d directionPoint,
	Vector3d normal,
	double tolerance,
	out double[] outputParameters,
	out double[] curveParameters
)
Public Function RibbonOffset (
	distance As Double,
	blendRadius As Double,
	directionPoint As Point3d,
	normal As Vector3d,
	tolerance As Double,
	<OutAttribute> ByRef outputParameters As Double(),
	<OutAttribute> ByRef curveParameters As Double()
) As Curve
Parameters
distance
Type: System.Double
The positive distance to offset the curve.
blendRadius
Type: System.Double
 Positive, typically the same as distance. When the offset results in a self-intersection that gets trimmed off at a kink, the kink will be blended out using this radius.
directionPoint
Type: Rhino.Geometry.Point3d
 A point that indicates the direction of the offset. If the offset is inward, the point's projection to the plane should be well within the curve. It will be used to decide which part of the offset to keep if there are self-intersections.
normal
Type: Rhino.Geometry.Vector3d
A vector that indicates the normal of the plane in which the offset will occur.
tolerance
Type: System.Double
Used to determine self-intersections, not offset error.
outputParameters
Type: System.Double[]
A list of parameter, paired with curveParameters, from the output curve for creating cross sections.
curveParameters
Type: System.Double[]
A list of parameter, paired with outputParameters, from the input curve for creating cross sections.
Return Value
Type: Curve
The offset curve if successful.
See Also
Reference
Curve Class
RibbonOffset Overload
Rhino.Geometry Namespace