RhinoCommon API
PreviewAppearance.RotationY Method
 RotationY
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double RotationY()
Public Function RotationY As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.RotationY"]
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace