RhinoCommon API
UserInterfaceGrid.SetPadding Method (Double, Double, Double, Double)
[Missing <summary> documentation for "M:Rhino.UI.UserInterfaceGrid.SetPadding(System.Double,System.Double,System.Double,System.Double)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetPadding(
	double left,
	double top,
	double right,
	double bottom
)
Public Sub SetPadding (
	left As Double,
	top As Double,
	right As Double,
	bottom As Double
)
Parameters
left
Type: System.Double
[Missing <param name="left"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetPadding(System.Double,System.Double,System.Double,System.Double)"]
top
Type: System.Double
[Missing <param name="top"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetPadding(System.Double,System.Double,System.Double,System.Double)"]
right
Type: System.Double
[Missing <param name="right"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetPadding(System.Double,System.Double,System.Double,System.Double)"]
bottom
Type: System.Double
[Missing <param name="bottom"/> documentation for "M:Rhino.UI.UserInterfaceGrid.SetPadding(System.Double,System.Double,System.Double,System.Double)"]
See Also
Reference
UserInterfaceGrid Class
SetPadding Overload
Rhino.UI Namespace