RhinoCommon API
Transform2d.Rotation Method (Vector2d, Vector2d, Point2d)
 Constructs the rotation that maps one direction onto another while fixing a rotation center.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d Rotation(
	Vector2d startDirection,
	Vector2d endDirection,
	Point2d rotationCenter
)
Public Shared Function Rotation (
	startDirection As Vector2d,
	endDirection As Vector2d,
	rotationCenter As Point2d
) As Transform2d
Parameters
startDirection
Type: Rhino.Geometry.Vector2d
A nonzero direction. Its length is ignored.
endDirection
Type: Rhino.Geometry.Vector2d
A nonzero direction. Its length is ignored.
rotationCenter
Type: Rhino.Geometry.Point2d
The fixed point of the rotation.
Return Value
Type: Transform2d
A rotation transformation, or Transform2d.Nan if either direction is zero.
See Also
Reference
Transform2d Structure
Rotation Overload
Rhino.Geometry Namespace