RhinoCommon API
ProxyObject.GetMeshes Method
 Get existing meshes used to render and analyze surface and polysurface objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Since: 5.0
Syntax
public override Mesh[] GetMeshes(
	MeshType meshType
)
Public Overrides Function GetMeshes (
	meshType As MeshType
) As Mesh()
Parameters
meshType
Type: Rhino.Geometry.MeshType
[Missing <param name="meshType"/> documentation for "M:Rhino.DocObjects.ProxyObject.GetMeshes(Rhino.Geometry.MeshType)"]
Return Value
Type: Mesh[]
An array of meshes.
See Also
Reference
ProxyObject Class
Rhino.DocObjects Namespace