RhinoCommon API
GetBaseClass.AddOptionEnumList<T> Method (LocalizeStringPair, T, T[])
 Adds a choice of enumerated values as list option. Allows to include only some enumerated values.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.37
Syntax
public int AddOptionEnumList<T>(
	LocalizeStringPair optionName,
	T defaultValue,
	T[] include
)
where T : struct, new(), IConvertible
Public Function AddOptionEnumList(Of T As {Structure, New, IConvertible}) (
	optionName As LocalizeStringPair,
	defaultValue As T,
	include As T()
) As Integer
Parameters
optionName
Type: Rhino.UI.LocalizeStringPair
The name of the option
defaultValue
Type: T
The default value
include
Type: T[]
An array of enumerated values to use. This argument can also be null; in this case, the whole enumerated is used.
Type Parameters
T
The enumerated type
Return Value
Type: Int32
Option index
Exceptions
Exception | Condition
ArgumentException | Gets thrown if defaultValue provided is not an enumerated type.
See Also
Reference
GetBaseClass Class
AddOptionEnumList Overload
Rhino.Input.Custom Namespace