RhinoCommon API
RhinoDocObserverArgs Constructor
Initializes a new instance of the RhinoDocObserverArgs class
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoDocObserverArgs(
	RhinoDoc doc
)
Public Sub New (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.RhinoDocObserverArgs.#ctor(Rhino.RhinoDoc)"]
See Also
Reference
RhinoDocObserverArgs Class
Rhino Namespace