RhinoCommon API
GeneralSettings.GetCurrentState Method
 Gets the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static GeneralSettingsState GetCurrentState()
Public Shared Function GetCurrentState As GeneralSettingsState
Return Value
Type: GeneralSettingsState
A new general state with current settings.
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace