RhinoCommon API
LayerTable.UndoModify Method (Guid, UInt32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool UndoModify(
	Guid layerId,
	uint undoRecordSerialNumber
)
Public Function UndoModify (
	layerId As Guid,
	undoRecordSerialNumber As UInteger
) As Boolean
Parameters
layerId
Type: System.Guid
The layer Id to be used.
undoRecordSerialNumber
Type: System.UInt32
The undo record serial number. Pass 0 not to specify one.
Return Value
Type: Boolean
true if this layer had been modified and the modifications were undone.
See Also
Reference
LayerTable Class
UndoModify Overload
Rhino.DocObjects.Tables Namespace