RhinoCommon API
ChangeQueue.MaterialFromOriginalInstanceId Method
 Get the RenderMaterial from the ChangeQueue material cache from the original instance id
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public RenderMaterial MaterialFromOriginalInstanceId(
	Guid id
)
Public Function MaterialFromOriginalInstanceId (
	id As Guid
) As RenderMaterial
Parameters
id
Type: System.Guid
The original instance id
Return Value
Type: RenderMaterial
RenderMaterial
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace