RhinoCommon API
NurbsCurve.CreateSubDFriendly Method (IEnumerable<Point3d>, Boolean, Boolean)
 Create a NURBS curve, that is suitable for calculations like lofting SubD objects, through a sequence of curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static NurbsCurve CreateSubDFriendly(
	IEnumerable<Point3d> points,
	bool interpolatePoints,
	bool periodicClosedCurve
)
Public Shared Function CreateSubDFriendly (
	points As IEnumerable(Of Point3d),
	interpolatePoints As Boolean,
	periodicClosedCurve As Boolean
) As NurbsCurve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
 An enumeration of points. Adjacent points must not be equal. If periodicClosedCurve is false, there must be at least two points. If periodicClosedCurve is true, there must be at least three points and it is not necessary to duplicate the first and last points. When periodicClosedCurve is true and the first and last points are equal, the duplicate last point is automatically ignored.
interpolatePoints
Type: System.Boolean
 True if the curve should interpolate the points. False if points specify control point locations. In either case, the curve will begin at the first point and end at the last point.
periodicClosedCurve
Type: System.Boolean
 True to create a periodic closed curve. Do not duplicate the start/end point in the point input.
Return Value
Type: NurbsCurve
A SubD friendly NURBS curve is successful, null otherwise.
See Also
Reference
NurbsCurve Class
CreateSubDFriendly Overload
Rhino.Geometry Namespace