RhinoCommon API
PlugIn.LoadPlugIn Method (String, Guid)
 Attempt to load a plug-in at a path. Loaded plug-ins are remembered by Rhino between sessions, so this function can also be considered a plug-in installation routine
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static LoadPlugInResult LoadPlugIn(
	string path,
	out Guid plugInId
)
Public Shared Function LoadPlugIn (
	path As String,
	<OutAttribute> ByRef plugInId As Guid
) As LoadPlugInResult
Parameters
path
Type: System.String
full path to plug-in to attempt to load
plugInId
Type: System.Guid
 If successful (or the plug-in is already loaded), the unique id for the plug-in is returned here. Guid.Empty on failure
Return Value
Type: LoadPlugInResult
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.LoadPlugIn(System.String,System.Guid@)"]
See Also
Reference
PlugIn Class
LoadPlugIn Overload
Rhino.PlugIns Namespace