RhinoCommon API
CustomObjectGrips.NurbsCurve Method
 If the grips control a NURBS curve, this returns a pointer to that curve. You can look at but you must NEVER change this curve. Return a curve held in a field, never a temporary: Rhino keeps the underlying pointer after this call returns.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual NurbsCurve NurbsCurve()
Protected Overridable Function NurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
A pointer to a NURBS curve or null.
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace