RhinoCommon API
RenderChannels.Dispose Method
Releases all resources used by the RenderChannels
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RenderChannels Class
Rhino.Render Namespace