RhinoCommon API
Brep.GetPointInside Method
 Finds a point inside of a solid Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.19
Syntax
public bool GetPointInside(
	double tolerance,
	out Point3d point
)
Public Function GetPointInside (
	tolerance As Double,
	<OutAttribute> ByRef point As Point3d
) As Boolean
Parameters
tolerance
Type: System.Double
 Used for intersecting rays and is not necessarily related to the distance from the brep to the found point. When in doubt, use the document's model absolute tolerance.
point
Type: Rhino.Geometry.Point3d
A point inside the solid Brep.
Return Value
Type: Boolean
 Returns false if the input is not solid and manifold, if the Brep's bounding box is less than 2.0 * tolerance wide, or if no point could be found due to ray shooting or other errors. Otherwise, true is returned.
See Also
Reference
Brep Class
Rhino.Geometry Namespace