RhinoCommon API
DisplayPipeline.DrawSprite Method (DisplayBitmap, Point2d, Single, Single)
 Draw screen oriented image centered at 2d screen location
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void DrawSprite(
	DisplayBitmap bitmap,
	Point2d screenLocation,
	float width,
	float height
)
Public Sub DrawSprite (
	bitmap As DisplayBitmap,
	screenLocation As Point2d,
	width As Single,
	height As Single
)
Parameters
bitmap
Type: Rhino.Display.DisplayBitmap
[Missing <param name="bitmap"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point2d,System.Single,System.Single)"]
screenLocation
Type: Rhino.Geometry.Point2d
[Missing <param name="screenLocation"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point2d,System.Single,System.Single)"]
width
Type: System.Single
[Missing <param name="width"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point2d,System.Single,System.Single)"]
height
Type: System.Single
[Missing <param name="height"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point2d,System.Single,System.Single)"]
See Also
Reference
DisplayPipeline Class
DrawSprite Overload
Rhino.Display Namespace