RhinoCommon API
DisplayPipeline.DrawPatternedLine Method (Line, Color, Int32, Int32)
 Draws a single line with specified pattern.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawPatternedLine(
	Line line,
	Color color,
	int pattern,
	int thickness
)
Public Sub DrawPatternedLine (
	line As Line,
	color As Color,
	pattern As Integer,
	thickness As Integer
)
Parameters
line
Type: Rhino.Geometry.Line
Line to draw.
color
Type: System.Drawing.Color
Color of line.
pattern
Type: System.Int32
Pattern of the line (like 0x00001111 for dotted line).
thickness
Type: System.Int32
Thickness (in pixels) of lines.
See Also
Reference
DisplayPipeline Class
DrawPatternedLine Overload
Rhino.Display Namespace