RhinoCommon API
File3dmObjectTable.FindByLayer Method (String)
 Finds all File3dmObject that are in a given layer.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public File3dmObject[] FindByLayer(
	string layer
)
Public Function FindByLayer (
	layer As String
) As File3dmObject()
Parameters
layer
Type: System.String
Layer to search.
Return Value
Type: File3dmObject[]
 Array of objects that belong to the specified layer or empty array if no objects could be found.
See Also
Reference
File3dmObjectTable Class
FindByLayer Overload
Rhino.FileIO Namespace