RhinoCommon API
ObjectTable.AddInstanceObject Method (Int32, Transform, ObjectAttributes, HistoryRecord, Boolean)
 Adds an instance object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.24
Syntax
public Guid AddInstanceObject(
	int instanceDefinitionIndex,
	Transform instanceXform,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddInstanceObject (
	instanceDefinitionIndex As Integer,
	instanceXform As Transform,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
instanceDefinitionIndex
Type: System.Int32
The index of the instance definition.
instanceXform
Type: Rhino.Geometry.Transform
The instance transformation.
attributes
Type: Rhino.DocObjects.ObjectAttributes
The attributes to apply to the instance object.
history
Type: Rhino.DocObjects.HistoryRecord
The history record associated with this instance object.
reference
Type: System.Boolean
true if the object is from a reference file. Reference objects do not persist in archives.
Return Value
Type: Guid
A unique identifier for the object if successful. Guid.Empty it not successful.
See Also
Reference
ObjectTable Class
AddInstanceObject Overload
Rhino.DocObjects.Tables Namespace