RhinoCommon API
RhinoDoc.FindFile Method
 Search for a file using Rhino's search path. Rhino will look in the following places: 1. Current model folder 2. Path specified in options dialog/File tab 3. Rhino system folders 4. Rhino executable folder
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string FindFile(
	string filename
)
Public Function FindFile (
	filename As String
) As String
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.RhinoDoc.FindFile(System.String)"]
Return Value
Type: String
 Path to existing file if found, an empty string if no file was found
See Also
Reference
RhinoDoc Class
Rhino Namespace