RhinoCommon API
Skin.OpenNewDocument Method
 Creates a new RhinoDoc from the given template (or a blank document when the path is null/empty/missing) and brings up its document window. Must be called on the main UI thread.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
protected static RhinoDoc OpenNewDocument(
	string templatePath
)
Protected Shared Function OpenNewDocument (
	templatePath As String
) As RhinoDoc
Parameters
templatePath
Type: System.String
Path to a template file, or null/empty for a blank document.
Return Value
Type: RhinoDoc
The new RhinoDoc, or null on failure.
See Also
Reference
Skin Class
Rhino.Runtime Namespace