RhinoCommon API
Brep.Repair Method
 Fills in missing or fixes incorrect component information from a Brep. Useful when reading Brep information from other file formats that do not provide as complete of a Brep definition as required by Rhino.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Repair(
	double tolerance
)
Public Function Repair (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
The repair tolerance. When in doubt, use the document's model absolute tolerance.
Return Value
Type: Boolean
True on success.
See Also
Reference
Brep Class
Rhino.Geometry Namespace