RhinoCommon API
Layer.Equality Operator
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.op_Equality(Rhino.DocObjects.Layer,Rhino.DocObjects.Layer)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool operator ==(
	Layer left,
	Layer right
)
Public Shared Operator = (
	left As Layer,
	right As Layer
) As Boolean
Parameters
left
Type: Rhino.DocObjects.Layer
[Missing <param name="left"/> documentation for "M:Rhino.DocObjects.Layer.op_Equality(Rhino.DocObjects.Layer,Rhino.DocObjects.Layer)"]
right
Type: Rhino.DocObjects.Layer
[Missing <param name="right"/> documentation for "M:Rhino.DocObjects.Layer.op_Equality(Rhino.DocObjects.Layer,Rhino.DocObjects.Layer)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.op_Equality(Rhino.DocObjects.Layer,Rhino.DocObjects.Layer)"]
See Also
Reference
Layer Class
Rhino.DocObjects Namespace