RhinoCommon API
ColorRGBA Constructor (Int32)
 Constructs a new instance of ColorRGBA that is equivalent to an ARGB color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public ColorRGBA(
	int argb
)
Public Sub New (
	argb As Integer
)
Parameters
argb
Type: System.Int32
ARGB color to mimic.
See Also
Reference
ColorRGBA Structure
ColorRGBA Overload
Rhino.Display Namespace