RhinoCommon API
Transform.IsRigid Method
 Gets a value indicating whether or not the Transform is rigid. A rigid transformation can be broken into a proper rotation and a translation, while an isometry transformation could also include a reflection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public TransformRigidType IsRigid(
	double tolerance
)
Public Function IsRigid (
	tolerance As Double
) As TransformRigidType
Parameters
tolerance
Type: System.Double
The evaluation tolerance.
Return Value
Type: TransformRigidType
The rigid type.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace