RhinoCommon API
BezierSurface.GetBoundingBox Method
 Bounding box solver. Gets the world axis aligned bounding box for the surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public BoundingBox GetBoundingBox(
	bool accurate
)
Public Function GetBoundingBox (
	accurate As Boolean
) As BoundingBox
Parameters
accurate
Type: System.Boolean
This parameter is currently ignored.
Return Value
Type: BoundingBox
 The bounding box of the geometry in world coordinates or BoundingBox.Empty if not bounding box could be found.
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace