RhinoCommon API
AnnotationBase.FirstCharProperties Method
 Extracts the font properties (bold, italic, underline, and facename) from the first character run of an RTF string.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool FirstCharProperties(
	string rtf_str,
	ref bool bold,
	ref bool italic,
	ref bool underline,
	ref string facename
)
Public Shared Function FirstCharProperties (
	rtf_str As String,
	ByRef bold As Boolean,
	ByRef italic As Boolean,
	ByRef underline As Boolean,
	ByRef facename As String
) As Boolean
Parameters
rtf_str
Type: System.String
The RTF string to analyze.
bold
Type: System.Boolean
Set to true if the first run is bold; otherwise, false.
italic
Type: System.Boolean
Set to true if the first run is italic; otherwise, false.
underline
Type: System.Boolean
Set to true if the first run is underlined; otherwise, false.
facename
Type: System.String
Receives the font face name of the first run.
Return Value
Type: Boolean
True if the properties were successfully extracted; otherwise, false.
Remarks
Obsolete. Use FirstCharFont instead.
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace