RhinoCommon API
PostEffect.GetHashCode Method
 A CRC of the state of this post effect.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
returns a crc of post effect state
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace