RhinoCommon API
FileUdo.Write Method
Write a Moray UDO file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	FileUdoWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As FileUdoWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileUdoWriteOptions
options used for generating the Moray UDO file
Return Value
Type: Boolean
true on success
See Also
Reference
FileUdo Class
Rhino.FileIO Namespace