RhinoCommon API
ViewportInfo.TransformCamera Method
 Transforms the view camera location, direction, and up.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool TransformCamera(
	Transform xform
)
Public Function TransformCamera (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to apply to camera.
Return Value
Type: Boolean
True if a valid camera was transformed, false if invalid camera, frustum, or transformation.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace