RhinoCommon API
ColorRGBA Implicit Conversion (Color to ColorRGBA)
[Missing <summary> documentation for "M:Rhino.Display.ColorRGBA.op_Implicit(System.Drawing.Color)~Rhino.Display.ColorRGBA"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static implicit operator ColorRGBA (
	Color value
)
Public Shared Widening Operator CType (
	value As Color
) As ColorRGBA
Parameters
value
Type: System.Drawing.Color
[Missing <param name="value"/> documentation for "M:Rhino.Display.ColorRGBA.op_Implicit(System.Drawing.Color)~Rhino.Display.ColorRGBA"]
Return Value
Type: ColorRGBA
[Missing <returns> documentation for "M:Rhino.Display.ColorRGBA.op_Implicit(System.Drawing.Color)~Rhino.Display.ColorRGBA"]
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace