RhinoCommon API
SimulatedEnvironment.Dispose Method (Boolean)
Releases the unmanaged resources used by the SimulatedEnvironment and optionally releases the managed resources
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
SimulatedEnvironment Class
Dispose Overload
Rhino.Render Namespace