RhinoCommon API
Notification Constructor (IEnumerable<Assembly>)
 Creates a new instance that can be edited by the given assemblies.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Notification(
	IEnumerable<Assembly> allowedAssemblies
)
Public Sub New (
	allowedAssemblies As IEnumerable(Of Assembly)
)
Parameters
allowedAssemblies
Type: System.Collections.Generic.IEnumerable<Assembly>
The assemblies that will be allowed to edit the instance. If null or empty, any assembly will be able to edit this notification.
Remarks
Specifying one or more assemblies limits certain operations with the notification object, throwing an InvalidOperationException if an assembly outside the ones passed tries to interact with it. Any code that tries to interact with a notification object that has restricted assemblies must be wrapped in a ExecuteAssemblyProtectedCode(Action). For performance reasons, it is imporant that such methods are kept as simple as possible.
See Also
Reference
Notification Class
Notification Overload
Rhino.Runtime.Notifications Namespace