RhinoCommon API
DrawingUtilities.PixelsFromSvg Method (String, Int32, Int32, Boolean, Color)
 Get array of bytes that represent RGBA values for an image of a given size created from SVG
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static byte[] PixelsFromSvg(
	string svg,
	int width,
	int height,
	bool premultiplyAlpha,
	Color backgroundColor
)
Public Shared Function PixelsFromSvg (
	svg As String,
	width As Integer,
	height As Integer,
	premultiplyAlpha As Boolean,
	backgroundColor As Color
) As Byte()
Parameters
svg
Type: System.String
A valid svg string
width
Type: System.Int32
Width of the svg in pixels
height
Type: System.Int32
Height of the svg in pixels
premultiplyAlpha
Type: System.Boolean
Pre-lends the background color with the pixels based on their alpha value
backgroundColor
Type: System.Drawing.Color
Background color - pass Color.Empty if you don't know what to pass.
Return Value
Type: Byte[]
Null on an exception, an array of Color as bytes otherwise
See Also
Reference
DrawingUtilities Class
PixelsFromSvg Overload
Rhino.UI Namespace