RhinoCommon API
NamedPositionTable.ObjectIds Method (Guid)
Array of Rhino Object Guids related to a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid[] ObjectIds(
	Guid id
)
Public Function ObjectIds (
	id As Guid
) As Guid()
Parameters
id
Type: System.Guid
 The Guid of the named position from which you want to retrieve the objects.
Return Value
Type: Guid[]
 Array of Guid which pertain to the objects tracked by the Named Position.
See Also
Reference
NamedPositionTable Class
ObjectIds Overload
Rhino.DocObjects.Tables Namespace