RhinoCommon API
DisplayPipelineAttributes.SetSurfaceIsoApplyPattern Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipelineAttributes.SetSurfaceIsoApplyPattern(System.Boolean,System.Boolean,System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public void SetSurfaceIsoApplyPattern(
	bool u,
	bool v,
	bool w
)
Public Sub SetSurfaceIsoApplyPattern (
	u As Boolean,
	v As Boolean,
	w As Boolean
)
Parameters
u
Type: System.Boolean
[Missing <param name="u"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.SetSurfaceIsoApplyPattern(System.Boolean,System.Boolean,System.Boolean)"]
v
Type: System.Boolean
[Missing <param name="v"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.SetSurfaceIsoApplyPattern(System.Boolean,System.Boolean,System.Boolean)"]
w
Type: System.Boolean
[Missing <param name="w"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.SetSurfaceIsoApplyPattern(System.Boolean,System.Boolean,System.Boolean)"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace