RhinoCommon API
IZooClientUtilities.ConvertLicense Method
 Converts a standalone license to a network license.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool ConvertLicense(
	Object verify,
	Guid productId
)
Function ConvertLicense (
	verify As Object,
	productId As Guid
) As Boolean
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.ConvertLicense(System.Object,System.Guid)"]
productId
Type: System.Guid
[Missing <param name="productId"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.ConvertLicense(System.Object,System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.ConvertLicense(System.Object,System.Guid)"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace