RhinoCommon API
Layer.GetLeafName Method (String)
 Get a layer name's "leaf" level name
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string GetLeafName(
	string fullPath
)
Public Shared Function GetLeafName (
	fullPath As String
) As String
Parameters
fullPath
Type: System.String
[Missing <param name="fullPath"/> documentation for "M:Rhino.DocObjects.Layer.GetLeafName(System.String)"]
Return Value
Type: String
 leaf name or String.Empty if fullPath does not contain a leaf
See Also
Reference
Layer Class
GetLeafName Overload
Rhino.DocObjects Namespace