RhinoCommon API
RhinoApp.CommandLineTextWriter.Write Method (String)
 Writes a string to the command line.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override void Write(
	string value
)
Public Overrides Sub Write (
	value As String
)
Parameters
value
Type: System.String
[Missing <param name="value"/> documentation for "M:Rhino.RhinoApp.CommandLineTextWriter.Write(System.String)"]
See Also
Reference
RhinoApp.CommandLineTextWriter Class
Write Overload
Rhino Namespace