RhinoCommon API
RenderContentCollection.ContentNeedsPreviewThumbnail Method
 To be documented
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool ContentNeedsPreviewThumbnail(
	RenderContent c,
	bool includeChildren
)
Public Function ContentNeedsPreviewThumbnail (
	c As RenderContent,
	includeChildren As Boolean
) As Boolean
Parameters
c
Type: Rhino.Render.RenderContent
[Missing <param name="c"/> documentation for "M:Rhino.Render.RenderContentCollection.ContentNeedsPreviewThumbnail(Rhino.Render.RenderContent,System.Boolean)"]
includeChildren
Type: System.Boolean
[Missing <param name="includeChildren"/> documentation for "M:Rhino.Render.RenderContentCollection.ContentNeedsPreviewThumbnail(Rhino.Render.RenderContent,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContentCollection.ContentNeedsPreviewThumbnail(Rhino.Render.RenderContent,System.Boolean)"]
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace