RhinoCommon API
Brep.CreateTrimmedSurface Method (BrepFace, Surface, Double)
 Constructs a Brep using the trimming information of a brep face and a surface. Surface must be roughly the same shape and in the same location as the trimming brep face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep CreateTrimmedSurface(
	BrepFace trimSource,
	Surface surfaceSource,
	double tolerance
)
Public Shared Function CreateTrimmedSurface (
	trimSource As BrepFace,
	surfaceSource As Surface,
	tolerance As Double
) As Brep
Parameters
trimSource
Type: Rhino.Geometry.BrepFace
BrepFace which contains trimmingSource brep.
surfaceSource
Type: Rhino.Geometry.Surface
Surface that trims of BrepFace will be applied to.
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.Brep.CreateTrimmedSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Surface,System.Double)"]
Return Value
Type: Brep
A brep with the shape of surfaceSource and the trims of trimSource or null on failure.
See Also
Reference
Brep Class
CreateTrimmedSurface Overload
Rhino.Geometry Namespace