RhinoCommon API
MeshInstance.AncestryRecord.Dispose Method
 Dispose
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
MeshInstance.AncestryRecord Class
Dispose Overload
Rhino.Render.ChangeQueue Namespace