RhinoCommon API
Centermark.Create Method (DimensionStyle, Plane, Curve, Double)
Creates a new center mark dimension.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Centermark Create(
	DimensionStyle dimStyle,
	Plane plane,
	Curve curve,
	double curveParameter
)
Public Shared Function Create (
	dimStyle As DimensionStyle,
	plane As Plane,
	curve As Curve,
	curveParameter As Double
) As Centermark
Parameters
dimStyle
Type: Rhino.DocObjects.DimensionStyle
Dimension's dimension style.
plane
Type: Rhino.Geometry.Plane
Dimension's plane.
curve
Type: Rhino.Geometry.Curve
Curve used to determine the center mark's radius.
curveParameter
Type: System.Double
Parameter on curve used to determine the center mark's radius.
Return Value
Type: Centermark
A new center mark if successful, null otherwise.
Exceptions
Exception | Condition
ArgumentNullException
See Also
Reference
Centermark Class
Create Overload
Rhino.Geometry Namespace