RhinoCommon API
MeshNgon.Create Method
 Constructs an ngon from lists of mesh vertex and face indexes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static MeshNgon Create(
	IList<int> meshVertexIndexList,
	IList<int> meshFaceIndexList
)
Public Shared Function Create (
	meshVertexIndexList As IList(Of Integer),
	meshFaceIndexList As IList(Of Integer)
) As MeshNgon
Parameters
meshVertexIndexList
Type: System.Collections.Generic.IList<Int32>
 A list of mesh vertex indexes that define the outer boundary of the ngon. The mesh vertex indexes must be in the correct order.
meshFaceIndexList
Type: System.Collections.Generic.IList<Int32>
 A list of mesh face indexes that define the interior of the ngon. The mesh face indexes may be in any order.
Return Value
Type: MeshNgon
[Missing <returns> documentation for "M:Rhino.Geometry.MeshNgon.Create(System.Collections.Generic.IList{System.Int32},System.Collections.Generic.IList{System.Int32})"]
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace