RhinoCommon API
Material Constructor (Material)
Initializes a new instance of the Material class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Material(
	Material other
)
Public Sub New (
	other As Material
)
Parameters
other
Type: Rhino.DocObjects.Material
[Missing <param name="other"/> documentation for "M:Rhino.DocObjects.Material.#ctor(Rhino.DocObjects.Material)"]
See Also
Reference
Material Class
Material Overload
Rhino.DocObjects Namespace