RhinoCommon API
RhinoApp.RunningInRdp Method
 Find out if Rhino is running in a remote session
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool RunningInRdp()
Public Shared Function RunningInRdp As Boolean
Return Value
Type: Boolean
true if Rhino is running in a RDP session, false otherwise
See Also
Reference
RhinoApp Class
Rhino Namespace