RhinoCommon API
Curve.Offset Method (Point3d, Vector3d, Double, Double, Double, Boolean, CurveOffsetCornerStyle, CurveOffsetEndStyle)
 Offsets this curve. If you have a nice offset, then there will be one entry in the array. If the original curve had kinks or the offset curve had self intersections, you will get multiple segments in the output array.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Curve[] Offset(
	Point3d directionPoint,
	Vector3d normal,
	double distance,
	double tolerance,
	double angleTolerance,
	bool loose,
	CurveOffsetCornerStyle cornerStyle,
	CurveOffsetEndStyle endStyle
)
Public Function Offset (
	directionPoint As Point3d,
	normal As Vector3d,
	distance As Double,
	tolerance As Double,
	angleTolerance As Double,
	loose As Boolean,
	cornerStyle As CurveOffsetCornerStyle,
	endStyle As CurveOffsetEndStyle
) As Curve()
Parameters
directionPoint
Type: Rhino.Geometry.Point3d
A point that indicates the direction of the offset.
normal
Type: Rhino.Geometry.Vector3d
The normal to the offset plane.
distance
Type: System.Double
The positive or negative distance to offset.
tolerance
Type: System.Double
The offset or fitting tolerance.
angleTolerance
Type: System.Double
The angle tolerance, in radians, used to decide whether to split at kinks.
loose
Type: System.Boolean
If false, offset within tolerance. If true, offset by moving edit points.
cornerStyle
Type: Rhino.Geometry.CurveOffsetCornerStyle
Corner style for offset kinks.
endStyle
Type: Rhino.Geometry.CurveOffsetEndStyle
End style for non-loose, non-closed curve offsets.
Return Value
Type: Curve[]
Offset curves on success, null on failure.
See Also
Reference
Curve Class
Offset Overload
Rhino.Geometry Namespace