RhinoCommon API
TextEntity Constructor (SerializationInfo, StreamingContext)
 Protected constructor used in serialization
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected TextEntity(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
Serialization data
context
Type: System.Runtime.Serialization.StreamingContext
Serialization stream
See Also
Reference
TextEntity Class
TextEntity Overload
Rhino.Geometry Namespace