RhinoCommon API
PlugIn.GetInstalledPlugIns Method (Boolean)
 Get a list of all registered plug-in's regardless of if they are loaded or not.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public static Dictionary<Guid, string> GetInstalledPlugIns(
	bool localizedPlugInName
)
Public Shared Function GetInstalledPlugIns (
	localizedPlugInName As Boolean
) As Dictionary(Of Guid, String)
Parameters
localizedPlugInName
Type: System.Boolean
 If true then the localize plug-in name is returned otherwise; the English name is used.
Return Value
Type: Dictionary<Guid, String>
 Dictionary with plug-in ID as key and plug-in name as value
See Also
Reference
PlugIn Class
GetInstalledPlugIns Overload
Rhino.PlugIns Namespace