RhinoCommon API
SubDEdgeList.Add Method
 Add a new edge to the list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDEdge Add(
	SubDEdgeTag tag,
	SubDVertex v0,
	SubDVertex v1
)
Public Function Add (
	tag As SubDEdgeTag,
	v0 As SubDVertex,
	v1 As SubDVertex
) As SubDEdge
Parameters
tag
Type: Rhino.Geometry.SubDEdgeTag
The type of edge tag, such as smooth or corner.
v0
Type: Rhino.Geometry.SubDVertex
First vertex.
v1
Type: Rhino.Geometry.SubDVertex
Second vertex.
Return Value
Type: SubDEdge
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDEdgeList.Add(Rhino.Geometry.SubDEdgeTag,Rhino.Geometry.SubDVertex,Rhino.Geometry.SubDVertex)"]
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If tag is unset or non-defined.
See Also
Reference
SubDEdgeList Class
Rhino.Geometry.Collections Namespace