RhinoCommon API
PostEffectChannel.GPU Method
 Return an interface to this channel for doing channel operations on the GPU.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RenderWindow.ChannelGPU GPU()
Public Function GPU As RenderWindow.ChannelGPU
Return Value
Type: RenderWindow.ChannelGPU
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectChannel.GPU"]
See Also
Reference
PostEffectChannel Class
Rhino.Render.PostEffects Namespace