RhinoCommon API
Vector2d.Multiply Operator (Vector2d, Vector2d)
 Multiplies two vectors together, returning the dot product (or inner product).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static double operator *(
	Vector2d vector1,
	Vector2d vector2
)
Public Shared Operator * (
	vector1 As Vector2d,
	vector2 As Vector2d
) As Double
Parameters
vector1
Type: Rhino.Geometry.Vector2d
A vector.
vector2
Type: Rhino.Geometry.Vector2d
A second vector.
Return Value
Type: Double
 A value that results from the evaluation of v1.X*v2.X + v1.Y*v2.Y.
This value equals v1.Length * v2.Length * cos(alpha), where alpha is the angle between vectors.
See Also
Reference
Vector2d Structure
Multiply Overload
Rhino.Geometry Namespace