RhinoCommon API
DrawingUtilities.BitmapFromIconResource Method (String, Size, Assembly)
 Load a Icon from an embedded resource and convert it to a bitmap of the specified size. Will look for a icon image that is greater than or equal to the requested size, if all images are less than the requested size the largest image will be used.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Bitmap BitmapFromIconResource(
	string resourceName,
	Size bitmapSize,
	Assembly assembly = null
)
Public Shared Function BitmapFromIconResource (
	resourceName As String,
	bitmapSize As Size,
	Optional assembly As Assembly = Nothing
) As Bitmap
Parameters
resourceName
Type: System.String
[Missing <param name="resourceName"/> documentation for "M:Rhino.UI.DrawingUtilities.BitmapFromIconResource(System.String,System.Drawing.Size,System.Reflection.Assembly)"]
bitmapSize
Type: System.Drawing.Size
 Desired bitmap size
assembly (Optional)
Type: System.Reflection.Assembly
 The assembly containing the manifest resource, will use the calling assembly if null.
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.UI.DrawingUtilities.BitmapFromIconResource(System.String,System.Drawing.Size,System.Reflection.Assembly)"]
See Also
Reference
DrawingUtilities Class
BitmapFromIconResource Overload
Rhino.UI Namespace