RhinoCommon API
UserDataList.Purge Method
 Removes all user data from this geometry.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Purge()
Public Sub Purge
Remarks
User Remove(UserData) to delete a single, known, item.
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace