RhinoCommon API
File3dmDimStyleTable.FindNameHash Method
 Finds a DimensionStyle given its name hash.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle FindNameHash(
	NameHash nameHash
)
Public Function FindNameHash (
	nameHash As NameHash
) As DimensionStyle
Parameters
nameHash
Type: Rhino.FileIO.NameHash
The name hash of the DimensionStyle to be searched.
Return Value
Type: DimensionStyle
An DimensionStyle, or null on error.
See Also
Reference
File3dmDimStyleTable Class
Rhino.FileIO Namespace