RhinoCommon API
Brep.CreateChamferSurface Method (BrepFace, Point2d, Double, BrepFace, Point2d, Double, Boolean, Double)
Note: This API is now obsolete.
 Creates a ruled surface as a bevel between two input surface edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use the CreateFilletSurface that takes settings and returns results")]
public static Brep[] CreateChamferSurface(
	BrepFace face0,
	Point2d uv0,
	double radius0,
	BrepFace face1,
	Point2d uv1,
	double radius1,
	bool extend,
	double tolerance
)
<ObsoleteAttribute("Use the CreateFilletSurface that takes settings and returns results")>
Public Shared Function CreateChamferSurface (
	face0 As BrepFace,
	uv0 As Point2d,
	radius0 As Double,
	face1 As BrepFace,
	uv1 As Point2d,
	radius1 As Double,
	extend As Boolean,
	tolerance As Double
) As Brep()
Parameters
face0
Type: Rhino.Geometry.BrepFace
First face to chamfer from.
uv0
Type: Rhino.Geometry.Point2d
A parameter face0 at the side you want to keep after chamfering.
radius0
Type: System.Double
The distance from the intersection of face0 to the edge of the chamfer.
face1
Type: Rhino.Geometry.BrepFace
Second face to chamfer from.
uv1
Type: Rhino.Geometry.Point2d
A parameter face1 at the side you want to keep after chamfering.
radius1
Type: System.Double
The distance from the intersection of face1 to the edge of the chamfer.
extend
Type: System.Boolean
If true, then when one input surface is longer than the other, the chamfer surface is extended to the input surface edges.
tolerance
Type: System.Double
The tolerance. When in doubt, use the document's model absolute tolerance.
Return Value
Type: Brep[]
Array of Breps if successful.
See Also
Reference
Brep Class
CreateChamferSurface Overload
Rhino.Geometry Namespace