RhinoCommon API
PointCloud.CreateContourCurves Method (Point3d, Point3d, Double, Double, Double, Double, Boolean, Boolean, Boolean, Double)
 Creates a planar curves by intersecting a plane with a point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Curve[] CreateContourCurves(
	Point3d startPoint,
	Point3d endPoint,
	double interval,
	double absoluteTolerance,
	double maxDistance,
	double minDistance,
	bool openCurves,
	bool createSpline,
	bool createPolyline,
	double fitTolerance
)
Public Function CreateContourCurves (
	startPoint As Point3d,
	endPoint As Point3d,
	interval As Double,
	absoluteTolerance As Double,
	maxDistance As Double,
	minDistance As Double,
	openCurves As Boolean,
	createSpline As Boolean,
	createPolyline As Boolean,
	fitTolerance As Double
) As Curve()
Parameters
startPoint
Type: Rhino.Geometry.Point3d
Start point for vector that is normal to contour plane.
endPoint
Type: Rhino.Geometry.Point3d
End point for vector that is normal to contour plane.
interval
Type: System.Double
he interval or distance between contours.
absoluteTolerance
Type: System.Double
The document's model absolute tolerance
maxDistance
Type: System.Double
 Maximum distance to plane. The thickness of the "slab" around the plane from which sample points are taken. Those sample points are projected to the section plane and a polyline is found that connects them. This distance depends on the size of the point cloud and the spacing of the points.
minDistance
Type: System.Double
 Minimum distance between points. A threshold for the minimum spacing between adjacent sample points. If there are points closer than that, some are not used.
openCurves
Type: System.Boolean
True for open, false for closed.
createSpline
Type: System.Boolean
Creates a smooth curve. You can create both a curve and a polyline.
createPolyline
Type: System.Boolean
Creates a polyline. You can create both a curve and a polyline.
fitTolerance
Type: System.Double
The tolerance used to fit the curve through the polyline.
Return Value
Type: Curve[]
The intersection curves if successful, an empty array if unsuccessful.
See Also
Reference
PointCloud Class
CreateContourCurves Overload
Rhino.Geometry Namespace