RhinoCommon API
File3dm.ReadDimensionStyles Method
 Read the dimension styles table out of a 3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static DimensionStyle[] ReadDimensionStyles(
	string path
)
Public Shared Function ReadDimensionStyles (
	path As String
) As DimensionStyle()
Parameters
path
Type: System.String
The location of the file.
Return Value
Type: DimensionStyle[]
 Array of dimension styles on success (empty array if file does not contain dimension styles) null on error
Exceptions
Exception | Condition
FileNotFoundException | If the provided path is null, does not exist or cannot be accessed.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace