RhinoCommon API
PersistentSettings.GetGuid Method (String, Guid)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetGuid(System.String,System.Guid)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid GetGuid(
	string key,
	Guid defaultValue
)
Public Function GetGuid (
	key As String,
	defaultValue As Guid
) As Guid
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetGuid(System.String,System.Guid)"]
defaultValue
Type: System.Guid
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetGuid(System.String,System.Guid)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetGuid(System.String,System.Guid)"]
See Also
Reference
PersistentSettings Class
GetGuid Overload
Rhino Namespace