RhinoCommon API
File3dmShutLining.SetCurveRadius Method
 Sets the radius of the pipe used to create the shut-line for the given curve.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetCurveRadius(
	Guid curve_id,
	double radius
)
Public Sub SetCurveRadius (
	curve_id As Guid,
	radius As Double
)
Parameters
curve_id
Type: System.Guid
[Missing <param name="curve_id"/> documentation for "M:Rhino.FileIO.File3dmShutLining.SetCurveRadius(System.Guid,System.Double)"]
radius
Type: System.Double
[Missing <param name="radius"/> documentation for "M:Rhino.FileIO.File3dmShutLining.SetCurveRadius(System.Guid,System.Double)"]
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace