RhinoCommon API
PageViewGroup.CopyAttributesFrom Method
 Copy attributes from another page view group.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void CopyAttributesFrom(
	PageViewGroup src
)
Public Sub CopyAttributesFrom (
	src As PageViewGroup
)
Parameters
src
Type: Rhino.DocObjects.PageViewGroup
[Missing <param name="src"/> documentation for "M:Rhino.DocObjects.PageViewGroup.CopyAttributesFrom(Rhino.DocObjects.PageViewGroup)"]
See Also
Reference
PageViewGroup Class
Rhino.DocObjects Namespace