RhinoCommon API
Point3d.Division Operator
 Divides a Point3d by a number.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Point3d operator /(
	Point3d point,
	double t
)
Public Shared Operator / (
	point As Point3d,
	t As Double
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
t
Type: System.Double
A number.
Return Value
Type: Point3d
A new point that is coordinate-wise divided by t.
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace