RhinoCommon API
AppearanceSettings.SetPaintColor Method (PaintColor, Color, Boolean)
 Sets the logical paint color association to a specific .Net library color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void SetPaintColor(
	PaintColor whichColor,
	Color c,
	bool forceUiUpdate
)
Public Shared Sub SetPaintColor (
	whichColor As PaintColor,
	c As Color,
	forceUiUpdate As Boolean
)
Parameters
whichColor
Type: Rhino.ApplicationSettings.PaintColor
A logical color association.
c
Type: System.Drawing.Color
A .Net library color.
forceUiUpdate
Type: System.Boolean
true if the UI should be forced to update.
See Also
Reference
AppearanceSettings Class
SetPaintColor Overload
Rhino.ApplicationSettings Namespace