RhinoCommon API
PersistentSettings.SetDefault Method (String, Rectangle)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Drawing.Rectangle)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetDefault(
	string key,
	Rectangle value
)
Public Sub SetDefault (
	key As String,
	value As Rectangle
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Drawing.Rectangle)"]
value
Type: System.Drawing.Rectangle
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Drawing.Rectangle)"]
See Also
Reference
PersistentSettings Class
SetDefault Overload
Rhino Namespace