RhinoCommon API
PersistentSettings.GetSize Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetSize(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Size GetSize(
	string key
)
Public Function GetSize (
	key As String
) As Size
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetSize(System.String)"]
Return Value
Type: Size
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetSize(System.String)"]
See Also
Reference
PersistentSettings Class
GetSize Overload
Rhino Namespace