RhinoCommon API
Mesh.CreateBooleanIntersection Method (IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result)
 Computes the solid intersection of two sets of meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Mesh[] CreateBooleanIntersection(
	IEnumerable<Mesh> firstSet,
	IEnumerable<Mesh> secondSet,
	MeshBooleanOptions options,
	out Result result
)
Public Shared Function CreateBooleanIntersection (
	firstSet As IEnumerable(Of Mesh),
	secondSet As IEnumerable(Of Mesh),
	options As MeshBooleanOptions,
	<OutAttribute> ByRef result As Result
) As Mesh()
Parameters
firstSet
Type: System.Collections.Generic.IEnumerable<Mesh>
First set of Meshes.
secondSet
Type: System.Collections.Generic.IEnumerable<Mesh>
Second set of Meshes.
options
Type: Rhino.Geometry.MeshBooleanOptions
The boolean option instance, or null.
result
Type: Rhino.Commands.Result
A value indicating success, or cancel, or failure, or nothing.
Return Value
Type: Mesh[]
An array of Mesh results or null on failure.
See Also
Reference
Mesh Class
CreateBooleanIntersection Overload
Rhino.Geometry Namespace