RhinoCommon API
IPanelsService.Float Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.Float(System.Guid,System.Drawing.Point)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
bool Float(
	Guid barId,
	Point point
)
Function Float (
	barId As Guid,
	point As Point
) As Boolean
Parameters
barId
Type: System.Guid
[Missing <param name="barId"/> documentation for "M:Rhino.UI.IPanelsService.Float(System.Guid,System.Drawing.Point)"]
point
Type: System.Drawing.Point
[Missing <param name="point"/> documentation for "M:Rhino.UI.IPanelsService.Float(System.Guid,System.Drawing.Point)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.Float(System.Guid,System.Drawing.Point)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace