RhinoCommon API
RealtimeDisplayMode.DrawOpenGl Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.DrawOpenGl"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool DrawOpenGl()
Public Overridable Function DrawOpenGl As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.DrawOpenGl"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace