RhinoCommon API
ChangeQueue.ContentRenderHash Method
 Override this if you need to modify the way render hashes are calcuated in the change queue. This will alter the way materials are grouped.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual uint ContentRenderHash(
	RenderContent content,
	CrcRenderHashFlags flags,
	string excludeParameterNames,
	LinearWorkflow lw
)
Protected Overridable Function ContentRenderHash (
	content As RenderContent,
	flags As CrcRenderHashFlags,
	excludeParameterNames As String,
	lw As LinearWorkflow
) As UInteger
Parameters
content
Type: Rhino.Render.RenderContent
[Missing <param name="content"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ContentRenderHash(Rhino.Render.RenderContent,Rhino.Render.CrcRenderHashFlags,System.String,Rhino.Render.LinearWorkflow)"]
flags
Type: Rhino.Render.CrcRenderHashFlags
[Missing <param name="flags"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ContentRenderHash(Rhino.Render.RenderContent,Rhino.Render.CrcRenderHashFlags,System.String,Rhino.Render.LinearWorkflow)"]
excludeParameterNames
Type: System.String
[Missing <param name="excludeParameterNames"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ContentRenderHash(Rhino.Render.RenderContent,Rhino.Render.CrcRenderHashFlags,System.String,Rhino.Render.LinearWorkflow)"]
lw
Type: Rhino.Render.LinearWorkflow
[Missing <param name="lw"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ContentRenderHash(Rhino.Render.RenderContent,Rhino.Render.CrcRenderHashFlags,System.String,Rhino.Render.LinearWorkflow)"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ContentRenderHash(Rhino.Render.RenderContent,Rhino.Render.CrcRenderHashFlags,System.String,Rhino.Render.LinearWorkflow)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace