RhinoCommon API
ArchivableDictionary.TryGetGuid Method
 Get value as Guid, will only succeed if value was created using Set(string key, Guid value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetGuid(
	string key,
	out Guid value
)
Public Function TryGetGuid (
	key As String,
	<OutAttribute> ByRef value As Guid
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetGuid(System.String,System.Guid@)"]
value
Type: System.Guid
[Missing <param name="value"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetGuid(System.String,System.Guid@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetGuid(System.String,System.Guid@)"]
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace