RhinoCommon API
FieldDictionary.TryGetTag Method
Note: This API is now obsolete.
 Gets object that contains data associate with a field. THIS IS NOW OBSOLETE - if you were using this, please email andy@mcneel.com and let me know why.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
[ObsoleteAttribute]
public bool TryGetTag(
	string key,
	out Object tag
)
<ObsoleteAttribute>
Public Function TryGetTag (
	key As String,
	<OutAttribute> ByRef tag As Object
) As Boolean
Parameters
key
Type: System.String
Key name of the field to get.
tag
Type: System.Object
Data associated with the field.
Return Value
Type: Boolean
 Returns true if the field is found and its tag was retrieved otherwise; returns false.
See Also
Reference
FieldDictionary Class
Rhino.Render.Fields Namespace