RhinoCommon API
Curve.PullToMesh Method (Mesh, Double)
 Makes a polyline approximation of the curve and gets the closest point on the mesh for each point on the curve. Then it "connects the points" so that you have a polyline on the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PolylineCurve PullToMesh(
	Mesh mesh,
	double tolerance
)
Public Function PullToMesh (
	mesh As Mesh,
	tolerance As Double
) As PolylineCurve
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to project onto.
tolerance
Type: System.Double
Input tolerance. When in doubt, the document's model absolute tolerance.
Return Value
Type: PolylineCurve
A curve if success, or null on failure.
See Also
Reference
Curve Class
PullToMesh Overload
Rhino.Geometry Namespace