RhinoCommon API
DisplayPipeline.DrawGradientLines Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Single,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void DrawGradientLines(
	IEnumerable<Line> lines,
	float strokeWidth,
	IEnumerable<ColorStop> stops,
	Point3d point1,
	Point3d point2,
	bool linearGradient,
	float repeat
)
Public Sub DrawGradientLines (
	lines As IEnumerable(Of Line),
	strokeWidth As Single,
	stops As IEnumerable(Of ColorStop),
	point1 As Point3d,
	point2 As Point3d,
	linearGradient As Boolean,
	repeat As Single
)
Parameters
lines
Type: System.Collections.Generic.IEnumerable<Line>
[Missing <param name="lines"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Single,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single)"]
strokeWidth
Type: System.Single
[Missing <param name="strokeWidth"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Single,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single)"]
stops
Type: System.Collections.Generic.IEnumerable<ColorStop>
[Missing <param name="stops"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Single,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single)"]
point1
Type: Rhino.Geometry.Point3d
[Missing <param name="point1"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Single,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single)"]
point2
Type: Rhino.Geometry.Point3d
[Missing <param name="point2"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Single,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single)"]
linearGradient
Type: System.Boolean
[Missing <param name="linearGradient"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Single,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single)"]
repeat
Type: System.Single
[Missing <param name="repeat"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawGradientLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Single,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace