RhinoCommon API
RhinoDoc.GetModelUrl Method
 Gets the link address, or URL, for the model.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void GetModelUrl(
	out string url,
	out string urlDescription
)
Public Sub GetModelUrl (
	<OutAttribute> ByRef url As String,
	<OutAttribute> ByRef urlDescription As String
)
Parameters
url
Type: System.String
The URL.
urlDescription
Type: System.String
The URL description.
See Also
Reference
RhinoDoc Class
Rhino Namespace