RhinoCommon API
File3dmEmbeddedFile.SaveToFile Method
 Saves the contents of the embedded file to a local file. Returns true if successful, else false.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SaveToFile(
	string filename
)
Public Function SaveToFile (
	filename As String
) As Boolean
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.FileIO.File3dmEmbeddedFile.SaveToFile(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmEmbeddedFile.SaveToFile(System.String)"]
See Also
Reference
File3dmEmbeddedFile Class
Rhino.FileIO Namespace