RhinoCommon API
Transform2d Constructor (Transform2d)
 Initializes a new transform matrix from another transform matrix.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Transform2d(
	Transform2d value
)
Public Sub New (
	value As Transform2d
)
Parameters
value
Type: Rhino.Geometry.Transform2d
The transform to copy.
See Also
Reference
Transform2d Structure
Transform2d Overload
Rhino.Geometry Namespace