RhinoCommon API
FileCsvDocument Constructor (Int32)
 Constructs a new, empty document with a fixed number of columns. Every row written to the document has exactly this many fields. The document has no header row.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public FileCsvDocument(
	int columnCount
)
Public Sub New (
	columnCount As Integer
)
Parameters
columnCount
Type: System.Int32
The number of columns. Must be greater than zero.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when columnCount is less than one.
See Also
Reference
FileCsvDocument Class
FileCsvDocument Overload
Rhino.FileIO Namespace