RhinoCommon API
RadialDimension.Get3dPoints Method
 Get locations of dimension's 3d points
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Get3dPoints(
	out Point3d centerpoint,
	out Point3d radiuspoint,
	out Point3d dimlinepoint,
	out Point3d kneepoint
)
Public Function Get3dPoints (
	<OutAttribute> ByRef centerpoint As Point3d,
	<OutAttribute> ByRef radiuspoint As Point3d,
	<OutAttribute> ByRef dimlinepoint As Point3d,
	<OutAttribute> ByRef kneepoint As Point3d
) As Boolean
Parameters
centerpoint
Type: Rhino.Geometry.Point3d
Dimension's center point
radiuspoint
Type: Rhino.Geometry.Point3d
Point on dimension's radius
dimlinepoint
Type: Rhino.Geometry.Point3d
Point on dimension line
kneepoint
Type: Rhino.Geometry.Point3d
Point where dimension line jogs
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.RadialDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)"]
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace