RhinoCommon API
VolumeMassProperties.Compute Method (Mesh)
 Compute the VolumeMassProperties for a single Mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static VolumeMassProperties Compute(
	Mesh mesh
)
Public Shared Function Compute (
	mesh As Mesh
) As VolumeMassProperties
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to measure.
Return Value
Type: VolumeMassProperties
The VolumeMassProperties for the given Mesh or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When mesh is null.
See Also
Reference
VolumeMassProperties Class
Compute Overload
Rhino.Geometry Namespace