RhinoCommon API
SurfaceFilletBase.NonRationalCubic Method
 make fillet surfaces and hack them up to active pieces. Adjusts cross sections
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool NonRationalCubic(
	int railDegree,
	double TanSlider,
	bool bExtend,
	List<Brep> Fillets
)
Public Function NonRationalCubic (
	railDegree As Integer,
	TanSlider As Double,
	bExtend As Boolean,
	Fillets As List(Of Brep)
) As Boolean
Parameters
railDegree
Type: System.Int32
The degree of the rail
TanSlider
Type: System.Double
A number from -1 to 1 indicating how far towards the theoretical rational midpoint to adjust the tangent control points.
bExtend
Type: System.Boolean
If true, when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
Fillets
Type: System.Collections.Generic.List<Brep>
the fillet8s that were created
Return Value
Type: Boolean
true if successful
See Also
Reference
SurfaceFilletBase Class
Rhino.Geometry Namespace