RhinoCommon API
Mesh.Split Method (IEnumerable<Mesh>)
 Split a mesh with a collection of meshes. Suggestion: upgrade to overload with tolerance. Does not split at coplanar intersections.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Mesh[] Split(
	IEnumerable<Mesh> meshes
)
Public Function Split (
	meshes As IEnumerable(Of Mesh)
) As Mesh()
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
Meshes to split with.
Return Value
Type: Mesh[]
An array of mesh segments representing the split result.
See Also
Reference
Mesh Class
Split Overload
Rhino.Geometry Namespace