RhinoCommon API
Layer.UnsetPersistentLocking Method
 Remove any explicitly persistent locking settings from this layer
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.5
Syntax
public void UnsetPersistentLocking()
Public Sub UnsetPersistentLocking
See Also
Reference
Layer Class
Rhino.DocObjects Namespace