RhinoCommon API
RhinoSettings.ActiveView Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RhinoSettings.ActiveView"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoView ActiveView()
Public Function ActiveView As RhinoView
Return Value
Type: RhinoView
[Missing <returns> documentation for "M:Rhino.Render.DataSources.RhinoSettings.ActiveView"]
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace