RhinoCommon API
ViewCaptureWriter.FillPolygon Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.FillPolygon(System.Drawing.PointF[],System.Drawing.Color)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract void FillPolygon(
	PointF[] points,
	Color fillColor
)
Protected MustOverride Sub FillPolygon (
	points As PointF(),
	fillColor As Color
)
Parameters
points
Type: System.Drawing.PointF[]
[Missing <param name="points"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.FillPolygon(System.Drawing.PointF[],System.Drawing.Color)"]
fillColor
Type: System.Drawing.Color
[Missing <param name="fillColor"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.FillPolygon(System.Drawing.PointF[],System.Drawing.Color)"]
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace