RhinoCommon API
RenderMaterial.GetTextureAmountFromUsage Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.GetTextureAmountFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double GetTextureAmountFromUsage(
	RenderMaterial.StandardChildSlots slot
)
Public Function GetTextureAmountFromUsage (
	slot As RenderMaterial.StandardChildSlots
) As Double
Parameters
slot
Type: Rhino.Render.RenderMaterial.StandardChildSlots
[Missing <param name="slot"/> documentation for "M:Rhino.Render.RenderMaterial.GetTextureAmountFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.GetTextureAmountFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace