RhinoCommon API
Transform.RotationZYZ Method
 Create rotation transformation From Euler angles.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public static Transform RotationZYZ(
	double alpha,
	double beta,
	double gamma
)
Public Shared Function RotationZYZ (
	alpha As Double,
	beta As Double,
	gamma As Double
) As Transform
Parameters
alpha
Type: System.Double
Angle, in radians, to rotate about the Z axis.
beta
Type: System.Double
Angle, in radians, to rotate about the Y axis.
gamma
Type: System.Double
Angle, in radians, to rotate about the X axis.
Return Value
Type: Transform
A transform matrix from Euler angles.
Remarks
 RotationZYZ(alpha, beta, gamma) = R_z(alpha) * R_y(beta) * R_z(gamma) where R_*(angle) is rotation of angle radians about the corresponding *-world coordinate axis. Note, alpha and gamma are in the range (-pi, pi] while beta in the range [0, pi]
See Also
Reference
Transform Structure
Rhino.Geometry Namespace