RhinoCommon API
LengthUnit.IsCustom Method
 Determines whether the specified value is a custom unit.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool IsCustom(
	 in LengthUnit unit
)
Public Shared Function IsCustom (
	 ByRef unit As LengthUnit
) As Boolean
Parameters
unit
Type: Rhino.LengthUnit
[Missing <param name="unit"/> documentation for "M:Rhino.LengthUnit.IsCustom(Rhino.LengthUnit@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.LengthUnit.IsCustom(Rhino.LengthUnit@)"]
See Also
Reference
LengthUnit Structure
Rhino Namespace