RhinoCommon API
RhinoDoc.PurgeObjectHistory Method
 Purges the history records of every object in this document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PurgeObjectHistory()
Public Function PurgeObjectHistory As Integer
Return Value
Type: Int32
The number of objects that had a history record purged.
Remarks
 Objects that are deleted (and therefore on the undo stack) have their history records purged but are not included in the returned count.
See Also
Reference
RhinoDoc Class
PurgeObjectHistory Overload
Rhino Namespace