RhinoCommon API
AreaMassProperties.Sum Method (AreaMassProperties)
 Sum mass properties together to get an aggregate mass.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Sum(
	AreaMassProperties summand
)
Public Function Sum (
	summand As AreaMassProperties
) As Boolean
Parameters
summand
Type: Rhino.Geometry.AreaMassProperties
mass properties to add.
Return Value
Type: Boolean
true if successful.
See Also
Reference
AreaMassProperties Class
Sum Overload
Rhino.Geometry Namespace