RhinoCommon API
ObjectTable.AddLeader Method (Leader, ObjectAttributes, HistoryRecord, Boolean)
 Adds a Leader object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid AddLeader(
	Leader leader,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddLeader (
	leader As Leader,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
leader
Type: Rhino.Geometry.Leader
The leader object.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to rich text.
history
Type: Rhino.DocObjects.HistoryRecord
Object history to save.
reference
Type: System.Boolean
If reference, then object will not be saved into the 3dm file.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddLeader Overload
Rhino.DocObjects.Tables Namespace