RhinoCommon API
TextFields.BlockName Method
 Returns the block definition name of a block instance
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string BlockName(
	string blockId
)
Public Shared Function BlockName (
	blockId As String
) As String
Parameters
blockId
Type: System.String
[Missing <param name="blockId"/> documentation for "M:Rhino.Runtime.TextFields.BlockName(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.BlockName(System.String)"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace