RhinoCommon API
PageViewGroupTable.GetUnusedName Method
 Gets an unused page view group name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string GetUnusedName()
Public Function GetUnusedName As String
Return Value
Type: String
An unused page view group name
See Also
Reference
PageViewGroupTable Class
GetUnusedName Overload
Rhino.DocObjects.Tables Namespace