RhinoCommon API
DisplayPipelineAttributes.SetFill Method (Color)
 Set fill mode to solid color and set the fill color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.23
Syntax
public void SetFill(
	Color singleColor
)
Public Sub SetFill (
	singleColor As Color
)
Parameters
singleColor
Type: System.Drawing.Color
[Missing <param name="singleColor"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.SetFill(System.Drawing.Color)"]
See Also
Reference
DisplayPipelineAttributes Class
SetFill Overload
Rhino.Display Namespace