RhinoCommon API
Curve.CreateBooleanRegions Method (IEnumerable<Curve>, Plane, Boolean, Double)
 Calculates curve Boolean regions, which trims and splits curves based on their overlapping regions.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static CurveBooleanRegions CreateBooleanRegions(
	IEnumerable<Curve> curves,
	Plane plane,
	bool combineRegions,
	double tolerance
)
Public Shared Function CreateBooleanRegions (
	curves As IEnumerable(Of Curve),
	plane As Plane,
	combineRegions As Boolean,
	tolerance As Double
) As CurveBooleanRegions
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
The input curves.
plane
Type: Rhino.Geometry.Plane
Regions will be found in the projection of the curves to this plane.
combineRegions
Type: System.Boolean
If true, then adjacent regions will be combined.
tolerance
Type: System.Double
Function tolerance. When in doubt, use the document's model absolute tolerance.
Return Value
Type: CurveBooleanRegions
The curve Boolean regions if successful, null of no successful.
See Also
Reference
Curve Class
CreateBooleanRegions Overload
Rhino.Geometry Namespace