RhinoCommon API
ClassArrayOnObjRef.ToNonConstArray Method (RhinoDoc)
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public ObjRef[] ToNonConstArray(
	RhinoDoc doc
)
Public Function ToNonConstArray (
	doc As RhinoDoc
) As ObjRef()
Parameters
doc
Type: Rhino.RhinoDoc
Document containing the array of objects
Return Value
Type: ObjRef[]
The managed array.
See Also
Reference
ClassArrayOnObjRef Class
ToNonConstArray Overload
Rhino.Runtime.InteropWrappers Namespace