RhinoCommon API
RevSurface.AxisAndCurveCoplanar Method
 Detemines if the axis of revolution and the curve are co-planar.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool AxisAndCurveCoplanar()
Public Function AxisAndCurveCoplanar As Boolean
Return Value
Type: Boolean
 true if the axis of revolution and the curve are co-planar, false otherwise.
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace