RhinoCommon API
RenderPrimitive.TryGetBox Method
 Call this method to get a Box primitive for this mesh. If this meshes PrimitiveType is not a Box then the box parameter is set to Empty.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool TryGetBox(
	out Box box
)
Public Function TryGetBox (
	<OutAttribute> ByRef box As Box
) As Boolean
Parameters
box
Type: Rhino.Geometry.Box
 Gets set to the box primitive for this object on success or Empty on error.
Return Value
Type: Boolean
 Returns true if PrimitiveType is Box and the box parameter was initialized otherwise returns false.
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace