RhinoCommon API
TextFields.Volume Method (String, String)
 Returns a volume; if the opt param is a bool "true/false" or "1/0" then open objects are inspected or ignored. if the opt param is a unit system as a string "millimeter" then the volume will be returned if the object is closed and in the specified unit system. Open objects return 0
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static double Volume(
	string id,
	string opt
)
Public Shared Function Volume (
	id As String,
	opt As String
) As Double
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String,System.String)"]
opt
Type: System.String
[Missing <param name="opt"/> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String,System.String)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String,System.String)"]
See Also
Reference
TextFields Class
Volume Overload
Rhino.Runtime Namespace