RhinoCommon API
Curve.CreateSoftEditCurve Method
 Creates a soft edited curve from an existing curve using a smooth field of influence.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Curve CreateSoftEditCurve(
	Curve curve,
	double t,
	Vector3d delta,
	double length,
	bool fixEnds
)
Public Shared Function CreateSoftEditCurve (
	curve As Curve,
	t As Double,
	delta As Vector3d,
	length As Double,
	fixEnds As Boolean
) As Curve
Parameters
curve
Type: Rhino.Geometry.Curve
The curve to soft edit.
t
Type: System.Double
 A parameter on the curve to move from. This location on the curve is moved, and the move is smoothly tapered off with increasing distance along the curve from this parameter.
delta
Type: Rhino.Geometry.Vector3d
The direction and magnitude, or maximum distance, of the move.
length
Type: System.Double
 The distance along the curve from the editing point over which the strength of the editing falls off smoothly.
fixEnds
Type: System.Boolean
[Missing <param name="fixEnds"/> documentation for "M:Rhino.Geometry.Curve.CreateSoftEditCurve(Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Vector3d,System.Double,System.Boolean)"]
Return Value
Type: Curve
The soft edited curve if successful. null on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace