RhinoCommon API
StdVectorByte.Memory Method
 Return the raw data.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.26
Syntax
public IntPtr Memory()
Public Function Memory As IntPtr
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Runtime.InteropWrappers.StdVectorByte.Memory"]
See Also
Reference
StdVectorByte Class
Rhino.Runtime.InteropWrappers Namespace