RhinoCommon API
Triangle3d.BarycentricCoordsAt Method
 Gets the projection of a point onto the barycentric coordinates.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Point2d BarycentricCoordsAt(
	Point3d point,
	out double signedHeight
)
Public Function BarycentricCoordsAt (
	point As Point3d,
	<OutAttribute> ByRef signedHeight As Double
) As Point2d
Parameters
point
Type: Rhino.Geometry.Point3d
Point to project.
signedHeight
Type: System.Double
A value indicating the height of the intersection in world units, negative if the point is situated under the triangle.
Return Value
Type: Point2d
The computed barycentric mass values relating to B and C for point.
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace