RhinoCommon API
NamedParametersEventArgs.Set Method (String, IEnumerable<GeometryBase>)
 Set a list of geometry for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Set(
	string name,
	IEnumerable<GeometryBase> values
)
Public Sub Set (
	name As String,
	values As IEnumerable(Of GeometryBase)
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})"]
values
Type: System.Collections.Generic.IEnumerable<GeometryBase>
[Missing <param name="values"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})"]
See Also
Reference
NamedParametersEventArgs Class
Set Overload
Rhino.Runtime Namespace