RhinoCommon API
PageViewGroupTable.Delete Method (Int32, Boolean)
 Deletes a page view group.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Delete(
	int index,
	bool quiet
)
Public Function Delete (
	index As Integer,
	quiet As Boolean
) As Boolean
Parameters
index
Type: System.Int32
Zero-based index of page view group.
quiet
Type: System.Boolean
true to disable any warning or error messages.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
PageViewGroupTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace