RhinoCommon API
RdkUndo.NewUndoRecord Method
 Get a new UndoRecord
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public RdkUndoRecord NewUndoRecord()
Public Function NewUndoRecord As RdkUndoRecord
Return Value
Type: RdkUndoRecord
[Missing <returns> documentation for "M:Rhino.Render.RdkUndo.NewUndoRecord"]
See Also
Reference
RdkUndo Class
Rhino.Render Namespace