RhinoCommon API
SimpleArrayBinaryArchiveReader.Get Method
 Get the BinaryArchiveReader at index.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public BinaryArchiveReader Get(
	int index
)
Public Function Get (
	index As Integer
) As BinaryArchiveReader
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Get(System.Int32)"]
Return Value
Type: BinaryArchiveReader
The BinaryArchiveReader at the specified index.
See Also
Reference
SimpleArrayBinaryArchiveReader Class
Rhino.Runtime.InteropWrappers Namespace