RhinoCommon API
PersistentSettings.TryGetDefault Method (String, Boolean)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Boolean@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetDefault(
	string key,
	out bool value
)
Public Function TryGetDefault (
	key As String,
	<OutAttribute> ByRef value As Boolean
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Boolean@)"]
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Boolean@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Boolean@)"]
See Also
Reference
PersistentSettings Class
TryGetDefault Overload
Rhino Namespace