RhinoCommon API
NamedParametersEventArgs.Set Method (String, MeshingParameters)
 Set an MeshingParameters for the specified key
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Set(
	string name,
	MeshingParameters value
)
Public Sub Set (
	name As String,
	value As MeshingParameters
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.MeshingParameters)"]
value
Type: Rhino.Geometry.MeshingParameters
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.MeshingParameters)"]
See Also
Reference
NamedParametersEventArgs Class
Set Overload
Rhino.Runtime Namespace