RhinoCommon API
GumballObject.SetFromCurve Method
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromCurve(Rhino.Geometry.Curve)"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SetFromCurve(
	Curve curve
)
Public Function SetFromCurve (
	curve As Curve
) As Boolean
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromCurve(Rhino.Geometry.Curve)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromCurve(Rhino.Geometry.Curve)"]
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace