RhinoCommon API
PlugIn.SaveSettings Method
 Write settings to disk which will raise a SettingsSaved event.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SaveSettings()
Public Sub SaveSettings
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace