RhinoCommon API
ChangeQueue.ApplyRenderSettingsChanges Method (RenderSettings)
 Override this when you need to handle background changes (through RenderSettings)
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplyRenderSettingsChanges(
	RenderSettings rs
)
Protected Overridable Sub ApplyRenderSettingsChanges (
	rs As RenderSettings
)
Parameters
rs
Type: Rhino.Render.RenderSettings
[Missing <param name="rs"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyRenderSettingsChanges(Rhino.Render.RenderSettings)"]
See Also
Reference
ChangeQueue Class
ApplyRenderSettingsChanges Overload
Rhino.Render.ChangeQueue Namespace