RhinoCommon API
GumballSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static GumballSettingsState GetDefaultState()
Public Shared Function GetDefaultState As GumballSettingsState
Return Value
Type: GumballSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.GumballSettings.GetDefaultState"]
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace