RhinoCommon API
SimpleArrayInterval.Add Method
 Adds a new Interval at the end of this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Add(
	Interval interval
)
Public Sub Add (
	interval As Interval
)
Parameters
interval
Type: Rhino.Geometry.Interval
[Missing <param name="interval"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayInterval.Add(Rhino.Geometry.Interval)"]
See Also
Reference
SimpleArrayInterval Class
Rhino.Runtime.InteropWrappers Namespace