RhinoCommon API
RenderMeshes.GetHashCode Method
 Overrides default hash code function - just returns Hash
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshes.GetHashCode"]
See Also
Reference
RenderMeshes Class
Rhino.Render.CustomRenderMeshes Namespace