RhinoCommon API
CustomDisplay.AddCircle Method (Circle, Color)
 Adds a new, colored arc to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void AddCircle(
	Circle circle,
	Color color
)
Public Sub AddCircle (
	circle As Circle,
	color As Color
)
Parameters
circle
Type: Rhino.Geometry.Circle
Circle to add.
color
Type: System.Drawing.Color
Color of circle.
See Also
Reference
CustomDisplay Class
AddCircle Overload
Rhino.Display Namespace