RhinoCommon API
Localization.FormatVolume Method
 Format a Volume string from a number
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string FormatVolume(
	double volume,
	UnitSystem units,
	DimensionStyle dimStyle,
	bool alternate
)
Public Shared Function FormatVolume (
	volume As Double,
	units As UnitSystem,
	dimStyle As DimensionStyle,
	alternate As Boolean
) As String
Parameters
volume
Type: System.Double
[Missing <param name="volume"/> documentation for "M:Rhino.UI.Localization.FormatVolume(System.Double,Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle,System.Boolean)"]
units
Type: Rhino.UnitSystem
[Missing <param name="units"/> documentation for "M:Rhino.UI.Localization.FormatVolume(System.Double,Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle,System.Boolean)"]
dimStyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimStyle"/> documentation for "M:Rhino.UI.Localization.FormatVolume(System.Double,Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle,System.Boolean)"]
alternate
Type: System.Boolean
[Missing <param name="alternate"/> documentation for "M:Rhino.UI.Localization.FormatVolume(System.Double,Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle,System.Boolean)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.Localization.FormatVolume(System.Double,Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle,System.Boolean)"]
See Also
Reference
Localization Class
Rhino.UI Namespace