RhinoCommon API
BrepCurveList.GetEnumerator Method
Get an enumerator that visits all curves.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public IEnumerator<Curve> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Curve)
Return Value
Type: IEnumerator<Curve>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
BrepCurveList Class
Rhino.Geometry.Collections Namespace