RhinoCommon API
Transform2d.Clone Method
 Returns a deep copy of the transform. For languages that treat structures as value types, this can be accomplished by a simple assignment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Transform2d Clone()
Public Function Clone As Transform2d
Return Value
Type: Transform2d
A deep copy of this data structure.
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace