RhinoCommon API
PlugIn.GetLicenseOwner Method
 Get the customer name and organization used when entering the product license.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
protected bool GetLicenseOwner(
	out string registeredOwner,
	out string registeredOrganization
)
Protected Function GetLicenseOwner (
	<OutAttribute> ByRef registeredOwner As String,
	<OutAttribute> ByRef registeredOrganization As String
) As Boolean
Parameters
registeredOwner
Type: System.String
[Missing <param name="registeredOwner"/> documentation for "M:Rhino.PlugIns.PlugIn.GetLicenseOwner(System.String@,System.String@)"]
registeredOrganization
Type: System.String
[Missing <param name="registeredOrganization"/> documentation for "M:Rhino.PlugIns.PlugIn.GetLicenseOwner(System.String@,System.String@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.GetLicenseOwner(System.String@,System.String@)"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace