RhinoCommon API
FileWriteOptions.Dispose Method
Releases all resources used by the FileWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
FileWriteOptions Class
Dispose Overload
Rhino.FileIO Namespace