RhinoCommon API
Circle Constructor (Arc)
 Initializes a circle from an arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Circle(
	Arc arc
)
Public Sub New (
	arc As Arc
)
Parameters
arc
Type: Rhino.Geometry.Arc
Arc that defines the plane and radius.
See Also
Reference
Circle Structure
Circle Overload
Rhino.Geometry Namespace