RhinoCommon API
RenderTexture.PixelSize Method
 Get the texture dimensions for the RenderTexture.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void PixelSize(
	out int u,
	out int v,
	out int w
)
Public Sub PixelSize (
	<OutAttribute> ByRef u As Integer,
	<OutAttribute> ByRef v As Integer,
	<OutAttribute> ByRef w As Integer
)
Parameters
u
Type: System.Int32
width
v
Type: System.Int32
height
w
Type: System.Int32
depth, used for 3D textures
See Also
Reference
RenderTexture Class
Rhino.Render Namespace
RenderTexture.PixelSize2