RhinoCommon API
CollapsibleSectionImpl.CreateHostedSection Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.CreateHostedSection(Rhino.UI.Controls.ICollapsibleSection)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void CreateHostedSection(
	ICollapsibleSection section
)
Public Shared Sub CreateHostedSection (
	section As ICollapsibleSection
)
Parameters
section
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="section"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.CreateHostedSection(Rhino.UI.Controls.ICollapsibleSection)"]
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace