RhinoCommon API
PointCloud.ShrinkWrap Method
 Returns a ShrinkWrap mesh from this point cloud object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Mesh ShrinkWrap(
	ShrinkWrapParameters parameters
)
Public Function ShrinkWrap (
	parameters As ShrinkWrapParameters
) As Mesh
Parameters
parameters
Type: Rhino.Geometry.ShrinkWrapParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.PointCloud.ShrinkWrap(Rhino.Geometry.ShrinkWrapParameters)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.PointCloud.ShrinkWrap(Rhino.Geometry.ShrinkWrapParameters)"]
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace