RhinoCommon API
TextureEvaluator Constructor
Note: This API is now obsolete.
 Base class constructor
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute]
protected TextureEvaluator()
<ObsoleteAttribute>
Protected Sub New
See Also
Reference
TextureEvaluator Class
TextureEvaluator Overload
Rhino.Render Namespace