RhinoCommon API
GetCylinder Constructor
Initializes a new instance of the GetCylinder class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public GetCylinder()
Public Sub New
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace