RhinoCommon API
StringWrapper.ToString Method
 Returns the string contents of this wrapper.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A managed string.
See Also
Reference
StringWrapper Class
Rhino.Runtime.InteropWrappers Namespace