RhinoCommon API
PersistentSettings.SetDefault Method (String, Double)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Double)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetDefault(
	string key,
	double value
)
Public Sub SetDefault (
	key As String,
	value As Double
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Double)"]
value
Type: System.Double
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Double)"]
See Also
Reference
PersistentSettings Class
SetDefault Overload
Rhino Namespace