RhinoCommon API
Dialogs.ShowPropertyListBox Method (String, String, List<KeyValuePair<String, String>>)
 Displays Rhino's property list box.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string[] ShowPropertyListBox(
	string title,
	string message,
	List<KeyValuePair<string, string>> items
)
Public Shared Function ShowPropertyListBox (
	title As String,
	message As String,
	items As List(Of KeyValuePair(Of String, String))
) As String()
Parameters
title
Type: System.String
The dialog title.
message
Type: System.String
The dialog message.
items
Type: System.Collections.Generic.List<KeyValuePair<String, String>>
A list of key value pairs
Return Value
Type: String[]
A list of property values if successful, null otherwise.
See Also
Reference
Dialogs Class
ShowPropertyListBox Overload
Rhino.UI Namespace