RhinoCommon API
SimpleArrayPoint2d.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SimpleArrayPoint2d Class
Dispose Overload
Rhino.Runtime.InteropWrappers Namespace