RhinoCommon API
RhinoObject.GetSelectedSubObjects Method
Get a list of all selected sub-objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ComponentIndex[] GetSelectedSubObjects()
Public Function GetSelectedSubObjects As ComponentIndex()
Return Value
Type: ComponentIndex[]
An array of sub-object indices, or null if there are none.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace