RhinoCommon API
FilePlyWriteOptions Constructor
Initializes a new instance of the FilePlyWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public FilePlyWriteOptions(
	FileWriteOptions writeOptions
)
Public Sub New (
	writeOptions As FileWriteOptions
)
Parameters
writeOptions
Type: Rhino.FileIO.FileWriteOptions
[Missing <param name="writeOptions"/> documentation for "M:Rhino.FileIO.FilePlyWriteOptions.#ctor(Rhino.FileIO.FileWriteOptions)"]
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace