RhinoCommon API
VolumeMassProperties.Compute Method (Surface, Boolean, Boolean, Boolean, Boolean)
 Compute the VolumeMassProperties for a single Surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static VolumeMassProperties Compute(
	Surface surface,
	bool volume,
	bool firstMoments,
	bool secondMoments,
	bool productMoments
)
Public Shared Function Compute (
	surface As Surface,
	volume As Boolean,
	firstMoments As Boolean,
	secondMoments As Boolean,
	productMoments As Boolean
) As VolumeMassProperties
Parameters
surface
Type: Rhino.Geometry.Surface
Surface to measure.
volume
Type: System.Boolean
true to calculate volume.
firstMoments
Type: System.Boolean
true to calculate volume first moments, volume, and volume centroid.
secondMoments
Type: System.Boolean
true to calculate volume second moments.
productMoments
Type: System.Boolean
true to calculate volume product moments.
Return Value
Type: VolumeMassProperties
The VolumeMassProperties for the given Surface or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When surface is null.
See Also
Reference
VolumeMassProperties Class
Compute Overload
Rhino.Geometry Namespace