RhinoCommon API
PersistentSettings.SetInteger Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetInteger(System.String,System.Int32)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetInteger(
	string key,
	int value
)
Public Sub SetInteger (
	key As String,
	value As Integer
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetInteger(System.String,System.Int32)"]
value
Type: System.Int32
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetInteger(System.String,System.Int32)"]
See Also
Reference
PersistentSettings Class
Rhino Namespace