RhinoCommon API
RebuildCurveOptions.IntToIntensity Method
[Missing <summary> documentation for "M:Rhino.Geometry.RebuildCurveOptions.IntToIntensity(System.Int32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RebuildCurveIntensity IntToIntensity(
	int intensity_as_int
)
Public Function IntToIntensity (
	intensity_as_int As Integer
) As RebuildCurveIntensity
Parameters
intensity_as_int
Type: System.Int32
[Missing <param name="intensity_as_int"/> documentation for "M:Rhino.Geometry.RebuildCurveOptions.IntToIntensity(System.Int32)"]
Return Value
Type: RebuildCurveIntensity
[Missing <returns> documentation for "M:Rhino.Geometry.RebuildCurveOptions.IntToIntensity(System.Int32)"]
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace