RhinoCommon API
ChangeQueue.ProvideOriginalObject Method
 Override ProvideOriginalObject and return true if you want original objects supplied with ChangeQueue.Mesh. This will then also allow access to the Attributes.UserData of the original object from which the Mesh was generated.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool ProvideOriginalObject()
Protected Overridable Function ProvideOriginalObject As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ProvideOriginalObject"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace