RhinoCommon API
SubDEdgeSharpness.IsValidValue Method
 Determines whether a value can be used as an edge end sharpness.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static bool IsValidValue(
	double candidateValue,
	bool creaseResult
)
Public Shared Function IsValidValue (
	candidateValue As Double,
	creaseResult As Boolean
) As Boolean
Parameters
candidateValue
Type: System.Double
The value to check.
creaseResult
Type: System.Boolean
 The value to return when candidateValue is CreaseValue.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgeSharpness.IsValidValue(System.Double,System.Boolean)"]
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace