RhinoCommon API
Curve.CreateTweenCurves Method (Curve, Curve, Int32, Double)
 Creates curves between two open or closed input curves. Uses the control points of the curves for finding tween curves. That means the first control point of first curve is matched to first control point of the second curve and so on. There is no matching of curves direction. Caller must match input curves direction before calling the function.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Curve[] CreateTweenCurves(
	Curve curve0,
	Curve curve1,
	int numCurves,
	double tolerance
)
Public Shared Function CreateTweenCurves (
	curve0 As Curve,
	curve1 As Curve,
	numCurves As Integer,
	tolerance As Double
) As Curve()
Parameters
curve0
Type: Rhino.Geometry.Curve
The first, or starting, curve.
curve1
Type: Rhino.Geometry.Curve
The second, or ending, curve.
numCurves
Type: System.Int32
Number of tween curves to create.
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.Curve.CreateTweenCurves(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32,System.Double)"]
Return Value
Type: Curve[]
An array of tween curves. This array can be empty.
See Also
Reference
Curve Class
CreateTweenCurves Overload
Rhino.Geometry Namespace