RhinoCommon API
ArchivableDictionary.Set Method (String, IEnumerable<Int32>)
 Sets a list, an array or any enumerable of Int32.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Set(
	string key,
	IEnumerable<int> val
)
Public Function Set (
	key As String,
	val As IEnumerable(Of Integer)
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: System.Collections.Generic.IEnumerable<Int32>
A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.
It is up to the user to clone this entry when appropriate.
Return Value
Type: Boolean
true if set operation succeeded, otherwise false.
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace