RhinoCommon API
OpenGLSettings.GetCurrentState Method
 Gets the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public static OpenGLSettingsState GetCurrentState()
Public Shared Function GetCurrentState As OpenGLSettingsState
Return Value
Type: OpenGLSettingsState
A new OpenGL state with current settings.
See Also
Reference
OpenGLSettings Class
Rhino.ApplicationSettings Namespace