RhinoCommon API
SupportOptions.AutoSaveRenderings Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.AutoSaveRenderings"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool AutoSaveRenderings()
Public Shared Function AutoSaveRenderings As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.AutoSaveRenderings"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace