RhinoCommon API
File3dm.GetPreviewImage Method
 Preview image used for file explorer
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Bitmap GetPreviewImage()
Public Function GetPreviewImage As Bitmap
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.FileIO.File3dm.GetPreviewImage"]
See Also
Reference
File3dm Class
Rhino.FileIO Namespace