RhinoCommon API
RhinoCore.Dispose Method
 IDisposable implementation
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RhinoCore Class
Rhino.Runtime.InProcess Namespace