RhinoCommon API
ViewInfo.GetWindowPosition Method
 Gets the position of the view window in the frame window, expressed as fractions (0 to 1) of the frame window size.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void GetWindowPosition(
	out double left,
	out double right,
	out double top,
	out double bottom
)
Public Sub GetWindowPosition (
	<OutAttribute> ByRef left As Double,
	<OutAttribute> ByRef right As Double,
	<OutAttribute> ByRef top As Double,
	<OutAttribute> ByRef bottom As Double
)
Parameters
left
Type: System.Double
Left edge fraction.
right
Type: System.Double
Right edge fraction.
top
Type: System.Double
Top edge fraction.
bottom
Type: System.Double
Bottom edge fraction.
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace