RhinoCommon API
ICollapsibleSectionHolder2.SetFullHeightSection Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder2.SetFullHeightSection(Rhino.UI.Controls.ICollapsibleSection)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
void SetFullHeightSection(
	ICollapsibleSection sec
)
Sub SetFullHeightSection (
	sec As ICollapsibleSection
)
Parameters
sec
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="sec"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder2.SetFullHeightSection(Rhino.UI.Controls.ICollapsibleSection)"]
See Also
Reference
ICollapsibleSectionHolder2 Interface
Rhino.UI.Controls Namespace