RhinoCommon API
Command.GetMostRecentCommands Method
 Gets an array of most recent command descriptions.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static MostRecentCommandDescription[] GetMostRecentCommands()
Public Shared Function GetMostRecentCommands As MostRecentCommandDescription()
Return Value
Type: MostRecentCommandDescription[]
An array of command descriptions.
See Also
Reference
Command Class
Rhino.Commands Namespace