RhinoCommon API
PlugIn.GetInstalledPlugInFolders Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.GetInstalledPlugInFolders"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string[] GetInstalledPlugInFolders()
Public Shared Function GetInstalledPlugInFolders As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.GetInstalledPlugInFolders"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace