RhinoCommon API
ObjectTable.Replace Method (Guid, GeometryBase, Boolean)
 Replaces the geometry in one object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public bool Replace(
	Guid objectId,
	GeometryBase geometry,
	bool ignoreModes
)
Public Function Replace (
	objectId As Guid,
	geometry As GeometryBase,
	ignoreModes As Boolean
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
geometry
Type: Rhino.Geometry.GeometryBase
[Missing <param name="geometry"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.GeometryBase,System.Boolean)"]
ignoreModes
Type: System.Boolean
[Missing <param name="ignoreModes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.GeometryBase,System.Boolean)"]
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace