RhinoCommon API
ThicknessAnalysisSettings.UpdateFromState Method
 Sets all settings to a particular defined joined state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void UpdateFromState(
	ThicknessAnalysisSettingsState state
)
Public Shared Sub UpdateFromState (
	state As ThicknessAnalysisSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.ThicknessAnalysisSettingsState
The particular state.
See Also
Reference
ThicknessAnalysisSettings Class
Rhino.ApplicationSettings Namespace