RhinoCommon API
Vector2d.IsTiny Method
 Uses RhinoMath.ZeroTolerance for IsTiny calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsTiny()
Public Function IsTiny As Boolean
Return Value
Type: Boolean
true if vector is very small, otherwise false.
See Also
Reference
Vector2d Structure
IsTiny Overload
Rhino.Geometry Namespace