RhinoCommon API
MouseState.IsMouseOver Method (Line)
 Test if the mouse is currently over a 3d line
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsMouseOver(
	Line line
)
Public Function IsMouseOver (
	line As Line
) As Boolean
Parameters
line
Type: Rhino.Geometry.Line
the line to test
Return Value
Type: Boolean
true if the mouse is over line
See Also
Reference
MouseState Class
IsMouseOver Overload
Rhino.UI Namespace