RhinoCommon API
CommandAliasList.GetDefaults Method
 Constructs a dictionary containing as keys the default names and as value the default macro.
The returned dictionary contains a copy of the settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Dictionary<string, string> GetDefaults()
Public Shared Function GetDefaults As Dictionary(Of String, String)
Return Value
Type: Dictionary<String, String>
A new dictionary with the default name/macro combinations.
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace