RhinoCommon API
PlaneSurface Constructor (Plane)
 Constructs a new plane surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.1
Syntax
public PlaneSurface(
	Plane plane
)
Public Sub New (
	plane As Plane
)
Parameters
plane
Type: Rhino.Geometry.Plane
The plane.
See Also
Reference
PlaneSurface Class
PlaneSurface Overload
Rhino.Geometry Namespace