RhinoCommon API
RenderTexture.GetPreviewIn3D Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetPreviewIn3D"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual bool GetPreviewIn3D()
Public Overridable Function GetPreviewIn3D As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetPreviewIn3D"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace