RhinoCommon API
BoundingBox.ClosestPoint Method (Point3d, Boolean)
 Finds the closest point on or in the bounding box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d ClosestPoint(
	Point3d point,
	bool includeInterior
)
Public Function ClosestPoint (
	point As Point3d,
	includeInterior As Boolean
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
Sample point.
includeInterior
Type: System.Boolean
If false, the point is projected onto the boundary faces only, otherwise the interior of the box is also taken into consideration.
Return Value
Type: Point3d
The point on or in the box that is closest to the sample point.
See Also
Reference
BoundingBox Structure
ClosestPoint Overload
Rhino.Geometry Namespace