RhinoCommon API
IsoDrawEffect.SetBandColor Method
[Missing <summary> documentation for "M:Rhino.Display.IsoDrawEffect.SetBandColor(System.Int32,System.Drawing.Color)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SetBandColor(
	int index,
	Color color
)
Public Function SetBandColor (
	index As Integer,
	color As Color
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Display.IsoDrawEffect.SetBandColor(System.Int32,System.Drawing.Color)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.IsoDrawEffect.SetBandColor(System.Int32,System.Drawing.Color)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.IsoDrawEffect.SetBandColor(System.Int32,System.Drawing.Color)"]
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace