RhinoCommon API
RenderChannels Constructor
 Create a utility object not associated with any document.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RenderChannels()
Public Sub New
See Also
Reference
RenderChannels Class
Rhino.Render Namespace