RhinoCommon API
SubD.EvaluateCurvature Method (SubDComponentParameter, SubD.ExtraordinaryVertexCurvature, SurfaceCurvature)
 Evaluates the curvature of a point on this SubD's surface, choosing what to report exactly on an extraordinary vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool EvaluateCurvature(
	SubDComponentParameter parameter,
	SubD.ExtraordinaryVertexCurvature extraordinaryVertexCurvature,
	out SurfaceCurvature curvature
)
Public Function EvaluateCurvature (
	parameter As SubDComponentParameter,
	extraordinaryVertexCurvature As SubD.ExtraordinaryVertexCurvature,
	<OutAttribute> ByRef curvature As SurfaceCurvature
) As Boolean
Parameters
parameter
Type: Rhino.Geometry.SubDComponentParameter
The parameter to evaluate.
extraordinaryVertexCurvature
Type: Rhino.Geometry.SubD.ExtraordinaryVertexCurvature
 What to report when the parameter is exactly on an extraordinary vertex, where the limit surface has no curvature of its own.
curvature
Type: Rhino.Geometry.SurfaceCurvature
 The surface curvature is returned here, or null if this fails.
Return Value
Type: Boolean
True if the evaluation succeeded.
Remarks
 See CreateFromSubD(SubD, SubDComponentParameter, SubD.ExtraordinaryVertexCurvature).
See Also
Reference
SubD Class
EvaluateCurvature Overload
Rhino.Geometry Namespace