RhinoCommon API
Point3dList.Equals Method (Point3dList)
 Determines if the point lists are exactly equal.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool Equals(
	Point3dList other
)
Public Function Equals (
	other As Point3dList
) As Boolean
Parameters
other
Type: Rhino.Collections.Point3dList
Return Value
Type: Boolean
True is objects are exactly equal in value.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Point3dList Class
Equals Overload
Rhino.Collections Namespace