RhinoCommon API
PersistentSettings.TryGetStringDictionary Method (String, KeyValuePair<String, String>[], IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[]@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetStringDictionary(
	string key,
	out KeyValuePair<string, string>[] value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetStringDictionary (
	key As String,
	<OutAttribute> ByRef value As KeyValuePair(Of String, String)(),
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[]@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: System.Collections.Generic.KeyValuePair<String, String>[]
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[]@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[]@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[]@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetStringDictionary Overload
Rhino Namespace