RhinoCommon API
RenderEnvironment.SimulateEnvironment Method (SimulatedEnvironment, Boolean)
[Missing <summary> documentation for "M:Rhino.Render.RenderEnvironment.SimulateEnvironment(Rhino.Render.SimulatedEnvironment@,System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public virtual void SimulateEnvironment(
	ref SimulatedEnvironment simulation,
	bool isForDataOnly
)
Public Overridable Sub SimulateEnvironment (
	ByRef simulation As SimulatedEnvironment,
	isForDataOnly As Boolean
)
Parameters
simulation
Type: Rhino.Render.SimulatedEnvironment
[Missing <param name="simulation"/> documentation for "M:Rhino.Render.RenderEnvironment.SimulateEnvironment(Rhino.Render.SimulatedEnvironment@,System.Boolean)"]
isForDataOnly
Type: System.Boolean
[Missing <param name="isForDataOnly"/> documentation for "M:Rhino.Render.RenderEnvironment.SimulateEnvironment(Rhino.Render.SimulatedEnvironment@,System.Boolean)"]
See Also
Reference
RenderEnvironment Class
SimulateEnvironment Overload
Rhino.Render Namespace