RhinoCommon API
CustomGripObject.EvaluateCurveCVIndices Method
 The indices of the NURBS curve control points this grip drives. A grip may drive more than one, as at a closed or periodic seam.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual int[] EvaluateCurveCVIndices()
Protected Overridable Function EvaluateCurveCVIndices As Integer()
Return Value
Type: Int32[]
The control point indices, or null if this grip drives none.
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace