RhinoCommon API
LayerTable.Modify Method (Layer, Int32, Boolean)
Modifies layer settings.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Modify(
	Layer newSettings,
	int layerIndex,
	bool quiet
)
Public Function Modify (
	newSettings As Layer,
	layerIndex As Integer,
	quiet As Boolean
) As Boolean
Parameters
newSettings
Type: Rhino.DocObjects.Layer
This information is copied.
layerIndex
Type: System.Int32
 zero based index of layer to set. This must be in the range 0 <= layerIndex < LayerTable.Count.
quiet
Type: System.Boolean
if false, information message boxes pop up when illegal changes are attempted.
Return Value
Type: Boolean
 true if successful. false if layerIndex is out of range or the settings attempt to lock or hide the current layer.
See Also
Reference
LayerTable Class
Modify Overload
Rhino.DocObjects.Tables Namespace