RhinoCommon API
Triangle3d.ClosestPointOnBoundary Method
 Gets the point on the triangle boundary closest to a test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Point3d ClosestPointOnBoundary(
	Point3d point
)
Public Function ClosestPointOnBoundary (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
[Missing <param name="point"/> documentation for "M:Rhino.Geometry.Triangle3d.ClosestPointOnBoundary(Rhino.Geometry.Point3d)"]
Return Value
Type: Point3d
[Missing <returns> documentation for "M:Rhino.Geometry.Triangle3d.ClosestPointOnBoundary(Rhino.Geometry.Point3d)"]
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace