RhinoCommon API
BinaryArchiveException Constructor
 Initializes a new instance of the BinaryArchiveException class.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BinaryArchiveException(
	string message
)
Public Sub New (
	message As String
)
Parameters
message
Type: System.String
The inner message to show to users.
See Also
Reference
BinaryArchiveException Class
Rhino.FileIO Namespace