RhinoCommon API
SupportOptions.FileExplorer_SetShowDocuments Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.FileExplorer_SetShowDocuments(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void FileExplorer_SetShowDocuments(
	bool b
)
Public Shared Sub FileExplorer_SetShowDocuments (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.FileExplorer_SetShowDocuments(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace