RhinoCommon API
IPanelsService.ShowDockBar Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.ShowDockBar(System.Guid,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
bool ShowDockBar(
	Guid barId,
	bool show
)
Function ShowDockBar (
	barId As Guid,
	show As Boolean
) As Boolean
Parameters
barId
Type: System.Guid
[Missing <param name="barId"/> documentation for "M:Rhino.UI.IPanelsService.ShowDockBar(System.Guid,System.Boolean)"]
show
Type: System.Boolean
[Missing <param name="show"/> documentation for "M:Rhino.UI.IPanelsService.ShowDockBar(System.Guid,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.ShowDockBar(System.Guid,System.Boolean)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace