RhinoCommon API
RhinoSettings.GroundPlaneOnInViewDisplayMode Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RhinoSettings.GroundPlaneOnInViewDisplayMode(Rhino.Display.RhinoView)"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public bool GroundPlaneOnInViewDisplayMode(
	RhinoView view
)
Public Function GroundPlaneOnInViewDisplayMode (
	view As RhinoView
) As Boolean
Parameters
view
Type: Rhino.Display.RhinoView
[Missing <param name="view"/> documentation for "M:Rhino.Render.DataSources.RhinoSettings.GroundPlaneOnInViewDisplayMode(Rhino.Display.RhinoView)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.DataSources.RhinoSettings.GroundPlaneOnInViewDisplayMode(Rhino.Display.RhinoView)"]
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace