RhinoCommon API
WorksessionFileModel.GetLayerOverride Method
Gets a copy of a layer override.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFileLayerOverride GetLayerOverride(
	int index
)
Public Function GetLayerOverride (
	index As Integer
) As WorksessionFileLayerOverride
Parameters
index
Type: System.Int32
Index of the layer override.
Return Value
Type: WorksessionFileLayerOverride
A copy. Changes to it are kept only after SetLayerOverride(Int32, WorksessionFileLayerOverride).
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If index is out of range.
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace