RhinoCommon API
Transform.DecomposeTextureMapping Method
 Decomposition of a uvw transform into components
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void DecomposeTextureMapping(
	out Vector3d offset,
	out Vector3d repeat,
	out Vector3d rotation
)
Public Sub DecomposeTextureMapping (
	<OutAttribute> ByRef offset As Vector3d,
	<OutAttribute> ByRef repeat As Vector3d,
	<OutAttribute> ByRef rotation As Vector3d
)
Parameters
offset
Type: Rhino.Geometry.Vector3d
Offset
repeat
Type: Rhino.Geometry.Vector3d
Repear
rotation
Type: Rhino.Geometry.Vector3d
Rotation
See Also
Reference
Transform Structure
Rhino.Geometry Namespace