RhinoCommon API
ExtrusionObject.DuplicateExtrusionGeometry Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ExtrusionObject.DuplicateExtrusionGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Extrusion DuplicateExtrusionGeometry()
Public Function DuplicateExtrusionGeometry As Extrusion
Return Value
Type: Extrusion
[Missing <returns> documentation for "M:Rhino.DocObjects.ExtrusionObject.DuplicateExtrusionGeometry"]
See Also
Reference
ExtrusionObject Class
Rhino.DocObjects Namespace