RhinoCommon API
TextureMapping.TryGetMappingPlane Method (Plane, Interval, Interval, Interval, Boolean)
 Get plane mapping parameters from this texture mapping, including capping information
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public bool TryGetMappingPlane(
	out Plane plane,
	out Interval dx,
	out Interval dy,
	out Interval dz,
	out bool capped
)
Public Function TryGetMappingPlane (
	<OutAttribute> ByRef plane As Plane,
	<OutAttribute> ByRef dx As Interval,
	<OutAttribute> ByRef dy As Interval,
	<OutAttribute> ByRef dz As Interval,
	<OutAttribute> ByRef capped As Boolean
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Render.TextureMapping.TryGetMappingPlane(Rhino.Geometry.Plane@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,System.Boolean@)"]
dx
Type: Rhino.Geometry.Interval
 Portion of the plane's x axis that is mapped to [0,1]
dy
Type: Rhino.Geometry.Interval
 Portion of the plane's y axis that is mapped to [0,1]
dz
Type: Rhino.Geometry.Interval
 Portion of the plane's z axis that is mapped to [0,1]
capped
Type: System.Boolean
[Missing <param name="capped"/> documentation for "M:Rhino.Render.TextureMapping.TryGetMappingPlane(Rhino.Geometry.Plane@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,System.Boolean@)"]
Return Value
Type: Boolean
 Return true if valid plane mapping parameters were returned.
Remarks
 NOTE WELL: Generally, GetMappingPlane will not return the same parameters passed to SetPlaneMapping. However, the location of the plane will be the same.
See Also
Reference
TextureMapping Class
TryGetMappingPlane Overload
Rhino.Render Namespace