RhinoCommon API
PostEffectExecutionControl.Dispose Method (Boolean)
Releases the unmanaged resources used by the PostEffectExecutionControl and optionally releases the managed resources
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public virtual void Dispose(
	bool bDisposing
)
Public Overridable Sub Dispose (
	bDisposing As Boolean
)
Parameters
bDisposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
PostEffectExecutionControl Class
Dispose Overload
Rhino.Render.PostEffects Namespace