RhinoCommon API
Dialogs.ShowMultiListBox Method
 Displays Rhino's multiple selection list box.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.12
Syntax
public static string[] ShowMultiListBox(
	string title,
	string message,
	IList<string> items,
	IList<string> defaults = null
)
Public Shared Function ShowMultiListBox (
	title As String,
	message As String,
	items As IList(Of String),
	Optional defaults As IList(Of String) = Nothing
) As String()
Parameters
title
Type: System.String
The dialog title.
message
Type: System.String
The dialog message.
items
Type: System.Collections.Generic.IList<String>
A list of items to show.
defaults (Optional)
Type: System.Collections.Generic.IList<String>
The items to preselect.
Return Value
Type: String[]
The selected items if successful, null on cancel.
See Also
Reference
Dialogs Class
Rhino.UI Namespace