RhinoCommon API
RenderPlugIn.RenderContentSerializers Method
 Called by Rhino when it is time to register RenderContentSerializer derived classes. Override this method and return an array of an instance of each serialize custom content object you wish to add.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual IEnumerable<RenderContentSerializer> RenderContentSerializers()
Protected Overridable Function RenderContentSerializers As IEnumerable(Of RenderContentSerializer)
Return Value
Type: IEnumerable<RenderContentSerializer>
 List of RenderContentSerializer objects to register with the Rhino render content browsers.
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace