RhinoCommon API
RhinoApp.OutputDebugString Method
 Print a string to the Visual Studio Output window, if a debugger is attached. Note that the developer needs to add a newline manually if the next output should come on a separate line.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void OutputDebugString(
	string str
)
Public Shared Sub OutputDebugString (
	str As String
)
Parameters
str
Type: System.String
The string to print to the Output window.
See Also
Reference
RhinoApp Class
Rhino Namespace