RhinoCommon API
ContentCollectionIterator.GetEnumerator Method
 Enumerates the contents, rewinding the iterator to the beginning first. This makes it possible to use the iterator in a foreach loop or with LINQ instead of manually calling First() and Next(). The iterator itself is not disposed by enumerating it, so it should still be wrapped in a 'using' statement, or the whole RenderContentCollection can be enumerated directly instead.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IEnumerator<RenderContent> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of RenderContent)
Return Value
Type: IEnumerator<RenderContent>
[Missing <returns> documentation for "M:Rhino.Render.ContentCollectionIterator.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ContentCollectionIterator Class
Rhino.Render Namespace