RhinoCommon API
DisplayPipeline.DrawAnnotationArrowhead Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawAnnotationArrowhead(Rhino.Geometry.Arrowhead,Rhino.Geometry.Transform,System.Drawing.Color)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawAnnotationArrowhead(
	Arrowhead arrowhead,
	Transform xform,
	Color color
)
Public Sub DrawAnnotationArrowhead (
	arrowhead As Arrowhead,
	xform As Transform,
	color As Color
)
Parameters
arrowhead
Type: Rhino.Geometry.Arrowhead
[Missing <param name="arrowhead"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawAnnotationArrowhead(Rhino.Geometry.Arrowhead,Rhino.Geometry.Transform,System.Drawing.Color)"]
xform
Type: Rhino.Geometry.Transform
[Missing <param name="xform"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawAnnotationArrowhead(Rhino.Geometry.Arrowhead,Rhino.Geometry.Transform,System.Drawing.Color)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawAnnotationArrowhead(Rhino.Geometry.Arrowhead,Rhino.Geometry.Transform,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace