RhinoCommon API
PersistentSettings.GetBool Method (String, Boolean, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetBool(System.String,System.Boolean,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GetBool(
	string key,
	bool defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetBool (
	key As String,
	defaultValue As Boolean,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetBool(System.String,System.Boolean,System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.Boolean
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetBool(System.String,System.Boolean,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetBool(System.String,System.Boolean,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetBool(System.String,System.Boolean,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetBool Overload
Rhino Namespace