RhinoCommon API
MappingTag Constructor
Initializes a new instance of the MappingTag class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MappingTag()
Public Sub New
See Also
Reference
MappingTag Class
Rhino.Render Namespace