RhinoCommon API
LengthValue.Dispose Method
actively reclaim native allocated ON_LengthValue*
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
LengthValue Class
Rhino Namespace