RhinoCommon API
ModelComponent.ModelComponentTypeRequiresUniqueName Method
 Informs the developer if a particular model component type will require uniqueness within a document. This is currently true with render materials and model geometry; false otherwise.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool ModelComponentTypeRequiresUniqueName(
	ModelComponentType type
)
Public Shared Function ModelComponentTypeRequiresUniqueName (
	type As ModelComponentType
) As Boolean
Parameters
type
Type: Rhino.DocObjects.ModelComponentType
The type to check.
Return Value
Type: Boolean
true with render materials and model geometry; false otherwise.
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace