RhinoCommon API
ColorLCH.MakePositive Method
 Ensure the Chromaticity of this color is positive.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void MakePositive()
Public Sub MakePositive
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace