RhinoCommon API
PreviewJobSignature Constructor (Int32, Int32, UInt32, Guid)
Initializes a new instance of the PreviewJobSignature class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PreviewJobSignature(
	int width,
	int height,
	uint sig,
	Guid id
)
Public Sub New (
	width As Integer,
	height As Integer,
	sig As UInteger,
	id As Guid
)
Parameters
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.Render.PreviewJobSignature.#ctor(System.Int32,System.Int32,System.UInt32,System.Guid)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.Render.PreviewJobSignature.#ctor(System.Int32,System.Int32,System.UInt32,System.Guid)"]
sig
Type: System.UInt32
[Missing <param name="sig"/> documentation for "M:Rhino.Render.PreviewJobSignature.#ctor(System.Int32,System.Int32,System.UInt32,System.Guid)"]
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Render.PreviewJobSignature.#ctor(System.Int32,System.Int32,System.UInt32,System.Guid)"]
See Also
Reference
PreviewJobSignature Class
PreviewJobSignature Overload
Rhino.Render Namespace