RhinoCommon API
ViewCaptureWriter.DrawScreenText Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawScreenText(System.String,System.Drawing.Color,System.Double,System.Double,System.Single,System.Int32,System.Single,Rhino.DocObjects.Font)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract void DrawScreenText(
	string text,
	Color textColor,
	double x,
	double y,
	float angle,
	int horizontalAlignment,
	float heightPoints,
	Font font
)
Protected MustOverride Sub DrawScreenText (
	text As String,
	textColor As Color,
	x As Double,
	y As Double,
	angle As Single,
	horizontalAlignment As Integer,
	heightPoints As Single,
	font As Font
)
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawScreenText(System.String,System.Drawing.Color,System.Double,System.Double,System.Single,System.Int32,System.Single,Rhino.DocObjects.Font)"]
textColor
Type: System.Drawing.Color
[Missing <param name="textColor"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawScreenText(System.String,System.Drawing.Color,System.Double,System.Double,System.Single,System.Int32,System.Single,Rhino.DocObjects.Font)"]
x
Type: System.Double
[Missing <param name="x"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawScreenText(System.String,System.Drawing.Color,System.Double,System.Double,System.Single,System.Int32,System.Single,Rhino.DocObjects.Font)"]
y
Type: System.Double
[Missing <param name="y"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawScreenText(System.String,System.Drawing.Color,System.Double,System.Double,System.Single,System.Int32,System.Single,Rhino.DocObjects.Font)"]
angle
Type: System.Single
[Missing <param name="angle"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawScreenText(System.String,System.Drawing.Color,System.Double,System.Double,System.Single,System.Int32,System.Single,Rhino.DocObjects.Font)"]
horizontalAlignment
Type: System.Int32
[Missing <param name="horizontalAlignment"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawScreenText(System.String,System.Drawing.Color,System.Double,System.Double,System.Single,System.Int32,System.Single,Rhino.DocObjects.Font)"]
heightPoints
Type: System.Single
[Missing <param name="heightPoints"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawScreenText(System.String,System.Drawing.Color,System.Double,System.Double,System.Single,System.Int32,System.Single,Rhino.DocObjects.Font)"]
font
Type: Rhino.DocObjects.Font
[Missing <param name="font"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawScreenText(System.String,System.Drawing.Color,System.Double,System.Double,System.Single,System.Int32,System.Single,Rhino.DocObjects.Font)"]
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace