RhinoCommon API
Intersection.MeshCurve Method (Mesh, Curve, Double, Curve[])
 Simpler overload of MeshCurve(Mesh, Curve, Double): returns the Point-event hits (isolated crossings and the endpoints of every overlap span) as a flat Point3d array, and the overlap spans as sub-curves of curve via overlapCurves. Both arrays are ordered by curve parameter.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Point3d[] MeshCurve(
	Mesh mesh,
	Curve curve,
	double tolerance,
	out Curve[] overlapCurves
)
Public Shared Function MeshCurve (
	mesh As Mesh,
	curve As Curve,
	tolerance As Double,
	<OutAttribute> ByRef overlapCurves As Curve()
) As Point3d()
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to intersect.
curve
Type: Rhino.Geometry.Curve
Curve to intersect.
tolerance
Type: System.Double
Numerical tolerance; see the rich overload.
overlapCurves
Type: Rhino.Geometry.Curve[]
Receives one trimmed sub-curve of the input per overlap event (the portion of curve that lies in a face's plane).
Return Value
Type: Point3d[]
One point per Point event — isolated crossings and the endpoints of every overlap span — ordered by curve parameter. Empty on failure or no intersection.
See Also
Reference
Intersection Class
MeshCurve Overload
Rhino.Geometry.Intersect Namespace