RhinoCommon API
SimpleArray2dex Constructor
 Initializes a new SimpleArray2dex class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public SimpleArray2dex()
Public Sub New
See Also
Reference
SimpleArray2dex Class
SimpleArray2dex Overload
Rhino.Runtime.InteropWrappers Namespace