RhinoCommon API
ViewInfo.SetPageSettings Method
 Sets the paper size and margins of this view. Set ViewType to PageView as well, or the page settings are ignored.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public void SetPageSettings(
	PageSettings pageSettings
)
Public Sub SetPageSettings (
	pageSettings As PageSettings
)
Parameters
pageSettings
Type: Rhino.DocObjects.PageSettings
[Missing <param name="pageSettings"/> documentation for "M:Rhino.DocObjects.ViewInfo.SetPageSettings(Rhino.DocObjects.PageSettings)"]
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace