RhinoCommon API
IStackedDialogPageService.NativeHandle Method
 Gets the native window handle associated with the host object if there is one.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
IntPtr NativeHandle(
	Object host
)
Function NativeHandle (
	host As Object
) As IntPtr
Parameters
host
Type: System.Object
[Missing <param name="host"/> documentation for "M:Rhino.UI.IStackedDialogPageService.NativeHandle(System.Object)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.NativeHandle(System.Object)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace