RhinoCommon API
File3dmDimStyleTable.FindName Method
 Finds a DimensionStyle given its name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle FindName(
	string name
)
Public Function FindName (
	name As String
) As DimensionStyle
Parameters
name
Type: System.String
The name of the DimensionStyle to be searched.
Return Value
Type: DimensionStyle
An DimensionStyle, or null on error.
See Also
Reference
File3dmDimStyleTable Class
Rhino.FileIO Namespace