RhinoCommon API
SupportOptions.LibrariesInitialLocation Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.LibrariesInitialLocation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_InitialLocation' instead")]
public static SupportOptions.RdkInitialLocation LibrariesInitialLocation()
<ObsoleteAttribute("Use 'Libraries_InitialLocation' instead")>
Public Shared Function LibrariesInitialLocation As SupportOptions.RdkInitialLocation
Return Value
Type: SupportOptions.RdkInitialLocation
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.LibrariesInitialLocation"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace