RhinoCommon API
RhinoList<T> Constructor
 Initializes a new, empty list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoList()
Public Sub New
See Also
Reference
RhinoList<T> Class
RhinoList<T> Overload
Rhino.Collections Namespace