RhinoCommon API
StringHolder.NonConstPointer Method
 C++ pointer used to access the ON_wString, managed plug-ins should never need this.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public IntPtr NonConstPointer()
Public Function NonConstPointer As IntPtr
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Runtime.InteropWrappers.StringHolder.NonConstPointer"]
See Also
Reference
StringHolder Class
Rhino.Runtime.InteropWrappers Namespace