RhinoCommon API
Material.CopyFrom Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.CopyFrom(Rhino.DocObjects.Material)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void CopyFrom(
	Material other
)
Public Sub CopyFrom (
	other As Material
)
Parameters
other
Type: Rhino.DocObjects.Material
[Missing <param name="other"/> documentation for "M:Rhino.DocObjects.Material.CopyFrom(Rhino.DocObjects.Material)"]
See Also
Reference
Material Class
Rhino.DocObjects Namespace