RhinoCommon API
MeshNgonList.RemoveAllNgons Method
 Removes all ngons from the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.23
Syntax
public int RemoveAllNgons()
Public Function RemoveAllNgons As Integer
Return Value
Type: Int32
The number deleted ngons.
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace