RhinoCommon API
FileDwg.Write Method
Write a DWG file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	FileDwgWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As FileDwgWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileDwgWriteOptions
options used for generating the DWG file
Return Value
Type: Boolean
true on success
See Also
Reference
FileDwg Class
Rhino.FileIO Namespace