RhinoCommon API
PolylineCurve.SetArcLengthParameterization Method
 Sets the polyline curve to use arc length parameterization for higher quality geometry.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetArcLengthParameterization(
	double tolerance
)
Public Sub SetArcLengthParameterization (
	tolerance As Double
)
Parameters
tolerance
Type: System.Double
Minimum distance tolerance.
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace