RhinoCommon API
PostEffect.ReadFromDocumentDefaults Method
Note: This API is now obsolete.
 Because post effects are now in the render settings, this function can no longer be called.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[ObsoleteAttribute("This function is no longer called")]
public virtual bool ReadFromDocumentDefaults(
	RhinoDoc doc
)
<ObsoleteAttribute("This function is no longer called")>
Public Overridable Function ReadFromDocumentDefaults (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.PostEffects.PostEffect.ReadFromDocumentDefaults(Rhino.RhinoDoc)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffect.ReadFromDocumentDefaults(Rhino.RhinoDoc)"]
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace