RhinoCommon API
RenderPrimitiveList.Clear Method
 Remove all primitives from this list
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace