RhinoCommon API
PlugInDescriptionAttribute Constructor
Initializes a new instance of the PlugInDescriptionAttribute class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PlugInDescriptionAttribute(
	DescriptionType descriptionType,
	string value
)
Public Sub New (
	descriptionType As DescriptionType,
	value As String
)
Parameters
descriptionType
Type: Rhino.PlugIns.DescriptionType
[Missing <param name="descriptionType"/> documentation for "M:Rhino.PlugIns.PlugInDescriptionAttribute.#ctor(Rhino.PlugIns.DescriptionType,System.String)"]
value
Type: System.String
[Missing <param name="value"/> documentation for "M:Rhino.PlugIns.PlugInDescriptionAttribute.#ctor(Rhino.PlugIns.DescriptionType,System.String)"]
See Also
Reference
PlugInDescriptionAttribute Class
Rhino.PlugIns Namespace