RhinoCommon API
ChangeQueue.ApplyMeshInstanceChanges Method
 Override this when you want to handle mesh instance changes (block instances and first-time added new meshes)
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplyMeshInstanceChanges(
	List<uint> deleted,
	List<MeshInstance> addedOrChanged
)
Protected Overridable Sub ApplyMeshInstanceChanges (
	deleted As List(Of UInteger),
	addedOrChanged As List(Of MeshInstance)
)
Parameters
deleted
Type: System.Collections.Generic.List<UInt32>
[Missing <param name="deleted"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyMeshInstanceChanges(System.Collections.Generic.List{System.UInt32},System.Collections.Generic.List{Rhino.Render.ChangeQueue.MeshInstance})"]
addedOrChanged
Type: System.Collections.Generic.List<MeshInstance>
[Missing <param name="addedOrChanged"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyMeshInstanceChanges(System.Collections.Generic.List{System.UInt32},System.Collections.Generic.List{Rhino.Render.ChangeQueue.MeshInstance})"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace