RhinoCommon API
UserInterfaceObjectBase.RunCommand Method
 Call RunCommand to have the virtual OnRunCommand function executed in the scope of a Rhino command. If you are modifying the document from one of the mouse functions on this object, this is the best approach to do so since changes made inside of a command are recorded for undo.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void RunCommand(
	MouseState mouse
)
Public Sub RunCommand (
	mouse As MouseState
)
Parameters
mouse
Type: Rhino.UI.MouseState
 Current mouse state. This is handed back to OnRunCommand
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace