RhinoCommon API
PreviewJobSignature.Finalize Method
 Preview Job Signature destructor
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
PreviewJobSignature Class
Rhino.Render Namespace