RhinoCommon API
ArchivableDictionary.TryGetString Method
 Get value as string, will only succeed if value was created using Set(string key, string value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetString(
	string key,
	out string value
)
Public Function TryGetString (
	key As String,
	<OutAttribute> ByRef value As String
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetString(System.String,System.String@)"]
value
Type: System.String
[Missing <param name="value"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetString(System.String,System.String@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetString(System.String,System.String@)"]
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace