RhinoCommon API
RhinoAccountsInvalidTokenException Constructor (String, Exception)
 Generates a new instance of the exception.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RhinoAccountsInvalidTokenException(
	string message,
	Exception innerException = null
)
Public Sub New (
	message As String,
	Optional innerException As Exception = Nothing
)
Parameters
message
Type: System.String
The message of the exception.
innerException (Optional)
Type: System.Exception
The inner exception.
See Also
Reference
RhinoAccountsInvalidTokenException Class
RhinoAccountsInvalidTokenException Overload
Rhino.Runtime.RhinoAccounts Namespace