RhinoCommon API
ICollapsibleSectionHolder.UpdateAllViews Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.UpdateAllViews(System.Int32)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void UpdateAllViews(
	int flags
)
Sub UpdateAllViews (
	flags As Integer
)
Parameters
flags
Type: System.Int32
[Missing <param name="flags"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.UpdateAllViews(System.Int32)"]
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace