RhinoCommon API
NurbsCurvePointList.SetPoint Method (Int32, Double, Double, Double, Double)
 Sets a homogeneous control point at the given index, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SetPoint(
	int index,
	double x,
	double y,
	double z,
	double weight
)
Public Function SetPoint (
	index As Integer,
	x As Double,
	y As Double,
	z As Double,
	weight As Double
) As Boolean
Parameters
index
Type: System.Int32
Index of control point to set.
x
Type: System.Double
X coordinate of control point.
y
Type: System.Double
Y coordinate of control point.
z
Type: System.Double
Z coordinate of control point.
weight
Type: System.Double
Weight of control point.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
 For expert use only. If you do not understand homogeneous coordinates, then use an override that accepts world 3-D, or Euclidean, coordinates as input.
See Also
Reference
NurbsCurvePointList Class
SetPoint Overload
Rhino.Geometry.Collections Namespace