RhinoCommon API
RenderContent.Icon Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.Icon(System.Drawing.Size,System.Drawing.Bitmap@)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool Icon(
	Size size,
	out Bitmap bitmap
)
Public Overridable Function Icon (
	size As Size,
	<OutAttribute> ByRef bitmap As Bitmap
) As Boolean
Parameters
size
Type: System.Drawing.Size
[Missing <param name="size"/> documentation for "M:Rhino.Render.RenderContent.Icon(System.Drawing.Size,System.Drawing.Bitmap@)"]
bitmap
Type: System.Drawing.Bitmap
[Missing <param name="bitmap"/> documentation for "M:Rhino.Render.RenderContent.Icon(System.Drawing.Size,System.Drawing.Bitmap@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.Icon(System.Drawing.Size,System.Drawing.Bitmap@)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace