RhinoCommon API
PointCloud.ExpertGetValues Method
 Expert tool to get all values of a point cloud item. This method minimizes the number of pInvoke function calls.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ExpertGetValues(
	int index,
	out Point3d location,
	out Vector3d normal,
	out Color color,
	out double extra,
	out bool hidden
)
Public Function ExpertGetValues (
	index As Integer,
	<OutAttribute> ByRef location As Point3d,
	<OutAttribute> ByRef normal As Vector3d,
	<OutAttribute> ByRef color As Color,
	<OutAttribute> ByRef extra As Double,
	<OutAttribute> ByRef hidden As Boolean
) As Boolean
Parameters
index
Type: System.Int32
The index of the point cloud item.
location
Type: Rhino.Geometry.Point3d
Output location of the point cloud item.
normal
Type: Rhino.Geometry.Vector3d
Output normal vector of the point cloud item.
color
Type: System.Drawing.Color
Output color of the point cloud item.
extra
Type: System.Double
Extra value of the point cloud item.
hidden
Type: System.Boolean
Output hidden flag of the point cloud item.
Return Value
Type: Boolean
True on success.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace