RhinoCommon API
Transform2d.ToString Method
 Returns a string representation of this transform.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A textual representation.
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace