RhinoCommon API
OpenFileDialog.ShowDialog Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.UI.OpenFileDialog.ShowDialog"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use ShowOpenDialog")]
public DialogResult ShowDialog()
<ObsoleteAttribute("Use ShowOpenDialog")>
Public Function ShowDialog As DialogResult
Return Value
Type: DialogResult
[Missing <returns> documentation for "M:Rhino.UI.OpenFileDialog.ShowDialog"]
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace