RhinoCommon API
Mesh.InvalidateCachedTextureCoordinates Method
 Invalidates all cached texture coordinates. Call this function when you have made changes that will affect the texture coordinates on the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void InvalidateCachedTextureCoordinates(
	bool bOnlyInvalidateCachedSurfaceParameterMapping = false
)
Public Sub InvalidateCachedTextureCoordinates (
	Optional bOnlyInvalidateCachedSurfaceParameterMapping As Boolean = false
)
Parameters
bOnlyInvalidateCachedSurfaceParameterMapping (Optional)
Type: System.Boolean
 If true then only cached surface parameter mapping texture coordinates will be invalidated. Use this after making changes to the m_S array.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace