RhinoCommon API
SubDVertex.SurfacePoint Method
 The SubD surface point
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Point3d SurfacePoint()
Public Function SurfacePoint As Point3d
Return Value
Type: Point3d
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertex.SurfacePoint"]
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace
SubD.SetVertexSurfacePoint(UInt32, Point3d)
SubD.InterpolateSurfacePoints(Point3d[])
SubD.InterpolateSurfacePoints(UInt32[], Point3d[])
Rhino.Geometry.SubDSurfaceInterpolator
SubD.UpdateSurfaceMeshCache(Boolean)