RhinoCommon API
FreeFloatingBase.Finalize Method
 Handle destruction of the un-managed CPP object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
FreeFloatingBase Class
Rhino.Render Namespace