RhinoCommon API
MeshingParameters Constructor
 Initializes a new instance with default values.
Initial values are same as Default.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public MeshingParameters()
Public Sub New
See Also
Reference
MeshingParameters Class
MeshingParameters Overload
Rhino.Geometry Namespace