RhinoCommon API
GripObject.GetCurveCVIndices Method
 Retrieves the NURBS curve control point indices of this GripObject from the curve it is associated with.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public int GetCurveCVIndices(
	out int[] cvIndices
)
Public Function GetCurveCVIndices (
	<OutAttribute> ByRef cvIndices As Integer()
) As Integer
Parameters
cvIndices
Type: System.Int32[]
The NURBS curve control point indices.
Return Value
Type: Int32
 The number of NURBS curve control points managed by this grip. If the grip is not a curve control point, zero is returned.
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace