RhinoCommon API
GetTorus.GetMesh Method
 Prompt for the getting of a mesh torus.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Result GetMesh(
	ref int verticalFaces,
	ref int aroundFaces,
	out Torus torus
)
Public Function GetMesh (
	ByRef verticalFaces As Integer,
	ByRef aroundFaces As Integer,
	<OutAttribute> ByRef torus As Torus
) As Result
Parameters
verticalFaces
Type: System.Int32
The number of faces in the vertical direction.
aroundFaces
Type: System.Int32
The number of faces in the around direction
torus
Type: Rhino.Geometry.Torus
The torus geometry defined by the user.
Return Value
Type: Result
The result of the getting operation.
See Also
Reference
GetTorus Class
Rhino.Input.Custom Namespace