RhinoCommon API
RenderMeshes.AddInstance Method
 Adds a new instance to the render primitives collection.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void AddInstance(
	Instance instance
)
Public Sub AddInstance (
	instance As Instance
)
Parameters
instance
Type: Rhino.Render.CustomRenderMeshes.Instance
The instance to be added.
See Also
Reference
RenderMeshes Class
Rhino.Render.CustomRenderMeshes Namespace