RhinoCommon API
HatchPattern.ReadFromFile Method
 Reads hatch pattern definitions from a file.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static HatchPattern[] ReadFromFile(
	string filename,
	bool quiet
)
Public Shared Function ReadFromFile (
	filename As String,
	quiet As Boolean
) As HatchPattern()
Parameters
filename
Type: System.String
 Name of an existing file. If filename is null or empty, default hatch pattern filename is used.
quiet
Type: System.Boolean
 Ignored.
Return Value
Type: HatchPattern[]
An array of hatch patterns. This can be null, but not empty.
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace