RhinoCommon API
IRhinoAccountsManager.GetAuthTokensAsync Method (String, String, IEnumerable<String>, String, Nullable<Int32>, Boolean, IProgress<RhinoAccoountsProgressInfo>, SecretKey, CancellationToken)
 Asynchronously retrieves auth tokens with the given criteria from the Rhino Accounts server.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Task<Tuple<IOpenIDConnectToken, IOAuth2Token>> GetAuthTokensAsync(
	string clientId,
	string clientSecret,
	IEnumerable<string> scope,
	string prompt,
	int? maxAge,
	bool showUI,
	IProgress<RhinoAccoountsProgressInfo> progress,
	SecretKey secretKey,
	CancellationToken cancellationToken
)
Function GetAuthTokensAsync (
	clientId As String,
	clientSecret As String,
	scope As IEnumerable(Of String),
	prompt As String,
	maxAge As Integer?,
	showUI As Boolean,
	progress As IProgress(Of RhinoAccoountsProgressInfo),
	secretKey As SecretKey,
	cancellationToken As CancellationToken
) As Task(Of Tuple(Of IOpenIDConnectToken, IOAuth2Token))
Parameters
clientId
Type: System.String
The unique id of the client registered in Rhino Accounts.
clientSecret
Type: System.String
The secret of the client registered in Rhino Accounts
scope
Type: System.Collections.Generic.IEnumerable<String>
The scope desired for the tokens. Valid scope values can be found in the Rhino Accounts documentation.
prompt
Type: System.String
The prompt of the request. See Rhino Accounts documentation for details. You may pass null if no prompt is desired.
maxAge
Type: System.Nullable<Int32>
The maxAge of the request. See Rhino Accounts documentation for details. You may pass null if no maxAge should be enforced.
showUI
Type: System.Boolean
true if the user should see a UI showing the progress of the operation and a way to cancel it, or false if the UI should not be displayed. If false, it is strongly recommended that you pass a progress object and display your own UI to the user.
progress
Type: System.IProgress<RhinoAccoountsProgressInfo>
An object that will report the progress of the operation to the caller. If no progress is needed, you may pass null.
secretKey
Type: Rhino.Runtime.RhinoAccounts.SecretKey
A special key that was handed to you in ExecuteProtectedCodeAsync(Func<SecretKey, Task>)
cancellationToken
Type: System.Threading.CancellationToken
A token that can be used to signal that the operation should be cancelled.
Return Value
Type: Task<Tuple<IOpenIDConnectToken, IOAuth2Token>>
The auth tokens requested.
Exceptions
Exception | Condition
InvalidOperationException | An invalid secretKey was passed, or the assembly is not allowed to call methods from IRhinoAccountsManager
RhinoAccountsException | An error occurred during the authentication process. You may look at the specific subclass of the exception gain more insight as to why the operation failed.
OperationCanceledException | The operation was cancelled, either by internal decisions or because the cancellationToken was cancelled.
See Also
Reference
IRhinoAccountsManager Interface
GetAuthTokensAsync Overload
Rhino.Runtime.RhinoAccounts Namespace