RhinoCommon API
WorksessionFile.ClearModels Method
Removes all of the models.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void ClearModels()
Public Sub ClearModels
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace