RhinoCommon API
RhinoList<T>.Clear Method
 Removes all elements from the List.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
IList.Clear()
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace