RhinoCommon API
RhinoObject.TryGetGumballFrame Method
 If a Rhino object has been manipulated by Rhino's gumball, and the gumball is not in its default position, then the object's repositioned gumball frame is returned.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool TryGetGumballFrame(
	out GumballFrame frame
)
Public Function TryGetGumballFrame (
	<OutAttribute> ByRef frame As GumballFrame
) As Boolean
Parameters
frame
Type: Rhino.UI.Gumball.GumballFrame
The gumball frame.
Return Value
Type: Boolean
true if the object has a gumball frame, otherwise false.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace