RhinoCommon API
File3dmInstanceDefinitionTable.FindNameHash Method
 Finds a InstanceDefinitionGeometry given its name hash.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public InstanceDefinitionGeometry FindNameHash(
	NameHash nameHash
)
Public Function FindNameHash (
	nameHash As NameHash
) As InstanceDefinitionGeometry
Parameters
nameHash
Type: Rhino.FileIO.NameHash
The name hash of the InstanceDefinitionGeometry to be searched.
Return Value
Type: InstanceDefinitionGeometry
An InstanceDefinitionGeometry, or null on error.
See Also
Reference
File3dmInstanceDefinitionTable Class
Rhino.FileIO Namespace