RhinoCommon API
Brep.SetVertices Method
 This function can be used to compute vertex information for a b-rep when everything but the Vertices array is properly filled in. It is intended to be used when creating a Brep from a definition that does not include explicit vertex information.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public void SetVertices()
Public Sub SetVertices
See Also
Reference
Brep Class
Rhino.Geometry Namespace