RhinoCommon API
RenderPlugIn.RegisterCustomRenderSaveFileTypes Method
 Override this method to add custom file types to the render window save file dialog.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void RegisterCustomRenderSaveFileTypes(
	CustomRenderSaveFileTypes saveFileTypes
)
Protected Overridable Sub RegisterCustomRenderSaveFileTypes (
	saveFileTypes As CustomRenderSaveFileTypes
)
Parameters
saveFileTypes
Type: Rhino.PlugIns.CustomRenderSaveFileTypes
[Missing <param name="saveFileTypes"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.RegisterCustomRenderSaveFileTypes(Rhino.PlugIns.CustomRenderSaveFileTypes)"]
Return Value
Type:
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace