RhinoCommon API
Brep.DuplicateNakedEdgeCurves Method
 Duplicate naked edges of this Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public Curve[] DuplicateNakedEdgeCurves(
	bool nakedOuter,
	bool nakedInner
)
Public Function DuplicateNakedEdgeCurves (
	nakedOuter As Boolean,
	nakedInner As Boolean
) As Curve()
Parameters
nakedOuter
Type: System.Boolean
Return naked edges that are part of an outer loop.
nakedInner
Type: System.Boolean
Return naked edges that are part of an inner loop.
Return Value
Type: Curve[]
Array of edge curves on success.
See Also
Reference
Brep Class
Rhino.Geometry Namespace