RhinoCommon API
InstanceDefinition.UsesLinetype Method
 Returns true if some object in the instance definition references the linetype with the specified linetype index.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public bool UsesLinetype(
	int linetypeIndex
)
Public Function UsesLinetype (
	linetypeIndex As Integer
) As Boolean
Parameters
linetypeIndex
Type: System.Int32
The index of linetype to search for.
Return Value
Type: Boolean
True if there is an object in the instance definition that references that linetype.
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace