RhinoCommon API
Curve.Split Method (Plane, Double, Double)
 Splits a curve into pieces using a cutting plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Curve[] Split(
	Plane plane,
	double tolerance,
	double angleToleranceRadians
)
Public Function Split (
	plane As Plane,
	tolerance As Double,
	angleToleranceRadians As Double
) As Curve()
Parameters
plane
Type: Rhino.Geometry.Plane
A cutting plane.
tolerance
Type: System.Double
Tolerance for computing intersections.
angleToleranceRadians
Type: System.Double
Angle tolerance in radians.
Return Value
Type: Curve[]
An array of curves. This array can be empty.
See Also
Reference
Curve Class
Split Overload
Rhino.Geometry Namespace