RhinoCommon API
TextFields.DetailScale Method
 Returns a detail views scale
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string DetailScale(
	string detailId,
	string scaleFormat
)
Public Shared Function DetailScale (
	detailId As String,
	scaleFormat As String
) As String
Parameters
detailId
Type: System.String
[Missing <param name="detailId"/> documentation for "M:Rhino.Runtime.TextFields.DetailScale(System.String,System.String)"]
scaleFormat
Type: System.String
[Missing <param name="scaleFormat"/> documentation for "M:Rhino.Runtime.TextFields.DetailScale(System.String,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.DetailScale(System.String,System.String)"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace