RhinoCommon API
HatchPatternTable.Delete Method (HatchPattern)
 Deletes a hatch pattern from the table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override bool Delete(
	HatchPattern item
)
Public Overrides Function Delete (
	item As HatchPattern
) As Boolean
Parameters
item
Type: Rhino.DocObjects.HatchPattern
The hatch pattern to delete.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
HatchPatternTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace