RhinoCommon API
RealtimeDisplayMode.HudProductName Method
 Override to return the name of your product. This will be printed in the HUD.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual string HudProductName()
Public Overridable Function HudProductName As String
Return Value
Type: String
Name of the product.
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace