RhinoCommon API
InstanceDefinitionTable.Modify Method (Int32, UserData, Boolean)
 Modifies the instance definition user data. Does not change instance definition ID or geometry.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public bool Modify(
	int idefIndex,
	UserData userData,
	bool quiet
)
Public Function Modify (
	idefIndex As Integer,
	userData As UserData,
	quiet As Boolean
) As Boolean
Parameters
idefIndex
Type: System.Int32
The index of the instance definition to be modified.
userData
Type: Rhino.DocObjects.Custom.UserData
The user data to replace.
quiet
Type: System.Boolean
 If false, information message boxes pop up when illegal changes are attempted.
Return Value
Type: Boolean
 true if successful.
See Also
Reference
InstanceDefinitionTable Class
Modify Overload
Rhino.DocObjects.Tables Namespace