RhinoCommon API
HatchPattern.HatchLineAt Method
 Gets a HatchLine at an index.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public HatchLine HatchLineAt(
	int hatchLineIndex
)
Public Function HatchLineAt (
	hatchLineIndex As Integer
) As HatchLine
Parameters
hatchLineIndex
Type: System.Int32
The index of the hatch line.
Return Value
Type: HatchLine
The hatch line, or null on failure.
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace