RhinoCommon API
Analytics.Send Method (String)
 Sends a Google Analytics event using the Measurement Protocol. See https://developers.google.com/analytics/devguides/collection/protocol/v1/devguide#event for details.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Send(
	string Category
)
Public Sub Send (
	Category As String
)
Parameters
Category
Type: System.String
Event category. We use the feature or subsystem, such as "installer" or "app" or "document" or "loft". Maps to the Google Analytics parameter "ec".
See Also
Reference
Analytics Class
Send Overload
Rhino.Runtime Namespace