RhinoCommon API
SubDCreationOptions.Finalize Method
 Finalizer
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace