RhinoCommon API
BezierCurve.GetBoundingBox Method
 Bounding box solver. Gets the world axis aligned bounding box for the curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox GetBoundingBox(
	bool accurate
)
Public Function GetBoundingBox (
	accurate As Boolean
) As BoundingBox
Parameters
accurate
Type: System.Boolean
If true, a physically accurate bounding box will be computed. If not, a bounding box estimate will be computed. For some geometry types there is no difference between the estimate and the accurate bounding box. Estimated bounding boxes can be computed much (much) faster than accurate (or "tight") bounding boxes. Estimated bounding boxes are always similar to or larger than accurate bounding boxes.
Return Value
Type: BoundingBox
 The bounding box of the geometry in world coordinates or BoundingBox.Empty if not bounding box could be found.
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace