RhinoCommon API
GetCone.GetMesh Method (Int32, Int32, Cone)
 Prompt for the getting of a mesh cone.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Result GetMesh(
	ref int verticalFaces,
	ref int aroundFaces,
	out Cone cone
)
Public Function GetMesh (
	ByRef verticalFaces As Integer,
	ByRef aroundFaces As Integer,
	<OutAttribute> ByRef cone As Cone
) As Result
Parameters
verticalFaces
Type: System.Int32
The number of faces in the vertical direction.
aroundFaces
Type: System.Int32
The number of faces in the around direction
cone
Type: Rhino.Geometry.Cone
The cone geometry defined by the user.
Return Value
Type: Result
The result of the getting operation.
See Also
Reference
GetCone Class
GetMesh Overload
Rhino.Input.Custom Namespace