RhinoCommon API
NurbsCurvePointList.Contains Method
 Determines if this list contains an item.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Contains(
	ControlPoint item
)
Public Function Contains (
	item As ControlPoint
) As Boolean
Parameters
item
Type: Rhino.Geometry.ControlPoint
The exact item to search for.
Return Value
Type: Boolean
A boolean value.
Implements
ICollection<T>.Contains(T)
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace