RhinoCommon API
HostUtils.GetAssemblySearchPaths Method
 Returns list of directory names where additional assemblies (plug-ins, DLLs, Grasshopper components) may be located
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string[] GetAssemblySearchPaths()
Public Shared Function GetAssemblySearchPaths As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.GetAssemblySearchPaths"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace