RhinoCommon API
FileSettings.AutoSaveBeforeCommands Method
Input list of commands that force AutoSave prior to running.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string[] AutoSaveBeforeCommands()
Public Shared Function AutoSaveBeforeCommands As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.FileSettings.AutoSaveBeforeCommands"]
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace