RhinoCommon API
NamedParametersEventArgs.Set Method (String, String)
 Set a string value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Set(
	string name,
	string value
)
Public Sub Set (
	name As String,
	value As String
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.String)"]
value
Type: System.String
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.String)"]
See Also
Reference
NamedParametersEventArgs Class
Set Overload
Rhino.Runtime Namespace