RhinoCommon API
PageViewGroupTable.Modify Method (PageViewGroup, Int32, Boolean)
 Modifies a page view group.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Modify(
	PageViewGroup newSettings,
	int index,
	bool quiet
)
Public Function Modify (
	newSettings As PageViewGroup,
	index As Integer,
	quiet As Boolean
) As Boolean
Parameters
newSettings
Type: Rhino.DocObjects.PageViewGroup
The modified page view group.
index
Type: System.Int32
Zero-based index of page view group to modify.
quiet
Type: System.Boolean
true to disable any warning or error messages.
Return Value
Type: Boolean
>true if successful, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException | If newSetting is null.
See Also
Reference
PageViewGroupTable Class
Modify Overload
Rhino.DocObjects.Tables Namespace