RhinoCommon API
InstanceDefinitionGeometry.GetObjectIds Method
 Returns the unique identifiers of all objects that are part of this instance definition's geometry table.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public Guid[] GetObjectIds()
Public Function GetObjectIds As Guid()
Return Value
Type: Guid[]
An array of Guid values representing the object IDs in the instance geometry table.
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace