RhinoCommon API
RenderWindow.ChannelGPU.Width Method
 Return the channel width.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int Width()
Public Function Width As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.Width"]
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace