RhinoCommon API
ViewCaptureWriter.Pen Constructor
Initializes a new instance of the ViewCaptureWriter.Pen class
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Pen()
Public Sub New
See Also
Reference
ViewCaptureWriter.Pen Class
Rhino.Runtime Namespace