RhinoCommon API
IStackedDialogPageService.SetNativeParent Method
 Sets the parent on a host returned from GetNativePageWindow
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
bool SetNativeParent(
	IntPtr hwndParent,
	Object host
)
Function SetNativeParent (
	hwndParent As IntPtr,
	host As Object
) As Boolean
Parameters
hwndParent
Type: System.IntPtr
[Missing <param name="hwndParent"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SetNativeParent(System.IntPtr,System.Object)"]
host
Type: System.Object
[Missing <param name="host"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SetNativeParent(System.IntPtr,System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.SetNativeParent(System.IntPtr,System.Object)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace