RhinoCommon API
WorksessionFileLayerOverride.Finalize Method
Releases the native layer override.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
WorksessionFileLayerOverride Class
Rhino.FileIO Namespace