RhinoCommon API
Brep.CreateFromTorus Method
 Constructs a Brep definition of a torus.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.1
Syntax
public static Brep CreateFromTorus(
	Torus torus
)
Public Shared Function CreateFromTorus (
	torus As Torus
) As Brep
Parameters
torus
Type: Rhino.Geometry.Torus
The torus.
Return Value
Type: Brep
A Brep representation of the torus if successful, null otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace