RhinoCommon API
IShrinkWrapService.ShrinkWrap Method (IEnumerable<Mesh>, ShrinkWrapParameters, CancellationToken)
 Create mesh from input meshes. Null on error or incompatible settings
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
Mesh ShrinkWrap(
	IEnumerable<Mesh> meshes,
	ShrinkWrapParameters parameters,
	CancellationToken cancellationToken
)
Function ShrinkWrap (
	meshes As IEnumerable(Of Mesh),
	parameters As ShrinkWrapParameters,
	cancellationToken As CancellationToken
) As Mesh
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
[Missing <param name="meshes"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
parameters
Type: Rhino.Geometry.ShrinkWrapParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
cancellationToken
Type: System.Threading.CancellationToken
[Missing <param name="cancellationToken"/> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)"]
See Also
Reference
IShrinkWrapService Interface
ShrinkWrap Overload
Rhino.Runtime Namespace