RhinoCommon API
Interop.FromOnSurface Method
 Copies a Rhino_DotNet surface to a RhinoCommon Surface class.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Surface FromOnSurface(
	Object source
)
Public Shared Function FromOnSurface (
	source As Object
) As Surface
Parameters
source
Type: System.Object
 Any of the following in the RMA.OpenNURBS namespace are acceptable. IOnSurface, OnSurface, IOnPlaneSurface, OnPlaneSurface, IOnClippingPlaneSurface, OnClippingPlaneSurface, IOnNurbsSurface, OnNurbsSurfac, IOnRevSurface, OnRevSurface, IOnSumSurface, OnSumSurface.
Return Value
Type: Surface
 RhinoCommon object on success. This will be an independent copy.
See Also
Reference
Interop Class
Rhino.Runtime Namespace