RhinoCommon API
RdkModalEditContentBucket.SetContentsOut Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RdkModalEditContentBucket.SetContentsOut(Rhino.Render.RenderContentCollection)"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public void SetContentsOut(
	RenderContentCollection collection
)
Public Sub SetContentsOut (
	collection As RenderContentCollection
)
Parameters
collection
Type: Rhino.Render.RenderContentCollection
[Missing <param name="collection"/> documentation for "M:Rhino.Render.DataSources.RdkModalEditContentBucket.SetContentsOut(Rhino.Render.RenderContentCollection)"]
See Also
Reference
RdkModalEditContentBucket Class
Rhino.Render.DataSources Namespace