RhinoCommon API
SimpleArrayIntPtr.ToArray Method
 Returns the managed counterpart of the unmanaged array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IntPtr[] ToArray()
Public Function ToArray As IntPtr()
Return Value
Type: IntPtr[]
The managed array.
See Also
Reference
SimpleArrayIntPtr Class
Rhino.Runtime.InteropWrappers Namespace