RhinoCommon API
GumballSettings.RestoreDefaults Method
 Commits the default settings as the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void RestoreDefaults()
Public Shared Sub RestoreDefaults
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace