RhinoCommon API
GetBaseClass.Result Method
Returns result of the Get*() call.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GetResult Result()
Public Function Result As GetResult
Return Value
Type: GetResult
The result of the last Get*() call.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace