RhinoCommon API
Vector2f.Add Method (Point2f, Vector2f)
 Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static Point2f Add(
	Point2f point,
	Vector2f vector
)
Public Shared Function Add (
	point As Point2f,
	vector As Vector2f
) As Point2f
Parameters
point
Type: Rhino.Geometry.Point2f
A point.
vector
Type: Rhino.Geometry.Vector2f
A vector.
Return Value
Type: Point2f
A new point that results from the addition of point and vector.
See Also
Reference
Vector2f Structure
Add Overload
Rhino.Geometry Namespace