RhinoCommon API
PersistentSettings.GetDouble Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetDouble(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double GetDouble(
	string key
)
Public Function GetDouble (
	key As String
) As Double
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetDouble(System.String)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetDouble(System.String)"]
See Also
Reference
PersistentSettings Class
GetDouble Overload
Rhino Namespace