RhinoCommon API
Transform.ToFloatArray Method
 Return the matrix as a linear array of 16 float values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public float[] ToFloatArray(
	bool rowDominant
)
Public Function ToFloatArray (
	rowDominant As Boolean
) As Single()
Parameters
rowDominant
Type: System.Boolean
 If true, returns { M00, M01, M02...}. If false, returns { M00, M10, M20...}.
Return Value
Type: Single[]
An array of 16 floats.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace