RhinoCommon API
NurbsCurvePointList.SetPoint Method (Int32, Point4d)
 Sets a homogeneous control point at the given index, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SetPoint(
	int index,
	Point4d point
)
Public Function SetPoint (
	index As Integer,
	point As Point4d
) As Boolean
Parameters
index
Type: System.Int32
Index of control point to set.
point
Type: Rhino.Geometry.Point4d
Coordinate and weight of control point.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
 For expert use only. If you do not understand homogeneous coordinates, then use an override that accepts world 3-D, or Euclidean, coordinates as input.
See Also
Reference
NurbsCurvePointList Class
SetPoint Overload
Rhino.Geometry.Collections Namespace