RhinoCommon API
IHeaderButtonHandler.OnButtonClicked Method
 Implement this method to handle a button click.
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
bool OnButtonClicked(
	int index
)
Function OnButtonClicked (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
index is the index of the button that was clicked
Return Value
Type: Boolean
\e true if handled successfully, else \e false.
See Also
Reference
IHeaderButtonHandler Interface
Rhino.UI.Controls Namespace