RhinoCommon API
RhinoObject.GetTightBoundingBox Method (IEnumerable<RhinoObject>, Plane, BoundingBox)
 Gets a plane aligned tight bounding box from a collection of Rhino objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool GetTightBoundingBox(
	IEnumerable<RhinoObject> rhinoObjects,
	Plane plane,
	out BoundingBox boundingBox
)
Public Shared Function GetTightBoundingBox (
	rhinoObjects As IEnumerable(Of RhinoObject),
	plane As Plane,
	<OutAttribute> ByRef boundingBox As BoundingBox
) As Boolean
Parameters
rhinoObjects
Type: System.Collections.Generic.IEnumerable<RhinoObject>
A collection of Rhino objects.
plane
Type: Rhino.Geometry.Plane
A valid alignment plane.
boundingBox
Type: Rhino.Geometry.BoundingBox
A tight bounding box.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.GetTightBoundingBox(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.Plane,Rhino.Geometry.BoundingBox@)"]
See Also
Reference
RhinoObject Class
GetTightBoundingBox Overload
Rhino.DocObjects Namespace