RhinoCommon API
RhinoApp.Write Method (String)
Print formatted text in the command window.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void Write(
	string message
)
Public Shared Sub Write (
	message As String
)
Parameters
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.RhinoApp.Write(System.String)"]
See Also
Reference
RhinoApp Class
Write Overload
Rhino Namespace