RhinoCommon API
SafeFrame.Dispose Method
Releases all resources used by the SafeFrame
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SafeFrame Class
Rhino.Render Namespace