RhinoCommon API
Skylight Constructor
 Create a utility object not associated with any document
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Skylight()
Public Sub New
See Also
Reference
Skylight Class
Skylight Overload
Rhino.Render Namespace