RhinoCommon API
UndoRecordEntry.ToString Method
 Returns Description.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UndoRecordEntry.ToString"]
See Also
Reference
UndoRecordEntry Class
Rhino Namespace