RhinoCommon API
MappingTag.CompareTo Method
 Compares this mapping tag with another mapping tag.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int CompareTo(
	MappingTag other
)
Public Function CompareTo (
	other As MappingTag
) As Integer
Parameters
other
Type: Rhino.Render.MappingTag
[Missing <param name="other"/> documentation for "M:Rhino.Render.MappingTag.CompareTo(Rhino.Render.MappingTag)"]
Return Value
Type: Int32
-1 if this < other; 0 if both are equal; 1 otherwise.
See Also
Reference
MappingTag Class
Rhino.Render Namespace