RhinoCommon API
Brep.MergeSurfaces Method (Surface, Surface, Double, Double)
 Merges two surfaces into one surface at untrimmed edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep MergeSurfaces(
	Surface surface0,
	Surface surface1,
	double tolerance,
	double angleToleranceRadians
)
Public Shared Function MergeSurfaces (
	surface0 As Surface,
	surface1 As Surface,
	tolerance As Double,
	angleToleranceRadians As Double
) As Brep
Parameters
surface0
Type: Rhino.Geometry.Surface
The first surface to merge.
surface1
Type: Rhino.Geometry.Surface
The second surface to merge.
tolerance
Type: System.Double
Surface edges must be within this tolerance for the two surfaces to merge.
angleToleranceRadians
Type: System.Double
Edge must be within this angle tolerance in order for contiguous edges to be combined into a single edge.
Return Value
Type: Brep
The merged surfaces as a Brep if successful, null if not successful.
See Also
Reference
Brep Class
MergeSurfaces Overload
Rhino.Geometry Namespace