RhinoCommon API
IDialogService.ShowColorDialog Method
[Missing <summary> documentation for "M:Rhino.UI.IDialogService.ShowColorDialog(System.Object,Rhino.Display.Color4f@,System.Boolean,Rhino.UI.Dialogs.OnColorChangedEvent)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
bool ShowColorDialog(
	Object parent,
	ref Color4f color,
	bool allowAlpha,
	Dialogs.OnColorChangedEvent colorCallback
)
Function ShowColorDialog (
	parent As Object,
	ByRef color As Color4f,
	allowAlpha As Boolean,
	colorCallback As Dialogs.OnColorChangedEvent
) As Boolean
Parameters
parent
Type: System.Object
[Missing <param name="parent"/> documentation for "M:Rhino.UI.IDialogService.ShowColorDialog(System.Object,Rhino.Display.Color4f@,System.Boolean,Rhino.UI.Dialogs.OnColorChangedEvent)"]
color
Type: Rhino.Display.Color4f
[Missing <param name="color"/> documentation for "M:Rhino.UI.IDialogService.ShowColorDialog(System.Object,Rhino.Display.Color4f@,System.Boolean,Rhino.UI.Dialogs.OnColorChangedEvent)"]
allowAlpha
Type: System.Boolean
[Missing <param name="allowAlpha"/> documentation for "M:Rhino.UI.IDialogService.ShowColorDialog(System.Object,Rhino.Display.Color4f@,System.Boolean,Rhino.UI.Dialogs.OnColorChangedEvent)"]
colorCallback
Type: Rhino.UI.Dialogs.OnColorChangedEvent
[Missing <param name="colorCallback"/> documentation for "M:Rhino.UI.IDialogService.ShowColorDialog(System.Object,Rhino.Display.Color4f@,System.Boolean,Rhino.UI.Dialogs.OnColorChangedEvent)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IDialogService.ShowColorDialog(System.Object,Rhino.Display.Color4f@,System.Boolean,Rhino.UI.Dialogs.OnColorChangedEvent)"]
See Also
Reference
IDialogService Interface
Rhino.UI Namespace