RhinoCommon API
Sphere.LatitudeDegrees Method
 Computes the parallel at a specific latitude angle.
The angle is specified in degrees.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Circle LatitudeDegrees(
	double degrees
)
Public Function LatitudeDegrees (
	degrees As Double
) As Circle
Parameters
degrees
Type: System.Double
An angle in degrees for the meridian.
Return Value
Type: Circle
A circle.
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace