RhinoCommon API
BinaryArchiveFile.Close Method
[Missing <summary> documentation for "M:Rhino.FileIO.BinaryArchiveFile.Close"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public void Close()
Public Sub Close
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace