RhinoCommon API
Interop.RhinoObjectFromPointer Method
 Constructs a RhinoCommon Rhino object from an unmanaged C++ RhinoObject pointer.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static RhinoObject RhinoObjectFromPointer(
	IntPtr pRhinoObject
)
Public Shared Function RhinoObjectFromPointer (
	pRhinoObject As IntPtr
) As RhinoObject
Parameters
pRhinoObject
Type: System.IntPtr
The original pointer.
Return Value
Type: RhinoObject
A new Rhino object, or null if the pointer was invalid or Zero.
See Also
Reference
Interop Class
Rhino.Runtime Namespace