RhinoCommon API
RenderContentCollection.Clear Method
 Clear the collection.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace