RhinoCommon API
ZooClientParameters.VerifyPreviousVersionLicense Method
 When a caller calls GetLicense, ZooClient may call VerifyPreviousVersionLicense to ensure previousVersionLicense is legitimate and can be used to upgrade license.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool VerifyPreviousVersionLicense(
	string license,
	string previousVersionLicense,
	out string errorMessage
)
Public Function VerifyPreviousVersionLicense (
	license As String,
	previousVersionLicense As String,
	<OutAttribute> ByRef errorMessage As String
) As Boolean
Parameters
license
Type: System.String
License key for current product. This was returned by a previous call to VerifyLicenseKey or ValidateProductKey.
previousVersionLicense
Type: System.String
License key entered by user to show upgrade eligibility for license.
errorMessage
Type: System.String
Error message to be displayed to user if something isn't correct.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.ZooClientParameters.VerifyPreviousVersionLicense(System.String,System.String,System.String@)"]
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace