RhinoCommon API
PersistentSettings.GetBool Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetBool(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool GetBool(
	string key
)
Public Function GetBool (
	key As String
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetBool(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetBool(System.String)"]
See Also
Reference
PersistentSettings Class
GetBool Overload
Rhino Namespace