RhinoCommon API
Extrusion.SetMesh Method
 Sets a specified type of mesh for this extrusion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public bool SetMesh(
	Mesh mesh,
	MeshType meshType
)
Public Function SetMesh (
	mesh As Mesh,
	meshType As MeshType
) As Boolean
Parameters
mesh
Type: Rhino.Geometry.Mesh
The mesh.
meshType
Type: Rhino.Geometry.MeshType
The mesh type.
Return Value
Type: Boolean
True on success.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace