RhinoCommon API
Surface.IsoCurve Method (IsoStatus)
 Gets isoparametric curve that corresponds to one of the four surface edges. Other IsoStatus values are not supported.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Curve IsoCurve(
	IsoStatus iso
)
Public Function IsoCurve (
	iso As IsoStatus
) As Curve
Parameters
iso
Type: Rhino.Geometry.IsoStatus
North returns the curve where U varies and V is V_max East returns the curve where V varies and U is U_max South returns the curve where U varies and V is V_min West returns the curve where V varies and U is U_min
Return Value
Type: Curve
An isoparametric curve or null on error.
See Also
Reference
Surface Class
IsoCurve Overload
Rhino.Geometry Namespace