RhinoCommon API
UserInterfaceObjectBase.OnMouseEnter Method
 Called when the mouse goes over this object
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnMouseEnter(
	MouseState mouse
)
Protected Overridable Sub OnMouseEnter (
	mouse As MouseState
)
Parameters
mouse
Type: Rhino.UI.MouseState
[Missing <param name="mouse"/> documentation for "M:Rhino.UI.UserInterfaceObjectBase.OnMouseEnter(Rhino.UI.MouseState)"]
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace