RhinoCommon API
LightObject.DuplicateLightGeometry Method
[Missing <summary> documentation for "M:Rhino.DocObjects.LightObject.DuplicateLightGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Light DuplicateLightGeometry()
Public Function DuplicateLightGeometry As Light
Return Value
Type: Light
[Missing <returns> documentation for "M:Rhino.DocObjects.LightObject.DuplicateLightGeometry"]
See Also
Reference
LightObject Class
Rhino.DocObjects Namespace