RhinoCommon API
ArchivableDictionary.GetDictionary Method (String, ArchivableDictionary)
 Get value as ArchivableDictionary, will return defaultValue unless value was created using Set(string key, ArchivableDictionary value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public ArchivableDictionary GetDictionary(
	string key,
	ArchivableDictionary defaultValue
)
Public Function GetDictionary (
	key As String,
	defaultValue As ArchivableDictionary
) As ArchivableDictionary
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetDictionary(System.String,Rhino.Collections.ArchivableDictionary)"]
defaultValue
Type: Rhino.Collections.ArchivableDictionary
[Missing <param name="defaultValue"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetDictionary(System.String,Rhino.Collections.ArchivableDictionary)"]
Return Value
Type: ArchivableDictionary
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetDictionary(System.String,Rhino.Collections.ArchivableDictionary)"]
See Also
Reference
ArchivableDictionary Class
GetDictionary Overload
Rhino.Collections Namespace