RhinoCommon API
PythonScript.Create Method
 Constructs a new Python script context.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static PythonScript Create()
Public Shared Function Create As PythonScript
Return Value
Type: PythonScript
A new Python script, or null if none could be created. Rhino 4 always returns null.
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace