RhinoCommon API
InstanceDefinition.CreatePreviewBitmap Method (DefinedViewportProjection, DisplayMode, Size)
 Creates a preview bitmap of the instance definition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Bitmap CreatePreviewBitmap(
	DefinedViewportProjection definedViewportProjection,
	DisplayMode displayMode,
	Size bitmapSize
)
Public Function CreatePreviewBitmap (
	definedViewportProjection As DefinedViewportProjection,
	displayMode As DisplayMode,
	bitmapSize As Size
) As Bitmap
Parameters
definedViewportProjection
Type: Rhino.Display.DefinedViewportProjection
The view projection.
displayMode
Type: Rhino.DocObjects.DisplayMode
The display mode.
bitmapSize
Type: System.Drawing.Size
The bitmap size in pixels.
Return Value
Type: Bitmap
The preview bitmap if successful, null otherwise.
See Also
Reference
InstanceDefinition Class
CreatePreviewBitmap Overload
Rhino.DocObjects Namespace