RhinoCommon API
Brep.CreatePlanarUnion Method (IEnumerable<Brep>, Plane, Double)
 CreatePlanarUnion
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Brep[] CreatePlanarUnion(
	IEnumerable<Brep> breps,
	Plane plane,
	double tolerance
)
Public Shared Function CreatePlanarUnion (
	breps As IEnumerable(Of Brep),
	plane As Plane,
	tolerance As Double
) As Brep()
Parameters
breps
Type: System.Collections.Generic.IEnumerable<Brep>
The planar regions on which to perform the union operation.
plane
Type: Rhino.Geometry.Plane
The plane in which all the input breps lie
tolerance
Type: System.Double
Tolerance to use for union operation.
Return Value
Type: Brep[]
An array of Brep results or null on failure.
See Also
Reference
Brep Class
CreatePlanarUnion Overload
Rhino.Geometry Namespace