RhinoCommon API
DisplayPipelineAttributes.GetSurfaceIsoColorUsage Method
 Helper function for getting SurfaceIsoColorsUsed and SurfaceSingleIsoColor
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public DisplayPipelineAttributes.SurfaceIsoColorUse GetSurfaceIsoColorUsage()
Public Function GetSurfaceIsoColorUsage As DisplayPipelineAttributes.SurfaceIsoColorUse
Return Value
Type: DisplayPipelineAttributes.SurfaceIsoColorUse
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipelineAttributes.GetSurfaceIsoColorUsage"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace