RhinoCommon API
NurbsCurve.GrevillePoints Method
 Gets all Greville points for this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3dList GrevillePoints()
Public Function GrevillePoints As Point3dList
Return Value
Type: Point3dList
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurve.GrevillePoints"]
See Also
Reference
NurbsCurve Class
GrevillePoints Overload
Rhino.Geometry Namespace