RhinoCommon API
PreviewAppearance.ToMetaData Method
 Copy PreviewAppearance to MetaData
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void ToMetaData()
Public Sub ToMetaData
See Also
Reference
PreviewAppearance Class
ToMetaData Overload
Rhino.Render Namespace