RhinoCommon API
SimulatedTexture Constructor
Note: This API is now obsolete.
Initializes a new instance of the SimulatedTexture class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
[ObsoleteAttribute]
public SimulatedTexture()
<ObsoleteAttribute>
Public Sub New
See Also
Reference
SimulatedTexture Class
SimulatedTexture Overload
Rhino.Render Namespace