RhinoCommon API
MeshExtruder Constructor
 Construct object to extrude given mesh faces, edges and ngons.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public MeshExtruder(
	Mesh inputMesh,
	IEnumerable<ComponentIndex> componentIndices
)
Public Sub New (
	inputMesh As Mesh,
	componentIndices As IEnumerable(Of ComponentIndex)
)
Parameters
inputMesh
Type: Rhino.Geometry.Mesh
Mesh to use as starting point. Will not be modified.
componentIndices
Type: System.Collections.Generic.IEnumerable<ComponentIndex>
Mesh faces, edges and ngons to extrude.
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace