RhinoCommon API
SimpleArrayByte Constructor (IEnumerable<Byte>)
 Initializes a new SimpleArrayByte class
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SimpleArrayByte(
	IEnumerable<byte> values
)
Public Sub New (
	values As IEnumerable(Of Byte)
)
Parameters
values
Type: System.Collections.Generic.IEnumerable<Byte>
initial set of integers to add to the array
See Also
Reference
SimpleArrayByte Class
SimpleArrayByte Overload
Rhino.Runtime.InteropWrappers Namespace