RhinoCommon API
RebuildCurveOptions.SetPointCountRange Method
 If PointCountRangePermitted is true, then the user interface may use SetPointCountRange(min,max,tolerance) to specify a range of acceptable point counts. Otherwise using PointCount to specify a single point count value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetPointCountRange(
	int minimum_point_count,
	int maximum_point_count,
	double tolerance
)
Public Sub SetPointCountRange (
	minimum_point_count As Integer,
	maximum_point_count As Integer,
	tolerance As Double
)
Parameters
minimum_point_count
Type: System.Int32
[Missing <param name="minimum_point_count"/> documentation for "M:Rhino.Geometry.RebuildCurveOptions.SetPointCountRange(System.Int32,System.Int32,System.Double)"]
maximum_point_count
Type: System.Int32
[Missing <param name="maximum_point_count"/> documentation for "M:Rhino.Geometry.RebuildCurveOptions.SetPointCountRange(System.Int32,System.Int32,System.Double)"]
tolerance
Type: System.Double
 If tolerance > 0 and there is a rebuilt curve in the point range with deviation <= tolerance, the the curve with the smallest point count whose deviation <= tolerance will be returned. Otherwise the curve with the smallest deviation is returned.
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace