RhinoCommon API
HatchLine.Finalize Method
 Passively releases the unmanaged object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
HatchLine Class
Rhino.DocObjects Namespace