RhinoCommon API
ObjectTable.Replace Method (ObjRef, Hatch)
Replaces one object with new hatch object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public bool Replace(
	ObjRef objref,
	Hatch hatch
)
Public Function Replace (
	objref As ObjRef,
	hatch As Hatch
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
hatch
Type: Rhino.Geometry.Hatch
new hatch to be added. The hatch is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace