RhinoCommon API
RhinoObject.MeshObjects Method (IEnumerable<RhinoObject>, MeshingParameters, Mesh[], ObjectAttributes[], Boolean)
Meshes Rhino objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static Result MeshObjects(
	IEnumerable<RhinoObject> rhinoObjects,
	MeshingParameters parameters,
	out Mesh[] meshes,
	out ObjectAttributes[] attributes,
	bool useWorkerThread
)
Public Shared Function MeshObjects (
	rhinoObjects As IEnumerable(Of RhinoObject),
	parameters As MeshingParameters,
	<OutAttribute> ByRef meshes As Mesh(),
	<OutAttribute> ByRef attributes As ObjectAttributes(),
	useWorkerThread As Boolean
) As Result
Parameters
rhinoObjects
Type: System.Collections.Generic.IEnumerable<RhinoObject>
The Rhino objects to mesh.
parameters
Type: Rhino.Geometry.MeshingParameters
The parameters used to create the meshes.
meshes
Type: Rhino.Geometry.Mesh[]
The created meshes are appended to this array.
attributes
Type: Rhino.DocObjects.ObjectAttributes[]
The object attributes that coincide with each created mesh are appended to this array.
useWorkerThread
Type: System.Boolean
Set true to compute meshes in a worker thread.
Return Value
Type: Result
The results of the calculation.
See Also
Reference
RhinoObject Class
MeshObjects Overload
Rhino.DocObjects Namespace