RhinoCommon API
Brep.IsExtrusion Method (Double)
Determines if the Brep is a portion of an extrusion within a given tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsExtrusion(
	double tolerance
)
Public Function IsExtrusion (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the Brep is an extrusion.
See Also
Reference
Brep Class
IsExtrusion Overload
Rhino.Geometry Namespace