RhinoCommon API
Skin.SetBootSplashProgress Method
 Pushes a progress value to the platform's boot splash so it can paint a progress bar. The value is treated as a percentage and clamped to 0..100 on the native side. No-op on platforms that have no boot splash, and harmless if the splash is already gone.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
protected static void SetBootSplashProgress(
	int value
)
Protected Shared Sub SetBootSplashProgress (
	value As Integer
)
Parameters
value
Type: System.Int32
Progress percentage in the range 0..100.
See Also
Reference
Skin Class
Rhino.Runtime Namespace