RhinoCommon API
PreviewAppearance.Size Method
Note: This API is now obsolete.
 Size - used in the UI. Always meters.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use Scale instead")]
public double Size()
<ObsoleteAttribute("Use Scale instead")>
Public Function Size As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.Size"]
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace