RhinoCommon API
LicenseStatus Constructor
Public constructor.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public LicenseStatus()
Public Sub New
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace