RhinoCommon API
TextFields.ObjectName Method
 Returns an attached Text objects attribute name.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public static string ObjectName()
Public Shared Function ObjectName As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.ObjectName"]
See Also
Reference
TextFields Class
ObjectName Overload
Rhino.Runtime Namespace