RhinoCommon API
Hatch.GetGradientFill Method
 Get gradient fill information for this hatch. If the "GradientType" for the fill is None, then this hatch doesn't have any gradient fill.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public ColorGradient GetGradientFill()
Public Function GetGradientFill As ColorGradient
Return Value
Type: ColorGradient
[Missing <returns> documentation for "M:Rhino.Geometry.Hatch.GetGradientFill"]
See Also
Reference
Hatch Class
Rhino.Geometry Namespace