RhinoCommon API
RenderContent.BindParameterToField Method (String, String, Field, RenderContent.ChangeContexts)
 Use bindings to automatically wire parameters to fields
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public void BindParameterToField(
	string parameterName,
	string childSlotName,
	Field field,
	RenderContent.ChangeContexts setEvent
)
Public Sub BindParameterToField (
	parameterName As String,
	childSlotName As String,
	field As Field,
	setEvent As RenderContent.ChangeContexts
)
Parameters
parameterName
Type: System.String
[Missing <param name="parameterName"/> documentation for "M:Rhino.Render.RenderContent.BindParameterToField(System.String,System.String,Rhino.Render.Fields.Field,Rhino.Render.RenderContent.ChangeContexts)"]
childSlotName
Type: System.String
[Missing <param name="childSlotName"/> documentation for "M:Rhino.Render.RenderContent.BindParameterToField(System.String,System.String,Rhino.Render.Fields.Field,Rhino.Render.RenderContent.ChangeContexts)"]
field
Type: Rhino.Render.Fields.Field
[Missing <param name="field"/> documentation for "M:Rhino.Render.RenderContent.BindParameterToField(System.String,System.String,Rhino.Render.Fields.Field,Rhino.Render.RenderContent.ChangeContexts)"]
setEvent
Type: Rhino.Render.RenderContent.ChangeContexts
[Missing <param name="setEvent"/> documentation for "M:Rhino.Render.RenderContent.BindParameterToField(System.String,System.String,Rhino.Render.Fields.Field,Rhino.Render.RenderContent.ChangeContexts)"]
See Also
Reference
RenderContent Class
BindParameterToField Overload
Rhino.Render Namespace