RhinoCommon API
TextureMapping.CreatePlaneMapping Method (Plane, Interval, Interval, Interval, Boolean)
Create a planar projection texture mapping
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public static TextureMapping CreatePlaneMapping(
	Plane plane,
	Interval dx,
	Interval dy,
	Interval dz,
	bool capped
)
Public Shared Function CreatePlaneMapping (
	plane As Plane,
	dx As Interval,
	dy As Interval,
	dz As Interval,
	capped As Boolean
) As TextureMapping
Parameters
plane
Type: Rhino.Geometry.Plane
A plane to use for mapping.
dx
Type: Rhino.Geometry.Interval
portion of the plane's x axis that is mapped to [0,1] (can be a decreasing interval)
dy
Type: Rhino.Geometry.Interval
portion of the plane's y axis that is mapped to [0,1] (can be a decreasing interval)
dz
Type: Rhino.Geometry.Interval
portion of the plane's z axis that is mapped to [0,1] (can be a decreasing interval)
capped
Type: System.Boolean
set to true if planar UVW is meant, false for planar UV
Return Value
Type: TextureMapping
TextureMapping instance if input is valid
See Also
Reference
TextureMapping Class
CreatePlaneMapping Overload
Rhino.Render Namespace