RhinoCommon API
RhinoApp.MainWindowHandle Method
 Gets the HWND of the Rhino main window.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static IntPtr MainWindowHandle()
Public Shared Function MainWindowHandle As IntPtr
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.RhinoApp.MainWindowHandle"]
See Also
Reference
RhinoApp Class
Rhino Namespace