RhinoCommon API
ChangeQueue.TextureForId Method
 Get RenderTexture for given RenderHash. Can return null.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RenderTexture TextureForId(
	uint crc
)
Public Function TextureForId (
	crc As UInteger
) As RenderTexture
Parameters
crc
Type: System.UInt32
render hash of the content to search for
Return Value
Type: RenderTexture
RenderTexture if found for render hash, null otherwise
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace