RhinoCommon API
LinearWorkflow.GetHashCode Method
 Get hash code for this object. It is the Hash property cast to int.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.LinearWorkflow.GetHashCode"]
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace