RhinoCommon API
Box.ToBrep Method
 Constructs a brep representation of this box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep ToBrep()
Public Function ToBrep As Brep
Return Value
Type: Brep
A Brep representation of this box or null.
See Also
Reference
Box Structure
Rhino.Geometry Namespace