RhinoCommon API
CustomMeshObject.Dispose Method
Releases all resources used by the CustomMeshObject
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
CustomMeshObject Class
Dispose Overload
Rhino.DocObjects.Custom Namespace