RhinoCommon API
PlaneSurface.SetExtents Method
 Sets the extents of the plane surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetExtents(
	int direction,
	Interval extents,
	bool syncDomain
)
Public Sub SetExtents (
	direction As Integer,
	extents As Interval,
	syncDomain As Boolean
)
Parameters
direction
Type: System.Int32
 The direction, where 0 sets plane surface's x coordinate extents and 1 sets plane surface's y coordinate extents.
extents
Type: Rhino.Geometry.Interval
An increasing interval.
syncDomain
Type: System.Boolean
 If true, the corresponding evaluation interval domain is set so that it matches the extents interval. If false, the corresponding evaluation interval domain is not changed.
See Also
Reference
PlaneSurface Class
Rhino.Geometry Namespace