RhinoCommon API
SimpleArrayLine.ToArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Line[] ToArray()
Public Function ToArray As Line()
Return Value
Type: Line[]
The managed array.
See Also
Reference
SimpleArrayLine Class
Rhino.Runtime.InteropWrappers Namespace