RhinoCommon API
ViewCaptureSettings Constructor
Construct default view capture settings
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ViewCaptureSettings()
Public Sub New
See Also
Reference
ViewCaptureSettings Class
ViewCaptureSettings Overload
Rhino.Display Namespace