RhinoCommon API
PersistentSettings.ContainsChangedValues Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.ContainsChangedValues"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ContainsChangedValues()
Public Function ContainsChangedValues As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.ContainsChangedValues"]
See Also
Reference
PersistentSettings Class
Rhino Namespace