RhinoCommon API
FileCsvDocument.SetRow Method (Int32, String[])
 Sets the fields of a row, addressed by index, growing the document as needed (any intervening rows are created and filled with empty fields). This is the row-level counterpart to GetRow(Int32). The number of fields must equal ColumnCount. A null field is stored as an empty field.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetRow(
	int row,
	params string[] values
)
Public Sub SetRow (
	row As Integer,
	ParamArray values As String()
)
Parameters
row
Type: System.Int32
The zero-based row index (y).
values
Type: System.String[]
The fields of the row, one per column.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when row is negative.
ArgumentNullException | Thrown when values is null.
ArgumentException | Thrown when the number of fields does not equal ColumnCount.
See Also
Reference
FileCsvDocument Class
SetRow Overload
Rhino.FileIO Namespace