RhinoCommon API
Dialogs.ShowColorDialog Method (IWin32Window, Color4f, Boolean)
Note: This API is now obsolete.
 Displays the standard modal color picker dialog for floating point colors.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use ShowColorDialog(object parent, ref Color4f color, bool allowAlpha)")]
public static bool ShowColorDialog(
	IWin32Window parent,
	ref Color4f color,
	bool allowAlpha
)
<ObsoleteAttribute("Use ShowColorDialog(object parent, ref Color4f color, bool allowAlpha)")>
Public Shared Function ShowColorDialog (
	parent As IWin32Window,
	ByRef color As Color4f,
	allowAlpha As Boolean
) As Boolean
Parameters
parent
Type: System.Windows.Forms.IWin32Window
Parent window for this dialog, should always pass this if calling from a form or user control.
color
Type: Rhino.Display.Color4f
The initial color to set the picker to and also accepts the user's choice.
allowAlpha
Type: System.Boolean
Specifies if the color picker should allow changes to the alpha channel or not.
Return Value
Type: Boolean
true if a color was picked, false if the user canceled the picker dialog.
See Also
Reference
Dialogs Class
ShowColorDialog Overload
Rhino.UI Namespace