RhinoCommon API
ComponentIndex.GreaterThanOrEqual Operator
 Determines whether the first ComponentIndex comes after the second, or it is equal to it.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool operator >=(
	ComponentIndex a,
	ComponentIndex b
)
Public Shared Operator >= (
	a As ComponentIndex,
	b As ComponentIndex
) As Boolean
Parameters
a
Type: Rhino.Geometry.ComponentIndex
The first ComponentIndex
b
Type: Rhino.Geometry.ComponentIndex
The second ComponentIndex
Return Value
Type: Boolean
true if the first is equal to the second or comes after it; otherwise, false
See Also
Reference
ComponentIndex Structure
Rhino.Geometry Namespace