RhinoCommon API
ArchivableDictionary.Set Method (String, UInt32)
 Sets a UInt32.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Set(
	string key,
	uint val
)
Public Function Set (
	key As String,
	val As UInteger
) As Boolean
Parameters
key
Type: System.String
The text key.
val
Type: System.UInt32
A UInt32.
Because UInt32 has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
true if set operation succeeded, otherwise false.
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace