RhinoCommon API
Dithering.CopyFrom Method
[Missing <summary> documentation for "M:Rhino.Render.Dithering.CopyFrom(Rhino.Render.FreeFloatingBase)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override void CopyFrom(
	FreeFloatingBase src
)
Public Overrides Sub CopyFrom (
	src As FreeFloatingBase
)
Parameters
src
Type: Rhino.Render.FreeFloatingBase
[Missing <param name="src"/> documentation for "M:Rhino.Render.Dithering.CopyFrom(Rhino.Render.FreeFloatingBase)"]
See Also
Reference
Dithering Class
Rhino.Render Namespace