RhinoCommon API
ObjectAttributes.SetCustomLinetype Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.SetCustomLinetype(Rhino.DocObjects.Linetype)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetCustomLinetype(
	Linetype linetype
)
Public Sub SetCustomLinetype (
	linetype As Linetype
)
Parameters
linetype
Type: Rhino.DocObjects.Linetype
[Missing <param name="linetype"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.SetCustomLinetype(Rhino.DocObjects.Linetype)"]
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace