RhinoCommon API
WorksessionFileModel Constructor (WorksessionFileModel)
Creates a copy of another model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFileModel(
	WorksessionFileModel other
)
Public Sub New (
	other As WorksessionFileModel
)
Parameters
other
Type: Rhino.FileIO.WorksessionFileModel
The model to copy.
Exceptions
Exception | Condition
ArgumentNullException | If other is null.
See Also
Reference
WorksessionFileModel Class
WorksessionFileModel Overload
Rhino.FileIO Namespace