RhinoCommon API
Layer.GetParentName Method (Layer)
 Get a layer's "parent" path name
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string GetParentName(
	Layer layer
)
Public Shared Function GetParentName (
	layer As Layer
) As String
Parameters
layer
Type: Rhino.DocObjects.Layer
[Missing <param name="layer"/> documentation for "M:Rhino.DocObjects.Layer.GetParentName(Rhino.DocObjects.Layer)"]
Return Value
Type: String
 parent name or String.Empty
See Also
Reference
Layer Class
GetParentName Overload
Rhino.DocObjects Namespace