RhinoCommon API
RenderMeshProvider.RegisterProviders Method (PlugIn)
 Register RenderMeshProviders without relying on the auto-plug-in registration
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void RegisterProviders(
	PlugIn plugin
)
Public Shared Sub RegisterProviders (
	plugin As PlugIn
)
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshProvider.RegisterProviders(Rhino.PlugIns.PlugIn)"]
See Also
Reference
RenderMeshProvider Class
RegisterProviders Overload
Rhino.Render.CustomRenderMeshes Namespace