RhinoCommon API
Layer.UnsetModelPersistentVisibility Method
 Remove any model persistent visibility setting from this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void UnsetModelPersistentVisibility()
Public Sub UnsetModelPersistentVisibility
See Also
Reference
Layer Class
Rhino.DocObjects Namespace