RhinoCommon API
Field.ValueAsVector2d Method
 Return field as a Rhino.Geometry.Vector2d color value.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Vector2d ValueAsVector2d()
Protected Function ValueAsVector2d As Vector2d
Return Value
Type: Vector2d
Return field as a Rhino.Geometry.Vector2d color value.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace