RhinoCommon API
CurveBooleanRegions.SegmentDetails Method
 Returns the details of a segment in a boundary curve in a curve region.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int SegmentDetails(
	int regionIndex,
	int boundaryIndex,
	int segmmentIndex,
	out Interval subDomain,
	out bool reversed
)
Public Function SegmentDetails (
	regionIndex As Integer,
	boundaryIndex As Integer,
	segmmentIndex As Integer,
	<OutAttribute> ByRef subDomain As Interval,
	<OutAttribute> ByRef reversed As Boolean
) As Integer
Parameters
regionIndex
Type: System.Int32
The curve region index.
boundaryIndex
Type: System.Int32
The boundary curve index.
segmmentIndex
Type: System.Int32
The segment index.
subDomain
Type: Rhino.Geometry.Interval
The sub-domain of the planar curve used by the segment.
reversed
Type: System.Boolean
true if the piece of the planar curve should be reversed.
Return Value
Type: Int32
The index of the planar curve used by the specified segment if successful, -1 if not successful.
See Also
Reference
CurveBooleanRegions Class
Rhino.Geometry Namespace