RhinoCommon API
LightManagerSupport.GetLights Method
 Get all the lights that are associated to the light manager. The lights are added to the LightArray parameter passed to the GetLights method
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract void GetLights(
	RhinoDoc doc,
	ref LightArray light_array
)
Public MustOverride Sub GetLights (
	doc As RhinoDoc,
	ByRef light_array As LightArray
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.LightManagerSupport.GetLights(Rhino.RhinoDoc,Rhino.Render.LightArray@)"]
light_array
Type: Rhino.Render.LightArray
[Missing <param name="light_array"/> documentation for "M:Rhino.Render.LightManagerSupport.GetLights(Rhino.RhinoDoc,Rhino.Render.LightArray@)"]
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace