RhinoCommon API
Matrix.Addition Operator
 Adds two matrices and returns a new sum matrix.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Matrix operator +(
	Matrix a,
	Matrix b
)
Public Shared Operator + (
	a As Matrix,
	b As Matrix
) As Matrix
Parameters
a
Type: Rhino.Geometry.Matrix
A first matrix to use in calculation.
b
Type: Rhino.Geometry.Matrix
Another matrix to use in calculation.
Return Value
Type: Matrix
The sum matrix.
Exceptions
Exception | Condition
ArgumentException |  When the two matrices are not the same size.
See Also
Reference
Matrix Class
Rhino.Geometry Namespace