RhinoCommon API
NurbsCurveFitParameters.SetPointCountRange Method (Int32, Int32, Double)
 Set the point count range and tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void SetPointCountRange(
	int minimum,
	int maximum,
	double tolerance
)
Public Sub SetPointCountRange (
	minimum As Integer,
	maximum As Integer,
	tolerance As Double
)
Parameters
minimum
Type: System.Int32
[Missing <param name="minimum"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.SetPointCountRange(System.Int32,System.Int32,System.Double)"]
maximum
Type: System.Int32
[Missing <param name="maximum"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.SetPointCountRange(System.Int32,System.Int32,System.Double)"]
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.NurbsCurveFitParameters.SetPointCountRange(System.Int32,System.Int32,System.Double)"]
See Also
Reference
NurbsCurveFitParameters Class
SetPointCountRange Overload
Rhino.Geometry Namespace