RhinoCommon API
VisualAnalysisMode.Find Method (Type)
 Finds a visual analysis mode by type.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static VisualAnalysisMode Find(
	Type t
)
Public Shared Function Find (
	t As Type
) As VisualAnalysisMode
Parameters
t
Type: System.Type
A visual analysis mode type.
Return Value
Type: VisualAnalysisMode
A visual analysis mode on success, or null on error.
See Also
Reference
VisualAnalysisMode Class
Find Overload
Rhino.Display Namespace