RhinoCommon API
FieldDictionary.AddTextured Method (String, Color4f, String)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Display.Color4f,System.String)"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
[ObsoleteAttribute]
public Color4fField AddTextured(
	string key,
	Color4f value,
	string prompt
)
<ObsoleteAttribute>
Public Function AddTextured (
	key As String,
	value As Color4f,
	prompt As String
) As Color4fField
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Display.Color4f,System.String)"]
value
Type: Rhino.Display.Color4f
[Missing <param name="value"/> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Display.Color4f,System.String)"]
prompt
Type: System.String
[Missing <param name="prompt"/> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Display.Color4f,System.String)"]
Return Value
Type: Color4fField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Display.Color4f,System.String)"]
See Also
Reference
FieldDictionary Class
AddTextured Overload
Rhino.Render.Fields Namespace