RhinoCommon API
PersistentSettings.GetEnumValue<T> Method (String, T)
 Gets a stored enumerated value using a custom key, or return default value if not found.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public T GetEnumValue<T>(
	string key,
	T defaultValue
)
where T : struct, new(), IConvertible
Public Function GetEnumValue(Of T As {Structure, New, IConvertible}) (
	key As String,
	defaultValue As T
) As T
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetEnumValue``1(System.String,``0)"]
defaultValue
Type: T
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetEnumValue``1(System.String,``0)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.PersistentSettings.GetEnumValue``1(System.String,``0)"]
Return Value
Type: T
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetEnumValue``1(System.String,``0)"]
See Also
Reference
PersistentSettings Class
GetEnumValue Overload
Rhino Namespace