RhinoCommon API
PointCloudObject.DuplicatePointCloudGeometry Method
[Missing <summary> documentation for "M:Rhino.DocObjects.PointCloudObject.DuplicatePointCloudGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PointCloud DuplicatePointCloudGeometry()
Public Function DuplicatePointCloudGeometry As PointCloud
Return Value
Type: PointCloud
[Missing <returns> documentation for "M:Rhino.DocObjects.PointCloudObject.DuplicatePointCloudGeometry"]
See Also
Reference
PointCloudObject Class
Rhino.DocObjects Namespace