RhinoCommon API
HostUtils.RegisterStaticIDisposable Method
 Statics do not get disposed of in .NET. If you have a static IDisposable that you want to be disposed during shutdown, add your disposable to this list.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void RegisterStaticIDisposable(
	IDisposable disposable
)
Public Shared Sub RegisterStaticIDisposable (
	disposable As IDisposable
)
Parameters
disposable
Type: System.IDisposable
[Missing <param name="disposable"/> documentation for "M:Rhino.Runtime.HostUtils.RegisterStaticIDisposable(System.IDisposable)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace