RhinoCommon API
Box Constructor (Plane, BoundingBox)
 Initializes a box from a base plane and a world-aligned bounding box. The box will use basePlane for its Plane, and the X, Y, and Z intervals of boundingbox as its X, Y, and Z intervals.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Box(
	Plane basePlane,
	BoundingBox boundingbox
)
Public Sub New (
	basePlane As Plane,
	boundingbox As BoundingBox
)
Parameters
basePlane
Type: Rhino.Geometry.Plane
Base plane of bounding box.
boundingbox
Type: Rhino.Geometry.BoundingBox
Bounding Box in plane coordinates.
Remarks
The box might not contain boundingbox.
See Also
Reference
Box Structure
Box Overload
Rhino.Geometry Namespace