RhinoCommon API
MarkupTable.Find Method (Guid, Boolean)
Finds a markup with a matching ID.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Find(
	Guid id,
	bool ignoreDeletedMarkups
)
Public Function Find (
	id As Guid,
	ignoreDeletedMarkups As Boolean
) As Integer
Parameters
id
Type: System.Guid
The ID of the markup to be found.
ignoreDeletedMarkups
Type: System.Boolean
 If true, deleted markups are not checked.
Return Value
Type: Int32
 If the markup was found, the markup index, >=0, is returned. If the markup was not found, -1 is returned.
See Also
Reference
MarkupTable Class
Find Overload
Rhino.DocObjects.Tables Namespace