RhinoCommon API
SumSurface.Create Method (Curve, Vector3d)
 Constructs a new sum surface by extruding a curve in a specified direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static SumSurface Create(
	Curve curve,
	Vector3d extrusionDirection
)
Public Shared Function Create (
	curve As Curve,
	extrusionDirection As Vector3d
) As SumSurface
Parameters
curve
Type: Rhino.Geometry.Curve
The curve used as extrusion profile.
extrusionDirection
Type: Rhino.Geometry.Vector3d
The extrusion vector (must be non-zero).
Return Value
Type: SumSurface
A new sum surface on success; null on failure.
See Also
Reference
SumSurface Class
Create Overload
Rhino.Geometry Namespace