RhinoCommon API
Quaternion.CreateFromRotationZYZ Method
 Constructs a quaternion defined by Euler angles.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Quaternion CreateFromRotationZYZ(
	double alpha,
	double beta,
	double gamma
)
Public Shared Function CreateFromRotationZYZ (
	alpha As Double,
	beta As Double,
	gamma As Double
) As Quaternion
Parameters
alpha
Type: System.Double
Angle, in radians, to rotate about the ZAxis.
beta
Type: System.Double
Angle, in radians, to rotate about the YAxis.
gamma
Type: System.Double
Angle, in radians, to rotate about the ZAxis.
Return Value
Type: Quaternion
The quaternion.
Remarks
 CreateFromRotationZYZ(alpha, beta, gamma) = R_z(alpha) * R_y(beta) * R_z(gamma), where R_*(angle) is rotation of angle radians about the corresponding *-world coordinate axis.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace