RhinoCommon API
VolumeMassProperties.Sum Method (VolumeMassProperties)
 Sum mass properties together to get an aggregate mass.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Sum(
	VolumeMassProperties summand
)
Public Function Sum (
	summand As VolumeMassProperties
) As Boolean
Parameters
summand
Type: Rhino.Geometry.VolumeMassProperties
mass properties to add.
Return Value
Type: Boolean
true if successful.
See Also
Reference
VolumeMassProperties Class
Sum Overload
Rhino.Geometry Namespace