RhinoCommon API
RenderMaterial.GetTextureFromUsage Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.GetTextureFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderTexture GetTextureFromUsage(
	RenderMaterial.StandardChildSlots slot
)
Public Function GetTextureFromUsage (
	slot As RenderMaterial.StandardChildSlots
) As RenderTexture
Parameters
slot
Type: Rhino.Render.RenderMaterial.StandardChildSlots
[Missing <param name="slot"/> documentation for "M:Rhino.Render.RenderMaterial.GetTextureFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
Return Value
Type: RenderTexture
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.GetTextureFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace