RhinoCommon API
DisplayPipeline.DrawPoint Method (Point3d, PointStyle, Single, Color)
Draws a point with a given radius, style and color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawPoint(
	Point3d point,
	PointStyle style,
	float radius,
	Color color
)
Public Sub DrawPoint (
	point As Point3d,
	style As PointStyle,
	radius As Single,
	color As Color
)
Parameters
point
Type: Rhino.Geometry.Point3d
Location of point in world coordinates.
style
Type: Rhino.Display.PointStyle
Point display style.
radius
Type: System.Single
Point size in pixels.
color
Type: System.Drawing.Color
 Color of point. If style is ControlPoint, this will be the border color.
See Also
Reference
DisplayPipeline Class
DrawPoint Overload
Rhino.Display Namespace