RhinoCommon API
RhinoApp.IsInstallationCommercial Method
 If licenseType is a commercial license, returns true. A commercial license grants full use of the product.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public static bool IsInstallationCommercial(
	Installation licenseType
)
Public Shared Function IsInstallationCommercial (
	licenseType As Installation
) As Boolean
Parameters
licenseType
Type: Rhino.ApplicationSettings.Installation
[Missing <param name="licenseType"/> documentation for "M:Rhino.RhinoApp.IsInstallationCommercial(Rhino.ApplicationSettings.Installation)"]
Return Value
Type: Boolean
true if licenseType is a commercial license. false otherwise
See Also
Reference
RhinoApp Class
Rhino Namespace
Rhino.ApplicationSettings.Installation