RhinoCommon API
DisplayPipelineAttributes.SetSurfaceEdgeThicknessUsage Method
 Helper function for getting the SurfaceEdgeThicknessFlags
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public void SetSurfaceEdgeThicknessUsage(
	DisplayPipelineAttributes.SurfaceThicknessUse use
)
Public Sub SetSurfaceEdgeThicknessUsage (
	use As DisplayPipelineAttributes.SurfaceThicknessUse
)
Parameters
use
Type: Rhino.Display.DisplayPipelineAttributes.SurfaceThicknessUse
[Missing <param name="use"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.SetSurfaceEdgeThicknessUsage(Rhino.Display.DisplayPipelineAttributes.SurfaceThicknessUse)"]
Return Value
Type:
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace