RhinoCommon API
RhinoPageView.IsInPageViewGroup Method
 Determines if this page view belongs in a page view group.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsInPageViewGroup(
	int pageViewGroupIndex
)
Public Function IsInPageViewGroup (
	pageViewGroupIndex As Integer
) As Boolean
Parameters
pageViewGroupIndex
Type: System.Int32
[Missing <param name="pageViewGroupIndex"/> documentation for "M:Rhino.Display.RhinoPageView.IsInPageViewGroup(System.Int32)"]
Return Value
Type: Boolean
True if the page view belongs in the page view group, otherwise false.
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace