RhinoCommon API
File3dmLinetypeTable.FindNameHash Method
 Finds a Linetype given its name hash.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Linetype FindNameHash(
	NameHash nameHash
)
Public Function FindNameHash (
	nameHash As NameHash
) As Linetype
Parameters
nameHash
Type: Rhino.FileIO.NameHash
The name hash of the Linetype to be searched.
Return Value
Type: Linetype
An Linetype, or null on error.
See Also
Reference
File3dmLinetypeTable Class
Rhino.FileIO Namespace