RhinoCommon API
Mesh.CreateFromTessellation Method
 Attempts to create a mesh that is a triangulation of a list of points, projected on a plane, including its holes and fixed edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Mesh CreateFromTessellation(
	IEnumerable<Point3d> points,
	IEnumerable<IEnumerable<Point3d>> edges,
	Plane plane,
	bool allowNewVertices
)
Public Shared Function CreateFromTessellation (
	points As IEnumerable(Of Point3d),
	edges As IEnumerable(Of IEnumerable(Of Point3d)),
	plane As Plane,
	allowNewVertices As Boolean
) As Mesh
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable of points.
edges
Type: System.Collections.Generic.IEnumerable<IEnumerable<Point3d>>
A list of polylines, or other lists of points representing edges. This can be null. If nested enumerable items are null, they will be discarded.
plane
Type: Rhino.Geometry.Plane
A plane.
allowNewVertices
Type: System.Boolean
If true, the mesh might have more vertices than the list of input points, if doing so will improve long thin triangles.
Return Value
Type: Mesh
A new mesh, or null if not successful.
Exceptions
Exception | Condition
ArgumentNullException | If points is null.
ArgumentException | If plane is not valid.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace