RhinoCommon API
GetObject.Objects Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetObject.Objects"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ObjRef[] Objects()
Public Function Objects As ObjRef()
Return Value
Type: ObjRef[]
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetObject.Objects"]
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace