RhinoCommon API
PostEffect.RegisterPostEffect Method (Assembly, Guid)
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffect.RegisterPostEffect(System.Reflection.Assembly,System.Guid)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Type[] RegisterPostEffect(
	Assembly assembly,
	Guid pluginId
)
Public Shared Function RegisterPostEffect (
	assembly As Assembly,
	pluginId As Guid
) As Type()
Parameters
assembly
Type: System.Reflection.Assembly
[Missing <param name="assembly"/> documentation for "M:Rhino.Render.PostEffects.PostEffect.RegisterPostEffect(System.Reflection.Assembly,System.Guid)"]
pluginId
Type: System.Guid
[Missing <param name="pluginId"/> documentation for "M:Rhino.Render.PostEffects.PostEffect.RegisterPostEffect(System.Reflection.Assembly,System.Guid)"]
Return Value
Type: Type[]
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffect.RegisterPostEffect(System.Reflection.Assembly,System.Guid)"]
See Also
Reference
PostEffect Class
RegisterPostEffect Overload
Rhino.Render.PostEffects Namespace