RhinoCommon API
Color4fField.ValueAsObject Method
[Missing <summary> documentation for "M:Rhino.Render.Fields.Color4fField.ValueAsObject"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public override Object ValueAsObject()
Public Overrides Function ValueAsObject As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.Render.Fields.Color4fField.ValueAsObject"]
See Also
Reference
Color4fField Class
Rhino.Render.Fields Namespace