RhinoCommon API
SectionStyleTable.Modify Method
Modify section style settings.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Modify(
	SectionStyle sectionstyle,
	int index,
	bool quiet
)
Public Function Modify (
	sectionstyle As SectionStyle,
	index As Integer,
	quiet As Boolean
) As Boolean
Parameters
sectionstyle
Type: Rhino.DocObjects.SectionStyle
New sections style settings. This information is copied.
index
Type: System.Int32
Zero based index of section style to set.
quiet
Type: System.Boolean
 if true, information message boxes pop up when illegal changes are attempted.
Return Value
Type: Boolean
 true if successful. false if index is out of range.
See Also
Reference
SectionStyleTable Class
Rhino.DocObjects.Tables Namespace