RhinoCommon API
RhinoMath.EvaluateNormal Method
 Expert tool to evaluate surface unit normal.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool EvaluateNormal(
	int limitDirection,
	Vector3d ds,
	Vector3d dt,
	Vector3d dss,
	Vector3d dst,
	Vector3d dtt,
	out Vector3d n
)
Public Shared Function EvaluateNormal (
	limitDirection As Integer,
	ds As Vector3d,
	dt As Vector3d,
	dss As Vector3d,
	dst As Vector3d,
	dtt As Vector3d,
	<OutAttribute> ByRef n As Vector3d
) As Boolean
Parameters
limitDirection
Type: System.Int32
Determines which direction is used to compute the limit, where: 0 = default, 1 = from quadrant I, 2 = from quadrant II, etc.
ds
Type: Rhino.Geometry.Vector3d
First partial derivative.
dt
Type: Rhino.Geometry.Vector3d
First partial derivative.
dss
Type: Rhino.Geometry.Vector3d
Second partial derivative.
dst
Type: Rhino.Geometry.Vector3d
Second partial derivative.
dtt
Type: Rhino.Geometry.Vector3d
Second partial derivative.
n
Type: Rhino.Geometry.Vector3d
Unit normal.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
RhinoMath Class
Rhino Namespace