RhinoCommon API
DisplayPipelineAttributes.GetSurfaceEdgeThicknessUsage Method
 Helper function for setting the SurfaceEdgeThicknessFlags
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public DisplayPipelineAttributes.SurfaceThicknessUse GetSurfaceEdgeThicknessUsage()
Public Function GetSurfaceEdgeThicknessUsage As DisplayPipelineAttributes.SurfaceThicknessUse
Return Value
Type: DisplayPipelineAttributes.SurfaceThicknessUse
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipelineAttributes.GetSurfaceEdgeThicknessUsage"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace