RhinoCommon API
Thumbnail.GetDib Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.GetDib"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Bitmap GetDib()
Public Function GetDib As Bitmap
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.GetDib"]
Implements
IRhRdkThumbnail.GetDib()
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace