RhinoCommon API
IntersectingMeshPair.Deconstruct Method
 Deconstructs this pair, so that it can be written as var (meshIndexA, meshIndexB, _, _) = pair;.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Deconstruct(
	out int meshIndexA,
	out int meshIndexB,
	out int faceIndexA,
	out int faceIndexB
)
Public Sub Deconstruct (
	<OutAttribute> ByRef meshIndexA As Integer,
	<OutAttribute> ByRef meshIndexB As Integer,
	<OutAttribute> ByRef faceIndexA As Integer,
	<OutAttribute> ByRef faceIndexB As Integer
)
Parameters
meshIndexA
Type: System.Int32
Receives MeshIndexA.
meshIndexB
Type: System.Int32
Receives MeshIndexB.
faceIndexA
Type: System.Int32
Receives FaceIndexA.
faceIndexB
Type: System.Int32
Receives FaceIndexB.
See Also
Reference
IntersectingMeshPair Structure
Rhino.Geometry.Intersect Namespace