RhinoCommon API
MeshExtruder.ExtrudedMesh Method (Mesh)
 Creates new extruded mesh. Returns true if any edges or faces were extruded.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public bool ExtrudedMesh(
	out Mesh extrudedMeshOut
)
Public Function ExtrudedMesh (
	<OutAttribute> ByRef extrudedMeshOut As Mesh
) As Boolean
Parameters
extrudedMeshOut
Type: Rhino.Geometry.Mesh
Extruded mesh
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.MeshExtruder.ExtrudedMesh(Rhino.Geometry.Mesh@)"]
See Also
Reference
MeshExtruder Class
ExtrudedMesh Overload
Rhino.Geometry Namespace