RhinoCommon API
RealtimeDisplayMode.CaptureProgress Method
 Override to communicate the progress of a capture.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual double CaptureProgress()
Public Overridable Function CaptureProgress As Double
Return Value
Type: Double
A number between 0.0 and 1.0 inclusive. 1.0 means 100%.
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace