RhinoCommon API
SimulatedEnvironment Constructor
Initializes a new instance of the SimulatedEnvironment class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public SimulatedEnvironment()
Public Sub New
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace