RhinoCommon API
ICollapsibleSection3.UpdateView Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ICollapsibleSection3.UpdateView(System.UInt32)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
void UpdateView(
	uint flags
)
Sub UpdateView (
	flags As UInteger
)
Parameters
flags
Type: System.UInt32
[Missing <param name="flags"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSection3.UpdateView(System.UInt32)"]
See Also
Reference
ICollapsibleSection3 Interface
Rhino.UI.Controls Namespace