RhinoCommon API
SnapShotsClient.PrepareForObjectAnimation Method
 Called once at the start of an animation.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool PrepareForObjectAnimation(
	RhinoDoc doc,
	RhinoObject doc_object,
	ref Transform transform,
	BinaryArchiveReader archive_start,
	BinaryArchiveReader archive_stop
)
Public MustOverride Function PrepareForObjectAnimation (
	doc As RhinoDoc,
	doc_object As RhinoObject,
	ByRef transform As Transform,
	archive_start As BinaryArchiveReader,
	archive_stop As BinaryArchiveReader
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
doc is the current document.
doc_object
Type: Rhino.DocObjects.RhinoObject
doc_obj is the current object.
transform
Type: Rhino.Geometry.Transform
transform is a transformation matrix. The matrix is set to identity the first time an object is associated with a snapshot. After that the matrix is updated when the object is transformed(scale, rotate etc.).
archive_start
Type: Rhino.FileIO.BinaryArchiveReader
archive_start is a archive to the data of the starting position.
archive_stop
Type: Rhino.FileIO.BinaryArchiveReader
archive_stop is a archive to the data of the ending position.
Return Value
Type: Boolean
true if successful, otherwise false.
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace