RhinoCommon API
SubDEdge.EndSharpness Method
 Gets the sharpness of this edge at one of its ends.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public double EndSharpness(
	int endIndex,
	bool useCreaseSharpness
)
Public Function EndSharpness (
	endIndex As Integer,
	useCreaseSharpness As Boolean
) As Double
Parameters
endIndex
Type: System.Int32
 0 for the VertexFrom end, 1 for the VertexTo end.
useCreaseSharpness
Type: System.Boolean
 If this edge is a crease and useCreaseSharpness is true, then CreaseValue is returned.
Return Value
Type: Double
The sharpness at that end, or 0.0 if this edge is not sharp.
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace