RhinoCommon API
HatchPattern.DeleteAllUserStrings Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HatchPattern.DeleteAllUserStrings"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public void DeleteAllUserStrings()
Public Sub DeleteAllUserStrings
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace