RhinoCommon API
CollapsibleSectionViewModel Constructor
 Construct from your section - the view model should be a member of the section
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public CollapsibleSectionViewModel(
	ICollapsibleSection section
)
Public Sub New (
	section As ICollapsibleSection
)
Parameters
section
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="section"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionViewModel.#ctor(Rhino.UI.Controls.ICollapsibleSection)"]
See Also
Reference
CollapsibleSectionViewModel Class
Rhino.UI.Controls Namespace