RhinoCommon API
RenderWindow.ChannelGPU.PixelSize Method
 Return the size of one pixel's data in the channel.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public uint PixelSize()
Public Function PixelSize As UInteger
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.PixelSize"]
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace