RhinoCommon API
FileReference.Dispose Method
 Reclaims unmanaged resources used by this object.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
FileReference Class
Rhino.FileIO Namespace