RhinoCommon API
ContentFactory.ContentTypeId Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.ContentFactory.ContentTypeId"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public Guid ContentTypeId()
Public Function ContentTypeId As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.DataSources.ContentFactory.ContentTypeId"]
See Also
Reference
ContentFactory Class
Rhino.Render.DataSources Namespace