RhinoCommon API
TexturedColor Constructor
Initializes a new instance of the TexturedColor class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public TexturedColor(
	string name,
	Color4f value,
	bool on,
	float amount
)
Public Sub New (
	name As String,
	value As Color4f,
	on As Boolean,
	amount As Single
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Render.TexturedColor.#ctor(System.String,Rhino.Display.Color4f,System.Boolean,System.Single)"]
value
Type: Rhino.Display.Color4f
[Missing <param name="value"/> documentation for "M:Rhino.Render.TexturedColor.#ctor(System.String,Rhino.Display.Color4f,System.Boolean,System.Single)"]
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Render.TexturedColor.#ctor(System.String,Rhino.Display.Color4f,System.Boolean,System.Single)"]
amount
Type: System.Single
[Missing <param name="amount"/> documentation for "M:Rhino.Render.TexturedColor.#ctor(System.String,Rhino.Display.Color4f,System.Boolean,System.Single)"]
See Also
Reference
TexturedColor Class
Rhino.Render Namespace