RhinoCommon API
PostProcessFrameBufferEventArgs.TryCopyFrameBuffer Method (IntPtr, Int32, Int32)
 Copies the frame into caller owned memory as 32 bit BGRA, with every pixel made opaque.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryCopyFrameBuffer(
	IntPtr destination,
	int destinationStride,
	int destinationCapacityInBytes
)
Public Function TryCopyFrameBuffer (
	destination As IntPtr,
	destinationStride As Integer,
	destinationCapacityInBytes As Integer
) As Boolean
Parameters
destination
Type: System.IntPtr
 Start of the destination buffer. This is the start of the buffer whichever row order is asked for, unlike the GDI convention of pointing at the last row.
destinationStride
Type: System.Int32
 Bytes from the start of one destination row to the start of the next. A positive value writes the top row of the image first, a negative value writes the bottom row first.
destinationCapacityInBytes
Type: System.Int32
Bytes available at destination.
Return Value
Type: Boolean
true if the frame was copied.
See Also
Reference
PostProcessFrameBufferEventArgs Class
TryCopyFrameBuffer Overload
Rhino.Display Namespace