RhinoCommon API
RenderContent.EndCreateDynamicFields Method
 You must call this after creating dynamic fields. Calls to this method are counted; you must call BeginCreateDynamicFields() once for every call to EndCreateDynamicFields().
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public void EndCreateDynamicFields()
Public Sub EndCreateDynamicFields
See Also
Reference
RenderContent Class
Rhino.Render Namespace