RhinoCommon API
PointCloud.CreateContourCurves Method (Point3d, Point3d, Double, Double)
 Creates a planar curves by intersecting a plane with a point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Curve[] CreateContourCurves(
	Point3d contourStart,
	Point3d contourEnd,
	double interval,
	double absoluteTolerance
)
Public Function CreateContourCurves (
	contourStart As Point3d,
	contourEnd As Point3d,
	interval As Double,
	absoluteTolerance As Double
) As Curve()
Parameters
contourStart
Type: Rhino.Geometry.Point3d
Start point for vector that is normal to contour plane.
contourEnd
Type: Rhino.Geometry.Point3d
End point for vector that is normal to contour plane.
interval
Type: System.Double
he interval or distance between contours.
absoluteTolerance
Type: System.Double
The document's model absolute tolerance
Return Value
Type: Curve[]
The intersection curves if successful, an empty array if unsuccessful.
See Also
Reference
PointCloud Class
CreateContourCurves Overload
Rhino.Geometry Namespace