RhinoCommon API
Curve.CreateCurve2View Method
 Creates a third curve from two curves that are planar in different construction planes. The new curve looks the same as each of the original curves when viewed in each plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Curve[] CreateCurve2View(
	Curve curveA,
	Curve curveB,
	Vector3d vectorA,
	Vector3d vectorB,
	double tolerance,
	double angleTolerance
)
Public Shared Function CreateCurve2View (
	curveA As Curve,
	curveB As Curve,
	vectorA As Vector3d,
	vectorB As Vector3d,
	tolerance As Double,
	angleTolerance As Double
) As Curve()
Parameters
curveA
Type: Rhino.Geometry.Curve
The first curve.
curveB
Type: Rhino.Geometry.Curve
The second curve.
vectorA
Type: Rhino.Geometry.Vector3d
A vector defining the normal direction of the plane which the first curve is drawn upon.
vectorB
Type: Rhino.Geometry.Vector3d
A vector defining the normal direction of the plane which the second curve is drawn upon.
tolerance
Type: System.Double
The tolerance for the operation.
angleTolerance
Type: System.Double
The angle tolerance for the operation.
Return Value
Type: Curve[]
An array containing one or more curves if successful.
See Also
Reference
Curve Class
Rhino.Geometry Namespace