RhinoCommon API
ArchivableDictionary.GetInteger Method (String)
 Get value as int, will only succeed if value was created using Set(string key, int value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int GetInteger(
	string key
)
Public Function GetInteger (
	key As String
) As Integer
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetInteger(System.String)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetInteger(System.String)"]
See Also
Reference
ArchivableDictionary Class
GetInteger Overload
Rhino.Collections Namespace