RhinoCommon API
SubDVertex.SetControlNetPoint Method
 Change the location of the "control net" point that this SubDVertex represents
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SetControlNetPoint(
	Point3d position,
	bool bClearNeighborhoodCache
)
Public Function SetControlNetPoint (
	position As Point3d,
	bClearNeighborhoodCache As Boolean
) As Boolean
Parameters
position
Type: Rhino.Geometry.Point3d
 New position for the vertex' control net point.
bClearNeighborhoodCache
Type: System.Boolean
 If true, clear the evaluation cache in the faces around the modified vertex.
Return Value
Type: Boolean
 true if the vertex' control net point was modified.
Remarks
 This method is provided to be able to set multiple control vertices, without clearing the neighborhood cache everytime as the ControlNetPoint property setter does. When you are done modifying your SubD, call subd.UpdateEvaluationCache() to refresh all caches.
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace