RhinoCommon API
RenderWindow.SaveDibAsBitmap Method
 Save current Dib of RenderWindow as file Helper function for debugging purposes.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SaveDibAsBitmap(
	string filename
)
Public Sub SaveDibAsBitmap (
	filename As String
)
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.Render.RenderWindow.SaveDibAsBitmap(System.String)"]
See Also
Reference
RenderWindow Class
Rhino.Render Namespace