RhinoCommon API
MeshTopologyVertexList.SortEdges Method
 Sorts the edge list for the mesh topology vertex list so that the edges are in radial order when you call ConnectedTopologyVertices. A non-manifold edge is treated as a boundary edge with respect to sorting. If any boundary or non-manifold edges end at the vertex, then the first edge will be a boundary or non-manifold edge.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SortEdges()
Public Function SortEdges As Boolean
Return Value
Type: Boolean
true on success.
See Also
Reference
MeshTopologyVertexList Class
SortEdges Overload
Rhino.Geometry.Collections Namespace