RhinoCommon API
RenderTexture.GenerateTextureSimulation Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GenerateTextureSimulation(System.Drawing.Bitmap@,Rhino.Render.RenderTexture.TextureEvaluatorFlags)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public virtual bool GenerateTextureSimulation(
	ref Bitmap bitmap,
	RenderTexture.TextureEvaluatorFlags ef
)
Public Overridable Function GenerateTextureSimulation (
	ByRef bitmap As Bitmap,
	ef As RenderTexture.TextureEvaluatorFlags
) As Boolean
Parameters
bitmap
Type: System.Drawing.Bitmap
[Missing <param name="bitmap"/> documentation for "M:Rhino.Render.RenderTexture.GenerateTextureSimulation(System.Drawing.Bitmap@,Rhino.Render.RenderTexture.TextureEvaluatorFlags)"]
ef
Type: Rhino.Render.RenderTexture.TextureEvaluatorFlags
[Missing <param name="ef"/> documentation for "M:Rhino.Render.RenderTexture.GenerateTextureSimulation(System.Drawing.Bitmap@,Rhino.Render.RenderTexture.TextureEvaluatorFlags)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GenerateTextureSimulation(System.Drawing.Bitmap@,Rhino.Render.RenderTexture.TextureEvaluatorFlags)"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace