RhinoCommon API
IPanelsService.ResizeFloating Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.ResizeFloating(System.Guid,System.Drawing.Size)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
bool ResizeFloating(
	Guid barId,
	Size size
)
Function ResizeFloating (
	barId As Guid,
	size As Size
) As Boolean
Parameters
barId
Type: System.Guid
[Missing <param name="barId"/> documentation for "M:Rhino.UI.IPanelsService.ResizeFloating(System.Guid,System.Drawing.Size)"]
size
Type: System.Drawing.Size
[Missing <param name="size"/> documentation for "M:Rhino.UI.IPanelsService.ResizeFloating(System.Guid,System.Drawing.Size)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.ResizeFloating(System.Guid,System.Drawing.Size)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace