RhinoCommon API
File3dmRenderMaterials.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.FileIO.File3dmRenderMaterials.GetEnumerator"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IEnumerator<File3dmRenderMaterial> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of File3dmRenderMaterial)
Return Value
Type: IEnumerator<File3dmRenderMaterial>
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderMaterials.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
File3dmRenderMaterials Class
Rhino.FileIO Namespace