RhinoCommon API
RhinoList<T>.Sort Method (Int32, Int32, IComparer<T>)
 Sorts the elements in a range of elements in list using the specified comparer.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Sort(
	int index,
	int count,
	IComparer<T> comparer
)
Public Sub Sort (
	index As Integer,
	count As Integer,
	comparer As IComparer(Of T)
)
Parameters
index
Type: System.Int32
The zero-based starting index of the range to sort.
count
Type: System.Int32
The length of the range to sort.
comparer
Type: System.Collections.Generic.IComparer<T>
The IComparer(T) implementation to use when comparing elements, or a null reference (Nothing in Visual Basic) to use the default comparer Comparer(T).Default.
See Also
Reference
RhinoList<T> Class
Sort Overload
Rhino.Collections Namespace