RhinoCommon API
PointCloud.Insert Method (Int32, Point3d, Vector3d, Color, Double)
 Inserts a new point into the point list.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public void Insert(
	int index,
	Point3d point,
	Vector3d normal,
	Color color,
	double value
)
Public Sub Insert (
	index As Integer,
	point As Point3d,
	normal As Vector3d,
	color As Color,
	value As Double
)
Parameters
index
Type: System.Int32
Insertion index.
point
Type: Rhino.Geometry.Point3d
Point to append.
normal
Type: Rhino.Geometry.Vector3d
Normal vector of new point.
color
Type: System.Drawing.Color
Color of new point.
value
Type: System.Double
 An extra value of new point. An extra values can be used to store a user-defined value, such as intensity.
See Also
Reference
PointCloud Class
Insert Overload
Rhino.Geometry Namespace