RhinoCommon API
PostEffectPipeline.SetStartTimeInMilliseconds Method
 Set the start time of the rendering in milliseconds since some unspecified epoch.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetStartTimeInMilliseconds(
	ulong ms
)
Public Sub SetStartTimeInMilliseconds (
	ms As ULong
)
Parameters
ms
Type: System.UInt64
milliseconds
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace