RhinoCommon API
Curve.CreateBooleanUnion Method (IEnumerable<Curve>, Double, Int32[])
 Calculates the boolean union of two or more closed, planar curves, and reports which input curve ended up in which output curve. Note, curves must be co-planar.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Curve[] CreateBooleanUnion(
	IEnumerable<Curve> curves,
	double tolerance,
	out int[] indexMap
)
Public Shared Function CreateBooleanUnion (
	curves As IEnumerable(Of Curve),
	tolerance As Double,
	<OutAttribute> ByRef indexMap As Integer()
) As Curve()
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
The co-planar curves to union.
tolerance
Type: System.Double
The 3d fitting and intersecting tolerance.
indexMap
Type: System.Int32[]
 An array with one entry per input curve. The value at index i is the index, in the returned array, of the union result that input curve i contributed to (the outer boundary curve of that result), or -1 if the input curve was not matched to any output curve. The input curves are indexed in the order they are enumerated curves.
Return Value
Type: Curve[]
Result curves on success, empty array if no union could be calculated.
See Also
Reference
Curve Class
CreateBooleanUnion Overload
Rhino.Geometry Namespace