RhinoCommon API
PlaneIntersectionCache Constructor
 Creates an empty cache.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PlaneIntersectionCache()
Public Sub New
See Also
Reference
PlaneIntersectionCache Class
Rhino.Geometry.Intersect Namespace