RhinoCommon API
Brep.CurveConstraint Constructor (Curve, Continuity)
 Subclass constructor for any continuity
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public CurveConstraint(
	Curve curve,
	Continuity continuity
)
Public Sub New (
	curve As Curve,
	continuity As Continuity
)
Parameters
curve
Type: Rhino.Geometry.Curve
The curve to use
continuity
Type: Rhino.Geometry.Continuity
[Missing <param name="continuity"/> documentation for "M:Rhino.Geometry.Brep.CurveConstraint.#ctor(Rhino.Geometry.Curve,Rhino.Geometry.Continuity)"]
See Also
Reference
Brep.CurveConstraint Class
Brep.CurveConstraint Overload
Rhino.Geometry Namespace