RhinoCommon API
FileCsvDocument.Read Method (TextReader)
 Reads CSV content from a text reader. The content is assumed to have no header row.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static FileCsvDocument Read(
	TextReader reader
)
Public Shared Function Read (
	reader As TextReader
) As FileCsvDocument
Parameters
reader
Type: System.IO.TextReader
The reader to read from.
Return Value
Type: FileCsvDocument
A new document populated with the contents of the reader.
See Also
Reference
FileCsvDocument Class
Read Overload
Rhino.FileIO Namespace