RhinoCommon API
RenderContent.FromXml Method (String)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.FromXml(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use other FromXml method")]
public static RenderContent FromXml(
	string xml
)
<ObsoleteAttribute("Use other FromXml method")>
Public Shared Function FromXml (
	xml As String
) As RenderContent
Parameters
xml
Type: System.String
[Missing <param name="xml"/> documentation for "M:Rhino.Render.RenderContent.FromXml(System.String)"]
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.FromXml(System.String)"]
See Also
Reference
RenderContent Class
FromXml Overload
Rhino.Render Namespace