RhinoCommon API
TrulyObservableOrderedSet<T> Constructor (IEqualityComparer<T>)
 Creates an empty instance.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TrulyObservableOrderedSet(
	IEqualityComparer<T> comparer = null
)
Public Sub New (
	Optional comparer As IEqualityComparer(Of T) = Nothing
)
Parameters
comparer (Optional)
Type: System.Collections.Generic.IEqualityComparer<T>
[Missing <param name="comparer"/> documentation for "M:Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.#ctor(System.Collections.Generic.IEqualityComparer{`0})"]
See Also
Reference
TrulyObservableOrderedSet<T> Class
TrulyObservableOrderedSet<T> Overload
Rhino.Runtime.Notifications Namespace