RhinoCommon API
Layer.DeletePerViewportSettings Method
 Deletes per viewport layer settings.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DeletePerViewportSettings(
	Guid viewportId
)
Public Sub DeletePerViewportSettings (
	viewportId As Guid
)
Parameters
viewportId
Type: System.Guid
 If not Guid.Empty, then the settings for that viewport are deleted. If Guid.Empty, then all per viewport settings are deleted.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace