RhinoCommon API
Skin.ShowChooseRecent Method
 Called when the host requests the Skin's "choose recent" UI. Default implementation is empty.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
protected virtual void ShowChooseRecent()
Protected Overridable Sub ShowChooseRecent
See Also
Reference
Skin Class
Rhino.Runtime Namespace