RhinoCommon API
PersistentSettings.TryGetPoint3d Method (String, Point3d, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetPoint3d(System.String,Rhino.Geometry.Point3d@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetPoint3d(
	string key,
	out Point3d value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetPoint3d (
	key As String,
	<OutAttribute> ByRef value As Point3d,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetPoint3d(System.String,Rhino.Geometry.Point3d@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: Rhino.Geometry.Point3d
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetPoint3d(System.String,Rhino.Geometry.Point3d@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetPoint3d(System.String,Rhino.Geometry.Point3d@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetPoint3d(System.String,Rhino.Geometry.Point3d@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetPoint3d Overload
Rhino Namespace