RhinoCommon API
RealtimeDisplayMode.IsFrameBufferAvailable Method
 Implement to tell the render pipeline that a framebuffer is ready
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool IsFrameBufferAvailable(
	ViewInfo view
)
Public MustOverride Function IsFrameBufferAvailable (
	view As ViewInfo
) As Boolean
Parameters
view
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="view"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.IsFrameBufferAvailable(Rhino.DocObjects.ViewInfo)"]
Return Value
Type: Boolean
Return true when a framebuffer is ready. This is generally the case when StartRenderer as returned successfully.
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace