RhinoCommon API
LayerTable.FindName Method (String, Int32)
 Finds the next layer that has an index equal or higher than the searched value.
Search in case-insensitive.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Layer FindName(
	string layerName,
	int startIndex
)
Public Function FindName (
	layerName As String,
	startIndex As Integer
) As Layer
Parameters
layerName
Type: System.String
The layer to search for.
startIndex
Type: System.Int32
If you specify RhinoMath.UnsetIntIndex, then also default layers will be included. This is the first index that will be tested.
Return Value
Type: Layer
A layer, or null.
See Also
Reference
LayerTable Class
FindName Overload
Rhino.DocObjects.Tables Namespace