RhinoCommon API
ViewportInfo.ChangeToParallelReflectedProjection Method
 When a viewport is set to Parallel Reflected projection, the geometry on the ceiling is shown as if it is mirrored to the floor below.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public bool ChangeToParallelReflectedProjection()
Public Function ChangeToParallelReflectedProjection As Boolean
Return Value
Type: Boolean
true if successful
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace