RhinoCommon API
BinaryArchiveReader.ReadGuidArray Method
 Reads an array of Guid from the archive.
An array is returned even if the input was another enumerable type.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid[] ReadGuidArray()
Public Function ReadGuidArray As Guid()
Return Value
Type: Guid[]
The array that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace