RhinoCommon API
ViewCaptureSettings.SetViewport Method
[Missing <summary> documentation for "M:Rhino.Display.ViewCaptureSettings.SetViewport(Rhino.Display.RhinoViewport)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public void SetViewport(
	RhinoViewport viewport
)
Public Sub SetViewport (
	viewport As RhinoViewport
)
Parameters
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.Display.ViewCaptureSettings.SetViewport(Rhino.Display.RhinoViewport)"]
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace