RhinoCommon API
MeshFace.RepairEx Method
 Attempts to repair this mesh face by taking both face indexes and actual vertex locations into account.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public bool RepairEx(
	ref Point3d[] points
)
Public Function RepairEx (
	ByRef points As Point3d()
) As Boolean
Parameters
points
Type: Rhino.Geometry.Point3d[]
Array of vertices with which to consider when repairing the face.
Return Value
Type: Boolean
true if the face was repaired, false if not.
Remarks
This function assumes the face is invalid and attempts to repair unconditionally. It is only worthwhile to call Repair on faces where IsValid returns false. This function is the analog of UnsafeNativeMethods.ON_MeshFace_Repair done completely here to avoid copying the point array.
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace