RhinoCommon API
LengthUnit.Size Method
 Returns the size of this unit expressed on a different length unit.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Size(
	 in LengthUnit unit
)
Public Function Size (
	 ByRef unit As LengthUnit
) As Double
Parameters
unit
Type: Rhino.LengthUnit
Size unit.
Return Value
Type: Double
The size of this length unit expressed on the specified length unit.
Remarks
 Size of None is always 1.0 expressed on any other length unit.
 Size of Unset is always NaN expressed on any other length unit.
See Also
Reference
LengthUnit Structure
Rhino Namespace