RhinoCommon API
StringParser.ParseAngleExpession Method
[Missing <summary> documentation for "M:Rhino.Input.StringParser.ParseAngleExpession(System.String,System.Int32,System.Int32,Rhino.Input.StringParserSettings,Rhino.AngleUnitSystem,System.Double@,Rhino.Input.StringParserSettings@,Rhino.AngleUnitSystem@)"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static int ParseAngleExpession(
	string expression,
	int start_offset,
	int expression_length,
	StringParserSettings parse_settings_in,
	AngleUnitSystem output_angle_unit_system,
	out double value_out,
	ref StringParserSettings parse_results,
	ref AngleUnitSystem parsed_unit_system
)
Public Shared Function ParseAngleExpession (
	expression As String,
	start_offset As Integer,
	expression_length As Integer,
	parse_settings_in As StringParserSettings,
	output_angle_unit_system As AngleUnitSystem,
	<OutAttribute> ByRef value_out As Double,
	ByRef parse_results As StringParserSettings,
	ByRef parsed_unit_system As AngleUnitSystem
) As Integer
Parameters
expression
Type: System.String
[Missing <param name="expression"/> documentation for "M:Rhino.Input.StringParser.ParseAngleExpession(System.String,System.Int32,System.Int32,Rhino.Input.StringParserSettings,Rhino.AngleUnitSystem,System.Double@,Rhino.Input.StringParserSettings@,Rhino.AngleUnitSystem@)"]
start_offset
Type: System.Int32
[Missing <param name="start_offset"/> documentation for "M:Rhino.Input.StringParser.ParseAngleExpession(System.String,System.Int32,System.Int32,Rhino.Input.StringParserSettings,Rhino.AngleUnitSystem,System.Double@,Rhino.Input.StringParserSettings@,Rhino.AngleUnitSystem@)"]
expression_length
Type: System.Int32
[Missing <param name="expression_length"/> documentation for "M:Rhino.Input.StringParser.ParseAngleExpession(System.String,System.Int32,System.Int32,Rhino.Input.StringParserSettings,Rhino.AngleUnitSystem,System.Double@,Rhino.Input.StringParserSettings@,Rhino.AngleUnitSystem@)"]
parse_settings_in
Type: Rhino.Input.StringParserSettings
[Missing <param name="parse_settings_in"/> documentation for "M:Rhino.Input.StringParser.ParseAngleExpession(System.String,System.Int32,System.Int32,Rhino.Input.StringParserSettings,Rhino.AngleUnitSystem,System.Double@,Rhino.Input.StringParserSettings@,Rhino.AngleUnitSystem@)"]
output_angle_unit_system
Type: Rhino.AngleUnitSystem
[Missing <param name="output_angle_unit_system"/> documentation for "M:Rhino.Input.StringParser.ParseAngleExpession(System.String,System.Int32,System.Int32,Rhino.Input.StringParserSettings,Rhino.AngleUnitSystem,System.Double@,Rhino.Input.StringParserSettings@,Rhino.AngleUnitSystem@)"]
value_out
Type: System.Double
[Missing <param name="value_out"/> documentation for "M:Rhino.Input.StringParser.ParseAngleExpession(System.String,System.Int32,System.Int32,Rhino.Input.StringParserSettings,Rhino.AngleUnitSystem,System.Double@,Rhino.Input.StringParserSettings@,Rhino.AngleUnitSystem@)"]
parse_results
Type: Rhino.Input.StringParserSettings
[Missing <param name="parse_results"/> documentation for "M:Rhino.Input.StringParser.ParseAngleExpession(System.String,System.Int32,System.Int32,Rhino.Input.StringParserSettings,Rhino.AngleUnitSystem,System.Double@,Rhino.Input.StringParserSettings@,Rhino.AngleUnitSystem@)"]
parsed_unit_system
Type: Rhino.AngleUnitSystem
[Missing <param name="parsed_unit_system"/> documentation for "M:Rhino.Input.StringParser.ParseAngleExpession(System.String,System.Int32,System.Int32,Rhino.Input.StringParserSettings,Rhino.AngleUnitSystem,System.Double@,Rhino.Input.StringParserSettings@,Rhino.AngleUnitSystem@)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Input.StringParser.ParseAngleExpession(System.String,System.Int32,System.Int32,Rhino.Input.StringParserSettings,Rhino.AngleUnitSystem,System.Double@,Rhino.Input.StringParserSettings@,Rhino.AngleUnitSystem@)"]
See Also
Reference
StringParser Class
Rhino.Input Namespace