RhinoCommon API
Circle.ToNurbsCurve Method (Int32, Int32)
 Create a uniform non-rational cubic NURBS approximation of a circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public NurbsCurve ToNurbsCurve(
	int degree,
	int cvCount
)
Public Function ToNurbsCurve (
	degree As Integer,
	cvCount As Integer
) As NurbsCurve
Parameters
degree
Type: System.Int32
>=1
cvCount
Type: System.Int32
cv count >=5
Return Value
Type: NurbsCurve
NURBS curve approximation of a circle on success
See Also
Reference
Circle Structure
ToNurbsCurve Overload
Rhino.Geometry Namespace