RhinoCommon API
DisplayPipeline.AvailableOpenGLVersion Method
 If Rhino is using OpenGL for display, this function will return major.minor version of OpenGL available for this instance of Rhino
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.21
Syntax
public static uint AvailableOpenGLVersion(
	out bool coreProfile
)
Public Shared Function AvailableOpenGLVersion (
	<OutAttribute> ByRef coreProfile As Boolean
) As UInteger
Parameters
coreProfile
Type: System.Boolean
 If true, OpenGL is being used in "core profile" mode
Return Value
Type: UInt32
 major version * 10 + minor version For example, OpenGL 4.5 returns 45
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace