RhinoCommon API
DisplayPipeline.DrawLines Method (Line[], DisplayPen)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawLines(Rhino.Geometry.Line[],Rhino.Display.DisplayPen)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void DrawLines(
	Line[] lines,
	DisplayPen pen
)
Public Sub DrawLines (
	lines As Line(),
	pen As DisplayPen
)
Parameters
lines
Type: Rhino.Geometry.Line[]
[Missing <param name="lines"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawLines(Rhino.Geometry.Line[],Rhino.Display.DisplayPen)"]
pen
Type: Rhino.Display.DisplayPen
[Missing <param name="pen"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawLines(Rhino.Geometry.Line[],Rhino.Display.DisplayPen)"]
See Also
Reference
DisplayPipeline Class
DrawLines Overload
Rhino.Display Namespace