RhinoCommon API
Dimension.Explode Method
 Explodes this dimension into its geometric components.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public GeometryBase[] Explode()
Public Function Explode As GeometryBase()
Return Value
Type: GeometryBase[]
 An array of Curve and TextEntity objects. If the leader is using user-defined arrowheads, InstanceReferenceGeometry objects will be included.
See Also
Reference
Dimension Class
Rhino.Geometry Namespace