RhinoCommon API
Field Constructor (RenderContent, String, String, Object, Boolean, Boolean, Int32)
Initializes a new instance of the Field class
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Field(
	RenderContent renderContent,
	string name,
	string prompt,
	Object initialValue,
	bool isTextured,
	bool treatAsLinear,
	int sectionId
)
Protected Sub New (
	renderContent As RenderContent,
	name As String,
	prompt As String,
	initialValue As Object,
	isTextured As Boolean,
	treatAsLinear As Boolean,
	sectionId As Integer
)
Parameters
renderContent
Type: Rhino.Render.RenderContent
[Missing <param name="renderContent"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean,System.Boolean,System.Int32)"]
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean,System.Boolean,System.Int32)"]
prompt
Type: System.String
[Missing <param name="prompt"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean,System.Boolean,System.Int32)"]
initialValue
Type: System.Object
[Missing <param name="initialValue"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean,System.Boolean,System.Int32)"]
isTextured
Type: System.Boolean
[Missing <param name="isTextured"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean,System.Boolean,System.Int32)"]
treatAsLinear
Type: System.Boolean
[Missing <param name="treatAsLinear"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean,System.Boolean,System.Int32)"]
sectionId
Type: System.Int32
[Missing <param name="sectionId"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean,System.Boolean,System.Int32)"]
See Also
Reference
Field Class
Field Overload
Rhino.Render.Fields Namespace