RhinoCommon API
PersistentSettings.GetRectangle Method (String, Rectangle, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetRectangle(System.String,System.Drawing.Rectangle,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Rectangle GetRectangle(
	string key,
	Rectangle defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetRectangle (
	key As String,
	defaultValue As Rectangle,
	legacyKeyList As IEnumerable(Of String)
) As Rectangle
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetRectangle(System.String,System.Drawing.Rectangle,System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.Drawing.Rectangle
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetRectangle(System.String,System.Drawing.Rectangle,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetRectangle(System.String,System.Drawing.Rectangle,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Rectangle
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetRectangle(System.String,System.Drawing.Rectangle,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetRectangle Overload
Rhino Namespace