RhinoCommon API
ObjectAttributes.SetObjectFrame Method (Transform)
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.SetObjectFrame(Rhino.Geometry.Transform)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetObjectFrame(
	Transform xform
)
Public Sub SetObjectFrame (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
[Missing <param name="xform"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.SetObjectFrame(Rhino.Geometry.Transform)"]
See Also
Reference
ObjectAttributes Class
SetObjectFrame Overload
Rhino.DocObjects Namespace