RhinoCommon API
File3dmWriteOptions.EnableAnalysisMeshes Method
 Activates saving of analysis meshes for specific types of objects. If you do not specify the state for an object type, its default is used. Currently SubD mesh saving is disabled by default, while Brep and Extrusion is enabled.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void EnableAnalysisMeshes(
	ObjectType objectType,
	bool enable
)
Public Sub EnableAnalysisMeshes (
	objectType As ObjectType,
	enable As Boolean
)
Parameters
objectType
Type: Rhino.DocObjects.ObjectType
The object type. Mostly mesh, brep, extrusion and SubD (or their flag combinations) make sense here.
DO NOT specify a 'filter' or sub-object type.
enable
Type: System.Boolean
If false, disables saving for this object type.
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace