RhinoCommon API
ArchivableDictionary.Set Method (String, Int64)
 Sets a Int64.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Set(
	string key,
	long val
)
Public Function Set (
	key As String,
	val As Long
) As Boolean
Parameters
key
Type: System.String
The text key.
val
Type: System.Int64
A Int64.
Because Int64 has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
true if set operation succeeded, otherwise false.
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace