RhinoCommon API
RhinoObject.ShortDescriptionWithClosedStatus Method
 Gets a localized short descriptive name of the object, along with it's open/closed status.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string ShortDescriptionWithClosedStatus(
	bool prepend,
	bool plural,
	out int status
)
Public Function ShortDescriptionWithClosedStatus (
	prepend As Boolean,
	plural As Boolean,
	<OutAttribute> ByRef status As Integer
) As String
Parameters
prepend
Type: System.Boolean
true if "open" or "closed" should be prepended to the descriptive name.
plural
Type: System.Boolean
true if the descriptive name should in plural.
status
Type: System.Int32
The open/closed status, where: 0 = undefined, 1 = open, 2 = closed.
Return Value
Type: String
A string with the short localized descriptive name.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace