RhinoCommon API
RenderContent.IsOverridden Method
 Checks if a method is overridden.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected static bool IsOverridden(
	MethodInfo method
)
Protected Shared Function IsOverridden (
	method As MethodInfo
) As Boolean
Parameters
method
Type: System.Reflection.MethodInfo
[Missing <param name="method"/> documentation for "M:Rhino.Render.RenderContent.IsOverridden(System.Reflection.MethodInfo)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.IsOverridden(System.Reflection.MethodInfo)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace