RhinoCommon API
CommandLineOption.ToggleValues Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.CommandLineOption.ToggleValues(System.Boolean,System.String@,System.String@)"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void ToggleValues(
	bool english,
	out string offValue,
	out string onValue
)
Public Sub ToggleValues (
	english As Boolean,
	<OutAttribute> ByRef offValue As String,
	<OutAttribute> ByRef onValue As String
)
Parameters
english
Type: System.Boolean
[Missing <param name="english"/> documentation for "M:Rhino.Input.Custom.CommandLineOption.ToggleValues(System.Boolean,System.String@,System.String@)"]
offValue
Type: System.String
[Missing <param name="offValue"/> documentation for "M:Rhino.Input.Custom.CommandLineOption.ToggleValues(System.Boolean,System.String@,System.String@)"]
onValue
Type: System.String
[Missing <param name="onValue"/> documentation for "M:Rhino.Input.Custom.CommandLineOption.ToggleValues(System.Boolean,System.String@,System.String@)"]
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace