RhinoCommon API
VolumeMassProperties.Compute Method (IEnumerable<GeometryBase>, Boolean, Boolean, Boolean, Boolean)
 Computes the VolumeMassProperties for a collection of geometric objects. At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static VolumeMassProperties Compute(
	IEnumerable<GeometryBase> geometry,
	bool volume,
	bool firstMoments,
	bool secondMoments,
	bool productMoments
)
Public Shared Function Compute (
	geometry As IEnumerable(Of GeometryBase),
	volume As Boolean,
	firstMoments As Boolean,
	secondMoments As Boolean,
	productMoments As Boolean
) As VolumeMassProperties
Parameters
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
Objects to include in the volume computation.
volume
Type: System.Boolean
true to calculate volume.
firstMoments
Type: System.Boolean
true to calculate volume first moments, volume, and volume centroid.
secondMoments
Type: System.Boolean
true to calculate volume second moments.
productMoments
Type: System.Boolean
true to calculate volume product moments.
Return Value
Type: VolumeMassProperties
The VolumeMassProperties for the entire collection or null on failure.
See Also
Reference
VolumeMassProperties Class
Compute Overload
Rhino.Geometry Namespace