RhinoCommon API
Curve.PullToBrepFace Method (Curve, BrepFace, Double, Boolean)
 Pull a curve to a BrepFace using closest point projection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.17
Syntax
public static Curve[] PullToBrepFace(
	Curve curve,
	BrepFace face,
	double tolerance,
	bool loose
)
Public Shared Function PullToBrepFace (
	curve As Curve,
	face As BrepFace,
	tolerance As Double,
	loose As Boolean
) As Curve()
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to pull.
face
Type: Rhino.Geometry.BrepFace
Brep face that pulls.
tolerance
Type: System.Double
Tolerance to use for pulling.
loose
Type: System.Boolean
 If true, the curve's edit points are pulled back to the Brep face's underlying surface. If any edit point misses the surface, the curve will not be created.
Return Value
Type: Curve[]
An array of pulled curves, or an empty array on failure.
See Also
Reference
Curve Class
PullToBrepFace Overload
Rhino.Geometry Namespace