RhinoCommon API
AppearanceSettings.UpdateFromState Method
 Sets all settings to a particular defined joined state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void UpdateFromState(
	AppearanceSettingsState state
)
Public Shared Sub UpdateFromState (
	state As AppearanceSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.AppearanceSettingsState
A joined settings object.
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace