RhinoCommon API
SupportOptions.SetMultithreadedTextureEvaluation Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetMultithreadedTextureEvaluation(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void SetMultithreadedTextureEvaluation(
	bool b
)
Public Shared Sub SetMultithreadedTextureEvaluation (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetMultithreadedTextureEvaluation(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace