RhinoCommon API
RenderTexture.CreateEvaluator Method (RenderTexture.TextureEvaluatorFlags)
 Constructs a texture evaluator. This is an independent lightweight object capable of evaluating texture color throughout uvw space. May be called from within a rendering shade pipeline.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual TextureEvaluator CreateEvaluator(
	RenderTexture.TextureEvaluatorFlags evaluatorFlags
)
Public Overridable Function CreateEvaluator (
	evaluatorFlags As RenderTexture.TextureEvaluatorFlags
) As TextureEvaluator
Parameters
evaluatorFlags
Type: Rhino.Render.RenderTexture.TextureEvaluatorFlags
[Missing <param name="evaluatorFlags"/> documentation for "M:Rhino.Render.RenderTexture.CreateEvaluator(Rhino.Render.RenderTexture.TextureEvaluatorFlags)"]
Return Value
Type: TextureEvaluator
A texture evaluator instance.
See Also
Reference
RenderTexture Class
CreateEvaluator Overload
Rhino.Render Namespace