RhinoCommon API
ZooClientParameters.VerifyLicenseKey Method
 Called by GetLicense to ensure that the license key entered by the user is legitimate and can be used.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ValidateResult VerifyLicenseKey(
	string licenseKey,
	string validationCode,
	DateTime validationCodeInstallDate,
	bool gracePeriodExpired,
	out LicenseData licenseData
)
Public Function VerifyLicenseKey (
	licenseKey As String,
	validationCode As String,
	validationCodeInstallDate As DateTime,
	gracePeriodExpired As Boolean,
	<OutAttribute> ByRef licenseData As LicenseData
) As ValidateResult
Parameters
licenseKey
Type: System.String
License key string entered by user
validationCode
Type: System.String
Validation code entered by user (only if a previous call to VerifyLicenseKey set LicenseData.RequiresOnlineValidation to true).
validationCodeInstallDate
Type: System.DateTime
Date that validation code was entered by user (only if a previous call to VerifyLicenseKey set LicenseData.RequiresOnlineValidation to true).
gracePeriodExpired
Type: System.Boolean
Date by which license validation must complete successfully.
licenseData
Type: Rhino.PlugIns.LicenseData
Output parameter where return data about the license is set.
Return Value
Type: ValidateResult
[Missing <returns> documentation for "M:Rhino.Runtime.ZooClientParameters.VerifyLicenseKey(System.String,System.String,System.DateTime,System.Boolean,Rhino.PlugIns.LicenseData@)"]
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace