RhinoCommon API
Command.RunProxyCommand Method
 Execute some code as if it were running in a command
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.13
Syntax
public static void RunProxyCommand(
	Command.RunCommandDelegate commandCallback,
	RhinoDoc doc,
	Object data
)
Public Shared Sub RunProxyCommand (
	commandCallback As Command.RunCommandDelegate,
	doc As RhinoDoc,
	data As Object
)
Parameters
commandCallback
Type: Rhino.Commands.Command.RunCommandDelegate
[Missing <param name="commandCallback"/> documentation for "M:Rhino.Commands.Command.RunProxyCommand(Rhino.Commands.Command.RunCommandDelegate,Rhino.RhinoDoc,System.Object)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Commands.Command.RunProxyCommand(Rhino.Commands.Command.RunCommandDelegate,Rhino.RhinoDoc,System.Object)"]
data
Type: System.Object
optional extra data to pass to callback
See Also
Reference
Command Class
Rhino.Commands Namespace