RhinoCommon API
BinaryArchiveReader.ReadBoundingBox Method
 Reads a BoundingBox from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox ReadBoundingBox()
Public Function ReadBoundingBox As BoundingBox
Return Value
Type: BoundingBox
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace