RhinoCommon API
RenderContent.LoadFromFile Method
 Loads content from a library file. Does not add the content to the document. Use RhinoDoc.RenderMaterials.Add or similar.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public static RenderContent LoadFromFile(
	string filename
)
Public Shared Function LoadFromFile (
	filename As String
) As RenderContent
Parameters
filename
Type: System.String
full path to the file to be loaded.
Return Value
Type: RenderContent
The loaded content or null if an error occurred.
See Also
Reference
RenderContent Class
Rhino.Render Namespace