RhinoCommon API
LengthUnit.FromKnownUnitSystem Method
 Constructs a LengthUnit from a UnitSystem.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static LengthUnit FromKnownUnitSystem(
	UnitSystem knownUnitSystem
)
Public Shared Function FromKnownUnitSystem (
	knownUnitSystem As UnitSystem
) As LengthUnit
Parameters
knownUnitSystem
Type: Rhino.UnitSystem
A known unit system.
Return Value
Type: LengthUnit
[Missing <returns> documentation for "M:Rhino.LengthUnit.FromKnownUnitSystem(Rhino.UnitSystem)"]
See Also
Reference
LengthUnit Structure
Rhino Namespace