RhinoCommon API
SweepTwoRail Constructor
Initializes a new instance of the SweepTwoRail class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SweepTwoRail()
Public Sub New
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace