RhinoCommon API
CommonObject.EnsurePrivateCopy Method
 If you want to keep a copy of this class around by holding onto it in a variable after a command completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can call this function as many times as you want.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void EnsurePrivateCopy()
Public Sub EnsurePrivateCopy
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace