RhinoCommon API
GroupTable.PurgeUnused Method
 Purges any unused groups.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PurgeUnused()
Public Function PurgeUnused As Integer
Return Value
Type: Int32
The number of unused groups that were purged.
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace