RhinoCommon API
BinaryArchiveWriter.WriteRectangleF Method
 Writes a RectangleF value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteRectangleF(
	RectangleF value
)
Public Sub WriteRectangleF (
	value As RectangleF
)
Parameters
value
Type: System.Drawing.RectangleF
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace