RhinoCommon API
GetPoint.Snap Method
 Calculates the point the current object snap settings would produce, in the specified view, given a test point. This function does not prompt.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool Snap(
	RhinoView view,
	Point3d testPoint,
	out Point3d snapPoint,
	out OsnapModes osnapMode
)
Public Shared Function Snap (
	view As RhinoView,
	testPoint As Point3d,
	<OutAttribute> ByRef snapPoint As Point3d,
	<OutAttribute> ByRef osnapMode As OsnapModes
) As Boolean
Parameters
view
Type: Rhino.Display.RhinoView
The view in which to snap.
testPoint
Type: Rhino.Geometry.Point3d
The world coordinate point to snap.
snapPoint
Type: Rhino.Geometry.Point3d
 The snapped point. If no object snap applied, then testPoint is returned.
osnapMode
Type: Rhino.ApplicationSettings.OsnapModes
 The type of object snap used to obtain the point. If no object snap applied, then OsnapModes.None is returned.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace