RhinoCommon API
GetOption.Get Method
 Call to get an option. A return value of "option" means the user selected a valid option. Use Option() the determine which option.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GetResult Get()
Public Function Get As GetResult
Return Value
Type: GetResult
If the user chose an option, then Option; another enumeration value otherwise.
See Also
Reference
GetOption Class
Rhino.Input.Custom Namespace