RhinoCommon API
Worksession.FileNameFromRuntimeSerialNumber Method
 Returns the path to the open worksession, or .rws, file. If there is no worksession file open, or the active worksession has not yet been saved, then null is returned.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static string FileNameFromRuntimeSerialNumber(
	uint runtimeSerialNumber
)
Public Shared Function FileNameFromRuntimeSerialNumber (
	runtimeSerialNumber As UInteger
) As String
Parameters
runtimeSerialNumber
Type: System.UInt32
 Since Rhino 9 worksessions are per-document and no longer have serial numbers of their own, so this is a document's RuntimeSerialNumber. In new code, prefer getting the document and using its WorksessionFileName.
Return Value
Type: String
The path to the .rws file, or null.
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace