RhinoCommon API
GripUserInterfaceObject Constructor (Point3d)
Initializes a new instance of the GripUserInterfaceObject class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public GripUserInterfaceObject(
	Point3d location
)
Public Sub New (
	location As Point3d
)
Parameters
location
Type: Rhino.Geometry.Point3d
[Missing <param name="location"/> documentation for "M:Rhino.UI.GripUserInterfaceObject.#ctor(Rhino.Geometry.Point3d)"]
See Also
Reference
GripUserInterfaceObject Class
GripUserInterfaceObject Overload
Rhino.UI Namespace