RhinoCommon API
GetObject.ActiveGetObject Method
 Get the currently running GetObject for a given document
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static GetObject ActiveGetObject(
	RhinoDoc doc
)
Public Shared Function ActiveGetObject (
	doc As RhinoDoc
) As GetObject
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Input.Custom.GetObject.ActiveGetObject(Rhino.RhinoDoc)"]
Return Value
Type: GetObject
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetObject.ActiveGetObject(Rhino.RhinoDoc)"]
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace