RhinoCommon API
ObjectTable.Delete Method (RhinoObject)
 Deletes an object, taking into account modes and not showing error message boxes.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override bool Delete(
	RhinoObject item
)
Public Overrides Function Delete (
	item As RhinoObject
) As Boolean
Parameters
item
Type: Rhino.DocObjects.RhinoObject
The object to delete.
Return Value
Type: Boolean
True on success.
See Also
Reference
ObjectTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace