RhinoCommon API
ScaleValue.Create Method (LengthValue, LengthValue, ScaleValue.ScaleStringFormat)
 Create from 2 length values
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ScaleValue Create(
	LengthValue left,
	LengthValue right,
	ScaleValue.ScaleStringFormat format
)
Public Shared Function Create (
	left As LengthValue,
	right As LengthValue,
	format As ScaleValue.ScaleStringFormat
) As ScaleValue
Parameters
left
Type: Rhino.LengthValue
[Missing <param name="left"/> documentation for "M:Rhino.ScaleValue.Create(Rhino.LengthValue,Rhino.LengthValue,Rhino.ScaleValue.ScaleStringFormat)"]
right
Type: Rhino.LengthValue
[Missing <param name="right"/> documentation for "M:Rhino.ScaleValue.Create(Rhino.LengthValue,Rhino.LengthValue,Rhino.ScaleValue.ScaleStringFormat)"]
format
Type: Rhino.ScaleValue.ScaleStringFormat
[Missing <param name="format"/> documentation for "M:Rhino.ScaleValue.Create(Rhino.LengthValue,Rhino.LengthValue,Rhino.ScaleValue.ScaleStringFormat)"]
Return Value
Type: ScaleValue
[Missing <returns> documentation for "M:Rhino.ScaleValue.Create(Rhino.LengthValue,Rhino.LengthValue,Rhino.ScaleValue.ScaleStringFormat)"]
See Also
Reference
ScaleValue Class
Create Overload
Rhino Namespace