RhinoCommon API
SupportOptions.SetTextureSize Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetTextureSize(Rhino.Render.SupportOptions.RdkTextureSize,System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Support for changing the texture size programatically will disappear in a future version of Rhino")]
public static void SetTextureSize(
	SupportOptions.RdkTextureSize size,
	bool bSendEvent
)
<ObsoleteAttribute("Support for changing the texture size programatically will disappear in a future version of Rhino")>
Public Shared Sub SetTextureSize (
	size As SupportOptions.RdkTextureSize,
	bSendEvent As Boolean
)
Parameters
size
Type: Rhino.Render.SupportOptions.RdkTextureSize
[Missing <param name="size"/> documentation for "M:Rhino.Render.SupportOptions.SetTextureSize(Rhino.Render.SupportOptions.RdkTextureSize,System.Boolean)"]
bSendEvent
Type: System.Boolean
[Missing <param name="bSendEvent"/> documentation for "M:Rhino.Render.SupportOptions.SetTextureSize(Rhino.Render.SupportOptions.RdkTextureSize,System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace