RhinoCommon API
File3dmObjectTable.AddAngularDimension Method (AngularDimension, ObjectAttributes)
 Adds a angular dimension object to the 3dm file object table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public Guid AddAngularDimension(
	AngularDimension dimension,
	ObjectAttributes attributes
)
Public Function AddAngularDimension (
	dimension As AngularDimension,
	attributes As ObjectAttributes
) As Guid
Parameters
dimension
Type: Rhino.Geometry.AngularDimension
Dimension object to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to dimension.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddAngularDimension Overload
Rhino.FileIO Namespace