RhinoCommon API
SubDEdgeSharpness.Equals Method (SubDEdgeSharpness)
 Determines whether this sharpness has the same end values as another one.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool Equals(
	SubDEdgeSharpness other
)
Public Function Equals (
	other As SubDEdgeSharpness
) As Boolean
Parameters
other
Type: Rhino.Geometry.SubDEdgeSharpness
The sharpness to compare with.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgeSharpness.Equals(Rhino.Geometry.SubDEdgeSharpness)"]
Implements
IEquatable<T>.Equals(T)
See Also
Reference
SubDEdgeSharpness Structure
Equals Overload
Rhino.Geometry Namespace