RhinoCommon API
SectionStyleTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.SectionStyleTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public override IEnumerator<SectionStyle> GetEnumerator()
Public Overrides Function GetEnumerator As IEnumerator(Of SectionStyle)
Return Value
Type: IEnumerator<SectionStyle>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.SectionStyleTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
IEnumerable<T>.GetEnumerator()
See Also
Reference
SectionStyleTable Class
Rhino.DocObjects.Tables Namespace