RhinoCommon API
Transform.IsZeroTransformationWithTolerance Method
 True if all values are 0 within tolerance, except for M33 which is exactly 1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool IsZeroTransformationWithTolerance(
	double zeroTolerance
)
Public Function IsZeroTransformationWithTolerance (
	zeroTolerance As Double
) As Boolean
Parameters
zeroTolerance
Type: System.Double
The tolerance for 0 elements.
Return Value
Type: Boolean
 True if the transformation matrix is ON_Xform::ZeroTransformation, with xform[3][3] equal to 1: 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 An element x of the matrix is "zero" if fabs(x) ≤ zeroTolerance. IsZeroTransformation is the same as IsZeroTransformationWithTolerance(0.0)
See Also
Reference
Transform Structure
Rhino.Geometry Namespace