RhinoCommon API
Transform.Multiply Operator (Transform, Transform)
 Multiplies (combines) two transformations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Transform operator *(
	Transform a,
	Transform b
)
Public Shared Operator * (
	a As Transform,
	b As Transform
) As Transform
Parameters
a
Type: Rhino.Geometry.Transform
First transformation.
b
Type: Rhino.Geometry.Transform
Second transformation.
Return Value
Type: Transform
A transformation matrix that combines the effect of both input transformations. The resulting Transform gives the same result as though you'd first apply B then A.
See Also
Reference
Transform Structure
Multiply Overload
Rhino.Geometry Namespace