RhinoCommon API
CurveBooleanRegions.RegionPointIndex Method
 If this object were created using the Curve.CreateBooleanRegions override that accepts a collection of points as input, then you this method to retrieve the index of the point contained in a curve region. If this.RegionPointIndex(i) = n, then points[i] is contained in this.RegionCurves(n). If points[i] is not in any region, then this.RegionPointIndex(i) = -1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int RegionPointIndex(
	int pointIndex
)
Public Function RegionPointIndex (
	pointIndex As Integer
) As Integer
Parameters
pointIndex
Type: System.Int32
The point index.
Return Value
Type: Int32
 The index of the input point contained in the specified region if successful, or -1 if points[i] was not used in any region or if not successful.
See Also
Reference
CurveBooleanRegions Class
Rhino.Geometry Namespace