RhinoCommon API
ViewInfo.ClippingPlaneSurfaces Method
 Returns a list of ClippingPlaneSurfaces for this view.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.17
Syntax
public ClippingPlaneSurface[] ClippingPlaneSurfaces()
Public Function ClippingPlaneSurfaces As ClippingPlaneSurface()
Return Value
Type: ClippingPlaneSurface[]
[Missing <returns> documentation for "M:Rhino.DocObjects.ViewInfo.ClippingPlaneSurfaces"]
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace