RhinoCommon API
PostEffectCollection.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.GetEnumerator"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IEnumerator<PostEffectData> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of PostEffectData)
Return Value
Type: IEnumerator<PostEffectData>
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
PostEffectCollection Class
Rhino.Render.PostEffects Namespace