RhinoCommon API
File3dm.IsValid Method (String)
Note: This API is now obsolete.
 The File3dm object is kept consistent during its creation. Therefore, this function now returns only true.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("IsValid now returns always true.")]
public bool IsValid(
	out string errors
)
<ObsoleteAttribute("IsValid now returns always true.")>
Public Function IsValid (
	<OutAttribute> ByRef errors As String
) As Boolean
Parameters
errors
Type: System.String
 No errors are found.
Return Value
Type: Boolean
true in any case.
See Also
Reference
File3dm Class
IsValid Overload
Rhino.FileIO Namespace