RhinoCommon API
RhinoDocUndoRecord Constructor (RhinoDoc, String)
 Begin a RhinoDoc undo record.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.23
Syntax
public RhinoDocUndoRecord(
	RhinoDoc doc,
	string description
)
Public Sub New (
	doc As RhinoDoc,
	description As String
)
Parameters
doc
Type: Rhino.RhinoDoc
The active document.
description
Type: System.String
A description of the record.
See Also
Reference
RhinoDocUndoRecord Class
RhinoDocUndoRecord Overload
Rhino Namespace