RhinoCommon API
Skylight Constructor (Skylight)
 Create a utility object not associated with any document from another object
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Skylight(
	Skylight src
)
Public Sub New (
	src As Skylight
)
Parameters
src
Type: Rhino.Render.Skylight
[Missing <param name="src"/> documentation for "M:Rhino.Render.Skylight.#ctor(Rhino.Render.Skylight)"]
See Also
Reference
Skylight Class
Skylight Overload
Rhino.Render Namespace