RhinoCommon API
GetBaseClass.AddOptionString Method (LocalizeStringPair, OptionString, String)
 Add a command line option to get a string and automatically save the value.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int AddOptionString(
	LocalizeStringPair optionName,
	ref OptionString stringValue,
	string prompt
)
Public Function AddOptionString (
	optionName As LocalizeStringPair,
	ByRef stringValue As OptionString,
	prompt As String
) As Integer
Parameters
optionName
Type: Rhino.UI.LocalizeStringPair
The option description.
stringValue
Type: Rhino.Input.Custom.OptionString
The current string value.
prompt
Type: System.String
Command prompt to be shown if the picks this option.
Return Value
Type: Int32
The option index value (>0) or 0 if option cannot be added.
See Also
Reference
GetBaseClass Class
AddOptionString Overload
Rhino.Input.Custom Namespace