RhinoCommon API
GeometryBase.GetBoundingBox Method (Plane, Box)
 Aligned Bounding box solver. Gets the plane aligned bounding box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox GetBoundingBox(
	Plane plane,
	out Box worldBox
)
Public Function GetBoundingBox (
	plane As Plane,
	<OutAttribute> ByRef worldBox As Box
) As BoundingBox
Parameters
plane
Type: Rhino.Geometry.Plane
Orientation plane for BoundingBox.
worldBox
Type: Rhino.Geometry.Box
Aligned box in World coordinates.
Return Value
Type: BoundingBox
A BoundingBox in plane coordinates.
See Also
Reference
GeometryBase Class
GetBoundingBox Overload
Rhino.Geometry Namespace