RhinoCommon API
DrawingUtilities.MakeArgb Method
 Stores a color into an integer from 4 bytes.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static int MakeArgb(
	byte a,
	byte r,
	byte g,
	byte b
)
Public Shared Function MakeArgb (
	a As Byte,
	r As Byte,
	g As Byte,
	b As Byte
) As Integer
Parameters
a
Type: System.Byte
Alpha (between 0 and 255)
r
Type: System.Byte
Red (between 0 and 255)
g
Type: System.Byte
Green (between 0 and 255)
b
Type: System.Byte
Blue (between 0 and 255)
Return Value
Type: Int32
An integer containing the ARGB data
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace