RhinoCommon API
GetBaseClass.GotDefault Method
 Returns true if user pressed Enter to accept a default point, number, or string set using SetDefaultPoint, SetDefaultNumber, or SetDefaultString.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool GotDefault()
Public Function GotDefault As Boolean
Return Value
Type: Boolean
true if the result if the default point, number or string set. Otherwise, false.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace