RhinoCommon API
ArchivableDictionary.Set Method (String, Point)
 Sets a Point.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Set(
	string key,
	Point val
)
Public Function Set (
	key As String,
	val As Point
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: System.Drawing.Point
A value for that key.
Because Point has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,System.Drawing.Point)"]
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace