RhinoCommon API
LengthValue.ChangeUnits Method
 Change the UnitSystem of a LengthValue The numeric value of Length is scaled by new_us / current unit system so that the absolute length stays the same
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public LengthValue ChangeUnits(
	LengthUnit newUnits
)
Public Function ChangeUnits (
	newUnits As LengthUnit
) As LengthValue
Parameters
newUnits
Type: Rhino.LengthUnit
[Missing <param name="newUnits"/> documentation for "M:Rhino.LengthValue.ChangeUnits(Rhino.LengthUnit)"]
Return Value
Type: LengthValue
[Missing <returns> documentation for "M:Rhino.LengthValue.ChangeUnits(Rhino.LengthUnit)"]
See Also
Reference
LengthValue Class
Rhino Namespace