RhinoCommon API
MarkupTable.Delete Method (IEnumerable<Int32>, Boolean)
 Delete multiple markups.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Delete(
	IEnumerable<int> markupIndices,
	bool quiet
)
Public Function Delete (
	markupIndices As IEnumerable(Of Integer),
	quiet As Boolean
) As Integer
Parameters
markupIndices
Type: System.Collections.Generic.IEnumerable<Int32>
An enumeration of markup indices.
quiet
Type: System.Boolean
If true, no warning message box appears if a markup is in use.
Return Value
Type: Int32
The number of markups that were deleted.
See Also
Reference
MarkupTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace