RhinoCommon API
FileX3dv.Write Method
Write a x3dv file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	FileX3dvWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As FileX3dvWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileX3dvWriteOptions
options used for generating the x3dv file
Return Value
Type: Boolean
true on success
See Also
Reference
FileX3dv Class
Rhino.FileIO Namespace