RhinoCommon API
NurbsCurve.MakeCompatible Method
 For expert use only. From the input curves, make an array of compatible NURBS curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static NurbsCurve[] MakeCompatible(
	IEnumerable<Curve> curves,
	Point3d startPt,
	Point3d endPt,
	int simplifyMethod,
	int numPoints,
	double refitTolerance,
	double angleTolerance
)
Public Shared Function MakeCompatible (
	curves As IEnumerable(Of Curve),
	startPt As Point3d,
	endPt As Point3d,
	simplifyMethod As Integer,
	numPoints As Integer,
	refitTolerance As Double,
	angleTolerance As Double
) As NurbsCurve()
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
The input curves.
startPt
Type: Rhino.Geometry.Point3d
The start point. To omit, specify Point3d.Unset.
endPt
Type: Rhino.Geometry.Point3d
The end point. To omit, specify Point3d.Unset.
simplifyMethod
Type: System.Int32
The simplify method.
numPoints
Type: System.Int32
The number of rebuild points.
refitTolerance
Type: System.Double
The refit tolerance.
angleTolerance
Type: System.Double
The angle tolerance in radians.
Return Value
Type: NurbsCurve[]
The output NURBS surfaces if successful.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace