RhinoCommon API
WaitCursor.Dispose Method
Releases all resources used by the WaitCursor
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
WaitCursor Class
Rhino.UI Namespace