RhinoCommon API
DisplayPipeline.GetOpenGLWorldToClip Method
 Get an array of 16 floats that represents the "world" to "clip" coordinate transformation in OpenGL's right handed coordinate system
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public float[] GetOpenGLWorldToClip(
	bool includeModelTransform
)
Public Function GetOpenGLWorldToClip (
	includeModelTransform As Boolean
) As Single()
Parameters
includeModelTransform
Type: System.Boolean
[Missing <param name="includeModelTransform"/> documentation for "M:Rhino.Display.DisplayPipeline.GetOpenGLWorldToClip(System.Boolean)"]
Return Value
Type: Single[]
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipeline.GetOpenGLWorldToClip(System.Boolean)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace