RhinoCommon API
GetObject.Get Method
 Call to select a single object.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GetResult Get()
Public Function Get As GetResult
Return Value
Type: GetResult
 GetResult.Object if an object was selected. GetResult.Cancel if the user pressed ESCAPE to cancel the selection. See GetResults for other possible values that may be returned when options, numbers, etc., are acceptable responses.
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace