RhinoCommon API
Decal.TextureRenderCRC Method (TextureRenderHashFlags)
Note: This API is now obsolete.
 This method is deprecated in favor of TextureRenderHash below.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[ObsoleteAttribute("Do not use")]
public uint TextureRenderCRC(
	TextureRenderHashFlags rh
)
<ObsoleteAttribute("Do not use")>
Public Function TextureRenderCRC (
	rh As TextureRenderHashFlags
) As UInteger
Parameters
rh
Type: Rhino.Render.TextureRenderHashFlags
[Missing <param name="rh"/> documentation for "M:Rhino.Render.Decal.TextureRenderCRC(Rhino.Render.TextureRenderHashFlags)"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.Decal.TextureRenderCRC(Rhino.Render.TextureRenderHashFlags)"]
See Also
Reference
Decal Class
TextureRenderCRC Overload
Rhino.Render Namespace