RhinoCommon API
ModelAidSettings.UpdateFromState Method
 Updates from a particular setting state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void UpdateFromState(
	ModelAidSettingsState state
)
Public Shared Sub UpdateFromState (
	state As ModelAidSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.ModelAidSettingsState
The new states that will be set.
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace