RhinoCommon API
FileCsvDocument.Set Method (Int32, Int32, DateTime)
 Sets the value of a cell to a date and time, formatted as a round-trip ISO 8601 string (the "o" format) using the invariant culture.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Set(
	int column,
	int row,
	DateTime value
)
Public Sub Set (
	column As Integer,
	row As Integer,
	value As DateTime
)
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.DateTime
The value to store.
See Also
Reference
FileCsvDocument Class
Set Overload
Rhino.FileIO Namespace