RhinoCommon API
LengthUnit.CompareTo Method
 Compares the current instance with another object of the same type and returns an integer that indicates whether the current instance precedes, follows, or occurs in the same position in the sort order as the other object.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int CompareTo(
	LengthUnit other
)
Public Function CompareTo (
	other As LengthUnit
) As Integer
Parameters
other
Type: Rhino.LengthUnit
A LengthUnit to compare with this instance.
Return Value
Type: Int32
A value that indicates the relative order of the objects being compared.
Implements
IComparable<T>.CompareTo(T)
Remarks
Name is ignored on the comparison (Meters and Metres are considered the same)
See Also
Reference
LengthUnit Structure
Rhino Namespace