RhinoCommon API
File3dmShutLining.CurveIsBump Method
 Returns whether to create a bump instead of a dent for the given curve.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool CurveIsBump(
	Guid curve_id
)
Public Function CurveIsBump (
	curve_id As Guid
) As Boolean
Parameters
curve_id
Type: System.Guid
[Missing <param name="curve_id"/> documentation for "M:Rhino.FileIO.File3dmShutLining.CurveIsBump(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmShutLining.CurveIsBump(System.Guid)"]
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace