RhinoCommon API
RenderTexture.IsLinear Method
 Return true if the texture color data is linear. NOTE: this function is marked as virtual, but the correct way to make a custom RenderTexture linear is by setting the correct property for the CustomRenderContentAttribute decorator on the class.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool IsLinear()
Public Overridable Function IsLinear As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.IsLinear"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace