RhinoCommon API
ObjRef.Point Method
 Gets the point if the referenced geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point Point()
Public Function Point As Point
Return Value
Type: Point
A point; or null if the referenced object is not a point, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace