RhinoCommon API
ObjectTable.AddPoint Method (Point3d, ObjectAttributes)
Adds a point object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddPoint(
	Point3d point,
	ObjectAttributes attributes
)
Public Function AddPoint (
	point As Point3d,
	attributes As ObjectAttributes
) As Guid
Parameters
point
Type: Rhino.Geometry.Point3d
location of point.
attributes
Type: Rhino.DocObjects.ObjectAttributes
attributes to apply to point. null is acceptable
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddPoint Overload
Rhino.DocObjects.Tables Namespace