RhinoCommon API
Brep.ExtendBrepFacesToConnect Method (BrepFace, Int32, BrepFace, Int32, Double, Double, Brep, Brep)
 Extends Faces to meet and trims the faces to each other. If input faces intersect without extending, the selection point indicates the side to keep
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public static bool ExtendBrepFacesToConnect(
	BrepFace Face0,
	int edgeIndex0,
	BrepFace Face1,
	int edgeIndex1,
	double tol,
	double angleTol,
	out Brep outBrep0,
	out Brep outBrep1
)
Public Shared Function ExtendBrepFacesToConnect (
	Face0 As BrepFace,
	edgeIndex0 As Integer,
	Face1 As BrepFace,
	edgeIndex1 As Integer,
	tol As Double,
	angleTol As Double,
	<OutAttribute> ByRef outBrep0 As Brep,
	<OutAttribute> ByRef outBrep1 As Brep
) As Boolean
Parameters
Face0
Type: Rhino.Geometry.BrepFace
[in] first face to connect
edgeIndex0
Type: System.Int32
[in] edge to extend.
Face1
Type: Rhino.Geometry.BrepFace
[in] second surface
edgeIndex1
Type: System.Int32
[in] edge to extend.
tol
Type: System.Double
[in] tolerance used for intersecting faces and simplifing extension curve
angleTol
Type: System.Double
[in] angle tolerance in radians used for simplifying extendsion curve
outBrep0
Type: Rhino.Geometry.Brep
[out] first face extended and trimmed to connect with the second face
outBrep1
Type: Rhino.Geometry.Brep
[out] second face extended and trimmed to connect with the first face
Return Value
Type: Boolean
true if valid connection found
See Also
Reference
Brep Class
ExtendBrepFacesToConnect Overload
Rhino.Geometry Namespace