RhinoCommon API
QuadRemeshParameters Constructor
Initializes a new instance of the QuadRemeshParameters class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public QuadRemeshParameters()
Public Sub New
See Also
Reference
QuadRemeshParameters Class
Rhino.Geometry Namespace