RhinoCommon API
IRhinoAccountsManager.TryGetAuthTokens Method (String, SecretKey)
 Attempts to return cached auth tokens that match the given criteria if any have been stored in cache.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
Tuple<IOpenIDConnectToken, IOAuth2Token> TryGetAuthTokens(
	string clientId,
	SecretKey secretKey
)
Function TryGetAuthTokens (
	clientId As String,
	secretKey As SecretKey
) As Tuple(Of IOpenIDConnectToken, IOAuth2Token)
Parameters
clientId
Type: System.String
The unique id of the client registered in Rhino Accounts.
secretKey
Type: Rhino.Runtime.RhinoAccounts.SecretKey
A special key that was handed to you in ExecuteProtectedCodeAsync(Func<SecretKey, Task>)
Return Value
Type: Tuple<IOpenIDConnectToken, IOAuth2Token>
Cached tokens matching the exact criteria passed, or null if none can be found matching the criteria.
Exceptions
Exception | Condition
InvalidOperationException | An invalid secretKey was passed, or the assembly is not allowed to call methods from IRhinoAccountsManager
See Also
Reference
IRhinoAccountsManager Interface
TryGetAuthTokens Overload
Rhino.Runtime.RhinoAccounts Namespace