RhinoCommon API
RhinoGet.GetRectangle Method (String, Point3d[])
 Gets a 3d rectangle.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Result GetRectangle(
	string firstPrompt,
	out Point3d[] corners
)
Public Shared Function GetRectangle (
	firstPrompt As String,
	<OutAttribute> ByRef corners As Point3d()
) As Result
Parameters
firstPrompt
Type: System.String
[Missing <param name="firstPrompt"/> documentation for "M:Rhino.Input.RhinoGet.GetRectangle(System.String,Rhino.Geometry.Point3d[]@)"]
corners
Type: Rhino.Geometry.Point3d[]
corners of the rectangle in counter-clockwise order.
Return Value
Type: Result
Commands.Result.Success if successful.
See Also
Reference
RhinoGet Class
GetRectangle Overload
Rhino.Input Namespace