RhinoCommon API
RenderContentSerializer.LoadMultiple Method
 Create any number of new render contents loaded from any number of files.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public virtual bool LoadMultiple(
	RhinoDoc doc,
	IEnumerable<string> fileNames,
	RenderContentKind contentKind,
	RenderContentSerializer.LoadMultipleFlags flags
)
Public Overridable Function LoadMultiple (
	doc As RhinoDoc,
	fileNames As IEnumerable(Of String),
	contentKind As RenderContentKind,
	flags As RenderContentSerializer.LoadMultipleFlags
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
 Rhino document
fileNames
Type: System.Collections.Generic.IEnumerable<String>
 A list of filenames to load from. Each file can contain any number of render contents.
contentKind
Type: Rhino.Render.RenderContentKind
 Only used by I/O plug-ins that support multiple kinds. It tells the plug-in which content kind to create. If the plug-in only supports a single content kind, it can ignore this parameter.
flags
Type: Rhino.Render.RenderContentSerializer.LoadMultipleFlags
 A set of flags from the enum above.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContentSerializer.LoadMultiple(Rhino.RhinoDoc,System.Collections.Generic.IEnumerable{System.String},Rhino.Render.RenderContentKind,Rhino.Render.RenderContentSerializer.LoadMultipleFlags)"]
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace