RhinoCommon API
NamedViewTable.RestoreWithAspectRatio Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreWithAspectRatio(System.Int32,Rhino.Display.RhinoViewport)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool RestoreWithAspectRatio(
	int index,
	RhinoViewport viewport
)
Public Function RestoreWithAspectRatio (
	index As Integer,
	viewport As RhinoViewport
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreWithAspectRatio(System.Int32,Rhino.Display.RhinoViewport)"]
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreWithAspectRatio(System.Int32,Rhino.Display.RhinoViewport)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreWithAspectRatio(System.Int32,Rhino.Display.RhinoViewport)"]
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace