RhinoCommon API
NurbsCurve.MakeUniform Method
 Changes a NURBS curve so each control point affects the curve exactly the same way. This make the knot vectors uniform without changing the control point locations. This will change the object shape slightly.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.24
Syntax
public bool MakeUniform()
Public Function MakeUniform As Boolean
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace