RhinoCommon API
ZebraAnalysisSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public static ZebraAnalysisSettingsState GetCurrentState()
Public Shared Function GetCurrentState As ZebraAnalysisSettingsState
Return Value
Type: ZebraAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.ZebraAnalysisSettings.GetCurrentState"]
See Also
Reference
ZebraAnalysisSettings Class
Rhino.ApplicationSettings Namespace