RhinoCommon API
ViewportInfo.GetScreenPortLocation Method
 Get the location of viewport in pixels (non System.Drawing version of GetScreenPort)
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void GetScreenPortLocation(
	out int left,
	out int top,
	out int right,
	out int bottom
)
Public Sub GetScreenPortLocation (
	<OutAttribute> ByRef left As Integer,
	<OutAttribute> ByRef top As Integer,
	<OutAttribute> ByRef right As Integer,
	<OutAttribute> ByRef bottom As Integer
)
Parameters
left
Type: System.Int32
[Missing <param name="left"/> documentation for "M:Rhino.DocObjects.ViewportInfo.GetScreenPortLocation(System.Int32@,System.Int32@,System.Int32@,System.Int32@)"]
top
Type: System.Int32
[Missing <param name="top"/> documentation for "M:Rhino.DocObjects.ViewportInfo.GetScreenPortLocation(System.Int32@,System.Int32@,System.Int32@,System.Int32@)"]
right
Type: System.Int32
[Missing <param name="right"/> documentation for "M:Rhino.DocObjects.ViewportInfo.GetScreenPortLocation(System.Int32@,System.Int32@,System.Int32@,System.Int32@)"]
bottom
Type: System.Int32
[Missing <param name="bottom"/> documentation for "M:Rhino.DocObjects.ViewportInfo.GetScreenPortLocation(System.Int32@,System.Int32@,System.Int32@,System.Int32@)"]
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace