RhinoCommon API
Curve.Split Method (Brep, Double, Double)
 Splits a curve into pieces using a polysurface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Curve[] Split(
	Brep cutter,
	double tolerance,
	double angleToleranceRadians
)
Public Function Split (
	cutter As Brep,
	tolerance As Double,
	angleToleranceRadians As Double
) As Curve()
Parameters
cutter
Type: Rhino.Geometry.Brep
A cutting surface or polysurface.
tolerance
Type: System.Double
Tolerance for computing intersections.
angleToleranceRadians
Type: System.Double
Angle tolerance in radians.
Return Value
Type: Curve[]
An array of curves. This array can be empty.
See Also
Reference
Curve Class
Split Overload
Rhino.Geometry Namespace