RhinoCommon API
RhinoObject.GetFillSurfaces Method (RhinoObject, ClippingPlaneObject)
 Return list of fill surfaces if any for object and clipping plane.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public static Brep[] GetFillSurfaces(
	RhinoObject rhinoObject,
	ClippingPlaneObject clippingPlaneObject
)
Public Shared Function GetFillSurfaces (
	rhinoObject As RhinoObject,
	clippingPlaneObject As ClippingPlaneObject
) As Brep()
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
Object to clip
clippingPlaneObject
Type: Rhino.DocObjects.ClippingPlaneObject
Clipping plane to use
Return Value
Type: Brep[]
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.GetFillSurfaces(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.ClippingPlaneObject)"]
See Also
Reference
RhinoObject Class
GetFillSurfaces Overload
Rhino.DocObjects Namespace