RhinoCommon API
SubD.SetVertexSurfacePoint Method
 Set the location of a single vertex surface point. This function is not suitable for setting the locations of multiple vertex surface points that are topologically near to each other.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SetVertexSurfacePoint(
	uint vertexIndex,
	Point3d surfacePoint
)
Public Function SetVertexSurfacePoint (
	vertexIndex As UInteger,
	surfacePoint As Point3d
) As Boolean
Parameters
vertexIndex
Type: System.UInt32
 Index of the vertex to modify
surfacePoint
Type: Rhino.Geometry.Point3d
 New surface point location for that vertex
Return Value
Type: Boolean
 True if a vertex was modified, false otherwise.
See Also
Reference
SubD Class
Rhino.Geometry Namespace
SubD.InterpolateSurfacePoints(Point3d[])
SubD.InterpolateSurfacePoints(UInt32[], Point3d[])
SubDVertex.SurfacePoint()
Rhino.Geometry.SubDSurfaceInterpolator