RhinoCommon API
PageViewGroupTable.Undelete Method (Guid)
 Undeletes a page view group that has been deleted.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Undelete(
	Guid id
)
Public Function Undelete (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
Id of page view group.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
PageViewGroupTable Class
Undelete Overload
Rhino.DocObjects.Tables Namespace