RhinoCommon API
FileCsvDocument.Set Method (Int32, Int32, Double, String)
 Sets the value of a specific cell to a double-precision number, formatted with the specified .NET numeric format string and the invariant culture.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Set(
	int column,
	int row,
	double value,
	string format
)
Public Sub Set (
	column As Integer,
	row As Integer,
	value As Double,
	format As String
)
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
value
Type: System.Double
The value to store.
format
Type: System.String
A standard or custom numeric format string, for example "F2" or "0.###".
See Also
Reference
FileCsvDocument Class
Set Overload
Rhino.FileIO Namespace