RhinoCommon API
Curve.ToArcsAndLines Method
 Converts a curve into polycurve consisting of arc segments. Sections of the input curves that are nearly straight are converted to straight-line segments.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PolyCurve ToArcsAndLines(
	double tolerance,
	double angleTolerance,
	double minimumLength,
	double maximumLength
)
Public Function ToArcsAndLines (
	tolerance As Double,
	angleTolerance As Double,
	minimumLength As Double,
	maximumLength As Double
) As PolyCurve
Parameters
tolerance
Type: System.Double
The tolerance. This is the maximum deviation from arc midpoints to the curve. When in doubt, use the document's model space absolute tolerance.
angleTolerance
Type: System.Double
The angle tolerance in radians. This is the maximum deviation of the arc end directions from the curve direction. When in doubt, use the document's model space angle tolerance.
minimumLength
Type: System.Double
The minimum segment length.
maximumLength
Type: System.Double
The maximum segment length.
Return Value
Type: PolyCurve
PolyCurve on success, null on error.
See Also
Reference
Curve Class
Rhino.Geometry Namespace