RhinoCommon API
RenderPrimitiveList.AutoDeleteMeshesOn Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPrimitiveList.AutoDeleteMeshesOn"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AutoDeleteMeshesOn()
Public Function AutoDeleteMeshesOn As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPrimitiveList.AutoDeleteMeshesOn"]
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace