RhinoCommon API
AnimationProperties.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
AnimationProperties Class
Dispose Overload
Rhino.DocObjects Namespace