RhinoCommon API
TextFields.FileName Method (String)
 Return path to the document
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string FileName(
	string options
)
Public Shared Function FileName (
	options As String
) As String
Parameters
options
Type: System.String
[Missing <param name="options"/> documentation for "M:Rhino.Runtime.TextFields.FileName(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.FileName(System.String)"]
See Also
Reference
TextFields Class
FileName Overload
Rhino.Runtime Namespace