RhinoCommon API
RenderTexture.SetEnvironmentMappingMode Method (TextureEnvironmentMappingMode, RenderContent.ChangeContexts)
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.SetEnvironmentMappingMode(Rhino.Render.TextureEnvironmentMappingMode,Rhino.Render.RenderContent.ChangeContexts)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public void SetEnvironmentMappingMode(
	TextureEnvironmentMappingMode value,
	RenderContent.ChangeContexts changeContext
)
Public Sub SetEnvironmentMappingMode (
	value As TextureEnvironmentMappingMode,
	changeContext As RenderContent.ChangeContexts
)
Parameters
value
Type: Rhino.Render.TextureEnvironmentMappingMode
[Missing <param name="value"/> documentation for "M:Rhino.Render.RenderTexture.SetEnvironmentMappingMode(Rhino.Render.TextureEnvironmentMappingMode,Rhino.Render.RenderContent.ChangeContexts)"]
changeContext
Type: Rhino.Render.RenderContent.ChangeContexts
[Missing <param name="changeContext"/> documentation for "M:Rhino.Render.RenderTexture.SetEnvironmentMappingMode(Rhino.Render.TextureEnvironmentMappingMode,Rhino.Render.RenderContent.ChangeContexts)"]
See Also
Reference
RenderTexture Class
SetEnvironmentMappingMode Overload
Rhino.Render Namespace