RhinoCommon API
HostUtils.IsRhinoBackupFileExtension Method
 Check to see if the file extension is a valid Rhino file extension.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool IsRhinoBackupFileExtension(
	string fileExtension
)
Public Shared Function IsRhinoBackupFileExtension (
	fileExtension As String
) As Boolean
Parameters
fileExtension
Type: System.String
[Missing <param name="fileExtension"/> documentation for "M:Rhino.Runtime.HostUtils.IsRhinoBackupFileExtension(System.String)"]
Return Value
Type: Boolean
 Return true if fileExtension is ".3dmbak", "3dmbak", ".3dm.bak", "3dm.bak", ".3dx.bak" or "3dx.bak", ignoring case.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace