RhinoCommon API
ObjectTable.Replace Method (Guid, Hatch)
Replaces one object with new hatch object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public bool Replace(
	Guid objectId,
	Hatch hatch
)
Public Function Replace (
	objectId As Guid,
	hatch As Hatch
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
hatch
Type: Rhino.Geometry.Hatch
new hatch to be added. The hatch is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace