RhinoCommon API
IRhRdkThumbnailList.SetMode Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.SetMode(Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Modes,System.Boolean)"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void SetMode(
	IRhRdkThumbnailList_Modes m,
	bool b
)
Sub SetMode (
	m As IRhRdkThumbnailList_Modes,
	b As Boolean
)
Parameters
m
Type: Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Modes
[Missing <param name="m"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.SetMode(Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Modes,System.Boolean)"]
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.SetMode(Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Modes,System.Boolean)"]
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace