RhinoCommon API
HostUtils.DebugString Method (String, Object[])
 Prints a debug message to the Rhino Command Line. The message will only appear if the SendDebugToCommandLine property is set to true.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void DebugString(
	string format,
	params Object[] args
)
Public Shared Sub DebugString (
	format As String,
	ParamArray args As Object()
)
Parameters
format
Type: System.String
Message to format and print.
args
Type: System.Object[]
An Object array containing zero or more objects to format.
See Also
Reference
HostUtils Class
DebugString Overload
Rhino.Runtime Namespace