RhinoCommon API
ColorRGBA.Equals Method (Object)
[Missing <summary> documentation for "M:Rhino.Display.ColorRGBA.Equals(System.Object)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
[Missing <param name="obj"/> documentation for "M:Rhino.Display.ColorRGBA.Equals(System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.ColorRGBA.Equals(System.Object)"]
See Also
Reference
ColorRGBA Structure
Equals Overload
Rhino.Display Namespace