RhinoCommon API
Point3dList.Equals Method (Object)
 Overrides the default object equality to compare lists by value.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
Return Value
Type: Boolean
True is objects are exactly equal in value.
See Also
Reference
Point3dList Class
Equals Overload
Rhino.Collections Namespace