RhinoCommon API
Brep.CreatePlanarBreps Method (Curve, Double)
 Constructs a set of planar breps as outlines by the loops.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep[] CreatePlanarBreps(
	Curve inputLoop,
	double tolerance
)
Public Shared Function CreatePlanarBreps (
	inputLoop As Curve,
	tolerance As Double
) As Brep()
Parameters
inputLoop
Type: Rhino.Geometry.Curve
A curve that should form the boundaries of the surfaces or polysurfaces.
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.Brep.CreatePlanarBreps(Rhino.Geometry.Curve,System.Double)"]
Return Value
Type: Brep[]
An array of Planar Breps.
See Also
Reference
Brep Class
CreatePlanarBreps Overload
Rhino.Geometry Namespace