RhinoCommon API
RenderPrimitiveList.MeshInstance Method
 Get the mesh for the primitive at the specified index. If the item at this index is a primitive type other than a mesh then it mesh representation is returned.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public Mesh MeshInstance(
	int index,
	out Transform instance_transform
)
Public Function MeshInstance (
	index As Integer,
	<OutAttribute> ByRef instance_transform As Transform
) As Mesh
Parameters
index
Type: System.Int32
 The zero based index of the item in the list. Valid values are greater than or equal to 0 and less than Count.
instance_transform
Type: Rhino.Geometry.Transform
 Receives the transformation of this mesh.
Return Value
Type: Mesh
 Returns the mesh for the primitive at the specified index. If the item at this index is a primitive type other than a mesh then it mesh representation is returned.
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace