RhinoCommon API
SubD.CreateQuadSphere Method
 Creates a SubD sphere made from quad faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static SubD CreateQuadSphere(
	Sphere sphere,
	SubDComponentLocation vertexLocation,
	uint quadSubdivisionLevel
)
Public Shared Function CreateQuadSphere (
	sphere As Sphere,
	vertexLocation As SubDComponentLocation,
	quadSubdivisionLevel As UInteger
) As SubD
Parameters
sphere
Type: Rhino.Geometry.Sphere
Location, size and orientation of the sphere.
vertexLocation
Type: Rhino.Geometry.SubDComponentLocation
 If vertexLocation = SubDComponentLocation::ControlNet, then the control net points will be on the surface of the sphere. Otherwise the limit surface points will be on the sphere.
quadSubdivisionLevel
Type: System.UInt32
 The resulting sphere will have 6*4^subdivision level quads. (0 for 6 quads, 1 for 24 quads, 2 for 96 quads, ...).
Return Value
Type: SubD
 If the input parameters are valid, a SubD quad sphere is returned. Otherwise null is returned.
See Also
Reference
SubD Class
Rhino.Geometry Namespace