RhinoCommon API
FileCsvDocument.ColumnIndex Method
 Returns the zero-based index of the column with the given name (case-insensitive), or -1 if the document has no header or no column with that name. When names are duplicated, the first is returned.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int ColumnIndex(
	string name
)
Public Function ColumnIndex (
	name As String
) As Integer
Parameters
name
Type: System.String
The column name to look up.
Return Value
Type: Int32
The column index, or -1.
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace