RhinoCommon API
SoftTransformSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static SoftTransformSettingsState GetDefaultState()
Public Shared Function GetDefaultState As SoftTransformSettingsState
Return Value
Type: SoftTransformSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.SoftTransformSettings.GetDefaultState"]
See Also
Reference
SoftTransformSettings Class
Rhino.ApplicationSettings Namespace