RhinoCommon API
DisplayPipeline.DrawSubDWires Method (SubD, DisplayPen, DisplayPen, DisplayPen, DisplayPen)
 Draws all the wireframe curves os a SubD object using different pens
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public void DrawSubDWires(
	SubD subd,
	DisplayPen boundaryPen,
	DisplayPen smoothInteriorPen,
	DisplayPen creasePen,
	DisplayPen nonmanifoldPen
)
Public Sub DrawSubDWires (
	subd As SubD,
	boundaryPen As DisplayPen,
	smoothInteriorPen As DisplayPen,
	creasePen As DisplayPen,
	nonmanifoldPen As DisplayPen
)
Parameters
subd
Type: Rhino.Geometry.SubD
SubD to draw
boundaryPen
Type: Rhino.Display.DisplayPen
Pen to use for boundary wires. If null, no boundary wires will be drawn
smoothInteriorPen
Type: Rhino.Display.DisplayPen
Pen to use for smooth interior wires. If null, no smooth interior wires will be drawn
creasePen
Type: Rhino.Display.DisplayPen
Pen to use for crease wires. If null, no crease wires will be drawn
nonmanifoldPen
Type: Rhino.Display.DisplayPen
Pen to use for non-manifold wires. If null, no non-manifold wires will be drawn
See Also
Reference
DisplayPipeline Class
DrawSubDWires Overload
Rhino.Display Namespace