RhinoCommon API
CustomMeshObject.Finalize Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomMeshObject.Finalize"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
CustomMeshObject Class
Rhino.DocObjects.Custom Namespace