RhinoCommon API
NurbsCurve.UVNDirectionsAt Method
 Calculates the u, V, and N directions of a NURBS curve at a parameter similar to the method used by Rhino's MoveUVN command.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool UVNDirectionsAt(
	double t,
	out Vector3d uDir,
	out Vector3d vDir,
	out Vector3d nDir
)
Public Function UVNDirectionsAt (
	t As Double,
	<OutAttribute> ByRef uDir As Vector3d,
	<OutAttribute> ByRef vDir As Vector3d,
	<OutAttribute> ByRef nDir As Vector3d
) As Boolean
Parameters
t
Type: System.Double
The evaluation parameter.
uDir
Type: Rhino.Geometry.Vector3d
The U direction.
vDir
Type: Rhino.Geometry.Vector3d
The V direction.
nDir
Type: Rhino.Geometry.Vector3d
The N direction.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace