RhinoCommon API
RenderContent.Dispose Method
Releases all resources used by the RenderContent
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RenderContent Class
Dispose Overload
Rhino.Render Namespace