RhinoCommon API
RenderPipeline.CloseWindow Method
 Closes the render window associated with this render instance.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public bool CloseWindow()
Public Function CloseWindow As Boolean
Return Value
Type: Boolean
 Return true if successful or false if not.
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace