RhinoCommon API
Circle.ToNurbsCurve Method
 Constructs a nurbs curve representation of this circle. This amounts to the same as calling NurbsCurve.CreateFromCircle().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public NurbsCurve ToNurbsCurve()
Public Function ToNurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
A nurbs curve representation of this circle or null if no such representation could be made.
See Also
Reference
Circle Structure
ToNurbsCurve Overload
Rhino.Geometry Namespace