RhinoCommon API
RenderMeshProvider.GetParameter Method
 Runtime access to specific parameters on for a given objectId relating to this primitive provider.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public virtual Object GetParameter(
	RhinoDoc doc,
	Guid objectId,
	string parameterName
)
Public Overridable Function GetParameter (
	doc As RhinoDoc,
	objectId As Guid,
	parameterName As String
) As Object
Parameters
doc
Type: Rhino.RhinoDoc
The Rhino document of interest.
objectId
Type: System.Guid
The objectId for which the parameter should be supplied.
parameterName
Type: System.String
The name of the parameter.
Return Value
Type: Object
The value of the parameter for the specified ObjectId. IConvertable.
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace