RhinoCommon API
PickContext.UpdateClippingPlanes Method
 Updates the clipping plane information in pick region. The SetClippingPlanes and View fields must be called before calling UpdateClippingPlanes().
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void UpdateClippingPlanes()
Public Sub UpdateClippingPlanes
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace