RhinoCommon API
PostEffectThreadEngine.Dispose Method
Releases all resources used by the PostEffectThreadEngine
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PostEffectThreadEngine Class
Rhino.Render.PostEffects Namespace