RhinoCommon API
File3dm.WriteWithLog Method (String, File3dmWriteOptions, String)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool WriteWithLog(
	string path,
	File3dmWriteOptions options,
	out string errorLog
)
Public Function WriteWithLog (
	path As String,
	options As File3dmWriteOptions,
	<OutAttribute> ByRef errorLog As String
) As Boolean
Parameters
path
Type: System.String
The file name to use for writing.
options
Type: Rhino.FileIO.File3dmWriteOptions
An options instance, or null for default.
errorLog
Type: System.String
This argument will be filled by out reference.
Return Value
Type: Boolean
 true if archive is written with no error. false if errors occur.
See Also
Reference
File3dm Class
WriteWithLog Overload
Rhino.FileIO Namespace