RhinoCommon API
RenderTexture.GetProjectionMode Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetProjectionMode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual TextureProjectionMode GetProjectionMode()
Public Overridable Function GetProjectionMode As TextureProjectionMode
Return Value
Type: TextureProjectionMode
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetProjectionMode"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace