RhinoCommon API
UserDictionary Constructor
Initializes a new instance of the UserDictionary class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UserDictionary()
Public Sub New
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace