RhinoCommon API
Intersection.CurveBrep Method (Curve, Brep, Double, Double, Double[])
 Intersect a curve with a Brep. This function returns the intersection parameters on the curve.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool CurveBrep(
	Curve curve,
	Brep brep,
	double tolerance,
	double angleTolerance,
	out double[] t
)
Public Shared Function CurveBrep (
	curve As Curve,
	brep As Brep,
	tolerance As Double,
	angleTolerance As Double,
	<OutAttribute> ByRef t As Double()
) As Boolean
Parameters
curve
Type: Rhino.Geometry.Curve
Curve.
brep
Type: Rhino.Geometry.Brep
Brep.
tolerance
Type: System.Double
Absolute tolerance for intersections.
angleTolerance
Type: System.Double
Angle tolerance in radians.
t
Type: System.Double[]
Curve parameters at intersections.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
Intersection Class
CurveBrep Overload
Rhino.Geometry.Intersect Namespace