RhinoCommon API
SnapShotsClient Constructor
 SnapShotsClient constructor
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public SnapShotsClient()
Public Sub New
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace