RhinoCommon API
TrulyObservableOrderedSet<T>.CopyTo Method
 Copies the values of the set to an array.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void CopyTo(
	T[] array,
	int arrayIndex
)
Public Sub CopyTo (
	array As T(),
	arrayIndex As Integer
)
Parameters
array
Type: T[]
The array to copy the values to.
arrayIndex
Type: System.Int32
The index of the array to start the copy.
Implements
ICollection<T>.CopyTo(T[], Int32)
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace