RhinoCommon API
Box Constructor (Box)
Copy constructor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Box(
	Box other
)
Public Sub New (
	other As Box
)
Parameters
other
Type: Rhino.Geometry.Box
The source box.
See Also
Reference
Box Structure
Box Overload
Rhino.Geometry Namespace