RhinoCommon API
AreaMassProperties.Compute Method (IEnumerable<GeometryBase>, Boolean, Boolean, Boolean, Boolean)
 Computes the AreaMassProperties for a collection of geometric objects. At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static AreaMassProperties Compute(
	IEnumerable<GeometryBase> geometry,
	bool area,
	bool firstMoments,
	bool secondMoments,
	bool productMoments
)
Public Shared Function Compute (
	geometry As IEnumerable(Of GeometryBase),
	area As Boolean,
	firstMoments As Boolean,
	secondMoments As Boolean,
	productMoments As Boolean
) As AreaMassProperties
Parameters
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
Objects to include in the area computation.
area
Type: System.Boolean
true to calculate area.
firstMoments
Type: System.Boolean
true to calculate area first moments, area, and area centroid.
secondMoments
Type: System.Boolean
true to calculate area second moments.
productMoments
Type: System.Boolean
true to calculate area product moments.
Return Value
Type: AreaMassProperties
The AreaMassProperties for the entire collection or null on failure.
See Also
Reference
AreaMassProperties Class
Compute Overload
Rhino.Geometry Namespace