RhinoCommon API
DisplayPipeline.DrawText Method (TextEntity, Color, Transform)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.TextEntity,System.Drawing.Color,Rhino.Geometry.Transform)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawText(
	TextEntity text,
	Color color,
	Transform xform
)
Public Sub DrawText (
	text As TextEntity,
	color As Color,
	xform As Transform
)
Parameters
text
Type: Rhino.Geometry.TextEntity
[Missing <param name="text"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.TextEntity,System.Drawing.Color,Rhino.Geometry.Transform)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.TextEntity,System.Drawing.Color,Rhino.Geometry.Transform)"]
xform
Type: Rhino.Geometry.Transform
[Missing <param name="xform"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.TextEntity,System.Drawing.Color,Rhino.Geometry.Transform)"]
See Also
Reference
DisplayPipeline Class
DrawText Overload
Rhino.Display Namespace