RhinoCommon API
Interop.FromOnBrep Method
 Copies a Rhino_DotNet brep to a RhinoCommon brep class.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Brep FromOnBrep(
	Object source
)
Public Shared Function FromOnBrep (
	source As Object
) As Brep
Parameters
source
Type: System.Object
 RMA.OpenNURBS.IOnBrep or RMA.OpenNURBS.OnBrep.
Return Value
Type: Brep
 RhinoCommon object on success. This will be an independent copy.
See Also
Reference
Interop Class
Rhino.Runtime Namespace