RhinoCommon API
RhinoGet.GetInterpolatedCurveOnSurface Method (Surface, Curve)
 Interactively picks the points of a curve interpolated through a surface. This is the getter behind the Rhino InterpCrvOnSrf command.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Result GetInterpolatedCurveOnSurface(
	Surface surface,
	out Curve curve
)
Public Shared Function GetInterpolatedCurveOnSurface (
	surface As Surface,
	<OutAttribute> ByRef curve As Curve
) As Result
Parameters
surface
Type: Rhino.Geometry.Surface
The surface to draw on, or null to have the user pick one.
curve
Type: Rhino.Geometry.Curve
The resulting curve, or null when the result is not Success.
Return Value
Type: Result
The command result.
See Also
Reference
RhinoGet Class
GetInterpolatedCurveOnSurface Overload
Rhino.Input Namespace