RhinoCommon API
Sun.ColorFromAltitude Method
Get sun color based on altitude.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Color ColorFromAltitude(
	double altitudeDegrees
)
Public Shared Function ColorFromAltitude (
	altitudeDegrees As Double
) As Color
Parameters
altitudeDegrees
Type: System.Double
The altitude sun angle in degrees.
Return Value
Type: Color
 Returns color for altitude.
See Also
Reference
Sun Class
Rhino.Render Namespace