RhinoCommon API
GetBaseClass.AddOptionEnumList<T> Method (LocalizeStringPair, T)
 Adds a choice of enumerated values as list option
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.37
Syntax
public int AddOptionEnumList<T>(
	LocalizeStringPair optionName,
	T defaultValue
)
where T : struct, new(), IConvertible
Public Function AddOptionEnumList(Of T As {Structure, New, IConvertible}) (
	optionName As LocalizeStringPair,
	defaultValue As T
) As Integer
Parameters
optionName
Type: Rhino.UI.LocalizeStringPair
The name of the option
defaultValue
Type: T
The default value
Type Parameters
T
The enumerated type
Return Value
Type: Int32
Option index
Exceptions
Exception | Condition
ArgumentException | Gets thrown if defaultValue provided is not an enumerated type.
See Also
Reference
GetBaseClass Class
AddOptionEnumList Overload
Rhino.Input.Custom Namespace