RhinoCommon API
Layer.SetCustomSectionStyle Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.SetCustomSectionStyle(Rhino.DocObjects.SectionStyle)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetCustomSectionStyle(
	SectionStyle sectionStyle
)
Public Sub SetCustomSectionStyle (
	sectionStyle As SectionStyle
)
Parameters
sectionStyle
Type: Rhino.DocObjects.SectionStyle
[Missing <param name="sectionStyle"/> documentation for "M:Rhino.DocObjects.Layer.SetCustomSectionStyle(Rhino.DocObjects.SectionStyle)"]
See Also
Reference
Layer Class
Rhino.DocObjects Namespace