RhinoCommon API
SectionStyle.ReadFromFile Method
 Reads linetypes from a Rhino .3dm file.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool ReadFromFile(
	string filename,
	out SectionStyle[] sectionStyles,
	out HatchPattern[] hatchPatterns
)
Public Shared Function ReadFromFile (
	filename As String,
	<OutAttribute> ByRef sectionStyles As SectionStyle(),
	<OutAttribute> ByRef hatchPatterns As HatchPattern()
) As Boolean
Parameters
filename
Type: System.String
The path to the file to read.
sectionStyles
Type: Rhino.DocObjects.SectionStyle[]
 An array of section styles, or an empty array if the file had no section styles.
hatchPatterns
Type: Rhino.DocObjects.HatchPattern[]
 An array of hatch patterns reference by the section styles, or an empty array if the file has no section styles or if none of the sections styles uses a hatch pattern. The section style's property references hatch patterns in this array.
Return Value
Type: Boolean
True if the file was read successfully, false otherwise.
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace
SectionStyle.HatchIndex