RhinoCommon API
BinaryArchiveWriter.WriteBoundingBox Method
 Writes a BoundingBox value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteBoundingBox(
	BoundingBox value
)
Public Sub WriteBoundingBox (
	value As BoundingBox
)
Parameters
value
Type: Rhino.Geometry.BoundingBox
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace