RhinoCommon API
StdVectorByte.NonConstPointer Method
 Gets the non-constant pointer (for modification) of this vector.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.26
Syntax
public IntPtr NonConstPointer()
Public Function NonConstPointer As IntPtr
Return Value
Type: IntPtr
The non-constant pointer.
See Also
Reference
StdVectorByte Class
Rhino.Runtime.InteropWrappers Namespace