RhinoCommon API
NamedParametersEventArgs.TryGetPlane Method
 Get a plane for the specified key
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool TryGetPlane(
	string name,
	out Plane plane
)
Public Function TryGetPlane (
	name As String,
	<OutAttribute> ByRef plane As Plane
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetPlane(System.String,Rhino.Geometry.Plane@)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetPlane(System.String,Rhino.Geometry.Plane@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetPlane(System.String,Rhino.Geometry.Plane@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace