RhinoCommon API
RhinoDoc.Import Method (String)
 Import geometry into a RhinoDoc from a file. This can be any file format that Rhino can import
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Import(
	string filePath
)
Public Function Import (
	filePath As String
) As Boolean
Parameters
filePath
Type: System.String
[Missing <param name="filePath"/> documentation for "M:Rhino.RhinoDoc.Import(System.String)"]
Return Value
Type: Boolean
true on success
See Also
Reference
RhinoDoc Class
Import Overload
Rhino Namespace