RhinoCommon API
Skin.OnBeginLoadAtStartPlugIns Method
Is called when the first plug-in that loads at start-up is going to be loaded.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnBeginLoadAtStartPlugIns(
	int expectedCount
)
Protected Overridable Sub OnBeginLoadAtStartPlugIns (
	expectedCount As Integer
)
Parameters
expectedCount
Type: System.Int32
The complete amount of plug-ins.
See Also
Reference
Skin Class
Rhino.Runtime Namespace