RhinoCommon API
SubDVertexList.GetEnumerator Method
 Implementation of IEnumerable, so a vertex list can be used with foreach and LINQ the same way SubDEdgeList and SubDFaceList can.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public IEnumerator<SubDVertex> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of SubDVertex)
Return Value
Type: IEnumerator<SubDVertex>
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDVertexList.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Remarks
 Note that this list has both a First property and, now that it is enumerable, a LINQ First() extension method. They disagree on an empty SubD: the property returns null and First() throws.
See Also
Reference
SubDVertexList Class
Rhino.Geometry.Collections Namespace