RhinoCommon API
FileNwdWriteOptions Constructor
Initializes a new instance of the FileNwdWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileNwdWriteOptions()
Public Sub New
See Also
Reference
FileNwdWriteOptions Class
Rhino.FileIO Namespace