RhinoCommon API
SimpleArrayHatchLinePointer Constructor (IEnumerable<HatchLine>)
 Initializes a new SimpleArrayHatchLinePointer instance, from a set of input hatch lines.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public SimpleArrayHatchLinePointer(
	IEnumerable<HatchLine> hatchLines
)
Public Sub New (
	hatchLines As IEnumerable(Of HatchLine)
)
Parameters
hatchLines
Type: System.Collections.Generic.IEnumerable<HatchLine>
A list, an array or any collection of curves that implements the enumerable interface.
See Also
Reference
SimpleArrayHatchLinePointer Class
SimpleArrayHatchLinePointer Overload
Rhino.Runtime.InteropWrappers Namespace