RhinoCommon API
TextFields.Volume Method (String, String, String)
 Returns a volume from an object Id. If allowOpenObjects = false objects which are open will return 0.0 as a volume.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public static double Volume(
	string id,
	string unitSystem,
	string allowOpenObjects
)
Public Shared Function Volume (
	id As String,
	unitSystem As String,
	allowOpenObjects As String
) As Double
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String,System.String,System.String)"]
unitSystem
Type: System.String
[Missing <param name="unitSystem"/> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String,System.String,System.String)"]
allowOpenObjects
Type: System.String
[Missing <param name="allowOpenObjects"/> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String,System.String,System.String)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String,System.String,System.String)"]
See Also
Reference
TextFields Class
Volume Overload
Rhino.Runtime Namespace