RhinoCommon API
HostUtils.InitializeRhinoCommon_RDK Method
 Makes sure all static RhinoCommon RDK components are set up correctly. This happens automatically when the RDK is loaded, so you probably won't have to call this method.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void InitializeRhinoCommon_RDK()
Public Shared Sub InitializeRhinoCommon_RDK
Remarks
Subsequent calls to this method will be ignored.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace