RhinoCommon API
TransformObjectList.GripOwnerArray Method
 Gets access to the internal GripOwner array of the TransformObjectList object.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoObject[] GripOwnerArray()
Public Function GripOwnerArray As RhinoObject()
Return Value
Type: RhinoObject[]
A n array of Rhino objects that are the owners of the grip objects the collection, or an empty array if there were no Rhino objects.
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace