RhinoCommon API
Point3f.Multiply Operator (Single, Point3f)
 Multiplies a point by a factor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Point3f operator *(
	float value,
	Point3f point
)
Public Shared Operator * (
	value As Single,
	point As Point3f
) As Point3f
Parameters
value
Type: System.Single
A value.
point
Type: Rhino.Geometry.Point3f
A point.
Return Value
Type: Point3f
A new vector that is the multiplication of point by value.
See Also
Reference
Point3f Structure
Multiply Overload
Rhino.Geometry Namespace