RhinoCommon API
FileX_T.Write Method
Write a X_T file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool Write(
	string filename,
	RhinoDoc doc,
	FileX_TWriteOptions options
)
Public Shared Function Write (
	filename As String,
	doc As RhinoDoc,
	options As FileX_TWriteOptions
) As Boolean
Parameters
filename
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileX_TWriteOptions
options used for generating the X_T file
Return Value
Type: Boolean
true on success
See Also
Reference
FileX_T Class
Rhino.FileIO Namespace