RhinoCommon API
PageViewGroupTable.Undelete Method (Int32)
 Undeletes a page view group that has been deleted.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Undelete(
	int index
)
Public Function Undelete (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
Zero-based index of page view group.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
PageViewGroupTable Class
Undelete Overload
Rhino.DocObjects.Tables Namespace