RhinoCommon API
File3dmDisplacement.AddSubItem Method
 Adds a new sub-item to the displacement. face_index is the index of the face on the polysurface/SubD.on is the override for File3dmDisplacement.On.texture is the override for File3dmDisplacement.TextureId.mapping_channel is the override for File3dmDisplacement.MappingChannel.black_point is the override for File3dmDisplacement.BlackPoint.white_point is the override for File3dmDisplacement.WhitePoint.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool AddSubItem(
	int face_index,
	bool on,
	Guid texture,
	int mapping_channel,
	double black_point,
	double white_point
)
Public Function AddSubItem (
	face_index As Integer,
	on As Boolean,
	texture As Guid,
	mapping_channel As Integer,
	black_point As Double,
	white_point As Double
) As Boolean
Parameters
face_index
Type: System.Int32
[Missing <param name="face_index"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.AddSubItem(System.Int32,System.Boolean,System.Guid,System.Int32,System.Double,System.Double)"]
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.AddSubItem(System.Int32,System.Boolean,System.Guid,System.Int32,System.Double,System.Double)"]
texture
Type: System.Guid
[Missing <param name="texture"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.AddSubItem(System.Int32,System.Boolean,System.Guid,System.Int32,System.Double,System.Double)"]
mapping_channel
Type: System.Int32
[Missing <param name="mapping_channel"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.AddSubItem(System.Int32,System.Boolean,System.Guid,System.Int32,System.Double,System.Double)"]
black_point
Type: System.Double
[Missing <param name="black_point"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.AddSubItem(System.Int32,System.Boolean,System.Guid,System.Int32,System.Double,System.Double)"]
white_point
Type: System.Double
[Missing <param name="white_point"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.AddSubItem(System.Int32,System.Boolean,System.Guid,System.Int32,System.Double,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmDisplacement.AddSubItem(System.Int32,System.Boolean,System.Guid,System.Int32,System.Double,System.Double)"]
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace