RhinoCommon API
LightManagerSupportClient.LightDescription Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupportClient.LightDescription(Rhino.Geometry.Light)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string LightDescription(
	Light light
)
Public Function LightDescription (
	light As Light
) As String
Parameters
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.LightManagerSupportClient.LightDescription(Rhino.Geometry.Light)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.LightManagerSupportClient.LightDescription(Rhino.Geometry.Light)"]
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace