RhinoCommon API
BinaryArchiveWriter.WriteBool Method
 Writes a Boolean value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteBool(
	bool value
)
Public Sub WriteBool (
	value As Boolean
)
Parameters
value
Type: System.Boolean
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace