RhinoCommon API
CollapsibleSectionImpl.ReplaceClient Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.ReplaceClient(Rhino.UI.Controls.ICollapsibleSection)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void ReplaceClient(
	ICollapsibleSection client
)
Public Sub ReplaceClient (
	client As ICollapsibleSection
)
Parameters
client
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="client"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.ReplaceClient(Rhino.UI.Controls.ICollapsibleSection)"]
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace