RhinoCommon API
File3dmNotes Constructor
 Creates empty default notes
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public File3dmNotes()
Public Sub New
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace