RhinoCommon API
PostProcessFrameBufferEventArgs.TryCopyFrameBuffer Method (Byte[], Int32)
 Copies the frame into a caller owned array as 32 bit BGRA, with every pixel made opaque. Reuse one array across frames; allocating per frame defeats the point of this event.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryCopyFrameBuffer(
	byte[] destination,
	int destinationStride
)
Public Function TryCopyFrameBuffer (
	destination As Byte(),
	destinationStride As Integer
) As Boolean
Parameters
destination
Type: System.Byte[]
Destination array.
destinationStride
Type: System.Int32
 Bytes from the start of one destination row to the start of the next. A positive value writes the top row of the image first, a negative value writes the bottom row first.
Return Value
Type: Boolean
true if the frame was copied.
See Also
Reference
PostProcessFrameBufferEventArgs Class
TryCopyFrameBuffer Overload
Rhino.Display Namespace