RhinoCommon API
PersistentSettings.GetDate Method (String, DateTime, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetDate(System.String,System.DateTime,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DateTime GetDate(
	string key,
	DateTime defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetDate (
	key As String,
	defaultValue As DateTime,
	legacyKeyList As IEnumerable(Of String)
) As DateTime
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetDate(System.String,System.DateTime,System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: System.DateTime
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetDate(System.String,System.DateTime,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetDate(System.String,System.DateTime,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: DateTime
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetDate(System.String,System.DateTime,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetDate Overload
Rhino Namespace