RhinoCommon API
VisualAnalysisMode.CurvatureColorMaxRange Method
 Adjusts the max range values for curvature analysis.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void CurvatureColorMaxRange()
Public Shared Sub CurvatureColorMaxRange
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace