RhinoCommon API
Dimension.UpdateDimensionText Method (DimensionStyle, UnitSystem)
Note: This API is now obsolete.
 Remakes dimension text geometry object and sets it on the dimension.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.34
Syntax
[ObsoleteAttribute("Since 9.0")]
public void UpdateDimensionText(
	DimensionStyle style,
	UnitSystem units
)
<ObsoleteAttribute("Since 9.0")>
Public Sub UpdateDimensionText (
	style As DimensionStyle,
	units As UnitSystem
)
Parameters
style
Type: Rhino.DocObjects.DimensionStyle
The dimension style.
units
Type: Rhino.UnitSystem
The unit system.
See Also
Reference
Dimension Class
UpdateDimensionText Overload
Rhino.Geometry Namespace