RhinoCommon API
GetTorus Constructor
Initializes a new instance of the GetTorus class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public GetTorus()
Public Sub New
See Also
Reference
GetTorus Class
Rhino.Input.Custom Namespace