RhinoCommon API
LengthUnit.IsKnownUnitSystem Method
 Determines whether the instance value is a known unit system.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsKnownUnitSystem(
	out UnitSystem unitSystem
)
Public Function IsKnownUnitSystem (
	<OutAttribute> ByRef unitSystem As UnitSystem
) As Boolean
Parameters
unitSystem
Type: Rhino.UnitSystem
Return Value
Type: Boolean
True when this instance value is a valid known UnitSystem, False otherwise.
Remarks
 Not Unset nor CustomUnits
See Also
Reference
LengthUnit Structure
Rhino Namespace