RhinoCommon API
Unroller.FollowingGeometryIndex Method (TextDot)
 Given an unrolled text dot, returns the index of the source, or following text dot.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int FollowingGeometryIndex(
	TextDot dot
)
Public Function FollowingGeometryIndex (
	dot As TextDot
) As Integer
Parameters
dot
Type: Rhino.Geometry.TextDot
An unrolled text dot returned by Unroller.PerformUnroll.
Return Value
Type: Int32
The index of the text dot added by Unroller.AddFollowingGeometry if successful, otherwise -1.
See Also
Reference
Unroller Class
FollowingGeometryIndex Overload
Rhino.Geometry Namespace