RhinoCommon API
RhinoPageInterop.StackedDialogPageFromUnmanagedPointer Method
 For internal use only, provides access to unmanaged core
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public static StackedDialogPage StackedDialogPageFromUnmanagedPointer(
	IntPtr pointer
)
Public Shared Function StackedDialogPageFromUnmanagedPointer (
	pointer As IntPtr
) As StackedDialogPage
Parameters
pointer
Type: System.IntPtr
[Missing <param name="pointer"/> documentation for "M:Rhino.UI.RhinoPageInterop.StackedDialogPageFromUnmanagedPointer(System.IntPtr)"]
Return Value
Type: StackedDialogPage
[Missing <returns> documentation for "M:Rhino.UI.RhinoPageInterop.StackedDialogPageFromUnmanagedPointer(System.IntPtr)"]
See Also
Reference
RhinoPageInterop Class
Rhino.UI Namespace