RhinoCommon API
ShutLiningCurveInfo Constructor
 Creates a new instance of the ShutLining curve information class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ShutLiningCurveInfo(
	Curve curve,
	double radius,
	int profile,
	bool pull,
	bool isBump,
	IEnumerable<Interval> curveIntervals = null,
	bool enabled = true
)
Public Sub New (
	curve As Curve,
	radius As Double,
	profile As Integer,
	pull As Boolean,
	isBump As Boolean,
	Optional curveIntervals As IEnumerable(Of Interval) = Nothing,
	Optional enabled As Boolean = true
)
Parameters
curve
Type: Rhino.Geometry.Curve
The profile curve.
radius
Type: System.Double
The profile radius.
profile
Type: System.Int32
The profile type.
pull
Type: System.Boolean
True if the curve should be pulled.
isBump
Type: System.Boolean
True if profile constitutes a bump. See Rhino's Help for more information.
curveIntervals (Optional)
Type: System.Collections.Generic.IEnumerable<Interval>
The parts of the curve to use as profiles.
enabled (Optional)
Type: System.Boolean
If true, this curve is active.
Exceptions
Exception | Condition
ArgumentNullException | If curve is null.
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace