RhinoCommon API
PlaneIntersectionCache.Finalize Method
 Releases the native cache.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
PlaneIntersectionCache Class
Rhino.Geometry.Intersect Namespace