RhinoCommon API
RenderContentSerializer.CanLoadMultiple Method
 If true the plug-in is capable of loading multiple contents.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public virtual bool CanLoadMultiple()
Public Overridable Function CanLoadMultiple As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContentSerializer.CanLoadMultiple"]
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace