RhinoCommon API
SubDEdgeSharpness Constructor (Interval)
 Creates a sharpness that varies from one end of the edge to the other.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDEdgeSharpness(
	Interval sharpnessInterval
)
Public Sub New (
	sharpnessInterval As Interval
)
Parameters
sharpnessInterval
Type: Rhino.Geometry.Interval
 Sharpness at the start and end of the edge. Both values must be between 0.0 and MaximumValue.
Remarks
 If either value is not valid, the result is Nan.
See Also
Reference
SubDEdgeSharpness Structure
SubDEdgeSharpness Overload
Rhino.Geometry Namespace