RhinoCommon API
InstanceDefinitionGeometry.DeleteAllUserStrings Method
 Deletes all user strings attached to this geometry.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public void DeleteAllUserStrings()
Public Sub DeleteAllUserStrings
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace