RhinoCommon API
CustomRenderSaveFileTypes.RegisterFileType Method
 Call this method to register a custom file save type with the render output window save dialog.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public void RegisterFileType(
	IEnumerable<string> extensions,
	string description,
	CustomRenderSaveFileTypes.SaveFileHandler saveFileHandler
)
Public Sub RegisterFileType (
	extensions As IEnumerable(Of String),
	description As String,
	saveFileHandler As CustomRenderSaveFileTypes.SaveFileHandler
)
Parameters
extensions
Type: System.Collections.Generic.IEnumerable<String>
 List of one or more file extension associated with this custom type, for example: HDR, HDRI
description
Type: System.String
 File extension description which appears in the file save dialog file type combo box.
saveFileHandler
Type: Rhino.PlugIns.CustomRenderSaveFileTypes.SaveFileHandler
[Missing <param name="saveFileHandler"/> documentation for "M:Rhino.PlugIns.CustomRenderSaveFileTypes.RegisterFileType(System.Collections.Generic.IEnumerable{System.String},System.String,Rhino.PlugIns.CustomRenderSaveFileTypes.SaveFileHandler)"]
See Also
Reference
CustomRenderSaveFileTypes Class
Rhino.PlugIns Namespace