RhinoCommon API
FileUsdWriteOptions Constructor
Initializes a new instance of the FileUsdWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileUsdWriteOptions()
Public Sub New
See Also
Reference
FileUsdWriteOptions Class
Rhino.FileIO Namespace