RhinoCommon API
SurfaceDirectionIndicators.Finalize Method
[Missing <summary> documentation for "M:Rhino.Geometry.SurfaceDirectionIndicators.Finalize"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
SurfaceDirectionIndicators Class
Rhino.Geometry Namespace