RhinoCommon API
File3dmLayerTable.AddLayer Method (String, Color)
 Easy way to add a new layer to the model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public int AddLayer(
	string name,
	Color color
)
Public Function AddLayer (
	name As String,
	color As Color
) As Integer
Parameters
name
Type: System.String
Layer name.
color
Type: System.Drawing.Color
Layer color.
Return Value
Type: Int32
 The layer's index (>=0) is returned. Otherwise, RhinoMath.UnsetIntIndex is returned.
Remarks
 Note, the layer name will be modified as needed in the model and manifest.
See Also
Reference
File3dmLayerTable Class
AddLayer Overload
Rhino.FileIO Namespace