RhinoCommon API
Surface.IsCylinder Method
 Determines if the surface is a portion of a cylinder within RhinoMath.ZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsCylinder()
Public Function IsCylinder As Boolean
Return Value
Type: Boolean
true if the surface is a portion of a cylinder.
See Also
Reference
Surface Class
IsCylinder Overload
Rhino.Geometry Namespace