RhinoCommon API
NurbsCurveKnotList.EpsilonEquals Method
 Checks that all values in the other list are sequentially equal within epsilon to the values in this list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public bool EpsilonEquals(
	NurbsCurveKnotList other,
	double epsilon
)
Public Function EpsilonEquals (
	other As NurbsCurveKnotList,
	epsilon As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.Collections.NurbsCurveKnotList
The other list.
epsilon
Type: System.Double
The epsilon value.
Return Value
Type: Boolean
True if values are, orderly, equal within epsilon. False otherwise.
Implements
IEpsilonComparable<T>.EpsilonEquals(T, Double)
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace