RhinoCommon API
RenderContent.IsContentTypeAcceptableAsChild Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.IsContentTypeAcceptableAsChild(System.Guid,System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool IsContentTypeAcceptableAsChild(
	Guid type,
	string childSlotName
)
Public Overridable Function IsContentTypeAcceptableAsChild (
	type As Guid,
	childSlotName As String
) As Boolean
Parameters
type
Type: System.Guid
[Missing <param name="type"/> documentation for "M:Rhino.Render.RenderContent.IsContentTypeAcceptableAsChild(System.Guid,System.String)"]
childSlotName
Type: System.String
[Missing <param name="childSlotName"/> documentation for "M:Rhino.Render.RenderContent.IsContentTypeAcceptableAsChild(System.Guid,System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.IsContentTypeAcceptableAsChild(System.Guid,System.String)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace