RhinoCommon API
MeshExtruder.Finalize Method
 Destructor
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace