RhinoCommon API
RealtimeDisplayMode.HudLastRenderedPass Method
 Override to communicate the last completed pass. Can be shown in the HUD
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual int HudLastRenderedPass()
Public Overridable Function HudLastRenderedPass As Integer
Return Value
Type: Int32
Last completed pass
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace