RhinoCommon API
RenderContentCollection.SetSearchPattern Method
 Sets a search pattern for filtering contents. This is not actually used by the iterator, but is stored for use by any UI that wants to filter contents based on a search string by using the function RhRdkCheckSearchPattern()
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetSearchPattern(
	string pattern
)
Public Sub SetSearchPattern (
	pattern As String
)
Parameters
pattern
Type: System.String
The search pattern. See RhRdkCheckSearchPattern() for details
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace