RhinoCommon API
Brep.CreateFromCornerPoints Method (Point3d, Point3d, Point3d, Double)
 Makes a Brep with one face from three corner points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Brep CreateFromCornerPoints(
	Point3d corner1,
	Point3d corner2,
	Point3d corner3,
	double tolerance
)
Public Shared Function CreateFromCornerPoints (
	corner1 As Point3d,
	corner2 As Point3d,
	corner3 As Point3d,
	tolerance As Double
) As Brep
Parameters
corner1
Type: Rhino.Geometry.Point3d
A first corner.
corner2
Type: Rhino.Geometry.Point3d
A second corner.
corner3
Type: Rhino.Geometry.Point3d
A third corner.
tolerance
Type: System.Double
 Minimum edge length allowed before collapsing the side into a singularity.
Return Value
Type: Brep
A boundary representation, or null on error.
See Also
Reference
Brep Class
CreateFromCornerPoints Overload
Rhino.Geometry Namespace