RhinoCommon API
Command.ReplayHistory Method
 Repeats an operation of a command.
In order to make this function work, you will likely need to grab the Result property that gives the list of input objects. Then, you will be able to replace these inputs by using one of the UpdateToX() methods of the ReplayHistoryResult.
You should NOT use any document AddX() or ReplaceX() functions, as they will break history.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool ReplayHistory(
	ReplayHistoryData replayData
)
Protected Overridable Function ReplayHistory (
	replayData As ReplayHistoryData
) As Boolean
Parameters
replayData
Type: Rhino.DocObjects.ReplayHistoryData
The replay history information.
Return Value
Type: Boolean
true if the operation succeeded.
The default implementation always returns false.
See Also
Reference
Command Class
Rhino.Commands Namespace