RhinoCommon API
Linetype.ReadFromFile Method
 Reads linetypes from either a Rhino .3dm file or an AutoCAD .lin file.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.6
Syntax
public static Linetype[] ReadFromFile(
	string path
)
Public Shared Function ReadFromFile (
	path As String
) As Linetype()
Parameters
path
Type: System.String
The path to the file to read.
Return Value
Type: Linetype[]
An array of linetypes if successful, otherwise an empty array.
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace