RhinoCommon API
Point2d.DistanceToSquared Method
 Computes the square of the distance between two 2d points.
This method is usually largely faster than DistanceTo().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public double DistanceToSquared(
	Point2d other
)
Public Function DistanceToSquared (
	other As Point2d
) As Double
Parameters
other
Type: Rhino.Geometry.Point2d
Other point for squared distance measurement.
Return Value
Type: Double
The squared length of the line between this and the other point; or 0 if any of the points is not valid.
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace