RhinoCommon API
Vector3d.PerpendicularTo Method (Point3d, Point3d, Point3d)
 Set this vector to be perpendicular to a plane defined by 3 points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool PerpendicularTo(
	Point3d point0,
	Point3d point1,
	Point3d point2
)
Public Function PerpendicularTo (
	point0 As Point3d,
	point1 As Point3d,
	point2 As Point3d
) As Boolean
Parameters
point0
Type: Rhino.Geometry.Point3d
The first point.
point1
Type: Rhino.Geometry.Point3d
The second point.
point2
Type: Rhino.Geometry.Point3d
The third point.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Vector3d.PerpendicularTo(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
See Also
Reference
Vector3d Structure
PerpendicularTo Overload
Rhino.Geometry Namespace