RhinoCommon API
GeometryBase.GeometryEquals Method
 Determines if two geometries equal one another, in pure geometrical shape. This version only compares the geometry itself and does not include any user data comparisons. This is a comparison by value: for two identical items it will be true, no matter where in memory they may be stored.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool GeometryEquals(
	GeometryBase first,
	GeometryBase second
)
Public Shared Function GeometryEquals (
	first As GeometryBase,
	second As GeometryBase
) As Boolean
Parameters
first
Type: Rhino.Geometry.GeometryBase
The first geometry
second
Type: Rhino.Geometry.GeometryBase
The second geometry
Return Value
Type: Boolean
The indication of equality
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace