RhinoCommon API
SubDDisplayParameters.FromEncodedString Method
 Converts encoded serialized string into a MeshingParameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static SubDDisplayParameters FromEncodedString(
	string value
)
Public Shared Function FromEncodedString (
	value As String
) As SubDDisplayParameters
Parameters
value
Type: System.String
 Encoded string returned by MeshingParameters.ToString()
Return Value
Type: SubDDisplayParameters
 Returns a new MeshingParameters created by decoding and deserializing the string or null if value is invalid.
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace