RhinoCommon API
Utilities.LoadPersistentRenderContentFromFile Method
 Loads a content from a library file and adds it to the persistent content list of a particular document.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RenderContent LoadPersistentRenderContentFromFile(
	uint docSerialNumber,
	string filename
)
Public Shared Function LoadPersistentRenderContentFromFile (
	docSerialNumber As UInteger,
	filename As String
) As RenderContent
Parameters
docSerialNumber
Type: System.UInt32
identifies the document into which the content should be loaded.
filename
Type: System.String
is the full path to the file to be loaded.
Return Value
Type: RenderContent
The loaded content or null if an error occurred.
See Also
Reference
Utilities Class
Rhino.Render Namespace