RhinoCommon API
RhinoMath.Clamp Method (Double, Double, Double)
 Limits a Double to be specified within an interval of two numbers, by specifying a fixed minimum and maximum.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static double Clamp(
	double value,
	double bound1,
	double bound2
)
Public Shared Function Clamp (
	value As Double,
	bound1 As Double,
	bound2 As Double
) As Double
Parameters
value
Type: System.Double
A number.
bound1
Type: System.Double
A first bound.
bound2
Type: System.Double
A second bound. This does not necessarily need to be larger or smaller than bound1.
Return Value
Type: Double
The clamped value.
See Also
Reference
RhinoMath Class
Clamp Overload
Rhino Namespace