RhinoCommon API
ContentUI Constructor
 ContentUI constructor
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public ContentUI(
	IntPtr pContentUI
)
Public Sub New (
	pContentUI As IntPtr
)
Parameters
pContentUI
Type: System.IntPtr
[Missing <param name="pContentUI"/> documentation for "M:Rhino.UI.Controls.ContentUI.#ctor(System.IntPtr)"]
See Also
Reference
ContentUI Class
Rhino.UI.Controls Namespace