RhinoCommon API
RotationGripUserInterfaceObject.ArcVisibleInViewport Method
 If the arc for a given viewport visible.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ArcVisibleInViewport(
	RhinoViewport viewport
)
Public Function ArcVisibleInViewport (
	viewport As RhinoViewport
) As Boolean
Parameters
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.UI.RotationGripUserInterfaceObject.ArcVisibleInViewport(Rhino.Display.RhinoViewport)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.RotationGripUserInterfaceObject.ArcVisibleInViewport(Rhino.Display.RhinoViewport)"]
See Also
Reference
RotationGripUserInterfaceObject Class
Rhino.UI Namespace