RhinoCommon API
DisplayPipeline.DrawZebraPreview Method (Brep, Color)
 Draws a shaded Brep with Zebra stripe preview.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.16
Syntax
public void DrawZebraPreview(
	Brep brep,
	Color color
)
Public Sub DrawZebraPreview (
	brep As Brep,
	color As Color
)
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to draw.
color
Type: System.Drawing.Color
Object color.
See Also
Reference
DisplayPipeline Class
DrawZebraPreview Overload
Rhino.Display Namespace