RhinoCommon API
PlugIn.GetLoadProtection Method
 Get load protection state for a plug-in
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.5
Syntax
public static bool GetLoadProtection(
	Guid pluginId,
	out bool loadSilently
)
Public Shared Function GetLoadProtection (
	pluginId As Guid,
	<OutAttribute> ByRef loadSilently As Boolean
) As Boolean
Parameters
pluginId
Type: System.Guid
[Missing <param name="pluginId"/> documentation for "M:Rhino.PlugIns.PlugIn.GetLoadProtection(System.Guid,System.Boolean@)"]
loadSilently
Type: System.Boolean
[Missing <param name="loadSilently"/> documentation for "M:Rhino.PlugIns.PlugIn.GetLoadProtection(System.Guid,System.Boolean@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.GetLoadProtection(System.Guid,System.Boolean@)"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace