RhinoCommon API
RdkUndo.Dispose Method
 Dispose for RdkUndo
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RdkUndo Class
Rhino.Render Namespace