RhinoCommon API
MouseState.IsMouseOver Method (Curve, Double)
 Test if the mouse is over a curve
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsMouseOver(
	Curve curve,
	out double t
)
Public Function IsMouseOver (
	curve As Curve,
	<OutAttribute> ByRef t As Double
) As Boolean
Parameters
curve
Type: Rhino.Geometry.Curve
curve to test
t
Type: System.Double
parameter along curve is returned here if the mouse is over the curve
Return Value
Type: Boolean
true if mouse is over a curve
See Also
Reference
MouseState Class
IsMouseOver Overload
Rhino.UI Namespace