RhinoCommon API
SimpleArrayFloat Constructor (Int32)
 Initializes a new SimpleArrayFloat class. Initial size of the array - all values are set to zero.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SimpleArrayFloat(
	int initialSize
)
Public Sub New (
	initialSize As Integer
)
Parameters
initialSize
Type: System.Int32
[Missing <param name="initialSize"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayFloat.#ctor(System.Int32)"]
See Also
Reference
SimpleArrayFloat Class
SimpleArrayFloat Overload
Rhino.Runtime.InteropWrappers Namespace