RhinoCommon API
ExtensionMethods.ToSimulatedTextureProjectionMode Method
[Missing <summary> documentation for "M:Rhino.Render.ExtensionMethods.ToSimulatedTextureProjectionMode(Rhino.Render.TextureProjectionMode)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public static SimulatedTexture.ProjectionModes ToSimulatedTextureProjectionMode(
	this TextureProjectionMode e
)
<ExtensionAttribute>
Public Shared Function ToSimulatedTextureProjectionMode (
	e As TextureProjectionMode
) As SimulatedTexture.ProjectionModes
Parameters
e
Type: Rhino.Render.TextureProjectionMode
[Missing <param name="e"/> documentation for "M:Rhino.Render.ExtensionMethods.ToSimulatedTextureProjectionMode(Rhino.Render.TextureProjectionMode)"]
Return Value
Type: SimulatedTexture.ProjectionModes
[Missing <returns> documentation for "M:Rhino.Render.ExtensionMethods.ToSimulatedTextureProjectionMode(Rhino.Render.TextureProjectionMode)"]
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type TextureProjectionMode. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ExtensionMethods Class
Rhino.Render Namespace