RhinoCommon API
RebuildCurveOptions.Finalize Method
[Missing <summary> documentation for "M:Rhino.Geometry.RebuildCurveOptions.Finalize"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace