RhinoCommon API
ColorRGBA Explicit Conversion (ColorRGBA to Color)
 Converts a ColorRGBA in a Color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static explicit operator Color (
	ColorRGBA value
)
Public Shared Narrowing Operator CType (
	value As ColorRGBA
) As Color
Parameters
value
Type: Rhino.Display.ColorRGBA
A RGBA color.
Return Value
Type: Color
An ARGB Color.
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace