RhinoCommon API
InitFrameBufferEventArgs.SetFill Method (Color, Color, Color, Color)
[Missing <summary> documentation for "M:Rhino.Display.InitFrameBufferEventArgs.SetFill(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public void SetFill(
	Color topLeft,
	Color bottomLeft,
	Color topRight,
	Color bottomRight
)
Public Sub SetFill (
	topLeft As Color,
	bottomLeft As Color,
	topRight As Color,
	bottomRight As Color
)
Parameters
topLeft
Type: System.Drawing.Color
[Missing <param name="topLeft"/> documentation for "M:Rhino.Display.InitFrameBufferEventArgs.SetFill(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)"]
bottomLeft
Type: System.Drawing.Color
[Missing <param name="bottomLeft"/> documentation for "M:Rhino.Display.InitFrameBufferEventArgs.SetFill(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)"]
topRight
Type: System.Drawing.Color
[Missing <param name="topRight"/> documentation for "M:Rhino.Display.InitFrameBufferEventArgs.SetFill(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)"]
bottomRight
Type: System.Drawing.Color
[Missing <param name="bottomRight"/> documentation for "M:Rhino.Display.InitFrameBufferEventArgs.SetFill(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)"]
See Also
Reference
InitFrameBufferEventArgs Class
SetFill Overload
Rhino.Display Namespace