RhinoCommon API
DisplayPipeline.DrawLineNoClip Method
 Draws a single line object .This version of line drawing will draw the segments of the line that extend beyond the near and far planes of the view frustum with depths on those planes
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public void DrawLineNoClip(
	Point3d from,
	Point3d to,
	Color color,
	int thickness
)
Public Sub DrawLineNoClip (
	from As Point3d,
	to As Point3d,
	color As Color,
	thickness As Integer
)
Parameters
from
Type: Rhino.Geometry.Point3d
Line from point.
to
Type: Rhino.Geometry.Point3d
Line to point.
color
Type: System.Drawing.Color
Color to draw line in.
thickness
Type: System.Int32
Thickness (in pixels) of line.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace