RhinoCommon API
RenderContent.DynamicIcon Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.DynamicIcon(System.Drawing.Size,System.Drawing.Bitmap@,Rhino.Render.DynamicIconUsage)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool DynamicIcon(
	Size size,
	out Bitmap bitmap,
	DynamicIconUsage usage
)
Public Overridable Function DynamicIcon (
	size As Size,
	<OutAttribute> ByRef bitmap As Bitmap,
	usage As DynamicIconUsage
) As Boolean
Parameters
size
Type: System.Drawing.Size
[Missing <param name="size"/> documentation for "M:Rhino.Render.RenderContent.DynamicIcon(System.Drawing.Size,System.Drawing.Bitmap@,Rhino.Render.DynamicIconUsage)"]
bitmap
Type: System.Drawing.Bitmap
[Missing <param name="bitmap"/> documentation for "M:Rhino.Render.RenderContent.DynamicIcon(System.Drawing.Size,System.Drawing.Bitmap@,Rhino.Render.DynamicIconUsage)"]
usage
Type: Rhino.Render.DynamicIconUsage
[Missing <param name="usage"/> documentation for "M:Rhino.Render.RenderContent.DynamicIcon(System.Drawing.Size,System.Drawing.Bitmap@,Rhino.Render.DynamicIconUsage)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.DynamicIcon(System.Drawing.Size,System.Drawing.Bitmap@,Rhino.Render.DynamicIconUsage)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace