RhinoCommon API
SimpleArrayGeometryPointer.ConstPointer Method
 Gets the constant (immutable) pointer of this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
The constant pointer.
See Also
Reference
SimpleArrayGeometryPointer Class
Rhino.Runtime.InteropWrappers Namespace