RhinoCommon API
RenderContent.VirtualIcon Method
 Icon to display in the content browser, this bitmap needs to be valid for the life of this content object, the content object that returns the bitmap is responsible for disposing of the bitmap.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool VirtualIcon(
	Size size,
	out Bitmap bitmap
)
Public Overridable Function VirtualIcon (
	size As Size,
	<OutAttribute> ByRef bitmap As Bitmap
) As Boolean
Parameters
size
Type: System.Drawing.Size
 Requested icon size
bitmap
Type: System.Drawing.Bitmap
[Missing <param name="bitmap"/> documentation for "M:Rhino.Render.RenderContent.VirtualIcon(System.Drawing.Size,System.Drawing.Bitmap@)"]
Return Value
Type: Boolean
 Return Icon to display in the content browser.
See Also
Reference
RenderContent Class
Rhino.Render Namespace