RhinoCommon API
RhinoDoc.Finalize Method
[Missing <summary> documentation for "M:Rhino.RhinoDoc.Finalize"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RhinoDoc Class
Rhino Namespace