RhinoCommon API
LightManagerSupport.UnGroup Method
 UnGroups the lights
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract void UnGroup(
	RhinoDoc doc,
	ref LightArray light_array
)
Public MustOverride Sub UnGroup (
	doc As RhinoDoc,
	ByRef light_array As LightArray
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.LightManagerSupport.UnGroup(Rhino.RhinoDoc,Rhino.Render.LightArray@)"]
light_array
Type: Rhino.Render.LightArray
[Missing <param name="light_array"/> documentation for "M:Rhino.Render.LightManagerSupport.UnGroup(Rhino.RhinoDoc,Rhino.Render.LightArray@)"]
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace