RhinoCommon API
PolylineCurve.SetPoint Method
 Sets a point at a specified index in the polyline curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetPoint(
	int index,
	Point3d point
)
Public Sub SetPoint (
	index As Integer,
	point As Point3d
)
Parameters
index
Type: System.Int32
An index.
point
Type: Rhino.Geometry.Point3d
A point location to set.
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace