RhinoCommon API
NodeInCodeTable.Add Method
 Adds, or replaces a new instance of component function information.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Add(
	ComponentFunctionInfo item
)
Public Sub Add (
	item As ComponentFunctionInfo
)
Parameters
item
Type: Rhino.NodeInCode.ComponentFunctionInfo
[Missing <param name="item"/> documentation for "M:Rhino.NodeInCode.NodeInCodeTable.Add(Rhino.NodeInCode.ComponentFunctionInfo)"]
See Also
Reference
NodeInCodeTable Class
Rhino.NodeInCode Namespace