RhinoCommon API
LayerTable.Purge Method (Int32, Boolean)
 Deletes a layer and all geometry objects on a layer
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.5
Syntax
public bool Purge(
	int layerIndex,
	bool quiet
)
Public Function Purge (
	layerIndex As Integer,
	quiet As Boolean
) As Boolean
Parameters
layerIndex
Type: System.Int32
 zero based index of layer to delete. This must be in the range 0 <= layerIndex < LayerTable.Count.
quiet
Type: System.Boolean
 If true, no warning message box appears if a layer the layer cannot be deleted because it is the current layer.
Return Value
Type: Boolean
 true if successful. false if layerIndex is out of range or the layer cannot be deleted because it is the current layer.
See Also
Reference
LayerTable Class
Purge Overload
Rhino.DocObjects.Tables Namespace