RhinoCommon API
ObjectTable.AnySelectedObjects Method
 Fast existence test for the current selection, with a reference breakdown, that does NOT materialize the selected objects. This is equivalent to testing whether FindByFilter(ObjectEnumeratorSettings) with NormalObjects, ActiveObjects, ReferenceObjects, IncludeLights and SelectedObjectsFilter would return any objects (and whether any of them are reference objects / reference blocks), but it uses the fast selection iterator and stops at the first match instead of building a RhinoObject[] of the entire selection. Intended for selection-change UI guards (e.g. the Layers panel).
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool AnySelectedObjects(
	out bool referenceObjectSelected,
	out bool referenceBlockSelected
)
Public Function AnySelectedObjects (
	<OutAttribute> ByRef referenceObjectSelected As Boolean,
	<OutAttribute> ByRef referenceBlockSelected As Boolean
) As Boolean
Parameters
referenceObjectSelected
Type: System.Boolean
Set to true if any selected object is a reference object.
referenceBlockSelected
Type: System.Boolean
Set to true if any selected reference object is a block (instance reference).
Return Value
Type: Boolean
true if any object is selected.
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace