RhinoCommon API
RenderPrimitive.TryGetSphere Method
 Call this method to get a sphere primitive for this mesh. If this meshes PrimitiveType is not a Sphere then the sphere parameter is set to Unset.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool TryGetSphere(
	out Sphere sphere
)
Public Function TryGetSphere (
	<OutAttribute> ByRef sphere As Sphere
) As Boolean
Parameters
sphere
Type: Rhino.Geometry.Sphere
 Gets set to the primitive sphere for this object on success.
Return Value
Type: Boolean
 Returns true if PrimitiveType is Sphere and the sphere parameter was initialized otherwise returns false.
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace