RhinoCommon API
Material.SetTransparencyTexture Method (String)
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.SetTransparencyTexture(System.String)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SetTransparencyTexture(
	string filename
)
Public Function SetTransparencyTexture (
	filename As String
) As Boolean
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.DocObjects.Material.SetTransparencyTexture(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.SetTransparencyTexture(System.String)"]
See Also
Reference
Material Class
SetTransparencyTexture Overload
Rhino.DocObjects Namespace
Material.SetTexture(Texture, TextureType)