RhinoCommon API
RenderTexture.GetDisplayInViewport Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetDisplayInViewport"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool GetDisplayInViewport()
Public Function GetDisplayInViewport As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetDisplayInViewport"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace