RhinoCommon API
RhinoList<T>.IndexOf Method (T, Int32, Int32)
 Searches for the specified object and returns the zero-based index of the first occurrence within the range of elements in the List that starts at the specified index and contains the specified number of elements.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int IndexOf(
	T item,
	int index,
	int count
)
Public Function IndexOf (
	item As T,
	index As Integer,
	count As Integer
) As Integer
Parameters
item
Type: T
The object to locate in the List. The value can be a null reference (Nothing in Visual Basic) for reference types.
index
Type: System.Int32
The zero-based starting index of the search.
count
Type: System.Int32
The number of elements in the section to search.
Return Value
Type: Int32
The zero-based index of the first occurrence of item within the entire List, if found; otherwise, -1.
See Also
Reference
RhinoList<T> Class
IndexOf Overload
Rhino.Collections Namespace