RhinoCommon API
VolumeMassProperties.Compute Method (Mesh, Boolean, Boolean, Boolean, Boolean)
 Compute the VolumeMassProperties for a single Mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static VolumeMassProperties Compute(
	Mesh mesh,
	bool volume,
	bool firstMoments,
	bool secondMoments,
	bool productMoments
)
Public Shared Function Compute (
	mesh As Mesh,
	volume As Boolean,
	firstMoments As Boolean,
	secondMoments As Boolean,
	productMoments As Boolean
) As VolumeMassProperties
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to measure.
volume
Type: System.Boolean
true to calculate volume.
firstMoments
Type: System.Boolean
true to calculate volume first moments, volume, and volume centroid.
secondMoments
Type: System.Boolean
true to calculate volume second moments.
productMoments
Type: System.Boolean
true to calculate volume product moments.
Return Value
Type: VolumeMassProperties
The VolumeMassProperties for the given Mesh or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When Mesh is null.
See Also
Reference
VolumeMassProperties Class
Compute Overload
Rhino.Geometry Namespace