RhinoCommon API
RenderTexture.SaveAsImage Method
 Save texture as image
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public bool SaveAsImage(
	string FullPath,
	int width,
	int height,
	int depth
)
Public Function SaveAsImage (
	FullPath As String,
	width As Integer,
	height As Integer,
	depth As Integer
) As Boolean
Parameters
FullPath
Type: System.String
The full path of the file
width
Type: System.Int32
Image width
height
Type: System.Int32
Image height
depth
Type: System.Int32
Image depth
Return Value
Type: Boolean
returns true if file was saved, otherwise false
See Also
Reference
RenderTexture Class
Rhino.Render Namespace