RhinoCommon API
SubDComponentParameter.GetHashCode Method
Returns the hash code for this instance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A 32-bit signed integer that is the hash code for this instance.
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace