RhinoCommon API
StringParser.ParseNumber Method
 Parse a string expression to get a number
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static int ParseNumber(
	string expression,
	int max_count,
	StringParserSettings settings_in,
	ref StringParserSettings settings_out,
	out double answer
)
Public Shared Function ParseNumber (
	expression As String,
	max_count As Integer,
	settings_in As StringParserSettings,
	ByRef settings_out As StringParserSettings,
	<OutAttribute> ByRef answer As Double
) As Integer
Parameters
expression
Type: System.String
 String to parse
max_count
Type: System.Int32
 Maximum number of characters to parse
settings_in
Type: Rhino.Input.StringParserSettings
 Determines what input will be parsed
settings_out
Type: Rhino.Input.StringParserSettings
 Reports the results of the parse operation
answer
Type: System.Double
 The number result of the parse operation
Return Value
Type: Int32
 Count of characters in expression parsed if ParseNumber() returns 0, parse was unsuccessful
See Also
Reference
StringParser Class
Rhino.Input Namespace