RhinoCommon API
PersistentSettings.GetPoint3d Method (String, Point3d, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetPoint3d(System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point3d GetPoint3d(
	string key,
	Point3d defaultValue,
	IEnumerable<string> legacyKeyList
)
Public Function GetPoint3d (
	key As String,
	defaultValue As Point3d,
	legacyKeyList As IEnumerable(Of String)
) As Point3d
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetPoint3d(System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{System.String})"]
defaultValue
Type: Rhino.Geometry.Point3d
[Missing <param name="defaultValue"/> documentation for "M:Rhino.PersistentSettings.GetPoint3d(System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.GetPoint3d(System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Point3d
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetPoint3d(System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
GetPoint3d Overload
Rhino Namespace