RhinoCommon API
ThicknessAnalysisSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static ThicknessAnalysisSettingsState GetCurrentState()
Public Shared Function GetCurrentState As ThicknessAnalysisSettingsState
Return Value
Type: ThicknessAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.ThicknessAnalysisSettings.GetCurrentState"]
See Also
Reference
ThicknessAnalysisSettings Class
Rhino.ApplicationSettings Namespace