RhinoCommon API
Curve.CreateBooleanIntersection Method (Curve, Curve, Double)
 Calculates the boolean intersection of two closed, planar curves. Note, curves must be co-planar.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Curve[] CreateBooleanIntersection(
	Curve curveA,
	Curve curveB,
	double tolerance
)
Public Shared Function CreateBooleanIntersection (
	curveA As Curve,
	curveB As Curve,
	tolerance As Double
) As Curve()
Parameters
curveA
Type: Rhino.Geometry.Curve
The first closed, planar curve.
curveB
Type: Rhino.Geometry.Curve
The second closed, planar curve.
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.Curve.CreateBooleanIntersection(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)"]
Return Value
Type: Curve[]
Result curves on success, empty array if no intersection could be calculated.
See Also
Reference
Curve Class
CreateBooleanIntersection Overload
Rhino.Geometry Namespace