RhinoCommon API
CurvatureAnalysisSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static CurvatureAnalysisSettingsState GetCurrentState()
Public Shared Function GetCurrentState As CurvatureAnalysisSettingsState
Return Value
Type: CurvatureAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.CurvatureAnalysisSettings.GetCurrentState"]
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace