RhinoCommon API
DisplayPipeline.DraweInferencePoint Method
 Draw inference point used in gesture based snapping
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.17
Syntax
public void DraweInferencePoint(
	Point3d P,
	Color color
)
Public Sub DraweInferencePoint (
	P As Point3d,
	color As Color
)
Parameters
P
Type: Rhino.Geometry.Point3d
Location of point in world coordinates
color
Type: System.Drawing.Color
Color of the point
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace