RhinoCommon API
InstanceDefinitionTable.InstanceDefinitionIndex Method
 Get the index of the instance definition with a given id.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int InstanceDefinitionIndex(
	Guid instanceId,
	bool ignoreDeletedInstanceDefinitions
)
Public Function InstanceDefinitionIndex (
	instanceId As Guid,
	ignoreDeletedInstanceDefinitions As Boolean
) As Integer
Parameters
instanceId
Type: System.Guid
Unique id of the instance definition to search for
ignoreDeletedInstanceDefinitions
Type: System.Boolean
true means don't search deleted instance definitions.
Return Value
Type: Int32
index > -1 if instance definition was found.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace