RhinoCommon API
SerializationOptions Constructor
 Initializes a new instance of the SerializationOptions class.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SerializationOptions()
Public Sub New
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace