RhinoCommon API
LinearWorkflow Constructor
 Create a utility object not associated with any document.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LinearWorkflow()
Public Sub New
See Also
Reference
LinearWorkflow Class
LinearWorkflow Overload
Rhino.Render Namespace