RhinoCommon API
NamedParametersEventArgs.TryGetInt Method
 Try to get an int value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public bool TryGetInt(
	string name,
	out int value
)
Public Function TryGetInt (
	name As String,
	<OutAttribute> ByRef value As Integer
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetInt(System.String,System.Int32@)"]
value
Type: System.Int32
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetInt(System.String,System.Int32@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetInt(System.String,System.Int32@)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace