RhinoCommon API
Intersection.CircleCircle Method
 Intersects two circles using exact calculations.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public static CircleCircleIntersection CircleCircle(
	Circle circleA,
	Circle circleB,
	out Point3d intersectionPoint1,
	out Point3d intersectionPoint2
)
Public Shared Function CircleCircle (
	circleA As Circle,
	circleB As Circle,
	<OutAttribute> ByRef intersectionPoint1 As Point3d,
	<OutAttribute> ByRef intersectionPoint2 As Point3d
) As CircleCircleIntersection
Parameters
circleA
Type: Rhino.Geometry.Circle
First circle to intersect.
circleB
Type: Rhino.Geometry.Circle
Second circle to intersect.
intersectionPoint1
Type: Rhino.Geometry.Point3d
First intersection point.
intersectionPoint2
Type: Rhino.Geometry.Point3d
Second intersection point.
Return Value
Type: CircleCircleIntersection
The intersection type.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace