RhinoCommon API
DisplayPipeline.ClearFrameBuffer Method
 Fill the frame buffer with a single color. This function also clears the depth buffer for engines that support depth buffered drawing.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void ClearFrameBuffer(
	Color color
)
Public Sub ClearFrameBuffer (
	color As Color
)
Parameters
color
Type: System.Drawing.Color
the color to fill the frame buffer with
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace