RhinoCommon API
PythonCompiledCode Constructor
Initializes a new instance of the PythonCompiledCode class
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected PythonCompiledCode()
Protected Sub New
See Also
Reference
PythonCompiledCode Class
Rhino.Runtime Namespace