RhinoCommon API
RhinoViewport.MouseInOutDolly Method
 Moves the camera towards or away from the view maintaining focus on the view.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool MouseInOutDolly(
	Point mousePreviousPoint,
	Point mouseCurrentPoint
)
Public Function MouseInOutDolly (
	mousePreviousPoint As Point,
	mouseCurrentPoint As Point
) As Boolean
Parameters
mousePreviousPoint
Type: System.Drawing.Point
The mouse previous point.
mouseCurrentPoint
Type: System.Drawing.Point
The mouse current point.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.MouseInOutDolly(System.Drawing.Point,System.Drawing.Point)"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace