RhinoCommon API
NamedPositionTable.ObjectIds Method (String)
Array of Rhino Object Guids related to a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid[] ObjectIds(
	string name
)
Public Function ObjectIds (
	name As String
) As Guid()
Parameters
name
Type: System.String
 The name of the Named Position from which you want to retrieve the objects.
Return Value
Type: Guid[]
 Array of Guid which pertain to the objects tracked by the Named Position, or null in case no such Named Position is found.
See Also
Reference
NamedPositionTable Class
ObjectIds Overload
Rhino.DocObjects.Tables Namespace