RhinoCommon API
PointObject.DuplicatePointGeometry Method
[Missing <summary> documentation for "M:Rhino.DocObjects.PointObject.DuplicatePointGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point DuplicatePointGeometry()
Public Function DuplicatePointGeometry As Point
Return Value
Type: Point
[Missing <returns> documentation for "M:Rhino.DocObjects.PointObject.DuplicatePointGeometry"]
See Also
Reference
PointObject Class
Rhino.DocObjects Namespace