RhinoCommon API
IHeaderButtonHandler.ButtonDetails Method
 Implement this method to describe custom buttons on the section header. RDK calls this method continually increasing iIndex until it returns \e false
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
bool ButtonDetails(
	int index,
	ref Bitmap iconOut,
	ref string sToolTipOut
)
Function ButtonDetails (
	index As Integer,
	ByRef iconOut As Bitmap,
	ByRef sToolTipOut As String
) As Boolean
Parameters
index
Type: System.Int32
index is the button index starting at zero and increasing with each call.
iconOut
Type: System.Drawing.Bitmap
iconOut accepts the button's imagery, or 'icon'. If an icon is not required, do not set this parameter.
sToolTipOut
Type: System.String
sToolTipOut accepts the button's tool-tip. If a tool-tip is not required, do not set this parameter.
Return Value
Type: Boolean
\e true if button is required, \e false to stop.
See Also
Reference
IHeaderButtonHandler Interface
Rhino.UI.Controls Namespace