RhinoCommon API
BinaryArchiveReader.ReadSize Method
 Reads a Size from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Size ReadSize()
Public Function ReadSize As Size
Return Value
Type: Size
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace