RhinoCommon API
Transform2d.Translation Method (Vector2d)
 Constructs a new translation (move) transformation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d Translation(
	Vector2d motion
)
Public Shared Function Translation (
	motion As Vector2d
) As Transform2d
Parameters
motion
Type: Rhino.Geometry.Vector2d
Translation (motion) vector.
Return Value
Type: Transform2d
A transform matrix which moves geometry along the motion vector.
See Also
Reference
Transform2d Structure
Translation Overload
Rhino.Geometry Namespace