RhinoCommon API
StringParser.ParseAngleExpressionDegrees Method
[Missing <summary> documentation for "M:Rhino.Input.StringParser.ParseAngleExpressionDegrees(System.String,System.Double@)"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool ParseAngleExpressionDegrees(
	string expression,
	out double angle_degrees
)
Public Shared Function ParseAngleExpressionDegrees (
	expression As String,
	<OutAttribute> ByRef angle_degrees As Double
) As Boolean
Parameters
expression
Type: System.String
[Missing <param name="expression"/> documentation for "M:Rhino.Input.StringParser.ParseAngleExpressionDegrees(System.String,System.Double@)"]
angle_degrees
Type: System.Double
[Missing <param name="angle_degrees"/> documentation for "M:Rhino.Input.StringParser.ParseAngleExpressionDegrees(System.String,System.Double@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Input.StringParser.ParseAngleExpressionDegrees(System.String,System.Double@)"]
See Also
Reference
StringParser Class
Rhino.Input Namespace