RhinoCommon API
IPanelsService.DockBarIsVisible Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.DockBarIsVisible(System.Guid)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
bool DockBarIsVisible(
	Guid barId
)
Function DockBarIsVisible (
	barId As Guid
) As Boolean
Parameters
barId
Type: System.Guid
[Missing <param name="barId"/> documentation for "M:Rhino.UI.IPanelsService.DockBarIsVisible(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.DockBarIsVisible(System.Guid)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace