RhinoCommon API
DisplayPipeline.DrawDraftAnglePreview Method (Mesh, Color)
 Draws a Mesh in Draft Angle preview.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void DrawDraftAnglePreview(
	Mesh mesh,
	Color color
)
Public Sub DrawDraftAnglePreview (
	mesh As Mesh,
	color As Color
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to draw.
color
Type: System.Drawing.Color
Objct color.
See Also
Reference
DisplayPipeline Class
DrawDraftAnglePreview Overload
Rhino.Display Namespace