RhinoCommon API
NurbsSurfacePointList.GetPoint Method (Int32, Int32, Point3d)
 Gets a world 3-D, or Euclidean, control point at the given (u, v) index. The 4-D representation is (x, y, z, 1.0).
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GetPoint(
	int u,
	int v,
	out Point3d point
)
Public Function GetPoint (
	u As Integer,
	v As Integer,
	<OutAttribute> ByRef point As Point3d
) As Boolean
Parameters
u
Type: System.Int32
Index of control point in the surface U direction.
v
Type: System.Int32
Index of control point in the surface V direction.
point
Type: Rhino.Geometry.Point3d
Coordinate of control point.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsSurfacePointList Class
GetPoint Overload
Rhino.Geometry.Collections Namespace