RhinoCommon API
WorksessionFileLayerOverride.GetFileValues Method
 Gets a copy of the layer's settings in the reference model when the worksession was saved.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFileLayerValues GetFileValues()
Public Function GetFileValues As WorksessionFileLayerValues
Return Value
Type: WorksessionFileLayerValues
A copy. Changes to it are kept only after SetFileValues(WorksessionFileLayerValues).
See Also
Reference
WorksessionFileLayerOverride Class
Rhino.FileIO Namespace