RhinoCommon API
SnapShotsClient.SupportsObject Method
 Returns true if the client saves/restores object user data for the given object.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool SupportsObject(
	RhinoObject doc_object
)
Public MustOverride Function SupportsObject (
	doc_object As RhinoObject
) As Boolean
Parameters
doc_object
Type: Rhino.DocObjects.RhinoObject
doc_object is the given object
Return Value
Type: Boolean
 true if the client saves/restores object user data for the given object.
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace