RhinoCommon API
RenderTexture.SimulateTexture Method (SimulatedTexture, Boolean)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.SimulateTexture(Rhino.Render.SimulatedTexture@,System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
[ObsoleteAttribute("Use SimulateTexture with size, TextureGeneration and object instead")]
public virtual void SimulateTexture(
	ref SimulatedTexture simulation,
	bool isForDataOnly
)
<ObsoleteAttribute("Use SimulateTexture with size, TextureGeneration and object instead")>
Public Overridable Sub SimulateTexture (
	ByRef simulation As SimulatedTexture,
	isForDataOnly As Boolean
)
Parameters
simulation
Type: Rhino.Render.SimulatedTexture
[Missing <param name="simulation"/> documentation for "M:Rhino.Render.RenderTexture.SimulateTexture(Rhino.Render.SimulatedTexture@,System.Boolean)"]
isForDataOnly
Type: System.Boolean
[Missing <param name="isForDataOnly"/> documentation for "M:Rhino.Render.RenderTexture.SimulateTexture(Rhino.Render.SimulatedTexture@,System.Boolean)"]
See Also
Reference
RenderTexture Class
SimulateTexture Overload
Rhino.Render Namespace