RhinoCommon API
RhinoPageView.RemoveFromAllageViewGroups Method
 Removes this page view to all page view groups.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void RemoveFromAllageViewGroups()
Public Sub RemoveFromAllageViewGroups
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace