RhinoCommon API
TextEntity.CreateExtrusions Method (DimensionStyle, Double, Boolean, Double, Double)
 Creates extrusions from the outline curves with specified height.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Extrusion[] CreateExtrusions(
	DimensionStyle dimstyle,
	double height,
	bool makeSmallCaps,
	double smallCapsScale,
	double spacing
)
Public Function CreateExtrusions (
	dimstyle As DimensionStyle,
	height As Double,
	makeSmallCaps As Boolean,
	smallCapsScale As Double,
	spacing As Double
) As Extrusion()
Parameters
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.TextEntity.CreateExtrusions(Rhino.DocObjects.DimensionStyle,System.Double,System.Boolean,System.Double,System.Double)"]
height
Type: System.Double
 Height in direction perpendicular to plane of text.
makeSmallCaps
Type: System.Boolean
 Set to true to create small caps out of lower case letters.
smallCapsScale
Type: System.Double
 Set to create small caps out of lower case letters.
spacing
Type: System.Double
 Set to add additional spacing between glyph output.
Return Value
Type: Extrusion[]
An array of planar breps.
See Also
Reference
TextEntity Class
CreateExtrusions Overload
Rhino.Geometry Namespace