RhinoCommon API
Material.MaterialChannelIndexFromId Method
 Finds index of the material channel that refers to a material channel with the given id. Optionally adds channel if one is not found.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.26
Syntax
public int MaterialChannelIndexFromId(
	Guid material_channel_id,
	bool bAddIdIfNotPresent
)
Public Function MaterialChannelIndexFromId (
	material_channel_id As Guid,
	bAddIdIfNotPresent As Boolean
) As Integer
Parameters
material_channel_id
Type: System.Guid
Id
bAddIdIfNotPresent
Type: System.Boolean
Controls whether to add channel if none exist
Return Value
Type: Int32
Index of the material channel
See Also
Reference
Material Class
Rhino.DocObjects Namespace