RhinoCommon API
LocalizeStringPair Implicit Conversion (LocalizeStringPair to String)
[Missing <summary> documentation for "M:Rhino.UI.LocalizeStringPair.op_Implicit(Rhino.UI.LocalizeStringPair)~System.String"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static implicit operator string (
	LocalizeStringPair lcp
)
Public Shared Widening Operator CType (
	lcp As LocalizeStringPair
) As String
Parameters
lcp
Type: Rhino.UI.LocalizeStringPair
[Missing <param name="lcp"/> documentation for "M:Rhino.UI.LocalizeStringPair.op_Implicit(Rhino.UI.LocalizeStringPair)~System.String"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.LocalizeStringPair.op_Implicit(Rhino.UI.LocalizeStringPair)~System.String"]
See Also
Reference
LocalizeStringPair Class
Rhino.UI Namespace