RhinoCommon API
Mesh.GetCachedTextureCoordinates Method (RhinoObject, Texture)
 Returns cached texture coordinate set based on the texture. Make sure to set up cached texture coordinates for all textures in the material first by calling SetCachedTextureCoordinatesFromMaterial(RhinoObject rhinoObject, Rhino.DocObjects.Material material) If this function returns null then there are no texture coordinates available.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public CachedTextureCoordinates GetCachedTextureCoordinates(
	RhinoObject rhinoObject,
	Texture texture
)
Public Function GetCachedTextureCoordinates (
	rhinoObject As RhinoObject,
	texture As Texture
) As CachedTextureCoordinates
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
RhinoObject that defines texture mappings
texture
Type: Rhino.DocObjects.Texture
Texture that defines the mapping channel
Return Value
Type: CachedTextureCoordinates
Cached texture coordinates if available and otherwise null
See Also
Reference
Mesh Class
GetCachedTextureCoordinates Overload
Rhino.Geometry Namespace