RhinoCommon API
File3dmRenderContent.GetParameter Method
 Gets a named parameter. The parameter value or null if not found.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IConvertible GetParameter(
	string param
)
Public Function GetParameter (
	param As String
) As IConvertible
Parameters
param
Type: System.String
[Missing <param name="param"/> documentation for "M:Rhino.FileIO.File3dmRenderContent.GetParameter(System.String)"]
Return Value
Type: IConvertible
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderContent.GetParameter(System.String)"]
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace