RhinoCommon API
Dimension.UpdateDimensionText Method (DimensionStyle, LengthUnit)
 Remakes dimension text geometry object and sets it on the dimension.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void UpdateDimensionText(
	DimensionStyle style,
	LengthUnit units
)
Public Sub UpdateDimensionText (
	style As DimensionStyle,
	units As LengthUnit
)
Parameters
style
Type: Rhino.DocObjects.DimensionStyle
The dimension style.
units
Type: Rhino.LengthUnit
The length units.
See Also
Reference
Dimension Class
UpdateDimensionText Overload
Rhino.Geometry Namespace