RhinoCommon API
Utilities.ChangeContentType Method
 Changes the type of a content. This deletes the content and creates a replacement of the specified type allowing the caller to decide about harvesting.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RenderContent ChangeContentType(
	RenderContent oldContent,
	Guid newType,
	bool harvestParameters
)
Public Shared Function ChangeContentType (
	oldContent As RenderContent,
	newType As Guid,
	harvestParameters As Boolean
) As RenderContent
Parameters
oldContent
Type: Rhino.Render.RenderContent
oldContent is the old content which is deleted.
newType
Type: System.Guid
The type of content to replace pOldContent with.
harvestParameters
Type: System.Boolean
Determines whether or not parameter harvesting will be performed.
Return Value
Type: RenderContent
A new persistent render content.
See Also
Reference
Utilities Class
Rhino.Render Namespace