RhinoCommon API
RenderPipeline.ResumeRendering Method
 Implement to resume current render session
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual void ResumeRendering()
Public Overridable Sub ResumeRendering
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace