RhinoCommon API
DisplayModeDescription.AddDisplayMode Method (DisplayModeDescription)
 Adds a new display mode from an existing description. Note that this only registers the mode in memory; call UpdateDisplayMode to persist it to disk.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid AddDisplayMode(
	DisplayModeDescription displayMode
)
Public Shared Function AddDisplayMode (
	displayMode As DisplayModeDescription
) As Guid
Parameters
displayMode
Type: Rhino.Display.DisplayModeDescription
The display mode description to add.
Return Value
Type: Guid
The id of the new display mode if successful. Guid.Empty on error.
See Also
Reference
DisplayModeDescription Class
AddDisplayMode Overload
Rhino.Display Namespace