RhinoCommon API
SimpleArrayInt Constructor
 Initializes a new SimpleArrayInt class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SimpleArrayInt()
Public Sub New
See Also
Reference
SimpleArrayInt Class
SimpleArrayInt Overload
Rhino.Runtime.InteropWrappers Namespace