RhinoCommon API
LayerTable.Modify Method (Layer, Guid, Boolean)
Modifies layer settings.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Modify(
	Layer newSettings,
	Guid layerId,
	bool quiet
)
Public Function Modify (
	newSettings As Layer,
	layerId As Guid,
	quiet As Boolean
) As Boolean
Parameters
newSettings
Type: Rhino.DocObjects.Layer
This information is copied.
layerId
Type: System.Guid
 Id of layer.
quiet
Type: System.Boolean
if false, information message boxes pop up when illegal changes are attempted.
Return Value
Type: Boolean
 true if successful. false if layerIndex is out of range or the settings attempt to lock or hide the current layer.
See Also
Reference
LayerTable Class
Modify Overload
Rhino.DocObjects.Tables Namespace