RhinoCommon API
Intersection.MeshPlane Method (Mesh, MeshIntersectionCache, IEnumerable<Plane>, Double)
 Intersects a mesh with a collection of infinite planes, providing both overlaps and perforations.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Polyline[] MeshPlane(
	Mesh mesh,
	MeshIntersectionCache cache,
	IEnumerable<Plane> planes,
	double tolerance
)
Public Shared Function MeshPlane (
	mesh As Mesh,
	cache As MeshIntersectionCache,
	planes As IEnumerable(Of Plane),
	tolerance As Double
) As Polyline()
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to intersect.
cache
Type: Rhino.Geometry.Intersect.MeshIntersectionCache
Intersection cache for the mesh.
planes
Type: System.Collections.Generic.IEnumerable<Plane>
Planes to intersect with.
tolerance
Type: System.Double
Intersection tolerance.
Return Value
Type: Polyline[]
 An array of polylines describing the intersection loops, or null if no intersections could be found.
See Also
Reference
Intersection Class
MeshPlane Overload
Rhino.Geometry.Intersect Namespace