RhinoCommon API
LengthMassProperties.Compute Method (IEnumerable<Curve>, Boolean, Boolean, Boolean, Boolean)
 Calculates the length mass properties of an enumeration of curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public static LengthMassProperties Compute(
	IEnumerable<Curve> curves,
	bool length,
	bool firstMoments,
	bool secondMoments,
	bool productMoments
)
Public Shared Function Compute (
	curves As IEnumerable(Of Curve),
	length As Boolean,
	firstMoments As Boolean,
	secondMoments As Boolean,
	productMoments As Boolean
) As LengthMassProperties
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
An enumeration of curves.
length
Type: System.Boolean
true to calculate length.
firstMoments
Type: System.Boolean
true to calculate length first moments, length, and length centroid.
secondMoments
Type: System.Boolean
true to calculate length second moments.
productMoments
Type: System.Boolean
true to calculate length product moments.
Return Value
Type: LengthMassProperties
The LengthMassProperties for the given enumeration of curves, or null on failure.
See Also
Reference
LengthMassProperties Class
Compute Overload
Rhino.Geometry Namespace