RhinoCommon API
AppearanceSettings.InitialMainWindowPosition Method
 Location where the Main Rhino window attempts to show when the application is first started.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool InitialMainWindowPosition(
	out Rectangle bounds
)
Public Shared Function InitialMainWindowPosition (
	<OutAttribute> ByRef bounds As Rectangle
) As Boolean
Parameters
bounds
Type: System.Drawing.Rectangle
The rectangle in which the main window attempts to shows is assigned to this out parameter during the call.
Return Value
Type: Boolean
false if the information could not be retrieved.
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace