RhinoCommon API
Curve.Split Method (Surface, Double)
Note: This API is now obsolete.
 Splits a curve into pieces using a surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use version that takes an angle tolerance")]
public Curve[] Split(
	Surface cutter,
	double tolerance
)
<ObsoleteAttribute("Use version that takes an angle tolerance")>
Public Function Split (
	cutter As Surface,
	tolerance As Double
) As Curve()
Parameters
cutter
Type: Rhino.Geometry.Surface
A cutting surface or polysurface.
tolerance
Type: System.Double
Tolerance for computing intersections.
Return Value
Type: Curve[]
An array of curves. This array can be empty.
See Also
Reference
Curve Class
Split Overload
Rhino.Geometry Namespace