RhinoCommon API
RhinoViewport.PushConstructionPlane Method
 Pushes the current construction plane on the viewport's construction plane stack and sets the construction plane to cplane.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void PushConstructionPlane(
	ConstructionPlane cplane
)
Public Sub PushConstructionPlane (
	cplane As ConstructionPlane
)
Parameters
cplane
Type: Rhino.DocObjects.ConstructionPlane
The construction plane to push.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace