RhinoCommon API
FileSlc.Write Method
Write a SLC file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool Write(
	string filename,
	RhinoDoc doc,
	FileSlcWriteOptions options
)
Public Shared Function Write (
	filename As String,
	doc As RhinoDoc,
	options As FileSlcWriteOptions
) As Boolean
Parameters
filename
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileSlcWriteOptions
options used for generating the SLC file
Return Value
Type: Boolean
true on success
See Also
Reference
FileSlc Class
Rhino.FileIO Namespace