RhinoCommon API
Worksession.GetLockInformation Method
 Describes whether a worksession model's file is locked, and by whom.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static string GetLockInformation(
	string modelPath
)
Public Shared Function GetLockInformation (
	modelPath As String
) As String
Parameters
modelPath
Type: System.String
The full path to the model's file.
Return Value
Type: String
 A localized description of the file's lock state, or an empty string if it could not be determined.
Remarks
 This reads the file's lock file and does not depend on any document, which is why it is static.
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace