RhinoCommon API
SubDDisplayParameters.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SubDDisplayParameters Class
Dispose Overload
Rhino.Geometry Namespace