RhinoCommon API
RenderChannels.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.RenderChannels.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RenderChannels Class
Rhino.Render Namespace