RhinoCommon API
Utilities.FindFile Method (RhinoDoc, String)
 Finds a file and also handles network shares.
Remarks
This is a replacement for CRhinoFileUtilities::FindFile().
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string FindFile(
	RhinoDoc doc,
	string fullPathToFile
)
Public Shared Function FindFile (
	doc As RhinoDoc,
	fullPathToFile As String
) As String
Parameters
doc
Type: Rhino.RhinoDoc
Document to use for locating .3dm file's folder.
fullPathToFile
Type: System.String
The file to be found.
Return Value
Type: String
The found file.
See Also
Reference
Utilities Class
FindFile Overload
Rhino.Render Namespace