RhinoCommon API
EdgeAnalysisSettings.UpdateFromState Method
 Sets all settings to a particular defined joined state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void UpdateFromState(
	EdgeAnalysisSettingsState state
)
Public Shared Sub UpdateFromState (
	state As EdgeAnalysisSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.EdgeAnalysisSettingsState
The particular state.
See Also
Reference
EdgeAnalysisSettings Class
Rhino.ApplicationSettings Namespace