RhinoCommon API
MeshingParameters.Equals Method (MeshingParameters)
 Determines whether the specified MeshingParameters has the same values as the present MeshingParameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Equals(
	MeshingParameters other
)
Public Function Equals (
	other As MeshingParameters
) As Boolean
Parameters
other
Type: Rhino.Geometry.MeshingParameters
The specified MeshingParameters.
Return Value
Type: Boolean
true if MeshingParameters has the same values as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
MeshingParameters Class
Equals Overload
Rhino.Geometry Namespace