RhinoCommon API
ObjectTable.AddPoint Method (Point, ObjectAttributes, HistoryRecord, Boolean)
Adds a point object and its geometry-linked information to the document
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid AddPoint(
	Point point,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddPoint (
	point As Point,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
point
Type: Rhino.Geometry.Point
A point geometry class.
attributes
Type: Rhino.DocObjects.ObjectAttributes
attributes to apply to point. null is acceptable
history
Type: Rhino.DocObjects.HistoryRecord
history associated with this point. null is acceptable
reference
Type: System.Boolean
 true if the object is from a reference file. Reference objects do not persist in archives
Return Value
Type: Guid
A unique identifier for the object.
Exceptions
Exception | Condition
ArgumentNullException | If point is null.
See Also
Reference
ObjectTable Class
AddPoint Overload
Rhino.DocObjects.Tables Namespace