RhinoCommon API
TextEntity.CreateCurves Method (DimensionStyle, Boolean, Boolean, Double, Double)
 Returns the outline curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Curve[] CreateCurves(
	DimensionStyle dimstyle,
	bool allowOpen,
	bool makeSmallCaps,
	double smallCapsScale,
	double spacing
)
Public Function CreateCurves (
	dimstyle As DimensionStyle,
	allowOpen As Boolean,
	makeSmallCaps As Boolean,
	smallCapsScale As Double,
	spacing As Double
) As Curve()
Parameters
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.TextEntity.CreateCurves(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Boolean,System.Double,System.Double)"]
allowOpen
Type: System.Boolean
 Set to true to prevent forced closing of open curves retrieved from glyphs.
makeSmallCaps
Type: System.Boolean
 Set to create small caps out of lower case letters.
smallCapsScale
Type: System.Double
 If makeSmallCaps is true, this will be the scale factor for small caps.
spacing
Type: System.Double
 Set to add additional spacing between glyph output.
Return Value
Type: Curve[]
An array of curves that forms the outline or content of this text entity.
See Also
Reference
TextEntity Class
CreateCurves Overload
Rhino.Geometry Namespace