RhinoCommon API
BinaryArchiveWriter.WriteSByteArray Method
 Writes a list, an array, or any enumerable of SByte to the archive.
The return will always be an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteSByteArray(
	IEnumerable<sbyte> value
)
Public Sub WriteSByteArray (
	value As IEnumerable(Of SByte)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<SByte>
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace