RhinoCommon API
RhinoApp.GetExecutableDirectory Method
Directory where main RhinoCore binary is located
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public static DirectoryInfo GetExecutableDirectory()
Public Shared Function GetExecutableDirectory As DirectoryInfo
Return Value
Type: DirectoryInfo
[Missing <returns> documentation for "M:Rhino.RhinoApp.GetExecutableDirectory"]
See Also
Reference
RhinoApp Class
Rhino Namespace