RhinoCommon API
DisplayPipeline.DrawText Method (TextEntity, Color)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.TextEntity,System.Drawing.Color)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawText(
	TextEntity text,
	Color color
)
Public Sub DrawText (
	text As TextEntity,
	color As Color
)
Parameters
text
Type: Rhino.Geometry.TextEntity
[Missing <param name="text"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.TextEntity,System.Drawing.Color)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.TextEntity,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
DrawText Overload
Rhino.Display Namespace