RhinoCommon API
Transform.DecomposeRigid Method
 Decomposes a rigid transformation. The transformation must be affine.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public TransformRigidType DecomposeRigid(
	out Vector3d translation,
	out Transform rotation,
	double tolerance
)
Public Function DecomposeRigid (
	<OutAttribute> ByRef translation As Vector3d,
	<OutAttribute> ByRef rotation As Transform,
	tolerance As Double
) As TransformRigidType
Parameters
translation
Type: Rhino.Geometry.Vector3d
Translation vector.
rotation
Type: Rhino.Geometry.Transform
Proper rotation transformation, where R*Transpose(R)=I and det(R)=1.
tolerance
Type: System.Double
The evaluation tolerance.
Return Value
Type: TransformRigidType
The rigid type.
Remarks
 If X.DecomposeRigid(T, R) is 1, then X ~ Translation(T)*R. If X.DecomposeRigid(T, R) is -1, then X ~ Transform(-1) * Translation(T)*R. DecomposeRigid will find the closest rotation to the linear part of this transformation.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace