RhinoCommon API
DracoCompression.Finalize Method
 Finalizer for DracoCompression
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace