RhinoCommon API
NamedParametersEventArgs.Set Method (String, IEnumerable<String>)
 Set a list of strings as a value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Set(
	string name,
	IEnumerable<string> strings
)
Public Sub Set (
	name As String,
	strings As IEnumerable(Of String)
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{System.String})"]
strings
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="strings"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
NamedParametersEventArgs Class
Set Overload
Rhino.Runtime Namespace