RhinoCommon API
LicenseStateChangedEventArgs Constructor
 LicenseStateChangedEventArgs constructor
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public LicenseStateChangedEventArgs(
	bool callingRhinoCommonAllowed
)
Public Sub New (
	callingRhinoCommonAllowed As Boolean
)
Parameters
callingRhinoCommonAllowed
Type: System.Boolean
True when calling RhinoCommon will never raise Rhino.Runtime.NotLicesnedException; false otherwise.
See Also
Reference
LicenseStateChangedEventArgs Class
Rhino.Runtime Namespace