RhinoCommon API
GroupTable.GroupObjectCount Method
 Returns the number of objects that are members of a group.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int GroupObjectCount(
	int groupIndex
)
Public Function GroupObjectCount (
	groupIndex As Integer
) As Integer
Parameters
groupIndex
Type: System.Int32
The index of the group.
Return Value
Type: Int32
The number of objects that are members of the group.
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace