RhinoCommon API
ViewTable.EnableRedraw Method
 Enables or disables screen redrawing.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public void EnableRedraw(
	bool enable,
	bool redrawDocument,
	bool redrawLayers
)
Public Sub EnableRedraw (
	enable As Boolean,
	redrawDocument As Boolean,
	redrawLayers As Boolean
)
Parameters
enable
Type: System.Boolean
Enable redrawing.
redrawDocument
Type: System.Boolean
If enabling, set to true to have the document redrawn.
redrawLayers
Type: System.Boolean
If enabling, set to true to have the layer user interface redrawn.
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace