RhinoCommon API
Line.ToString Method
 Constructs the string representation of this line, in the form "From,To".
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A text string.
See Also
Reference
Line Structure
ToString Overload
Rhino.Geometry Namespace