RhinoCommon API
ArchivableDictionary.GetEnumValue<T> Method
 Get an enum value
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public T GetEnumValue<T>()
where T : struct, new(), IConvertible
Public Function GetEnumValue(Of T As {Structure, New, IConvertible}) As T
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetEnumValue``1"]
Return Value
Type: T
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetEnumValue``1"]
Exceptions
Exception | Condition
KeyNotFoundException | Thrown when the key is not found in the dictionary.
FormatException | Thrown when the string retrieved from the dictionary is not convertible to the enum type.
See Also
Reference
ArchivableDictionary Class
GetEnumValue Overload
Rhino.Collections Namespace