RhinoCommon API
SimpleArrayVector3d.ToArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Vector3d[] ToArray()
Public Function ToArray As Vector3d()
Return Value
Type: Vector3d[]
The managed array.
See Also
Reference
SimpleArrayVector3d Class
Rhino.Runtime.InteropWrappers Namespace