RhinoCommon API
FileStlWriteOptions Constructor
Initializes a new instance of the FileStlWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileStlWriteOptions()
Public Sub New
See Also
Reference
FileStlWriteOptions Class
Rhino.FileIO Namespace