RhinoCommon API
RhinoApp.Exit Method (Boolean)
 Exits, or forcefully closes Rhino. A prompt to allow saving will appear if necessary when forcefully exiting Works on Windows and MacOS true to allow the user to cancel exiting false to force exit
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void Exit(
	bool allowCancel
)
Public Shared Sub Exit (
	allowCancel As Boolean
)
Parameters
allowCancel
Type: System.Boolean
[Missing <param name="allowCancel"/> documentation for "M:Rhino.RhinoApp.Exit(System.Boolean)"]
See Also
Reference
RhinoApp Class
Exit Overload
Rhino Namespace