RhinoCommon API
RenderPrimitive.Mesh Method
 Returns the mesh associated with the object, this will mesh primitives and always return a mesh.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public Mesh Mesh()
Public Function Mesh As Mesh
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Render.RenderPrimitive.Mesh"]
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace