RhinoCommon API
SubDEdgeSharpness.FromConstantPercentage Method
 Creates a sharpness with the same value at both ends, from a percentage. This is useful in user interface code that expresses sharpness as a percentage.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static SubDEdgeSharpness FromConstantPercentage(
	double percentage
)
Public Shared Function FromConstantPercentage (
	percentage As Double
) As SubDEdgeSharpness
Parameters
percentage
Type: System.Double
 Between 0.0 and 100.0, or MaxValue for a crease.
Return Value
Type: SubDEdgeSharpness
 A sharpness with constant value (percentage * MaximumValue / 100.0), Crease if percentage is MaxValue, or Nan if percentage is out of range.
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace