RhinoCommon API
NamedViewTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IEnumerator<ViewInfo> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of ViewInfo)
Return Value
Type: IEnumerator<ViewInfo>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace