RhinoCommon API
BinaryArchiveWriter.WriteByte Method
 Writes a Byte value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteByte(
	byte value
)
Public Sub WriteByte (
	value As Byte
)
Parameters
value
Type: System.Byte
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace