RhinoCommon API
PreviewAppearance.SetSize Method
Note: This API is now obsolete.
 SetSize
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use Scale instead")]
public void SetSize(
	double d
)
<ObsoleteAttribute("Use Scale instead")>
Public Sub SetSize (
	d As Double
)
Parameters
d
Type: System.Double
[Missing <param name="d"/> documentation for "M:Rhino.Render.PreviewAppearance.SetSize(System.Double)"]
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace