RhinoCommon API
GumballDisplayConduit.Dispose Method
Releases all resources used by the GumballDisplayConduit
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
GumballDisplayConduit Class
Dispose Overload
Rhino.UI.Gumball Namespace