RhinoCommon API
Material.SetBitmapTexture Method (String, Bitmap)
 Uses the pixels of an in-memory bitmap as this material's bitmap texture, without writing an image file.
 The pixels are copied into TextureCache under name. Calling this again with the same name replaces them in place, and the change shows up on the next redraw.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SetBitmapTexture(
	string name,
	Bitmap bitmap
)
Public Function SetBitmapTexture (
	name As String,
	bitmap As Bitmap
) As Boolean
Parameters
name
Type: System.String
 The name to cache the pixels under. See Set(String, Bitmap).
bitmap
Type: System.Drawing.Bitmap
The pixels to use.
Return Value
Type: Boolean
true on success.
See Also
Reference
Material Class
SetBitmapTexture Overload
Rhino.DocObjects Namespace
Rhino.Display.TextureCache