RhinoCommon API
DisplayPipelineAttributes.HasDitherTransparencyEffect Method
 Returns TRUE if there is a dither transparency effect enabled with a transparency amount larger than 0.0, FALSE otherwise.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool HasDitherTransparencyEffect()
Public Function HasDitherTransparencyEffect As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipelineAttributes.HasDitherTransparencyEffect"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace