RhinoCommon API
RenderPrimitiveList.Add Method (Mesh, RenderMaterial, Transform)
 Add mesh and material.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public void Add(
	Mesh mesh,
	RenderMaterial material,
	Transform t
)
Public Sub Add (
	mesh As Mesh,
	material As RenderMaterial,
	t As Transform
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to add.
material
Type: Rhino.Render.RenderMaterial
Transformation of this mesh. Material to add, may be null if not needed.
t
Type: Rhino.Geometry.Transform
[Missing <param name="t"/> documentation for "M:Rhino.Render.RenderPrimitiveList.Add(Rhino.Geometry.Mesh,Rhino.Render.RenderMaterial,Rhino.Geometry.Transform)"]
See Also
Reference
RenderPrimitiveList Class
Add Overload
Rhino.Render Namespace