RhinoCommon API
Mesh.CreateFromTorus Method
 Constructs a mesh torus.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Mesh CreateFromTorus(
	Torus torus,
	int vertical,
	int around
)
Public Shared Function CreateFromTorus (
	torus As Torus,
	vertical As Integer,
	around As Integer
) As Mesh
Parameters
torus
Type: Rhino.Geometry.Torus
The torus.
vertical
Type: System.Int32
Number of faces in the top-to-bottom direction.
around
Type: System.Int32
Number of faces around the torus.
Return Value
Type: Mesh
Returns a mesh torus if successful, null otherwise.
Exceptions
Exception | Condition
ArgumentException | Thrown when torus is invalid.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace