RhinoCommon API
DisplayPipeline.DrawArrow Method (Line, Double, Color, Single)
 Draw a Grasshopper 2 style vector arrow. This method is relatively slow as it requires the construction of a DisplayPen and a PolylineCurve. However it is more accurate than other arrow drawing methods in that the tip of the drawn arrow is very close to the actual end of the line, the tip is always sharp, and the arrow head is resized to never be too small or large. Also note this method already takes into account logical pixel scaling.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void DrawArrow(
	Line line,
	double headSize,
	Color color,
	float shaftWidth
)
Public Sub DrawArrow (
	line As Line,
	headSize As Double,
	color As Color,
	shaftWidth As Single
)
Parameters
line
Type: Rhino.Geometry.Line
Vector shaft to draw.
headSize
Type: System.Double
Size of the head as a factor of arrow length. 0.1 would be a decent size.
color
Type: System.Drawing.Color
Color of arrow geometry.
shaftWidth
Type: System.Single
Width of arrow geometry. Note that the shaft is drawn using a method which only supports integer thicknesses and the arrow head is drawn thicker to counter the human perception of seeing angled lines thinner than they really are.
See Also
Reference
DisplayPipeline Class
DrawArrow Overload
Rhino.Display Namespace