RhinoCommon API
BinaryArchiveWriter.WriteDictionary Method
 Delivers the complete content of a dictionary to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteDictionary(
	ArchivableDictionary dictionary
)
Public Sub WriteDictionary (
	dictionary As ArchivableDictionary
)
Parameters
dictionary
Type: Rhino.Collections.ArchivableDictionary
A dictionary to archive.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace