RhinoCommon API
SectionStyleTable.Delete Method (IEnumerable<Int32>, Boolean)
 Delete multiple section styles.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Delete(
	IEnumerable<int> sectionStyleIndices,
	bool quiet
)
Public Function Delete (
	sectionStyleIndices As IEnumerable(Of Integer),
	quiet As Boolean
) As Integer
Parameters
sectionStyleIndices
Type: System.Collections.Generic.IEnumerable<Int32>
An enumeration of section style indices.
quiet
Type: System.Boolean
If true, no warning message box appears if a section style is in use.
Return Value
Type: Int32
The number of section styles that were deleted.
See Also
Reference
SectionStyleTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace