RhinoCommon API
ObjRef.Mesh Method
 Gets the mesh if the referenced geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Mesh Mesh()
Public Function Mesh As Mesh
Return Value
Type: Mesh
A mesh; or null if the referenced object is not a mesh, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace