RhinoCommon API
Transform2d.FromAffineElements Method (Single[])
 Creates a transform from an array of six coefficients in (a, b, c, d, tx, ty) order.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d FromAffineElements(
	float[] elements
)
Public Shared Function FromAffineElements (
	elements As Single()
) As Transform2d
Parameters
elements
Type: System.Single[]
Six coefficients. This is the layout of Eto.Drawing.IMatrix.Elements.
Return Value
Type: Transform2d
The equivalent transform, or Transform2d.Nan when elements is null or has fewer than six values.
See Also
Reference
Transform2d Structure
FromAffineElements Overload
Rhino.Geometry Namespace