RhinoCommon API
MeshingParameters.SetSubDDisplayParameters Method
 Sets the SubD display parameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public void SetSubDDisplayParameters(
	SubDDisplayParameters subDDisplayParameters
)
Public Sub SetSubDDisplayParameters (
	subDDisplayParameters As SubDDisplayParameters
)
Parameters
subDDisplayParameters
Type: Rhino.Geometry.SubDDisplayParameters
The SubD display parameters.
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace