RhinoCommon API
HermiteSurface.SetPointAt Method
 Sets the interpolation point at the u,v parameter location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SetPointAt(
	int uIndex,
	int vIndex,
	Point3d point
)
Public Sub SetPointAt (
	uIndex As Integer,
	vIndex As Integer,
	point As Point3d
)
Parameters
uIndex
Type: System.Int32
The "u" index.
vIndex
Type: System.Int32
The "v" index.
point
Type: Rhino.Geometry.Point3d
The point location.
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace