RhinoCommon API
Utilities.IsCachedTextureFileInUse Method
 Determines if any texture in any persistent content list is using the specified file name for caching.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool IsCachedTextureFileInUse(
	string textureFileName
)
Public Shared Function IsCachedTextureFileInUse (
	textureFileName As String
) As Boolean
Parameters
textureFileName
Type: System.String
The file name to check for. The extension is ignored.
Return Value
Type: Boolean
true if the texture is present.
See Also
Reference
Utilities Class
Rhino.Render Namespace