RhinoCommon API
TextLog.NewCommandLine Method
 Returns a reference to a TextLog that prints to the Rhino command line. Each new command line reference holds its own indents.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static TextLog NewCommandLine()
Public Shared Function NewCommandLine As TextLog
Return Value
Type: TextLog
[Missing <returns> documentation for "M:Rhino.FileIO.TextLog.NewCommandLine"]
Remarks
All Print methods of this instance are guaranteed to be thread safe. Other methods are not guaranteed to be thread safe.
See Also
Reference
TextLog Class
Rhino.FileIO Namespace