RhinoCommon API
Markup Constructor
Create a new instance of a Markup
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Markup()
Public Sub New
See Also
Reference
Markup Class
Markup Overload
Rhino.DocObjects Namespace