RhinoCommon API
SubDToBrepOptions Constructor
 Create default options
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDToBrepOptions()
Public Sub New
See Also
Reference
SubDToBrepOptions Class
SubDToBrepOptions Overload
Rhino.Geometry Namespace