RhinoCommon API
Intersection.CurveCurveValidate Method
 Finds the intersections between two curves.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static CurveIntersections CurveCurveValidate(
	Curve curveA,
	Curve curveB,
	double tolerance,
	double overlapTolerance,
	out int[] invalidIndices,
	out TextLog textLog
)
Public Shared Function CurveCurveValidate (
	curveA As Curve,
	curveB As Curve,
	tolerance As Double,
	overlapTolerance As Double,
	<OutAttribute> ByRef invalidIndices As Integer(),
	<OutAttribute> ByRef textLog As TextLog
) As CurveIntersections
Parameters
curveA
Type: Rhino.Geometry.Curve
First curve for intersection.
curveB
Type: Rhino.Geometry.Curve
Second curve for intersection.
tolerance
Type: System.Double
Intersection tolerance. If the curves approach each other to within tolerance, an intersection is assumed.
overlapTolerance
Type: System.Double
The tolerance with which the curves are tested.
invalidIndices
Type: System.Int32[]
The indices in the resulting CurveIntersections collection that are invalid.
textLog
Type: Rhino.FileIO.TextLog
A text log that contains tails about the invalid intersection events.
Return Value
Type: CurveIntersections
A collection of intersection events.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace