RhinoCommon API
File3dmEmbeddedFiles.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.FileIO.File3dmEmbeddedFiles.GetEnumerator"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IEnumerator<File3dmEmbeddedFile> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of File3dmEmbeddedFile)
Return Value
Type: IEnumerator<File3dmEmbeddedFile>
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmEmbeddedFiles.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
File3dmEmbeddedFiles Class
Rhino.FileIO Namespace