RhinoCommon API
NurbsCurve.MatchToCurve Method
 Constructs a NURBS curve with the start and end matching the start and end of targetCurve, and Greville points on targetCurve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public NurbsCurve MatchToCurve(
	Curve targetCurve,
	double maxEndDistance,
	double maxInteriorDistance,
	double matchTolerance,
	int maxLevel
)
Public Function MatchToCurve (
	targetCurve As Curve,
	maxEndDistance As Double,
	maxInteriorDistance As Double,
	matchTolerance As Double,
	maxLevel As Integer
) As NurbsCurve
Parameters
targetCurve
Type: Rhino.Geometry.Curve
The target curve.
maxEndDistance
Type: System.Double
 If maxEndDistance dist > 0, the curve's start must be within maxEndDistance of targetCurve start. If maxEndDistance dist > 0, the curve's end must be within maxEndDistance of targetCurve end.
maxInteriorDistance
Type: System.Double
 If maxInteriorDistance > 0, all interior Greville points of the curve must be within maxInteriorDistance of targetCurve.
matchTolerance
Type: System.Double
The matching tolerance.
maxLevel
Type: System.Int32
 If maxLevel > 0, the result will be refined up to that many times, attempting to get the result within matchTolerance. If matchTolerance <= 0, no refinement will be done. In any case, the parameters closest points on targetCurve of the Greville points of the curve must be monotonic increasing.
Return Value
Type: NurbsCurve
Curve on success, null on failure.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace