RhinoCommon API
NurbsCurvePointList.SetWeight Method
 Sets the weight of a control point at the given index Note, if the curve is non-rational, it will be converted to rational.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SetWeight(
	int index,
	double weight
)
Public Function SetWeight (
	index As Integer,
	weight As Double
) As Boolean
Parameters
index
Type: System.Int32
Index of control point to set.
weight
Type: System.Double
The control point weight.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace