RhinoCommon API
IStackedDialogPageService.GetImageHandle Method (Image, Boolean)
 Convert image to platform specific unmanaged pointer
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
IntPtr GetImageHandle(
	Image image,
	bool canBeNull
)
Function GetImageHandle (
	image As Image,
	canBeNull As Boolean
) As IntPtr
Parameters
image
Type: System.Drawing.Image
[Missing <param name="image"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetImageHandle(System.Drawing.Image,System.Boolean)"]
canBeNull
Type: System.Boolean
[Missing <param name="canBeNull"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetImageHandle(System.Drawing.Image,System.Boolean)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.GetImageHandle(System.Drawing.Image,System.Boolean)"]
See Also
Reference
IStackedDialogPageService Interface
GetImageHandle Overload
Rhino.UI Namespace