RhinoCommon API
NeverRepeatList.CommandNames Method
The list of commands to not repeat.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string[] CommandNames()
Public Shared Function CommandNames As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.NeverRepeatList.CommandNames"]
See Also
Reference
NeverRepeatList Class
Rhino.ApplicationSettings Namespace