RhinoCommon API
Point3d.DistanceToSquared Method
 Computes the square of the distance between two points.
This method is usually largely faster than DistanceTo().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double DistanceToSquared(
	Point3d other
)
Public Function DistanceToSquared (
	other As Point3d
) As Double
Parameters
other
Type: Rhino.Geometry.Point3d
Other point for squared distance measurement.
Return Value
Type: Double
The squared length of the line between this and the other point; or 0 if any of the points is not valid.
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace