RhinoCommon API
StackedDialogPage.OnCreateParent Method
 Called when the parent window has been created on Windows platforms only.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual void OnCreateParent(
	IntPtr hwndParent
)
Public Overridable Sub OnCreateParent (
	hwndParent As IntPtr
)
Parameters
hwndParent
Type: System.IntPtr
[Missing <param name="hwndParent"/> documentation for "M:Rhino.UI.StackedDialogPage.OnCreateParent(System.IntPtr)"]
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace