RhinoCommon API
NamedParametersEventArgs.Set Method (String, Arc)
 Set an arc for the specified key
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void Set(
	string name,
	Arc value
)
Public Sub Set (
	name As String,
	value As Arc
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.Arc)"]
value
Type: Rhino.Geometry.Arc
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.Arc)"]
See Also
Reference
NamedParametersEventArgs Class
Set Overload
Rhino.Runtime Namespace