RhinoCommon API
OptionString.Dispose Method
Releases all resources used by the OptionString
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
OptionString Class
Dispose Overload
Rhino.Input.Custom Namespace