RhinoCommon API
RealtimeDisplayMode.HudRendererLocked Method
 Implement to support locking in the viewport
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool HudRendererLocked()
Public Overridable Function HudRendererLocked As Boolean
Return Value
Type: Boolean
Return true if the render engine is locked.
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace