RhinoCommon API
Brep.RemoveFins Method
 Recursively removes any Brep face with a naked edge. This function is only useful for non-manifold Breps.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool RemoveFins()
Public Function RemoveFins As Boolean
Return Value
Type: Boolean
true if successful, false if everything is removed or if the result has any Brep edges with more than two Brep trims.
See Also
Reference
Brep Class
Rhino.Geometry Namespace