RhinoCommon API
PersistentSettings.TryGetUnsignedInteger Method (String, UInt32, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetUnsignedInteger(System.String,System.UInt32@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetUnsignedInteger(
	string key,
	out uint value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetUnsignedInteger (
	key As String,
	<OutAttribute> ByRef value As UInteger,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetUnsignedInteger(System.String,System.UInt32@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: System.UInt32
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetUnsignedInteger(System.String,System.UInt32@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetUnsignedInteger(System.String,System.UInt32@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetUnsignedInteger(System.String,System.UInt32@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetUnsignedInteger Overload
Rhino Namespace