RhinoCommon API
SimulatedTexture Constructor (RhinoDoc, Texture)
Initializes a new instance of the SimulatedTexture class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public SimulatedTexture(
	RhinoDoc doc,
	Texture texture
)
Public Sub New (
	doc As RhinoDoc,
	texture As Texture
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.SimulatedTexture.#ctor(Rhino.RhinoDoc,Rhino.DocObjects.Texture)"]
texture
Type: Rhino.DocObjects.Texture
[Missing <param name="texture"/> documentation for "M:Rhino.Render.SimulatedTexture.#ctor(Rhino.RhinoDoc,Rhino.DocObjects.Texture)"]
See Also
Reference
SimulatedTexture Class
SimulatedTexture Overload
Rhino.Render Namespace