RhinoCommon API
Brep.Duplicate Method
 Copies this brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override GeometryBase Duplicate()
Public Overrides Function Duplicate As GeometryBase
Return Value
Type: GeometryBase
A brep.
See Also
Reference
Brep Class
Rhino.Geometry Namespace