RhinoCommon API
WorksessionFile.AddModel Method
Adds a copy of a model to the end of the list.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void AddModel(
	WorksessionFileModel model
)
Public Sub AddModel (
	model As WorksessionFileModel
)
Parameters
model
Type: Rhino.FileIO.WorksessionFileModel
The model to copy.
Exceptions
Exception | Condition
ArgumentNullException | If model is null.
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace