RhinoCommon API
RenderTexture.SetPreviewIn3D Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.SetPreviewIn3D(System.Boolean,Rhino.Render.RenderContent.ChangeContexts)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual void SetPreviewIn3D(
	bool value,
	RenderContent.ChangeContexts changeContext
)
Public Overridable Sub SetPreviewIn3D (
	value As Boolean,
	changeContext As RenderContent.ChangeContexts
)
Parameters
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.Render.RenderTexture.SetPreviewIn3D(System.Boolean,Rhino.Render.RenderContent.ChangeContexts)"]
changeContext
Type: Rhino.Render.RenderContent.ChangeContexts
[Missing <param name="changeContext"/> documentation for "M:Rhino.Render.RenderTexture.SetPreviewIn3D(System.Boolean,Rhino.Render.RenderContent.ChangeContexts)"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace