RhinoCommon API
RhinoGet.StringToCommandOptionName Method (String, String)
 Convert some arbitrary string value to a valid command option name removing any invalid characters.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static LocalizeStringPair StringToCommandOptionName(
	string englishString,
	string localizedString
)
Public Shared Function StringToCommandOptionName (
	englishString As String,
	localizedString As String
) As LocalizeStringPair
Parameters
englishString
Type: System.String
 English string to convert.
localizedString
Type: System.String
 Optional localized string to convert.
Return Value
Type: LocalizeStringPair
 Returns null if the strings are null or empty or if they contain nothing but invalid characters. If the converted string is one or more characters in length then a LocalizeStringPair is returned characters the converted string values. If the localized string is null or empty then the English string is used as the localized value.
See Also
Reference
RhinoGet Class
StringToCommandOptionName Overload
Rhino.Input Namespace