RhinoCommon API
UserInterfaceGrid.Child Method
 Control in a cell, or null for an empty cell or an out of range index.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceControl Child(
	int index
)
Public Function Child (
	index As Integer
) As UserInterfaceControl
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.UserInterfaceGrid.Child(System.Int32)"]
Return Value
Type: UserInterfaceControl
[Missing <returns> documentation for "M:Rhino.UI.UserInterfaceGrid.Child(System.Int32)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace