RhinoCommon API
PostEffect.EndChange Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffect.EndChange"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool EndChange()
Public Function EndChange As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffect.EndChange"]
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace