RhinoCommon API
ZBufferCapture.ShowIsocurves Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowIsocurves(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public void ShowIsocurves(
	bool on
)
Public Sub ShowIsocurves (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowIsocurves(System.Boolean)"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace