RhinoCommon API
SweepOneRail.SetToRoadlikeRight Method
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.SetToRoadlikeRight"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetToRoadlikeRight()
Public Sub SetToRoadlikeRight
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace