RhinoCommon API
AppearanceSettings.GetPaintColor Method (PaintColor)
 Gets the color that is currently associated with a paint color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color GetPaintColor(
	PaintColor whichColor
)
Public Shared Function GetPaintColor (
	whichColor As PaintColor
) As Color
Parameters
whichColor
Type: Rhino.ApplicationSettings.PaintColor
A color association.
Return Value
Type: Color
A .Net library color.
See Also
Reference
AppearanceSettings Class
GetPaintColor Overload
Rhino.ApplicationSettings Namespace