RhinoCommon API
SubDEdgeChain.IsConvexLoop Method
 True when the chain is a closed loop that is convex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool IsConvexLoop(
	bool strictlyConvex
)
Public Function IsConvexLoop (
	strictlyConvex As Boolean
) As Boolean
Parameters
strictlyConvex
Type: System.Boolean
 If true, a loop with three or more colinear points in a row is not convex.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgeChain.IsConvexLoop(System.Boolean)"]
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace