RhinoCommon API
DisplayPen.TaperAsArray Method
 Collection of positions and thicknesses at those positions to define a taper Rhino currently only supports either no taper or a single taper. An array is used here in case Rhino supports multiple taper values in the future.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Point2f[] TaperAsArray()
Public Function TaperAsArray As Point2f()
Return Value
Type: Point2f[]
[Missing <returns> documentation for "M:Rhino.Display.DisplayPen.TaperAsArray"]
See Also
Reference
DisplayPen Class
Rhino.Display Namespace