RhinoCommon API
RhinoApp.WriteLine Method (String, Object, Object)
Print formatted text with a newline in the command window.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void WriteLine(
	string format,
	Object arg0,
	Object arg1
)
Public Shared Sub WriteLine (
	format As String,
	arg0 As Object,
	arg1 As Object
)
Parameters
format
Type: System.String
[Missing <param name="format"/> documentation for "M:Rhino.RhinoApp.WriteLine(System.String,System.Object,System.Object)"]
arg0
Type: System.Object
[Missing <param name="arg0"/> documentation for "M:Rhino.RhinoApp.WriteLine(System.String,System.Object,System.Object)"]
arg1
Type: System.Object
[Missing <param name="arg1"/> documentation for "M:Rhino.RhinoApp.WriteLine(System.String,System.Object,System.Object)"]
See Also
Reference
RhinoApp Class
WriteLine Overload
Rhino Namespace