RhinoCommon API
RenderContent.ParamNameFromChildSlotName Method
 A "child slot" is the specific "slot" that a child (usually a texture) occupies. This is generally the "use" of the child - in other words, the thing the child operates on. Some examples are "color", "transparency".
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public string ParamNameFromChildSlotName(
	string childSlotName
)
Public Function ParamNameFromChildSlotName (
	childSlotName As String
) As String
Parameters
childSlotName
Type: System.String
The named of the child slot to receive the parameter name for.
Return Value
Type: String
The default behavior for these functions is to return the input string. Sub-classes may (in the future) override these functions to provide different mappings.
See Also
Reference
RenderContent Class
Rhino.Render Namespace