RhinoCommon API
ClassArrayObjRef Constructor (IntPtr, Boolean)
 Construct from a pointer
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public ClassArrayObjRef(
	IntPtr ptr,
	bool deleteOnDispose = true
)
Public Sub New (
	ptr As IntPtr,
	Optional deleteOnDispose As Boolean = true
)
Parameters
ptr
Type: System.IntPtr
[Missing <param name="ptr"/> documentation for "M:Rhino.Runtime.InteropWrappers.ClassArrayObjRef.#ctor(System.IntPtr,System.Boolean)"]
deleteOnDispose (Optional)
Type: System.Boolean
[Missing <param name="deleteOnDispose"/> documentation for "M:Rhino.Runtime.InteropWrappers.ClassArrayObjRef.#ctor(System.IntPtr,System.Boolean)"]
See Also
Reference
ClassArrayObjRef Class
ClassArrayObjRef Overload
Rhino.Runtime.InteropWrappers Namespace