RhinoCommon API
SubDEdgeSharpness.Sanitize Method (Double)
 Verifies that sharpness is between 0.0 and MaximumValue, and snaps it to an integer when it is within Tolerance of one.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static double Sanitize(
	double sharpness
)
Public Shared Function Sanitize (
	sharpness As Double
) As Double
Parameters
sharpness
Type: System.Double
The value to sanitize.
Return Value
Type: Double
A usable sharpness value, or 0.0 if sharpness is not valid.
See Also
Reference
SubDEdgeSharpness Structure
Sanitize Overload
Rhino.Geometry Namespace