RhinoCommon API
ShrinkWrapParameters Constructor
Initializes a new instance of the ShrinkWrapParameters class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ShrinkWrapParameters()
Public Sub New
See Also
Reference
ShrinkWrapParameters Class
Rhino.Geometry Namespace