RhinoCommon API
PhysicallyBased.FromTextureType Method
[Missing <summary> documentation for "M:Rhino.Render.ChildSlotNames.PhysicallyBased.FromTextureType(Rhino.DocObjects.TextureType)"]
 Namespace: Rhino.Render.ChildSlotNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string FromTextureType(
	TextureType textureType
)
Public Shared Function FromTextureType (
	textureType As TextureType
) As String
Parameters
textureType
Type: Rhino.DocObjects.TextureType
[Missing <param name="textureType"/> documentation for "M:Rhino.Render.ChildSlotNames.PhysicallyBased.FromTextureType(Rhino.DocObjects.TextureType)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.ChildSlotNames.PhysicallyBased.FromTextureType(Rhino.DocObjects.TextureType)"]
See Also
Reference
PhysicallyBased Class
Rhino.Render.ChildSlotNames Namespace