RhinoCommon API
GetArc.Get Method
 Perform the 'get' operation.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Result Get(
	out Arc arc
)
Public Function Get (
	<OutAttribute> ByRef arc As Arc
) As Result
Parameters
arc
Type: Rhino.Geometry.Arc
[Missing <param name="arc"/> documentation for "M:Rhino.Input.Custom.GetArc.Get(Rhino.Geometry.Arc@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetArc.Get(Rhino.Geometry.Arc@)"]
See Also
Reference
GetArc Class
Rhino.Input.Custom Namespace