RhinoCommon API
Transform.ChangeBasis Method (Point3d, Vector3d, Vector3d, Vector3d, Point3d, Vector3d, Vector3d, Vector3d)
 Gets a change of basis transformation. The change of basis transformation is not the same as the rotation transformation that rotates one orthonormal frame to another.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.17
Syntax
public static Transform ChangeBasis(
	Point3d P0,
	Vector3d X0,
	Vector3d Y0,
	Vector3d Z0,
	Point3d P1,
	Vector3d X1,
	Vector3d Y1,
	Vector3d Z1
)
Public Shared Function ChangeBasis (
	P0 As Point3d,
	X0 As Vector3d,
	Y0 As Vector3d,
	Z0 As Vector3d,
	P1 As Point3d,
	X1 As Vector3d,
	Y1 As Vector3d,
	Z1 As Vector3d
) As Transform
Parameters
P0
Type: Rhino.Geometry.Point3d
Initial center.
X0
Type: Rhino.Geometry.Vector3d
Initial basis X (can be any 3d basis).
Y0
Type: Rhino.Geometry.Vector3d
Initial basis Y (can be any 3d basis).
Z0
Type: Rhino.Geometry.Vector3d
Initial basis Z (can be any 3d basis).
P1
Type: Rhino.Geometry.Point3d
Final center.
X1
Type: Rhino.Geometry.Vector3d
Final basis X (can be any 3d basis).
Y1
Type: Rhino.Geometry.Vector3d
Final basis Y (can be any 3d basis).
Z1
Type: Rhino.Geometry.Vector3d
Final basis Z (can be any 3d basis).
Return Value
Type: Transform
 A change of basis transformation if success, on failure.
Remarks
 Change of basis transformations and rotation transformations are often confused. This is a change of basis transformation. If Q = P0 + a0*X0 + b0*Y0 + c0*Z0 = P1 + a1*X1 + b1*Y1 + c1*Z1, then this transform will map the point (a0,b0,c0) to (a1,b1,c1).
See Also
Reference
Transform Structure
ChangeBasis Overload
Rhino.Geometry Namespace
Transform.Unset