RhinoCommon API
RhinoCore.DoIdle Method
 Processes all Rhino Idle tasks.
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool DoIdle()
Public Function DoIdle As Boolean
Return Value
Type: Boolean
True if Idle tasks are still pending.
See Also
Reference
RhinoCore Class
Rhino.Runtime.InProcess Namespace