RhinoCommon API
SubDFaceList.Add Method
 Adds a face bounded by the given edges.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDFace Add(
	IEnumerable<SubDEdge> edges
)
Public Function Add (
	edges As IEnumerable(Of SubDEdge)
) As SubDFace
Parameters
edges
Type: System.Collections.Generic.IEnumerable<SubDEdge>
 The edges of the new face, in order around its boundary. There must be at least three. Each edge is traversed according to its ComponentDirection, so consecutive edges have to meet: the end vertex of one is the start vertex of the next. Set ComponentDirection on the edges before calling this to orient the loop.
Return Value
Type: SubDFace
The new face, or null if the edges do not form a usable boundary.
See Also
Reference
SubDFaceList Class
Rhino.Geometry.Collections Namespace