RhinoCommon API
CustomGripObject Constructor
Initializes a new instance of the CustomGripObject class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public CustomGripObject()
Public Sub New
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace