RhinoCommon API
ChangeQueue.MaterialFromId Method
 Get the RenderMaterial from the ChangeQueue material cache based on RenderHash
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderMaterial MaterialFromId(
	uint crc
)
Public Function MaterialFromId (
	crc As UInteger
) As RenderMaterial
Parameters
crc
Type: System.UInt32
The RenderHash
Return Value
Type: RenderMaterial
RenderMaterial
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace