RhinoCommon API
IRhRdkThumbnailList.Mode Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Mode"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
IRhRdkThumbnailList_Modes Mode()
Function Mode As IRhRdkThumbnailList_Modes
Return Value
Type: IRhRdkThumbnailList_Modes
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Mode"]
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace