RhinoCommon API
Mesh.Offset Method (Double, Boolean, Vector3d, List<Int32>)
 Makes a new mesh with vertices offset a distance along the direction parameter. Optionally, based on the value of solidify, adds the input mesh and a ribbon of faces along any naked edges. If solidify is false it acts exactly as the Offset(distance) function. Returns list of wall faces, i.e. the faces that connect original and offset mesh when solidified.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh Offset(
	double distance,
	bool solidify,
	Vector3d direction,
	out List<int> wallFacesOut
)
Public Function Offset (
	distance As Double,
	solidify As Boolean,
	direction As Vector3d,
	<OutAttribute> ByRef wallFacesOut As List(Of Integer)
) As Mesh
Parameters
distance
Type: System.Double
A distance value.
solidify
Type: System.Boolean
true if the mesh should be solidified.
direction
Type: Rhino.Geometry.Vector3d
Direction of offset for all vertices.
wallFacesOut
Type: System.Collections.Generic.List<Int32>
Returns list of wall faces.
Return Value
Type: Mesh
A new mesh on success, or null on failure.
See Also
Reference
Mesh Class
Offset Overload
Rhino.Geometry Namespace