RhinoCommon API
ObjRef.SubDFace Method
 Gets the SubDFace if the referenced geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDFace SubDFace()
Public Function SubDFace As SubDFace
Return Value
Type: SubDFace
A SubDFace; or null if the referenced object is not a SubDFace, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace