RhinoCommon API
File3dmPlugInDataTable.TryRead Method
 Attempts to read a Rhino plug-in's custom data from the File3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryRead(
	File3dmPlugInData pluginData,
	Func<File3dm, BinaryArchiveReader, bool> dataReader
)
Public Function TryRead (
	pluginData As File3dmPlugInData,
	dataReader As Func(Of File3dm, BinaryArchiveReader, Boolean)
) As Boolean
Parameters
pluginData
Type: Rhino.FileIO.File3dmPlugInData
The plug-in whose data you want to try to read.
dataReader
Type: System.Func<File3dm, BinaryArchiveReader, Boolean>
 The function that will read the data. This function must be implemented identical to the originating plug-in's ReadDocument(RhinoDoc, BinaryArchiveReader, FileReadOptions) method.
Return Value
Type: Boolean
The value returned by the data reading function if successful, false otherwise.
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace