RhinoCommon API
ManifestTable.FindName<T> Method (String, Guid)
 Uses the name to find a model component. The name is the value that is stored in the .Name property. Deleted objects have no name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public T FindName<T>(
	string name,
	Guid parent
)
where T : ModelComponent
Public Function FindName(Of T As ModelComponent) (
	name As String,
	parent As Guid
) As T
Parameters
name
Type: System.String
Name of model component to search for.
parent
Type: System.Guid
Parent object id. This is only required for layers.
Type Parameters
T
The type, derived from ModelComponent. Cannot be ModelComponent itself.
Return Value
Type: T
Reference to the rhino object or null if no such object could be found.
See Also
Reference
ManifestTable Class
FindName Overload
Rhino.FileIO Namespace