RhinoCommon API
Mesh.CreateFromCurveExtrusion Method
 Constructs a mesh from an extruded curve. This method is designed for projecting curves onto a mesh. In most cases, a better to use CreateExtrusion(Curve, Vector3d).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Mesh CreateFromCurveExtrusion(
	Curve curve,
	Vector3d direction,
	MeshingParameters parameters,
	BoundingBox boundingBox
)
Public Shared Function CreateFromCurveExtrusion (
	curve As Curve,
	direction As Vector3d,
	parameters As MeshingParameters,
	boundingBox As BoundingBox
) As Mesh
Parameters
curve
Type: Rhino.Geometry.Curve
A curve to extrude.
direction
Type: Rhino.Geometry.Vector3d
The direction of extrusion.
parameters
Type: Rhino.Geometry.MeshingParameters
The parameters of meshing.
boundingBox
Type: Rhino.Geometry.BoundingBox
The bounding box controls the length of the extrusion.
Return Value
Type: Mesh
A new mesh, or null on failure.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace