RhinoCommon API
NamedParametersEventArgs.Set Method (String, Point3d)
 Set a Point3d value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Set(
	string name,
	Point3d value
)
Public Sub Set (
	name As String,
	value As Point3d
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.Point3d)"]
value
Type: Rhino.Geometry.Point3d
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.Point3d)"]
See Also
Reference
NamedParametersEventArgs Class
Set Overload
Rhino.Runtime Namespace