RhinoCommon API
Transform.Multiply Method
 Multiplies (combines) two transformations.
This is the same as the * operator between two transformations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Transform Multiply(
	Transform a,
	Transform b
)
Public Shared Function Multiply (
	a As Transform,
	b As Transform
) As Transform
Parameters
a
Type: Rhino.Geometry.Transform
First transformation.
b
Type: Rhino.Geometry.Transform
Second transformation.
Return Value
Type: Transform
A transformation matrix that combines the effect of both input transformations. The resulting Transform gives the same result as though you'd first apply B then A.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace