RhinoCommon API
AnnotationBase.FormatRtfString Method
 Modifies the formatting of an RTF (Rich Text Format) string by setting or clearing bold, italic, underline, and font face properties on the first character run.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string FormatRtfString(
	string rtf_in,
	bool clear_bold,
	bool set_bold,
	bool clear_italic,
	bool set_italic,
	bool clear_underline,
	bool set_underline,
	bool clear_facename,
	bool set_facename,
	string facename
)
Public Shared Function FormatRtfString (
	rtf_in As String,
	clear_bold As Boolean,
	set_bold As Boolean,
	clear_italic As Boolean,
	set_italic As Boolean,
	clear_underline As Boolean,
	set_underline As Boolean,
	clear_facename As Boolean,
	set_facename As Boolean,
	facename As String
) As String
Parameters
rtf_in
Type: System.String
The input RTF string to modify.
clear_bold
Type: System.Boolean
If true, clears the bold formatting.
set_bold
Type: System.Boolean
If true, sets the bold formatting.
clear_italic
Type: System.Boolean
If true, clears the italic formatting.
set_italic
Type: System.Boolean
If true, sets the italic formatting.
clear_underline
Type: System.Boolean
If true, clears the underline formatting.
set_underline
Type: System.Boolean
If true, sets the underline formatting.
clear_facename
Type: System.Boolean
If true, clears the font face name.
set_facename
Type: System.Boolean
If true, sets the font face name.
facename
Type: System.String
The font face name to set if set_facename is true.
Return Value
Type: String
The modified RTF string with the requested formatting changes applied.
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace