RhinoCommon API
File3dmDisplacement.SubItemWhitePoint Method
 Gets the override for displacement 'white-point'. face_index is the index of the face on the polysurface/SubD.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double SubItemWhitePoint(
	int face_index
)
Public Function SubItemWhitePoint (
	face_index As Integer
) As Double
Parameters
face_index
Type: System.Int32
[Missing <param name="face_index"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.SubItemWhitePoint(System.Int32)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmDisplacement.SubItemWhitePoint(System.Int32)"]
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace