RhinoCommon API
LayerTable.CreateLayer Method
 Basic tool used by the add layer methods.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public int CreateLayer(
	Layer newLayer,
	LayerTable.LayerType layerType,
	uint worksessionReferenceModelSerialNumber,
	uint linkedInstanceDefinitionSerialNumber
)
Public Function CreateLayer (
	newLayer As Layer,
	layerType As LayerTable.LayerType,
	worksessionReferenceModelSerialNumber As UInteger,
	linkedInstanceDefinitionSerialNumber As UInteger
) As Integer
Parameters
newLayer
Type: Rhino.DocObjects.Layer
 Settings for new layer. These are copied to the layer table entry and any user data on layer is moved to the layer table entry.
layerType
Type: Rhino.DocObjects.Tables.LayerTable.LayerType
Type type of layer to create.
worksessionReferenceModelSerialNumber
Type: System.UInt32
 Worksession reference model serial number, where: 0: Layer is not a reference layer. 1: Layer is a reference layer but not part of a worksession reference file. 2-1000: Reserved for future use. >1000: Worksession reference model serial number.
linkedInstanceDefinitionSerialNumber
Type: System.UInt32
 Linked instance definition serial number, where: 0: Layer is not from a liked instance definition. 1-1000: Reserved for future use. >1000: Linked instance definition serial number.
Return Value
Type: Int32
The index of the last layer created if successful, UnsetIntIndex on failure.
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace