RhinoCommon API
Layer.GetChildren Method (Boolean)
 Gets the children of this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Layer[] GetChildren(
	bool allChildren
)
Public Function GetChildren (
	allChildren As Boolean
) As Layer()
Parameters
allChildren
Type: System.Boolean
 If false, the immediate children are returned. If true, immediate children, their children, and so on, are returned.
Return Value
Type: Layer[]
Array of child layers, sorted by layer index, or null if this layer does not have any children.
See Also
Reference
Layer Class
GetChildren Overload
Rhino.DocObjects Namespace