RhinoCommon API
RealtimeDisplayMode.CreateWorld Method
 Implement if you need to handle the initial CreateWorld call initiated by the display pipeline system. Note that this is not the same as the CreateWorld call in Rhino.Render.ChangeQueue.ChangeQueue, although related.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual void CreateWorld(
	RhinoDoc doc,
	ViewInfo viewInfo,
	DisplayPipelineAttributes displayPipelineAttributes
)
Public Overridable Sub CreateWorld (
	doc As RhinoDoc,
	viewInfo As ViewInfo,
	displayPipelineAttributes As DisplayPipelineAttributes
)
Parameters
doc
Type: Rhino.RhinoDoc
Rhino document
viewInfo
Type: Rhino.DocObjects.ViewInfo
active viewport info
displayPipelineAttributes
Type: Rhino.Display.DisplayPipelineAttributes
display pipeline attributes
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace