RhinoCommon API
DisplayPipeline.DrawSubDShaded Method
 Draw a shaded mesh representation of a SubD
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void DrawSubDShaded(
	SubD subd,
	DisplayMaterial material
)
Public Sub DrawSubDShaded (
	subd As SubD,
	material As DisplayMaterial
)
Parameters
subd
Type: Rhino.Geometry.SubD
SubD to draw
material
Type: Rhino.Display.DisplayMaterial
Material to draw faces with
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace