RhinoCommon API
GetTruncatedCone.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
GetTruncatedCone Class
Dispose Overload
Rhino.Input.Custom Namespace