RhinoCommon API
RhinoView.MouseCaptured Method
 Returns whether or not the mouse is captured in this view.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool MouseCaptured(
	bool bIncludeMovement
)
Public Function MouseCaptured (
	bIncludeMovement As Boolean
) As Boolean
Parameters
bIncludeMovement
Type: System.Boolean
If captured, test if the mouse has moved between mouse button down and mouse button up.
Return Value
Type: Boolean
true if captured, false otherwise.
See Also
Reference
RhinoView Class
Rhino.Display Namespace