RhinoCommon API
GetTorus.Get Method
 Prompt for the getting of a torus.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Result Get(
	out Torus torus
)
Public Function Get (
	<OutAttribute> ByRef torus As Torus
) As Result
Parameters
torus
Type: Rhino.Geometry.Torus
The torus geometry defined by the user.
Return Value
Type: Result
The result of the getting operation.
See Also
Reference
GetTorus Class
Rhino.Input.Custom Namespace