RhinoCommon API
TextFields.ModelUnits Method
[Missing <summary> documentation for "M:Rhino.Runtime.TextFields.ModelUnits"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string ModelUnits()
Public Shared Function ModelUnits As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.ModelUnits"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace