RhinoCommon API
SimpleArrayExtrusionPointer.ToNonConstArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Extrusion[] ToNonConstArray()
Public Function ToNonConstArray As Extrusion()
Return Value
Type: Extrusion[]
The managed array.
See Also
Reference
SimpleArrayExtrusionPointer Class
Rhino.Runtime.InteropWrappers Namespace