RhinoCommon API
MeshTopologyVertexList.ConnectedEdges Method
 Gets all edges that are connected to a given vertex.
Call TopologyVertices.SortVertices before this if you are interested in ordered edges.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int[] ConnectedEdges(
	int topologyVertexIndex
)
Public Function ConnectedEdges (
	topologyVertexIndex As Integer
) As Integer()
Parameters
topologyVertexIndex
Type: System.Int32
Index of a topology vertex in Mesh.TopologyVertices.
Return Value
Type: Int32[]
 Indices of all edges around vertex that are connected to this topological vertex. null if no faces are connected to this vertex.
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace