RhinoCommon API
Layer.PerViewportColor Method
 Gets the display color for this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Color PerViewportColor(
	Guid viewportId
)
Public Function PerViewportColor (
	viewportId As Guid
) As Color
Parameters
viewportId
Type: System.Guid
If not Guid.Empty, then the setting applies only to the viewport with the specified id.
Return Value
Type: Color
The display color.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace