RhinoCommon API
Analytics Constructor (String, String)
Construct Analytics class
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Analytics(
	string TrackingID,
	string Name
)
Public Sub New (
	TrackingID As String,
	Name As String
)
Parameters
TrackingID
Type: System.String
Google Analytics Tracking ID
Name
Type: System.String
 Name of Application (for example, "Ocelot") Do not include version numbers. Maps to Google Analytics parameter 'an'
See Also
Reference
Analytics Class
Analytics Overload
Rhino.Runtime Namespace