RhinoCommon API
ICollapsibleSection2.ShowHeaderButton Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ICollapsibleSection2.ShowHeaderButton(System.Int32,System.Boolean)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
bool ShowHeaderButton(
	int index,
	bool bShow
)
Function ShowHeaderButton (
	index As Integer,
	bShow As Boolean
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSection2.ShowHeaderButton(System.Int32,System.Boolean)"]
bShow
Type: System.Boolean
[Missing <param name="bShow"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSection2.ShowHeaderButton(System.Int32,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.ICollapsibleSection2.ShowHeaderButton(System.Int32,System.Boolean)"]
See Also
Reference
ICollapsibleSection2 Interface
Rhino.UI.Controls Namespace