RhinoCommon API
IRhinoUiDialogService.ShowPrintWidths Method (String, String)
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPrintWidths(System.String,System.String)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
double ShowPrintWidths(
	string title,
	string message
)
Function ShowPrintWidths (
	title As String,
	message As String
) As Double
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPrintWidths(System.String,System.String)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPrintWidths(System.String,System.String)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPrintWidths(System.String,System.String)"]
See Also
Reference
IRhinoUiDialogService Interface
ShowPrintWidths Overload
Rhino.UI Namespace