RhinoCommon API
Triangle3d.WithB Method
 Replace the B corner.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Triangle3d WithB(
	Point3d b
)
Public Function WithB (
	b As Point3d
) As Triangle3d
Parameters
b
Type: Rhino.Geometry.Point3d
[Missing <param name="b"/> documentation for "M:Rhino.Geometry.Triangle3d.WithB(Rhino.Geometry.Point3d)"]
Return Value
Type: Triangle3d
[Missing <returns> documentation for "M:Rhino.Geometry.Triangle3d.WithB(Rhino.Geometry.Point3d)"]
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace