RhinoCommon API
SimpleArrayLinetypePointer Constructor
 Initializes a new SimpleArrayLinetypePointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.6
Syntax
public SimpleArrayLinetypePointer()
Public Sub New
See Also
Reference
SimpleArrayLinetypePointer Class
Rhino.Runtime.InteropWrappers Namespace