RhinoCommon API
Curve.SpanVector Method
 Returns the vector of span division parameters for this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public double[] SpanVector()
Public Function SpanVector As Double()
Return Value
Type: Double[]
 An array of parameter values that mark the boundaries between spans of the curve.
See Also
Reference
Curve Class
Rhino.Geometry Namespace