RhinoCommon API
DisplayPipelineAttributes.HasDiagonalHatchEffect Method
 Returns TRUE if there is a diagonal hatch effect enabled with a hatch strength larger than 0.0, FALSE otherwise.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool HasDiagonalHatchEffect()
Public Function HasDiagonalHatchEffect As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipelineAttributes.HasDiagonalHatchEffect"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace