RhinoCommon API
IZooClientUtilities.LogoutOfCloudZoo Method
 Logs the user out of the cloud zoo. This logs out the current user and voids any existing leases.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool LogoutOfCloudZoo()
Function LogoutOfCloudZoo As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.LogoutOfCloudZoo"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace