RhinoCommon API
ObjectTable.FindClippingPlanesForViewport Method (RhinoViewport)
 Finds all of the visible clipping plane objects that actively clip a viewport.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ClippingPlaneObject[] FindClippingPlanesForViewport(
	RhinoViewport viewport
)
Public Function FindClippingPlanesForViewport (
	viewport As RhinoViewport
) As ClippingPlaneObject()
Parameters
viewport
Type: Rhino.Display.RhinoViewport
The viewport in which clipping planes are searched.
Return Value
Type: ClippingPlaneObject[]
An array of clipping plane objects. The array can be empty but not null.
Remarks
 Hidden clipping planes, and clipping planes on hidden layers, are not included in the results even though they continue to clip geometry in the viewport. Call FindClippingPlanesForViewport(RhinoViewport, Boolean) with includeHidden set to true to get every plane that clips the viewport.
See Also
Reference
ObjectTable Class
FindClippingPlanesForViewport Overload
Rhino.DocObjects.Tables Namespace