RhinoCommon API
GetEllipsoid.Get Method
 Prompt for the getting of an ellipsoid.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Result Get(
	out NurbsSurface ellipsoid
)
Public Function Get (
	<OutAttribute> ByRef ellipsoid As NurbsSurface
) As Result
Parameters
ellipsoid
Type: Rhino.Geometry.NurbsSurface
The ellipsoid in NURB form.
Return Value
Type: Result
The result of the getting operation.
See Also
Reference
GetEllipsoid Class
Rhino.Input.Custom Namespace