RhinoCommon API
ShortcutKeySettings.SetMacro Method (KeyboardKey, ModifierKey, String)
 Set a macro for a given key and modifier combination
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public static void SetMacro(
	KeyboardKey key,
	ModifierKey modifier,
	string macro
)
Public Shared Sub SetMacro (
	key As KeyboardKey,
	modifier As ModifierKey,
	macro As String
)
Parameters
key
Type: Rhino.UI.KeyboardKey
[Missing <param name="key"/> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.SetMacro(Rhino.UI.KeyboardKey,Rhino.UI.ModifierKey,System.String)"]
modifier
Type: Rhino.UI.ModifierKey
[Missing <param name="modifier"/> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.SetMacro(Rhino.UI.KeyboardKey,Rhino.UI.ModifierKey,System.String)"]
macro
Type: System.String
[Missing <param name="macro"/> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.SetMacro(Rhino.UI.KeyboardKey,Rhino.UI.ModifierKey,System.String)"]
See Also
Reference
ShortcutKeySettings Class
SetMacro Overload
Rhino.ApplicationSettings Namespace