RhinoCommon API
RenderMaterial.CreateBasicMaterial Method (Material, RhinoDoc)
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.CreateBasicMaterial(Rhino.DocObjects.Material,Rhino.RhinoDoc)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public static RenderMaterial CreateBasicMaterial(
	Material material,
	RhinoDoc doc
)
Public Shared Function CreateBasicMaterial (
	material As Material,
	doc As RhinoDoc
) As RenderMaterial
Parameters
material
Type: Rhino.DocObjects.Material
[Missing <param name="material"/> documentation for "M:Rhino.Render.RenderMaterial.CreateBasicMaterial(Rhino.DocObjects.Material,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.RenderMaterial.CreateBasicMaterial(Rhino.DocObjects.Material,Rhino.RhinoDoc)"]
Return Value
Type: RenderMaterial
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.CreateBasicMaterial(Rhino.DocObjects.Material,Rhino.RhinoDoc)"]
See Also
Reference
RenderMaterial Class
CreateBasicMaterial Overload
Rhino.Render Namespace