RhinoCommon API
File3dmStringTable.GetKey Method
 Returns a key value at a given index.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string GetKey(
	int i
)
Public Function GetKey (
	i As Integer
) As String
Parameters
i
Type: System.Int32
The index.
Return Value
Type: String
The key if successful.
See Also
Reference
File3dmStringTable Class
Rhino.FileIO Namespace