RhinoCommon API
DisplayPipeline.DrawMeshShaded Method (Mesh, GrasshopperDisplayMaterial)
 Draws a single mesh with the Grasshopper 2 ("G2") shaded display. This is a convenience overload of DrawMeshesShaded(IEnumerable<Mesh>, GrasshopperDisplayMaterial); see it for the mesh requirements and vertex-colour handling.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void DrawMeshShaded(
	Mesh mesh,
	GrasshopperDisplayMaterial material
)
Public Sub DrawMeshShaded (
	mesh As Mesh,
	material As GrasshopperDisplayMaterial
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
The mesh to draw. Should have current single-precision vertices and vertex normals (see DrawMeshesShaded(IEnumerable<Mesh>, GrasshopperDisplayMaterial)).
material
Type: Rhino.Display.GrasshopperDisplayMaterial
The G2 shaded settings to draw with. When null, default settings are used.
Remarks
The mesh is uploaded to the GPU on every redraw. Nothing is cached between frames, so every redraw re-uploads the mesh. When drawing more than one mesh, prefer a single batched DrawMeshesShaded(IEnumerable<Mesh>, GrasshopperDisplayMaterial) call over many single-mesh calls.
See Also
Reference
DisplayPipeline Class
DrawMeshShaded Overload
Rhino.Display Namespace