RhinoCommon API
Curve.CreateBooleanDifference Method (Curve, Curve)
Note: This API is now obsolete.
 Calculates the boolean difference between two closed, planar curves. Note, curves must be co-planar.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use version that takes tolerance as input")]
public static Curve[] CreateBooleanDifference(
	Curve curveA,
	Curve curveB
)
<ObsoleteAttribute("Use version that takes tolerance as input")>
Public Shared Function CreateBooleanDifference (
	curveA As Curve,
	curveB As Curve
) As Curve()
Parameters
curveA
Type: Rhino.Geometry.Curve
The first closed, planar curve.
curveB
Type: Rhino.Geometry.Curve
The second closed, planar curve.
Return Value
Type: Curve[]
Result curves on success, empty array if no difference could be calculated.
See Also
Reference
Curve Class
CreateBooleanDifference Overload
Rhino.Geometry Namespace