RhinoCommon API
DisplayPipeline.Draw3dText Method (String, Color, Plane, Double, String, Boolean, Boolean, TextHorizontalAlignment, TextVerticalAlignment)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.TextHorizontalAlignment,Rhino.DocObjects.TextVerticalAlignment)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public void Draw3dText(
	string text,
	Color color,
	Plane textPlane,
	double height,
	string fontface,
	bool bold,
	bool italic,
	TextHorizontalAlignment horizontalAlignment,
	TextVerticalAlignment verticalAlignment
)
Public Sub Draw3dText (
	text As String,
	color As Color,
	textPlane As Plane,
	height As Double,
	fontface As String,
	bold As Boolean,
	italic As Boolean,
	horizontalAlignment As TextHorizontalAlignment,
	verticalAlignment As TextVerticalAlignment
)
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.TextHorizontalAlignment,Rhino.DocObjects.TextVerticalAlignment)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.TextHorizontalAlignment,Rhino.DocObjects.TextVerticalAlignment)"]
textPlane
Type: Rhino.Geometry.Plane
[Missing <param name="textPlane"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.TextHorizontalAlignment,Rhino.DocObjects.TextVerticalAlignment)"]
height
Type: System.Double
[Missing <param name="height"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.TextHorizontalAlignment,Rhino.DocObjects.TextVerticalAlignment)"]
fontface
Type: System.String
[Missing <param name="fontface"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.TextHorizontalAlignment,Rhino.DocObjects.TextVerticalAlignment)"]
bold
Type: System.Boolean
[Missing <param name="bold"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.TextHorizontalAlignment,Rhino.DocObjects.TextVerticalAlignment)"]
italic
Type: System.Boolean
[Missing <param name="italic"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.TextHorizontalAlignment,Rhino.DocObjects.TextVerticalAlignment)"]
horizontalAlignment
Type: Rhino.DocObjects.TextHorizontalAlignment
[Missing <param name="horizontalAlignment"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.TextHorizontalAlignment,Rhino.DocObjects.TextVerticalAlignment)"]
verticalAlignment
Type: Rhino.DocObjects.TextVerticalAlignment
[Missing <param name="verticalAlignment"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.TextHorizontalAlignment,Rhino.DocObjects.TextVerticalAlignment)"]
See Also
Reference
DisplayPipeline Class
Draw3dText Overload
Rhino.Display Namespace