RhinoCommon API
RiskyAction Constructor
 Always create this in a using block
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RiskyAction(
	string description,
	string file = "",
	string member = "",
	int line = 0
)
Public Sub New (
	description As String,
	Optional file As String = "",
	Optional member As String = "",
	Optional line As Integer = 0
)
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.Runtime.RiskyAction.#ctor(System.String,System.String,System.String,System.Int32)"]
file (Optional)
Type: System.String
[Missing <param name="file"/> documentation for "M:Rhino.Runtime.RiskyAction.#ctor(System.String,System.String,System.String,System.Int32)"]
member (Optional)
Type: System.String
[Missing <param name="member"/> documentation for "M:Rhino.Runtime.RiskyAction.#ctor(System.String,System.String,System.String,System.Int32)"]
line (Optional)
Type: System.Int32
[Missing <param name="line"/> documentation for "M:Rhino.Runtime.RiskyAction.#ctor(System.String,System.String,System.String,System.Int32)"]
See Also
Reference
RiskyAction Class
Rhino.Runtime Namespace