RhinoCommon API
Layer.DeletePlotColor Method
 Removes the plot color for layer. The layer's color will be used for the plot color.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.26
Syntax
public void DeletePlotColor()
Public Sub DeletePlotColor
See Also
Reference
Layer Class
Rhino.DocObjects Namespace