RhinoCommon API
HostUtils.CallFromCoreRhino Method
 Don't change this function in ANY way unless you chat with Steve first! This function is called by Rhino on initial startup and the signature must be exact
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static int CallFromCoreRhino(
	string task
)
Public Shared Function CallFromCoreRhino (
	task As String
) As Integer
Parameters
task
Type: System.String
[Missing <param name="task"/> documentation for "M:Rhino.Runtime.HostUtils.CallFromCoreRhino(System.String)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.CallFromCoreRhino(System.String)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace