RhinoCommon API
SupportOptions.Libraries_SetCustomPath Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.Libraries_SetCustomPath(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void Libraries_SetCustomPath(
	string path
)
Public Shared Sub Libraries_SetCustomPath (
	path As String
)
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.Render.SupportOptions.Libraries_SetCustomPath(System.String)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace