RhinoCommon API
NurbsCurve.CreateRailFrames Method
 Computes relatively parallel rail sweep frames at specified parameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Plane[] CreateRailFrames(
	IEnumerable<double> parameters
)
Public Function CreateRailFrames (
	parameters As IEnumerable(Of Double)
) As Plane()
Parameters
parameters
Type: System.Collections.Generic.IEnumerable<Double>
A collection of curve parameters.
Return Value
Type: Plane[]
An array of planes if successful, or an empty array on failure.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace