RhinoCommon API
ManifestTable.GetEnumerator Method (ModelComponentType)
 Returns an enumerators that yields all model components, including default ones, relating to a particular type.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract IEnumerator<ModelComponent> GetEnumerator(
	ModelComponentType type
)
Public MustOverride Function GetEnumerator (
	type As ModelComponentType
) As IEnumerator(Of ModelComponent)
Parameters
type
Type: Rhino.DocObjects.ModelComponentType
The model component type.
Return Value
Type: IEnumerator<ModelComponent>
An enumerator.
See Also
Reference
ManifestTable Class
GetEnumerator Overload
Rhino.FileIO Namespace