RhinoCommon API
File3dmDisplacement.SubItemTexture Method
 Gets the override for displacement 'texture'. face_index is the index of the face on the polysurface/SubD.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid SubItemTexture(
	int face_index
)
Public Function SubItemTexture (
	face_index As Integer
) As Guid
Parameters
face_index
Type: System.Int32
[Missing <param name="face_index"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.SubItemTexture(System.Int32)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmDisplacement.SubItemTexture(System.Int32)"]
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace