RhinoCommon API
WaitCursor Constructor
Initializes a new instance of the WaitCursor class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public WaitCursor()
Public Sub New
See Also
Reference
WaitCursor Class
Rhino.UI Namespace