RhinoCommon API
PickContext.Dispose Method
Releases all resources used by the PickContext
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PickContext Class
Dispose Overload
Rhino.Input.Custom Namespace