RhinoCommon API
DisplayPipeline.IsInTiledDraw Method
 Returns true if the currently drawn frame is part of a tiled capture. Tiled captures are performed when creating large raster outputs.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
public bool IsInTiledDraw(
	out Size fullSize,
	out Rectangle currentTile
)
Public Function IsInTiledDraw (
	<OutAttribute> ByRef fullSize As Size,
	<OutAttribute> ByRef currentTile As Rectangle
) As Boolean
Parameters
fullSize
Type: System.Drawing.Size
Final full size area that is being created
currentTile
Type: System.Drawing.Rectangle
What portion of the fullSize area that is currently being drawn
Return Value
Type: Boolean
 true if a tiled capture is being performed. If false, the fullSize parameter will have the same size as currentTile
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace