RhinoCommon API
SurfaceCurvature.CreateFromGaussianAndMeanCurvatures Method
 Create a SurfaceCurvature from a gaussian and mean curvature values using the relationship between the principal curvatures, gaussian and mean: kappa1 = mean + sqrt(mean*mean - gaussian) kappa2 = mean - sqrt(mean*mean - gaussian) If the radicand is negative, we assume we're dealing with a bit of numerical noise or estimates and set the principal curvatures: kappa1 = kappa2 = sign(mean)*sqrt(gaussian)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static SurfaceCurvature CreateFromGaussianAndMeanCurvatures(
	double gaussianCurvature,
	double meanCurvature
)
Public Shared Function CreateFromGaussianAndMeanCurvatures (
	gaussianCurvature As Double,
	meanCurvature As Double
) As SurfaceCurvature
Parameters
gaussianCurvature
Type: System.Double
Gaussian curvature = kappa1*kappa2 (product of principal curvatures).
meanCurvature
Type: System.Double
Mean curvature = (kappa1+kappa2)/2 (average of principal curvatures).
Return Value
Type: SurfaceCurvature
A SurfaceCurvature if successful, null otherwise.
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace