RhinoCommon API
RhinoList<T>.Insert Method
 Inserts an element into the List at the specified index.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Insert(
	int index,
	T item
)
Public Sub Insert (
	index As Integer,
	item As T
)
Parameters
index
Type: System.Int32
The zero-based index at which item should be inserted.
item
Type: T
The object to insert. The value can be a null reference (Nothing in Visual Basic) for reference types.
Implements
IList<T>.Insert(Int32, T)
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace