RhinoCommon API
ViewCaptureSettings Constructor (RhinoView, Size, Double)
Constructor
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ViewCaptureSettings(
	RhinoView sourceView,
	Size mediaSize,
	double dpi
)
Public Sub New (
	sourceView As RhinoView,
	mediaSize As Size,
	dpi As Double
)
Parameters
sourceView
Type: Rhino.Display.RhinoView
The Rhino view to capture or print.
mediaSize
Type: System.Drawing.Size
The size of the output media.
dpi
Type: System.Double
Capture "density" in dots per inch.
See Also
Reference
ViewCaptureSettings Class
ViewCaptureSettings Overload
Rhino.Display Namespace