RhinoCommon API
Field.ValueAsGuid Method
 Return field value as Guid.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Guid ValueAsGuid()
Protected Function ValueAsGuid As Guid
Return Value
Type: Guid
Return the field value as an Guid.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace