RhinoCommon API
EventWatcher.Dispose Method
 Stops watching and releases the underlying native watcher.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
EventWatcher Class
Rhino Namespace