RhinoCommon API
BinaryArchiveWriter.WriteStringArray Method
 Writes a list, an array, or any enumerable of String to the archive.
The return will always be an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteStringArray(
	IEnumerable<string> value
)
Public Sub WriteStringArray (
	value As IEnumerable(Of String)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<String>
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace