RhinoCommon API
SubD.Evaluate Method (SubDComponentParameter, Point3d)
 Evaluates the location of a point on this SubD's surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Evaluate(
	SubDComponentParameter parameter,
	out Point3d point
)
Public Function Evaluate (
	parameter As SubDComponentParameter,
	<OutAttribute> ByRef point As Point3d
) As Boolean
Parameters
parameter
Type: Rhino.Geometry.SubDComponentParameter
The parameter to evaluate.
point
Type: Rhino.Geometry.Point3d
 The surface point is returned here, or Unset if this fails.
Return Value
Type: Boolean
True if the evaluation succeeded.
See Also
Reference
SubD Class
Evaluate Overload
Rhino.Geometry Namespace