RhinoCommon API
Point3dList Constructor
 Initializes a new empty list with default capacity.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3dList()
Public Sub New
See Also
Reference
Point3dList Class
Point3dList Overload
Rhino.Collections Namespace