RhinoCommon API
DracoCompression.DecompressByteArray Method
 Decompress data into either a mesh or point cloud.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static GeometryBase DecompressByteArray(
	byte[] bytes
)
Public Shared Function DecompressByteArray (
	bytes As Byte()
) As GeometryBase
Parameters
bytes
Type: System.Byte[]
compressed Draco data
Return Value
Type: GeometryBase
Mesh or point cloud on success. null on failure
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace