RhinoCommon API
TextFields.Date Method
 Current date
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Date()
Public Shared Function Date As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.Date"]
See Also
Reference
TextFields Class
Date Overload
Rhino.Runtime Namespace