RhinoCommon API
Point3d.Divide Method
 Divides a Point3d by a number.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Point3d Divide(
	Point3d point,
	double t
)
Public Shared Function Divide (
	point As Point3d,
	t As Double
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
t
Type: System.Double
A number.
Return Value
Type: Point3d
A new point that is coordinate-wise divided by t.
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace