RhinoCommon API
Transform.Equals Method (Transform)
 Determines if another transform equals this transform value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Equals(
	Transform other
)
Public Function Equals (
	other As Transform
) As Boolean
Parameters
other
Type: Rhino.Geometry.Transform
Another transform.
Return Value
Type: Boolean
true if other has the same value as this transform; otherwise, false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Transform Structure
Equals Overload
Rhino.Geometry Namespace