RhinoCommon API
GetPolyline.Get Method
 Perform the 'get' operation.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Result Get(
	out Polyline polyline
)
Public Function Get (
	<OutAttribute> ByRef polyline As Polyline
) As Result
Parameters
polyline
Type: Rhino.Geometry.Polyline
[Missing <param name="polyline"/> documentation for "M:Rhino.Input.Custom.GetPolyline.Get(Rhino.Geometry.Polyline@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetPolyline.Get(Rhino.Geometry.Polyline@)"]
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace