RhinoCommon API
ComponentStatus.HasSomeEqualStates Method
 For the purposes of this test, Selected and SelectedPersistent are considered equal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool HasSomeEqualStates(
	ComponentStatus statesFilter,
	ComponentStatus comparand
)
Public Function HasSomeEqualStates (
	statesFilter As ComponentStatus,
	comparand As ComponentStatus
) As Boolean
Parameters
statesFilter
Type: Rhino.Geometry.ComponentStatus
If no states are specified, then false is returned.
comparand
Type: Rhino.Geometry.ComponentStatus
If a state is set in states_filter, the corresponding state in "this" and comparand will be tested.
Return Value
Type: Boolean
True if at least one tested state in "this" and comparand are identical.
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace