RhinoCommon API
Mesh.UnifyNormals Method (Boolean)
 Attempts to fix inconsistencies in the directions of mesh faces in a mesh. This function does not modify mesh vertex normals, it rearranges the mesh face winding and face normals to make them all consistent. Note, you may want to call Mesh.Normals.ComputeNormals() to recompute vertex normals after calling this functions.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int UnifyNormals(
	bool countOnly
)
Public Function UnifyNormals (
	countOnly As Boolean
) As Integer
Parameters
countOnly
Type: System.Boolean
If true, then only the number of faces that would be modified is determined.
Return Value
Type: Int32
If countOnly=false, the number of faces that were modified. If countOnly=true, the number of faces that would be modified.
See Also
Reference
Mesh Class
UnifyNormals Overload
Rhino.Geometry Namespace