RhinoCommon API
HiddenLineDrawing.Compute Method (HiddenLineDrawingParameters, Boolean)
 Perform the hidden line drawing calculation based on input parameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static HiddenLineDrawing Compute(
	HiddenLineDrawingParameters parameters,
	bool multipleThreads
)
Public Shared Function Compute (
	parameters As HiddenLineDrawingParameters,
	multipleThreads As Boolean
) As HiddenLineDrawing
Parameters
parameters
Type: Rhino.Geometry.HiddenLineDrawingParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.HiddenLineDrawing.Compute(Rhino.Geometry.HiddenLineDrawingParameters,System.Boolean)"]
multipleThreads
Type: System.Boolean
[Missing <param name="multipleThreads"/> documentation for "M:Rhino.Geometry.HiddenLineDrawing.Compute(Rhino.Geometry.HiddenLineDrawingParameters,System.Boolean)"]
Return Value
Type: HiddenLineDrawing
Results of calculation on success, null on failure
See Also
Reference
HiddenLineDrawing Class
Compute Overload
Rhino.Geometry Namespace