RhinoCommon API
DisplayPipeline.DrawBitmap Method (DisplayBitmap, Int32, Int32, Int32, Int32)
 Draws a bitmap in screen coordinates, scaled to fit the given size.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void DrawBitmap(
	DisplayBitmap bitmap,
	int left,
	int top,
	int width,
	int height
)
Public Sub DrawBitmap (
	bitmap As DisplayBitmap,
	left As Integer,
	top As Integer,
	width As Integer,
	height As Integer
)
Parameters
bitmap
Type: Rhino.Display.DisplayBitmap
bitmap to draw
left
Type: System.Int32
where the left edge of the bitmap should appear in screen coordinates
top
Type: System.Int32
where the top edge of the bitmap should appear in screen coordinates
width
Type: System.Int32
width (in pixels) to draw the bitmap at
height
Type: System.Int32
height (in pixels) to draw the bitmap at
See Also
Reference
DisplayPipeline Class
DrawBitmap Overload
Rhino.Display Namespace