RhinoCommon API
RdkSelectionNavigator.GoBackwards Method
 Navigate backwards if possible
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GoBackwards(
	ref RenderContentCollection selectedContentArray
)
Public Function GoBackwards (
	ByRef selectedContentArray As RenderContentCollection
) As Boolean
Parameters
selectedContentArray
Type: Rhino.Render.RenderContentCollection
selectedContentArray is the new selection after navigating backwards
Return Value
Type: Boolean
true on success, else false
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace