RhinoCommon API
HostUtils.GetPrinterFormNames Method
 Get list of form names available for a given printer
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string[] GetPrinterFormNames(
	string printerName
)
Public Shared Function GetPrinterFormNames (
	printerName As String
) As String()
Parameters
printerName
Type: System.String
name or printer to query
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.GetPrinterFormNames(System.String)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace