RhinoCommon API
StdVectorByte.ConstPointer Method
 Gets the constant (immutable) pointer of this vector.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.26
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
The constant pointer.
See Also
Reference
StdVectorByte Class
Rhino.Runtime.InteropWrappers Namespace