RhinoCommon API
Mesh.CollapseFacesByEdgeLength Method
 Collapses multiple mesh faces, with greater/less than edge length, based on the principles found in Stan Melax's mesh reduction PDF, see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int CollapseFacesByEdgeLength(
	bool bGreaterThan,
	double edgeLength
)
Public Function CollapseFacesByEdgeLength (
	bGreaterThan As Boolean,
	edgeLength As Double
) As Integer
Parameters
bGreaterThan
Type: System.Boolean
Determines whether edge with lengths greater than or less than edgeLength are collapsed.
edgeLength
Type: System.Double
Length with which to compare to edge lengths.
Return Value
Type: Int32
Number of edges (faces) that were collapsed, -1 for general failure (like bad topology or index out of range) or -2 if all of the edges would be collapsed and the resulting mesh would be invalid.
Remarks
 This number may differ from the initial number of edges that meet the input criteria because the lengths of some initial edges may be altered as other edges are collapsed.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace