RhinoCommon API
RenderSourceView Constructor
 Create a new RenderSourceView for the given doc. Note that this should be done with using(var rsv = new RenderSourceView(doc)) {} If the RenderSettings have the source view set to for instance a SnapShot this construct will ensure that the (active) view is set to the correct snapshot, and reverted back to the original once this instance goes out of scope.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderSourceView(
	RhinoDoc doc
)
Public Sub New (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
Rhino document
See Also
Reference
RenderSourceView Class
Rhino.Render Namespace