RhinoCommon API
Layer.DeletePerViewportColor Method
 Remove any per viewport layer color setting so the layer's overall setting will be used for all viewports.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DeletePerViewportColor(
	Guid viewportId
)
Public Sub DeletePerViewportColor (
	viewportId As Guid
)
Parameters
viewportId
Type: System.Guid
 If not Guid.Empty, then the setting for this viewport will be deleted. If Guid.Empty, the all per viewport layer color settings will be removed.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace