RhinoCommon API
MeshFaceList.ToIntArray Method (Boolean, List<Int32>)
 Copies all of the faces to a linear array of indices. Clean-up of vertex indices if replacedIndices is a valid List<int> ///
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] ToIntArray(
	bool asTriangles,
	ref List<int> replacedIndices
)
Public Function ToIntArray (
	asTriangles As Boolean,
	ByRef replacedIndices As List(Of Integer)
) As Integer()
Parameters
asTriangles
Type: System.Boolean
If set to true as triangles.
replacedIndices
Type: System.Collections.Generic.List<Int32>
List is populated with vertex indices that were replaced with 0. If replacedIndices is null there will be no cleanup
Return Value
Type: Int32[]
The int array. This method never returns null.
See Also
Reference
MeshFaceList Class
ToIntArray Overload
Rhino.Geometry.Collections Namespace