RhinoCommon API
NurbsSurfacePointList.SetControlPoint Method (Int32, Int32, ControlPoint)
 Sets the control point at the given (u, v) index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SetControlPoint(
	int u,
	int v,
	ControlPoint cp
)
Public Function SetControlPoint (
	u As Integer,
	v As Integer,
	cp As ControlPoint
) As Boolean
Parameters
u
Type: System.Int32
Index of control point in the surface U direction.
v
Type: System.Int32
Index of control point in the surface V direction.
cp
Type: Rhino.Geometry.ControlPoint
The control point to set.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsSurfacePointList Class
SetControlPoint Overload
Rhino.Geometry.Collections Namespace