RhinoCommon API
Field Constructor (RenderContent, String, String, Object, Boolean)
Note: This API is now obsolete.
Initializes a new instance of the Field class
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute]
protected Field(
	RenderContent renderContent,
	string name,
	string prompt,
	Object initialValue,
	bool isTextured
)
<ObsoleteAttribute>
Protected Sub New (
	renderContent As RenderContent,
	name As String,
	prompt As String,
	initialValue As Object,
	isTextured As Boolean
)
Parameters
renderContent
Type: Rhino.Render.RenderContent
[Missing <param name="renderContent"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean)"]
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean)"]
prompt
Type: System.String
[Missing <param name="prompt"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean)"]
initialValue
Type: System.Object
[Missing <param name="initialValue"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean)"]
isTextured
Type: System.Boolean
[Missing <param name="isTextured"/> documentation for "M:Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean)"]
See Also
Reference
Field Class
Field Overload
Rhino.Render.Fields Namespace