RhinoCommon API
UserInterfaceObjectBase.OnMouseClick Method
 Called during a mouse click event on this object
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnMouseClick(
	MouseState mouse
)
Protected Overridable Sub OnMouseClick (
	mouse As MouseState
)
Parameters
mouse
Type: Rhino.UI.MouseState
[Missing <param name="mouse"/> documentation for "M:Rhino.UI.UserInterfaceObjectBase.OnMouseClick(Rhino.UI.MouseState)"]
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace