RhinoCommon API
SupportOptions.Libraries_SetShowCustom Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.Libraries_SetShowCustom(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static void Libraries_SetShowCustom(
	bool b
)
Public Shared Sub Libraries_SetShowCustom (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.Libraries_SetShowCustom(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace