RhinoCommon API
Curve.CreateNurbsCurveFit Method
 Rebuilds the curve to a NURBS curve with the specified options.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static NurbsCurve CreateNurbsCurveFit(
	Curve curve,
	Interval domain,
	NurbsCurveFitParameters rebuildOptions,
	out Line maximumSeparation,
	out double thisSeparationParameter,
	out double nurbsSeparationParameter
)
Public Shared Function CreateNurbsCurveFit (
	curve As Curve,
	domain As Interval,
	rebuildOptions As NurbsCurveFitParameters,
	<OutAttribute> ByRef maximumSeparation As Line,
	<OutAttribute> ByRef thisSeparationParameter As Double,
	<OutAttribute> ByRef nurbsSeparationParameter As Double
) As NurbsCurve
Parameters
curve
Type: Rhino.Geometry.Curve
The input curve you would like to rebuild
domain
Type: Rhino.Geometry.Interval
The domain to process
rebuildOptions
Type: Rhino.Geometry.NurbsCurveFitParameters
Specifies how to rebuild the curve
maximumSeparation
Type: Rhino.Geometry.Line
[Missing <param name="maximumSeparation"/> documentation for "M:Rhino.Geometry.Curve.CreateNurbsCurveFit(Rhino.Geometry.Curve,Rhino.Geometry.Interval,Rhino.Geometry.NurbsCurveFitParameters,Rhino.Geometry.Line@,System.Double@,System.Double@)"]
thisSeparationParameter
Type: System.Double
[Missing <param name="thisSeparationParameter"/> documentation for "M:Rhino.Geometry.Curve.CreateNurbsCurveFit(Rhino.Geometry.Curve,Rhino.Geometry.Interval,Rhino.Geometry.NurbsCurveFitParameters,Rhino.Geometry.Line@,System.Double@,System.Double@)"]
nurbsSeparationParameter
Type: System.Double
[Missing <param name="nurbsSeparationParameter"/> documentation for "M:Rhino.Geometry.Curve.CreateNurbsCurveFit(Rhino.Geometry.Curve,Rhino.Geometry.Interval,Rhino.Geometry.NurbsCurveFitParameters,Rhino.Geometry.Line@,System.Double@,System.Double@)"]
Return Value
Type: NurbsCurve
The resulting curveb
See Also
Reference
Curve Class
Rhino.Geometry Namespace