RhinoCommon API
DigitizerPlugIn.EnableDigitizer Method
 Called by Rhino to enable/disable input from the digitizer. If enable is true and EnableDigitizer() returns false, then Rhino will not calibrate the digitizer.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract bool EnableDigitizer(
	bool enable
)
Protected MustOverride Function EnableDigitizer (
	enable As Boolean
) As Boolean
Parameters
enable
Type: System.Boolean
 If true, enable the digitizer. If false, disable the digitizer.
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
DigitizerPlugIn Class
Rhino.PlugIns Namespace