RhinoCommon API
Mesh.Subdivide Method (IEnumerable<Int32>)
 Subdivides specific faces of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Subdivide(
	IEnumerable<int> faceIndices
)
Public Function Subdivide (
	faceIndices As IEnumerable(Of Integer)
) As Boolean
Parameters
faceIndices
Type: System.Collections.Generic.IEnumerable<Int32>
Indices of the faces to subdivide.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
Mesh Class
Subdivide Overload
Rhino.Geometry Namespace