RhinoCommon API
RenderContent.SetParameter Method (String, Object, RenderContent.ChangeContexts)
Note: This API is now obsolete.
 Set the named parameter value for this content instance. If you do not support this parameter, call the base class.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
[ObsoleteAttribute("Use SetParameter without ChangeContexts and Begin/EndChange")]
public virtual bool SetParameter(
	string parameterName,
	Object value,
	RenderContent.ChangeContexts changeContext
)
<ObsoleteAttribute("Use SetParameter without ChangeContexts and Begin/EndChange")>
Public Overridable Function SetParameter (
	parameterName As String,
	value As Object,
	changeContext As RenderContent.ChangeContexts
) As Boolean
Parameters
parameterName
Type: System.String
[Missing <param name="parameterName"/> documentation for "M:Rhino.Render.RenderContent.SetParameter(System.String,System.Object,Rhino.Render.RenderContent.ChangeContexts)"]
value
Type: System.Object
[Missing <param name="value"/> documentation for "M:Rhino.Render.RenderContent.SetParameter(System.String,System.Object,Rhino.Render.RenderContent.ChangeContexts)"]
changeContext
Type: Rhino.Render.RenderContent.ChangeContexts
[Missing <param name="changeContext"/> documentation for "M:Rhino.Render.RenderContent.SetParameter(System.String,System.Object,Rhino.Render.RenderContent.ChangeContexts)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.SetParameter(System.String,System.Object,Rhino.Render.RenderContent.ChangeContexts)"]
See Also
Reference
RenderContent Class
SetParameter Overload
Rhino.Render Namespace