RhinoCommon API
GetCurve.GetControlPointCurve Method
 Interactively picks the control points of a curve. This is what the Rhino Curve command uses.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Result GetControlPointCurve(
	out NurbsCurve curve
)
Public Function GetControlPointCurve (
	<OutAttribute> ByRef curve As NurbsCurve
) As Result
Parameters
curve
Type: Rhino.Geometry.NurbsCurve
The resulting curve, or null when the result is not Success.
Return Value
Type: Result
The command result.
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace