RhinoCommon API
Utilities.PromptForSaveImageFileParameters Method
 Prompts the user for a save file name and the width, height and depth of an image to be saved.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string PromptForSaveImageFileParameters(
	string filename,
	ref int width,
	ref int height,
	ref int colorDepth
)
Public Shared Function PromptForSaveImageFileParameters (
	filename As String,
	ByRef width As Integer,
	ByRef height As Integer,
	ByRef colorDepth As Integer
) As String
Parameters
filename
Type: System.String
The original file path.
width
Type: System.Int32
A width.
height
Type: System.Int32
An height.
colorDepth
Type: System.Int32
A color depth.
Return Value
Type: String
The new file name.
See Also
Reference
Utilities Class
Rhino.Render Namespace