RhinoCommon API
SubD.ClosestPoint Method (Point3d)
 Gets the point on this SubD's surface that is closest to a test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Point3d ClosestPoint(
	Point3d testPoint
)
Public Function ClosestPoint (
	testPoint As Point3d
) As Point3d
Parameters
testPoint
Type: Rhino.Geometry.Point3d
The point to project onto this SubD.
Return Value
Type: Point3d
 The closest point, or Unset if none was found.
See Also
Reference
SubD Class
ClosestPoint Overload
Rhino.Geometry Namespace