RhinoCommon API
Surface.GetNurbsFormParameterFromSurfaceParameter Method
 Translates a parameter from the current surface to the parameter space of the surface returned by ToNurbsSurface().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GetNurbsFormParameterFromSurfaceParameter(
	double surfaceS,
	double surfaceT,
	out double nurbsS,
	out double nurbsT
)
Public Function GetNurbsFormParameterFromSurfaceParameter (
	surfaceS As Double,
	surfaceT As Double,
	<OutAttribute> ByRef nurbsS As Double,
	<OutAttribute> ByRef nurbsT As Double
) As Boolean
Parameters
surfaceS
Type: System.Double
The parameter in the S, or sometimes U, direction, of this surface.
surfaceT
Type: System.Double
The parameter in the T, or sometimes V, direction of this surface.
nurbsS
Type: System.Double
S on the NURBS form.
nurbsT
Type: System.Double
T on the NURBS form.
Return Value
Type: Boolean
True if the operation succeeded; otherwise, false.
See Also
Reference
Surface Class
Rhino.Geometry Namespace