RhinoCommon API
Mesh.QuadRemeshBrep Method (Brep, QuadRemeshParameters)
 Create QuadRemesh from a Brep Set Brep Face Mode by setting QuadRemeshParameters.PreserveMeshArrayEdgesMode
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Mesh QuadRemeshBrep(
	Brep brep,
	QuadRemeshParameters parameters
)
Public Shared Function QuadRemeshBrep (
	brep As Brep,
	parameters As QuadRemeshParameters
) As Mesh
Parameters
brep
Type: Rhino.Geometry.Brep
[Missing <param name="brep"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshBrep(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters)"]
parameters
Type: Rhino.Geometry.QuadRemeshParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshBrep(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshBrep(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters)"]
See Also
Reference
Mesh Class
QuadRemeshBrep Overload
Rhino.Geometry Namespace