RhinoCommon API
ObjectTable.AddBox Method (Box, ObjectAttributes, HistoryRecord, Boolean)
 Adds a box to the object table, as an extrusion.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid AddBox(
	Box box,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddBox (
	box As Box,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
box
Type: Rhino.Geometry.Box
The box.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes that will be linked with the surface object.
history
Type: Rhino.DocObjects.HistoryRecord
History data records.
reference
Type: System.Boolean
If a reference, object will not be saved in the document.
Return Value
Type: Guid
The ID.
See Also
Reference
ObjectTable Class
AddBox Overload
Rhino.DocObjects.Tables Namespace