RhinoCommon API
UserInterfaceObjectBase.IsRegistered Method
 Is this user interface object active
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsRegistered()
Public Function IsRegistered As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.UserInterfaceObjectBase.IsRegistered"]
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace