RhinoCommon API
DirectionAnalysisSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static DirectionAnalysisSettingsState GetCurrentState()
Public Shared Function GetCurrentState As DirectionAnalysisSettingsState
Return Value
Type: DirectionAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.DirectionAnalysisSettings.GetCurrentState"]
See Also
Reference
DirectionAnalysisSettings Class
Rhino.ApplicationSettings Namespace