RhinoCommon API
SubDDisplayParameters.CreateFromMeshDensity Method
 This function creates SubDDisplayParameters from a user interface "slider" like Rhino's simple mesh controls.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static SubDDisplayParameters CreateFromMeshDensity(
	double normalizedMeshDensity
)
Public Shared Function CreateFromMeshDensity (
	normalizedMeshDensity As Double
) As SubDDisplayParameters
Parameters
normalizedMeshDensity
Type: System.Double
A double between 0.0 and 1.0.
Return Value
Type: SubDDisplayParameters
A valid ON_SubDDisplayParameters with the specified subd display density.
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace