RhinoCommon API
HostUtils.GetPrinterDPI Method
 Get the output resolution for a given printer.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
public static double GetPrinterDPI(
	string printerName,
	bool horizontal
)
Public Shared Function GetPrinterDPI (
	printerName As String,
	horizontal As Boolean
) As Double
Parameters
printerName
Type: System.String
[Missing <param name="printerName"/> documentation for "M:Rhino.Runtime.HostUtils.GetPrinterDPI(System.String,System.Boolean)"]
horizontal
Type: System.Boolean
get the horizontal or vertical resolution
Return Value
Type: Double
 Dot per inch resolution for a given printer on success. 0 if an error occurred
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace