RhinoCommon API
Centermark Constructor (Plane, Curve, Double)
 Constructs a new center mark dimension.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Centermark(
	Plane plane,
	Curve curve,
	double curveParameter
)
Public Sub New (
	plane As Plane,
	curve As Curve,
	curveParameter As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
Dimension's plane.
curve
Type: Rhino.Geometry.Curve
Curve used to determine the center mark's radius.
curveParameter
Type: System.Double
Parameter on curve used to determine the center mark's radius.
See Also
Reference
Centermark Class
Centermark Overload
Rhino.Geometry Namespace