RhinoCommon API
GetSphere.GetMesh Method
 Prompt for the getting of a mesh sphere.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Result GetMesh(
	ref GetSphere.MeshSphereStyle style,
	ref int verticalFaces,
	ref int aroundFaces,
	ref int triangleSubdivisions,
	ref int quadSubdivisions,
	out Sphere sphere
)
Public Function GetMesh (
	ByRef style As GetSphere.MeshSphereStyle,
	ByRef verticalFaces As Integer,
	ByRef aroundFaces As Integer,
	ByRef triangleSubdivisions As Integer,
	ByRef quadSubdivisions As Integer,
	<OutAttribute> ByRef sphere As Sphere
) As Result
Parameters
style
Type: Rhino.Input.Custom.GetSphere.MeshSphereStyle
The style of the mesh sphere.
verticalFaces
Type: System.Int32
The number of UV mesh faces in the vertical direction.
aroundFaces
Type: System.Int32
The number of UV mesh faces in the around direction.
triangleSubdivisions
Type: System.Int32
The number of triangle mesh subdivisions.
quadSubdivisions
Type: System.Int32
The number of quad mesh subdivisions.
sphere
Type: Rhino.Geometry.Sphere
The sphere geometry defined by the user.
Return Value
Type: Result
The result of the getting operation.
See Also
Reference
GetSphere Class
Rhino.Input.Custom Namespace