RhinoCommon API
Intersection.MeshCurve Method (Mesh, Curve, Double, Int32[], Curve[], Int32[])
 Simpler overload of MeshCurve(Mesh, Curve, Double) with mesh face indices. Mirrors MeshLine(Mesh, Line, Int32[]) and adds overlap output as sub-curves.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Point3d[] MeshCurve(
	Mesh mesh,
	Curve curve,
	double tolerance,
	out int[] faceIds,
	out Curve[] overlapCurves,
	out int[] overlapFaceIds
)
Public Shared Function MeshCurve (
	mesh As Mesh,
	curve As Curve,
	tolerance As Double,
	<OutAttribute> ByRef faceIds As Integer(),
	<OutAttribute> ByRef overlapCurves As Curve(),
	<OutAttribute> ByRef overlapFaceIds As Integer()
) As Point3d()
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to intersect.
curve
Type: Rhino.Geometry.Curve
Curve to intersect.
tolerance
Type: System.Double
Numerical tolerance; see the rich overload.
faceIds
Type: System.Int32[]
Receives one face index per returned point (parallel to the return array).
overlapCurves
Type: Rhino.Geometry.Curve[]
Receives one trimmed sub-curve of the input per overlap event.
overlapFaceIds
Type: System.Int32[]
Receives one face index per overlap sub-curve (parallel to overlapCurves).
Return Value
Type: Point3d[]
One point per Point event — isolated crossings and the endpoints of every overlap span — ordered by curve parameter. Empty on failure or no intersection.
See Also
Reference
Intersection Class
MeshCurve Overload
Rhino.Geometry.Intersect Namespace