RhinoCommon API
BrepFaceList.RemoveSlits Method
 Remove slit trims and slit boundaries from each face.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public bool RemoveSlits()
Public Function RemoveSlits As Boolean
Return Value
Type: Boolean
true if any slits were removed
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace