RhinoCommon API
MeshVertexList.GetTopologicalIndenticalVertices Method
 Gets a list of other vertices which are "topologically" identical to this vertex.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int[] GetTopologicalIndenticalVertices(
	int vertexIndex
)
Public Function GetTopologicalIndenticalVertices (
	vertexIndex As Integer
) As Integer()
Parameters
vertexIndex
Type: System.Int32
A vertex index in the mesh.
Return Value
Type: Int32[]
 Array of indices of vertices that are topologically the same as this vertex. The array includes vertexIndex. Returns null on failure.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace