RhinoCommon API
DisplayPipelineAttributes.GetFill Method
 Get fill colors used for clearing the frame buffer
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.23
Syntax
public void GetFill(
	out Color topLeft,
	out Color bottomLeft,
	out Color topRight,
	out Color bottomRight
)
Public Sub GetFill (
	<OutAttribute> ByRef topLeft As Color,
	<OutAttribute> ByRef bottomLeft As Color,
	<OutAttribute> ByRef topRight As Color,
	<OutAttribute> ByRef bottomRight As Color
)
Parameters
topLeft
Type: System.Drawing.Color
[Missing <param name="topLeft"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.GetFill(System.Drawing.Color@,System.Drawing.Color@,System.Drawing.Color@,System.Drawing.Color@)"]
bottomLeft
Type: System.Drawing.Color
[Missing <param name="bottomLeft"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.GetFill(System.Drawing.Color@,System.Drawing.Color@,System.Drawing.Color@,System.Drawing.Color@)"]
topRight
Type: System.Drawing.Color
[Missing <param name="topRight"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.GetFill(System.Drawing.Color@,System.Drawing.Color@,System.Drawing.Color@,System.Drawing.Color@)"]
bottomRight
Type: System.Drawing.Color
[Missing <param name="bottomRight"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.GetFill(System.Drawing.Color@,System.Drawing.Color@,System.Drawing.Color@,System.Drawing.Color@)"]
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace