RhinoCommon API
Skin.ShowSplash Method
Is called when the splash screen should be shown.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ShowSplash()
Protected Overridable Sub ShowSplash
See Also
Reference
Skin Class
Rhino.Runtime Namespace