RhinoCommon API
ColorCMYK.CreateFromLAB Method
 Constructs the nearest CMYK equivalent of a LAB color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static ColorCMYK CreateFromLAB(
	ColorLAB lab
)
Public Shared Function CreateFromLAB (
	lab As ColorLAB
) As ColorCMYK
Parameters
lab
Type: Rhino.Display.ColorLAB
Target color in LAB space.
Return Value
Type: ColorCMYK
The CMYK equivalent of the LAB color.
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace