RhinoCommon API
RhinoApp.ClearCommandHistoryWindow Method
 Clear the text in Rhino's command history window.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void ClearCommandHistoryWindow()
Public Shared Sub ClearCommandHistoryWindow
See Also
Reference
RhinoApp Class
Rhino Namespace