RhinoCommon API
ContentUI.Uuid Method
 Get the unique identifier of the UI.
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public virtual Guid Uuid()
Public Overridable Function Uuid As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.Controls.ContentUI.Uuid"]
See Also
Reference
ContentUI Class
Rhino.UI.Controls Namespace