RhinoCommon API
Panels.OpenPanel Method (Type)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void OpenPanel(
	Type panelType
)
Public Shared Sub OpenPanel (
	panelType As Type
)
Parameters
panelType
Type: System.Type
 Class type of the panel to open.
See Also
Reference
Panels Class
OpenPanel Overload
Rhino.UI Namespace