RhinoCommon API
PostEffectCollection.CopyFrom Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.CopyFrom(Rhino.Render.FreeFloatingBase)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public override void CopyFrom(
	FreeFloatingBase src
)
Public Overrides Sub CopyFrom (
	src As FreeFloatingBase
)
Parameters
src
Type: Rhino.Render.FreeFloatingBase
[Missing <param name="src"/> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.CopyFrom(Rhino.Render.FreeFloatingBase)"]
See Also
Reference
PostEffectCollection Class
Rhino.Render.PostEffects Namespace