RhinoCommon API
RhinoApp.ValidateRhinoLicense Method
 Validates a stand-alone Rhino license key for the given Rhino account email against the McNeel validation server, without asking the user for any input. Shows the validation wizard's connection/validation progress steps; problems reported by the server route to the wizard's normal interactive steps. On success the license is locked to this computer (standalone node). Used by the rhinoN://license protocol handler to install a license from a web link.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.34
Syntax
public static bool ValidateRhinoLicense(
	string licenseKey,
	string email
)
Public Shared Function ValidateRhinoLicense (
	licenseKey As String,
	email As String
) As Boolean
Parameters
licenseKey
Type: System.String
The Rhino license key to validate and install.
email
Type: System.String
The Rhino account email to validate the key against.
Return Value
Type: Boolean
true if the license validated and was installed; otherwise false.
See Also
Reference
RhinoApp Class
Rhino Namespace