RhinoCommon API
Mesh.CreateBooleanUnion Method (IEnumerable<Mesh>)
 Computes the solid union of a set of meshes. WARNING: Use the overload that takes a tolerance or options.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Mesh[] CreateBooleanUnion(
	IEnumerable<Mesh> meshes
)
Public Shared Function CreateBooleanUnion (
	meshes As IEnumerable(Of Mesh)
) As Mesh()
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
Meshes to union.
Return Value
Type: Mesh[]
An array of Mesh results or null on failure.
See Also
Reference
Mesh Class
CreateBooleanUnion Overload
Rhino.Geometry Namespace