RhinoCommon API
Curve.SortCurves Method
 Sorts the curves into joinable segment groups. No joining is performed, the curves are only analyzed for start/end proximity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SortCurves(
	ICollection<Curve> inputCurves,
	double tolerance,
	out IList<IList<Curve.SortedSegment>> groups
)
Public Shared Function SortCurves (
	inputCurves As ICollection(Of Curve),
	tolerance As Double,
	<OutAttribute> ByRef groups As IList(Of IList(Of Curve.SortedSegment))
) As Boolean
Parameters
inputCurves
Type: System.Collections.Generic.ICollection<Curve>
The curves to sort
tolerance
Type: System.Double
The tolerance to bridge any gaps between curves
groups
Type: System.Collections.Generic.IList<IList<Curve.SortedSegment>>
The groups of curves that can be formed upon joining. A curve that cannot be joined to any other curve forms a group of size 1. No joining is performed.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Curve.SortCurves(System.Collections.Generic.ICollection{Rhino.Geometry.Curve},System.Double,System.Collections.Generic.IList{System.Collections.Generic.IList{Rhino.Geometry.Curve.SortedSegment}}@)"]
See Also
Reference
Curve Class
Rhino.Geometry Namespace