RhinoCommon API
AnnotationBase Constructor
 Protected constructor for internal use.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected AnnotationBase()
Protected Sub New
See Also
Reference
AnnotationBase Class
AnnotationBase Overload
Rhino.Geometry Namespace