RhinoCommon API
BinaryArchiveReader.ReadUInt Method
 Reads a UInt32 from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public uint ReadUInt()
Public Function ReadUInt As UInteger
Return Value
Type: UInt32
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace