RhinoCommon API
Mesh.RebuildMesh Method (Mesh)
 Use this function to rebuild meshes that are not acting properly. Vertices and faces are kept. Face normals and vertex normals are recalculated. Texture coordinates, vertex colors, surface curvatures, and surfaces parameters are not replaced.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.23
Syntax
public static Mesh RebuildMesh(
	Mesh mesh
)
Public Shared Function RebuildMesh (
	mesh As Mesh
) As Mesh
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to be rebuilt.
Return Value
Type: Mesh
The rebuilt mesh if successful, null otherwise.
See Also
Reference
Mesh Class
RebuildMesh Overload
Rhino.Geometry Namespace