RhinoCommon API
Box.Contains Method (Box)
 Determines whether a Box is inside this Box, including its boundary. This is the same as calling Contains(box,false). Invalid boxes contain nothing. Invalid boxes are never contained.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Contains(
	Box box
)
Public Function Contains (
	box As Box
) As Boolean
Parameters
box
Type: Rhino.Geometry.Box
Box to test.
Return Value
Type: Boolean
true if all corners of the Box are non-strictly inside this Box. false if this Box or the tested Box are invalid.
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace