RhinoCommon API
Point3d.CreateNoiseDistribution2D Method
 Generates an array of two-dimensional points distributed according to the specified blue noise type.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Point3d[] CreateNoiseDistribution2D(
	int targetCount,
	bool useOrderedThreshold,
	double xMin = 0,
	double yMin = 0,
	double xMax = 1,
	double yMax = 1
)
Public Shared Function CreateNoiseDistribution2D (
	targetCount As Integer,
	useOrderedThreshold As Boolean,
	Optional xMin As Double = 0,
	Optional yMin As Double = 0,
	Optional xMax As Double = 1,
	Optional yMax As Double = 1
) As Point3d()
Parameters
targetCount
Type: System.Int32
The number of points to generate. Must be a positive integer. The actual count may differ because the algorithm distributes points on a grid whose row and column counts are integers derived from the target count and the region's aspect ratio.
useOrderedThreshold
Type: System.Boolean
Use the blue noise ordered threshold (true) or the blue noise step (false) spectra for the noise distribution.
xMin (Optional)
Type: System.Double
The minimum X coordinate of the bounding rectangle.
yMin (Optional)
Type: System.Double
The minimum Y coordinate of the bounding rectangle.
xMax (Optional)
Type: System.Double
The maximum X coordinate of the bounding rectangle.
yMax (Optional)
Type: System.Double
The maximum Y coordinate of the bounding rectangle.
Return Value
Type: Point3d[]
An array of Point3d values.
Remarks
The distribution and characteristics of the generated points depend on the specified noise type.
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace