RhinoCommon API
ModelAidSettings.GetCurrentState Method
 Gets the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static ModelAidSettingsState GetCurrentState()
Public Shared Function GetCurrentState As ModelAidSettingsState
Return Value
Type: ModelAidSettingsState
A new model aid state with current settings.
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace