RhinoCommon API
DrawingUtilities.CreateLinetypePreviewGeometryEx Method
 Preview geometry for a linetype on a curve, by channel, mirroring the viewport renderer. kind 0 returns the dash silhouette polygons with the line cleared under each shape (these are meant to be filled); kind 1 returns curve shape outlines (meant to be stroked); kind 2 returns text and surface shape outlines (meant to be filled with an even-odd rule).
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static List<Point2f[]> CreateLinetypePreviewGeometryEx(
	Curve curve,
	Linetype linetype,
	int width,
	int height,
	double linetypeScale,
	int kind
)
Public Shared Function CreateLinetypePreviewGeometryEx (
	curve As Curve,
	linetype As Linetype,
	width As Integer,
	height As Integer,
	linetypeScale As Double,
	kind As Integer
) As List(Of Point2f())
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.UI.DrawingUtilities.CreateLinetypePreviewGeometryEx(Rhino.Geometry.Curve,Rhino.DocObjects.Linetype,System.Int32,System.Int32,System.Double,System.Int32)"]
linetype
Type: Rhino.DocObjects.Linetype
[Missing <param name="linetype"/> documentation for "M:Rhino.UI.DrawingUtilities.CreateLinetypePreviewGeometryEx(Rhino.Geometry.Curve,Rhino.DocObjects.Linetype,System.Int32,System.Int32,System.Double,System.Int32)"]
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.UI.DrawingUtilities.CreateLinetypePreviewGeometryEx(Rhino.Geometry.Curve,Rhino.DocObjects.Linetype,System.Int32,System.Int32,System.Double,System.Int32)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.UI.DrawingUtilities.CreateLinetypePreviewGeometryEx(Rhino.Geometry.Curve,Rhino.DocObjects.Linetype,System.Int32,System.Int32,System.Double,System.Int32)"]
linetypeScale
Type: System.Double
Scale applied to shape size and spacing, matching the preview's pattern scale.
kind
Type: System.Int32
0 = dashes (fill), 1 = curve shapes (stroke), 2 = text/surface shapes (even-odd fill).
Return Value
Type: List<Point2f[]>
[Missing <returns> documentation for "M:Rhino.UI.DrawingUtilities.CreateLinetypePreviewGeometryEx(Rhino.Geometry.Curve,Rhino.DocObjects.Linetype,System.Int32,System.Int32,System.Double,System.Int32)"]
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace