RhinoCommon API
LicenseUtils.CheckOutLicense Method
 Checks out a license that is on loan from a Zoo server on a permanent basis.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool CheckOutLicense(
	Guid productId
)
Public Shared Function CheckOutLicense (
	productId As Guid
) As Boolean
Parameters
productId
Type: System.Guid
 The Guid of the product that you want to check out.
Return Value
Type: Boolean
 true if the license was checked out successful. false if not successful or on error.
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace