RhinoCommon API
ChangeQueue.EnvironmentFromOriginalInstanceId Method
 Get the RenderEnvironment from the ChangeQueue content cache from the original instance id
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public RenderEnvironment EnvironmentFromOriginalInstanceId(
	Guid id
)
Public Function EnvironmentFromOriginalInstanceId (
	id As Guid
) As RenderEnvironment
Parameters
id
Type: System.Guid
The original instance id
Return Value
Type: RenderEnvironment
RenderEnvironment
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace