RhinoCommon API
NurbsSurfacePointList.SetWeight Method
 Sets the weight of a control point at the given (u, v) index. Note, if the surface is non-rational, it will be converted to rational.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SetWeight(
	int u,
	int v,
	double weight
)
Public Function SetWeight (
	u As Integer,
	v As Integer,
	weight As Double
) As Boolean
Parameters
u
Type: System.Int32
Index of control-point along surface U direction.
v
Type: System.Int32
Index of control-point along surface V direction.
weight
Type: System.Double
The control point weight.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace