RhinoCommon API
Intersection.MeshRays Method (Mesh, IEnumerable<Ray3d>)
 Finds the first intersection of each one of a set of rays with a mesh.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static double[] MeshRays(
	Mesh mesh,
	IEnumerable<Ray3d> rays
)
Public Shared Function MeshRays (
	mesh As Mesh,
	rays As IEnumerable(Of Ray3d)
) As Double()
Parameters
mesh
Type: Rhino.Geometry.Mesh
A mesh to intersect.
rays
Type: System.Collections.Generic.IEnumerable<Ray3d>
The rays to cast.
Return Value
Type: Double[]
 One value for each ray, in the order of the rays: the parameter along that ray of its first intersection with the mesh, or a value smaller than 0.0 where that ray does not meet the mesh. Null when the mesh or the set of rays is null.
Remarks
 The rays are cast on several threads, so this is much faster than one call of MeshRay(Mesh, Ray3d) per ray.
See Also
Reference
Intersection Class
MeshRays Overload
Rhino.Geometry.Intersect Namespace