RhinoCommon API
RhinoAccountsManager.RevokeAuthTokenAsync Method
 Invalidates/revokes an IOAuth2Token object from the Rhino Accounts server.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Task RevokeAuthTokenAsync(
	IOAuth2Token oauth2Token,
	SecretKey secretKey,
	CancellationToken cancellationToken
)
Public Shared Function RevokeAuthTokenAsync (
	oauth2Token As IOAuth2Token,
	secretKey As SecretKey,
	cancellationToken As CancellationToken
) As Task
Parameters
oauth2Token
Type: Rhino.Runtime.RhinoAccounts.IOAuth2Token
The token to revoke.
secretKey
Type: Rhino.Runtime.RhinoAccounts.SecretKey
A special key that was handed to you in ExecuteProtectedCodeAsync(Func<SecretKey, Task>)
cancellationToken
Type: System.Threading.CancellationToken
A token that can be used to signal that the operation should be cancelled.
Return Value
Type: Task
[Missing <returns> documentation for "M:Rhino.Runtime.RhinoAccounts.RhinoAccountsManager.RevokeAuthTokenAsync(Rhino.Runtime.RhinoAccounts.IOAuth2Token,Rhino.Runtime.RhinoAccounts.SecretKey,System.Threading.CancellationToken)"]
Exceptions
Exception | Condition
InvalidOperationException | An invalid secretKey was passed, or the assembly is not allowed to call methods from IRhinoAccountsManager
OperationCanceledException | The operation was cancelled, either by internal decisions or because the cancellationToken was cancelled.
Remarks
If the OAuth 2 token is stored in the local cache, it will be removed from the cache as well.
See Also
Reference
RhinoAccountsManager Class
Rhino.Runtime.RhinoAccounts Namespace