RhinoCommon API
PlugIn.IdFromPath Method
 Gets the id of an installed plug-in giving the plug-in's file path.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid IdFromPath(
	string pluginPath
)
Public Shared Function IdFromPath (
	pluginPath As String
) As Guid
Parameters
pluginPath
Type: System.String
The path to the installed plug-in.
Return Value
Type: Guid
The id if successful.
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace