RhinoCommon API
IZooClientUtilities.ShowRhinoExpiredMessage Method
[Missing <summary> documentation for "M:Rhino.Runtime.IZooClientUtilities.ShowRhinoExpiredMessage(Rhino.Runtime.Mode,System.Int32@)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool ShowRhinoExpiredMessage(
	Mode mode,
	ref int result
)
Function ShowRhinoExpiredMessage (
	mode As Mode,
	ByRef result As Integer
) As Boolean
Parameters
mode
Type: Rhino.Runtime.Mode
[Missing <param name="mode"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.ShowRhinoExpiredMessage(Rhino.Runtime.Mode,System.Int32@)"]
result
Type: System.Int32
[Missing <param name="result"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.ShowRhinoExpiredMessage(Rhino.Runtime.Mode,System.Int32@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.ShowRhinoExpiredMessage(Rhino.Runtime.Mode,System.Int32@)"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace