RhinoCommon API
Polyline.Trim Method
 Constructs a polyline out of a parameter sub-domain in this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Polyline Trim(
	Interval domain
)
Public Function Trim (
	domain As Interval
) As Polyline
Parameters
domain
Type: Rhino.Geometry.Interval
The sub-domain of the polyline. The integer part of the domain parameters indicate the index of the segment.
Return Value
Type: Polyline
The polyline as defined by the sub-domain, or null on failure.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace