RhinoCommon API
FileCsvDocument.TryGetLong Method (String, Int32, Int64)
 Retrieves the value of a cell as a 64-bit integer, addressing the column by header name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetLong(
	string column,
	int row,
	out long value
)
Public Function TryGetLong (
	column As String,
	row As Integer,
	<OutAttribute> ByRef value As Long
) As Boolean
Parameters
column
Type: System.String
The header name of the column.
row
Type: System.Int32
The zero-based data-row index (y).
value
Type: System.Int64
The parsed value, or 0 if the column or cell does not exist or cannot be parsed.
Return Value
Type: Boolean
true if the column and cell exist and were parsed; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetLong Overload
Rhino.FileIO Namespace