RhinoCommon API
IRhinoUiDialogService.ShowPopupMenu Method
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPopupMenu(System.String[],System.Int32[],System.Nullable{System.Int32},System.Nullable{System.Int32})"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
int ShowPopupMenu(
	string[] arrItems,
	int[] arrModes,
	int? screenPointX,
	int? screenPointY
)
Function ShowPopupMenu (
	arrItems As String(),
	arrModes As Integer(),
	screenPointX As Integer?,
	screenPointY As Integer?
) As Integer
Parameters
arrItems
Type: System.String[]
[Missing <param name="arrItems"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPopupMenu(System.String[],System.Int32[],System.Nullable{System.Int32},System.Nullable{System.Int32})"]
arrModes
Type: System.Int32[]
[Missing <param name="arrModes"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPopupMenu(System.String[],System.Int32[],System.Nullable{System.Int32},System.Nullable{System.Int32})"]
screenPointX
Type: System.Nullable<Int32>
[Missing <param name="screenPointX"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPopupMenu(System.String[],System.Int32[],System.Nullable{System.Int32},System.Nullable{System.Int32})"]
screenPointY
Type: System.Nullable<Int32>
[Missing <param name="screenPointY"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPopupMenu(System.String[],System.Int32[],System.Nullable{System.Int32},System.Nullable{System.Int32})"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowPopupMenu(System.String[],System.Int32[],System.Nullable{System.Int32},System.Nullable{System.Int32})"]
See Also
Reference
IRhinoUiDialogService Interface
Rhino.UI Namespace