RhinoCommon API
FileStp.Write Method
Write a STP file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool Write(
	string filename,
	RhinoDoc doc,
	FileStpWriteOptions options
)
Public Shared Function Write (
	filename As String,
	doc As RhinoDoc,
	options As FileStpWriteOptions
) As Boolean
Parameters
filename
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileStpWriteOptions
options used for generating the STP file
Return Value
Type: Boolean
true on success
See Also
Reference
FileStp Class
Rhino.FileIO Namespace