RhinoCommon API
RhinoObject.SetObjectFrame Method (Transform)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.DocObjects.RhinoObject.SetObjectFrame(Rhino.Geometry.Transform)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
[ObsoleteAttribute("Use Attributes.SetObjectFrame instead")]
public void SetObjectFrame(
	Transform xform
)
<ObsoleteAttribute("Use Attributes.SetObjectFrame instead")>
Public Sub SetObjectFrame (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
[Missing <param name="xform"/> documentation for "M:Rhino.DocObjects.RhinoObject.SetObjectFrame(Rhino.Geometry.Transform)"]
See Also
Reference
RhinoObject Class
SetObjectFrame Overload
Rhino.DocObjects Namespace