RhinoCommon API
Squisher.SquishPoint Method
 Maps a point on or near the previously squished 3d surface to the flattened surface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public bool SquishPoint(
	Point3d point,
	out Point3d squishedPoint
)
Public Function SquishPoint (
	point As Point3d,
	<OutAttribute> ByRef squishedPoint As Point3d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
The point to squish
squishedPoint
Type: Rhino.Geometry.Point3d
The squished point
Return Value
Type: Boolean
true if successful
See Also
Reference
Squisher Class
Rhino.Geometry Namespace