RhinoCommon API
DisplayPipeline.EnableDepthTesting Method
 Enable or disable the DepthTesting behavior of the engine. When DepthTesting is disabled, objects in front will no longer occlude objects behind them.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void EnableDepthTesting(
	bool enable
)
Public Sub EnableDepthTesting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true to enable DepthTesting, false to disable.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace