RhinoCommon API
SupportOptions.BlockContent_ShowDocuments Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.BlockContent_ShowDocuments"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool BlockContent_ShowDocuments()
Public Shared Function BlockContent_ShowDocuments As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.BlockContent_ShowDocuments"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace