RhinoCommon API
DisplayPen Constructor
Initializes a new instance of the DisplayPen class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPen()
Public Sub New
See Also
Reference
DisplayPen Class
Rhino.Display Namespace