RhinoCommon API
DisplayPipelineAttributes.SetColorFadeEffect Method
 Set a color fade effect to make objects fade a given amount towards a given color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetColorFadeEffect(
	 in Color fadeColor,
	 in float fadeAmount
)
Public Sub SetColorFadeEffect (
	 ByRef fadeColor As Color,
	 ByRef fadeAmount As Single
)
Parameters
fadeColor
Type: System.Drawing.Color
The amount of fade towards the given color (0..1).
fadeAmount
Type: System.Single
The color to fade towards.
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace