RhinoCommon API
RhinoGet.GetBoxWithCounts Method
 Gets a 3d box with prompts for counts in X, Y and Z directions.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Result GetBoxWithCounts(
	int xMin,
	ref int xCount,
	int yMin,
	ref int yCount,
	int zMin,
	ref int zCount,
	out Point3d[] corners
)
Public Shared Function GetBoxWithCounts (
	xMin As Integer,
	ByRef xCount As Integer,
	yMin As Integer,
	ByRef yCount As Integer,
	zMin As Integer,
	ByRef zCount As Integer,
	<OutAttribute> ByRef corners As Point3d()
) As Result
Parameters
xMin
Type: System.Int32
Minimum value allowed for count in the x direction.
xCount
Type: System.Int32
Count in the x direction.
yMin
Type: System.Int32
Minimum value allowed for count in the y direction.
yCount
Type: System.Int32
Count in the y direction.
zMin
Type: System.Int32
Minimum value allowed for count in the z direction.
zCount
Type: System.Int32
Count in the z direction.
corners
Type: Rhino.Geometry.Point3d[]
corners of the bottom rectangle in counter-clockwise order, followed by top rectangle.
Return Value
Type: Result
Commands.Result.Success if successful.
See Also
Reference
RhinoGet Class
Rhino.Input Namespace