RhinoCommon API
Utilities.ShowContentChooser Method (Guid, Guid, RenderContentKind, Guid, RenderContent.ShowContentChooserFlags, RhinoDoc)
Note: This API is now obsolete.
 Shows the Content New / Existing Browser to allow the user to select a new or existing content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.25
Syntax
[ObsoleteAttribute("Since 7.9: Use ShowContentNewExistingBrowser() instead")]
public static Utilities.ShowContentChooserResults ShowContentChooser(
	Guid defaultType,
	Guid defaultInstanceId,
	RenderContentKind kinds,
	ref Guid instanceIdOut,
	RenderContent.ShowContentChooserFlags flags,
	RhinoDoc doc
)
<ObsoleteAttribute("Since 7.9: Use ShowContentNewExistingBrowser() instead")>
Public Shared Function ShowContentChooser (
	defaultType As Guid,
	defaultInstanceId As Guid,
	kinds As RenderContentKind,
	ByRef instanceIdOut As Guid,
	flags As RenderContent.ShowContentChooserFlags,
	doc As RhinoDoc
) As Utilities.ShowContentChooserResults
Parameters
defaultType
Type: System.Guid
[Missing <param name="defaultType"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(System.Guid,System.Guid,Rhino.Render.RenderContentKind,System.Guid@,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)"]
defaultInstanceId
Type: System.Guid
[Missing <param name="defaultInstanceId"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(System.Guid,System.Guid,Rhino.Render.RenderContentKind,System.Guid@,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)"]
kinds
Type: Rhino.Render.RenderContentKind
[Missing <param name="kinds"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(System.Guid,System.Guid,Rhino.Render.RenderContentKind,System.Guid@,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)"]
instanceIdOut
Type: System.Guid
[Missing <param name="instanceIdOut"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(System.Guid,System.Guid,Rhino.Render.RenderContentKind,System.Guid@,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)"]
flags
Type: Rhino.Render.RenderContent.ShowContentChooserFlags
[Missing <param name="flags"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(System.Guid,System.Guid,Rhino.Render.RenderContentKind,System.Guid@,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(System.Guid,System.Guid,Rhino.Render.RenderContentKind,System.Guid@,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)"]
Return Value
Type: Utilities.ShowContentChooserResults
[Missing <returns> documentation for "M:Rhino.Render.Utilities.ShowContentChooser(System.Guid,System.Guid,Rhino.Render.RenderContentKind,System.Guid@,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)"]
See Also
Reference
Utilities Class
ShowContentChooser Overload
Rhino.Render Namespace