RhinoCommon API
FieldDictionary.Add Method (String, Vector3d)
 Add a new Vector3dField to the dictionary. This will be a data only field and not show up in the content browsers.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Vector3dField Add(
	string key,
	Vector3d value
)
Public Function Add (
	key As String,
	value As Vector3d
) As Vector3dField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: Rhino.Geometry.Vector3d
Initial value for this field.
Return Value
Type: Vector3dField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Vector3d)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace