RhinoCommon API
IRhRdkThumbnailList.SetClientText Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.SetClientText(System.String)"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void SetClientText(
	string w
)
Sub SetClientText (
	w As String
)
Parameters
w
Type: System.String
[Missing <param name="w"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.SetClientText(System.String)"]
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace