RhinoCommon API
ShortcutKeySettings.GetLabel Method
 Get the macro label associated with a given keyboard shortcut
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string GetLabel(
	ShortcutKey key
)
Public Shared Function GetLabel (
	key As ShortcutKey
) As String
Parameters
key
Type: Rhino.ApplicationSettings.ShortcutKey
[Missing <param name="key"/> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.GetLabel(Rhino.ApplicationSettings.ShortcutKey)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.GetLabel(Rhino.ApplicationSettings.ShortcutKey)"]
See Also
Reference
ShortcutKeySettings Class
Rhino.ApplicationSettings Namespace