RhinoCommon API
NamedPositionTable.Save Method (String, IEnumerable<Guid>)
Save a new Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid Save(
	string name,
	IEnumerable<Guid> objectIds
)
Public Function Save (
	name As String,
	objectIds As IEnumerable(Of Guid)
) As Guid
Parameters
name
Type: System.String
 Name for this Named Position.
objectIds
Type: System.Collections.Generic.IEnumerable<Guid>
 Array of Rhino Object Ids which should be included in this Named Position.
Return Value
Type: Guid
 Guid of the newly saved Named Position.
See Also
Reference
NamedPositionTable Class
Save Overload
Rhino.DocObjects.Tables Namespace