RhinoCommon API
RenderContent.AddUserInterfaceSection Method (Type, String, Boolean, Boolean)
Note: This API is now obsolete.
 Add a new .NET control to an content expandable tab section, the height of the createExpanded tabs client area will be the initial height of the specified control.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
[ObsoleteAttribute("Use AddUserInterfaceSection(Rhino.UI.Controls.ICollapsibleSection) below instead.  This function will not work on the Mac and is not type-safe.")]
public UserInterfaceSection AddUserInterfaceSection(
	Type classType,
	string caption,
	bool createExpanded,
	bool createVisible
)
<ObsoleteAttribute("Use AddUserInterfaceSection(Rhino.UI.Controls.ICollapsibleSection) below instead.  This function will not work on the Mac and is not type-safe.")>
Public Function AddUserInterfaceSection (
	classType As Type,
	caption As String,
	createExpanded As Boolean,
	createVisible As Boolean
) As UserInterfaceSection
Parameters
classType
Type: System.Type
 The control class to create and embed as a child window in the expandable tab client area. This class type must be derived from IWin32Window or this method will throw an ArgumentException. Implement the IUserInterfaceSection interface in your classType to get UserInterfaceSection notification.
caption
Type: System.String
Expandable tab caption.
createExpanded
Type: System.Boolean
 If this value is true then the new expandable tab section will initially be expanded, if it is false it will be collapsed.
createVisible
Type: System.Boolean
 If this value is true then the new expandable tab section will initially be visible, if it is false it will be hidden.
Return Value
Type: UserInterfaceSection
 Returns the UserInterfaceSection object used to manage the new user control object.
See Also
Reference
RenderContent Class
AddUserInterfaceSection Overload
Rhino.Render Namespace