RhinoCommon API
BezierSurface.ToNurbsSurface Method
 Constructs a NURBS surface representation of this surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public NurbsSurface ToNurbsSurface()
Public Function ToNurbsSurface As NurbsSurface
Return Value
Type: NurbsSurface
NURBS representation of the surface on success, null on failure.
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace