RhinoCommon API
ToolbarFileCollection.GetEnumerator Method
 Gets a toolbar file enumerator.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IEnumerator<ToolbarFile> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of ToolbarFile)
Return Value
Type: IEnumerator<ToolbarFile>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace