RhinoCommon API
ChangeQueue.Dispose Method (Boolean)
 Dispose our ChangeQueue. Disposes unmanaged memory.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool isDisposing
)
Protected Overridable Sub Dispose (
	isDisposing As Boolean
)
Parameters
isDisposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
ChangeQueue Class
Dispose Overload
Rhino.Render.ChangeQueue Namespace