RhinoCommon API
HostUtils.InitializeZooClient Method
 Initializes the ZooClient and Rhino license manager, this should get called automatically when RhinoCommon is loaded so you probably won't have to call this method.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public static void InitializeZooClient()
Public Shared Sub InitializeZooClient
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace