RhinoCommon API
Quaternion.ToString Method
 Returns a string representation of this Quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A textual representation.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace