RhinoCommon API
MeshPrincipalCurvatureList.SetSurfaceCurvature Method
 Sets or adds a principal curvature to the principal curvature iist.
If [index] is less than [Count], the existing principal curvature at [index] will be modified.
If [index] equals [Count], a new principal curvature is appended to the end of the principal curvature list.
If [index] is larger than [Count], the function will return false.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SetSurfaceCurvature(
	int index,
	SurfaceCurvature surfaceCurvature
)
Public Function SetSurfaceCurvature (
	index As Integer,
	surfaceCurvature As SurfaceCurvature
) As Boolean
Parameters
index
Type: System.Int32
Index of vertex color to set. If index equals Count, then the color will be appended.
surfaceCurvature
Type: Rhino.Geometry.SurfaceCurvature
Principal curvature to set.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshPrincipalCurvatureList Class
Rhino.Geometry.Collections Namespace