RhinoCommon API
CustomGripObject.NewLocation Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomGripObject.NewLocation"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual void NewLocation()
Public Overridable Sub NewLocation
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace