RhinoCommon API
RenderContent.Finalize Method
 Finalizer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RenderContent Class
Rhino.Render Namespace