RhinoCommon API
SubDEdgeChain.ToLoftCurve Method
 Gets a NURBS curve suitable for lofting SubDs, following this chain.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public NurbsCurve ToLoftCurve()
Public Function ToLoftCurve As NurbsCurve
Return Value
Type: NurbsCurve
The curve, or null if the chain is not valid.
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace