RhinoCommon API
RdkNotLoadedException Constructor
 Initializes a new instance of the RDK not loaded exception with a standard message.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RdkNotLoadedException()
Public Sub New
See Also
Reference
RdkNotLoadedException Class
Rhino.Runtime Namespace