RhinoCommon API
NamedPositionTable.Save Method (String, IEnumerable<RhinoObject>)
Save a new Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid Save(
	string name,
	IEnumerable<RhinoObject> objects
)
Public Function Save (
	name As String,
	objects As IEnumerable(Of RhinoObject)
) As Guid
Parameters
name
Type: System.String
 Name for this Named Position.
objects
Type: System.Collections.Generic.IEnumerable<RhinoObject>
 Array of Rhino Objects which should be included in this Named Position.
Return Value
Type: Guid
 Guid of the newly saved Named Position.
See Also
Reference
NamedPositionTable Class
Save Overload
Rhino.DocObjects.Tables Namespace