RhinoCommon API
MeshFace.CompareTo Method
 Compares this MeshFace with another MeshFace and returns a value of 1, 0, or -1, referring to dictionary order.
Index evaluation priority is first A, then B, then C, then D.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int CompareTo(
	MeshFace other
)
Public Function CompareTo (
	other As MeshFace
) As Integer
Parameters
other
Type: Rhino.Geometry.MeshFace
The other MeshFace to use in comparison.
Return Value
Type: Int32
 0: if this is identical to other
-1: if this < other. Priority is for index of corner A first, then B, then C, then D.
+1: otherwise.
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace