RhinoCommon API
Centermark Constructor
 Constructs a new center mark dimension.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Centermark()
Public Sub New
See Also
Reference
Centermark Class
Centermark Overload
Rhino.Geometry Namespace