RhinoCommon API
Vector3dField.ValueAsObject Method
[Missing <summary> documentation for "M:Rhino.Render.Fields.Vector3dField.ValueAsObject"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public override Object ValueAsObject()
Public Overrides Function ValueAsObject As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.Render.Fields.Vector3dField.ValueAsObject"]
See Also
Reference
Vector3dField Class
Rhino.Render.Fields Namespace