RhinoCommon API
Mesh.RebuildNormals Method
 Removes mesh normals and reconstructs the face and vertex normals based on the orientation of the faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void RebuildNormals()
Public Sub RebuildNormals
See Also
Reference
Mesh Class
Rhino.Geometry Namespace