RhinoCommon API
PolyCurve.CleanUp Method
 Removes any nesting of polycurves. If this polycurve has just a single segment, the segment is returned. If, after nest removal, there are adjacent segments which are polylines, they are combined into a single polyline. The new curve may have a different domain from this polycurve. If the start and end segments of a closed input are polylines, the result may have a different seam location since the start and end segments will be combined.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Curve CleanUp()
Public Function CleanUp As Curve
Return Value
Type: Curve
A new curve that is not necessarily a polycurve if successful, null otherwise.
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace
PolyCurve.RemoveNesting()