RhinoCommon API
Markup.Thumbnail Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Markup.Thumbnail(System.Int32)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Bitmap Thumbnail(
	int height
)
Public Function Thumbnail (
	height As Integer
) As Bitmap
Parameters
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.DocObjects.Markup.Thumbnail(System.Int32)"]
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.DocObjects.Markup.Thumbnail(System.Int32)"]
See Also
Reference
Markup Class
Rhino.DocObjects Namespace