RhinoCommon API
UserInterfaceControl Constructor
Initializes a new instance of the UserInterfaceControl class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
protected UserInterfaceControl(
	Point location,
	Size size
)
Protected Sub New (
	location As Point,
	size As Size
)
Parameters
location
Type: System.Drawing.Point
[Missing <param name="location"/> documentation for "M:Rhino.UI.UserInterfaceControl.#ctor(System.Drawing.Point,System.Drawing.Size)"]
size
Type: System.Drawing.Size
[Missing <param name="size"/> documentation for "M:Rhino.UI.UserInterfaceControl.#ctor(System.Drawing.Point,System.Drawing.Size)"]
See Also
Reference
UserInterfaceControl Class
Rhino.UI Namespace