RhinoCommon API
AssemblyResolver.AddSearchFolder Method
 Register a custom folder with the Assembly Resolver. Folders will be searched recursively, so this could potentially be a very expensive operation. If at all possible, you should consider only registering individual files.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void AddSearchFolder(
	string folder
)
Public Shared Sub AddSearchFolder (
	folder As String
)
Parameters
folder
Type: System.String
Path of folder to include during Assembly Resolver events.
See Also
Reference
AssemblyResolver Class
Rhino.Runtime Namespace