RhinoCommon API
RenderPanels.RegisterPanel Method (PlugIn, RenderPanelType, Type, Guid, String, Boolean, Boolean, RenderPanels.ExtraSidePanePosition)
 Register custom render user interface with Rhino. This should only be done in RegisterRenderPanels(RenderPanels). Panels registered after RegisterRenderPanels(RenderPanels) is called will be ignored.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void RegisterPanel(
	PlugIn plugin,
	RenderPanelType renderPanelType,
	Type panelType,
	Guid renderEngineId,
	string caption,
	bool alwaysShow,
	bool initialShow,
	RenderPanels.ExtraSidePanePosition pos
)
Public Sub RegisterPanel (
	plugin As PlugIn,
	renderPanelType As RenderPanelType,
	panelType As Type,
	renderEngineId As Guid,
	caption As String,
	alwaysShow As Boolean,
	initialShow As Boolean,
	pos As RenderPanels.ExtraSidePanePosition
)
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
The plug-in providing the custom user interface
renderPanelType
Type: Rhino.Render.RenderPanelType
See RenderPanelType for supported user interface types.
panelType
Type: System.Type
The type of object to be created and added to the render container.
renderEngineId
Type: System.Guid
The render engine id allowing the UI to be shown.
caption
Type: System.String
The caption for the custom user interface.
alwaysShow
Type: System.Boolean
If true the custom user interface will always be visible, if false then it may be hidden or shown as requested by the renderer.
initialShow
Type: System.Boolean
Initial visibility state of the custom user interface control.
pos
Type: Rhino.Render.RenderPanels.ExtraSidePanePosition
The position to dock the extra side pane at.
See Also
Reference
RenderPanels Class
RegisterPanel Overload
Rhino.Render Namespace