RhinoCommon API
DracoCompression.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace