RhinoCommon API
MeshVertexList.CullUnused Method
 Removes all vertices that are currently not used by the Face list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int CullUnused()
Public Function CullUnused As Integer
Return Value
Type: Int32
The number of unused vertices that were removed.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace