RhinoCommon API
PersistentSettings.TryGetPoint Method (String, Point)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetPoint(System.String,System.Drawing.Point@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetPoint(
	string key,
	out Point value
)
Public Function TryGetPoint (
	key As String,
	<OutAttribute> ByRef value As Point
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetPoint(System.String,System.Drawing.Point@)"]
value
Type: System.Drawing.Point
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetPoint(System.String,System.Drawing.Point@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetPoint(System.String,System.Drawing.Point@)"]
See Also
Reference
PersistentSettings Class
TryGetPoint Overload
Rhino Namespace