RhinoCommon API
SimpleArrayExtrusionPointer.Add Method
 Adds a extrusion to the list.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Add(
	Extrusion extrusion,
	bool asConst
)
Public Sub Add (
	extrusion As Extrusion,
	asConst As Boolean
)
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
A extrusion to add.
asConst
Type: System.Boolean
Whether this extrusion should be treated as non-modifiable.
See Also
Reference
SimpleArrayExtrusionPointer Class
Rhino.Runtime.InteropWrappers Namespace