RhinoCommon API
HermiteSurface.SetVParameterAt Method
 Sets the "v" parameter at an index. These parameters are strictly increasing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SetVParameterAt(
	int index,
	double parameter
)
Public Sub SetVParameterAt (
	index As Integer,
	parameter As Double
)
Parameters
index
Type: System.Int32
The index.
parameter
Type: System.Double
The parameter value.
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace