RhinoCommon API
BinaryArchiveWriter.WriteSizeF Method
 Writes a SizeF value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WriteSizeF(
	SizeF value
)
Public Sub WriteSizeF (
	value As SizeF
)
Parameters
value
Type: System.Drawing.SizeF
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace