RhinoCommon API
PhysicallyBasedMaterial Constructor
Initializes a new instance of the PhysicallyBasedMaterial class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PhysicallyBasedMaterial()
Public Sub New
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace