RhinoCommon API
RhinoDoc.Undo Method
 Undo the last action
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.16
Syntax
public bool Undo()
Public Function Undo As Boolean
Return Value
Type: Boolean
 true on success
See Also
Reference
RhinoDoc Class
Rhino Namespace