RhinoCommon API
PageViewGroupTable.Modify Method (PageViewGroup, Guid, Boolean)
 Modifies a page view group.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Modify(
	PageViewGroup newSettings,
	Guid id,
	bool quiet
)
Public Function Modify (
	newSettings As PageViewGroup,
	id As Guid,
	quiet As Boolean
) As Boolean
Parameters
newSettings
Type: Rhino.DocObjects.PageViewGroup
The modified page view group.
id
Type: System.Guid
Id of page view group to modify.
quiet
Type: System.Boolean
[Missing <param name="quiet"/> documentation for "M:Rhino.DocObjects.Tables.PageViewGroupTable.Modify(Rhino.DocObjects.PageViewGroup,System.Guid,System.Boolean)"]
Return Value
Type: Boolean
>true if successful, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException | If newSetting is null.
See Also
Reference
PageViewGroupTable Class
Modify Overload
Rhino.DocObjects.Tables Namespace