RhinoCommon API
ArchivableDictionary.SetEnumValue<T> Method (T)
 Set an enum value
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public bool SetEnumValue<T>(
	T enumValue
)
where T : struct, new(), IConvertible
Public Function SetEnumValue(Of T As {Structure, New, IConvertible}) (
	enumValue As T
) As Boolean
Parameters
enumValue
Type: T
[Missing <param name="enumValue"/> documentation for "M:Rhino.Collections.ArchivableDictionary.SetEnumValue``1(``0)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.Collections.ArchivableDictionary.SetEnumValue``1(``0)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.SetEnumValue``1(``0)"]
See Also
Reference
ArchivableDictionary Class
SetEnumValue Overload
Rhino.Collections Namespace