RhinoCommon API
SimulatedEnvironment.ConstPointer Method
[Missing <summary> documentation for "M:Rhino.Render.SimulatedEnvironment.ConstPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Render.SimulatedEnvironment.ConstPointer"]
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace