RhinoCommon API
RenderContentSerializer.Read Method
 Called to when importing a file, file should be parsed and converted to a valid RenderContent object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public abstract RenderContent Read(
	string pathToFile
)
Public MustOverride Function Read (
	pathToFile As String
) As RenderContent
Parameters
pathToFile
Type: System.String
 Full path of the file to load.
Return Value
Type: RenderContent
 Returns a valid RenderContent object such as RenderMaterial if the file was successfully parsed otherwise returns null.
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace