RhinoCommon API
Transform.ProjectAlong Method
 Construct a projection onto a plane along a specific direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Transform ProjectAlong(
	Plane plane,
	Vector3d direction
)
Public Shared Function ProjectAlong (
	plane As Plane,
	direction As Vector3d
) As Transform
Parameters
plane
Type: Rhino.Geometry.Plane
Plane to project onto.
direction
Type: Rhino.Geometry.Vector3d
Projection direction, must not be parallel to the plane.
Return Value
Type: Transform
Projection transformation or identity transformation if projection could not be calculated.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace