RhinoCommon API
RhinoPageView.PageViewGroupSortIndex Method
 Gets this page view's sort index within a page view group. The sort index determines the order of the page view among the other members of the group, independent of the document page (view-table) order.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PageViewGroupSortIndex(
	int pageViewGroupIndex
)
Public Function PageViewGroupSortIndex (
	pageViewGroupIndex As Integer
) As Integer
Parameters
pageViewGroupIndex
Type: System.Int32
Zero-based index of the page view group.
Return Value
Type: Int32
 The zero-based sort index, or UnsetIntIndex when the page view is not in the group or the group is unsorted (uses page-number order).
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace