RhinoCommon API
RenderContent.GetChildSlotParameter Method
 Extra requirements are a way of specifying extra functionality on parameters in the automatic UI. Override this function to specify additional functionality for automatic UI sections or the texture summary. See IAutoUIExtraRequirements.h in the C++ RDK SDK for string definitions for the parameter names. Call the base class from your override if you do not support the extra requirement parameter. Please do not call this function. It is only retained for backward compatibility. You should instead call GetExtraRequirementParameter().
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual Object GetChildSlotParameter(
	string contentParameterName,
	string extraRequirementParameter
)
Public Overridable Function GetChildSlotParameter (
	contentParameterName As String,
	extraRequirementParameter As String
) As Object
Parameters
contentParameterName
Type: System.String
The parameter or field internal name to which this query applies.
extraRequirementParameter
Type: System.String
The extra requirement parameter, as listed in IAutoUIExtraRequirements.h in the C++ RDK SDK.
Return Value
Type: Object
 The value of the requested extra requirement parameter or null if the parameter does not exist. Current supported return values are (int, bool, float, double, string, Guid, Color, Vector3d, Point3d, DateTime).
See Also
Reference
RenderContent Class
Rhino.Render Namespace