RhinoCommon API
Field.ValueAsObject Method
[Missing <summary> documentation for "M:Rhino.Render.Fields.Field.ValueAsObject"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public abstract Object ValueAsObject()
Public MustOverride Function ValueAsObject As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.Render.Fields.Field.ValueAsObject"]
See Also
Reference
Field Class
Rhino.Render.Fields Namespace