RhinoCommon API
CommandAliasList.Update Method
 Add or modify the command aliases with a list of aliases
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void Update(
	IEnumerable<CommandAlias> aliases,
	bool replaceAll
)
Public Shared Sub Update (
	aliases As IEnumerable(Of CommandAlias),
	replaceAll As Boolean
)
Parameters
aliases
Type: System.Collections.Generic.IEnumerable<CommandAlias>
[Missing <param name="aliases"/> documentation for "M:Rhino.ApplicationSettings.CommandAliasList.Update(System.Collections.Generic.IEnumerable{Rhino.ApplicationSettings.CommandAlias},System.Boolean)"]
replaceAll
Type: System.Boolean
[Missing <param name="replaceAll"/> documentation for "M:Rhino.ApplicationSettings.CommandAliasList.Update(System.Collections.Generic.IEnumerable{Rhino.ApplicationSettings.CommandAlias},System.Boolean)"]
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace