RhinoCommon API
Dimension Constructor
Initializes a new instance of the Dimension class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Dimension()
Protected Sub New
See Also
Reference
Dimension Class
Dimension Overload
Rhino.Geometry Namespace