RhinoCommon API
Hatch.ToBrep Method
 Constructs a Brep representation of this hatch.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public Brep ToBrep()
Public Function ToBrep As Brep
Return Value
Type: Brep
A Brep representation of this hatch if successful, null otherwise.
See Also
Reference
Hatch Class
Rhino.Geometry Namespace