RhinoCommon API
Box.FurthestPoint Method
 Finds the furthest point on the boundary of this Box. The Box should be Valid for this to work properly.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d FurthestPoint(
	Point3d point
)
Public Function FurthestPoint (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
Sample point.
Return Value
Type: Point3d
The point on boundary of the the box that is furthest from the sample point.
See Also
Reference
Box Structure
Rhino.Geometry Namespace