RhinoCommon API
ThicknessAnalysisSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static ThicknessAnalysisSettingsState GetDefaultState()
Public Shared Function GetDefaultState As ThicknessAnalysisSettingsState
Return Value
Type: ThicknessAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.ThicknessAnalysisSettings.GetDefaultState"]
See Also
Reference
ThicknessAnalysisSettings Class
Rhino.ApplicationSettings Namespace