RhinoCommon API
Polyline.CreateByJoiningLines Method
 Creates polylines by joining lines.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Polyline[] CreateByJoiningLines(
	IEnumerable<Line> lines,
	double tolerance,
	bool splitAtIntersections
)
Public Shared Function CreateByJoiningLines (
	lines As IEnumerable(Of Line),
	tolerance As Double,
	splitAtIntersections As Boolean
) As Polyline()
Parameters
lines
Type: System.Collections.Generic.IEnumerable<Line>
An array, a list or any enumerable of lines.
tolerance
Type: System.Double
The threshold distance for joining lines.
splitAtIntersections
Type: System.Boolean
If true, splits lines at intersections.
Return Value
Type: Polyline[]
[Missing <returns> documentation for "M:Rhino.Geometry.Polyline.CreateByJoiningLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Double,System.Boolean)"]
See Also
Reference
Polyline Class
Rhino.Geometry Namespace