RhinoCommon API
BezierCurve.GetControlVertex4d Method
 Gets the homogeneous (4D) value of a control vertex at the specified index.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point4d GetControlVertex4d(
	int index
)
Public Function GetControlVertex4d (
	index As Integer
) As Point4d
Parameters
index
Type: System.Int32
 Control vertex index (0 <= index < ControlVertexCount).
Return Value
Type: Point4d
 The homogeneous value of the control vertex. If the Bezier is not rational, the weight is 1. Returns Unset if the index is out of range or the control vertex cannot be retrieved.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when index is out of range.
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace