RhinoCommon API
PointCloud.ClearNormals Method
 Destroys the normal vector information in this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void ClearNormals()
Public Sub ClearNormals
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace