RhinoCommon API
SubD.Offset Method
 Makes a new SubD with vertices offset at distance in the direction of the control net vertex normals. Optionally, based on the value of solidify, adds the input SubD and a ribbon of faces along any naked edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubD Offset(
	double distance,
	bool solidify
)
Public Function Offset (
	distance As Double,
	solidify As Boolean
) As SubD
Parameters
distance
Type: System.Double
The distance to offset.
solidify
Type: System.Boolean
true if the output SubD should be turned into a closed SubD.
Return Value
Type: SubD
A new SubD if successful, or null on failure.
See Also
Reference
SubD Class
Rhino.Geometry Namespace