RhinoCommon API
Mesh.DestroyPartition Method
 Destroys mesh partition.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DestroyPartition()
Public Sub DestroyPartition
See Also
Reference
Mesh Class
Rhino.Geometry Namespace