RhinoCommon API
DimensionStyle.CopyFrom Method
 Copy settings from source dimension style without changing the name, Id or index of this DimensionStyle.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void CopyFrom(
	DimensionStyle source
)
Public Sub CopyFrom (
	source As DimensionStyle
)
Parameters
source
Type: Rhino.DocObjects.DimensionStyle
 DimensionStyle to copy settings from.
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace