RhinoCommon API
GetCurve.GetInterpolatedCurve Method
 Interactively picks the points an interpolated curve passes through. This is what the Rhino InterpCrv command uses.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Result GetInterpolatedCurve(
	out NurbsCurve curve
)
Public Function GetInterpolatedCurve (
	<OutAttribute> ByRef curve As NurbsCurve
) As Result
Parameters
curve
Type: Rhino.Geometry.NurbsCurve
The resulting curve, or null when the result is not Success.
Return Value
Type: Result
The command result.
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace