RhinoCommon API
RenderSettings.RenderEnvironmentOverride Method
 For usage background, this checks if the background style is set to 'Environment'. For reflection and skylighting, it checks if the relevant custom override is enabled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool RenderEnvironmentOverride(
	RenderSettings.EnvironmentUsage usage
)
Public Function RenderEnvironmentOverride (
	usage As RenderSettings.EnvironmentUsage
) As Boolean
Parameters
usage
Type: Rhino.Render.RenderSettings.EnvironmentUsage
[Missing <param name="usage"/> documentation for "M:Rhino.Render.RenderSettings.RenderEnvironmentOverride(Rhino.Render.RenderSettings.EnvironmentUsage)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderSettings.RenderEnvironmentOverride(Rhino.Render.RenderSettings.EnvironmentUsage)"]
See Also
Reference
RenderSettings Class
Rhino.Render Namespace