RhinoCommon API
IZooClientUtilities2.ValidateStandaloneLicense Method
 RH-92777: Validates a stand-alone license key for the given account email against the validation server, asking the user for no input (progress and any server-reported problems are shown by the validation wizard). Returns true on success.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.34
Syntax
bool ValidateStandaloneLicense(
	Object verify,
	ZooClientParameters parameters,
	string licenseKey,
	string email
)
Function ValidateStandaloneLicense (
	verify As Object,
	parameters As ZooClientParameters,
	licenseKey As String,
	email As String
) As Boolean
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities2.ValidateStandaloneLicense(System.Object,Rhino.Runtime.ZooClientParameters,System.String,System.String)"]
parameters
Type: Rhino.Runtime.ZooClientParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Runtime.IZooClientUtilities2.ValidateStandaloneLicense(System.Object,Rhino.Runtime.ZooClientParameters,System.String,System.String)"]
licenseKey
Type: System.String
[Missing <param name="licenseKey"/> documentation for "M:Rhino.Runtime.IZooClientUtilities2.ValidateStandaloneLicense(System.Object,Rhino.Runtime.ZooClientParameters,System.String,System.String)"]
email
Type: System.String
[Missing <param name="email"/> documentation for "M:Rhino.Runtime.IZooClientUtilities2.ValidateStandaloneLicense(System.Object,Rhino.Runtime.ZooClientParameters,System.String,System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities2.ValidateStandaloneLicense(System.Object,Rhino.Runtime.ZooClientParameters,System.String,System.String)"]
See Also
Reference
IZooClientUtilities2 Interface
Rhino.Runtime Namespace