RhinoCommon API
IRhRdkThumbnailList.Clear Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Clear"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void Clear()
Sub Clear
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace