RhinoCommon API
ArchivableDictionary Constructor (UserData)
Initializes an instance of a dictionary for writing to a 3dm archive
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ArchivableDictionary(
	UserData parentUserData
)
Public Sub New (
	parentUserData As UserData
)
Parameters
parentUserData
Type: Rhino.DocObjects.Custom.UserData
 parent user data if this dictionary is associated with user data
See Also
Reference
ArchivableDictionary Class
ArchivableDictionary Overload
Rhino.Collections Namespace