RhinoCommon API
ComponentFunctionInfo.InvokeSilenceWarnings Method
 Runs Evaluate(IEnumerable, Boolean, String[]) with keepTree equal to false, then simplifies output with SimplifyTreeOutput(Object[], String[], Boolean) and discards warnings (this is a dangerous operation!).
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Object[] InvokeSilenceWarnings(
	params Object[] args
)
Public Function InvokeSilenceWarnings (
	ParamArray args As Object()
) As Object()
Parameters
args
Type: System.Object[]
Arguments. One for each component input.
Return Value
Type: Object[]
Items.
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace