RhinoCommon API
SubD.ToBrep Method (SubDToBrepOptions)
 Create a Brep based on this SubD geometry.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Brep ToBrep(
	SubDToBrepOptions options
)
Public Function ToBrep (
	options As SubDToBrepOptions
) As Brep
Parameters
options
Type: Rhino.Geometry.SubDToBrepOptions
 The SubD to Brep conversion options. Use SubDToBrepOptions.Default for sensible defaults. Currently, these return unpacked faces and locally-G1 vertices in the output Brep.
Return Value
Type: Brep
A new Brep if successful, or null on failure.
See Also
Reference
SubD Class
ToBrep Overload
Rhino.Geometry Namespace