RhinoCommon API
ICollapsibleSection2.NewHeaderButtonHandler Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ICollapsibleSection2.NewHeaderButtonHandler"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
IHeaderButtonHandler NewHeaderButtonHandler()
Function NewHeaderButtonHandler As IHeaderButtonHandler
Return Value
Type: IHeaderButtonHandler
[Missing <returns> documentation for "M:Rhino.UI.Controls.ICollapsibleSection2.NewHeaderButtonHandler"]
See Also
Reference
ICollapsibleSection2 Interface
Rhino.UI.Controls Namespace