RhinoCommon API
Utilities.ShowIORMenu Method
 Display and track the context menu.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool ShowIORMenu(
	IntPtr hwnd,
	Point pt,
	ref double outIOR,
	ref string outString
)
Public Shared Function ShowIORMenu (
	hwnd As IntPtr,
	pt As Point,
	ByRef outIOR As Double,
	ByRef outString As String
) As Boolean
Parameters
hwnd
Type: System.IntPtr
The window that displays the menu, for example an edit box.
pt
Type: System.Drawing.Point
The position to display the menu at inside the window
outIOR
Type: System.Double
Accepts the IOR value of the user's chosen substance
outString
Type: System.String
Accepts the name of the user's chosen substance. Can be null if not required.
Return Value
Type: Boolean
true if the function showed the IOR menu and something was picked.
See Also
Reference
Utilities Class
Rhino.Render Namespace