RhinoCommon API
BrepLoopList.Add Method (BrepLoopType)
 Create a new empty boundary loop. The new loop will not be part of a face and will not include any trim curves.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public BrepLoop Add(
	BrepLoopType loopType
)
Public Function Add (
	loopType As BrepLoopType
) As BrepLoop
Parameters
loopType
Type: Rhino.Geometry.BrepLoopType
[Missing <param name="loopType"/> documentation for "M:Rhino.Geometry.Collections.BrepLoopList.Add(Rhino.Geometry.BrepLoopType)"]
Return Value
Type: BrepLoop
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.BrepLoopList.Add(Rhino.Geometry.BrepLoopType)"]
See Also
Reference
BrepLoopList Class
Add Overload
Rhino.Geometry.Collections Namespace