RhinoCommon API
BrepEdgeList.RemoveNakedMicroEdges Method (Double, Boolean)
 Finds any naked edges with the same start and end vertex and an arc-length less than tolerance and attempts to remove them by removing trims and extending the adjacent to meet.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int RemoveNakedMicroEdges(
	double tolerance,
	bool cleanUp
)
Public Function RemoveNakedMicroEdges (
	tolerance As Double,
	cleanUp As Boolean
) As Integer
Parameters
tolerance
Type: System.Double
The tolerance. When in doubt, use the document's model absolute tolerance.
cleanUp
Type: System.Boolean
 If true, then the method cleans up the Brep by setting tolerances, boxes, flags, and then compacts. If false, then the caller should do this at some point.
Return Value
Type: Int32
The number of naked micro edges that were removed.
See Also
Reference
BrepEdgeList Class
RemoveNakedMicroEdges Overload
Rhino.Geometry.Collections Namespace