RhinoCommon API
ChangeQueue.CrcFromGuid Method
 Helper function to get a CRC from a Guid.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static uint CrcFromGuid(
	Guid guid
)
Public Shared Function CrcFromGuid (
	guid As Guid
) As UInteger
Parameters
guid
Type: System.Guid
[Missing <param name="guid"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.CrcFromGuid(System.Guid)"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.CrcFromGuid(System.Guid)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace