RhinoCommon API
SubDSurfaceInterpolator Constructor
 Initialize an empty SubDSurfaceInterpolator.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public SubDSurfaceInterpolator()
Public Sub New
See Also
Reference
SubDSurfaceInterpolator Class
Rhino.Geometry Namespace