RhinoCommon API
Brep.CreateFromSweep Method (Curve, Curve, IEnumerable<Curve>, Point3d, Point3d, Boolean, Double, SweepRebuild, Int32, Double, Boolean, Boolean)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines the surface edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.19
Syntax
public static Brep[] CreateFromSweep(
	Curve rail1,
	Curve rail2,
	IEnumerable<Curve> shapes,
	Point3d start,
	Point3d end,
	bool closed,
	double tolerance,
	SweepRebuild rebuild,
	int rebuildPointCount,
	double refitTolerance,
	bool preserveHeight,
	bool autoAdjust
)
Public Shared Function CreateFromSweep (
	rail1 As Curve,
	rail2 As Curve,
	shapes As IEnumerable(Of Curve),
	start As Point3d,
	end As Point3d,
	closed As Boolean,
	tolerance As Double,
	rebuild As SweepRebuild,
	rebuildPointCount As Integer,
	refitTolerance As Double,
	preserveHeight As Boolean,
	autoAdjust As Boolean
) As Brep()
Parameters
rail1
Type: Rhino.Geometry.Curve
Rail to sweep shapes along
rail2
Type: Rhino.Geometry.Curve
Rail to sweep shapes along
shapes
Type: System.Collections.Generic.IEnumerable<Curve>
Shape curves
start
Type: Rhino.Geometry.Point3d
Optional starting point of sweep. Use Point3d.Unset if you do not want to include a start point.
end
Type: Rhino.Geometry.Point3d
Optional ending point of sweep. Use Point3d.Unset if you do not want to include an end point.
closed
Type: System.Boolean
Only matters if shapes are closed.
tolerance
Type: System.Double
Tolerance for fitting surface and rails.
rebuild
Type: Rhino.Geometry.SweepRebuild
The rebuild style.
rebuildPointCount
Type: System.Int32
If rebuild == SweepRebuild.Rebuild, the number of points. Otherwise specify 0.
refitTolerance
Type: System.Double
If rebuild == SweepRebuild.Refit, the refit tolerance. Otherwise, specify 0.0
preserveHeight
Type: System.Boolean
Removes the association between the height scaling from the width scaling
autoAdjust
Type: System.Boolean
 Set to true to have shape curves adjusted, sorted, and matched automatically. This will produce results comparable to Rhino's Sweep2 command. Set to false to not have shape curves adjusted, sorted, and matched automatically.
Return Value
Type: Brep[]
Array of Brep sweep results
See Also
Reference
Brep Class
CreateFromSweep Overload
Rhino.Geometry Namespace