RhinoCommon API
GroupTable.IsDeleted Method
 Verifies a group is deleted.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsDeleted(
	int groupIndex
)
Public Function IsDeleted (
	groupIndex As Integer
) As Boolean
Parameters
groupIndex
Type: System.Int32
The index of the group.
Return Value
Type: Boolean
true if the group is deleted, false otherwise.
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace