RhinoCommon API
SimpleArrayLine Constructor (IEnumerable<Line>)
 Initializes a new SimpleArrayLine instance from a set of lines
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SimpleArrayLine(
	IEnumerable<Line> lines
)
Public Sub New (
	lines As IEnumerable(Of Line)
)
Parameters
lines
Type: System.Collections.Generic.IEnumerable<Line>
See Also
Reference
SimpleArrayLine Class
SimpleArrayLine Overload
Rhino.Runtime.InteropWrappers Namespace