RhinoCommon API
RhinoObject.MeshObjects Method (IEnumerable<RhinoObject>, MeshingParameters, Int32, Transform, Mesh[], ObjectAttributes[])
Meshes Rhino objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Result MeshObjects(
	IEnumerable<RhinoObject> rhinoObjects,
	ref MeshingParameters parameters,
	ref int uiStyle,
	Transform xform,
	out Mesh[] meshes,
	out ObjectAttributes[] attributes
)
Public Shared Function MeshObjects (
	rhinoObjects As IEnumerable(Of RhinoObject),
	ByRef parameters As MeshingParameters,
	ByRef uiStyle As Integer,
	xform As Transform,
	<OutAttribute> ByRef meshes As Mesh(),
	<OutAttribute> ByRef attributes As ObjectAttributes()
) As Result
Parameters
rhinoObjects
Type: System.Collections.Generic.IEnumerable<RhinoObject>
The Rhino objects to mesh.
parameters
Type: Rhino.Geometry.MeshingParameters
The parameters used to create the meshes. The meshing parameters may change.
uiStyle
Type: System.Int32
The user interface style, where: -1 = no interface, 0 = simple dialog, 1 = details dialog, 2 = script or batch mode
xform
Type: Rhino.Geometry.Transform
Transform to be used for export with origin, or Z to Y up, etc.
meshes
Type: Rhino.Geometry.Mesh[]
The created meshes are appended to this array.
attributes
Type: Rhino.DocObjects.ObjectAttributes[]
The object attributes that coincide with each created mesh are appended to this array.
Return Value
Type: Result
The results of the calculation.
See Also
Reference
RhinoObject Class
MeshObjects Overload
Rhino.DocObjects Namespace