RhinoCommon API
RenderContent.SetExtraRequirementParameter Method
 Extra requirements are a way of specifying extra functionality on parameters in the automatic UI. See IAutoUIExtraRequirements.h in the C++ RDK SDK for string definitions for the parameter names.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public bool SetExtraRequirementParameter(
	string contentParameterName,
	string extraRequirementParameter,
	Object value,
	RenderContent.ExtraRequirementsSetContexts sc
)
Public Function SetExtraRequirementParameter (
	contentParameterName As String,
	extraRequirementParameter As String,
	value As Object,
	sc As RenderContent.ExtraRequirementsSetContexts
) As Boolean
Parameters
contentParameterName
Type: System.String
The parameter or field internal name to which this query applies.
extraRequirementParameter
Type: System.String
The extra requirement parameter, as listed in IAutoUIExtraRequirements.h in the C++ RDK SDK.
value
Type: System.Object
The value to set this extra requirement parameter. You will typically use System.Convert to convert the value to the type you need.
sc
Type: Rhino.Render.RenderContent.ExtraRequirementsSetContexts
The context of this operation.
Return Value
Type: Boolean
true if successful, else false.
See Also
Reference
RenderContent Class
Rhino.Render Namespace