RhinoCommon API
GetEllipsoid Constructor
Initializes a new instance of the GetEllipsoid class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public GetEllipsoid()
Public Sub New
See Also
Reference
GetEllipsoid Class
Rhino.Input.Custom Namespace