RhinoCommon API
SimpleArrayMeshFace Constructor
 Initializes a new SimpleArrayMeshFace instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public SimpleArrayMeshFace()
Public Sub New
See Also
Reference
SimpleArrayMeshFace Class
Rhino.Runtime.InteropWrappers Namespace