RhinoCommon API
Mesh.CreateBooleanUnion Method (IEnumerable<Mesh>, MeshBooleanOptions, Result)
 Computes the solid union of a set of meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Mesh[] CreateBooleanUnion(
	IEnumerable<Mesh> meshes,
	MeshBooleanOptions options,
	out Result commandResult
)
Public Shared Function CreateBooleanUnion (
	meshes As IEnumerable(Of Mesh),
	options As MeshBooleanOptions,
	<OutAttribute> ByRef commandResult As Result
) As Mesh()
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
Meshes to union.
options
Type: Rhino.Geometry.MeshBooleanOptions
An option instance. Can be null, but generally it should be instantiated and have a tolerance set.
commandResult
Type: Rhino.Commands.Result
A value indicating if the function was successful, or if it was cancelled, or if it did nothing, or failed.
Return Value
Type: Mesh[]
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.MeshBooleanOptions,Rhino.Commands.Result@)"]
See Also
Reference
Mesh Class
CreateBooleanUnion Overload
Rhino.Geometry Namespace