RhinoCommon API
SweepTwoRail.PerformSweepRebuild Method (Curve, Curve, Curve, Int32)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep[] PerformSweepRebuild(
	Curve rail1,
	Curve rail2,
	Curve crossSection,
	int rebuildCount
)
Public Function PerformSweepRebuild (
	rail1 As Curve,
	rail2 As Curve,
	crossSection As Curve,
	rebuildCount As Integer
) As Brep()
Parameters
rail1
Type: Rhino.Geometry.Curve
Rail to sweep shapes along.
rail2
Type: Rhino.Geometry.Curve
Rail to sweep shapes along.
crossSection
Type: Rhino.Geometry.Curve
Shape curve.
rebuildCount
Type: System.Int32
Rebuild point count.
Return Value
Type: Brep[]
Array of Brep sweep results.
See Also
Reference
SweepTwoRail Class
PerformSweepRebuild Overload
Rhino.Geometry Namespace