RhinoCommon API
FieldDictionary.Add Method (String, DateTime)
 Add a new DateTimeField to the dictionary. This will be a data only field and not show up in the content browsers.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public DateTimeField Add(
	string key,
	DateTime value
)
Public Function Add (
	key As String,
	value As DateTime
) As DateTimeField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: System.DateTime
Initial value for this field.
Return Value
Type: DateTimeField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,System.DateTime)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace