RhinoCommon API
ComponentFunctionInfo.InvokeKeepTree Method
 Runs Evaluate(IEnumerable, Boolean, String[]) with keepTree equal to true and raises an exception on the first warning.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Object[] InvokeKeepTree(
	params Object[] args
)
Public Function InvokeKeepTree (
	ParamArray args As Object()
) As Object()
Parameters
args
Type: System.Object[]
Arguments. One for each component input.
Return Value
Type: Object[]
Items.
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace