RhinoCommon API
ViewUserInterfaceTable.Remove Method (UserInterfaceObjectBase)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Remove(Rhino.UI.UserInterfaceObjectBase)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Remove(
	UserInterfaceObjectBase item
)
Public Function Remove (
	item As UserInterfaceObjectBase
) As Integer
Parameters
item
Type: Rhino.UI.UserInterfaceObjectBase
[Missing <param name="item"/> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Remove(Rhino.UI.UserInterfaceObjectBase)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Remove(Rhino.UI.UserInterfaceObjectBase)"]
See Also
Reference
ViewUserInterfaceTable Class
Remove Overload
Rhino.DocObjects.Tables Namespace