RhinoCommon API
FieldDictionary.TryGetValue Method (String, Point2d)
 Find a field with the specified key and get its value if found.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public bool TryGetValue(
	string key,
	out Point2d value
)
Public Function TryGetValue (
	key As String,
	<OutAttribute> ByRef value As Point2d
) As Boolean
Parameters
key
Type: System.String
Key name of the field to get a value for.
value
Type: Rhino.Geometry.Point2d
Output parameter which will receive the field value.
Return Value
Type: Boolean
 Returns true if the key is found and the value parameter is set to the field value. Returns false if the field was not found.
See Also
Reference
FieldDictionary Class
TryGetValue Overload
Rhino.Render.Fields Namespace