RhinoCommon API
File3dmDisplacement.SetSubItemOn Method
 Sets the override for displacement 'on'. face_index is the index of the face on the polysurface/SubD.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetSubItemOn(
	int face_index,
	bool on
)
Public Sub SetSubItemOn (
	face_index As Integer,
	on As Boolean
)
Parameters
face_index
Type: System.Int32
[Missing <param name="face_index"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.SetSubItemOn(System.Int32,System.Boolean)"]
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.SetSubItemOn(System.Int32,System.Boolean)"]
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace