RhinoCommon API
UserInterfaceLabel Constructor
Initializes a new instance of the UserInterfaceLabel class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceLabel()
Public Sub New
See Also
Reference
UserInterfaceLabel Class
UserInterfaceLabel Overload
Rhino.UI Namespace