RhinoCommon API
ChangeQueue.EnvironmentIdForUsage Method
 Get RenderEnvironment RenderHash for given usage.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint EnvironmentIdForUsage(
	RenderEnvironment.Usage usage
)
Public Function EnvironmentIdForUsage (
	usage As RenderEnvironment.Usage
) As UInteger
Parameters
usage
Type: Rhino.Render.RenderEnvironment.Usage
[Missing <param name="usage"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.EnvironmentIdForUsage(Rhino.Render.RenderEnvironment.Usage)"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.EnvironmentIdForUsage(Rhino.Render.RenderEnvironment.Usage)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace