RhinoCommon API
Dialogs.ShowLineTypes Method (String, String, RhinoDoc)
 Displays Rhino's LineType list box.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public static Object ShowLineTypes(
	string title,
	string message,
	RhinoDoc doc
)
Public Shared Function ShowLineTypes (
	title As String,
	message As String,
	doc As RhinoDoc
) As Object
Parameters
title
Type: System.String
The dialog title.
message
Type: System.String
The dialog message.
doc
Type: Rhino.RhinoDoc
The active document.
Return Value
Type: Object
The id of the selected item if successful, null on cancel.
See Also
Reference
Dialogs Class
ShowLineTypes Overload
Rhino.UI Namespace