RhinoCommon API
RealtimeDisplayMode.IsCompleted Method
 Implement to tell if your render engine has completed a frame for drawing into the viewport
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool IsCompleted()
Public MustOverride Function IsCompleted As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.IsCompleted"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace