RhinoCommon API
NurbsCurvePointList.CopyTo Method
 Copied the list to an array.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void CopyTo(
	ControlPoint[] array,
	int arrayIndex
)
Public Sub CopyTo (
	array As ControlPoint(),
	arrayIndex As Integer
)
Parameters
array
Type: Rhino.Geometry.ControlPoint[]
The array to copy to.
arrayIndex
Type: System.Int32
The index in which the copy will begin.
Implements
ICollection<T>.CopyTo(T[], Int32)
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace