RhinoCommon API
Brep.CreateBlendShape Method
 Makes a curve blend between points on two surface edges. The blend will be tangent to the surfaces and perpendicular to the edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Curve CreateBlendShape(
	BrepFace face0,
	BrepEdge edge0,
	double t0,
	bool rev0,
	BlendContinuity continuity0,
	BrepFace face1,
	BrepEdge edge1,
	double t1,
	bool rev1,
	BlendContinuity continuity1
)
Public Shared Function CreateBlendShape (
	face0 As BrepFace,
	edge0 As BrepEdge,
	t0 As Double,
	rev0 As Boolean,
	continuity0 As BlendContinuity,
	face1 As BrepFace,
	edge1 As BrepEdge,
	t1 As Double,
	rev1 As Boolean,
	continuity1 As BlendContinuity
) As Curve
Parameters
face0
Type: Rhino.Geometry.BrepFace
First face to blend from.
edge0
Type: Rhino.Geometry.BrepEdge
First edge to blend from.
t0
Type: System.Double
Location on first edge for first end of blend curve.
rev0
Type: System.Boolean
If false, edge0 will be used in its natural direction. If true, edge0 will be used in the reversed direction.
continuity0
Type: Rhino.Geometry.BlendContinuity
Continuity for the blend at the start.
face1
Type: Rhino.Geometry.BrepFace
Second face to blend from.
edge1
Type: Rhino.Geometry.BrepEdge
Second edge to blend from.
t1
Type: System.Double
Location on second edge for second end of blend curve.
rev1
Type: System.Boolean
If false, edge1 will be used in its natural direction. If true, edge1 will be used in the reversed direction.
continuity1
Type: Rhino.Geometry.BlendContinuity
>Continuity for the blend at the end.
Return Value
Type: Curve
The blend curve on success. null on failure
See Also
Reference
Brep Class
Rhino.Geometry Namespace