RhinoCommon API
Triangle3d.PointOnInterior Method
 Gets the point on the triangle using the AB and AC primary axes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Point3d PointOnInterior(
	double u,
	double v
)
Public Function PointOnInterior (
	u As Double,
	v As Double
) As Point3d
Parameters
u
Type: System.Double
Parameter along the AB edge.
v
Type: System.Double
Parameter along the AC edge.
Return Value
Type: Point3d
Point at parameter.
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace