RhinoCommon API
AreaMassProperties.WeightedSum Method
 Sum a list of mass properties together to get an aggregate mass, weighting each by a density factor.Ignores existing mass properties in this object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static AreaMassProperties WeightedSum(
	IEnumerable<AreaMassProperties> summands,
	IEnumerable<double> weights
)
Public Shared Function WeightedSum (
	summands As IEnumerable(Of AreaMassProperties),
	weights As IEnumerable(Of Double)
) As AreaMassProperties
Parameters
summands
Type: System.Collections.Generic.IEnumerable<AreaMassProperties>
An array of mass properties to add.
weights
Type: System.Collections.Generic.IEnumerable<Double>
An array of non-negative densities, of the same length as summands.
Return Value
Type: AreaMassProperties
An AreaMassProperties containing the result if successful, null if a failure occurs.
Exceptions
Exception | Condition
ArgumentNullException | When summands or weights is null.
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace