RhinoCommon API
SubDEdgeChain.Dispose Method
 Frees the unmanaged chain.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace