RhinoCommon API
GumballDisplayConduit.UpdateGumball Method (Plane)
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.UpdateGumball(Rhino.Geometry.Plane)"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.19
Syntax
public bool UpdateGumball(
	Plane frame
)
Public Function UpdateGumball (
	frame As Plane
) As Boolean
Parameters
frame
Type: Rhino.Geometry.Plane
[Missing <param name="frame"/> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.UpdateGumball(Rhino.Geometry.Plane)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.UpdateGumball(Rhino.Geometry.Plane)"]
See Also
Reference
GumballDisplayConduit Class
UpdateGumball Overload
Rhino.UI.Gumball Namespace