RhinoCommon API
Point3dList.Duplicate Method
 Returns a deep copy of this point list instance.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point3dList Duplicate()
Public Function Duplicate As Point3dList
Return Value
Type: Point3dList
The duplicated list.
See Also
Reference
Point3dList Class
Rhino.Collections Namespace