RhinoCommon API
RhinoApp.RefreshScreen Method
 Request OS to update UI on screen.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static void RefreshScreen()
Public Shared Sub RefreshScreen
See Also
Reference
RhinoApp Class
Rhino Namespace