RhinoCommon API
PostEffect.RegisterPostEffect Method (PlugIn)
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffect.RegisterPostEffect(Rhino.PlugIns.PlugIn)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Type[] RegisterPostEffect(
	PlugIn plugin
)
Public Shared Function RegisterPostEffect (
	plugin As PlugIn
) As Type()
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.PostEffects.PostEffect.RegisterPostEffect(Rhino.PlugIns.PlugIn)"]
Return Value
Type: Type[]
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffect.RegisterPostEffect(Rhino.PlugIns.PlugIn)"]
See Also
Reference
PostEffect Class
RegisterPostEffect Overload
Rhino.Render.PostEffects Namespace