RhinoCommon API
BrepTrimList.MatchEnds Method (BrepTrim, BrepTrim)
 Match the end of a trim to the start of the next trim.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.19
Syntax
public bool MatchEnds(
	BrepTrim trim0,
	BrepTrim trim1
)
Public Function MatchEnds (
	trim0 As BrepTrim,
	trim1 As BrepTrim
) As Boolean
Parameters
trim0
Type: Rhino.Geometry.BrepTrim
The Brep trim.
trim1
Type: Rhino.Geometry.BrepTrim
Brep trim that comes immediately after trim0 in the same loop.
Return Value
Type: Boolean
true if either trim's 2d curve is changed, false otherwise.
See Also
Reference
BrepTrimList Class
MatchEnds Overload
Rhino.Geometry.Collections Namespace