RhinoCommon API
RhinoViewport.ChangeToParallelReflectedProjection Method
 When a viewport is set to Parallel Reflected projection, the geometry on the ceiling is shown as if it is mirrored to the floor below.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public bool ChangeToParallelReflectedProjection()
Public Function ChangeToParallelReflectedProjection As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.ChangeToParallelReflectedProjection"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace