RhinoCommon API
MeshingParameters.GetObjectData Method
Populates a SerializationInfo with the data needed to serialize the target object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
Public Sub GetObjectData (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
The SerializationInfo to populate with data.
context
Type: System.Runtime.Serialization.StreamingContext
The destination (see StreamingContext) for this serialization.
Implements
ISerializable.GetObjectData(SerializationInfo, StreamingContext)
Exceptions
Exception | Condition
SecurityException | The caller does not have the required permission.
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace