RhinoCommon API
WorksessionFile.ToByteArray Method
Writes the worksession as the contents of a version 5 .rws file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public byte[] ToByteArray()
Public Function ToByteArray As Byte()
Return Value
Type: Byte[]
The file contents, or null if the worksession could not be written.
See Also
Reference
WorksessionFile Class
ToByteArray Overload
Rhino.FileIO Namespace