RhinoCommon API
BrepEdgeList.RemoveNakedMicroEdges Method (Double)
 Finds any naked edges with the same start and end vertex and an arc-length less than tolerance and attempts to remove them by removing trims and extending the adjacent to meet.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int RemoveNakedMicroEdges(
	double tolerance
)
Public Function RemoveNakedMicroEdges (
	tolerance As Double
) As Integer
Parameters
tolerance
Type: System.Double
The tolerance. When in doubt, use the document's model absolute tolerance.
Return Value
Type: Int32
The number of naked micro edges that were removed.
See Also
Reference
BrepEdgeList Class
RemoveNakedMicroEdges Overload
Rhino.Geometry.Collections Namespace