RhinoCommon API
IRhinoUiDialogService.IconFromResourceId Method
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.IconFromResourceId(System.Reflection.Assembly,System.String)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
Icon IconFromResourceId(
	Assembly iconAssembly,
	string iconResourceId
)
Function IconFromResourceId (
	iconAssembly As Assembly,
	iconResourceId As String
) As Icon
Parameters
iconAssembly
Type: System.Reflection.Assembly
[Missing <param name="iconAssembly"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.IconFromResourceId(System.Reflection.Assembly,System.String)"]
iconResourceId
Type: System.String
[Missing <param name="iconResourceId"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.IconFromResourceId(System.Reflection.Assembly,System.String)"]
Return Value
Type: Icon
[Missing <returns> documentation for "M:Rhino.UI.IRhinoUiDialogService.IconFromResourceId(System.Reflection.Assembly,System.String)"]
See Also
Reference
IRhinoUiDialogService Interface
Rhino.UI Namespace