RhinoCommon API
UserInterfaceObjectBase.OnMouseDown Method
 Called when the mouse goes down on this object
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnMouseDown(
	MouseState mouse
)
Protected Overridable Sub OnMouseDown (
	mouse As MouseState
)
Parameters
mouse
Type: Rhino.UI.MouseState
 Current mouse state when this event occurs
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace