RhinoCommon API
Instance.Dispose Method (Boolean)
 Dispose method.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool isDisposing
)
Protected Overridable Sub Dispose (
	isDisposing As Boolean
)
Parameters
isDisposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
Instance Class
Dispose Overload
Rhino.Render.CustomRenderMeshes Namespace