RhinoCommon API
NamedConstructionPlaneTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.NamedConstructionPlaneTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IEnumerator<ConstructionPlane> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of ConstructionPlane)
Return Value
Type: IEnumerator<ConstructionPlane>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedConstructionPlaneTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
NamedConstructionPlaneTable Class
Rhino.DocObjects.Tables Namespace