RhinoCommon API
GetBaseClass.AcceptCustomMessage Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetBaseClass.AcceptCustomMessage(System.Boolean)"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void AcceptCustomMessage(
	bool enable
)
Public Sub AcceptCustomMessage (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
[Missing <param name="enable"/> documentation for "M:Rhino.Input.Custom.GetBaseClass.AcceptCustomMessage(System.Boolean)"]
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace