RhinoCommon API
BrepEdgeList.MergeAllEdges Method
 Merges all possible Brep edges. Edges across kinks cannot be merged. A pair of adjacent edges in a Brep are mergeable if the angle between them is less than tolerance and the valence of the shared vertex is 2.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.23
Syntax
public int MergeAllEdges(
	double angleTolerance
)
Public Function MergeAllEdges (
	angleTolerance As Double
) As Integer
Parameters
angleTolerance
Type: System.Double
The maximum allowable difference of angle in radian between adjacent edges that can be merged.
Return Value
Type: Int32
The number of edges merged.
See Also
Reference
BrepEdgeList Class
Rhino.Geometry.Collections Namespace