RhinoCommon API
ExpandableContentUI.AddSection Method (ICollapsibleSection)
 Add a section to the UI. Called \e before Create(). A generic controller is attached.
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public virtual void AddSection(
	ICollapsibleSection pSection
)
Public Overridable Sub AddSection (
	pSection As ICollapsibleSection
)
Parameters
pSection
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="pSection"/> documentation for "M:Rhino.UI.Controls.ExpandableContentUI.AddSection(Rhino.UI.Controls.ICollapsibleSection)"]
See Also
Reference
ExpandableContentUI Class
AddSection Overload
Rhino.UI.Controls Namespace