RhinoCommon API
SubD.CopyEvaluationCache Method
 Expert function that copies cached evaluations of component subdivision points and limit surface information from src to this. Typically this is done for performance critical situations like control point editing: - Copy a SubD to be modified (this does not copy the evaluation cache) - Copy the evaluation cache from the unmodified SubD - Modify the SubD copy - Update the surface mesh cache so that only the modified parts are recalculated - Display, meshing, bounding boxes on the modified SubD are now available
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public bool CopyEvaluationCache(
	 in SubD src
)
Public Function CopyEvaluationCache (
	 ByRef src As SubD
) As Boolean
Parameters
src
Type: Rhino.Geometry.SubD
The SubD from which to copy cached evaluations
Return Value
Type: Boolean
True if the cache was fully copied, false otherwise
See Also
Reference
SubD Class
Rhino.Geometry Namespace
SubD.ClearEvaluationCache()
SubD.UpdateSurfaceMeshCache(Boolean)