RhinoCommon API
FieldDictionary.Add Method (String, Double, String)
 Add a new DoubleField to the dictionary.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public DoubleField Add(
	string key,
	double value,
	string prompt
)
Public Function Add (
	key As String,
	value As Double,
	prompt As String
) As DoubleField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
value
Type: System.Double
Initial value for this field.
prompt
Type: System.String
 Prompt to display in the user interface (Content Browsers) if this is null or an empty string the this field is a data only field and will not appear in the user interface.
Return Value
Type: DoubleField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Double,System.String)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace