RhinoCommon API
Mesh.CreateQuadSphere Method
 Constructs a quad mesh sphere. A quad mesh sphere differs from a standard UV mesh sphere in that it's vertices are evenly distributed. A quad mesh sphere starts from a cube (a regular polyhedron with 6 square sides). It is then refined by splitting each quad into 4 smaller quads. This splitting can be done several times.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Mesh CreateQuadSphere(
	Sphere sphere,
	int subdivisions
)
Public Shared Function CreateQuadSphere (
	sphere As Sphere,
	subdivisions As Integer
) As Mesh
Parameters
sphere
Type: Rhino.Geometry.Sphere
The input sphere provides the orienting plane and radius.
subdivisions
Type: System.Int32
 The number of times you want the faces split, where 0 <= subdivisions <= 8. Note, the total number of mesh faces produces is: 6 * (4 ^ subdivisions)
Return Value
Type: Mesh
A welded quad mesh sphere if successful, or null on failure.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace