RhinoCommon API
IntersectionEvent Constructor
Initializes a new instance of the IntersectionEvent class
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntersectionEvent()
Public Sub New
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace