RhinoCommon API
UserInterfaceSlider.OnValueChanged Method
 Called when the slider's value changes. The default implementation calls the ValueChanged event
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnValueChanged()
Protected Overridable Sub OnValueChanged
See Also
Reference
UserInterfaceSlider Class
Rhino.UI Namespace