RhinoCommon API
FileTypeList Constructor (String, String, Boolean)
Initializes a new instance of the FileTypeList class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public FileTypeList(
	string description,
	string extension,
	bool showOptionsButtonInFileDialog
)
Public Sub New (
	description As String,
	extension As String,
	showOptionsButtonInFileDialog As Boolean
)
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.PlugIns.FileTypeList.#ctor(System.String,System.String,System.Boolean)"]
extension
Type: System.String
[Missing <param name="extension"/> documentation for "M:Rhino.PlugIns.FileTypeList.#ctor(System.String,System.String,System.Boolean)"]
showOptionsButtonInFileDialog
Type: System.Boolean
[Missing <param name="showOptionsButtonInFileDialog"/> documentation for "M:Rhino.PlugIns.FileTypeList.#ctor(System.String,System.String,System.Boolean)"]
See Also
Reference
FileTypeList Class
FileTypeList Overload
Rhino.PlugIns Namespace