RhinoCommon API
ColorRGBA Constructor (Double, Double, Double)
Initializes a new instance of the ColorRGBA class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public ColorRGBA(
	double red,
	double green,
	double blue
)
Public Sub New (
	red As Double,
	green As Double,
	blue As Double
)
Parameters
red
Type: System.Double
[Missing <param name="red"/> documentation for "M:Rhino.Display.ColorRGBA.#ctor(System.Double,System.Double,System.Double)"]
green
Type: System.Double
[Missing <param name="green"/> documentation for "M:Rhino.Display.ColorRGBA.#ctor(System.Double,System.Double,System.Double)"]
blue
Type: System.Double
[Missing <param name="blue"/> documentation for "M:Rhino.Display.ColorRGBA.#ctor(System.Double,System.Double,System.Double)"]
See Also
Reference
ColorRGBA Structure
ColorRGBA Overload
Rhino.Display Namespace