RhinoCommon API
RenderContent.UseCount Method
 UseCount returns how many times the content is used
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.9
Syntax
public int UseCount()
Public Function UseCount As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.UseCount"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace