RhinoCommon API
ConvertibleExtensions.ToVector3d Method
[Missing <summary> documentation for "M:Rhino.Render.ConvertibleExtensions.ToVector3d(System.IConvertible)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Vector3d ToVector3d(
	this IConvertible variant
)
<ExtensionAttribute>
Public Shared Function ToVector3d (
	variant As IConvertible
) As Vector3d
Parameters
variant
Type: System.IConvertible
[Missing <param name="variant"/> documentation for "M:Rhino.Render.ConvertibleExtensions.ToVector3d(System.IConvertible)"]
Return Value
Type: Vector3d
[Missing <returns> documentation for "M:Rhino.Render.ConvertibleExtensions.ToVector3d(System.IConvertible)"]
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type IConvertible. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ConvertibleExtensions Class
Rhino.Render Namespace