RhinoCommon API
LinearDimension.Get3dPoints Method
 Get locations of dimension's 3d points
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Get3dPoints(
	out Point3d extensionLine1End,
	out Point3d extensionLine2End,
	out Point3d arrowhead1End,
	out Point3d arrowhead2End,
	out Point3d dimlinepoint,
	out Point3d textpoint
)
Public Function Get3dPoints (
	<OutAttribute> ByRef extensionLine1End As Point3d,
	<OutAttribute> ByRef extensionLine2End As Point3d,
	<OutAttribute> ByRef arrowhead1End As Point3d,
	<OutAttribute> ByRef arrowhead2End As Point3d,
	<OutAttribute> ByRef dimlinepoint As Point3d,
	<OutAttribute> ByRef textpoint As Point3d
) As Boolean
Parameters
extensionLine1End
Type: Rhino.Geometry.Point3d
First definition point
extensionLine2End
Type: Rhino.Geometry.Point3d
Second definition point
arrowhead1End
Type: Rhino.Geometry.Point3d
First arrowhead point
arrowhead2End
Type: Rhino.Geometry.Point3d
Second Arrowhead point
dimlinepoint
Type: Rhino.Geometry.Point3d
Point on dimension line
textpoint
Type: Rhino.Geometry.Point3d
Text location
Return Value
Type: Boolean
true = success
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace