RhinoCommon API
ParticleSystem.Clear Method
 Remove all Particles from this system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual void Clear()
Public Overridable Sub Clear
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace