RhinoCommon API
SubD.DissolveOrDeleteComponents Method (IEnumerable<ComponentIndex>)
 Dissolves or deletes components, identified by component index. See DissolveOrDeleteComponents(IEnumerable<SubDComponent>).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public uint DissolveOrDeleteComponents(
	IEnumerable<ComponentIndex> componentIndices
)
Public Function DissolveOrDeleteComponents (
	componentIndices As IEnumerable(Of ComponentIndex)
) As UInteger
Parameters
componentIndices
Type: System.Collections.Generic.IEnumerable<ComponentIndex>
The component indices to dissolve or delete.
Return Value
Type: UInt32
The number of merged faces created by dissolving edges and vertices.
See Also
Reference
SubD Class
DissolveOrDeleteComponents Overload
Rhino.Geometry Namespace