RhinoCommon API
AppearanceSettings.SetWidgetColor Method (WidgetColor, Color)
 Sets the logical widget color association to a specific .Net library color, without forced UI update.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void SetWidgetColor(
	WidgetColor whichColor,
	Color c
)
Public Shared Sub SetWidgetColor (
	whichColor As WidgetColor,
	c As Color
)
Parameters
whichColor
Type: Rhino.ApplicationSettings.WidgetColor
A logical color association.
c
Type: System.Drawing.Color
A .Net library color.
See Also
Reference
AppearanceSettings Class
SetWidgetColor Overload
Rhino.ApplicationSettings Namespace