RhinoCommon API
ColorHSV.CreateFromCMYK Method
 Create the nearest HSV equivalent of a CMYK color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ColorHSV CreateFromCMYK(
	ColorCMYK cmyk
)
Public Shared Function CreateFromCMYK (
	cmyk As ColorCMYK
) As ColorHSV
Parameters
cmyk
Type: Rhino.Display.ColorCMYK
Target color in CMYK space.
Return Value
Type: ColorHSV
The HSV equivalent of the CMYK color.
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace