RhinoCommon API
StringParserSettings.Dispose Method
Releases all resources used by the StringParserSettings
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
StringParserSettings Class
Dispose Overload
Rhino.Input Namespace