RhinoCommon API
RenderSourceView.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.RenderSourceView.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RenderSourceView Class
Rhino.Render Namespace