RhinoCommon API
Brep.CreatePlanarBreps Method (CurveList, Double)
 Constructs a set of planar Breps as outlines by the loops.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep[] CreatePlanarBreps(
	CurveList inputLoops,
	double tolerance
)
Public Shared Function CreatePlanarBreps (
	inputLoops As CurveList,
	tolerance As Double
) As Brep()
Parameters
inputLoops
Type: Rhino.Collections.CurveList
Curve loops that delineate the planar boundaries.
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.Brep.CreatePlanarBreps(Rhino.Collections.CurveList,System.Double)"]
Return Value
Type: Brep[]
An array of Planar Breps.
See Also
Reference
Brep Class
CreatePlanarBreps Overload
Rhino.Geometry Namespace