RhinoCommon API
PersistentSettings.TryGetSize Method (String, Size, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetSize(System.String,System.Drawing.Size@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetSize(
	string key,
	out Size value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetSize (
	key As String,
	<OutAttribute> ByRef value As Size,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetSize(System.String,System.Drawing.Size@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: System.Drawing.Size
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetSize(System.String,System.Drawing.Size@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetSize(System.String,System.Drawing.Size@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetSize(System.String,System.Drawing.Size@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetSize Overload
Rhino Namespace