RhinoCommon API
RenderContent.Create Method (RhinoDoc, Guid, RenderContent, String)
 Constructs a new content of the specified type and attaches it to a document. This function cannot be used to create temporary content that you delete after use. Content created by this function is owned by RDK and appears in the content editor. To create a temporary content which is owned by you, call RenderContentType.NewContentFromTypeId().
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public static RenderContent Create(
	RhinoDoc doc,
	Guid type,
	RenderContent parent,
	string childSlotName
)
Public Shared Function Create (
	doc As RhinoDoc,
	type As Guid,
	parent As RenderContent,
	childSlotName As String
) As RenderContent
Parameters
doc
Type: Rhino.RhinoDoc
The Rhino document to attach the new render content to.
type
Type: System.Guid
The type of the content to create.
parent
Type: Rhino.Render.RenderContent
Parent is the parent content. If not null, this must be an RDK-owned content that is attached to the document (either top-level or child). The new content then becomes its child. If null, the new content is added to the top-level document content list instead.
childSlotName
Type: System.String
ChildSlotName is the unique child identifier to use for the new content when creating it as a child of parent (i.e., when parent is not null)
Return Value
Type: RenderContent
A new document-resident render content.
See Also
Reference
RenderContent Class
Create Overload
Rhino.Render Namespace