RhinoCommon API
SimpleArrayFloat Constructor
 Initializes a new SimpleArrayFloat class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SimpleArrayFloat()
Public Sub New
See Also
Reference
SimpleArrayFloat Class
SimpleArrayFloat Overload
Rhino.Runtime.InteropWrappers Namespace