RhinoCommon API
DisplayConduit Constructor
Initializes a new instance of the DisplayConduit class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected DisplayConduit()
Protected Sub New
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace