RhinoCommon API
UserInterfaceRadioButton Constructor (String, Int32)
Initializes a new instance of the UserInterfaceRadioButton class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceRadioButton(
	string text,
	int group
)
Public Sub New (
	text As String,
	group As Integer
)
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.UI.UserInterfaceRadioButton.#ctor(System.String,System.Int32)"]
group
Type: System.Int32
[Missing <param name="group"/> documentation for "M:Rhino.UI.UserInterfaceRadioButton.#ctor(System.String,System.Int32)"]
See Also
Reference
UserInterfaceRadioButton Class
UserInterfaceRadioButton Overload
Rhino.UI Namespace