RhinoCommon API
SubD.ToBrep Method
 Create a Brep based on this SubD geometry, based on SubDToBrepOptions.Default options.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public Brep ToBrep()
Public Function ToBrep As Brep
Return Value
Type: Brep
A new Brep if successful, or null on failure.
See Also
Reference
SubD Class
ToBrep Overload
Rhino.Geometry Namespace