RhinoCommon API
RenderContent.CalculateRenderHash2 Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.CalculateRenderHash2(Rhino.Render.CrcRenderHashFlags,System.String[])"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual uint CalculateRenderHash2(
	CrcRenderHashFlags flags,
	string[] excludeParameterNames
)
Protected Overridable Function CalculateRenderHash2 (
	flags As CrcRenderHashFlags,
	excludeParameterNames As String()
) As UInteger
Parameters
flags
Type: Rhino.Render.CrcRenderHashFlags
[Missing <param name="flags"/> documentation for "M:Rhino.Render.RenderContent.CalculateRenderHash2(Rhino.Render.CrcRenderHashFlags,System.String[])"]
excludeParameterNames
Type: System.String[]
[Missing <param name="excludeParameterNames"/> documentation for "M:Rhino.Render.RenderContent.CalculateRenderHash2(Rhino.Render.CrcRenderHashFlags,System.String[])"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.CalculateRenderHash2(Rhino.Render.CrcRenderHashFlags,System.String[])"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace