RhinoCommon API
RhinoDoc.GetRenderPrimitives Method (ViewportInfo, Boolean, Boolean)
Note: This API is now obsolete.
 Get a enumerable list of custom mesh primitives
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("This version is obsolete because - uses the old school custom render meshes.  Prefer RenderMeshes")]
public IEnumerable<RenderPrimitive> GetRenderPrimitives(
	ViewportInfo viewport,
	bool forceTriangleMeshes,
	bool quietly
)
<ObsoleteAttribute("This version is obsolete because - uses the old school custom render meshes.  Prefer RenderMeshes")>
Public Function GetRenderPrimitives (
	viewport As ViewportInfo,
	forceTriangleMeshes As Boolean,
	quietly As Boolean
) As IEnumerable(Of RenderPrimitive)
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
 The rendering view camera.
forceTriangleMeshes
Type: System.Boolean
 If true all mesh faces will be triangulated
quietly
Type: System.Boolean
 Iterate quietly, if true then no user interface will be displayed
Return Value
Type: IEnumerable<RenderPrimitive>
[Missing <returns> documentation for "M:Rhino.RhinoDoc.GetRenderPrimitives(Rhino.DocObjects.ViewportInfo,System.Boolean,System.Boolean)"]
See Also
Reference
RhinoDoc Class
GetRenderPrimitives Overload
Rhino Namespace