RhinoCommon API
NurbsCurvePointList.SetPoint Method (Int32, Point3d)
 Sets a world 3-D, or Euclidean, control point at the given index. The 4-D representation is (x, y, z, 1.0).
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SetPoint(
	int index,
	Point3d point
)
Public Function SetPoint (
	index As Integer,
	point As Point3d
) As Boolean
Parameters
index
Type: System.Int32
Index of control point to set.
point
Type: Rhino.Geometry.Point3d
Coordinate of control point.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsCurvePointList Class
SetPoint Overload
Rhino.Geometry.Collections Namespace