RhinoCommon API
RhinoMath.IntIndexToString Method
 Portrays an Int32 index in text.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string IntIndexToString(
	int index
)
Public Shared Function IntIndexToString (
	index As Integer
) As String
Parameters
index
Type: System.Int32
Int32 number express as string.
Return Value
Type: String
The text representation of the int index.
See Also
Reference
RhinoMath Class
Rhino Namespace