RhinoCommon API
DimStyleTable.Find Method (String, Boolean)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("ignoreDeleted is always considered true now. Use FindName.")]
public DimensionStyle Find(
	string name,
	bool ignoreDeleted
)
<ObsoleteAttribute("ignoreDeleted is always considered true now. Use FindName.")>
Public Function Find (
	name As String,
	ignoreDeleted As Boolean
) As DimensionStyle
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
ignoreDeleted
Type: System.Boolean
[Missing <param name="ignoreDeleted"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
Return Value
Type: DimensionStyle
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
See Also
Reference
DimStyleTable Class
Find Overload
Rhino.DocObjects.Tables Namespace