RhinoCommon API
ObjectPropertiesPage.ShouldDisplay Method (RhinoObject)
Note: This API is now obsolete.
 Called when the selected objects list changes, return true if the object list contains one or more object the page can modify.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("ShouldDisplay(RhinoObject rhObj) is obsolete, override ShouldDisplay(ObjectPropertiesPageEventArgs e) instead")]
public virtual bool ShouldDisplay(
	RhinoObject rhObj
)
<ObsoleteAttribute("ShouldDisplay(RhinoObject rhObj) is obsolete, override ShouldDisplay(ObjectPropertiesPageEventArgs e) instead")>
Public Overridable Function ShouldDisplay (
	rhObj As RhinoObject
) As Boolean
Parameters
rhObj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhObj"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.ShouldDisplay(Rhino.DocObjects.RhinoObject)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPage.ShouldDisplay(Rhino.DocObjects.RhinoObject)"]
See Also
Reference
ObjectPropertiesPage Class
ShouldDisplay Overload
Rhino.UI Namespace