RhinoCommon API
ScaleValue.Create Method (String, StringParserSettings)
 Create from string
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ScaleValue Create(
	string s,
	StringParserSettings ps
)
Public Shared Function Create (
	s As String,
	ps As StringParserSettings
) As ScaleValue
Parameters
s
Type: System.String
[Missing <param name="s"/> documentation for "M:Rhino.ScaleValue.Create(System.String,Rhino.Input.StringParserSettings)"]
ps
Type: Rhino.Input.StringParserSettings
[Missing <param name="ps"/> documentation for "M:Rhino.ScaleValue.Create(System.String,Rhino.Input.StringParserSettings)"]
Return Value
Type: ScaleValue
[Missing <returns> documentation for "M:Rhino.ScaleValue.Create(System.String,Rhino.Input.StringParserSettings)"]
See Also
Reference
ScaleValue Class
Create Overload
Rhino Namespace