RhinoCommon API
BinaryArchiveWriter.WritePlane Method
 Writes a Plane value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void WritePlane(
	Plane value
)
Public Sub WritePlane (
	value As Plane
)
Parameters
value
Type: Rhino.Geometry.Plane
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace