RhinoCommon API
DisplayModeDescription.DeleteDiplayMode Method
Note: This API is now obsolete.
 Deletes an existing display mode.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use DisplayModeDescription.DeleteDisplayMode")]
public static bool DeleteDiplayMode(
	Guid id
)
<ObsoleteAttribute("Use DisplayModeDescription.DeleteDisplayMode")>
Public Shared Function DeleteDiplayMode (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
The id of the existing display mode to delete.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace