RhinoCommon API
MeshCurvatureStats Constructor
 Default constructor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public MeshCurvatureStats()
Public Sub New
See Also
Reference
MeshCurvatureStats Class
Rhino.Geometry Namespace