RhinoCommon API
ModelComponent.ClearName Method
 Resets the HasName property of the model component to false, if possible.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void ClearName()
Public Sub ClearName
Exceptions
Exception | Condition
InvalidOperationException | If the name is locked.
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace