RhinoCommon API
PersistentSettings.TryGetDouble Method (String, Double, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetDouble(System.String,System.Double@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetDouble(
	string key,
	out double value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetDouble (
	key As String,
	<OutAttribute> ByRef value As Double,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetDouble(System.String,System.Double@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: System.Double
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetDouble(System.String,System.Double@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetDouble(System.String,System.Double@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetDouble(System.String,System.Double@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetDouble Overload
Rhino Namespace