RhinoCommon API
ColorCMYK Constructor (Color)
 Initializes a new instance of ColorCMYK that is equivalent to an ARGB color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ColorCMYK(
	Color rgb
)
Public Sub New (
	rgb As Color
)
Parameters
rgb
Type: System.Drawing.Color
ARGB color to mimic.
Remarks
Exact conversions between color spaces are often not possible.
See Also
Reference
ColorCMYK Structure
ColorCMYK Overload
Rhino.Display Namespace