RhinoCommon API
RenderContent.AddUserInterfaceSection Method (ICollapsibleSection)
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.AddUserInterfaceSection(Rhino.UI.Controls.ICollapsibleSection)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AddUserInterfaceSection(
	ICollapsibleSection section
)
Public Function AddUserInterfaceSection (
	section As ICollapsibleSection
) As Boolean
Parameters
section
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="section"/> documentation for "M:Rhino.Render.RenderContent.AddUserInterfaceSection(Rhino.UI.Controls.ICollapsibleSection)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.AddUserInterfaceSection(Rhino.UI.Controls.ICollapsibleSection)"]
See Also
Reference
RenderContent Class
AddUserInterfaceSection Overload
Rhino.Render Namespace