RhinoCommon API
DisplayConduit.ExclusiveBind Method
 Exclusively bind this conduit to a specific viewport
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void ExclusiveBind(
	RhinoViewport viewport
)
Public Sub ExclusiveBind (
	viewport As RhinoViewport
)
Parameters
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.Display.DisplayConduit.ExclusiveBind(Rhino.Display.RhinoViewport)"]
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace