RhinoCommon API
RenderContent.GetExtraRequirementParameter Method
 Extra requirements are a way of specifying extra functionality on parameters in the automatic UI. See IAutoUIExtraRequirements.h in the C++ RDK SDK for string definitions for the parameter names.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public Object GetExtraRequirementParameter(
	string contentParameterName,
	string extraRequirementParameter
)
Public Function GetExtraRequirementParameter (
	contentParameterName As String,
	extraRequirementParameter As String
) As Object
Parameters
contentParameterName
Type: System.String
The parameter or field internal name to which this query applies.
extraRequirementParameter
Type: System.String
The extra requirement parameter, as listed in IAutoUIExtraRequirements.h in the C++ RDK SDK.
Return Value
Type: Object
 The value of the requested extra requirement parameter or null if the parameter does not exist. Current supported return values are (int, bool, float, double, string, Guid, Color, Vector3d, Point3d, DateTime).
See Also
Reference
RenderContent Class
Rhino.Render Namespace