RhinoCommon API
RhinoDoc.GetGridDefaults Method
[Missing <summary> documentation for "M:Rhino.RhinoDoc.GetGridDefaults"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public ConstructionPlaneGridDefaults GetGridDefaults()
Public Function GetGridDefaults As ConstructionPlaneGridDefaults
Return Value
Type: ConstructionPlaneGridDefaults
[Missing <returns> documentation for "M:Rhino.RhinoDoc.GetGridDefaults"]
See Also
Reference
RhinoDoc Class
Rhino Namespace