RhinoCommon API
Linetype.PatternString Method
 Returns a string that represents the pattern of the linetype, which can be used in user interface. Values greater than zero represent line segments, and values less than or equal to zero represent space segments.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
public string PatternString(
	bool millimeters
)
Public Function PatternString (
	millimeters As Boolean
) As String
Parameters
millimeters
Type: System.Boolean
 If true, the string is formatted in millimeters. If false, the string is formatted in inches.
Return Value
Type: String
The pattern string.
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace