RhinoCommon API
StackedDialogPage.OnHelp Method
 Called when the parent dialog requests help for this page.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual void OnHelp()
Public Overridable Sub OnHelp
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace