RhinoCommon API
UserInterfaceObjectBase.OnRunCommand Method
 Called after the above RunCommand function is called. This will be executing while inside of a Rhino command.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual Result OnRunCommand(
	RhinoDoc doc,
	RunMode mode,
	MouseState mouse
)
Protected Overridable Function OnRunCommand (
	doc As RhinoDoc,
	mode As RunMode,
	mouse As MouseState
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
Document that the command is running in
mode
Type: Rhino.Commands.RunMode
Interactive or scripted mode
mouse
Type: Rhino.UI.MouseState
Mouse state that was passed to RunCommand
Return Value
Type: Result
 Result of the command. The default implementation returns Success
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace