RhinoCommon API
RenderContent.SetChildSlotOn Method
 Sets the on-ness property for the texture in the specified child slot.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public void SetChildSlotOn(
	string childSlotName,
	bool bOn,
	RenderContent.ChangeContexts cc
)
Public Sub SetChildSlotOn (
	childSlotName As String,
	bOn As Boolean,
	cc As RenderContent.ChangeContexts
)
Parameters
childSlotName
Type: System.String
The child slot name of the texture.
bOn
Type: System.Boolean
Value for the on-ness property.
cc
Type: Rhino.Render.RenderContent.ChangeContexts
Context of the change
See Also
Reference
RenderContent Class
Rhino.Render Namespace