RhinoCommon API
DisplayBitmap Constructor (String, Bitmap)
 Creates a DisplayBitmap either from a path, or a bitmap. If the path is null, a random tag name will be used. If the bitmap is null, the bitmap will be loaded from the path. If both are null, the object is invalid. if both are valid objects, the bitmap will be used and it will be added to Rhino's bitmap cache with the path supplied. In other words, this is a way to add a bitmap from memory directly into Rhino's memory cache.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.16
Syntax
public DisplayBitmap(
	string path,
	Bitmap bitmap
)
Public Sub New (
	path As String,
	bitmap As Bitmap
)
Parameters
path
Type: System.String
If null, use a temporary tag name. If non-null, use that path in Rhino's bitmap cache. Note, this version does not support URLs.
bitmap
Type: System.Drawing.Bitmap
If null, load the bitmap from the supplied path. If non-null, creates the bitmap from the data supplied.
See Also
Reference
DisplayBitmap Class
DisplayBitmap Overload
Rhino.Display Namespace