RhinoCommon API
Cone.AngleInRadians Method
 Computes the angle (in radians) between the axis and the side of the cone. The angle and the height have the same sign.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double AngleInRadians()
Public Function AngleInRadians As Double
Return Value
Type: Double
Math.Atan(Radius / Height) if the height is not 0; 0 if the radius is 0; Math.PI otherwise.
See Also
Reference
Cone Structure
Rhino.Geometry Namespace