RhinoCommon API
WorksessionFileModel Constructor
Creates a reference model with no paths and no layer overrides.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFileModel()
Public Sub New
See Also
Reference
WorksessionFileModel Class
WorksessionFileModel Overload
Rhino.FileIO Namespace