RhinoCommon API
RhinoDoc.Save Method
 Save doc to disk using the document's Path
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Save()
Public Function Save As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoDoc.Save"]
See Also
Reference
RhinoDoc Class
Rhino Namespace