RhinoCommon API
GetBaseClass.GetSelectedEnumValueFromSelectionList<T> Method
 Returns the selected enumerated value by looking at the list of values from which to select. Use this in combination with AddOptionEnumSelectionList.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public T GetSelectedEnumValueFromSelectionList<T>(
	IEnumerable<T> selectionList
)
where T : struct, new(), IConvertible
Public Function GetSelectedEnumValueFromSelectionList(Of T As {Structure, New, IConvertible}) (
	selectionList As IEnumerable(Of T)
) As T
Parameters
selectionList
Type: System.Collections.Generic.IEnumerable<T>
[Missing <param name="selectionList"/> documentation for "M:Rhino.Input.Custom.GetBaseClass.GetSelectedEnumValueFromSelectionList``1(System.Collections.Generic.IEnumerable{``0})"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.Input.Custom.GetBaseClass.GetSelectedEnumValueFromSelectionList``1(System.Collections.Generic.IEnumerable{``0})"]
Return Value
Type: T
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetBaseClass.GetSelectedEnumValueFromSelectionList``1(System.Collections.Generic.IEnumerable{``0})"]
Exceptions
Exception | Condition
ArgumentException | Gets thrown if type T is not an enumerated type.
IndexOutOfRangeException | If 0 >= CurrentListOptionIndex or CurrentListOptionIndex > N where N is the number of enumerated values.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace