RhinoCommon API
SpaceMorph Constructor
Initializes a new instance of the SpaceMorph class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected SpaceMorph()
Protected Sub New
See Also
Reference
SpaceMorph Class
Rhino.Geometry Namespace