RhinoCommon API
DisplayPipeline.Draw2dPolyline Method (Point2f[], DisplayPen)
 Draws a polyline whose coordinates are viewport pixels rather than world units. The origin is the top left of the frame, with y increasing downwards - the same space Draw2dText and DrawBitmap work in.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Draw2dPolyline(
	Point2f[] points,
	DisplayPen pen
)
Public Sub Draw2dPolyline (
	points As Point2f(),
	pen As DisplayPen
)
Parameters
points
Type: Rhino.Geometry.Point2f[]
The polyline vertices, in screen coordinates. Fewer than two draws nothing.
pen
Type: Rhino.Display.DisplayPen
Pen to stroke the polyline with.
See Also
Reference
DisplayPipeline Class
Draw2dPolyline Overload
Rhino.Display Namespace