RhinoCommon API
PlugIn.OnLoad Method
 Is called when the plug-in is being loaded.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual LoadReturnCode OnLoad(
	ref string errorMessage
)
Protected Overridable Function OnLoad (
	ByRef errorMessage As String
) As LoadReturnCode
Parameters
errorMessage
Type: System.String
 If a load error is returned and this string is set. This string is the error message that will be reported back to the user.
Return Value
Type: LoadReturnCode
An appropriate load return code.
The default implementation returns Success.
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace