RhinoCommon API
Mesh.CreateContourCurves Method (Mesh, Plane, Double)
 Constructs contour curves for a mesh, sectioned at a plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.13
Syntax
public static Curve[] CreateContourCurves(
	Mesh meshToContour,
	Plane sectionPlane,
	double tolerance
)
Public Shared Function CreateContourCurves (
	meshToContour As Mesh,
	sectionPlane As Plane,
	tolerance As Double
) As Curve()
Parameters
meshToContour
Type: Rhino.Geometry.Mesh
A mesh to contour.
sectionPlane
Type: Rhino.Geometry.Plane
A cutting plane.
tolerance
Type: System.Double
A tolerance value. If negative, the positive value will be used. WARNING! Good tolerance values are in the magnitude of 10^-7, or RhinoMath.SqrtEpsilon*10. See comments at MeshIntersectionsTolerancesCoefficient
Return Value
Type: Curve[]
An array of curves. This array can be empty.
See Also
Reference
Mesh Class
CreateContourCurves Overload
Rhino.Geometry Namespace
Intersection.MeshPlane(Mesh, Plane)