RhinoCommon API
LightManagerSupport.GetLightSolo Method
 Returns the value of "ON_LIght::m_bOn" if the light is in solo storage, or false if not in solo storage (ie - this is the checkbox state on the light manager dialog)
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool GetLightSolo(
	RhinoDoc doc,
	Guid uuid_light
)
Public Overridable Function GetLightSolo (
	doc As RhinoDoc,
	uuid_light As Guid
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.LightManagerSupport.GetLightSolo(Rhino.RhinoDoc,System.Guid)"]
uuid_light
Type: System.Guid
[Missing <param name="uuid_light"/> documentation for "M:Rhino.Render.LightManagerSupport.GetLightSolo(Rhino.RhinoDoc,System.Guid)"]
Return Value
Type: Boolean
Returns true if the light is in solo storage, or false if not in solo storage
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace