RhinoCommon API
ObjectAttributes.SetActiveInViewportOverrides Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.SetActiveInViewportOverrides(System.Guid[],System.Boolean)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SetActiveInViewportOverrides(
	Guid[] viewportIds,
	bool active
)
Public Function SetActiveInViewportOverrides (
	viewportIds As Guid(),
	active As Boolean
) As Boolean
Parameters
viewportIds
Type: System.Guid[]
[Missing <param name="viewportIds"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.SetActiveInViewportOverrides(System.Guid[],System.Boolean)"]
active
Type: System.Boolean
[Missing <param name="active"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.SetActiveInViewportOverrides(System.Guid[],System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.SetActiveInViewportOverrides(System.Guid[],System.Boolean)"]
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace