RhinoCommon API
Layer.HasSelectedObjects Method
 Returns true if the layer has one or more selected Rhino objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool HasSelectedObjects(
	bool checkSubObjects
)
Public Function HasSelectedObjects (
	checkSubObjects As Boolean
) As Boolean
Parameters
checkSubObjects
Type: System.Boolean
 If true, the search will include objects that have some subset of the object selected, like some edges of a Brep. If false, objects where the entire object is not selected are ignored.
Return Value
Type: Boolean
true if the layer has selected Rhino objects, false otherwise.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace