RhinoCommon API
StatusBar.ShowProgressMeter Method (UInt32, Int32, Int32, String, Boolean, Boolean)
 Starts, or shows, Rhino's status bar progress meter.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public static int ShowProgressMeter(
	uint docSerialNumber,
	int lowerLimit,
	int upperLimit,
	string label,
	bool embedLabel,
	bool showPercentComplete
)
Public Shared Function ShowProgressMeter (
	docSerialNumber As UInteger,
	lowerLimit As Integer,
	upperLimit As Integer,
	label As String,
	embedLabel As Boolean,
	showPercentComplete As Boolean
) As Integer
Parameters
docSerialNumber
Type: System.UInt32
The document runtime serial number.
lowerLimit
Type: System.Int32
The lower limit of the progress meter's range.
upperLimit
Type: System.Int32
The upper limit of the progress meter's range.
label
Type: System.String
The short description of the progress (e.g. "Calculating", "Meshing", etc)
embedLabel
Type: System.Boolean
 If true, then the label will be embedded in the progress meter. If false, then the label will appear to the left of the progress meter.
showPercentComplete
Type: System.Boolean
 If true, then the percent complete will appear in the progress meter.
Return Value
Type: Int32
 1 - The progress meter was created successfully. 0 - The progress meter was not created. -1 - The progress meter was not created because some other process has already created it.
See Also
Reference
StatusBar Class
ShowProgressMeter Overload
Rhino.UI Namespace