RhinoCommon API
MeshUnsafeLock.VertexPoint3fArray Method
 Retrieves a pointer to the raw mesh vertex array, which uses coordinates defined with single precision floating point numbers, or null if none is available.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point3f* VertexPoint3fArray(
	out int length
)
Visual Basic does not support APIs that consume or return unsafe types.
Parameters
length
Type: System.Int32
The length of the array. This value is returned by reference (out in C#). 0 is returned when there is no single precision array.
Return Value
Type: Point3f*
The beginning of the vertex array. Item 0 is the first vertex, and item length-1 is the last valid one. If no array is available, null is returned.
Exceptions
Exception | Condition
InvalidOperationException | The mesh does not use single precision vertices.
Remarks
When running this method for writing, it is up to the caller to ensure that the mesh has no double precision array that needs to be synchronized. Otherwise, also the double precision array must be synchronized.
See Also
Reference
MeshUnsafeLock Class
Rhino.Geometry Namespace