RhinoCommon API
PreviewAppearance.Geometry Method
 Geometry
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PreviewGeometry Geometry()
Public Function Geometry As PreviewGeometry
Return Value
Type: PreviewGeometry
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.Geometry"]
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace