RhinoCommon API
DisplayModeDescription.FindByName Method
 Finds a display mode description by its English name.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static DisplayModeDescription FindByName(
	string englishName
)
Public Shared Function FindByName (
	englishName As String
) As DisplayModeDescription
Parameters
englishName
Type: System.String
The English name of the display mode.
Return Value
Type: DisplayModeDescription
The display mode description if found, null otherwise.
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace