RhinoCommon API
BrepFace.ClearMaterialChannelIndex Method
 Clear this face's rendering material channel index.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.26
Syntax
public void ClearMaterialChannelIndex()
Public Sub ClearMaterialChannelIndex
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace