RhinoCommon API
Transform.DecomposeAffine Method (Vector3d, Transform, Transform, Vector3d)
 An affine transformation can be decomposed into a Symmetric, Rotation and Translation. Then the Symmetric component may be further decomposed as non-uniform scale in an orthonormal coordinate system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public bool DecomposeAffine(
	out Vector3d translation,
	out Transform rotation,
	out Transform orthogonal,
	out Vector3d diagonal
)
Public Function DecomposeAffine (
	<OutAttribute> ByRef translation As Vector3d,
	<OutAttribute> ByRef rotation As Transform,
	<OutAttribute> ByRef orthogonal As Transform,
	<OutAttribute> ByRef diagonal As Vector3d
) As Boolean
Parameters
translation
Type: Rhino.Geometry.Vector3d
Translation vector.
rotation
Type: Rhino.Geometry.Transform
Proper rotation transformation.
orthogonal
Type: Rhino.Geometry.Transform
Orthogonal basis.
diagonal
Type: Rhino.Geometry.Vector3d
Diagonal elements of a Diagonal transformation.
Return Value
Type: Boolean
True if successful decomposition.
See Also
Reference
Transform Structure
DecomposeAffine Overload
Rhino.Geometry Namespace