RhinoCommon API
MeshCurvatureStats.CreateFromMesh Method
 Gets curvature statistics from analysis mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static MeshCurvatureStats CreateFromMesh(
	Mesh analysisMesh,
	CurvatureStyle curvatureStyle
)
Public Shared Function CreateFromMesh (
	analysisMesh As Mesh,
	curvatureStyle As CurvatureStyle
) As MeshCurvatureStats
Parameters
analysisMesh
Type: Rhino.Geometry.Mesh
The analysis mesh.
curvatureStyle
Type: Rhino.Geometry.CurvatureStyle
The curvature style.
Return Value
Type: MeshCurvatureStats
The curvature statistics.
Exceptions
Exception | Condition
NullReferenceException
See Also
Reference
MeshCurvatureStats Class
Rhino.Geometry Namespace