RhinoCommon API
FileXaml.Write Method
Write a Xaml file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Write(
	string path,
	RhinoDoc doc,
	FileFbxWriteOptions options
)
Public Shared Function Write (
	path As String,
	doc As RhinoDoc,
	options As FileFbxWriteOptions
) As Boolean
Parameters
path
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileFbxWriteOptions
options used for generating the Xaml file
Return Value
Type: Boolean
true on success
See Also
Reference
FileXaml Class
Rhino.FileIO Namespace