RhinoCommon API
File3dmRenderContent.SetParameter Method
 Sets a named parameter. True if the parameter was set, else false.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SetParameter(
	string param,
	Object value
)
Public Function SetParameter (
	param As String,
	value As Object
) As Boolean
Parameters
param
Type: System.String
[Missing <param name="param"/> documentation for "M:Rhino.FileIO.File3dmRenderContent.SetParameter(System.String,System.Object)"]
value
Type: System.Object
[Missing <param name="value"/> documentation for "M:Rhino.FileIO.File3dmRenderContent.SetParameter(System.String,System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderContent.SetParameter(System.String,System.Object)"]
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace