RhinoCommon API
CurveKinkDefinition Constructor
 Construct a new instance with default values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public CurveKinkDefinition()
Public Sub New
See Also
Reference
CurveKinkDefinition Class
CurveKinkDefinition Overload
Rhino.Geometry Namespace