RhinoCommon API
WorksessionFile.GetModels Method
Gets copies of all of the models.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFileModel[] GetModels()
Public Function GetModels As WorksessionFileModel()
Return Value
Type: WorksessionFileModel[]
[Missing <returns> documentation for "M:Rhino.FileIO.WorksessionFile.GetModels"]
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace