RhinoCommon API
BinaryArchiveWriter.WriteRenderSettings Method
 Writes a RenderSettings value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void WriteRenderSettings(
	RenderSettings value
)
Public Sub WriteRenderSettings (
	value As RenderSettings
)
Parameters
value
Type: Rhino.Render.RenderSettings
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace