RhinoCommon API
CommandAlias Constructor
 Create a new command alias
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public CommandAlias(
	string alias,
	string macro,
	bool instant
)
Public Sub New (
	alias As String,
	macro As String,
	instant As Boolean
)
Parameters
alias
Type: System.String
[Missing <param name="alias"/> documentation for "M:Rhino.ApplicationSettings.CommandAlias.#ctor(System.String,System.String,System.Boolean)"]
macro
Type: System.String
[Missing <param name="macro"/> documentation for "M:Rhino.ApplicationSettings.CommandAlias.#ctor(System.String,System.String,System.Boolean)"]
instant
Type: System.Boolean
[Missing <param name="instant"/> documentation for "M:Rhino.ApplicationSettings.CommandAlias.#ctor(System.String,System.String,System.Boolean)"]
See Also
Reference
CommandAlias Class
Rhino.ApplicationSettings Namespace