RhinoCommon API
Interop.NativeNonConstPointer Method (ViewCaptureSettings)
 Get a CRhinoPrintInfo* for a given ViewCaptureSettings class
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static IntPtr NativeNonConstPointer(
	ViewCaptureSettings settings
)
Public Shared Function NativeNonConstPointer (
	settings As ViewCaptureSettings
) As IntPtr
Parameters
settings
Type: Rhino.Display.ViewCaptureSettings
[Missing <param name="settings"/> documentation for "M:Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Display.ViewCaptureSettings)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Display.ViewCaptureSettings)"]
See Also
Reference
Interop Class
NativeNonConstPointer Overload
Rhino.Runtime Namespace