RhinoCommon API
Interop.ViewCaptureFromPointer Method
 Create a ViewCaptureSettings class from a native const CRhinoPrintInfo* The pointer values are copied
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ViewCaptureSettings ViewCaptureFromPointer(
	IntPtr ptrViewCapture
)
Public Shared Function ViewCaptureFromPointer (
	ptrViewCapture As IntPtr
) As ViewCaptureSettings
Parameters
ptrViewCapture
Type: System.IntPtr
[Missing <param name="ptrViewCapture"/> documentation for "M:Rhino.Runtime.Interop.ViewCaptureFromPointer(System.IntPtr)"]
Return Value
Type: ViewCaptureSettings
[Missing <returns> documentation for "M:Rhino.Runtime.Interop.ViewCaptureFromPointer(System.IntPtr)"]
See Also
Reference
Interop Class
Rhino.Runtime Namespace