RhinoCommon API
LightManagerSupportClient.ModifyLight Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupportClient.ModifyLight(Rhino.Geometry.Light)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void ModifyLight(
	Light light
)
Public Sub ModifyLight (
	light As Light
)
Parameters
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.LightManagerSupportClient.ModifyLight(Rhino.Geometry.Light)"]
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace