RhinoCommon API
FieldDictionary.Add Method (String, String, Int32)
 Add a new NullField to the dictionary.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public NullField Add(
	string key,
	string prompt,
	int sectionId
)
Public Function Add (
	key As String,
	prompt As String,
	sectionId As Integer
) As NullField
Parameters
key
Type: System.String
Key name for the field value to add. See important note above.
prompt
Type: System.String
 Prompt to display in the user interface (Content Browsers) if this is null or an empty string the this field is a data only field and will not appear in the user interface.
sectionId
Type: System.Int32
Id of the section containing the field
Return Value
Type: NullField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.Add(System.String,System.String,System.Int32)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
See Also
Reference
FieldDictionary Class
Add Overload
Rhino.Render.Fields Namespace