RhinoCommon API
Transform2d.CompareTo Method
 Compares this transform with another transform.
M00 has highest value, then M01, etc..
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int CompareTo(
	Transform2d other
)
Public Function CompareTo (
	other As Transform2d
) As Integer
Parameters
other
Type: Rhino.Geometry.Transform2d
Another transform.
Return Value
Type: Int32
-1 if this < other; 0 if both are equal; 1 otherwise.
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace