RhinoCommon API
RhinoDoc.Export Method (String)
 Export the entire document to a file. All file formats that Rhino can export to are supported by this function.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Export(
	string filePath
)
Public Function Export (
	filePath As String
) As Boolean
Parameters
filePath
Type: System.String
[Missing <param name="filePath"/> documentation for "M:Rhino.RhinoDoc.Export(System.String)"]
Return Value
Type: Boolean
true on success
See Also
Reference
RhinoDoc Class
Export Overload
Rhino Namespace