RhinoCommon API
PostEffectThreadEngine.RunPostEffect Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffect,System.Drawing.Rectangle,System.Guid[])"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool RunPostEffect(
	PostEffectJob job,
	PostEffectPipeline pipeline,
	PostEffect plugin,
	Rectangle rect,
	Guid[] channels
)
Public Function RunPostEffect (
	job As PostEffectJob,
	pipeline As PostEffectPipeline,
	plugin As PostEffect,
	rect As Rectangle,
	channels As Guid()
) As Boolean
Parameters
job
Type: Rhino.Render.PostEffects.PostEffectJob
[Missing <param name="job"/> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffect,System.Drawing.Rectangle,System.Guid[])"]
pipeline
Type: Rhino.Render.PostEffects.PostEffectPipeline
[Missing <param name="pipeline"/> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffect,System.Drawing.Rectangle,System.Guid[])"]
plugin
Type: Rhino.Render.PostEffects.PostEffect
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffect,System.Drawing.Rectangle,System.Guid[])"]
rect
Type: System.Drawing.Rectangle
[Missing <param name="rect"/> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffect,System.Drawing.Rectangle,System.Guid[])"]
channels
Type: System.Guid[]
[Missing <param name="channels"/> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffect,System.Drawing.Rectangle,System.Guid[])"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffect,System.Drawing.Rectangle,System.Guid[])"]
See Also
Reference
PostEffectThreadEngine Class
Rhino.Render.PostEffects Namespace