RhinoCommon API
ObjRef.ClippingPlaneSurface Method
 Gets the clipping plane surface if this reference targeted one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ClippingPlaneSurface ClippingPlaneSurface()
Public Function ClippingPlaneSurface As ClippingPlaneSurface
Return Value
Type: ClippingPlaneSurface
A clipping plane surface, or null if this reference targeted something else.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace