RhinoCommon API
MeshVertexStatusList.Clear Method
 Clears the hidden vertex list on the mesh. This results in a fully visible mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
IList.Clear()
See Also
Reference
MeshVertexStatusList Class
Rhino.Geometry.Collections Namespace