RhinoCommon API
Linetype.GetTaperPoints Method
 Taper points are positions/width combinations along the length of a curve
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Point2d[] GetTaperPoints()
Public Function GetTaperPoints As Point2d()
Return Value
Type: Point2d[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Linetype.GetTaperPoints"]
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace