RhinoCommon API
HostUtils.GetSystemReferenceAssemblies Method
 Gets the system reference assemblies to use when compiling code dynamically with Roslyn. Includes RhinoCommon, Rhino.UI, and Eto.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static IEnumerable<string> GetSystemReferenceAssemblies()
Public Shared Function GetSystemReferenceAssemblies As IEnumerable(Of String)
Return Value
Type: IEnumerable<String>
An enumeration of paths to each of the rhino system assemblies to be used for compilation
Remarks
 Note that this list of assemblies is not guaranteed to be loadable and should only be used when compiling code dynamically.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace