RhinoCommon API
ManifestTable.Contains Method
 Determines if an items is contained in this table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Contains(
	ModelComponent item
)
Public Function Contains (
	item As ModelComponent
) As Boolean
Parameters
item
Type: Rhino.DocObjects.ModelComponent
An item, or null. Null is never contained.
Return Value
Type: Boolean
True if the item is contained; otherwise, false.
Implements
ICollection<T>.Contains(T)
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace