RhinoCommon API
PythonScript.SetSearchPaths Method
Protected helper function for static SearchPaths
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract void SetSearchPaths(
	string[] paths
)
Protected MustOverride Sub SetSearchPaths (
	paths As String()
)
Parameters
paths
Type: System.String[]
[Missing <param name="paths"/> documentation for "M:Rhino.Runtime.PythonScript.SetSearchPaths(System.String[])"]
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace