RhinoCommon API
RhinoViewport.SetUserString Method
 Attach a user string (key,value combination) to this geometry.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public bool SetUserString(
	string key,
	string value
)
Public Function SetUserString (
	key As String,
	value As String
) As Boolean
Parameters
key
Type: System.String
id used to retrieve this string.
value
Type: System.String
string associated with key. If null, the key will be removed
Return Value
Type: Boolean
true on success.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace