RhinoCommon API
DisplayPipeline.DrawDottedLine Method (Line, Color)
 Draws a single dotted line.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void DrawDottedLine(
	Line line,
	Color color
)
Public Sub DrawDottedLine (
	line As Line,
	color As Color
)
Parameters
line
Type: Rhino.Geometry.Line
Line to draw.
color
Type: System.Drawing.Color
Color of line.
See Also
Reference
DisplayPipeline Class
DrawDottedLine Overload
Rhino.Display Namespace