RhinoCommon API
IRhinoUiDialogService.SetToDefaultColorScheme Method
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.SetToDefaultColorScheme(System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
bool SetToDefaultColorScheme(
	bool dark
)
Function SetToDefaultColorScheme (
	dark As Boolean
) As Boolean
Parameters
dark
Type: System.Boolean
[Missing <param name="dark"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.SetToDefaultColorScheme(System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IRhinoUiDialogService.SetToDefaultColorScheme(System.Boolean)"]
See Also
Reference
IRhinoUiDialogService Interface
Rhino.UI Namespace