RhinoCommon API
DracoCompression.ToBase64String Method
 Convert byte array of Draco compressed data into a base64 encoded string
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string ToBase64String()
Public Function ToBase64String As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.FileIO.DracoCompression.ToBase64String"]
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace