RhinoCommon API
NamedLayerStateTable.FindName Method
 Returns the index of an existing named layer state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public int FindName(
	string name
)
Public Function FindName (
	name As String
) As Integer
Parameters
name
Type: System.String
The name of the layer state.
Return Value
Type: Int32
 >0 if successful, -1 if not found.
See Also
Reference
NamedLayerStateTable Class
Rhino.DocObjects.Tables Namespace