RhinoCommon API
MeshTopologyEdgeList.IsEdgeUnwelded Method
 Determines if the mesh edge is unwelded, or if the mesh faces that share the edge have unique vertex indices.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.13
Syntax
public bool IsEdgeUnwelded(
	int topologyEdgeIndex
)
Public Function IsEdgeUnwelded (
	topologyEdgeIndex As Integer
) As Boolean
Parameters
topologyEdgeIndex
Type: System.Int32
An index of a topology edge in TopologyEdges.
Return Value
Type: Boolean
true if the edge is unwelded, false if the edge is welded.
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace