RhinoCommon API
TrulyObservableOrderedSet<T>.GetEnumerator Method
 Returns an enumerator that iterates through the set.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<T> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of T)
Return Value
Type: IEnumerator<T>
[Missing <returns> documentation for "M:Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace