RhinoCommon API
RenderMaterial.SlotFromTextureType Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.SlotFromTextureType(Rhino.DocObjects.TextureType)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public static RenderMaterial.StandardChildSlots SlotFromTextureType(
	TextureType tt
)
Public Shared Function SlotFromTextureType (
	tt As TextureType
) As RenderMaterial.StandardChildSlots
Parameters
tt
Type: Rhino.DocObjects.TextureType
[Missing <param name="tt"/> documentation for "M:Rhino.Render.RenderMaterial.SlotFromTextureType(Rhino.DocObjects.TextureType)"]
Return Value
Type: RenderMaterial.StandardChildSlots
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.SlotFromTextureType(Rhino.DocObjects.TextureType)"]
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace