RhinoCommon API
File3dmObjectTable.AddSubD Method (SubD, ObjectAttributes)
 Adds a SubD to the document
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Guid AddSubD(
	SubD subd,
	ObjectAttributes attributes
)
Public Function AddSubD (
	subd As SubD,
	attributes As ObjectAttributes
) As Guid
Parameters
subd
Type: Rhino.Geometry.SubD
the Subd to add
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply
Return Value
Type: Guid
A unique identifier for the SubD, or Empty on failure
See Also
Reference
File3dmObjectTable Class
AddSubD Overload
Rhino.FileIO Namespace