RhinoCommon API
AppearanceSettings.SetPaintColor Method (PaintColor, Color)
 Sets the logical paint color association to a specific .Net library color, without forced UI update.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void SetPaintColor(
	PaintColor whichColor,
	Color c
)
Public Shared Sub SetPaintColor (
	whichColor As PaintColor,
	c As Color
)
Parameters
whichColor
Type: Rhino.ApplicationSettings.PaintColor
A logical color association.
c
Type: System.Drawing.Color
A .Net library color.
See Also
Reference
AppearanceSettings Class
SetPaintColor Overload
Rhino.ApplicationSettings Namespace