RhinoCommon API
NurbsCurve.CreateFromArc Method (Arc)
 Gets a rational degree 2 NURBS curve representation of the arc. Note that the parameterization of NURBS curve does not match arc's transcendental parameterization.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static NurbsCurve CreateFromArc(
	Arc arc
)
Public Shared Function CreateFromArc (
	arc As Arc
) As NurbsCurve
Parameters
arc
Type: Rhino.Geometry.Arc
[Missing <param name="arc"/> documentation for "M:Rhino.Geometry.NurbsCurve.CreateFromArc(Rhino.Geometry.Arc)"]
Return Value
Type: NurbsCurve
Curve on success, null on failure.
See Also
Reference
NurbsCurve Class
CreateFromArc Overload
Rhino.Geometry Namespace