RhinoCommon API
LengthValue.Finalize Method
passively reclaim native allocated ON_LengthValue*
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
LengthValue Class
Rhino Namespace