RhinoCommon API
File3dmRenderEnvironments.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.FileIO.File3dmRenderEnvironments.GetEnumerator"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IEnumerator<File3dmRenderEnvironment> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of File3dmRenderEnvironment)
Return Value
Type: IEnumerator<File3dmRenderEnvironment>
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderEnvironments.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
File3dmRenderEnvironments Class
Rhino.FileIO Namespace