RhinoCommon API
Interop.PlugInPointer Method
 Gets a C++ plug-in pointer for a given RhinoCommon plug-in.
This is a Rhino SDK function.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static IntPtr PlugInPointer(
	PlugIn plugin
)
Public Shared Function PlugInPointer (
	plugin As PlugIn
) As IntPtr
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
A plug-in.
Return Value
Type: IntPtr
A pointer.
See Also
Reference
Interop Class
Rhino.Runtime Namespace