RhinoCommon API
SelectionFilterSettings.UpdateFromState Method
 Sets all settings to a particular defined joined state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static void UpdateFromState(
	SelectionFilterSettingsState state
)
Public Shared Sub UpdateFromState (
	state As SelectionFilterSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.SelectionFilterSettingsState
The particular state.
See Also
Reference
SelectionFilterSettings Class
Rhino.ApplicationSettings Namespace