RhinoCommon API
Mesh.Duplicate Method
 Constructs a copy of this mesh. This is the same as DuplicateMesh().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override GeometryBase Duplicate()
Public Overrides Function Duplicate As GeometryBase
Return Value
Type: GeometryBase
A mesh.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace