RhinoCommon API
PreviewGeometry.SetUpPreview Method
 SetUpPreview
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetUpPreview(
	IntPtr sceneServerPointer,
	IntPtr pRenderContent,
	bool bCopy
)
Public Sub SetUpPreview (
	sceneServerPointer As IntPtr,
	pRenderContent As IntPtr,
	bCopy As Boolean
)
Parameters
sceneServerPointer
Type: System.IntPtr
[Missing <param name="sceneServerPointer"/> documentation for "M:Rhino.Render.PreviewGeometry.SetUpPreview(System.IntPtr,System.IntPtr,System.Boolean)"]
pRenderContent
Type: System.IntPtr
[Missing <param name="pRenderContent"/> documentation for "M:Rhino.Render.PreviewGeometry.SetUpPreview(System.IntPtr,System.IntPtr,System.Boolean)"]
bCopy
Type: System.Boolean
[Missing <param name="bCopy"/> documentation for "M:Rhino.Render.PreviewGeometry.SetUpPreview(System.IntPtr,System.IntPtr,System.Boolean)"]
See Also
Reference
PreviewGeometry Class
Rhino.Render Namespace