RhinoCommon API
RenderPlugIn.OnCreateMaterial Method
 This function is called by the Object Properties and Layer Control dialogs when the "New" button is pressed in the "Material" tab. This is only called if EnableCreateMaterialButton returns true.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.12
Syntax
public virtual bool OnCreateMaterial(
	IntPtr parent,
	RhinoDoc doc,
	ref Material material
)
Public Overridable Function OnCreateMaterial (
	parent As IntPtr,
	doc As RhinoDoc,
	ByRef material As Material
) As Boolean
Parameters
parent
Type: System.IntPtr
[Missing <param name="parent"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.OnCreateMaterial(System.IntPtr,Rhino.RhinoDoc,Rhino.DocObjects.Material@)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.OnCreateMaterial(System.IntPtr,Rhino.RhinoDoc,Rhino.DocObjects.Material@)"]
material
Type: Rhino.DocObjects.Material
[Missing <param name="material"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.OnCreateMaterial(System.IntPtr,Rhino.RhinoDoc,Rhino.DocObjects.Material@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.RenderPlugIn.OnCreateMaterial(System.IntPtr,Rhino.RhinoDoc,Rhino.DocObjects.Material@)"]
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace