RhinoCommon API
Surface.CreateSoftEditSurface Method
 Creates a soft edited surface from an existing surface using a smooth field of influence.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Surface CreateSoftEditSurface(
	Surface surface,
	Point2d uv,
	Vector3d delta,
	double uLength,
	double vLength,
	double tolerance,
	bool fixEnds
)
Public Shared Function CreateSoftEditSurface (
	surface As Surface,
	uv As Point2d,
	delta As Vector3d,
	uLength As Double,
	vLength As Double,
	tolerance As Double,
	fixEnds As Boolean
) As Surface
Parameters
surface
Type: Rhino.Geometry.Surface
The surface to soft edit.
uv
Type: Rhino.Geometry.Point2d
 A point in the parameter space to move from. This location on the surface is moved, and the move is smoothly tapered off with increasing distance along the surface from this parameter.
delta
Type: Rhino.Geometry.Vector3d
The direction and magnitude, or maximum distance, of the move.
uLength
Type: System.Double
 The distance along the surface's u-direction from the editing point over which the strength of the editing falls off smoothly.
vLength
Type: System.Double
 The distance along the surface's v-direction from the editing point over which the strength of the editing falls off smoothly.
tolerance
Type: System.Double
The active document's model absolute tolerance.
fixEnds
Type: System.Boolean
Keeps edge locations fixed.
Return Value
Type: Surface
The soft edited surface if successful. null on failure.
See Also
Reference
Surface Class
Rhino.Geometry Namespace