RhinoCommon API
CollapsibleSectionHolderImpl.NewNativeWrapper Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.CollapsibleSectionHolderImpl.NewNativeWrapper(System.IntPtr)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ICollapsibleSectionHolder NewNativeWrapper(
	IntPtr cpp
)
Public Shared Function NewNativeWrapper (
	cpp As IntPtr
) As ICollapsibleSectionHolder
Parameters
cpp
Type: System.IntPtr
[Missing <param name="cpp"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionHolderImpl.NewNativeWrapper(System.IntPtr)"]
Return Value
Type: ICollapsibleSectionHolder
[Missing <returns> documentation for "M:Rhino.UI.Controls.CollapsibleSectionHolderImpl.NewNativeWrapper(System.IntPtr)"]
See Also
Reference
CollapsibleSectionHolderImpl Class
Rhino.UI.Controls Namespace