RhinoCommon API
FontTable.FindOrCreate Method (String, Boolean, Boolean, DimensionStyle)
 Get a DimensionStyle with the specified characteristics
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int FindOrCreate(
	string face,
	bool bold,
	bool italic,
	DimensionStyle template_style
)
Public Function FindOrCreate (
	face As String,
	bold As Boolean,
	italic As Boolean,
	template_style As DimensionStyle
) As Integer
Parameters
face
Type: System.String
[Missing <param name="face"/> documentation for "M:Rhino.DocObjects.Tables.FontTable.FindOrCreate(System.String,System.Boolean,System.Boolean,Rhino.DocObjects.DimensionStyle)"]
bold
Type: System.Boolean
[Missing <param name="bold"/> documentation for "M:Rhino.DocObjects.Tables.FontTable.FindOrCreate(System.String,System.Boolean,System.Boolean,Rhino.DocObjects.DimensionStyle)"]
italic
Type: System.Boolean
[Missing <param name="italic"/> documentation for "M:Rhino.DocObjects.Tables.FontTable.FindOrCreate(System.String,System.Boolean,System.Boolean,Rhino.DocObjects.DimensionStyle)"]
template_style
Type: Rhino.DocObjects.DimensionStyle
 the settings other than face, bold and italic are copied from the template_style
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.FontTable.FindOrCreate(System.String,System.Boolean,System.Boolean,Rhino.DocObjects.DimensionStyle)"]
See Also
Reference
FontTable Class
FindOrCreate Overload
Rhino.DocObjects.Tables Namespace