RhinoCommon API
IRhRdkThumbnail.IsSelected Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.IsSelected"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool IsSelected()
Function IsSelected As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.IsSelected"]
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls.ThumbnailUI Namespace