RhinoCommon API
ReplayHistoryData.AppendHistoryResult Method
 Create an empty history result and add it to the end of the Results array. Note that you should call Results again if you need them as the old Results array will be out of sync with this class.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public ReplayHistoryResult AppendHistoryResult()
Public Function AppendHistoryResult As ReplayHistoryResult
Return Value
Type: ReplayHistoryResult
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryData.AppendHistoryResult"]
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace