RhinoCommon API
RenderPipeline.CommandResult Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.CommandResult"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Result CommandResult()
Public Function CommandResult As Result
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.CommandResult"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace