RhinoCommon API
MeshVertexList.HideAll Method
 Hides all vertices in the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void HideAll()
Public Sub HideAll
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace