RhinoCommon API
GripUserInterfaceObject.Constrain Method (Line)
[Missing <summary> documentation for "M:Rhino.UI.GripUserInterfaceObject.Constrain(Rhino.Geometry.Line)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Constrain(
	Line line
)
Public Sub Constrain (
	line As Line
)
Parameters
line
Type: Rhino.Geometry.Line
[Missing <param name="line"/> documentation for "M:Rhino.UI.GripUserInterfaceObject.Constrain(Rhino.Geometry.Line)"]
See Also
Reference
GripUserInterfaceObject Class
Constrain Overload
Rhino.UI Namespace