RhinoCommon API
CommandAliasList.SetMacro Method
Modifies the macro of a command alias.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool SetMacro(
	string alias,
	string macro
)
Public Shared Function SetMacro (
	alias As String,
	macro As String
) As Boolean
Parameters
alias
Type: System.String
[in] The name of the command alias.
macro
Type: System.String
[in] The new command macro to run when the alias is executed.
Return Value
Type: Boolean
true if successful.
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace