RhinoCommon API
PreviewAppearance.Duplicate Method
 Deep copy
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PreviewAppearance Duplicate()
Public Function Duplicate As PreviewAppearance
Return Value
Type: PreviewAppearance
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.Duplicate"]
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace