RhinoCommon API
Decal.TextureRenderHash Method (CrcRenderHashFlags, LinearWorkflow)
Note: This API is now obsolete.
 Get the texture render hash for the referenced texture using the specified CrcRenderHashFlags and linear workflow.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
[ObsoleteAttribute("Do not use")]
public uint TextureRenderHash(
	CrcRenderHashFlags flags,
	LinearWorkflow lw
)
<ObsoleteAttribute("Do not use")>
Public Function TextureRenderHash (
	flags As CrcRenderHashFlags,
	lw As LinearWorkflow
) As UInteger
Parameters
flags
Type: Rhino.Render.CrcRenderHashFlags
[Missing <param name="flags"/> documentation for "M:Rhino.Render.Decal.TextureRenderHash(Rhino.Render.CrcRenderHashFlags,Rhino.Render.LinearWorkflow)"]
lw
Type: Rhino.Render.LinearWorkflow
[Missing <param name="lw"/> documentation for "M:Rhino.Render.Decal.TextureRenderHash(Rhino.Render.CrcRenderHashFlags,Rhino.Render.LinearWorkflow)"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.Decal.TextureRenderHash(Rhino.Render.CrcRenderHashFlags,Rhino.Render.LinearWorkflow)"]
See Also
Reference
Decal Class
TextureRenderHash Overload
Rhino.Render Namespace