RhinoCommon API
FileRawReadOptions Constructor
Initializes a new instance of the FileRawReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileRawReadOptions()
Public Sub New
See Also
Reference
FileRawReadOptions Class
Rhino.FileIO Namespace