RhinoCommon API
SupportOptions.EnablePreviewJobLog Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.EnablePreviewJobLog"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool EnablePreviewJobLog()
Public Shared Function EnablePreviewJobLog As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.EnablePreviewJobLog"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace