RhinoCommon API
Intersection.MeshLine Method (Mesh, Line)
 Finds the intersections of a mesh and a line.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public static Point3d[] MeshLine(
	Mesh mesh,
	Line line
)
Public Shared Function MeshLine (
	mesh As Mesh,
	line As Line
) As Point3d()
Parameters
mesh
Type: Rhino.Geometry.Mesh
A mesh to intersect
line
Type: Rhino.Geometry.Line
The line to intersect with the mesh
Return Value
Type: Point3d[]
An array of points: one for each face that was passed by the faceIds out reference. Empty if no items are found.
See Also
Reference
Intersection Class
MeshLine Overload
Rhino.Geometry.Intersect Namespace