RhinoCommon API
RhinoObject.GetRenderPrimitiveList Method (ViewportInfo, DisplayPipelineAttributes)
Note: This API is now obsolete.
 Build custom render mesh(es) for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("This version is obsolete because it returns the obsolete RenderPrimitiveList - ie, the old school custom render meshes.  Use CustomRenderMeshes instead.")]
public RenderPrimitiveList GetRenderPrimitiveList(
	ViewportInfo viewport,
	DisplayPipelineAttributes attrs
)
<ObsoleteAttribute("This version is obsolete because it returns the obsolete RenderPrimitiveList - ie, the old school custom render meshes.  Use CustomRenderMeshes instead.")>
Public Function GetRenderPrimitiveList (
	viewport As ViewportInfo,
	attrs As DisplayPipelineAttributes
) As RenderPrimitiveList
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
attrs
Type: Rhino.Display.DisplayPipelineAttributes
 Attributes for the view mode you are supplying meshes for. Will be null if this is a modal rendering.
Return Value
Type: RenderPrimitiveList
 Returns a RenderPrimitiveList if successful otherwise returns null.
See Also
Reference
RhinoObject Class
GetRenderPrimitiveList Overload
Rhino.DocObjects Namespace