RhinoCommon API
NurbsCurvePointList.GetPoint Method (Int32, Point4d)
 Gets a homogeneous control point at the given index, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool GetPoint(
	int index,
	out Point4d point
)
Public Function GetPoint (
	index As Integer,
	<OutAttribute> ByRef point As Point4d
) As Boolean
Parameters
index
Type: System.Int32
Index of control point to get.
point
Type: Rhino.Geometry.Point4d
Coordinate and weight of control point.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
 For expert use only. If you do not understand homogeneous coordinates, then use the override that returns world 3-D, or Euclidean, coordinates.
See Also
Reference
NurbsCurvePointList Class
GetPoint Overload
Rhino.Geometry.Collections Namespace