RhinoCommon API
Circle.TryFitCircleToPoints Method
 Attempt to fit a circle through a set of points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public static bool TryFitCircleToPoints(
	IEnumerable<Point3d> points,
	out Circle circle
)
Public Shared Function TryFitCircleToPoints (
	points As IEnumerable(Of Point3d),
	<OutAttribute> ByRef circle As Circle
) As Boolean
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
The points through which to fit.
circle
Type: Rhino.Geometry.Circle
The resulting circle on success.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Circle Structure
Rhino.Geometry Namespace