RhinoCommon API
File3dm.Audit Method
Note: This API is now obsolete.
 This function is only kept for forward assembly compatibility.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Polish and Audit functionality no longer exist.")]
public int Audit(
	bool attemptRepair,
	out int repairCount,
	out string errors,
	out int[] warnings
)
<ObsoleteAttribute("Polish and Audit functionality no longer exist.")>
Public Function Audit (
	attemptRepair As Boolean,
	<OutAttribute> ByRef repairCount As Integer,
	<OutAttribute> ByRef errors As String,
	<OutAttribute> ByRef warnings As Integer()
) As Integer
Parameters
attemptRepair
Type: System.Boolean
 Ignored.
repairCount
Type: System.Int32
Is set to 0.
errors
Type: System.String
 Contains no meaningful error.
warnings
Type: System.Int32[]
Is set to null.
Return Value
Type: Int32
 Returns 0.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace