RhinoCommon API
DisplayAttributeMaterial.GetTextures Method
 Gets every texture this material uses.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Texture[] GetTextures()
Public Function GetTextures As Texture()
Return Value
Type: Texture[]
[Missing <returns> documentation for "M:Rhino.Display.DisplayAttributeMaterial.GetTextures"]
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace