RhinoCommon API
RhinoMath.EvaluateNormalPartials Method
 Expert tool to evaluate partial derivatives of surface unit normal.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool EvaluateNormalPartials(
	Vector3d ds,
	Vector3d dt,
	Vector3d dss,
	Vector3d dst,
	Vector3d dtt,
	out Vector3d ns,
	out Vector3d nt
)
Public Shared Function EvaluateNormalPartials (
	ds As Vector3d,
	dt As Vector3d,
	dss As Vector3d,
	dst As Vector3d,
	dtt As Vector3d,
	<OutAttribute> ByRef ns As Vector3d,
	<OutAttribute> ByRef nt As Vector3d
) As Boolean
Parameters
ds
Type: Rhino.Geometry.Vector3d
First partial derivative.
dt
Type: Rhino.Geometry.Vector3d
First partial derivative.
dss
Type: Rhino.Geometry.Vector3d
Second partial derivative.
dst
Type: Rhino.Geometry.Vector3d
Second partial derivative.
dtt
Type: Rhino.Geometry.Vector3d
Second partial derivative.
ns
Type: Rhino.Geometry.Vector3d
First partial derivative of unit normal. If the Jacobian is degenerate, ns is set to zero.
nt
Type: Rhino.Geometry.Vector3d
First partial derivative of unit normal. If the Jacobian is degenerate, nt is set to zero.
Return Value
Type: Boolean
true if Jacobian is non-degenerate, false if Jacobian is degenerate.
See Also
Reference
RhinoMath Class
Rhino Namespace