RhinoCommon API
BoundingBox Constructor (IEnumerable<Point3d>, Transform)
 Constructs a bounding box from a collection of points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public BoundingBox(
	IEnumerable<Point3d> points,
	Transform xform
)
Public Sub New (
	points As IEnumerable(Of Point3d),
	xform As Transform
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to include in the bounding box.
xform
Type: Rhino.Geometry.Transform
Transformation.
See Also
Reference
BoundingBox Structure
BoundingBox Overload
Rhino.Geometry Namespace