RhinoCommon API
SelCommand Constructor
Initializes a new instance of the SelCommand class
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected SelCommand()
Protected Sub New
See Also
Reference
SelCommand Class
Rhino.Commands Namespace