RhinoCommon API
SubDEdgeSharpness.EqualEndSharpness Method
 Determines whether two sharpnesses meet with the same value, that is, whether s0.EndSharpness(1) equals s1.EndSharpness(0).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static bool EqualEndSharpness(
	SubDEdgeSharpness s0,
	SubDEdgeSharpness s1
)
Public Shared Function EqualEndSharpness (
	s0 As SubDEdgeSharpness,
	s1 As SubDEdgeSharpness
) As Boolean
Parameters
s0
Type: Rhino.Geometry.SubDEdgeSharpness
The sharpness of the first edge.
s1
Type: Rhino.Geometry.SubDEdgeSharpness
The sharpness of the second edge.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgeSharpness.EqualEndSharpness(Rhino.Geometry.SubDEdgeSharpness,Rhino.Geometry.SubDEdgeSharpness)"]
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace