RhinoCommon API
ObjectAttributes Constructor
Initializes a new instance of the ObjectAttributes class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ObjectAttributes()
Public Sub New
See Also
Reference
ObjectAttributes Class
ObjectAttributes Overload
Rhino.DocObjects Namespace