RhinoCommon API
Brep.CreateFilletEdgesVariableRadius Method
 Fillets, chamfers, or blends the edges of a brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public static Brep[] CreateFilletEdgesVariableRadius(
	Brep brep,
	IEnumerable<int> edgeIndices,
	IDictionary<int, IList<BrepEdgeFilletDistance>> edgeDistances,
	BlendType blendType,
	RailType railType,
	bool setbackFillets,
	double tolerance,
	double angleTolerance
)
Public Shared Function CreateFilletEdgesVariableRadius (
	brep As Brep,
	edgeIndices As IEnumerable(Of Integer),
	edgeDistances As IDictionary(Of Integer, IList(Of BrepEdgeFilletDistance)),
	blendType As BlendType,
	railType As RailType,
	setbackFillets As Boolean,
	tolerance As Double,
	angleTolerance As Double
) As Brep()
Parameters
brep
Type: Rhino.Geometry.Brep
The brep to fillet, chamfer, or blend edges.
edgeIndices
Type: System.Collections.Generic.IEnumerable<Int32>
An array of one or more edge indices where the fillet, chamfer, or blend will occur.
edgeDistances
Type: System.Collections.Generic.IDictionary<Int32, IList<BrepEdgeFilletDistance>>
A dictionary with key the edge index on the input brep, and value a list of BrepEdgeFilletDistance items to apply.
blendType
Type: Rhino.Geometry.BlendType
The blend type.
railType
Type: Rhino.Geometry.RailType
The rail type.
setbackFillets
Type: System.Boolean
Use setback fillets (not used with blendType=Chamfer)
tolerance
Type: System.Double
The tolerance to be used to perform calculations.
angleTolerance
Type: System.Double
Angle tolerance to be used to perform calculations [radians].
Return Value
Type: Brep[]
Array of Breps if successful.
See Also
Reference
Brep Class
Rhino.Geometry Namespace