RhinoCommon API
RenderContentCollection.FirstTag Method
 Gets the first tag
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.13
Syntax
public string FirstTag()
Public Function FirstTag As String
Return Value
Type: String
The first tag
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace