RhinoCommon API
MeshTopologyVertexList.ConnectedEdge Method
 Gets a particular edge that is connected to a topological vertex.
Call TopologyVertices.SortVertices before this if you are interested in ordered edges.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int ConnectedEdge(
	int topologyVertexIndex,
	int edgeAtVertexIndex
)
Public Function ConnectedEdge (
	topologyVertexIndex As Integer,
	edgeAtVertexIndex As Integer
) As Integer
Parameters
topologyVertexIndex
Type: System.Int32
Index of a topology vertex in Mesh.TopologyVertices.
edgeAtVertexIndex
Type: System.Int32
Index of the edge at the vertex.
Return Value
Type: Int32
 The index of the connected edge.
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace