RhinoCommon API
PlugIn.PlugInExists Method
 Verifies that a Rhino plug-in is installed.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool PlugInExists(
	Guid id,
	out bool loaded,
	out bool loadProtected
)
Public Shared Function PlugInExists (
	id As Guid,
	<OutAttribute> ByRef loaded As Boolean,
	<OutAttribute> ByRef loadProtected As Boolean
) As Boolean
Parameters
id
Type: System.Guid
The id of the plug-in.
loaded
Type: System.Boolean
The loaded state of the plug-in.
loadProtected
Type: System.Boolean
The load protected state of the plug-in.
Return Value
Type: Boolean
Returns true if the plug-in exists, or is installed.
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace