RhinoCommon API
RenderMeshProvider.SetParameter Method
[Missing <summary> documentation for "M:Rhino.Render.CustomRenderMeshes.RenderMeshProvider.SetParameter(Rhino.RhinoDoc,System.Guid,System.String,System.Object)"]
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public virtual void SetParameter(
	RhinoDoc doc,
	Guid objectId,
	string parameterName,
	Object value
)
Public Overridable Sub SetParameter (
	doc As RhinoDoc,
	objectId As Guid,
	parameterName As String,
	value As Object
)
Parameters
doc
Type: Rhino.RhinoDoc
The Rhino document of interest.
objectId
Type: System.Guid
The objectId for which the parameter should be supplied.
parameterName
Type: System.String
The name of the parameter.
value
Type: System.Object
The value to set.
Return Value
Type:
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace