RhinoCommon API
RhinoApp.Wait Method
 Pauses to keep OS message pump alive.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void Wait()
Public Shared Sub Wait
See Also
Reference
RhinoApp Class
Rhino Namespace