RhinoCommon API
File3dmRenderContent.DeleteChild Method
 Deletes any existing child with the specified child slot name. True if successful, else false.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool DeleteChild(
	string child_slot_name
)
Public Function DeleteChild (
	child_slot_name As String
) As Boolean
Parameters
child_slot_name
Type: System.String
[Missing <param name="child_slot_name"/> documentation for "M:Rhino.FileIO.File3dmRenderContent.DeleteChild(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderContent.DeleteChild(System.String)"]
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace