RhinoCommon API
BezierSurface.GetControlVertex4d Method
Get location of a control vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Point4d GetControlVertex4d(
	int i,
	int j
)
Public Function GetControlVertex4d (
	i As Integer,
	j As Integer
) As Point4d
Parameters
i
Type: System.Int32
 Control vertex index (0 <= index < ControlVertexCount)
j
Type: System.Int32
 Control vertex index (0 <= index < ControlVertexCount)
Return Value
Type: Point4d
 Homogeneous value of control vertex. If the bezier is not rational, the weight is 1.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | when index is out of range
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace