RhinoCommon API
Curve.DivideByCount Method (Int32, Boolean, Point3d[])
 Divide the curve into a number of equal-length segments.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double[] DivideByCount(
	int segmentCount,
	bool includeEnds,
	out Point3d[] points
)
Public Function DivideByCount (
	segmentCount As Integer,
	includeEnds As Boolean,
	<OutAttribute> ByRef points As Point3d()
) As Double()
Parameters
segmentCount
Type: System.Int32
Segment count. Note that the number of division points may differ from the segment count.
includeEnds
Type: System.Boolean
If true, then the point at the start of the first division segment is returned.
points
Type: Rhino.Geometry.Point3d[]
A list of division points. If the function returns successfully, this point-array will be filled in.
Return Value
Type: Double[]
Array containing division curve parameters on success, null on failure.
See Also
Reference
Curve Class
DivideByCount Overload
Rhino.Geometry Namespace