RhinoCommon API
IndexPair.CopyTo Method
 Copies the elements of the IndexPair to an Array, starting at a particular Array index.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void CopyTo(
	int[] array,
	int arrayIndex
)
Public Sub CopyTo (
	array As Integer(),
	arrayIndex As Integer
)
Parameters
array
Type: System.Int32[]
The one-dimensional Array that is the destination of the elements copied from IndexPair. The Array must have zero-based indexing.
arrayIndex
Type: System.Int32
The zero-based index in array at which copying begins.
Implements
ICollection<T>.CopyTo(T[], Int32)
Exceptions
Exception | Condition
ArgumentNullException | array is null.
ArgumentOutOfRangeException | arrayIndex is less than 0 or arrayIndex is greater than or equals the length of array minus 2.
ArgumentException | The length of the array is less than 2.
See Also
Reference
IndexPair Structure
Rhino Namespace