RhinoCommon API
RhinoObject.GetCustomRenderMeshParameter Method
 Query the object for the value of a given named custom render mesh parameter.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual IConvertible GetCustomRenderMeshParameter(
	Guid providerId,
	string parameterName
)
Public Overridable Function GetCustomRenderMeshParameter (
	providerId As Guid,
	parameterName As String
) As IConvertible
Parameters
providerId
Type: System.Guid
Id of the custom render mesh provider
parameterName
Type: System.String
Name of the parameter
Return Value
Type: IConvertible
IConvertible. Note that you can't directly cast from object, instead you have to use the Convert mechanism.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace