RhinoCommon API
RenderPipeline.GetRenderWindow Method (Boolean)
 As GetRenderWindow(), but if withWireframeChannel is true the returned RenderWindow will have the channel added.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderWindow GetRenderWindow(
	bool withWireframeChannel
)
Public Function GetRenderWindow (
	withWireframeChannel As Boolean
) As RenderWindow
Parameters
withWireframeChannel
Type: System.Boolean
[Missing <param name="withWireframeChannel"/> documentation for "M:Rhino.Render.RenderPipeline.GetRenderWindow(System.Boolean)"]
Return Value
Type: RenderWindow
RenderWindow with wireframe channel enabled, or null if no RenderWindow can be found (i.e. rendering has completed already)
See Also
Reference
RenderPipeline Class
GetRenderWindow Overload
Rhino.Render Namespace