RhinoCommon API
GetCancel.WaitAll Method (IEnumerable<Task>, RhinoDoc)
 Awaits some tasks to finish.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Result WaitAll(
	IEnumerable<Task> tasks,
	RhinoDoc doc
)
Public Function WaitAll (
	tasks As IEnumerable(Of Task),
	doc As RhinoDoc
) As Result
Parameters
tasks
Type: System.Collections.Generic.IEnumerable<Task>
The tasks.
doc
Type: Rhino.RhinoDoc
A document to set progress reporting.
Return Value
Type: Result
A result enumeration.
See Also
Reference
GetCancel Class
WaitAll Overload
Rhino.Input.Custom Namespace