RhinoCommon API
NurbsSurfacePointList.UVNDirectionsAt Method
 Calculates the U, V, and N directions of a NURBS surface control point similar to the method used by Rhino's MoveUVN command.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool UVNDirectionsAt(
	int u,
	int v,
	out Vector3d uDir,
	out Vector3d vDir,
	out Vector3d nDir
)
Public Function UVNDirectionsAt (
	u As Integer,
	v As Integer,
	<OutAttribute> ByRef uDir As Vector3d,
	<OutAttribute> ByRef vDir As Vector3d,
	<OutAttribute> ByRef nDir As Vector3d
) As Boolean
Parameters
u
Type: System.Int32
Index of control-point along surface U direction.
v
Type: System.Int32
Index of control-point along surface V direction.
uDir
Type: Rhino.Geometry.Vector3d
The U direction.
vDir
Type: Rhino.Geometry.Vector3d
The V direction.
nDir
Type: Rhino.Geometry.Vector3d
The N direction.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace