RhinoCommon API
FileRawWriteOptions Constructor
Initializes a new instance of the FileRawWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileRawWriteOptions()
Public Sub New
See Also
Reference
FileRawWriteOptions Class
Rhino.FileIO Namespace