RhinoCommon API
ILocalizationService.LocalizeForm Method
[Missing <summary> documentation for "M:Rhino.UI.ILocalizationService.LocalizeForm(System.Reflection.Assembly,System.Int32,System.Object)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
void LocalizeForm(
	Assembly assembly,
	int languageId,
	Object formOrUserControl
)
Sub LocalizeForm (
	assembly As Assembly,
	languageId As Integer,
	formOrUserControl As Object
)
Parameters
assembly
Type: System.Reflection.Assembly
[Missing <param name="assembly"/> documentation for "M:Rhino.UI.ILocalizationService.LocalizeForm(System.Reflection.Assembly,System.Int32,System.Object)"]
languageId
Type: System.Int32
[Missing <param name="languageId"/> documentation for "M:Rhino.UI.ILocalizationService.LocalizeForm(System.Reflection.Assembly,System.Int32,System.Object)"]
formOrUserControl
Type: System.Object
[Missing <param name="formOrUserControl"/> documentation for "M:Rhino.UI.ILocalizationService.LocalizeForm(System.Reflection.Assembly,System.Int32,System.Object)"]
See Also
Reference
ILocalizationService Interface
Rhino.UI Namespace