RhinoCommon API
GroupTable.ChangeGroupName Method
 Changes the name of a group.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ChangeGroupName(
	int groupIndex,
	string newName
)
Public Function ChangeGroupName (
	groupIndex As Integer,
	newName As String
) As Boolean
Parameters
groupIndex
Type: System.Int32
The index of the group.
newName
Type: System.String
The new group name.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace