RhinoCommon API
PersistentSettings.TryGetColor Method (String, Nullable<Color>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetColor(System.String,System.Nullable{System.Drawing.Color}@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetColor(
	string key,
	out Color? value
)
Public Function TryGetColor (
	key As String,
	<OutAttribute> ByRef value As Color?
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetColor(System.String,System.Nullable{System.Drawing.Color}@)"]
value
Type: System.Nullable<Color>
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetColor(System.String,System.Nullable{System.Drawing.Color}@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetColor(System.String,System.Nullable{System.Drawing.Color}@)"]
See Also
Reference
PersistentSettings Class
TryGetColor Overload
Rhino Namespace