RhinoCommon API
ObjectTable.Replace Method (Guid, Leader)
Replaces one object with new text object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Replace(
	Guid objectId,
	Leader leader
)
Public Function Replace (
	objectId As Guid,
	leader As Leader
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
leader
Type: Rhino.Geometry.Leader
new leader to be added. The leader is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace