RhinoCommon API
TwoColorRenderTexture Constructor
Initializes a new instance of the TwoColorRenderTexture class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
protected TwoColorRenderTexture()
Protected Sub New
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace