RhinoCommon API
BinaryArchiveReader.ReadDictionary Method
 Reads a complete ArchivableDictionary from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ArchivableDictionary ReadDictionary()
Public Function ReadDictionary As ArchivableDictionary
Return Value
Type: ArchivableDictionary
The newly instantiated object.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace