RhinoCommon API
GeometryBase.MemoryEstimate Method
 Computes an estimate of the number of bytes that this object is using in memory.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public uint MemoryEstimate()
Public Function MemoryEstimate As UInteger
Return Value
Type: UInt32
An estimated memory footprint.
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace