RhinoCommon API
OpenGLSettings Constructor
Initializes a new instance of the OpenGLSettings class
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public OpenGLSettings()
Public Sub New
See Also
Reference
OpenGLSettings Class
Rhino.ApplicationSettings Namespace