RhinoCommon API
ArchivableDictionary.TryGetDictionary Method
 Get value as ArchivableDictionary, will only succeed if value was created using Set(string key, ArchivableDictionary value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public bool TryGetDictionary(
	string key,
	out ArchivableDictionary value
)
Public Function TryGetDictionary (
	key As String,
	<OutAttribute> ByRef value As ArchivableDictionary
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetDictionary(System.String,Rhino.Collections.ArchivableDictionary@)"]
value
Type: Rhino.Collections.ArchivableDictionary
[Missing <param name="value"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetDictionary(System.String,Rhino.Collections.ArchivableDictionary@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetDictionary(System.String,Rhino.Collections.ArchivableDictionary@)"]
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace