RhinoCommon API
OrdinateDimension Constructor
Initializes a new instance of the OrdinateDimension class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public OrdinateDimension()
Public Sub New
See Also
Reference
OrdinateDimension Class
OrdinateDimension Overload
Rhino.Geometry Namespace