RhinoCommon API
HatchPattern.AddHatchLine Method
 Add a HatchLine to the pattern.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int AddHatchLine(
	HatchLine hatchLine
)
Public Function AddHatchLine (
	hatchLine As HatchLine
) As Integer
Parameters
hatchLine
Type: Rhino.DocObjects.HatchLine
The hatch line to add.
Return Value
Type: Int32
The index of newly added hatch line, or -1 on failure.
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace