RhinoCommon API
Mesh.RebuildMesh Method (Mesh, Boolean, Boolean)
 Use this function to rebuild meshes that are not acting properly. Vertices and faces are kept. Face normals and vertex normals are recalculated. Surface curvatures, and surfaces parameters are not replaced.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.23
Syntax
public static Mesh RebuildMesh(
	Mesh mesh,
	bool preserveTextureCoordinates,
	bool preserveVertexColors
)
Public Shared Function RebuildMesh (
	mesh As Mesh,
	preserveTextureCoordinates As Boolean,
	preserveVertexColors As Boolean
) As Mesh
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to be rebuilt.
preserveTextureCoordinates
Type: System.Boolean
Retains mesh texture coordinates.
preserveVertexColors
Type: System.Boolean
Retains mesh vertex colors.
Return Value
Type: Mesh
The rebuilt mesh if successful, null otherwise.
See Also
Reference
Mesh Class
RebuildMesh Overload
Rhino.Geometry Namespace