RhinoCommon API
RenderSettings.SetRenderEnvironmentOverride Method
 Set the given environment override on/off. Only works for usage Reflection and Skylighting.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetRenderEnvironmentOverride(
	RenderSettings.EnvironmentUsage usage,
	bool on
)
Public Sub SetRenderEnvironmentOverride (
	usage As RenderSettings.EnvironmentUsage,
	on As Boolean
)
Parameters
usage
Type: Rhino.Render.RenderSettings.EnvironmentUsage
[Missing <param name="usage"/> documentation for "M:Rhino.Render.RenderSettings.SetRenderEnvironmentOverride(Rhino.Render.RenderSettings.EnvironmentUsage,System.Boolean)"]
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Render.RenderSettings.SetRenderEnvironmentOverride(Rhino.Render.RenderSettings.EnvironmentUsage,System.Boolean)"]
See Also
Reference
RenderSettings Class
Rhino.Render Namespace