RhinoCommon API
File3dmCommonComponentTable<T>.Add Method
 Adds an item.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void Add(
	T item
)
Public Overridable Sub Add (
	item As T
)
Parameters
item
Type: T
The item to add.
See Also
Reference
File3dmCommonComponentTable<T> Class
Rhino.FileIO Namespace