RhinoCommon API
MeshInstance.AncestryRecord.Finalize Method
 Finalizer
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
MeshInstance.AncestryRecord Class
Rhino.Render.ChangeQueue Namespace