RhinoCommon API
RenderTexture.GetProceduralVcNoiseArrayPointer Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetProceduralVcNoiseArrayPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static IntPtr GetProceduralVcNoiseArrayPointer()
Public Shared Function GetProceduralVcNoiseArrayPointer As IntPtr
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetProceduralVcNoiseArrayPointer"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace