RhinoCommon API
PlugIn.PathFromName Method
 Gets the path to an installed plug-in given the name of that plug-in
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public static string PathFromName(
	string pluginName
)
Public Shared Function PathFromName (
	pluginName As String
) As String
Parameters
pluginName
Type: System.String
[Missing <param name="pluginName"/> documentation for "M:Rhino.PlugIns.PlugIn.PathFromName(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.PathFromName(System.String)"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace