RhinoCommon API
SupportOptions.BlockContent_InitialLocationCustomFolder Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.BlockContent_InitialLocationCustomFolder"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static string BlockContent_InitialLocationCustomFolder()
Public Shared Function BlockContent_InitialLocationCustomFolder As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.BlockContent_InitialLocationCustomFolder"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace