RhinoCommon API
SubDSurfaceInterpolator.VertexIdList Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDSurfaceInterpolator.VertexIdList"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public uint[] VertexIdList()
Public Function VertexIdList As UInteger()
Return Value
Type: UInt32[]
 List of indices of the vertices with interpolated surface points. Vertices that are not in this vertex list have unchanged control net points.
See Also
Reference
SubDSurfaceInterpolator Class
Rhino.Geometry Namespace