RhinoCommon API
Worksession.Update Method
 Re-reads a reference model whose file has changed on disk.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Update(
	uint modelSerialNumber
)
Public Function Update (
	modelSerialNumber As UInteger
) As Boolean
Parameters
modelSerialNumber
Type: System.UInt32
 The reference model's serial number, from SerialNumber. Pass 0 to update every out-of-date reference model in this worksession.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace