RhinoCommon API
Brep.GetArea Method
 Compute the Area of the Brep. If you want proper Area data with moments and error information, use the AreaMassProperties class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double GetArea()
Public Function GetArea As Double
Return Value
Type: Double
The area of the Brep.
See Also
Reference
Brep Class
GetArea Overload
Rhino.Geometry Namespace