RhinoCommon API
Intersection.CurveBrep Method (Curve, Brep, Double, Curve[], Point3d[], Double[])
 Intersects a curve with a Brep. This function returns the 3D points of intersection, curve parameters at the intersection locations, and 3D overlap curves. If an error occurs while processing overlap curves, this function will return false, but it will still provide partial results.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool CurveBrep(
	Curve curve,
	Brep brep,
	double tolerance,
	out Curve[] overlapCurves,
	out Point3d[] intersectionPoints,
	out double[] curveParameters
)
Public Shared Function CurveBrep (
	curve As Curve,
	brep As Brep,
	tolerance As Double,
	<OutAttribute> ByRef overlapCurves As Curve(),
	<OutAttribute> ByRef intersectionPoints As Point3d(),
	<OutAttribute> ByRef curveParameters As Double()
) As Boolean
Parameters
curve
Type: Rhino.Geometry.Curve
Curve for intersection.
brep
Type: Rhino.Geometry.Brep
Brep for intersection.
tolerance
Type: System.Double
Fitting and near miss tolerance.
overlapCurves
Type: Rhino.Geometry.Curve[]
The overlap curves will be returned here.
intersectionPoints
Type: Rhino.Geometry.Point3d[]
The intersection points will be returned here.
curveParameters
Type: System.Double[]
The intersection curve parameters will be returned here.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Intersection Class
CurveBrep Overload
Rhino.Geometry.Intersect Namespace