RhinoCommon API
CommonObject.NonConstOperation Method
 For derived classes implementers.
Defines the necessary implementation to free the instance from being constant.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void NonConstOperation()
Protected Overridable Sub NonConstOperation
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace