RhinoCommon API
FilePly.Read Method
Read a PLY file into a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	FilePlyReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As FilePlyReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.FilePlyReadOptions
options used for importing the PLY file
Return Value
Type: Boolean
true on success
See Also
Reference
FilePly Class
Rhino.FileIO Namespace