RhinoCommon API
HostUtils.CheckForRdk Method
 Determines if the RDK is loaded.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool CheckForRdk(
	bool throwOnFalse,
	bool usePreviousResult
)
Public Shared Function CheckForRdk (
	throwOnFalse As Boolean,
	usePreviousResult As Boolean
) As Boolean
Parameters
throwOnFalse
Type: System.Boolean
if the RDK is not loaded, then throws a RdkNotLoadedException.
usePreviousResult
Type: System.Boolean
if true, then the last result can be used instaed of performing a full check.
Return Value
Type: Boolean
true if the RDK is loaded; false if the RDK is not loaded. Note that the RdkNotLoadedException will hinder the retrieval of any return value.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace