RhinoCommon API
Curve.CombineShortSegments Method
 Looks for segments that are shorter than tolerance that can be combined. For NURBS of degree greater than 1, spans are combined by removing knots. Similarly for NURBS segments of polycurves. Otherwise, RemoveShortSegments() is called. Does not change the domain, but it will change the relative parameterization.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public bool CombineShortSegments(
	double tolerance
)
Public Function CombineShortSegments (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.Curve.CombineShortSegments(System.Double)"]
Return Value
Type: Boolean
 True if short segments were combined or removed. False otherwise.
See Also
Reference
Curve Class
Rhino.Geometry Namespace