RhinoCommon API
File3dsReadOptions Constructor
Initializes a new instance of the File3dsReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dsReadOptions()
Public Sub New
See Also
Reference
File3dsReadOptions Class
Rhino.FileIO Namespace