RhinoCommon API
File3dmShutLining.GetCurves Method
 Gets all the curves on the shut-lining. Each curve is identified by a Guid. If there are no curves present, the array will be empty.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid[] GetCurves()
Public Function GetCurves As Guid()
Return Value
Type: Guid[]
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmShutLining.GetCurves"]
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace