RhinoCommon API
GetCancel.Wait Method (Task, RhinoDoc)
 Awaits a particular task to finish.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Result Wait(
	Task task,
	RhinoDoc doc
)
Public Function Wait (
	task As Task,
	doc As RhinoDoc
) As Result
Parameters
task
Type: System.Threading.Tasks.Task
The task.
doc
Type: Rhino.RhinoDoc
A document to set progress reporting.
Return Value
Type: Result
A result enumeration.
See Also
Reference
GetCancel Class
Wait Overload
Rhino.Input.Custom Namespace