RhinoCommon API
Brep.FilletSurfaceSettings.CreateRationalArcSettings Method
 Create settings for rational arc fillet surfaces
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Brep.FilletSurfaceSettings CreateRationalArcSettings(
	double radius,
	double tolerance,
	bool trim,
	bool extend
)
Public Shared Function CreateRationalArcSettings (
	radius As Double,
	tolerance As Double,
	trim As Boolean,
	extend As Boolean
) As Brep.FilletSurfaceSettings
Parameters
radius
Type: System.Double
The fillet radius.
tolerance
Type: System.Double
The tolerance. When in doubt, use the document's model absolute tolerance.
trim
Type: System.Boolean
If true, the input faces will be trimmed, if false, the input faces will be split.
extend
Type: System.Boolean
If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
Return Value
Type: Brep.FilletSurfaceSettings
[Missing <returns> documentation for "M:Rhino.Geometry.Brep.FilletSurfaceSettings.CreateRationalArcSettings(System.Double,System.Double,System.Boolean,System.Boolean)"]
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace