RhinoCommon API
BoundingBox.IsDisjoint Method (BoundingBox)
 Determines whether this bounding box and another bounding box are disjoint, that is, whether they do not intersect.
This is the same as calling IsDisjoint(box, 0.0).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsDisjoint(
	BoundingBox box
)
Public Function IsDisjoint (
	box As BoundingBox
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to test.
Return Value
Type: Boolean
true if this bounding box and box are disjoint.
Remarks
 If either box is invalid, then true is returned. Boxes that merely touch are not disjoint.
See Also
Reference
BoundingBox Structure
IsDisjoint Overload
Rhino.Geometry Namespace