RhinoCommon API
TextureMapping.TryGetMappingMesh Method
 Get custom mapping mesh from this texture mapping.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public bool TryGetMappingMesh(
	out Mesh mesh
)
Public Function TryGetMappingMesh (
	<OutAttribute> ByRef mesh As Mesh
) As Boolean
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.Render.TextureMapping.TryGetMappingMesh(Rhino.Geometry.Mesh@)"]
Return Value
Type: Boolean
True if custom mapping mesh was returned.
See Also
Reference
TextureMapping Class
Rhino.Render Namespace