RhinoCommon API
RhinoObject.GetRenderPrimitiveList Method (ViewportInfo, Boolean)
Note: This API is now obsolete.
 Build custom render mesh(es) for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
[ObsoleteAttribute("This version is obsolete because it returns the obsolete RenderPrimitiveList - ie, the old school custom render meshes.  Use CustomRenderMeshes instead.")]
public RenderPrimitiveList GetRenderPrimitiveList(
	ViewportInfo viewport,
	bool preview
)
<ObsoleteAttribute("This version is obsolete because it returns the obsolete RenderPrimitiveList - ie, the old school custom render meshes.  Use CustomRenderMeshes instead.")>
Public Function GetRenderPrimitiveList (
	viewport As ViewportInfo,
	preview As Boolean
) As RenderPrimitiveList
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
preview
Type: System.Boolean
 Type of mesh to build, if preview is true then a smaller mesh may be generated in less time, false is meant when actually rendering.
Return Value
Type: RenderPrimitiveList
 Returns a RenderPrimitiveList if successful otherwise returns null.
See Also
Reference
RhinoObject Class
GetRenderPrimitiveList Overload
Rhino.DocObjects Namespace