RhinoCommon API
Brep.MergeSurfaces Method (Brep, Brep, Double, Double)
 Merges two surfaces into one surface at untrimmed edges. Both surfaces must be untrimmed and share an edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep MergeSurfaces(
	Brep brep0,
	Brep brep1,
	double tolerance,
	double angleToleranceRadians
)
Public Shared Function MergeSurfaces (
	brep0 As Brep,
	brep1 As Brep,
	tolerance As Double,
	angleToleranceRadians As Double
) As Brep
Parameters
brep0
Type: Rhino.Geometry.Brep
The first single-face Brep to merge.
brep1
Type: Rhino.Geometry.Brep
The second single-face Brep to merge.
tolerance
Type: System.Double
Surface edges must be within this tolerance for the two surfaces to merge.
angleToleranceRadians
Type: System.Double
Edge must be within this angle tolerance in order for contiguous edges to be combined into a single edge.
Return Value
Type: Brep
The merged Brep if successful, null if not successful.
See Also
Reference
Brep Class
MergeSurfaces Overload
Rhino.Geometry Namespace