RhinoCommon API
MarkupTable.Duplicate Method
 Duplicates a markup.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Duplicate(
	int index
)
Public Function Duplicate (
	index As Integer
) As Integer
Parameters
index
Type: System.Int32
zero based index of markup to delete.
Return Value
Type: Int32
 Index of new markup type or -1 on error.
See Also
Reference
MarkupTable Class
Rhino.DocObjects.Tables Namespace