RhinoCommon API
File3dmCommonComponentTable<T>.Delete Method (Int32)
 Flags a component as deleted.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void Delete(
	int index
)
Public Overridable Sub Delete (
	index As Integer
)
Parameters
index
Type: System.Int32
The index of the item to flag.
Return Value
Type:
True on success.
See Also
Reference
File3dmCommonComponentTable<T> Class
Delete Overload
Rhino.FileIO Namespace