RhinoCommon API
PersistentSettings.SetStringList Method
 Including a item with the value of StringListRootKey will cause the ProgramData value to get inserted at that location in the list when calling GetStringList.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void SetStringList(
	string key,
	string[] value
)
Public Sub SetStringList (
	key As String,
	value As String()
)
Parameters
key
Type: System.String
The string key.
value
Type: System.String[]
An array of values to set.
See Also
Reference
PersistentSettings Class
Rhino Namespace