RhinoCommon API
RenderContentKindList.Dispose Method
 Dispose a kind list.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RenderContentKindList Class
Rhino.Render Namespace