RhinoCommon API
PostEffectJob.Dispose Method
Releases all resources used by the PostEffectJob
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PostEffectJob Class
Dispose Overload
Rhino.Render.PostEffects Namespace