RhinoCommon API
FileEpsReadOptions Constructor
Initializes a new instance of the FileEpsReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileEpsReadOptions()
Public Sub New
See Also
Reference
FileEpsReadOptions Class
Rhino.FileIO Namespace