RhinoCommon API
PostEffectCollection.GetSelectedPostEffect Method
 Gets the selected post effect for a certain type into 'id'. Returns true if successful or false if the selection information could not be found.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool GetSelectedPostEffect(
	PostEffectType type,
	out Guid id
)
Public Function GetSelectedPostEffect (
	type As PostEffectType,
	<OutAttribute> ByRef id As Guid
) As Boolean
Parameters
type
Type: Rhino.Render.PostEffects.PostEffectType
[Missing <param name="type"/> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.GetSelectedPostEffect(Rhino.Render.PostEffects.PostEffectType,System.Guid@)"]
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.GetSelectedPostEffect(Rhino.Render.PostEffects.PostEffectType,System.Guid@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectCollection.GetSelectedPostEffect(Rhino.Render.PostEffects.PostEffectType,System.Guid@)"]
See Also
Reference
PostEffectCollection Class
Rhino.Render.PostEffects Namespace