RhinoCommon API
RenderTexture.SetEnvironmentMappingMode Method (TextureEnvironmentMappingMode)
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.SetEnvironmentMappingMode(Rhino.Render.TextureEnvironmentMappingMode)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetEnvironmentMappingMode(
	TextureEnvironmentMappingMode value
)
Public Sub SetEnvironmentMappingMode (
	value As TextureEnvironmentMappingMode
)
Parameters
value
Type: Rhino.Render.TextureEnvironmentMappingMode
[Missing <param name="value"/> documentation for "M:Rhino.Render.RenderTexture.SetEnvironmentMappingMode(Rhino.Render.TextureEnvironmentMappingMode)"]
See Also
Reference
RenderTexture Class
SetEnvironmentMappingMode Overload
Rhino.Render Namespace