RhinoCommon API
AreaMassProperties.Sum Method (IEnumerable<AreaMassProperties>, Boolean)
 Sum mass properties together to get an aggregate mass.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Sum(
	IEnumerable<AreaMassProperties> summands,
	bool bAddTo
)
Public Function Sum (
	summands As IEnumerable(Of AreaMassProperties),
	bAddTo As Boolean
) As Boolean
Parameters
summands
Type: System.Collections.Generic.IEnumerable<AreaMassProperties>
An array of mass properties to add.
bAddTo
Type: System.Boolean
If true, then the summands are added to the existing mass.
Return Value
Type: Boolean
True if successful.
Exceptions
Exception | Condition
ArgumentNullException
See Also
Reference
AreaMassProperties Class
Sum Overload
Rhino.Geometry Namespace