RhinoCommon API
Mesh.SelfSplit Method (Double)
 Split a mesh with itself.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Mesh[] SelfSplit(
	double tolerance
)
Public Function SelfSplit (
	tolerance As Double
) As Mesh()
Parameters
tolerance
Type: System.Double
A value for intersection tolerance.
WARNING! Correct values are typically in the (10e-8 - 10e-4) range.
An option is to use the document tolerance diminished by a few orders or magnitude.
Return Value
Type: Mesh[]
A new mesh array with the split result. This can be null if no result was found.
See Also
Reference
Mesh Class
SelfSplit Overload
Rhino.Geometry Namespace
Intersection.MeshIntersectionsTolerancesCoefficient