RhinoCommon API
CollapsibleSectionViewModel.Commit Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.CollapsibleSectionViewModel.Commit(System.Guid)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Commit(
	Guid uuidDataType
)
Public Sub Commit (
	uuidDataType As Guid
)
Parameters
uuidDataType
Type: System.Guid
[Missing <param name="uuidDataType"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionViewModel.Commit(System.Guid)"]
Implements
IRdkViewModel.Commit(Guid)
See Also
Reference
CollapsibleSectionViewModel Class
Rhino.UI.Controls Namespace