RhinoCommon API
Curve.IsArc Method
 Test a curve to see if it can be represented by an arc or circle within RhinoMath.ZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsArc()
Public Function IsArc As Boolean
Return Value
Type: Boolean
 true if the curve can be represented by an arc or a circle within tolerance.
See Also
Reference
Curve Class
IsArc Overload
Rhino.Geometry Namespace