RhinoCommon API
Mesh.QuadRemeshBrepAsync Method (Brep, QuadRemeshParameters, IProgress<Int32>, CancellationToken)
 Quad remesh this Brep asynchronously.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Task<Mesh> QuadRemeshBrepAsync(
	Brep brep,
	QuadRemeshParameters parameters,
	IProgress<int> progress,
	CancellationToken cancelToken
)
Public Shared Function QuadRemeshBrepAsync (
	brep As Brep,
	parameters As QuadRemeshParameters,
	progress As IProgress(Of Integer),
	cancelToken As CancellationToken
) As Task(Of Mesh)
Parameters
brep
Type: Rhino.Geometry.Brep
 Set Brep Face Mode by setting QuadRemeshParameters.PreserveMeshArrayEdgesMode
parameters
Type: Rhino.Geometry.QuadRemeshParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshBrepAsync(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters,System.IProgress{System.Int32},System.Threading.CancellationToken)"]
progress
Type: System.IProgress<Int32>
[Missing <param name="progress"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshBrepAsync(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters,System.IProgress{System.Int32},System.Threading.CancellationToken)"]
cancelToken
Type: System.Threading.CancellationToken
[Missing <param name="cancelToken"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshBrepAsync(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters,System.IProgress{System.Int32},System.Threading.CancellationToken)"]
Return Value
Type: Task<Mesh>
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.QuadRemeshBrepAsync(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters,System.IProgress{System.Int32},System.Threading.CancellationToken)"]
See Also
Reference
Mesh Class
QuadRemeshBrepAsync Overload
Rhino.Geometry Namespace