RhinoCommon API
IHeaderButtonHandler.DeleteThis Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IHeaderButtonHandler.DeleteThis"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
void DeleteThis()
Sub DeleteThis
See Also
Reference
IHeaderButtonHandler Interface
Rhino.UI.Controls Namespace