RhinoCommon API
HatchPatternTable.Modify Method
 Modify hatch pattern settings.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Modify(
	HatchPattern hatchPattern,
	int hatchPatternIndex,
	bool quiet
)
Public Function Modify (
	hatchPattern As HatchPattern,
	hatchPatternIndex As Integer,
	quiet As Boolean
) As Boolean
Parameters
hatchPattern
Type: Rhino.DocObjects.HatchPattern
Definition of new hatch pattern. The information in the hatch pattern is copied.
hatchPatternIndex
Type: System.Int32
Zero based index of the hatch pattern to modify.
quiet
Type: System.Boolean
If true, information message boxes pop up when illegal changes are attempted.
Return Value
Type: Boolean
True if successful, or false if hatchPatternIndex is out of range.
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace