RhinoCommon API
SubDEdgeChain.EdgeAt Method
 Gets the edge at the given position in the chain. The returned edge carries the direction the chain traverses it with, in ComponentDirection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDEdge EdgeAt(
	int index
)
Public Function EdgeAt (
	index As Integer
) As SubDEdge
Parameters
index
Type: System.Int32
The position in the chain.
Return Value
Type: SubDEdge
The edge, or null if index is out of range.
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace