RhinoCommon API
MeshThicknessMeasurement Constructor
 Create a new thickness measurement.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public MeshThicknessMeasurement(
	int meshIndex,
	int vertexIndex,
	double thickness,
	Point3d point,
	Point3d oppositePoint
)
Public Sub New (
	meshIndex As Integer,
	vertexIndex As Integer,
	thickness As Double,
	point As Point3d,
	oppositePoint As Point3d
)
Parameters
meshIndex
Type: System.Int32
Index of mesh within collection of meshes.
vertexIndex
Type: System.Int32
Index of mesh vertex.
thickness
Type: System.Double
Thickness of mesh at vertex.
point
Type: Rhino.Geometry.Point3d
Vertex location.
oppositePoint
Type: Rhino.Geometry.Point3d
Opposite location.
See Also
Reference
MeshThicknessMeasurement Structure
Rhino.Geometry Namespace