RhinoCommon API
PostEffect.GetParam Method
 Get a parameter.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public abstract bool GetParam(
	string param,
	ref Object v
)
Public MustOverride Function GetParam (
	param As String,
	ByRef v As Object
) As Boolean
Parameters
param
Type: System.String
is the name of the parameter to get.
v
Type: System.Object
accepts the parameter value.
Return Value
Type: Boolean
 Returns true if successful or false if the parameter was not found.
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace