RhinoCommon API
PersistentSettings.TryGetPoint Method (String, Point, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetPoint(System.String,System.Drawing.Point@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetPoint(
	string key,
	out Point value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetPoint (
	key As String,
	<OutAttribute> ByRef value As Point,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetPoint(System.String,System.Drawing.Point@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: System.Drawing.Point
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetPoint(System.String,System.Drawing.Point@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetPoint(System.String,System.Drawing.Point@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetPoint(System.String,System.Drawing.Point@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetPoint Overload
Rhino Namespace