RhinoCommon API
DevelopableSrf.UntwistRulings Method
[Missing <summary> documentation for "M:Rhino.Geometry.DevelopableSrf.UntwistRulings(Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsCurve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d}@)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool UntwistRulings(
	NurbsCurve rail0,
	NurbsCurve rail1,
	ref IEnumerable<Point2d> rulings
)
Public Shared Function UntwistRulings (
	rail0 As NurbsCurve,
	rail1 As NurbsCurve,
	ByRef rulings As IEnumerable(Of Point2d)
) As Boolean
Parameters
rail0
Type: Rhino.Geometry.NurbsCurve
[Missing <param name="rail0"/> documentation for "M:Rhino.Geometry.DevelopableSrf.UntwistRulings(Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsCurve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d}@)"]
rail1
Type: Rhino.Geometry.NurbsCurve
[Missing <param name="rail1"/> documentation for "M:Rhino.Geometry.DevelopableSrf.UntwistRulings(Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsCurve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d}@)"]
rulings
Type: System.Collections.Generic.IEnumerable<Point2d>
[Missing <param name="rulings"/> documentation for "M:Rhino.Geometry.DevelopableSrf.UntwistRulings(Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsCurve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d}@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.DevelopableSrf.UntwistRulings(Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsCurve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d}@)"]
See Also
Reference
DevelopableSrf Class
Rhino.Geometry Namespace