RhinoCommon API
Thumbnail.IsSelected Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.IsSelected"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsSelected()
Public Function IsSelected As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.IsSelected"]
Implements
IRhRdkThumbnail.IsSelected()
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace