RhinoCommon API
LengthUnit.IsKnownLengthUnit Method
 Determines whether the provided value is a known unit system.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool IsKnownLengthUnit(
	UnitSystem unitSystem,
	out LengthUnit lengthUnit
)
Public Shared Function IsKnownLengthUnit (
	unitSystem As UnitSystem,
	<OutAttribute> ByRef lengthUnit As LengthUnit
) As Boolean
Parameters
unitSystem
Type: Rhino.UnitSystem
lengthUnit
Type: Rhino.LengthUnit
Return Value
Type: Boolean
True when provided lengthUnit value is a valid known UnitSystem, False otherwise.
Remarks
 Not Unset nor CustomUnits
See Also
Reference
LengthUnit Structure
Rhino Namespace