RhinoCommon API
ViewCaptureSettings.MaximizePrintableArea Method
 Minimize cropping so the full drawable area is used
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public void MaximizePrintableArea()
Public Sub MaximizePrintableArea
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace