RhinoCommon API
PageViewGroupTable.Delete Method (PageViewGroup, Boolean)
 Deletes a page view group.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Delete(
	PageViewGroup group,
	bool quiet
)
Public Function Delete (
	group As PageViewGroup,
	quiet As Boolean
) As Boolean
Parameters
group
Type: Rhino.DocObjects.PageViewGroup
PageViewGroup to delete.
quiet
Type: System.Boolean
true to disable any warning or error messages.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
PageViewGroupTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace