RhinoCommon API
FileRaw.Read Method
Read a raw file into a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	FileRawReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As FileRawReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.FileRawReadOptions
options used for importing the raw file
Return Value
Type: Boolean
true on success
See Also
Reference
FileRaw Class
Rhino.FileIO Namespace