RhinoCommon API
SubDComponentParameter.CreateFaceParameter Method
 Creates a parameter that identifies a surface point inside a SubD face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static SubDComponentParameter CreateFaceParameter(
	uint faceId,
	int faceEdgeCount,
	int cornerIndex,
	double cornerS,
	double cornerT
)
Public Shared Function CreateFaceParameter (
	faceId As UInteger,
	faceEdgeCount As Integer,
	cornerIndex As Integer,
	cornerS As Double,
	cornerT As Double
) As SubDComponentParameter
Parameters
faceId
Type: System.UInt32
The id of a SubD face.
faceEdgeCount
Type: System.Int32
 The number of edges of the face. Must be 3 or more.
cornerIndex
Type: System.Int32
 The index of the face corner the parameters are measured in. Must be less than faceEdgeCount.
cornerS
Type: System.Double
 A value between 0 and 1/2 measured from the corner vertex towards the midpoint of the edge that leaves the corner.
cornerT
Type: System.Double
 A value between 0 and 1/2 measured from the corner vertex towards the midpoint of the edge that enters the corner.
Return Value
Type: SubDComponentParameter
[Missing <returns> documentation for "M:Rhino.Geometry.SubDComponentParameter.CreateFaceParameter(System.UInt32,System.Int32,System.Int32,System.Double,System.Double)"]
Remarks
 (0,0) is the corner vertex and (1/2,1/2) is the center of the face.
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace