RhinoCommon API
MeshNgonList.GetNgonBoundingBox Method (Int32)
 Gets the bounding box of an ngon.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public BoundingBox GetNgonBoundingBox(
	int index
)
Public Function GetNgonBoundingBox (
	index As Integer
) As BoundingBox
Parameters
index
Type: System.Int32
A ngon index.
Return Value
Type: BoundingBox
A new bounding box, or Empty on error.
See Also
Reference
MeshNgonList Class
GetNgonBoundingBox Overload
Rhino.Geometry.Collections Namespace