RhinoCommon API
Mesh.CreateFromPlanarBoundary Method (Curve, MeshingParameters)
Note: This API is now obsolete.
 Do not use this overload. Use version that takes a tolerance parameter instead.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use version that takes a tolerance parameter instead")]
public static Mesh CreateFromPlanarBoundary(
	Curve boundary,
	MeshingParameters parameters
)
<ObsoleteAttribute("Use version that takes a tolerance parameter instead")>
Public Shared Function CreateFromPlanarBoundary (
	boundary As Curve,
	parameters As MeshingParameters
) As Mesh
Parameters
boundary
Type: Rhino.Geometry.Curve
Do not use.
parameters
Type: Rhino.Geometry.MeshingParameters
Do not use.
Return Value
Type: Mesh
 Do not use.
See Also
Reference
Mesh Class
CreateFromPlanarBoundary Overload
Rhino.Geometry Namespace