RhinoCommon API
ICollapsibleSection2.EnableHeaderButton Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ICollapsibleSection2.EnableHeaderButton(System.Int32,System.Boolean)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
bool EnableHeaderButton(
	int index,
	bool bEnable
)
Function EnableHeaderButton (
	index As Integer,
	bEnable As Boolean
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSection2.EnableHeaderButton(System.Int32,System.Boolean)"]
bEnable
Type: System.Boolean
[Missing <param name="bEnable"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSection2.EnableHeaderButton(System.Int32,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.ICollapsibleSection2.EnableHeaderButton(System.Int32,System.Boolean)"]
See Also
Reference
ICollapsibleSection2 Interface
Rhino.UI.Controls Namespace