RhinoCommon API
FileDwg.Read Method
Read a DWG file into a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	FileDwgReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As FileDwgReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.FileDwgReadOptions
options used for importing the DWG file
Return Value
Type: Boolean
true on success
See Also
Reference
FileDwg Class
Rhino.FileIO Namespace