RhinoCommon API
SafeFrame Constructor (RhinoDoc)
 Create the SafeFrame object which is associated with the document
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public SafeFrame(
	RhinoDoc doc
)
Public Sub New (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.SafeFrame.#ctor(Rhino.RhinoDoc)"]
See Also
Reference
SafeFrame Class
SafeFrame Overload
Rhino.Render Namespace