RhinoCommon API
RenderContent.OnMakeCopy Method
 Override this function to supplement the standard copying behavour for your RenderContent.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnMakeCopy(
	ref RenderContent newContent
)
Protected Overridable Sub OnMakeCopy (
	ByRef newContent As RenderContent
)
Parameters
newContent
Type: Rhino.Render.RenderContent
Is the content that will be returned from MakeCopy.
See Also
Reference
RenderContent Class
Rhino.Render Namespace