RhinoCommon API
Layer.SetPerViewportPersistentVisibility Method
 Sets the per layer persistent visibility. The persistent viability setting is used for layers whose visibility can be changed by a parent layer. In this case, when a parent layer is turned off, then child layers are also turned off. The persistent visibility setting determines what happens when the parent is turned on again.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetPerViewportPersistentVisibility(
	Guid viewportId,
	bool persistentVisibility
)
Public Sub SetPerViewportPersistentVisibility (
	viewportId As Guid,
	persistentVisibility As Boolean
)
Parameters
viewportId
Type: System.Guid
 If not Guid.Empty, then the setting applies only to the viewport with the specified id. If Guid.Empty, then the setting applies to all viewports with per viewport layer settings.
persistentVisibility
Type: System.Boolean
 If true, this layer's visibility in the specified viewport is controlled by a parent object and the parent is turned on (after being off), then this layer will also be turned on in the specified viewport. If false, this layer's visibility in the specified viewport is controlled by a parent object and the parent layer is turned on (after being off), then this layer will continue to be off in the specified viewport.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace