RhinoCommon API
DimensionStyle.DeleteAllUserStrings Method
[Missing <summary> documentation for "M:Rhino.DocObjects.DimensionStyle.DeleteAllUserStrings"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public void DeleteAllUserStrings()
Public Sub DeleteAllUserStrings
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace