RhinoCommon API
ChangeQueue.OriginalInstanceIdsFromTextureId Method
 Return the collection of original document instance ids assocaited with the Texture id.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.23
Syntax
public Guid[] OriginalInstanceIdsFromTextureId(
	uint crc
)
Public Function OriginalInstanceIdsFromTextureId (
	crc As UInteger
) As Guid()
Parameters
crc
Type: System.UInt32
The Texture id
Return Value
Type: Guid[]
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.OriginalInstanceIdsFromTextureId(System.UInt32)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace