RhinoCommon API
ObjectTable.AddLinearDimension Method (LinearDimension)
 Adds a linear dimension object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddLinearDimension(
	LinearDimension dimension
)
Public Function AddLinearDimension (
	dimension As LinearDimension
) As Guid
Parameters
dimension
Type: Rhino.Geometry.LinearDimension
 Dimension object to add.
Return Value
Type: Guid
 The Id of the newly added object or Guid.Empty on failure.
Examples
using System;
partial class Examples
{
  public static Rhino.Commands.Result AddLinearDimension(Rhino.RhinoDoc doc)
  {
    Rhino.Geometry.LinearDimension dimension;
    Rhino.Commands.Result rc = Rhino.Input.RhinoGet.GetLinearDimension(out dimension);
    if (rc == Rhino.Commands.Result.Success && dimension != null)
    {
      if (doc.Objects.AddLinearDimension(dimension) == Guid.Empty)
        rc = Rhino.Commands.Result.Failure;
      else
        doc.Views.Redraw();
    }
    return rc;
  }
}
Partial Class Examples
  Public Shared Function AddLinearDimension(ByVal doc As Rhino.RhinoDoc) As Rhino.Commands.Result
    Dim dimension As Rhino.Geometry.LinearDimension = Nothing
    Dim rc As Rhino.Commands.Result = Rhino.Input.RhinoGet.GetLinearDimension(dimension)
    If rc = Rhino.Commands.Result.Success AndAlso dimension IsNot Nothing Then
      If doc.Objects.AddLinearDimension(dimension) = Guid.Empty Then
        rc = Rhino.Commands.Result.Failure
      Else
        doc.Views.Redraw()
      End If
    End If
    Return rc
  End Function
End Class
import Rhino
import scriptcontext
import System.Guid
def AddLinearDimension():
    rc, dimension = Rhino.Input.RhinoGet.GetLinearDimension()
    if rc==Rhino.Commands.Result.Success:
        if scriptcontext.doc.Objects.AddLinearDimension(dimension)==System.Guid.Empty:
            rc = Rhino.Commands.Result.Failure
        else:
            scriptcontext.doc.Views.Redraw()
    return rc
if __name__=="__main__":
    AddLinearDimension()
See Also
Reference
ObjectTable Class
AddLinearDimension Overload
Rhino.DocObjects.Tables Namespace