RhinoCommon API
SubD.CreateIcosahedron Method
 Creates a SubD sphere based on an icosohedron (20 triangular faces and 5 valent vertices). This is a goofy topology for a Catmull-Clark subdivision surface (all triangles, all vertices have 5 edges). You may want to consider using the much behaved result from CreateSubDQuadSphere(sphere, vertexLocation, 1) or even the result from CreateSubDGlobeSphere().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static SubD CreateIcosahedron(
	Sphere sphere,
	SubDComponentLocation vertexLocation
)
Public Shared Function CreateIcosahedron (
	sphere As Sphere,
	vertexLocation As SubDComponentLocation
) As SubD
Parameters
sphere
Type: Rhino.Geometry.Sphere
Location, size and orientation of the sphere.
vertexLocation
Type: Rhino.Geometry.SubDComponentLocation
 If vertexLocation = SubDComponentLocation::ControlNet, then the control net points will be on the surface of the sphere. Otherwise the limit surface points will be on the sphere.
Return Value
Type: SubD
 If the input parameters are valid, a SubD icosahedron is returned. Otherwise null is returned.
See Also
Reference
SubD Class
Rhino.Geometry Namespace