RhinoCommon API
CustomGripObject.EvaluateSurfaceCVIndices Method
 The indices of the NURBS surface control points this grip drives. A grip may drive more than one, as at a closed or periodic seam or a singular edge. Every index must lie inside the surface returned by the owning CustomObjectGrips' NurbsSurface(). Rhino writes through these indices without checking them, so a grip reporting one outside the control point grid is refused whole.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual IndexPair[] EvaluateSurfaceCVIndices()
Protected Overridable Function EvaluateSurfaceCVIndices As IndexPair()
Return Value
Type: IndexPair[]
The control point indices, or null if this grip drives none.
Remarks
 IndexPair rather than the Tuple used by GripObject.GetSurfaceCVIndices: this is called once per grip while Rhino maps a whole surface, and IndexPair is a struct.
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace