RhinoCommon API
RenderWindow.Channel.Clone Method
 Return a clone of the channel.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RenderWindow.Channel Clone()
Public Function Clone As RenderWindow.Channel
Return Value
Type: RenderWindow.Channel
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.Channel.Clone"]
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace