RhinoCommon API
SimpleArrayByte Constructor
 Initializes a new SimpleArrayByte class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SimpleArrayByte()
Public Sub New
See Also
Reference
SimpleArrayByte Class
SimpleArrayByte Overload
Rhino.Runtime.InteropWrappers Namespace