RhinoCommon API
RenderWindow.ChannelGPU.TextureHandleOpenGL Method
 Return the channel's OpenGL texture handle. If there isn't one, a value of 0 will be returned. The ChannelGPU.DisplayTechnology property will indicate which type of texture is stored in the channel.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public uint TextureHandleOpenGL()
Public Function TextureHandleOpenGL As UInteger
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.TextureHandleOpenGL"]
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace