RhinoCommon API
Centermark.AdjustFromPoints Method
 Update dimension geometry from point locations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool AdjustFromPoints(
	Plane plane,
	Point3d centerPoint
)
Public Function AdjustFromPoints (
	plane As Plane,
	centerPoint As Point3d
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
Dimension's plane.
centerPoint
Type: Rhino.Geometry.Point3d
Dimension's center point.
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
Centermark Class
Rhino.Geometry Namespace