RhinoCommon API
RhinoApp.CapturedCommandWindowStrings Method
 Get list of strings sent to the command window through calls to Write or WriteLine when capturing has been enabled
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string[] CapturedCommandWindowStrings(
	bool clearBuffer
)
Public Shared Function CapturedCommandWindowStrings (
	clearBuffer As Boolean
) As String()
Parameters
clearBuffer
Type: System.Boolean
Clear the captured buffer after this call
Return Value
Type: String[]
array of captured strings
See Also
Reference
RhinoApp Class
Rhino Namespace