RhinoCommon API
RhinoDoc.CustomRenderMeshesBoundingBox Method
 Returns the bounding box of custom render primitives for this object .
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool CustomRenderMeshesBoundingBox(
	MeshType mt,
	ViewportInfo vp,
	ref RenderMeshProvider.Flags flags,
	PlugIn plugin,
	DisplayPipelineAttributes attrs,
	out BoundingBox boundingBox
)
Public Function CustomRenderMeshesBoundingBox (
	mt As MeshType,
	vp As ViewportInfo,
	ByRef flags As RenderMeshProvider.Flags,
	plugin As PlugIn,
	attrs As DisplayPipelineAttributes,
	<OutAttribute> ByRef boundingBox As BoundingBox
) As Boolean
Parameters
mt
Type: Rhino.Geometry.MeshType
The mesh type requested (render or analysis).
vp
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered
flags
Type: Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags
See RenderMeshProvider.Flags. This is an in/out parameter: on return it also carries any status flags - including Incomplete when an asynchronous provider has not finished - so reset it before each call and test it afterwards.
plugin
Type: Rhino.PlugIns.PlugIn
The requesting plug-in (typically the calling plugin)
attrs
Type: Rhino.Display.DisplayPipelineAttributes
Display attributes for the caller - null if this is a full rendering.
boundingBox
Type: Rhino.Geometry.BoundingBox
The requested bounding box
Return Value
Type: Boolean
True if the process was a success
See Also
Reference
RhinoDoc Class
Rhino Namespace