RhinoCommon API
SubD.Evaluate Method (SubDComponentParameter, Point3d, Vector3d)
 Evaluates the location and unit normal of a point on this SubD's surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Evaluate(
	SubDComponentParameter parameter,
	out Point3d point,
	out Vector3d normal
)
Public Function Evaluate (
	parameter As SubDComponentParameter,
	<OutAttribute> ByRef point As Point3d,
	<OutAttribute> ByRef normal As Vector3d
) As Boolean
Parameters
parameter
Type: Rhino.Geometry.SubDComponentParameter
The parameter to evaluate.
point
Type: Rhino.Geometry.Point3d
 The surface point is returned here, or Unset if this fails.
normal
Type: Rhino.Geometry.Vector3d
 The unit surface normal is returned here, or Unset if this fails.
Return Value
Type: Boolean
True if the evaluation succeeded.
Remarks
 The surface derivatives this needs are not available in the corner of an extraordinary vertex unless the parameter is exactly at the vertex, at the midpoint of one of its edges, or at the center of the face.
See Also
Reference
SubD Class
Evaluate Overload
Rhino.Geometry Namespace