RhinoCommon API
GripUserInterfaceObject.OnDrag Method
[Missing <summary> documentation for "M:Rhino.UI.GripUserInterfaceObject.OnDrag(Rhino.Geometry.Point3d,Rhino.UI.MouseState)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnDrag(
	Point3d newLocation,
	MouseState mouse
)
Protected Overridable Sub OnDrag (
	newLocation As Point3d,
	mouse As MouseState
)
Parameters
newLocation
Type: Rhino.Geometry.Point3d
[Missing <param name="newLocation"/> documentation for "M:Rhino.UI.GripUserInterfaceObject.OnDrag(Rhino.Geometry.Point3d,Rhino.UI.MouseState)"]
mouse
Type: Rhino.UI.MouseState
[Missing <param name="mouse"/> documentation for "M:Rhino.UI.GripUserInterfaceObject.OnDrag(Rhino.Geometry.Point3d,Rhino.UI.MouseState)"]
See Also
Reference
GripUserInterfaceObject Class
Rhino.UI Namespace