RhinoCommon API
RhinoViewport Constructor
Initializes a new instance of the RhinoViewport class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoViewport()
Public Sub New
See Also
Reference
RhinoViewport Class
RhinoViewport Overload
Rhino.Display Namespace