RhinoCommon API
OptionString.Dispose Method (Boolean)
Releases the unmanaged resources used by the OptionString and optionally releases the managed resources
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected void Dispose(
	bool disposing
)
Protected Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
OptionString Class
Dispose Overload
Rhino.Input.Custom Namespace