RhinoCommon API
SubDCreationOptions.Dispose Method
 Delete unmanaged pointer for this
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace