RhinoCommon API
CustomGripObject.EvaluateSurfaceParameters Method
 The surface parameters of the control point this grip drives.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool EvaluateSurfaceParameters(
	out double u,
	out double v
)
Protected Overridable Function EvaluateSurfaceParameters (
	<OutAttribute> ByRef u As Double,
	<OutAttribute> ByRef v As Double
) As Boolean
Parameters
u
Type: System.Double
The first surface parameter.
v
Type: System.Double
The second surface parameter.
Return Value
Type: Boolean
true on success. The default implementation returns false.
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace