RhinoCommon API
Quaternion.Slerp Method
 Interpolates between two quaternions, using spherical linear interpolation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Quaternion Slerp(
	Quaternion a,
	Quaternion b,
	double t
)
Public Shared Function Slerp (
	a As Quaternion,
	b As Quaternion,
	t As Double
) As Quaternion
Parameters
a
Type: Rhino.Geometry.Quaternion
The first quaternion.
b
Type: Rhino.Geometry.Quaternion
The second quaternion.
t
Type: System.Double
The parameter in the range [0, 1].
Return Value
Type: Quaternion
The interpolated quaternion.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace