RhinoCommon API
SupportOptions.UseQuickInitialPreview Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.UseQuickInitialPreview"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool UseQuickInitialPreview()
Public Shared Function UseQuickInitialPreview As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.UseQuickInitialPreview"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace