RhinoCommon API
ChangeQueue.GetQueueSkylight Method
 Get skylight known to the queue at the time of the Flush
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Skylight GetQueueSkylight()
Public Function GetQueueSkylight As Skylight
Return Value
Type: Skylight
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.GetQueueSkylight"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace