RhinoCommon API
Vector3f.Division Operator (Vector3f, Double)
 Divides a Vector3f by a number, having the effect of shrinking it, t times.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Vector3f operator /(
	Vector3f vector,
	double t
)
Public Shared Operator / (
	vector As Vector3f,
	t As Double
) As Vector3f
Parameters
vector
Type: Rhino.Geometry.Vector3f
A vector.
t
Type: System.Double
A number.
Return Value
Type: Vector3f
A new vector that is component-wise divided by t.
See Also
Reference
Vector3f Structure
Division Overload
Rhino.Geometry Namespace