RhinoCommon API
NurbsCurve.CreateParabolaFromFocus Method
 Creates a parabola from focus and end points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static NurbsCurve CreateParabolaFromFocus(
	Point3d focus,
	Point3d startPoint,
	Point3d endPoint
)
Public Shared Function CreateParabolaFromFocus (
	focus As Point3d,
	startPoint As Point3d,
	endPoint As Point3d
) As NurbsCurve
Parameters
focus
Type: Rhino.Geometry.Point3d
The focal point.
startPoint
Type: Rhino.Geometry.Point3d
The start point.
endPoint
Type: Rhino.Geometry.Point3d
The end point
Return Value
Type: NurbsCurve
A 2 degree NURBS curve if successful, false otherwise.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace