RhinoCommon API
FileTxtWriteOptions Constructor
Initializes a new instance of the FileTxtWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileTxtWriteOptions()
Public Sub New
See Also
Reference
FileTxtWriteOptions Class
Rhino.FileIO Namespace