RhinoCommon API
Dialogs.ShowMessage Method (Object, String, String, ShowMessageButton, ShowMessageIcon, ShowMessageDefaultButton, ShowMessageOptions, ShowMessageMode)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ShowMessageResult ShowMessage(
	Object parent,
	string message,
	string title,
	ShowMessageButton buttons,
	ShowMessageIcon icon,
	ShowMessageDefaultButton defaultButton,
	ShowMessageOptions options,
	ShowMessageMode mode
)
Public Shared Function ShowMessage (
	parent As Object,
	message As String,
	title As String,
	buttons As ShowMessageButton,
	icon As ShowMessageIcon,
	defaultButton As ShowMessageDefaultButton,
	options As ShowMessageOptions,
	mode As ShowMessageMode
) As ShowMessageResult
Parameters
parent
Type: System.Object
Parent window
message
Type: System.String
Message box text content.
title
Type: System.String
Message box title text.
buttons
Type: Rhino.UI.ShowMessageButton
Which buttons to display in the message box.
icon
Type: Rhino.UI.ShowMessageIcon
Which icon to display in the message box.
defaultButton
Type: Rhino.UI.ShowMessageDefaultButton
Which button is the default button.
options
Type: Rhino.UI.ShowMessageOptions
Additional message box options.
mode
Type: Rhino.UI.ShowMessageMode
The modality of the message box.
Return Value
Type: ShowMessageResult
One of the ShowMessageBoxResult values.
See Also
Reference
Dialogs Class
ShowMessage Overload
Rhino.UI Namespace