RhinoCommon API
ObjectTable.Hide Method (ObjRef, Boolean, String)
 Hides object that is referenced by objref and optionally assigns it to a hide group. If objref.Object().IsNormal() is true, then the object will be hidden.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Hide(
	ObjRef objref,
	bool ignoreLayerMode,
	string hideGroup
)
Public Function Hide (
	objref As ObjRef,
	ignoreLayerMode As Boolean,
	hideGroup As String
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
reference to object to hide.
ignoreLayerMode
Type: System.Boolean
 if true, the object will be hidden even if it is on a layer that is locked or off.
hideGroup
Type: System.String
 name of the hide group to attach to the hidden object. If null or empty, no hide group is assigned.
Return Value
Type: Boolean
true if the object was successfully hidden.
See Also
Reference
ObjectTable Class
Hide Overload
Rhino.DocObjects.Tables Namespace