RhinoCommon API
SimpleArraySurfacePointer Constructor
 Initializes a new SimpleArraySurfacePointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SimpleArraySurfacePointer()
Public Sub New
See Also
Reference
SimpleArraySurfacePointer Class
Rhino.Runtime.InteropWrappers Namespace