RhinoCommon API
MeshFaceList.ConvertQuadsToTriangles Method
Splits all quads along the short diagonal.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ConvertQuadsToTriangles()
Public Function ConvertQuadsToTriangles As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace