RhinoCommon API
CustomRenderMeshProvider.BuildCustomMeshes Method
 Build custom render mesh(es).
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public abstract bool BuildCustomMeshes(
	ViewportInfo vp,
	RenderPrimitiveList objMeshes,
	Guid requestingPlugIn,
	bool meshType
)
Public MustOverride Function BuildCustomMeshes (
	vp As ViewportInfo,
	objMeshes As RenderPrimitiveList,
	requestingPlugIn As Guid,
	meshType As Boolean
) As Boolean
Parameters
vp
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
objMeshes
Type: Rhino.Render.RenderPrimitiveList
The meshes class to populate with custom meshes.
requestingPlugIn
Type: System.Guid
UUID of the RDK plug-in requesting the meshes.
meshType
Type: System.Boolean
Type of mesh to build.
Return Value
Type: Boolean
true if operation was successful.
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace