RhinoCommon API
RenderContent.IsFactoryProductAcceptableAsChild Method (ContentFactory, String)
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.IsFactoryProductAcceptableAsChild(Rhino.Render.DataSources.ContentFactory,System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public virtual bool IsFactoryProductAcceptableAsChild(
	ContentFactory factory,
	string childSlotName
)
Public Overridable Function IsFactoryProductAcceptableAsChild (
	factory As ContentFactory,
	childSlotName As String
) As Boolean
Parameters
factory
Type: Rhino.Render.DataSources.ContentFactory
[Missing <param name="factory"/> documentation for "M:Rhino.Render.RenderContent.IsFactoryProductAcceptableAsChild(Rhino.Render.DataSources.ContentFactory,System.String)"]
childSlotName
Type: System.String
[Missing <param name="childSlotName"/> documentation for "M:Rhino.Render.RenderContent.IsFactoryProductAcceptableAsChild(Rhino.Render.DataSources.ContentFactory,System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.IsFactoryProductAcceptableAsChild(Rhino.Render.DataSources.ContentFactory,System.String)"]
See Also
Reference
RenderContent Class
IsFactoryProductAcceptableAsChild Overload
Rhino.Render Namespace