RhinoCommon API
File3dmNamedConstructionPlanes.CopyTo Method
 Copies the content of the table to an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void CopyTo(
	ConstructionPlane[] array,
	int arrayIndex
)
Public Sub CopyTo (
	array As ConstructionPlane(),
	arrayIndex As Integer
)
Parameters
array
Type: Rhino.DocObjects.ConstructionPlane[]
[Missing <param name="array"/> documentation for "M:Rhino.FileIO.File3dmNamedConstructionPlanes.CopyTo(Rhino.DocObjects.ConstructionPlane[],System.Int32)"]
arrayIndex
Type: System.Int32
[Missing <param name="arrayIndex"/> documentation for "M:Rhino.FileIO.File3dmNamedConstructionPlanes.CopyTo(Rhino.DocObjects.ConstructionPlane[],System.Int32)"]
Implements
ICollection<T>.CopyTo(T[], Int32)
See Also
Reference
File3dmNamedConstructionPlanes Class
Rhino.FileIO Namespace