RhinoCommon API
Layer.HasPerViewportSettings Method
 Verifies that a layer has per viewport settings.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool HasPerViewportSettings(
	Guid viewportId
)
Public Function HasPerViewportSettings (
	viewportId As Guid
) As Boolean
Parameters
viewportId
Type: System.Guid
 If not Guid.Empty, then checks for settings for that specific viewport. If Guid.Empty, then checks for any viewport settings.
Return Value
Type: Boolean
True if the layer has per viewport settings, false otherwise.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace