RhinoCommon API
MouseCallback.OnEndMouseDown Method
 Called at the end of handling of a mouse down event in Rhino. All of the default Rhino mouse down functionality has already been executed unless a MouseCallback has set Cancel to true for the event arguments. You can tell if this is the case by inspecting the Cancel property in the event arguments parameter. Base class implementation of this function does nothing
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnEndMouseDown(
	MouseCallbackEventArgs e
)
Protected Overridable Sub OnEndMouseDown (
	e As MouseCallbackEventArgs
)
Parameters
e
Type: Rhino.UI.MouseCallbackEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.UI.MouseCallback.OnEndMouseDown(Rhino.UI.MouseCallbackEventArgs)"]
See Also
Reference
MouseCallback Class
Rhino.UI Namespace