RhinoCommon API
PersistentSettings.TryGetDate Method (String, DateTime, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetDate(System.String,System.DateTime@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetDate(
	string key,
	out DateTime value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetDate (
	key As String,
	<OutAttribute> ByRef value As DateTime,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetDate(System.String,System.DateTime@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: System.DateTime
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetDate(System.String,System.DateTime@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetDate(System.String,System.DateTime@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetDate(System.String,System.DateTime@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetDate Overload
Rhino Namespace