RhinoCommon API
ViewportInfo Constructor
 Initializes a new instance.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ViewportInfo()
Public Sub New
See Also
Reference
ViewportInfo Class
ViewportInfo Overload
Rhino.DocObjects Namespace