RhinoCommon API
Curve.CreateBooleanDifference Method (Curve, IEnumerable<Curve>, Double)
 Calculates the boolean difference between a closed planar curve, and a list of closed planar curves. Note, curves must be co-planar.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Curve[] CreateBooleanDifference(
	Curve curveA,
	IEnumerable<Curve> subtractors,
	double tolerance
)
Public Shared Function CreateBooleanDifference (
	curveA As Curve,
	subtractors As IEnumerable(Of Curve),
	tolerance As Double
) As Curve()
Parameters
curveA
Type: Rhino.Geometry.Curve
The first closed, planar curve.
subtractors
Type: System.Collections.Generic.IEnumerable<Curve>
curves to subtract from the first closed curve.
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.Curve.CreateBooleanDifference(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)"]
Return Value
Type: Curve[]
Result curves on success, empty array if no difference could be calculated.
See Also
Reference
Curve Class
CreateBooleanDifference Overload
Rhino.Geometry Namespace