RhinoCommon API
SurfaceFilletBase Constructor (BrepFace, Point2d, BrepFace, Point2d, Double, Boolean, Double)
Initializes a new instance of the SurfaceFilletBase class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected SurfaceFilletBase(
	BrepFace FaceA,
	Point2d uvA,
	BrepFace FaceB,
	Point2d uvB,
	double radius,
	bool allowExtend,
	double tolerance
)
Protected Sub New (
	FaceA As BrepFace,
	uvA As Point2d,
	FaceB As BrepFace,
	uvB As Point2d,
	radius As Double,
	allowExtend As Boolean,
	tolerance As Double
)
Parameters
FaceA
Type: Rhino.Geometry.BrepFace
[Missing <param name="FaceA"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Double)"]
uvA
Type: Rhino.Geometry.Point2d
[Missing <param name="uvA"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Double)"]
FaceB
Type: Rhino.Geometry.BrepFace
[Missing <param name="FaceB"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Double)"]
uvB
Type: Rhino.Geometry.Point2d
[Missing <param name="uvB"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Double)"]
radius
Type: System.Double
[Missing <param name="radius"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Double)"]
allowExtend
Type: System.Boolean
[Missing <param name="allowExtend"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Double)"]
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Double)"]
See Also
Reference
SurfaceFilletBase Class
SurfaceFilletBase Overload
Rhino.Geometry Namespace