RhinoCommon API
RenderContent.RegisterContent Method (PlugIn)
 Call RegisterContent in your plug-in's OnLoad function in order to register all of the custom RenderContent classes in your assembly.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public static Type[] RegisterContent(
	PlugIn plugin
)
Public Shared Function RegisterContent (
	plugin As PlugIn
) As Type()
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.RenderContent.RegisterContent(Rhino.PlugIns.PlugIn)"]
Return Value
Type: Type[]
array of render content types registered on success. null on error.
See Also
Reference
RenderContent Class
RegisterContent Overload
Rhino.Render Namespace