RhinoCommon API
DisplayPipeline.DrawText Method (TextEntity, Color, Double)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.TextEntity,System.Drawing.Color,System.Double)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawText(
	TextEntity text,
	Color color,
	double scale
)
Public Sub DrawText (
	text As TextEntity,
	color As Color,
	scale As Double
)
Parameters
text
Type: Rhino.Geometry.TextEntity
[Missing <param name="text"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.TextEntity,System.Drawing.Color,System.Double)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.TextEntity,System.Drawing.Color,System.Double)"]
scale
Type: System.Double
[Missing <param name="scale"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.TextEntity,System.Drawing.Color,System.Double)"]
See Also
Reference
DisplayPipeline Class
DrawText Overload
Rhino.Display Namespace