RhinoCommon API
PlugIn.DisplayHelp Method
 Called by Rhino if AddToHelpMenu is true and menu item associated with this plug-in is selected.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public virtual bool DisplayHelp(
	IntPtr windowHandle
)
Public Overridable Function DisplayHelp (
	windowHandle As IntPtr
) As Boolean
Parameters
windowHandle
Type: System.IntPtr
Native Window handle of the active Rhino interface.
Return Value
Type: Boolean
true = Help displayed successfully, false = Error displaying help
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace