RhinoCommon API
Curve.ExtremeParameters Method
 Returns the parameter values of all local extrema. Parameter values are in increasing order so consecutive extrema define an interval on which each component of the curve is monotone. Note, non-periodic curves always return the end points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double[] ExtremeParameters(
	Vector3d direction
)
Public Function ExtremeParameters (
	direction As Vector3d
) As Double()
Parameters
direction
Type: Rhino.Geometry.Vector3d
The direction in which to perform the calculation.
Return Value
Type: Double[]
The parameter values of all local extrema.
See Also
Reference
Curve Class
Rhino.Geometry Namespace