RhinoCommon API
File3dmObjectTable.FindByLayer Method (Layer)
 Finds all File3dmObject that are in a given layer.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public File3dmObject[] FindByLayer(
	Layer layer
)
Public Function FindByLayer (
	layer As Layer
) As File3dmObject()
Parameters
layer
Type: Rhino.DocObjects.Layer
A layer instance.
Return Value
Type: File3dmObject[]
Array of objects that belong to the specified layer or empty array if no objects could be found.
Exceptions
Exception | Condition
ArgumentNullException | If layer is null.
See Also
Reference
File3dmObjectTable Class
FindByLayer Overload
Rhino.FileIO Namespace