RhinoCommon API
Squisher.Get2dMesh Method
 Get the 2d mesh that results from the squish operation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public Mesh Get2dMesh()
Public Function Get2dMesh As Mesh
Return Value
Type: Mesh
Returns the squished 2d mesh
See Also
Reference
Squisher Class
Rhino.Geometry Namespace