RhinoCommon API
Mesh.CreateBooleanDifference Method (IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result)
 Computes the solid difference of two sets of Meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Mesh[] CreateBooleanDifference(
	IEnumerable<Mesh> firstSet,
	IEnumerable<Mesh> secondSet,
	MeshBooleanOptions options,
	out Result result
)
Public Shared Function CreateBooleanDifference (
	firstSet As IEnumerable(Of Mesh),
	secondSet As IEnumerable(Of Mesh),
	options As MeshBooleanOptions,
	<OutAttribute> ByRef result As Result
) As Mesh()
Parameters
firstSet
Type: System.Collections.Generic.IEnumerable<Mesh>
First set of Meshes (the set to subtract from).
secondSet
Type: System.Collections.Generic.IEnumerable<Mesh>
Second set of Meshes (the set to subtract).
options
Type: Rhino.Geometry.MeshBooleanOptions
An option instance. Should have a valid Tolerance set.
result
Type: Rhino.Commands.Result
Indicates if the function succeeded, was cancelled, did nothing, or failed.
Return Value
Type: Mesh[]
An array of Mesh results or null on failure.
See Also
Reference
Mesh Class
CreateBooleanDifference Overload
Rhino.Geometry Namespace