RhinoCommon API
RebuildCurveOptions.IntToKinkSplitting Method
[Missing <summary> documentation for "M:Rhino.Geometry.RebuildCurveOptions.IntToKinkSplitting(System.Int32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RebuildCurveKinkSplitting IntToKinkSplitting(
	int kink_splitting_at_as_int
)
Public Function IntToKinkSplitting (
	kink_splitting_at_as_int As Integer
) As RebuildCurveKinkSplitting
Parameters
kink_splitting_at_as_int
Type: System.Int32
[Missing <param name="kink_splitting_at_as_int"/> documentation for "M:Rhino.Geometry.RebuildCurveOptions.IntToKinkSplitting(System.Int32)"]
Return Value
Type: RebuildCurveKinkSplitting
[Missing <returns> documentation for "M:Rhino.Geometry.RebuildCurveOptions.IntToKinkSplitting(System.Int32)"]
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace