RhinoCommon API
GroupTable.GroupName Method
 Returns the name of a group.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string GroupName(
	int groupIndex
)
Public Function GroupName (
	groupIndex As Integer
) As String
Parameters
groupIndex
Type: System.Int32
The index of the group.
Return Value
Type: String
The group name.
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace