RhinoCommon API
Intersection.MeshMeshAccurate Method
 Intersects two meshes. Overlaps and near misses are handled. This is an old method kept for compatibility.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Polyline[] MeshMeshAccurate(
	Mesh meshA,
	Mesh meshB,
	double tolerance
)
Public Shared Function MeshMeshAccurate (
	meshA As Mesh,
	meshB As Mesh,
	tolerance As Double
) As Polyline()
Parameters
meshA
Type: Rhino.Geometry.Mesh
First mesh for intersection.
meshB
Type: Rhino.Geometry.Mesh
Second mesh for intersection.
tolerance
Type: System.Double
A tolerance value. If negative, the positive value will be used. WARNING! Good tolerance values are in the magnitude of 10^-7, or RhinoMath.SqrtEpsilon*10.
Return Value
Type: Polyline[]
An array of intersection and overlaps polylines.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace