RhinoCommon API
RenderWindow.Channel.GetValue Method
 Get values from the channel.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void GetValue(
	int x,
	int y,
	ComponentOrders componentOrder,
	ref float[] values
)
Public Sub GetValue (
	x As Integer,
	y As Integer,
	componentOrder As ComponentOrders,
	ByRef values As Single()
)
Parameters
x
Type: System.Int32
[Missing <param name="x"/> documentation for "M:Rhino.Render.RenderWindow.Channel.GetValue(System.Int32,System.Int32,Rhino.Render.ComponentOrders,System.Single[]@)"]
y
Type: System.Int32
[Missing <param name="y"/> documentation for "M:Rhino.Render.RenderWindow.Channel.GetValue(System.Int32,System.Int32,Rhino.Render.ComponentOrders,System.Single[]@)"]
componentOrder
Type: Rhino.Render.ComponentOrders
[Missing <param name="componentOrder"/> documentation for "M:Rhino.Render.RenderWindow.Channel.GetValue(System.Int32,System.Int32,Rhino.Render.ComponentOrders,System.Single[]@)"]
values
Type: System.Single[]
[Missing <param name="values"/> documentation for "M:Rhino.Render.RenderWindow.Channel.GetValue(System.Int32,System.Int32,Rhino.Render.ComponentOrders,System.Single[]@)"]
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace