RhinoCommon API
Point3f.Multiply Operator (Point3f, Single)
 Multiplies a point by a factor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Point3f operator *(
	Point3f point,
	float value
)
Public Shared Operator * (
	point As Point3f,
	value As Single
) As Point3f
Parameters
point
Type: Rhino.Geometry.Point3f
A point.
value
Type: System.Single
A value.
Return Value
Type: Point3f
A new vector that is the multiplication of point by value.
See Also
Reference
Point3f Structure
Multiply Overload
Rhino.Geometry Namespace