RhinoCommon API
LinetypeTable.FindName Method
Finds the linetype with a given name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Linetype FindName(
	string name
)
Public Function FindName (
	name As String
) As Linetype
Parameters
name
Type: System.String
he name of the linetype to find.
Return Value
Type: Linetype
 The linetype. If the linetype was not found, then the default, or "Continuous" linetype is returned.
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace