RhinoCommon API
LicenseUtils.AskUserForLicense Method (Int32, Boolean, Object, String, ValidateProductKeyDelegate, OnLeaseChangedDelegate, String, String, Guid, Guid, LicenseCapabilities)
 This version of Rhino.PlugIns.LicenseUtils.AskUserForLicense is used by Rhino C++ plug-ins.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool AskUserForLicense(
	int productType,
	bool standAlone,
	Object parentWindow,
	string textMask,
	ValidateProductKeyDelegate validateProductKeyDelegate,
	OnLeaseChangedDelegate onLeaseChangedDelegate,
	string product_path,
	string product_title,
	Guid pluginId,
	Guid licenseId,
	LicenseCapabilities capabilities
)
Public Shared Function AskUserForLicense (
	productType As Integer,
	standAlone As Boolean,
	parentWindow As Object,
	textMask As String,
	validateProductKeyDelegate As ValidateProductKeyDelegate,
	onLeaseChangedDelegate As OnLeaseChangedDelegate,
	product_path As String,
	product_title As String,
	pluginId As Guid,
	licenseId As Guid,
	capabilities As LicenseCapabilities
) As Boolean
Parameters
productType
Type: System.Int32
[Missing <param name="productType"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)"]
standAlone
Type: System.Boolean
[Missing <param name="standAlone"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)"]
parentWindow
Type: System.Object
[Missing <param name="parentWindow"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)"]
textMask
Type: System.String
[Missing <param name="textMask"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)"]
validateProductKeyDelegate
Type: Rhino.PlugIns.ValidateProductKeyDelegate
[Missing <param name="validateProductKeyDelegate"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)"]
onLeaseChangedDelegate
Type: Rhino.PlugIns.OnLeaseChangedDelegate
[Missing <param name="onLeaseChangedDelegate"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)"]
product_path
Type: System.String
[Missing <param name="product_path"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)"]
product_title
Type: System.String
[Missing <param name="product_title"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)"]
pluginId
Type: System.Guid
[Missing <param name="pluginId"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)"]
licenseId
Type: System.Guid
[Missing <param name="licenseId"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)"]
capabilities
Type: Rhino.PlugIns.LicenseCapabilities
[Missing <param name="capabilities"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)"]
See Also
Reference
LicenseUtils Class
AskUserForLicense Overload
Rhino.PlugIns Namespace