RhinoCommon API
TextFields.LayoutUserText Method (String)
 Returns a value from the active layouts user text strings for the specified key.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string LayoutUserText(
	string key
)
Public Shared Function LayoutUserText (
	key As String
) As String
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Runtime.TextFields.LayoutUserText(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.LayoutUserText(System.String)"]
See Also
Reference
TextFields Class
LayoutUserText Overload
Rhino.Runtime Namespace