RhinoCommon API
ColorRGBA.CreateFromArgb Method (Byte, Byte, Byte, Byte)
 Constructs a RGBA color from the four ARGB components (alpha, red, green, and blue) values.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static ColorRGBA CreateFromArgb(
	byte alpha,
	byte red,
	byte green,
	byte blue
)
Public Shared Function CreateFromArgb (
	alpha As Byte,
	red As Byte,
	green As Byte,
	blue As Byte
) As ColorRGBA
Parameters
alpha
Type: System.Byte
The alpha component. Valid values are 0 through 255.
red
Type: System.Byte
The red component. Valid values are 0 through 255.
green
Type: System.Byte
The green component. Valid values are 0 through 255.
blue
Type: System.Byte
The blue component. Valid values are 0 through 255.
Return Value
Type: ColorRGBA
A RGBA color with the specified component values.
See Also
Reference
ColorRGBA Structure
CreateFromArgb Overload
Rhino.Display Namespace