RhinoCommon API
GeometryBase.Dispose Method (Boolean)
 Overridden in order to destroy local display cache information
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Dispose(
	bool disposing
)
Protected Overrides Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
GeometryBase Class
Dispose Overload
Rhino.Geometry Namespace