RhinoCommon API
Mesh.RequireIterativeCleanup Method
 Analyzes some meshes, and determines if a pass of CreateFromIterativeCleanup would change the array.
All available cleanup steps are used. Currently available cleanup steps are:
- mending of single precision coincidence even though double precision vertices differ.
- union of nearly identical vertices, irrespectively of their origin.
- removal of t-joints along edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool RequireIterativeCleanup(
	IEnumerable<Mesh> meshes,
	double tolerance
)
Public Shared Function RequireIterativeCleanup (
	meshes As IEnumerable(Of Mesh),
	tolerance As Double
) As Boolean
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
A list, and array or any enumerable of meshes.
tolerance
Type: System.Double
A 3d distance. This is usually a value of about 10e-7 magnitude.
Return Value
Type: Boolean
True if meshes would be changed, otherwise false.
Remarks
See Also
Reference
Mesh Class
Rhino.Geometry Namespace
Mesh.CreateFromIterativeCleanup(IEnumerable<Mesh>, Double)