RhinoCommon API
LightManagerSupport.ObjectSerialNumberFromLight Method
 Get the object serial number of the light
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract int ObjectSerialNumberFromLight(
	RhinoDoc doc,
	ref Light light
)
Public MustOverride Function ObjectSerialNumberFromLight (
	doc As RhinoDoc,
	ByRef light As Light
) As Integer
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.LightManagerSupport.ObjectSerialNumberFromLight(Rhino.RhinoDoc,Rhino.Geometry.Light@)"]
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.LightManagerSupport.ObjectSerialNumberFromLight(Rhino.RhinoDoc,Rhino.Geometry.Light@)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.LightManagerSupport.ObjectSerialNumberFromLight(Rhino.RhinoDoc,Rhino.Geometry.Light@)"]
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace