RhinoCommon API
LicenseData Constructor (String, String, String, LicenseBuildType)
 Public constructor
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public LicenseData(
	string productLicense,
	string serialNumber,
	string licenseTitle,
	LicenseBuildType buildType
)
Public Sub New (
	productLicense As String,
	serialNumber As String,
	licenseTitle As String,
	buildType As LicenseBuildType
)
Parameters
productLicense
Type: System.String
License string to be saved by ZooClient
serialNumber
Type: System.String
Serial number to be displayed to end user
licenseTitle
Type: System.String
Title of license (Rhino 6.0 Evaluation)
buildType
Type: Rhino.PlugIns.LicenseBuildType
A LicenseBuildType value
See Also
Reference
LicenseData Class
LicenseData Overload
Rhino.PlugIns Namespace