RhinoCommon API
Brep.CreateFromSweepInParts Method
 Makes a 2 rail sweep. Like CreateFromSweep but the result is split where parameterization along a rail changes abruptly.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Brep[] CreateFromSweepInParts(
	Curve rail1,
	Curve rail2,
	IEnumerable<Curve> shapes,
	IEnumerable<Point2d> rail_params,
	bool closed,
	double tolerance
)
Public Shared Function CreateFromSweepInParts (
	rail1 As Curve,
	rail2 As Curve,
	shapes As IEnumerable(Of Curve),
	rail_params As IEnumerable(Of Point2d),
	closed As Boolean,
	tolerance As Double
) As Brep()
Parameters
rail1
Type: Rhino.Geometry.Curve
Rail to sweep shapes along
rail2
Type: Rhino.Geometry.Curve
Rail to sweep shapes along
shapes
Type: System.Collections.Generic.IEnumerable<Curve>
Shape curves
rail_params
Type: System.Collections.Generic.IEnumerable<Point2d>
Shape parameters
closed
Type: System.Boolean
Only matters if shapes are closed
tolerance
Type: System.Double
Tolerance for fitting surface and rails
Return Value
Type: Brep[]
Array of Brep sweep results
See Also
Reference
Brep Class
Rhino.Geometry Namespace