RhinoCommon API
ColorHSL Constructor (Color)
 Constructs a new instance of ColorHSL that is equivalent to an ARGB color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ColorHSL(
	Color rgb
)
Public Sub New (
	rgb As Color
)
Parameters
rgb
Type: System.Drawing.Color
ARGB color to mimic.
Remarks
Exact conversions between color spaces are often not possible.
See Also
Reference
ColorHSL Structure
ColorHSL Overload
Rhino.Display Namespace