RhinoCommon API
MarkupTable.Delete Method (IEnumerable<Int32>, Boolean, Int32)
 Delete multiple markups.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Delete(
	IEnumerable<int> markupIndices,
	bool quiet,
	int deleteWarning
)
Public Function Delete (
	markupIndices As IEnumerable(Of Integer),
	quiet As Boolean,
	deleteWarning As Integer
) As Integer
Parameters
markupIndices
Type: System.Collections.Generic.IEnumerable<Int32>
An enumeration of markup indices.
quiet
Type: System.Boolean
If true, no warning message box appears if a markup is in use.
deleteWarning
Type: System.Int32
 Action to take when multiple delete warnings occur, where: 0 == No to all, 1 == Yes to all, 2 == Ask the user.
Return Value
Type: Int32
The number of markups that were deleted.
See Also
Reference
MarkupTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace