RhinoCommon API
RenderContentCollection.Find_Sel Method
 TODO
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderContent Find_Sel(
	Guid uuid
)
Public Function Find_Sel (
	uuid As Guid
) As RenderContent
Parameters
uuid
Type: System.Guid
[Missing <param name="uuid"/> documentation for "M:Rhino.Render.RenderContentCollection.Find_Sel(System.Guid)"]
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.Render.RenderContentCollection.Find_Sel(System.Guid)"]
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace