RhinoCommon API
SquishParameters.SetDeformation Method
 Sets the squish deformation characteristics
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public void SetDeformation(
	SquishDeformation deformation,
	bool bPreserveBoundary,
	double boundaryStretchConstant,
	double boundaryCompressConstant,
	double interiorStretchConstant,
	double interiorCompressConstant
)
Public Sub SetDeformation (
	deformation As SquishDeformation,
	bPreserveBoundary As Boolean,
	boundaryStretchConstant As Double,
	boundaryCompressConstant As Double,
	interiorStretchConstant As Double,
	interiorCompressConstant As Double
)
Parameters
deformation
Type: Rhino.Geometry.SquishDeformation
[Missing <param name="deformation"/> documentation for "M:Rhino.Geometry.SquishParameters.SetDeformation(Rhino.Geometry.SquishDeformation,System.Boolean,System.Double,System.Double,System.Double,System.Double)"]
bPreserveBoundary
Type: System.Boolean
[Missing <param name="bPreserveBoundary"/> documentation for "M:Rhino.Geometry.SquishParameters.SetDeformation(Rhino.Geometry.SquishDeformation,System.Boolean,System.Double,System.Double,System.Double,System.Double)"]
boundaryStretchConstant
Type: System.Double
[Missing <param name="boundaryStretchConstant"/> documentation for "M:Rhino.Geometry.SquishParameters.SetDeformation(Rhino.Geometry.SquishDeformation,System.Boolean,System.Double,System.Double,System.Double,System.Double)"]
boundaryCompressConstant
Type: System.Double
[Missing <param name="boundaryCompressConstant"/> documentation for "M:Rhino.Geometry.SquishParameters.SetDeformation(Rhino.Geometry.SquishDeformation,System.Boolean,System.Double,System.Double,System.Double,System.Double)"]
interiorStretchConstant
Type: System.Double
[Missing <param name="interiorStretchConstant"/> documentation for "M:Rhino.Geometry.SquishParameters.SetDeformation(Rhino.Geometry.SquishDeformation,System.Boolean,System.Double,System.Double,System.Double,System.Double)"]
interiorCompressConstant
Type: System.Double
[Missing <param name="interiorCompressConstant"/> documentation for "M:Rhino.Geometry.SquishParameters.SetDeformation(Rhino.Geometry.SquishDeformation,System.Boolean,System.Double,System.Double,System.Double,System.Double)"]
See Also
Reference
SquishParameters Class
Rhino.Geometry Namespace