RhinoCommon API
SelectionFilterSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static SelectionFilterSettingsState GetDefaultState()
Public Shared Function GetDefaultState As SelectionFilterSettingsState
Return Value
Type: SelectionFilterSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.SelectionFilterSettings.GetDefaultState"]
See Also
Reference
SelectionFilterSettings Class
Rhino.ApplicationSettings Namespace