RhinoCommon API
ObjectTable.AddText Method (TextEntity, ObjectAttributes, HistoryRecord, Boolean)
 Adds a text object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddText(
	TextEntity text,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddText (
	text As TextEntity,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
text
Type: Rhino.Geometry.TextEntity
Text object to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Geometry.TextEntity,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
history
Type: Rhino.DocObjects.HistoryRecord
Object history to save.
reference
Type: System.Boolean
If reference, then object will not be saved into the 3dm file.
Return Value
Type: Guid
The Id of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddText Overload
Rhino.DocObjects.Tables Namespace