RhinoCommon API
ObjRef.SubDVertex Method
 Gets the SubDVertex if the referenced geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public SubDVertex SubDVertex()
Public Function SubDVertex As SubDVertex
Return Value
Type: SubDVertex
A SubDVertex; or null if the referenced object is not a SubDVertex, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace