RhinoCommon API
Environment Constructor
 Initializes a new environment.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Environment()
Public Sub New
See Also
Reference
Environment Class
Rhino.DocObjects Namespace