RhinoCommon API
SubDComponent.Equals Method (Object)
 Determines whether an object is a SubDComponent referring to the same component, with the same orientation, in the same SubD.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
The object to compare with.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDComponent.Equals(System.Object)"]
See Also
Reference
SubDComponent Class
Equals Overload
Rhino.Geometry Namespace