RhinoCommon API
UserInterfaceGrid.EnableRowSeparatorBelowRow Method
 Draw a horizontal line under one row, for a heading row that wants a rule under it when a line between every row would be too much. RowSeparators draws them all whatever this is set to.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void EnableRowSeparatorBelowRow(
	int row,
	bool on
)
Public Sub EnableRowSeparatorBelowRow (
	row As Integer,
	on As Boolean
)
Parameters
row
Type: System.Int32
[Missing <param name="row"/> documentation for "M:Rhino.UI.UserInterfaceGrid.EnableRowSeparatorBelowRow(System.Int32,System.Boolean)"]
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.UI.UserInterfaceGrid.EnableRowSeparatorBelowRow(System.Int32,System.Boolean)"]
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace