RhinoCommon API
PlugIn.IdFromFileName Method
 Attempt to get a plugiin id from just the filename of a plug-in
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public static Guid IdFromFileName(
	string filename
)
Public Shared Function IdFromFileName (
	filename As String
) As Guid
Parameters
filename
Type: System.String
plug-in filename
Return Value
Type: Guid
id on success; Guid.Empty if no plug-in could be found
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace