RhinoCommon API
SupportOptions.BlockContent_UseDefaultLocation Method
 Settings for the Block Content panel. This panel is the block-only sibling of the Libraries panel and keeps its own copy of the Libraries settings.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool BlockContent_UseDefaultLocation()
Public Shared Function BlockContent_UseDefaultLocation As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.BlockContent_UseDefaultLocation"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace