RhinoCommon API
CustomObjectGrips Constructor
Initializes a new instance of the CustomObjectGrips class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CustomObjectGrips()
Protected Sub New
See Also
Reference
CustomObjectGrips Class
CustomObjectGrips Overload
Rhino.DocObjects.Custom Namespace