RhinoCommon API
FileSat.Write Method
Write a Sat file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool Write(
	string filename,
	RhinoDoc doc,
	FileSatWriteOptions options
)
Public Shared Function Write (
	filename As String,
	doc As RhinoDoc,
	options As FileSatWriteOptions
) As Boolean
Parameters
filename
Type: System.String
path to write a file to
doc
Type: Rhino.RhinoDoc
document to get geometry from
options
Type: Rhino.FileIO.FileSatWriteOptions
options used for generating the Sat file
Return Value
Type: Boolean
true on success
See Also
Reference
FileSat Class
Rhino.FileIO Namespace