RhinoCommon API
TextEntity.GetTextTransform Method (ViewportInfo, Double, DimensionStyle)
 Get the transform for this text object's text geometry as it is drawn in a particular viewport. Unlike the parameterless-viewport overload, this honors the dimension style's TextOrientation (for example "Horizontal to view") and DrawForward, orienting the text against the viewport exactly as the display pipeline does. Use this when previewing text so the preview matches how the placed object will be drawn.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Transform GetTextTransform(
	ViewportInfo viewport,
	double textscale,
	DimensionStyle dimstyle
)
Public Function GetTextTransform (
	viewport As ViewportInfo,
	textscale As Double,
	dimstyle As DimensionStyle
) As Transform
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
Viewport the text is being drawn in.
textscale
Type: System.Double
Scale to apply to the text.
dimstyle
Type: Rhino.DocObjects.DimensionStyle
The text's dimension style.
Return Value
Type: Transform
[Missing <returns> documentation for "M:Rhino.Geometry.TextEntity.GetTextTransform(Rhino.DocObjects.ViewportInfo,System.Double,Rhino.DocObjects.DimensionStyle)"]
See Also
Reference
TextEntity Class
GetTextTransform Overload
Rhino.Geometry Namespace