RhinoCommon API
NamedColorList Constructor (String, IEnumerable<NamedColor>)
 Initializes a new instance of the ColorList with the specified name and entries.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public NamedColorList(
	string name,
	IEnumerable<NamedColor> entries
)
Public Sub New (
	name As String,
	entries As IEnumerable(Of NamedColor)
)
Parameters
name
Type: System.String
Name of the list (required)
entries
Type: System.Collections.Generic.IEnumerable<NamedColor>
Initial set of color entries for the list
See Also
Reference
NamedColorList Class
NamedColorList Overload
Rhino.UI Namespace