RhinoCommon API
Layer.ParentLayer Method
 Returns parent of a layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Layer ParentLayer(
	bool rootLevelParent
)
Public Function ParentLayer (
	rootLevelParent As Boolean
) As Layer
Parameters
rootLevelParent
Type: System.Boolean
 If true, the root level parent is returned. The root level parent never has a parent. If false, the immediate parent is returned. The immediate parent may have a parent.
Return Value
Type: Layer
The parent layer, or null if the layer does not have a parent.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace