RhinoCommon API
File3dmDisplacement.GetSubItemFaceIndexes Method
 Gets all the sub-items on the displacement. Sub-items can exist to override the top-level parameters for polysurface/SubD faces. Sub-items are identified by the face index that they apply to. An array of the face indexes of each sub-item on the displacement.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int[] GetSubItemFaceIndexes()
Public Function GetSubItemFaceIndexes As Integer()
Return Value
Type: Int32[]
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmDisplacement.GetSubItemFaceIndexes"]
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace