RhinoCommon API
RhinoCore Constructor (String[], WindowStyle)
 Initializes a new instance of the RhinoCore class.
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RhinoCore(
	string[] args,
	WindowStyle windowStyle
)
Public Sub New (
	args As String(),
	windowStyle As WindowStyle
)
Parameters
args
Type: System.String[]
Rhino command line parameters
windowStyle
Type: Rhino.Runtime.InProcess.WindowStyle
Rhino main window initial style
Remarks
For args documentation see "https://developer.rhino3d.com/guides/cpp/running-rhino-from-command-line/"
See Also
Reference
RhinoCore Class
RhinoCore Overload
Rhino.Runtime.InProcess Namespace