RhinoCommon API
TrulyObservableOrderedSet<T>.AddRange Method
 Add multiple objects to the end of the ordered set. Only distinct items are added. If new items were added, one CollectionChanged event is fired.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddRange(
	IEnumerable<T> items
)
Public Sub AddRange (
	items As IEnumerable(Of T)
)
Parameters
items
Type: System.Collections.Generic.IEnumerable<T>
[Missing <param name="items"/> documentation for "M:Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.AddRange(System.Collections.Generic.IEnumerable{`0})"]
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace