RhinoCommon API
Interop.FileReadOptionsConstPointer Method
 Returns the underlying const CRhinoFileReadOptions* for a Rhino.FileIO.FileReadOptions object. You should only be interested in using this function if you are writing C++ code.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static IntPtr FileReadOptionsConstPointer(
	FileReadOptions options
)
Public Shared Function FileReadOptionsConstPointer (
	options As FileReadOptions
) As IntPtr
Parameters
options
Type: Rhino.FileIO.FileReadOptions
A FileReadOptions object.
Return Value
Type: IntPtr
A pointer to the Rhino const object.
See Also
Reference
Interop Class
Rhino.Runtime Namespace