RhinoCommon API
SubD.SetEdgeSharpness Method (IEnumerable<SubDEdge>, IEnumerable<SubDEdgeSharpness>, Boolean)
 Sets the sharpness of a list of edges, one sharpness per edge.
 Use this with CreateEdgeChainSharpness(Interval, Int32) to give a chain of edges a sharpness that varies evenly along it.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public uint SetEdgeSharpness(
	IEnumerable<SubDEdge> edges,
	IEnumerable<SubDEdgeSharpness> sharpnesses,
	bool preserveSymmetry
)
Public Function SetEdgeSharpness (
	edges As IEnumerable(Of SubDEdge),
	sharpnesses As IEnumerable(Of SubDEdgeSharpness),
	preserveSymmetry As Boolean
) As UInteger
Parameters
edges
Type: System.Collections.Generic.IEnumerable<SubDEdge>
The edges to change.
sharpnesses
Type: System.Collections.Generic.IEnumerable<SubDEdgeSharpness>
 One sharpness per edge, in the same order as edges. Must be the same length.
preserveSymmetry
Type: System.Boolean
 If true and this SubD has symmetric content, the change tries to keep it symmetric.
Return Value
Type: UInt32
The number of edges that were changed.
See Also
Reference
SubD Class
SetEdgeSharpness Overload
Rhino.Geometry Namespace