RhinoCommon API
Mesh.Reduce Method (ReduceMeshParameters, Boolean)
Reduce polygon count
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public bool Reduce(
	ReduceMeshParameters parameters,
	bool threaded
)
Public Function Reduce (
	parameters As ReduceMeshParameters,
	threaded As Boolean
) As Boolean
Parameters
parameters
Type: Rhino.Geometry.ReduceMeshParameters
Parameters
threaded
Type: System.Boolean
 If True then will run computation inside a worker thread and ignore any provided CancellationTokens and ProgressReporters. If False then will run on main thread.
Return Value
Type: Boolean
True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
See Also
Reference
Mesh Class
Reduce Overload
Rhino.Geometry Namespace