RhinoCommon API
File3dmViewTable.CopyTo Method
 Copies the content of the table to an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void CopyTo(
	ViewInfo[] array,
	int arrayIndex
)
Public Sub CopyTo (
	array As ViewInfo(),
	arrayIndex As Integer
)
Parameters
array
Type: Rhino.DocObjects.ViewInfo[]
[Missing <param name="array"/> documentation for "M:Rhino.FileIO.File3dmViewTable.CopyTo(Rhino.DocObjects.ViewInfo[],System.Int32)"]
arrayIndex
Type: System.Int32
[Missing <param name="arrayIndex"/> documentation for "M:Rhino.FileIO.File3dmViewTable.CopyTo(Rhino.DocObjects.ViewInfo[],System.Int32)"]
Implements
ICollection<T>.CopyTo(T[], Int32)
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace