RhinoCommon API
RhinoApp.WriteLine Method
Print a newline in the command window.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void WriteLine()
Public Shared Sub WriteLine
See Also
Reference
RhinoApp Class
WriteLine Overload
Rhino Namespace