RhinoCommon API
RenderTexture.SetMappingChannel Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.SetMappingChannel(System.Int32,Rhino.Render.RenderContent.ChangeContexts)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public virtual void SetMappingChannel(
	int value,
	RenderContent.ChangeContexts changeContext
)
Public Overridable Sub SetMappingChannel (
	value As Integer,
	changeContext As RenderContent.ChangeContexts
)
Parameters
value
Type: System.Int32
[Missing <param name="value"/> documentation for "M:Rhino.Render.RenderTexture.SetMappingChannel(System.Int32,Rhino.Render.RenderContent.ChangeContexts)"]
changeContext
Type: Rhino.Render.RenderContent.ChangeContexts
[Missing <param name="changeContext"/> documentation for "M:Rhino.Render.RenderTexture.SetMappingChannel(System.Int32,Rhino.Render.RenderContent.ChangeContexts)"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace