RhinoCommon API
HostUtils.LoadAssemblyFromName Method
 Calls Assembly.Load(AssemblyName) in .NET 4.8. May call a different routine under .NET Core
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.32
Syntax
public static Assembly LoadAssemblyFromName(
	AssemblyName assemblyName
)
Public Shared Function LoadAssemblyFromName (
	assemblyName As AssemblyName
) As Assembly
Parameters
assemblyName
Type: System.Reflection.AssemblyName
[Missing <param name="assemblyName"/> documentation for "M:Rhino.Runtime.HostUtils.LoadAssemblyFromName(System.Reflection.AssemblyName)"]
Return Value
Type: Assembly
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.LoadAssemblyFromName(System.Reflection.AssemblyName)"]
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace