RhinoCommon API
StatusBar.HideProgressMeter Method (UInt32)
 Ends, or hides, Rhino's status bar progress meter.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public static void HideProgressMeter(
	uint docSerialNumber
)
Public Shared Sub HideProgressMeter (
	docSerialNumber As UInteger
)
Parameters
docSerialNumber
Type: System.UInt32
The document runtime serial number.
See Also
Reference
StatusBar Class
HideProgressMeter Overload
Rhino.UI Namespace