RhinoCommon API
SimpleArrayHatchLinePointer Constructor
 Initializes a new SimpleArrayHatchLinePointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public SimpleArrayHatchLinePointer()
Public Sub New
See Also
Reference
SimpleArrayHatchLinePointer Class
SimpleArrayHatchLinePointer Overload
Rhino.Runtime.InteropWrappers Namespace