RhinoCommon API
RhinoDoc.GetCustomUnitSystem Method
 Get the custom unit system name and custom unit scale.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public bool GetCustomUnitSystem(
	bool modelUnits,
	out string customUnitName,
	out double metersPerCustomUnit
)
Public Function GetCustomUnitSystem (
	modelUnits As Boolean,
	<OutAttribute> ByRef customUnitName As String,
	<OutAttribute> ByRef metersPerCustomUnit As Double
) As Boolean
Parameters
modelUnits
Type: System.Boolean
 Set true to get values from the document's model unit system. Set false to get values from the document's page unit system.
customUnitName
Type: System.String
The custom unit system name.
metersPerCustomUnit
Type: System.Double
The meters per custom unit scale.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
RhinoDoc Class
Rhino Namespace