RhinoCommon API
SubDDisplayParameters.Fine Method
 Parameters for a fine limit surface display mesh. SubD display density = adaptive SubDDisplayParameters.Density.FineDensity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static SubDDisplayParameters Fine()
Public Shared Function Fine As SubDDisplayParameters
Return Value
Type: SubDDisplayParameters
The SubD display parameters.
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace