RhinoCommon API
AnnotationBase.IsPropertyOverridden Method
 Returns true if a property is overridden
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsPropertyOverridden(
	DimensionStyle.Field field
)
Public Function IsPropertyOverridden (
	field As DimensionStyle.Field
) As Boolean
Parameters
field
Type: Rhino.DocObjects.DimensionStyle.Field
[Missing <param name="field"/> documentation for "M:Rhino.Geometry.AnnotationBase.IsPropertyOverridden(Rhino.DocObjects.DimensionStyle.Field)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.IsPropertyOverridden(Rhino.DocObjects.DimensionStyle.Field)"]
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace