RhinoCommon API
Dialogs.KillSplash Method
 Destroy the splash screen if it is being displayed.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void KillSplash()
Public Shared Sub KillSplash
See Also
Reference
Dialogs Class
Rhino.UI Namespace