RhinoCommon API
HermiteSurface Constructor
 Initializes a new HermiteSurface instance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public HermiteSurface()
Public Sub New
See Also
Reference
HermiteSurface Class
HermiteSurface Overload
Rhino.Geometry Namespace