RhinoCommon API
ViewCaptureSettings.SetWindowRect Method (Point3d, Point3d)
 Set the print area to a window selection based on two points in world coordinates
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
public void SetWindowRect(
	Point3d worldPoint1,
	Point3d worldPoint2
)
Public Sub SetWindowRect (
	worldPoint1 As Point3d,
	worldPoint2 As Point3d
)
Parameters
worldPoint1
Type: Rhino.Geometry.Point3d
 First point in world coordinates. This point is projected to screen coordinates
worldPoint2
Type: Rhino.Geometry.Point3d
 Second point in world coordinates. This point is projected to screen coordinates
See Also
Reference
ViewCaptureSettings Class
SetWindowRect Overload
Rhino.Display Namespace