RhinoCommon API
AsyncRenderContext.Dispose Method
Releases all resources used by the AsyncRenderContext
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
AsyncRenderContext Class
Dispose Overload
Rhino.Render Namespace