RhinoCommon API
Surface.IsCone Method
 Determines if the surface is a portion of a cone within RhinoMath.ZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsCone()
Public Function IsCone As Boolean
Return Value
Type: Boolean
true if the surface is a portion of a cone.
See Also
Reference
Surface Class
IsCone Overload
Rhino.Geometry Namespace