RhinoCommon API
NurbsSurface.CreateFromPlane Method
 Creates a NURBS surface from a plane and additional parameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static NurbsSurface CreateFromPlane(
	Plane plane,
	Interval uInterval,
	Interval vInterval,
	int uDegree,
	int vDegree,
	int uPointCount,
	int vPointCount
)
Public Shared Function CreateFromPlane (
	plane As Plane,
	uInterval As Interval,
	vInterval As Interval,
	uDegree As Integer,
	vDegree As Integer,
	uPointCount As Integer,
	vPointCount As Integer
) As NurbsSurface
Parameters
plane
Type: Rhino.Geometry.Plane
The plane.
uInterval
Type: Rhino.Geometry.Interval
The interval describing the extends of the output surface in the U direction.
vInterval
Type: Rhino.Geometry.Interval
The interval describing the extends of the output surface in the V direction.
uDegree
Type: System.Int32
The degree of the output surface in the U direction.
vDegree
Type: System.Int32
The degree of the output surface in the V direction.
uPointCount
Type: System.Int32
The number of control points of the output surface in the U direction.
vPointCount
Type: System.Int32
The number of control points of the output surface in the V direction.
Return Value
Type: NurbsSurface
A NURBS surface if successful, or null on failure.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace