RhinoCommon API
PlugIn.SetLoadProtection Method
 Set load protection state for a certain plug-in
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.5
Syntax
public static void SetLoadProtection(
	Guid pluginId,
	bool loadSilently
)
Public Shared Sub SetLoadProtection (
	pluginId As Guid,
	loadSilently As Boolean
)
Parameters
pluginId
Type: System.Guid
[Missing <param name="pluginId"/> documentation for "M:Rhino.PlugIns.PlugIn.SetLoadProtection(System.Guid,System.Boolean)"]
loadSilently
Type: System.Boolean
[Missing <param name="loadSilently"/> documentation for "M:Rhino.PlugIns.PlugIn.SetLoadProtection(System.Guid,System.Boolean)"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace