RhinoCommon API
UserDataList.GetEnumerator Method
 Get enumerator for UserDataList
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IEnumerator<UserData> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of UserData)
Return Value
Type: IEnumerator<UserData>
[Missing <returns> documentation for "M:Rhino.DocObjects.Custom.UserDataList.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace