RhinoCommon API
PreviewAppearance.Background Method
 Background
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PreviewBackground Background()
Public Function Background As PreviewBackground
Return Value
Type: PreviewBackground
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.Background"]
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace