RhinoCommon API
RenderTexture.GraphInfo Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GraphInfo(Rhino.Render.TextureGraphInfo@)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public void GraphInfo(
	ref TextureGraphInfo tgi
)
Public Sub GraphInfo (
	ByRef tgi As TextureGraphInfo
)
Parameters
tgi
Type: Rhino.Render.TextureGraphInfo
[Missing <param name="tgi"/> documentation for "M:Rhino.Render.RenderTexture.GraphInfo(Rhino.Render.TextureGraphInfo@)"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace