RhinoCommon API
BrepFaceList.ExtractFace Method
 Extracts a face from a Brep.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep ExtractFace(
	int faceIndex
)
Public Function ExtractFace (
	faceIndex As Integer
) As Brep
Parameters
faceIndex
Type: System.Int32
A face index
Return Value
Type: Brep
A brep. This can be null.
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace