RhinoCommon API
ArchivableDictionary.GetDictionary Method (String)
 Get value as ArchivableDictionary, will only succeed if value was created using Set(string key, ArchivableDictionary value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public ArchivableDictionary GetDictionary(
	string key
)
Public Function GetDictionary (
	key As String
) As ArchivableDictionary
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetDictionary(System.String)"]
Return Value
Type: ArchivableDictionary
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetDictionary(System.String)"]
See Also
Reference
ArchivableDictionary Class
GetDictionary Overload
Rhino.Collections Namespace