RhinoCommon API
RhinoList<T>.Sort Method (IComparer<T>)
 Sorts the elements in the entire list using the specified System.Comparison(T)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Sort(
	IComparer<T> comparer
)
Public Sub Sort (
	comparer As IComparer(Of T)
)
Parameters
comparer
Type: System.Collections.Generic.IComparer<T>
The IComparer(T) implementation to use when comparing elements, or a null reference (Nothing in Visual Basic) to use the default comparer Comparer(T).Default.
See Also
Reference
RhinoList<T> Class
Sort Overload
Rhino.Collections Namespace