RhinoCommon API
SceneServerData.Dispose Method (Boolean)
 Dispose for SceneServerData
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool bDisposing
)
Protected Overridable Sub Dispose (
	bDisposing As Boolean
)
Parameters
bDisposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
SceneServerData Class
Dispose Overload
Rhino.Render Namespace