RhinoCommon API
LengthValue.ChangeUnitSystem Method
 Change the UnitSystem of a LengthValue The numeric value of Length is scaled by new_us / current unit system so that the absolute length stays the same
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LengthValue ChangeUnitSystem(
	UnitSystem newUnits
)
Public Function ChangeUnitSystem (
	newUnits As UnitSystem
) As LengthValue
Parameters
newUnits
Type: Rhino.UnitSystem
[Missing <param name="newUnits"/> documentation for "M:Rhino.LengthValue.ChangeUnitSystem(Rhino.UnitSystem)"]
Return Value
Type: LengthValue
[Missing <returns> documentation for "M:Rhino.LengthValue.ChangeUnitSystem(Rhino.UnitSystem)"]
See Also
Reference
LengthValue Class
Rhino Namespace