RhinoCommon API
ChangeQueue.ApplyDisplayPipelineAttributesChanges Method
 Override if you need to react to display attribute changes. This function is needed to be able to react to different sample settings for i.e. capture preview rendering.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ApplyDisplayPipelineAttributesChanges(
	DisplayPipelineAttributes displayPipelineAttributes
)
Protected Overridable Sub ApplyDisplayPipelineAttributesChanges (
	displayPipelineAttributes As DisplayPipelineAttributes
)
Parameters
displayPipelineAttributes
Type: Rhino.Display.DisplayPipelineAttributes
The changed DisplayPipelineAttributes.
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace