RhinoCommon API
StackedDialogPage.AddChildPage Method
 Currently only supported on Windows. Call this method to add a child page to a page after the parent dialog has been created.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void AddChildPage(
	StackedDialogPage pageToAdd
)
Public Sub AddChildPage (
	pageToAdd As StackedDialogPage
)
Parameters
pageToAdd
Type: Rhino.UI.StackedDialogPage
[Missing <param name="pageToAdd"/> documentation for "M:Rhino.UI.StackedDialogPage.AddChildPage(Rhino.UI.StackedDialogPage)"]
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace