RhinoCommon API
PointCloud.ClearPointValues Method
 Destroys the extra value information in this point cloud. Extra values can be used to store a user-defined values, such as intensity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public void ClearPointValues()
Public Sub ClearPointValues
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace