RhinoCommon API
RenderContent.AddChild Method (RenderContent)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.AddChild(Rhino.Render.RenderContent)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
[ObsoleteAttribute("This method is obsolete and simply calls SetChild")]
public bool AddChild(
	RenderContent renderContent
)
<ObsoleteAttribute("This method is obsolete and simply calls SetChild")>
Public Function AddChild (
	renderContent As RenderContent
) As Boolean
Parameters
renderContent
Type: Rhino.Render.RenderContent
[Missing <param name="renderContent"/> documentation for "M:Rhino.Render.RenderContent.AddChild(Rhino.Render.RenderContent)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.AddChild(Rhino.Render.RenderContent)"]
See Also
Reference
RenderContent Class
AddChild Overload
Rhino.Render Namespace