RhinoCommon API
RhinoViewport.SetProjection Method (DefinedViewportProjection, String, Boolean)
 Set viewport to a defined projection.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SetProjection(
	DefinedViewportProjection projection,
	string viewName,
	bool updateConstructionPlane
)
Public Function SetProjection (
	projection As DefinedViewportProjection,
	viewName As String,
	updateConstructionPlane As Boolean
) As Boolean
Parameters
projection
Type: Rhino.Display.DefinedViewportProjection
The "standard" projection type.
viewName
Type: System.String
If not null or empty, the name is set.
updateConstructionPlane
Type: System.Boolean
If true, the construction plane is set to the viewport plane.
Return Value
Type: Boolean
true if successful.
See Also
Reference
RhinoViewport Class
SetProjection Overload
Rhino.Display Namespace