RhinoCommon API
LinetypeTable.UndoModify Method
 If the linetype has been modified and the modification can be undone, then UndoModify() will restore the linetype to its previous state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool UndoModify(
	int index
)
Public Function UndoModify (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
Zero based index of linetype for which to undo changes.
Return Value
Type: Boolean
 true if this linetype had been modified and the modifications were undone.
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace