RhinoCommon API
Mesh.GetOutlines Method (Plane)
 Constructs the outlines of a mesh projected against a plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Polyline[] GetOutlines(
	Plane plane
)
Public Function GetOutlines (
	plane As Plane
) As Polyline()
Parameters
plane
Type: Rhino.Geometry.Plane
A plane to project against.
Return Value
Type: Polyline[]
An array of polylines, or null on error.
See Also
Reference
Mesh Class
GetOutlines Overload
Rhino.Geometry Namespace