RhinoCommon API
ColorCMYK.CreateFromHSV Method
 Constructs the nearest CMYK equivalent of an HSV color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ColorCMYK CreateFromHSV(
	ColorHSV hsv
)
Public Shared Function CreateFromHSV (
	hsv As ColorHSV
) As ColorCMYK
Parameters
hsv
Type: Rhino.Display.ColorHSV
Target color in HSV space.
Return Value
Type: ColorCMYK
The CMYK equivalent of the HSV color.
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace