RhinoCommon API
ColorHSV Constructor (Color)
 Constructs a new instance of ColorHSV that is equivalent to an ARGB color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ColorHSV(
	Color rgb
)
Public Sub New (
	rgb As Color
)
Parameters
rgb
Type: System.Drawing.Color
ARGB color to mimic.
Remarks
Exact conversions between color spaces are often not possible.
See Also
Reference
ColorHSV Structure
ColorHSV Overload
Rhino.Display Namespace