RhinoCommon API
BendSpaceMorph.MorphPoint Method
Morphs an Euclidean point.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public override Point3d MorphPoint(
	Point3d point
)
Public Overrides Function MorphPoint (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point that will be morphed by this object.
Return Value
Type: Point3d
Resulting morphed point.
See Also
Reference
BendSpaceMorph Class
Rhino.Geometry.Morphs Namespace