RhinoCommon API
GroupTable.Hide Method
 Hides all objects that are members of a group.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Hide(
	int groupIndex
)
Public Function Hide (
	groupIndex As Integer
) As Integer
Parameters
groupIndex
Type: System.Int32
The index of the group.
Return Value
Type: Int32
The number of objects that were hidden.
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace