RhinoCommon API
SupportOptions.UseDefaultLibraryPath Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.UseDefaultLibraryPath"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_UseDefaultLocation' instead")]
public static bool UseDefaultLibraryPath()
<ObsoleteAttribute("Use 'Libraries_UseDefaultLocation' instead")>
Public Shared Function UseDefaultLibraryPath As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.UseDefaultLibraryPath"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace