RhinoCommon API
Utilities.GetUnpackedFilesCacheFolder Method
 Gets a folder associated with the document for unpacking textures to
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string GetUnpackedFilesCacheFolder(
	RhinoDoc doc,
	bool create
)
Public Shared Function GetUnpackedFilesCacheFolder (
	doc As RhinoDoc,
	create As Boolean
) As String
Parameters
doc
Type: Rhino.RhinoDoc
The document the folder is associated with
create
Type: System.Boolean
If true, this will create a directory if it does not exist
Return Value
Type: String
The path to the unpacked files folder
Exceptions
Exception | Condition
ArgumentNullException | When doc is null
See Also
Reference
Utilities Class
Rhino.Render Namespace