RhinoCommon API
FileCsvDocument.TryGetString Method (String, Int32, String)
 Retrieves the value of a cell as a string, addressing the column by header name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetString(
	string column,
	int row,
	out string value
)
Public Function TryGetString (
	column As String,
	row As Integer,
	<OutAttribute> ByRef value As String
) As Boolean
Parameters
column
Type: System.String
The header name of the column.
row
Type: System.Int32
The zero-based data-row index (y).
value
Type: System.String
The value of the cell, or null if the column or cell does not exist.
Return Value
Type: Boolean
true if the column and cell exist; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetString Overload
Rhino.FileIO Namespace