RhinoCommon API
IntersectionEvent.CompareEquivalent Method (IntersectionEvent, IntersectionEvent, Double)
 Compare intersection events.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool CompareEquivalent(
	IntersectionEvent eventA,
	IntersectionEvent eventB,
	double relativePointTolerance
)
Public Shared Function CompareEquivalent (
	eventA As IntersectionEvent,
	eventB As IntersectionEvent,
	relativePointTolerance As Double
) As Boolean
Parameters
eventA
Type: Rhino.Geometry.Intersect.IntersectionEvent
The first intersection event to compare.
eventB
Type: Rhino.Geometry.Intersect.IntersectionEvent
The second intersection event to compare.
relativePointTolerance
Type: System.Double
The comparison tolerance. If RhinoMath.UnsetValue, then RhinoMath.SqrtEpsilon is used.
Return Value
Type: Boolean
true if the two inputs represent the same intersection, false otherwise.
See Also
Reference
IntersectionEvent Class
CompareEquivalent Overload
Rhino.Geometry.Intersect Namespace