RhinoCommon API
Hatch.Get2dCurves Method
 Gets 2d curves that define the boundaries of the hatch
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.18
Syntax
public Curve[] Get2dCurves(
	bool outer
)
Public Function Get2dCurves (
	outer As Boolean
) As Curve()
Parameters
outer
Type: System.Boolean
true to get the outer curves, false to get the inner curves
Return Value
Type: Curve[]
[Missing <returns> documentation for "M:Rhino.Geometry.Hatch.Get2dCurves(System.Boolean)"]
See Also
Reference
Hatch Class
Rhino.Geometry Namespace