RhinoCommon API
MeshVertexNormalList.GetEnumerator Method
 Gets an enumerator that yields all normals (vectors) in this collection.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IEnumerator<Vector3f> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Vector3f)
Return Value
Type: IEnumerator<Vector3f>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace