RhinoCommon API
DimStyleTable.GetUnusedStyleName Method
 Get a unique name for a style that does not already exist in the DimStyle table
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string GetUnusedStyleName()
Public Function GetUnusedStyleName As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.GetUnusedStyleName"]
See Also
Reference
DimStyleTable Class
GetUnusedStyleName Overload
Rhino.DocObjects.Tables Namespace