RhinoCommon API
RenderMeshes Constructor (RhinoDoc, Guid, Guid, UInt32, UInt32)
 Create a new render primitives collection.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RenderMeshes(
	RhinoDoc doc,
	Guid objectId,
	Guid renderMeshProviderId,
	uint runningHash,
	uint flags
)
Public Sub New (
	doc As RhinoDoc,
	objectId As Guid,
	renderMeshProviderId As Guid,
	runningHash As UInteger,
	flags As UInteger
)
Parameters
doc
Type: Rhino.RhinoDoc
The Rhino document with which this collection will be associated.
objectId
Type: System.Guid
The ObjectId that this collection is for.
renderMeshProviderId
Type: System.Guid
The RenderMeshProvider that created this collection - if this is the first in the stack, typically this will be ON_nil_uuid.
runningHash
Type: System.UInt32
The running hash of this collection - each RenderMeshProvider will update the hash with its own modification hash.
flags
Type: System.UInt32
The flags these render meshes were created with.
See Also
Reference
RenderMeshes Class
RenderMeshes Overload
Rhino.Render.CustomRenderMeshes Namespace