RhinoCommon API
PointCloud.Split Method
 Split a point cloud into two parts using a plane, or returns false if the pointcloud is not partitioned by plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Split(
	Plane plane,
	out PointCloud above,
	out PointCloud below
)
Public Function Split (
	plane As Plane,
	<OutAttribute> ByRef above As PointCloud,
	<OutAttribute> ByRef below As PointCloud
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
The splitting plane
above
Type: Rhino.Geometry.PointCloud
The part of the point cloud that is above the plane
below
Type: Rhino.Geometry.PointCloud
The part of the point cloud that is below the plane
Return Value
Type: Boolean
true on success, false if the plane does not partition the cloud, or on error.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace