RhinoCommon API
AngularDimension Constructor (Plane, Vector3d, Point3d, Point3d, Point3d, Point3d, Point3d)
 Constructs an angular dimension from parameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public AngularDimension(
	Plane plane,
	Vector3d horizontal,
	Point3d extpoint1,
	Point3d extpoint2,
	Point3d dirpoint1,
	Point3d dirpoint2,
	Point3d dimlinepoint
)
Public Sub New (
	plane As Plane,
	horizontal As Vector3d,
	extpoint1 As Point3d,
	extpoint2 As Point3d,
	dirpoint1 As Point3d,
	dirpoint2 As Point3d,
	dimlinepoint As Point3d
)
Parameters
plane
Type: Rhino.Geometry.Plane
The dimension's plane.
horizontal
Type: Rhino.Geometry.Vector3d
The horizontal direction.
extpoint1
Type: Rhino.Geometry.Point3d
Start of first extension line.
extpoint2
Type: Rhino.Geometry.Point3d
start of second extension line.
dirpoint1
Type: Rhino.Geometry.Point3d
point on first extension vector.
dirpoint2
Type: Rhino.Geometry.Point3d
Spoint on second extension vector.
dimlinepoint
Type: Rhino.Geometry.Point3d
point on dimension line.
See Also
Reference
AngularDimension Class
AngularDimension Overload
Rhino.Geometry Namespace