RhinoCommon API
RhinoList<T>.ToArray Method
 Constructs an array that contains all items in this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public T[] ToArray()
Public Function ToArray As T()
Return Value
Type: T[]
An array containing all items in this list.
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace