RhinoCommon API
SimpleArrayPlane Constructor
 Initializes a new SimpleArrayLine instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public SimpleArrayPlane()
Public Sub New
See Also
Reference
SimpleArrayPlane Class
Rhino.Runtime.InteropWrappers Namespace