RhinoCommon API
SurfaceCurvature.GetHashCode Method
 Returns a runtime-stable hash code for this object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A non-unique integer that represents this SurfaceCurvature.
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace