RhinoCommon API
NurbsSurface Constructor (Int32, Boolean, Int32, Int32, Int32, Int32)
 Constructs a new NURBS surface with knot and control point memory allocated.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public NurbsSurface(
	int dimension,
	bool isRational,
	int order0,
	int order1,
	int controlPointCount0,
	int controlPointCount1
)
Public Sub New (
	dimension As Integer,
	isRational As Boolean,
	order0 As Integer,
	order1 As Integer,
	controlPointCount0 As Integer,
	controlPointCount1 As Integer
)
Parameters
dimension
Type: System.Int32
The number of dimensions.
>= 1. This value is usually 3.
isRational
Type: System.Boolean
true to make a rational NURBS.
order0
Type: System.Int32
The order in U direction.
>= 2.
order1
Type: System.Int32
The order in V direction.
>= 2.
controlPointCount0
Type: System.Int32
Control point count in U direction.
>= order0.
controlPointCount1
Type: System.Int32
Control point count in V direction.
>= order1.
Remarks
If any argument is out of range, the surface is empty and not valid. Use Create(Int32, Boolean, Int32, Int32, Int32, Int32) to get null instead.
See Also
Reference
NurbsSurface Class
NurbsSurface Overload
Rhino.Geometry Namespace