RhinoCommon API
TextureEvaluator Constructor (RenderTexture.TextureEvaluatorFlags)
 Base class constructor
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected TextureEvaluator(
	RenderTexture.TextureEvaluatorFlags evaluatorFlags
)
Protected Sub New (
	evaluatorFlags As RenderTexture.TextureEvaluatorFlags
)
Parameters
evaluatorFlags
Type: Rhino.Render.RenderTexture.TextureEvaluatorFlags
[Missing <param name="evaluatorFlags"/> documentation for "M:Rhino.Render.TextureEvaluator.#ctor(Rhino.Render.RenderTexture.TextureEvaluatorFlags)"]
See Also
Reference
TextureEvaluator Class
TextureEvaluator Overload
Rhino.Render Namespace