RhinoCommon API
MeshFace.Repair Method
 Attempts to repair this mesh face by taking both face indexes and actual vertex locations into account.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Repair(
	Point3d[] points
)
Public Function Repair (
	points As Point3d()
) As Boolean
Parameters
points
Type: Rhino.Geometry.Point3d[]
Array of vertices with which to consider when repairing the face.
Return Value
Type: Boolean
true if the face was repaired, false if not.
Remarks
This function assumes the face is invalid and attempts to repair unconditionally. It is only worthwhile to call Repair on faces where IsValid returns false.
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace