RhinoCommon API
RenderPipeline.GetRenderWindow Method (ViewportInfo, Boolean, Rectangle)
 As GetRenderWindow(). The parameter withWireframeChannel controls whether the returned RenderWindow will have the channel added. The parameter fromRenderViewSource controls from where the RenderSize is queried. The viewportInfo instance will be used to set up wireframe channel. This is necessary for rendering different view than is currently active in the viewport
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.19
Syntax
public RenderWindow GetRenderWindow(
	ViewportInfo viewportInfo,
	bool fromRenderViewSource,
	Rectangle region
)
Public Function GetRenderWindow (
	viewportInfo As ViewportInfo,
	fromRenderViewSource As Boolean,
	region As Rectangle
) As RenderWindow
Parameters
viewportInfo
Type: Rhino.DocObjects.ViewportInfo
ViewportInfo used to generate the wireframe channel
fromRenderViewSource
Type: System.Boolean
true if the RenderWindow size needs to be set from RenderViewSource size. false will use the active view.
region
Type: System.Drawing.Rectangle
The region to render. Usually the same as the full render window but in the case of RenderWindow and RenderInWindow, it is the region the user selected in the viewport.
Return Value
Type: RenderWindow
RenderWindow if one exists, null otherwise (i.e. rendering has already completed).
See Also
Reference
RenderPipeline Class
GetRenderWindow Overload
Rhino.Render Namespace