RhinoCommon API
HostUtils.AutoInstallPlugInFolder Method
 Gets the auto install plug-in folder for machine or current user.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string AutoInstallPlugInFolder(
	bool currentUser
)
Public Shared Function AutoInstallPlugInFolder (
	currentUser As Boolean
) As String
Parameters
currentUser
Type: System.Boolean
true if the query relates to the current user.
Return Value
Type: String
The full path to the revelant auto install plug-in directory.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace