RhinoCommon API
Curve.TrimInterval Method (Double, Double)
 Trims the curve in-place by removing portions of the curve outside the specified interval.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.25
Syntax
public bool TrimInterval(
	double t0,
	double t1
)
Public Function TrimInterval (
	t0 As Double,
	t1 As Double
) As Boolean
Parameters
t0
Type: System.Double
Start of the trimming interval.
t1
Type: System.Double
End of the trimming interval.
Return Value
Type: Boolean
True if successful, false otherwise.
Remarks
 Portions of the curve before curve(domain[0]) and after curve(domain[1]) are removed.
See Also
Reference
Curve Class
TrimInterval Overload
Rhino.Geometry Namespace