RhinoCommon API
RhinoSettings.GetRenderSettings Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RhinoSettings.GetRenderSettings"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderSettings GetRenderSettings()
Public Function GetRenderSettings As RenderSettings
Return Value
Type: RenderSettings
[Missing <returns> documentation for "M:Rhino.Render.DataSources.RhinoSettings.GetRenderSettings"]
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace