RhinoCommon API
NotificationButtonClickedArgs Constructor
 Creates a new instance.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public NotificationButtonClickedArgs(
	Notification notification,
	ButtonType buttonClicked
)
Public Sub New (
	notification As Notification,
	buttonClicked As ButtonType
)
Parameters
notification
Type: Rhino.Runtime.Notifications.Notification
The notification whose button was clicked.
buttonClicked
Type: Rhino.Runtime.Notifications.ButtonType
The button that was clicked.
See Also
Reference
NotificationButtonClickedArgs Class
Rhino.Runtime.Notifications Namespace