RhinoCommon API
Squisher.SquishCurve Method
 Maps a curve on or near a previously squished 3d surface to the resulting 2d surface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public PolylineCurve SquishCurve(
	Curve curve
)
Public Function SquishCurve (
	curve As Curve
) As PolylineCurve
Parameters
curve
Type: Rhino.Geometry.Curve
The curve to squish
Return Value
Type: PolylineCurve
The squished curve
See Also
Reference
Squisher Class
Rhino.Geometry Namespace