RhinoCommon API
PythonScript.SetVariable Method
 Sets a variable with a name and an object. Object can be null (Nothing in Visual Basic).
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public abstract void SetVariable(
	string name,
	Object value
)
Public MustOverride Sub SetVariable (
	name As String,
	value As Object
)
Parameters
name
Type: System.String
A valid variable name in Python.
value
Type: System.Object
A valid value for that variable name.
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace