RhinoCommon API
File3dmRenderContent.XML Method
 Gets the render content's state as an XML string.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string XML(
	bool recursive
)
Public Function XML (
	recursive As Boolean
) As String
Parameters
recursive
Type: System.Boolean
[Missing <param name="recursive"/> documentation for "M:Rhino.FileIO.File3dmRenderContent.XML(System.Boolean)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmRenderContent.XML(System.Boolean)"]
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace