RhinoCommon API
File3dmDisplacement.SetSubItemMappingChannel Method
 Sets the override for displacement 'mapping channel'. face_index is the index of the face on the polysurface/SubD.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetSubItemMappingChannel(
	int face_index,
	int chan
)
Public Sub SetSubItemMappingChannel (
	face_index As Integer,
	chan As Integer
)
Parameters
face_index
Type: System.Int32
[Missing <param name="face_index"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.SetSubItemMappingChannel(System.Int32,System.Int32)"]
chan
Type: System.Int32
[Missing <param name="chan"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.SetSubItemMappingChannel(System.Int32,System.Int32)"]
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace