RhinoCommon API
ManifestTable.CopyTo Method
 Copies the content of this table to an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void CopyTo(
	ModelComponent[] array,
	int arrayIndex
)
Public Sub CopyTo (
	array As ModelComponent(),
	arrayIndex As Integer
)
Parameters
array
Type: Rhino.DocObjects.ModelComponent[]
The array to copy to.
arrayIndex
Type: System.Int32
The position in the array from which to start copying.
Implements
ICollection<T>.CopyTo(T[], Int32)
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace