RhinoCommon API
RenderPlugIn.CustomChannelName Method
 Return the localized name of your custom channel.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual string CustomChannelName(
	Guid id
)
Protected Overridable Function CustomChannelName (
	id As Guid
) As String
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.CustomChannelName(System.Guid)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.PlugIns.RenderPlugIn.CustomChannelName(System.Guid)"]
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace