RhinoCommon API
RenderWindow.SaveRenderImageAs Method (String, Guid, Boolean)
 Save current RenderWindow contents as an image file with the given name. The filetype will be determine. Pass in render engine Guid if an engine implements saving to a format that is not supported by Rhino. Guid.Empty if there is no need for that.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SaveRenderImageAs(
	string filename,
	Guid renderEngineGuid,
	bool saveAlpha
)
Public Sub SaveRenderImageAs (
	filename As String,
	renderEngineGuid As Guid,
	saveAlpha As Boolean
)
Parameters
filename
Type: System.String
Filename of image file to be created
renderEngineGuid
Type: System.Guid
render engine ID
saveAlpha
Type: System.Boolean
True if alpha channel should be saved.
See Also
Reference
RenderWindow Class
SaveRenderImageAs Overload
Rhino.Render Namespace