RhinoCommon API
LengthUnit.ToUnitSystem Method (Double)
 Returns a UnitSystem equivalent to this instance and its size expressed on meters.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UnitSystem ToUnitSystem(
	out double metersPerUnit
)
Public Function ToUnitSystem (
	<OutAttribute> ByRef metersPerUnit As Double
) As UnitSystem
Parameters
metersPerUnit
Type: System.Double
 Unit size expressed in meters.
Return Value
Type: UnitSystem
A UnitSystem value.
See Also
Reference
LengthUnit Structure
ToUnitSystem Overload
Rhino Namespace