RhinoCommon API
Material.ClearMaterialChannels Method
 Removes all material channels
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.26
Syntax
public void ClearMaterialChannels()
Public Sub ClearMaterialChannels
See Also
Reference
Material Class
Rhino.DocObjects Namespace