RhinoCommon API
GumballSettings.GetDefaultAlignment Method
 Gets the factory default value of AutoGumballAlignment.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static GumballAlignment GetDefaultAlignment()
Public Shared Function GetDefaultAlignment As GumballAlignment
Return Value
Type: GumballAlignment
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.GumballSettings.GetDefaultAlignment"]
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace