RhinoCommon API
File3dmObjectTable.AddTextDot Method (TextDot)
Adds a text dot object to the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddTextDot(
	TextDot dot
)
Public Function AddTextDot (
	dot As TextDot
) As Guid
Parameters
dot
Type: Rhino.Geometry.TextDot
The text dot.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddTextDot Overload
Rhino.FileIO Namespace