RhinoCommon API
RhinoApp.SendKeystrokes Method
Sends a string of printable characters, including spaces, to Rhino's command line.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static void SendKeystrokes(
	string characters,
	bool appendReturn
)
Public Shared Sub SendKeystrokes (
	characters As String,
	appendReturn As Boolean
)
Parameters
characters
Type: System.String
[in] A string to characters to send to the command line. This can be null.
appendReturn
Type: System.Boolean
[in] Append a return character to the end of the string.
See Also
Reference
RhinoApp Class
Rhino Namespace