RhinoCommon API
File3dmEmbeddedFile Constructor
Initializes a new instance of the File3dmEmbeddedFile class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmEmbeddedFile()
Public Sub New
See Also
Reference
File3dmEmbeddedFile Class
Rhino.FileIO Namespace