RhinoCommon API
Brep.TransformComponent Method
 Transform an array of Brep components, bend neighbors to match, and leave the rest fixed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TransformComponent(
	IEnumerable<ComponentIndex> components,
	Transform xform,
	double tolerance,
	double timeLimit,
	bool useMultipleThreads
)
Public Function TransformComponent (
	components As IEnumerable(Of ComponentIndex),
	xform As Transform,
	tolerance As Double,
	timeLimit As Double,
	useMultipleThreads As Boolean
) As Boolean
Parameters
components
Type: System.Collections.Generic.IEnumerable<ComponentIndex>
The Brep components to transform.
xform
Type: Rhino.Geometry.Transform
The transformation to apply.
tolerance
Type: System.Double
The desired fitting tolerance to use when bending faces that share edges with both fixed and transformed components.
timeLimit
Type: System.Double
 If the deformation is extreme, it can take a long time to calculate the result. If time_limit > 0, then the value specifies the maximum amount of time in seconds you want to spend before giving up.
useMultipleThreads
Type: System.Boolean
True if multiple threads can be used.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace