RhinoCommon API
Brep.VariationalPatchResult Constructor
Initializes a new instance of the Brep.VariationalPatchResult class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public VariationalPatchResult()
Public Sub New
See Also
Reference
Brep.VariationalPatchResult Class
Rhino.Geometry Namespace