RhinoCommon API
ViewportInfo.CalculateCameraRotationAngle Method
 Calculates the camera rotation angle.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public static double CalculateCameraRotationAngle(
	Vector3d direction,
	Vector3d up
)
Public Shared Function CalculateCameraRotationAngle (
	direction As Vector3d,
	up As Vector3d
) As Double
Parameters
direction
Type: Rhino.Geometry.Vector3d
The camera direction.
up
Type: Rhino.Geometry.Vector3d
The camera up direction.
Return Value
Type: Double
The camera rotation angle in radians.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace