RhinoCommon API
ParticleSystem.Update Method
 Calls Update on every particle in the system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual void Update()
Public Overridable Sub Update
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace