RhinoCommon API
SubDComponent.GetHashCode Method
 Gets a hash code for this component.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Geometry.SubDComponent.GetHashCode"]
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace