RhinoCommon API
Curve.CreateCatenaryCurveFromLength Method
 Generate a catenary curve of specific length.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Curve CreateCatenaryCurveFromLength(
	Point3d catenary_start,
	Point3d catenary_end,
	Vector3d axis_dir,
	double catenary_length,
	bool bSmooth,
	int point_count,
	out Point3d apex_out,
	out double parameter_out,
	out double length_out,
	out double max_deviation_out
)
Public Shared Function CreateCatenaryCurveFromLength (
	catenary_start As Point3d,
	catenary_end As Point3d,
	axis_dir As Vector3d,
	catenary_length As Double,
	bSmooth As Boolean,
	point_count As Integer,
	<OutAttribute> ByRef apex_out As Point3d,
	<OutAttribute> ByRef parameter_out As Double,
	<OutAttribute> ByRef length_out As Double,
	<OutAttribute> ByRef max_deviation_out As Double
) As Curve
Parameters
catenary_start
Type: Rhino.Geometry.Point3d
catenary start point
catenary_end
Type: Rhino.Geometry.Point3d
catenary end point
axis_dir
Type: Rhino.Geometry.Vector3d
catenary axis/gravity direction
catenary_length
Type: System.Double
the desired catenary length
bSmooth
Type: System.Boolean
if false generates polyline output
point_count
Type: System.Int32
number of points in the output curve
apex_out
Type: Rhino.Geometry.Point3d
apex point of the output catenary curve
parameter_out
Type: System.Double
output catenary parameter "a" in the formula y = a * cosh(x/a)
length_out
Type: System.Double
output catenary length
max_deviation_out
Type: System.Double
sampled max deviation between the output curve and the analytic catenary
Return Value
Type: Curve
A catenary Curve or null if unsuccessful
See Also
Reference
Curve Class
Rhino.Geometry Namespace