RhinoCommon API
FileUsdWriteOptions.ToDictionary Method
 Create a dictionary of these options. This dictionary can be passed to Export(String, ArchivableDictionary)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public ArchivableDictionary ToDictionary()
Public Function ToDictionary As ArchivableDictionary
Return Value
Type: ArchivableDictionary
A ArchivableDictionary with all the necessary key/value pairs
See Also
Reference
FileUsdWriteOptions Class
Rhino.FileIO Namespace