RhinoCommon API
SectionStyle.RemoveBoundaryLinetype Method
[Missing <summary> documentation for "M:Rhino.DocObjects.SectionStyle.RemoveBoundaryLinetype"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void RemoveBoundaryLinetype()
Public Sub RemoveBoundaryLinetype
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace