RhinoCommon API
RhinoDoc.InCommand Method
 This is a low level tool to determine if Rhino is currently running a command.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int InCommand(
	bool bIgnoreScriptRunnerCommands
)
Public Function InCommand (
	bIgnoreScriptRunnerCommands As Boolean
) As Integer
Parameters
bIgnoreScriptRunnerCommands
Type: System.Boolean
 If true, script running commands, like "ReadCommandFile" and the RhinoScript plug-ins "RunScript" command, are not counted.
Return Value
Type: Int32
Number of active commands.
See Also
Reference
RhinoDoc Class
Rhino Namespace