RhinoCommon API
IUserInterfaceSection.OnUserInterfaceSectionExpanding Method
 The UserInterfaceSection object that called this interface method.
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
void OnUserInterfaceSectionExpanding(
	UserInterfaceSection userInterfaceSection,
	bool expanding
)
Sub OnUserInterfaceSectionExpanding (
	userInterfaceSection As UserInterfaceSection,
	expanding As Boolean
)
Parameters
userInterfaceSection
Type: Rhino.Render.UI.UserInterfaceSection
 The UserInterfaceSection object that called this interface method.
expanding
Type: System.Boolean
 Will be true if the control has been createExpanded or false if it was collapsed.
See Also
Reference
IUserInterfaceSection Interface
Rhino.Render.UI Namespace