RhinoCommon API
AppearanceSettings.UsingDefaultLightModeColors Method
 Determine if Rhino is running with default light mode color settings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
public static bool UsingDefaultLightModeColors()
Public Shared Function UsingDefaultLightModeColors As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.AppearanceSettings.UsingDefaultLightModeColors"]
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace