RhinoCommon API
ColorRGBA.Inequality Operator
[Missing <summary> documentation for "M:Rhino.Display.ColorRGBA.op_Inequality(Rhino.Display.ColorRGBA,Rhino.Display.ColorRGBA)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool operator !=(
	ColorRGBA a,
	ColorRGBA b
)
Public Shared Operator <> (
	a As ColorRGBA,
	b As ColorRGBA
) As Boolean
Parameters
a
Type: Rhino.Display.ColorRGBA
[Missing <param name="a"/> documentation for "M:Rhino.Display.ColorRGBA.op_Inequality(Rhino.Display.ColorRGBA,Rhino.Display.ColorRGBA)"]
b
Type: Rhino.Display.ColorRGBA
[Missing <param name="b"/> documentation for "M:Rhino.Display.ColorRGBA.op_Inequality(Rhino.Display.ColorRGBA,Rhino.Display.ColorRGBA)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.ColorRGBA.op_Inequality(Rhino.Display.ColorRGBA,Rhino.Display.ColorRGBA)"]
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace