RhinoCommon API
RhinoList<T> Constructor (RhinoList<T>)
 Initializes an new list by shallow duplicating another list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoList(
	RhinoList<T> list
)
Public Sub New (
	list As RhinoList(Of T)
)
Parameters
list
Type: Rhino.Collections.RhinoList<T>
List to mimic.
See Also
Reference
RhinoList<T> Class
RhinoList<T> Overload
Rhino.Collections Namespace