RhinoCommon API
PostEffectChannel.CPU Method
 Return an interface to this channel for doing channel operations on the CPU.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RenderWindow.Channel CPU()
Public Function CPU As RenderWindow.Channel
Return Value
Type: RenderWindow.Channel
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectChannel.CPU"]
See Also
Reference
PostEffectChannel Class
Rhino.Render.PostEffects Namespace