RhinoCommon API
SubDToBrepOptions Constructor (Boolean, SubDToBrepOptions.ExtraordinaryVertexProcessOption)
 Create options from the given packFaces and vertexProcess values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public SubDToBrepOptions(
	bool packFaces,
	SubDToBrepOptions.ExtraordinaryVertexProcessOption vertexProcess
)
Public Sub New (
	packFaces As Boolean,
	vertexProcess As SubDToBrepOptions.ExtraordinaryVertexProcessOption
)
Parameters
packFaces
Type: System.Boolean
Sets the pack faces options.
vertexProcess
Type: Rhino.Geometry.SubDToBrepOptions.ExtraordinaryVertexProcessOption
Sets the extraordinary vertex process option.
See Also
Reference
SubDToBrepOptions Class
SubDToBrepOptions Overload
Rhino.Geometry Namespace