RhinoCommon API
GetCylinder.GetMesh Method (Int32, Int32, Int32, Cylinder)
 Prompt for the getting of a mesh cylinder.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Result GetMesh(
	ref int verticalFaces,
	ref int aroundFaces,
	ref int capStyle,
	out Cylinder cylinder
)
Public Function GetMesh (
	ByRef verticalFaces As Integer,
	ByRef aroundFaces As Integer,
	ByRef capStyle As Integer,
	<OutAttribute> ByRef cylinder As Cylinder
) As Result
Parameters
verticalFaces
Type: System.Int32
The number of faces in the vertical direction.
aroundFaces
Type: System.Int32
The number of faces in the around direction
capStyle
Type: System.Int32
Set to 0 if you don't want the prompt, 3 is triangles, 4 is quads.
cylinder
Type: Rhino.Geometry.Cylinder
The cylinder geometry defined by the user.
Return Value
Type: Result
The result of the getting operation.
Remarks
The prompt for capStyle will only be seen if it's not zero, aroundFaces is even and the solid option is on.
See Also
Reference
GetCylinder Class
GetMesh Overload
Rhino.Input.Custom Namespace