RhinoCommon API
RenderContent.AddChild Method (RenderContent, String)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.AddChild(Rhino.Render.RenderContent,System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("This method is obsolete and simply calls SetChild")]
public bool AddChild(
	RenderContent renderContent,
	string childSlotName
)
<ObsoleteAttribute("This method is obsolete and simply calls SetChild")>
Public Function AddChild (
	renderContent As RenderContent,
	childSlotName As String
) As Boolean
Parameters
renderContent
Type: Rhino.Render.RenderContent
[Missing <param name="renderContent"/> documentation for "M:Rhino.Render.RenderContent.AddChild(Rhino.Render.RenderContent,System.String)"]
childSlotName
Type: System.String
[Missing <param name="childSlotName"/> documentation for "M:Rhino.Render.RenderContent.AddChild(Rhino.Render.RenderContent,System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.AddChild(Rhino.Render.RenderContent,System.String)"]
See Also
Reference
RenderContent Class
AddChild Overload
Rhino.Render Namespace