RhinoCommon API
File3dm.Polish Method
Note: This API is now obsolete.
 This function is only kept for forward assembly compatibility.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Polish and Audit functionality no longer exist.")]
public void Polish()
<ObsoleteAttribute("Polish and Audit functionality no longer exist.")>
Public Sub Polish
See Also
Reference
File3dm Class
Rhino.FileIO Namespace