RhinoCommon API
RhinoDoc.ClearUndoRecords Method (Boolean)
[Missing <summary> documentation for "M:Rhino.RhinoDoc.ClearUndoRecords(System.Boolean)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void ClearUndoRecords(
	bool purgeDeletedObjects
)
Public Sub ClearUndoRecords (
	purgeDeletedObjects As Boolean
)
Parameters
purgeDeletedObjects
Type: System.Boolean
[Missing <param name="purgeDeletedObjects"/> documentation for "M:Rhino.RhinoDoc.ClearUndoRecords(System.Boolean)"]
See Also
Reference
RhinoDoc Class
ClearUndoRecords Overload
Rhino Namespace