RhinoCommon API
AppearanceSettings.SetToLightMode Method
Set UI to the default light mode color scheme
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
public static bool SetToLightMode()
Public Shared Function SetToLightMode As Boolean
Return Value
Type: Boolean
true on sucess
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace