RhinoCommon API
FileCsvDocument.Clear Method
 Removes all rows from the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace