RhinoCommon API
TextLog.ResetString Method
 If the TextLog was constructed using the empty constructor, then the text information is stored in a runtime string. This function resets the data held by the string, but retains the strings allocated memory to allow for quicker logging because the stored string doesn't constantly need to reallocate.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void ResetString()
Public Sub ResetString
See Also
Reference
TextLog Class
Rhino.FileIO Namespace