RhinoCommon API
OrdinateDimension Constructor (Plane, OrdinateDimension.MeasuredDirection, Point3d, Point3d, Point3d, Double, Double)
 Constructs an ordinate dimension from parameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public OrdinateDimension(
	Plane plane,
	OrdinateDimension.MeasuredDirection direction,
	Point3d basepoint,
	Point3d defpoint,
	Point3d leaderpoint,
	double kinkoffset1,
	double kinkoffset2
)
Public Sub New (
	plane As Plane,
	direction As OrdinateDimension.MeasuredDirection,
	basepoint As Point3d,
	defpoint As Point3d,
	leaderpoint As Point3d,
	kinkoffset1 As Double,
	kinkoffset2 As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
Dimension's plane
direction
Type: Rhino.Geometry.OrdinateDimension.MeasuredDirection
MeasuredDirection.XAxis or MeasuredDirection.YAxis
basepoint
Type: Rhino.Geometry.Point3d
Dimension's base point
defpoint
Type: Rhino.Geometry.Point3d
Dimension's definition point
leaderpoint
Type: Rhino.Geometry.Point3d
Point at tail of leader
kinkoffset1
Type: System.Double
Distance to first jog
kinkoffset2
Type: System.Double
Distance to second jog
See Also
Reference
OrdinateDimension Class
OrdinateDimension Overload
Rhino.Geometry Namespace