RhinoCommon API
ObjectAttributes.HasActiveInViewportOverride Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.HasActiveInViewportOverride(System.Guid,System.Boolean@)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool HasActiveInViewportOverride(
	Guid viewportId,
	out bool active
)
Public Function HasActiveInViewportOverride (
	viewportId As Guid,
	<OutAttribute> ByRef active As Boolean
) As Boolean
Parameters
viewportId
Type: System.Guid
[Missing <param name="viewportId"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.HasActiveInViewportOverride(System.Guid,System.Boolean@)"]
active
Type: System.Boolean
[Missing <param name="active"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.HasActiveInViewportOverride(System.Guid,System.Boolean@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.HasActiveInViewportOverride(System.Guid,System.Boolean@)"]
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace