RhinoCommon API
RenderWindow.ChannelGPU.Id Method
 Return the channel id.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Guid Id()
Public Function Id As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.Id"]
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace