RhinoCommon API
RhinoApp.RefreshRhinoLicense Method
 Refresh the license used by Rhino. This allows any part of Rhino to ensure that the most current version of the license file on disk is in use.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool RefreshRhinoLicense()
Public Shared Function RefreshRhinoLicense As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoApp.RefreshRhinoLicense"]
See Also
Reference
RhinoApp Class
Rhino Namespace