RhinoCommon API
ColorRGBA.CreateFromArgb Method (Byte, Byte, Byte)
 Constructs a RGBA color from the specified 8-bit components (red, green, and blue) values. The alpha value is implicitly 1.0 (fully opaque).
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static ColorRGBA CreateFromArgb(
	byte red,
	byte green,
	byte blue
)
Public Shared Function CreateFromArgb (
	red As Byte,
	green As Byte,
	blue As Byte
) As ColorRGBA
Parameters
red
Type: System.Byte
The red component. Valid values are 0 through 255.
green
Type: System.Byte
The green component. Valid values are 0 through 255.
blue
Type: System.Byte
The blue component. Valid values are 0 through 255.
Return Value
Type: ColorRGBA
A RGBA color with the specified component values.
See Also
Reference
ColorRGBA Structure
CreateFromArgb Overload
Rhino.Display Namespace