RhinoCommon API
BrepFace.GetMesh Method
 Obtains a reference to a specified type of mesh for this brep face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Mesh GetMesh(
	MeshType meshType
)
Public Function GetMesh (
	meshType As MeshType
) As Mesh
Parameters
meshType
Type: Rhino.Geometry.MeshType
The mesh type.
Return Value
Type: Mesh
A mesh.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace