RhinoCommon API
ObjRef Constructor (Guid, ComponentIndex)
Note: This API is now obsolete.
 Initializes a new object reference from a guid and component index. The component index is used to specify a "piece" of the geometry
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[ObsoleteAttribute("Use version that takes a document.")]
public ObjRef(
	Guid id,
	ComponentIndex ci
)
<ObsoleteAttribute("Use version that takes a document.")>
Public Sub New (
	id As Guid,
	ci As ComponentIndex
)
Parameters
id
Type: System.Guid
The object's Id
ci
Type: Rhino.Geometry.ComponentIndex
a portion of the object
See Also
Reference
ObjRef Class
ObjRef Overload
Rhino.DocObjects Namespace