RhinoCommon API
ColorGradient.GetColorStops Method
 Get sorted list of colors / positions that a gradient is defined over
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public ColorStop[] GetColorStops()
Public Function GetColorStops As ColorStop()
Return Value
Type: ColorStop[]
[Missing <returns> documentation for "M:Rhino.Display.ColorGradient.GetColorStops"]
See Also
Reference
ColorGradient Class
Rhino.Display Namespace