RhinoCommon API
MeshUnwrapper Constructor (IEnumerable<Mesh>)
 Creates a mesh unwrapper for a set of meshes
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public MeshUnwrapper(
	IEnumerable<Mesh> meshes
)
Public Sub New (
	meshes As IEnumerable(Of Mesh)
)
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
Meshes to unwrap
See Also
Reference
MeshUnwrapper Class
MeshUnwrapper Overload
Rhino.Geometry Namespace