RhinoCommon API
PersistentSettings.TryGetDefault Method (String, Size)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Drawing.Size@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TryGetDefault(
	string key,
	out Size value
)
Public Function TryGetDefault (
	key As String,
	<OutAttribute> ByRef value As Size
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Drawing.Size@)"]
value
Type: System.Drawing.Size
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Drawing.Size@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,System.Drawing.Size@)"]
See Also
Reference
PersistentSettings Class
TryGetDefault Overload
Rhino Namespace