RhinoCommon API
RebuildCurveOptions.KinkSplittingToInt Method
[Missing <summary> documentation for "M:Rhino.Geometry.RebuildCurveOptions.KinkSplittingToInt(Rhino.Geometry.RebuildCurveKinkSplitting)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int KinkSplittingToInt(
	RebuildCurveKinkSplitting kink_splitting
)
Public Function KinkSplittingToInt (
	kink_splitting As RebuildCurveKinkSplitting
) As Integer
Parameters
kink_splitting
Type: Rhino.Geometry.RebuildCurveKinkSplitting
[Missing <param name="kink_splitting"/> documentation for "M:Rhino.Geometry.RebuildCurveOptions.KinkSplittingToInt(Rhino.Geometry.RebuildCurveKinkSplitting)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Geometry.RebuildCurveOptions.KinkSplittingToInt(Rhino.Geometry.RebuildCurveKinkSplitting)"]
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace