RhinoCommon API
PlugIn.SavePluginSettings Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.SavePluginSettings(System.Guid)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void SavePluginSettings(
	Guid plugInId
)
Public Shared Sub SavePluginSettings (
	plugInId As Guid
)
Parameters
plugInId
Type: System.Guid
[Missing <param name="plugInId"/> documentation for "M:Rhino.PlugIns.PlugIn.SavePluginSettings(System.Guid)"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace