RhinoCommon API
Transform.GetQuaternion Method
 If this transform is a proper rotation, then find the equivalent quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public bool GetQuaternion(
	out Quaternion quaternion
)
Public Function GetQuaternion (
	<OutAttribute> ByRef quaternion As Quaternion
) As Boolean
Parameters
quaternion
Type: Rhino.Geometry.Quaternion
Quaternion that represents this rotation transformation.
Return Value
Type: Boolean
true if this transform is a proper rotation, false otherwise.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace