RhinoCommon API
Curve Constructor
 Protected serialization constructor for internal use.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Curve(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
Serialization data.
context
Type: System.Runtime.Serialization.StreamingContext
Serialization stream.
See Also
Reference
Curve Class
Rhino.Geometry Namespace