RhinoCommon API
FileUdoWriteOptions Constructor
Initializes a new instance of the FileUdoWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileUdoWriteOptions()
Public Sub New
See Also
Reference
FileUdoWriteOptions Class
Rhino.FileIO Namespace