RhinoCommon API
RhinoViewport.PreviousViewProjection Method
 Sets the view projection and target to the settings that were active before the last call to NextViewProjection.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool PreviousViewProjection()
Public Function PreviousViewProjection As Boolean
Return Value
Type: Boolean
true if the view stack was popped.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace