RhinoCommon API
Intersection.MeshMeshFast Method
 Fast intersection of two meshes, returned as loose line segments rather than assembled polylines.
Vertices are read in double precision when the mesh has them. Faces that cross or touch within tolerance produce segments; coplanar overlaps are ignored. Use MeshMesh(IEnumerable<Mesh>, Double, Polyline[], Boolean, Polyline[], Boolean, Mesh, TextLog, CancellationToken, IProgress<Double>) when overlaps or joined curves are needed, and MeshMeshPredicate(IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Boolean, TextLog, CancellationToken) when only the yes/no answer is needed.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Line[] MeshMeshFast(
	Mesh meshA,
	Mesh meshB
)
Public Shared Function MeshMeshFast (
	meshA As Mesh,
	meshB As Mesh
) As Line()
Parameters
meshA
Type: Rhino.Geometry.Mesh
First mesh for intersection.
meshB
Type: Rhino.Geometry.Mesh
Second mesh for intersection.
Return Value
Type: Line[]
An array of intersection line segments, empty if no intersections were found.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace