RhinoCommon API
IZooClientUtilities.DeleteLicense Method
 31-Mar-2015 Dale Fugier, http://mcneel.myjetbrains.com/youtrack/issue/MR-1725 Deletes a license along with its license file.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool DeleteLicense(
	Object verify,
	Guid productId
)
Function DeleteLicense (
	verify As Object,
	productId As Guid
) As Boolean
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.DeleteLicense(System.Object,System.Guid)"]
productId
Type: System.Guid
[Missing <param name="productId"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.DeleteLicense(System.Object,System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.DeleteLicense(System.Object,System.Guid)"]
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace