RhinoCommon API
FilePdf.DrawBitmap Method
 Draw a bitmap
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public abstract void DrawBitmap(
	int pageNumber,
	Bitmap bitmap,
	float left,
	float top,
	float width,
	float height,
	float rotationInDegrees
)
Public MustOverride Sub DrawBitmap (
	pageNumber As Integer,
	bitmap As Bitmap,
	left As Single,
	top As Single,
	width As Single,
	height As Single,
	rotationInDegrees As Single
)
Parameters
pageNumber
Type: System.Int32
[Missing <param name="pageNumber"/> documentation for "M:Rhino.FileIO.FilePdf.DrawBitmap(System.Int32,System.Drawing.Bitmap,System.Single,System.Single,System.Single,System.Single,System.Single)"]
bitmap
Type: System.Drawing.Bitmap
[Missing <param name="bitmap"/> documentation for "M:Rhino.FileIO.FilePdf.DrawBitmap(System.Int32,System.Drawing.Bitmap,System.Single,System.Single,System.Single,System.Single,System.Single)"]
left
Type: System.Single
[Missing <param name="left"/> documentation for "M:Rhino.FileIO.FilePdf.DrawBitmap(System.Int32,System.Drawing.Bitmap,System.Single,System.Single,System.Single,System.Single,System.Single)"]
top
Type: System.Single
[Missing <param name="top"/> documentation for "M:Rhino.FileIO.FilePdf.DrawBitmap(System.Int32,System.Drawing.Bitmap,System.Single,System.Single,System.Single,System.Single,System.Single)"]
width
Type: System.Single
[Missing <param name="width"/> documentation for "M:Rhino.FileIO.FilePdf.DrawBitmap(System.Int32,System.Drawing.Bitmap,System.Single,System.Single,System.Single,System.Single,System.Single)"]
height
Type: System.Single
[Missing <param name="height"/> documentation for "M:Rhino.FileIO.FilePdf.DrawBitmap(System.Int32,System.Drawing.Bitmap,System.Single,System.Single,System.Single,System.Single,System.Single)"]
rotationInDegrees
Type: System.Single
[Missing <param name="rotationInDegrees"/> documentation for "M:Rhino.FileIO.FilePdf.DrawBitmap(System.Int32,System.Drawing.Bitmap,System.Single,System.Single,System.Single,System.Single,System.Single)"]
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace