RhinoCommon API
RenderContentSerializer.ReportDeferredContentAndFile Method
 This is called from your implementation of LoadMultiple() to add a 'deferred' content and the file it will be loaded from when the LoadMultipleFlags.Preload flag is set. See LoadMultiple() for an explanation of this method's use. \param c is the deferred content. \param wszFullPath is the full path to the file that 'c' will be loaded from. \param flags is reserved for future use; you should pass zero. \param pReserved is reserved for future use; you should pass nullptr. */
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public virtual void ReportDeferredContentAndFile(
	RenderContent renderContent,
	string pathToFile,
	int flags
)
Public Overridable Sub ReportDeferredContentAndFile (
	renderContent As RenderContent,
	pathToFile As String,
	flags As Integer
)
Parameters
renderContent
Type: Rhino.Render.RenderContent
 Deferred render content - represents all contents that will be loaded from the file.
pathToFile
Type: System.String
 Full path of the file that render contents will be loaded from.
flags
Type: System.Int32
 Flags for future use; should be passed as zero.
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace