RhinoCommon API
ArchivableDictionary.GetEnumerator Method
 Gets the enumerator of this dictionary.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IEnumerator<KeyValuePair<string, Object>> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of KeyValuePair(Of String, Object))
Return Value
Type: IEnumerator<KeyValuePair<String, Object>>
A IEnumerator<T>, where T is an instance of KeyValuePair<TKey, TValue>, with T0 set as string, and T1 as System.Object.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace