RhinoCommon API
Linetype.RemoveTaper Method
 Remove taper information for stroke
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void RemoveTaper()
Public Sub RemoveTaper
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace