RhinoCommon API
SceneServerData Constructor (PreviewGeometry, PreviewBackground, PreviewLighting, SceneServerDataUsage)
Note: This API is now obsolete.
 Constructor for SceneServerData
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Do not use - will cause bugs")]
public SceneServerData(
	PreviewGeometry geo,
	PreviewBackground back,
	PreviewLighting light,
	SceneServerDataUsage usage
)
<ObsoleteAttribute("Do not use - will cause bugs")>
Public Sub New (
	geo As PreviewGeometry,
	back As PreviewBackground,
	light As PreviewLighting,
	usage As SceneServerDataUsage
)
Parameters
geo
Type: Rhino.Render.PreviewGeometry
[Missing <param name="geo"/> documentation for "M:Rhino.Render.SceneServerData.#ctor(Rhino.Render.PreviewGeometry,Rhino.Render.PreviewBackground,Rhino.Render.PreviewLighting,Rhino.Render.SceneServerDataUsage)"]
back
Type: Rhino.Render.PreviewBackground
[Missing <param name="back"/> documentation for "M:Rhino.Render.SceneServerData.#ctor(Rhino.Render.PreviewGeometry,Rhino.Render.PreviewBackground,Rhino.Render.PreviewLighting,Rhino.Render.SceneServerDataUsage)"]
light
Type: Rhino.Render.PreviewLighting
[Missing <param name="light"/> documentation for "M:Rhino.Render.SceneServerData.#ctor(Rhino.Render.PreviewGeometry,Rhino.Render.PreviewBackground,Rhino.Render.PreviewLighting,Rhino.Render.SceneServerDataUsage)"]
usage
Type: Rhino.Render.SceneServerDataUsage
[Missing <param name="usage"/> documentation for "M:Rhino.Render.SceneServerData.#ctor(Rhino.Render.PreviewGeometry,Rhino.Render.PreviewBackground,Rhino.Render.PreviewLighting,Rhino.Render.SceneServerDataUsage)"]
See Also
Reference
SceneServerData Class
SceneServerData Overload
Rhino.Render Namespace