RhinoCommon API
LicenseUtils.GetLicenseCapabilities Method
 Converts an integer to a LicenseCapabilities flag
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.5
Syntax
public static LicenseCapabilities GetLicenseCapabilities(
	int filter
)
Public Shared Function GetLicenseCapabilities (
	filter As Integer
) As LicenseCapabilities
Parameters
filter
Type: System.Int32
[Missing <param name="filter"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicenseCapabilities(System.Int32)"]
Return Value
Type: LicenseCapabilities
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicenseCapabilities(System.Int32)"]
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace