RhinoCommon API
ColorHSV.CreateFromRGBA Method
 Create the nearest HSV equivalent of a RGBA color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static ColorHSV CreateFromRGBA(
	ColorRGBA rgba
)
Public Shared Function CreateFromRGBA (
	rgba As ColorRGBA
) As ColorHSV
Parameters
rgba
Type: Rhino.Display.ColorRGBA
Target color in RGBA space.
Return Value
Type: ColorHSV
The HSV equivalent of the RGBA color.
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace