RhinoCommon API
Curve.SpanDomain Method
 Get the domain of the curve span with the given index. Use the SpanCount property to test how many spans there are.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Interval SpanDomain(
	int spanIndex
)
Public Function SpanDomain (
	spanIndex As Integer
) As Interval
Parameters
spanIndex
Type: System.Int32
Index of span.
Return Value
Type: Interval
Interval of the span with the given index.
See Also
Reference
Curve Class
Rhino.Geometry Namespace