RhinoCommon API
TextFields.InstanceAttributeField Constructor
 Block attribute definition.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public InstanceAttributeField(
	string key,
	string prompt,
	string defaultValue
)
Public Sub New (
	key As String,
	prompt As String,
	defaultValue As String
)
Parameters
key
Type: System.String
 Attribute key
prompt
Type: System.String
 Prompt displayed by the UI when inserting a block
defaultValue
Type: System.String
 Default value used when inserting a block
See Also
Reference
TextFields.InstanceAttributeField Class
Rhino.Runtime Namespace