RhinoCommon API
FileCsvDocument.TryGetDateTime Method (String, Int32, DateTime)
 Retrieves the value of a cell as a date and time, addressing the column by header name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TryGetDateTime(
	string column,
	int row,
	out DateTime value
)
Public Function TryGetDateTime (
	column As String,
	row As Integer,
	<OutAttribute> ByRef value As DateTime
) As Boolean
Parameters
column
Type: System.String
The header name of the column.
row
Type: System.Int32
The zero-based data-row index (y).
value
Type: System.DateTime
The parsed value, or MinValue if the column or cell does not exist or cannot be parsed.
Return Value
Type: Boolean
true if the column and cell exist and were parsed; otherwise false.
See Also
Reference
FileCsvDocument Class
TryGetDateTime Overload
Rhino.FileIO Namespace