RhinoCommon API
RenderPipeline.AddRenderMeshToScene Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.AddRenderMeshToScene(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.Material,Rhino.Geometry.Mesh)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool AddRenderMeshToScene(
	RhinoObject obj,
	Material material,
	Mesh mesh
)
Protected Overridable Function AddRenderMeshToScene (
	obj As RhinoObject,
	material As Material,
	mesh As Mesh
) As Boolean
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="obj"/> documentation for "M:Rhino.Render.RenderPipeline.AddRenderMeshToScene(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.Material,Rhino.Geometry.Mesh)"]
material
Type: Rhino.DocObjects.Material
[Missing <param name="material"/> documentation for "M:Rhino.Render.RenderPipeline.AddRenderMeshToScene(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.Material,Rhino.Geometry.Mesh)"]
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.Render.RenderPipeline.AddRenderMeshToScene(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.Material,Rhino.Geometry.Mesh)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.AddRenderMeshToScene(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.Material,Rhino.Geometry.Mesh)"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace