RhinoCommon API
InstanceDefinitionTable.Modify Method (InstanceDefinition, String, String, String, String, Boolean)
 Modifies the instance definition name, description, and url. Does not change instance definition ID or geometry.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.16
Syntax
public bool Modify(
	InstanceDefinition idef,
	string newName,
	string newDescription,
	string newUrl,
	string newUrlTag,
	bool quiet
)
Public Function Modify (
	idef As InstanceDefinition,
	newName As String,
	newDescription As String,
	newUrl As String,
	newUrlTag As String,
	quiet As Boolean
) As Boolean
Parameters
idef
Type: Rhino.DocObjects.InstanceDefinition
The instance definition to be modified.
newName
Type: System.String
The new name.
newDescription
Type: System.String
The new description string.
newUrl
Type: System.String
The new URL or hyperlink.
newUrlTag
Type: System.String
The new description of the URL or hyperlink.
quiet
Type: System.Boolean
 If false, information message boxes pop up when illegal changes are attempted.
Return Value
Type: Boolean
 true if successful.
See Also
Reference
InstanceDefinitionTable Class
Modify Overload
Rhino.DocObjects.Tables Namespace