RhinoCommon API
Light.CreateSunLight Method (Double, DateTime, Double, Double)
 Constructs a light which simulates the Sun based on a given time and location on Earth.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Light CreateSunLight(
	double northAngleDegrees,
	DateTime when,
	double latitudeDegrees,
	double longitudeDegrees
)
Public Shared Function CreateSunLight (
	northAngleDegrees As Double,
	when As DateTime,
	latitudeDegrees As Double,
	longitudeDegrees As Double
) As Light
Parameters
northAngleDegrees
Type: System.Double
The angle of North in degrees. North is the angle between positive World X axis and model North, as measured on World XY plane.
when
Type: System.DateTime
The time of the measurement. The Kind property of DateTime specifies whether this is in local or universal time.
Local and Undefined date-time kinds in this argument are considered local.
latitudeDegrees
Type: System.Double
The latitude, in degrees, of the location on Earth.
longitudeDegrees
Type: System.Double
The longitude, in degrees, of the location on Earth.
Return Value
Type: Light
A newly constructed light object.
Exceptions
Exception | Condition
RdkNotLoadedException | If the RDK is not loaded.
See Also
Reference
Light Class
CreateSunLight Overload
Rhino.Geometry Namespace