RhinoCommon API
ViewTable.GetViewList Method (Boolean, Boolean)
Note: This API is now obsolete.
Gets an array of all the views.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute]
public RhinoView[] GetViewList(
	bool includeStandardViews,
	bool includePageViews
)
<ObsoleteAttribute>
Public Function GetViewList (
	includeStandardViews As Boolean,
	includePageViews As Boolean
) As RhinoView()
Parameters
includeStandardViews
Type: System.Boolean
true if "Right", "Perspective", etc., view should be included; false otherwise.
includePageViews
Type: System.Boolean
true if page-related views should be included; false otherwise.
Return Value
Type: RhinoView[]
A array of Rhino views. This array can be empty, but not null.
See Also
Reference
ViewTable Class
GetViewList Overload
Rhino.DocObjects.Tables Namespace