RhinoCommon API
ArchivableDictionary.Set Method (String, ArchivableDictionary)
 Sets another ArchivableDictionary as entry in this dictionary.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Set(
	string key,
	ArchivableDictionary val
)
Public Function Set (
	key As String,
	val As ArchivableDictionary
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: Rhino.Collections.ArchivableDictionary
An object for that key.
Because this class is a reference type and is mutable, changes to this object will propagate to the object inside the dictionary.
It is up to the user to clone this entry when appropriate.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Collections.ArchivableDictionary)"]
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace