RhinoCommon API
SnapShotsClient.Category Method
 The category of this client. Usually one of the above predefined categories like e.g object, rendering or application category
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract string Category()
Public MustOverride Function Category As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.Category"]
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace