RhinoCommon API
PersistentSettings.TryGetByte Method (String, Byte, IEnumerable<String>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetByte(System.String,System.Byte@,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TryGetByte(
	string key,
	out byte value,
	IEnumerable<string> legacyKeyList
)
Public Function TryGetByte (
	key As String,
	<OutAttribute> ByRef value As Byte,
	legacyKeyList As IEnumerable(Of String)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetByte(System.String,System.Byte@,System.Collections.Generic.IEnumerable{System.String})"]
value
Type: System.Byte
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetByte(System.String,System.Byte@,System.Collections.Generic.IEnumerable{System.String})"]
legacyKeyList
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="legacyKeyList"/> documentation for "M:Rhino.PersistentSettings.TryGetByte(System.String,System.Byte@,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetByte(System.String,System.Byte@,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
PersistentSettings Class
TryGetByte Overload
Rhino Namespace