RhinoCommon API
PolyCurve.DuplicatePolyCurve Method
 Duplicates this polycurve.
This is the same as Duplicate().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PolyCurve DuplicatePolyCurve()
Public Function DuplicatePolyCurve As PolyCurve
Return Value
Type: PolyCurve
An exact duplicate of this curve.
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace