RhinoCommon API
RenderContent.AddPersistentRenderContent Method (RenderContent)
Note: This API is now obsolete.
 Add a material, environment or texture to the internal RDK document lists as top level content. The content must have been returned from RenderContent::MakeCopy, NewContentFromType or a similar function that returns a non-document content. Obsolete - use RhinoDoc.RenderMaterials.Add or similar.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
[ObsoleteAttribute("Use RhinoDoc.RenderMaterials.Add")]
public static bool AddPersistentRenderContent(
	RenderContent renderContent
)
<ObsoleteAttribute("Use RhinoDoc.RenderMaterials.Add")>
Public Shared Function AddPersistentRenderContent (
	renderContent As RenderContent
) As Boolean
Parameters
renderContent
Type: Rhino.Render.RenderContent
The render content.
Return Value
Type: Boolean
true on success.
See Also
Reference
RenderContent Class
AddPersistentRenderContent Overload
Rhino.Render Namespace