RhinoCommon API
PlugIn.GetLicense Method (LicenseBuildType, ValidateProductKeyDelegate, OnLeaseChangedDelegate)
 Verifies that there is a valid product license for your plug-in, using the Rhino licensing system. If the plug-in is installed as a standalone node, the locally installed license will be validated. If the plug-in is installed as a network node, a loaner license will be requested by the system's assigned Zoo server. If the Zoo server finds and returns a license, then this license will be validated. If no license is found, then the user will be prompted to provide a license key, which will be validated.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected bool GetLicense(
	LicenseBuildType productBuildType,
	ValidateProductKeyDelegate validateProductKeyDelegate,
	OnLeaseChangedDelegate leaseChangedDelegate
)
Protected Function GetLicense (
	productBuildType As LicenseBuildType,
	validateProductKeyDelegate As ValidateProductKeyDelegate,
	leaseChangedDelegate As OnLeaseChangedDelegate
) As Boolean
Parameters
productBuildType
Type: Rhino.PlugIns.LicenseBuildType
 The product build contentType required by your plug-in.
validateProductKeyDelegate
Type: Rhino.PlugIns.ValidateProductKeyDelegate
 Since the Rhino licensing system knows nothing about your product license, you will need to validate the product license provided by the Rhino licensing system. This is done by supplying a callback function, or delegate, that can be called to perform the validation.
leaseChangedDelegate
Type: Rhino.PlugIns.OnLeaseChangedDelegate
 Called by the ZooClient when the cloud zoo lease is changed.
Return Value
Type: Boolean
 true if a valid license was found. false otherwise.
See Also
Reference
PlugIn Class
GetLicense Overload
Rhino.PlugIns Namespace