RhinoCommon API
RenderWindow.Create Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.Create(System.Drawing.Size)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RenderWindow Create(
	Size szSize
)
Public Shared Function Create (
	szSize As Size
) As RenderWindow
Parameters
szSize
Type: System.Drawing.Size
[Missing <param name="szSize"/> documentation for "M:Rhino.Render.RenderWindow.Create(System.Drawing.Size)"]
Return Value
Type: RenderWindow
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.Create(System.Drawing.Size)"]
See Also
Reference
RenderWindow Class
Rhino.Render Namespace