RhinoCommon API
SupportOptions.UsePreview Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.UsePreview"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool UsePreview()
Public Shared Function UsePreview As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.UsePreview"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace