RhinoCommon API
PointCloud.CreateSectionCurve Method (Plane, Double)
 Creates planar curves by intersecting a plane with a point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Curve[] CreateSectionCurve(
	Plane plane,
	double absoluteTolerance
)
Public Function CreateSectionCurve (
	plane As Plane,
	absoluteTolerance As Double
) As Curve()
Parameters
plane
Type: Rhino.Geometry.Plane
The plane to intersect with
absoluteTolerance
Type: System.Double
The document's model absolute tolerance
Return Value
Type: Curve[]
The intersection curves if successful, an empty array if unsuccessful.
See Also
Reference
PointCloud Class
CreateSectionCurve Overload
Rhino.Geometry Namespace