RhinoCommon API
Vector3f.Addition Operator (Vector3f, Vector3f)
 Sums up two vectors.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3f operator +(
	Vector3f vector1,
	Vector3f vector2
)
Public Shared Operator + (
	vector1 As Vector3f,
	vector2 As Vector3f
) As Vector3f
Parameters
vector1
Type: Rhino.Geometry.Vector3f
A vector.
vector2
Type: Rhino.Geometry.Vector3f
A second vector.
Return Value
Type: Vector3f
A new vector that results from the component-wise addition of the two vectors.
See Also
Reference
Vector3f Structure
Addition Overload
Rhino.Geometry Namespace