RhinoCommon API
Mesh.QuadRemesh Method (IEnumerable<Int32>, QuadRemeshParameters, IEnumerable<Curve>, IProgress<Int32>, CancellationToken)
 Quad remesh this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Mesh QuadRemesh(
	IEnumerable<int> faceBlocks,
	QuadRemeshParameters parameters,
	IEnumerable<Curve> guideCurves,
	IProgress<int> progress,
	CancellationToken cancelToken
)
Public Function QuadRemesh (
	faceBlocks As IEnumerable(Of Integer),
	parameters As QuadRemeshParameters,
	guideCurves As IEnumerable(Of Curve),
	progress As IProgress(Of Integer),
	cancelToken As CancellationToken
) As Mesh
Parameters
faceBlocks
Type: System.Collections.Generic.IEnumerable<Int32>
[Missing <param name="faceBlocks"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemesh(System.Collections.Generic.IEnumerable{System.Int32},Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)"]
parameters
Type: Rhino.Geometry.QuadRemeshParameters
[Missing <param name="parameters"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemesh(System.Collections.Generic.IEnumerable{System.Int32},Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)"]
guideCurves
Type: System.Collections.Generic.IEnumerable<Curve>
 A curve array used to influence mesh face layout The curves should touch the input mesh Set Guide Curve Influence by using QuadRemeshParameters.GuideCurveInfluence
progress
Type: System.IProgress<Int32>
[Missing <param name="progress"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemesh(System.Collections.Generic.IEnumerable{System.Int32},Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)"]
cancelToken
Type: System.Threading.CancellationToken
[Missing <param name="cancelToken"/> documentation for "M:Rhino.Geometry.Mesh.QuadRemesh(System.Collections.Generic.IEnumerable{System.Int32},Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.QuadRemesh(System.Collections.Generic.IEnumerable{System.Int32},Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)"]
See Also
Reference
Mesh Class
QuadRemesh Overload
Rhino.Geometry Namespace