RhinoCommon API
PageViewGroupTable.UndoModify Method (Guid)
 If the page view group has been modified and the modification can be undone, then this will restore the page view group to its previous state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UndoModify(
	Guid id
)
Public Function UndoModify (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
Id of page view group.
Return Value
Type: Boolean
>true if successful, false otherwise.
See Also
Reference
PageViewGroupTable Class
UndoModify Overload
Rhino.DocObjects.Tables Namespace