RhinoCommon API
RenderSettings.RenderEnvironmentId Method
 Get the id of the render environment for a particular usage. If usage is Background and the background mode is set to 'Solid Color' or 'Gradient' (i.e., not 'Environment'), then Guid.Empty will be returned.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid RenderEnvironmentId(
	RenderSettings.EnvironmentUsage usage,
	RenderSettings.EnvironmentPurpose purpose
)
Public Function RenderEnvironmentId (
	usage As RenderSettings.EnvironmentUsage,
	purpose As RenderSettings.EnvironmentPurpose
) As Guid
Parameters
usage
Type: Rhino.Render.RenderSettings.EnvironmentUsage
[Missing <param name="usage"/> documentation for "M:Rhino.Render.RenderSettings.RenderEnvironmentId(Rhino.Render.RenderSettings.EnvironmentUsage,Rhino.Render.RenderSettings.EnvironmentPurpose)"]
purpose
Type: Rhino.Render.RenderSettings.EnvironmentPurpose
[Missing <param name="purpose"/> documentation for "M:Rhino.Render.RenderSettings.RenderEnvironmentId(Rhino.Render.RenderSettings.EnvironmentUsage,Rhino.Render.RenderSettings.EnvironmentPurpose)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.RenderSettings.RenderEnvironmentId(Rhino.Render.RenderSettings.EnvironmentUsage,Rhino.Render.RenderSettings.EnvironmentPurpose)"]
See Also
Reference
RenderSettings Class
Rhino.Render Namespace