RhinoCommon API
ModelComponent.ClearId Method
 Resets the HasId property of the model component to false, if possible.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void ClearId()
Public Sub ClearId
Exceptions
Exception | Condition
InvalidOperationException | If the ID is locked.
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace