RhinoCommon API
RebuildCurveOptions.IntensityToInt Method
[Missing <summary> documentation for "M:Rhino.Geometry.RebuildCurveOptions.IntensityToInt(Rhino.Geometry.RebuildCurveIntensity)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int IntensityToInt(
	RebuildCurveIntensity intensity
)
Public Function IntensityToInt (
	intensity As RebuildCurveIntensity
) As Integer
Parameters
intensity
Type: Rhino.Geometry.RebuildCurveIntensity
[Missing <param name="intensity"/> documentation for "M:Rhino.Geometry.RebuildCurveOptions.IntensityToInt(Rhino.Geometry.RebuildCurveIntensity)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Geometry.RebuildCurveOptions.IntensityToInt(Rhino.Geometry.RebuildCurveIntensity)"]
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace