RhinoCommon API
VisualAnalysisMode.AdjustAnalysisMeshes Method
 Interactively adjusts surface analysis meshes of objects using a Rhino built-in analysis mode.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool AdjustAnalysisMeshes(
	RhinoDoc doc,
	Guid analysisModeId
)
Public Shared Function AdjustAnalysisMeshes (
	doc As RhinoDoc,
	analysisModeId As Guid
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
The Rhino document.
analysisModeId
Type: System.Guid
The id of the analysis mode.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace