RhinoCommon API
DisplayPipelineAttributes.GetColorFadeEffect Method
 Get the current color fade effect data.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void GetColorFadeEffect(
	out Color fadeColor,
	out float fadeAmount
)
Public Sub GetColorFadeEffect (
	<OutAttribute> ByRef fadeColor As Color,
	<OutAttribute> ByRef fadeAmount As Single
)
Parameters
fadeColor
Type: System.Drawing.Color
The current fade amount
fadeAmount
Type: System.Single
The current fade color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace