RhinoCommon API
DrawingUtilities.IconFromResource Method (String, Assembly)
 Load a Icon from an embedded resource.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Icon IconFromResource(
	string resourceName,
	Assembly assembly = null
)
Public Shared Function IconFromResource (
	resourceName As String,
	Optional assembly As Assembly = Nothing
) As Icon
Parameters
resourceName
Type: System.String
 The case-sensitive name of the icon manifest resource being requested.
assembly (Optional)
Type: System.Reflection.Assembly
 The assembly containing the manifest resource, will use the calling assembly if null.
Return Value
Type: Icon
 The Icon resource if found and loaded otherwise null.
See Also
Reference
DrawingUtilities Class
IconFromResource Overload
Rhino.UI Namespace