RhinoCommon API
RdkUndo.Finalize Method
 Destructor for RdkUndo
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RdkUndo Class
Rhino.Render Namespace