RhinoCommon API
ObjectPropertiesPage.OnCreateParent Method
 Called when the parent container is initially created.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual void OnCreateParent(
	IntPtr hwndParent
)
Public Overridable Sub OnCreateParent (
	hwndParent As IntPtr
)
Parameters
hwndParent
Type: System.IntPtr
[Missing <param name="hwndParent"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.OnCreateParent(System.IntPtr)"]
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace