RhinoCommon API
PreviewGeometry Constructor
 Constructor for PreviewGeometry
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PreviewGeometry(
	IntPtr pPreviewGeometry
)
Public Sub New (
	pPreviewGeometry As IntPtr
)
Parameters
pPreviewGeometry
Type: System.IntPtr
[Missing <param name="pPreviewGeometry"/> documentation for "M:Rhino.Render.PreviewGeometry.#ctor(System.IntPtr)"]
See Also
Reference
PreviewGeometry Class
Rhino.Render Namespace