RhinoCommon API
MeshVertexNormalList.Clear Method
 Clears the vertex normal collection on the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
IList.Clear()
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace