RhinoCommon API
SubD.CreateFromCylinder Method
 Creates a SubD form of a cylinder.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public static SubD CreateFromCylinder(
	Cylinder cylinder,
	uint circumferenceFaceCount,
	uint heightFaceCount,
	SubDEndCapStyle endCapStyle,
	SubDEdgeTag endCapEdgeTag,
	SubDComponentLocation radiusLocation
)
Public Shared Function CreateFromCylinder (
	cylinder As Cylinder,
	circumferenceFaceCount As UInteger,
	heightFaceCount As UInteger,
	endCapStyle As SubDEndCapStyle,
	endCapEdgeTag As SubDEdgeTag,
	radiusLocation As SubDComponentLocation
) As SubD
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
The defining cylinder.
circumferenceFaceCount
Type: System.UInt32
Number of faces around the cylinder.
heightFaceCount
Type: System.UInt32
Number of faces in the top-to-bottom direction.
endCapStyle
Type: Rhino.Geometry.SubDEndCapStyle
The end cap style.
endCapEdgeTag
Type: Rhino.Geometry.SubDEdgeTag
The end cap edge tag.
radiusLocation
Type: Rhino.Geometry.SubDComponentLocation
The SubD component location.
Return Value
Type: SubD
A new SubD if successful, or null on failure.
See Also
Reference
SubD Class
Rhino.Geometry Namespace