RhinoCommon API
Curve.CreateTextOutlines Method
 Creates outline curves created from a text string. The functionality is similar to what you find in Rhino's TextObject command or TextEntity.Explode() in RhinoCommon.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Curve[] CreateTextOutlines(
	string text,
	string font,
	double textHeight,
	int textStyle,
	bool closeLoops,
	Plane plane,
	double smallCapsScale,
	double tolerance
)
Public Shared Function CreateTextOutlines (
	text As String,
	font As String,
	textHeight As Double,
	textStyle As Integer,
	closeLoops As Boolean,
	plane As Plane,
	smallCapsScale As Double,
	tolerance As Double
) As Curve()
Parameters
text
Type: System.String
The text from which to create outline curves.
font
Type: System.String
The text font. If the font does not exist on the system. Rhino will use a substitute with similar properties.
textHeight
Type: System.Double
The text height.
textStyle
Type: System.Int32
The font style. The font style can be any number of the following: 0 - Normal, 1 - Bold, 2 - Italic
closeLoops
Type: System.Boolean
Set this value to True when dealing with normal fonts and when you expect closed loops. You may want to set this to False when specifying a single-stroke font where you don't want closed loops.
plane
Type: Rhino.Geometry.Plane
The plane on which the outline curves will lie.
smallCapsScale
Type: System.Double
Displays lower-case letters as small caps. Set the relative text size to a percentage of the normal text.
tolerance
Type: System.Double
The tolerance for the operation.
Return Value
Type: Curve[]
An array containing one or more curves if successful.
See Also
Reference
Curve Class
Rhino.Geometry Namespace