RhinoCommon API
Components.FindComponent Method
 Finds a component given its full name.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ComponentFunctionInfo FindComponent(
	string fullName
)
Public Shared Function FindComponent (
	fullName As String
) As ComponentFunctionInfo
Parameters
fullName
Type: System.String
The name, including its library name and a period if it is made by a third-party.
Return Value
Type: ComponentFunctionInfo
[Missing <returns> documentation for "M:Rhino.NodeInCode.Components.FindComponent(System.String)"]
See Also
Reference
Components Class
Rhino.NodeInCode Namespace