RhinoCommon API
Mesh.MatchEdges Method (IEnumerable<Mesh>, Double, Boolean, Boolean, Boolean, Boolean)
 Moves face edges of open meshes to meet near face edges. The method will first try to match vertices, and then then it will try to split edges to make the edges match.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Mesh[] MatchEdges(
	IEnumerable<Mesh> inputMeshes,
	double distance,
	bool simpleSplits,
	bool rachet,
	bool average,
	bool join
)
Public Shared Function MatchEdges (
	inputMeshes As IEnumerable(Of Mesh),
	distance As Double,
	simpleSplits As Boolean,
	rachet As Boolean,
	average As Boolean,
	join As Boolean
) As Mesh()
Parameters
inputMeshes
Type: System.Collections.Generic.IEnumerable<Mesh>
 Input meshes to be split and matched.
distance
Type: System.Double
 The distance tolerance. Use larger tolerances only if you select specific edges to close.
simpleSplits
Type: System.Boolean
 When this is true and there is only one split in a face the code just divides the face at that vertex. If it is false or there are multiple splits on the same face TL_Triangulate3dPolygon is called and the resulting faces replace the existing face.
rachet
Type: System.Boolean
 If true, matching the mesh takes place in four passes starting at a tolerance that is smaller than your specified tolerance and working up to the specified tolerance with successive passes. This matches small edges first and works up to larger edges. If false, then a single pass is made.
average
Type: System.Boolean
 Set to true if you want an average to the vertex sets to be modified rather than using the first.
join
Type: System.Boolean
 Set to true if you want the output joined into a single mesh
Return Value
Type: Mesh[]
The resulting output meshes.
See Also
Reference
Mesh Class
MatchEdges Overload
Rhino.Geometry Namespace