RhinoCommon API
Layer Constructor
Initializes a new instance of the Layer class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Layer()
Public Sub New
See Also
Reference
Layer Class
Rhino.DocObjects Namespace