RhinoCommon API
ViewUserInterfaceTable.Add Method (UserInterfaceObjectBase, Guid)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Add(Rhino.UI.UserInterfaceObjectBase,System.Guid)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Add(
	UserInterfaceObjectBase item,
	Guid userInterfaceGroupId
)
Public Function Add (
	item As UserInterfaceObjectBase,
	userInterfaceGroupId As Guid
) As Boolean
Parameters
item
Type: Rhino.UI.UserInterfaceObjectBase
[Missing <param name="item"/> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Add(Rhino.UI.UserInterfaceObjectBase,System.Guid)"]
userInterfaceGroupId
Type: System.Guid
[Missing <param name="userInterfaceGroupId"/> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Add(Rhino.UI.UserInterfaceObjectBase,System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ViewUserInterfaceTable.Add(Rhino.UI.UserInterfaceObjectBase,System.Guid)"]
See Also
Reference
ViewUserInterfaceTable Class
Add Overload
Rhino.DocObjects.Tables Namespace