RhinoCommon API
Notification.ExecuteAssemblyProtectedCode<TResult> Method (Func<TResult>)
 If a Notification object is only allowed to be modified by certain assemblies, then any code that interacts with it must be wrapped around this method, or a InvalidOperationException will be thrown. For performance reasons, the code wrapped by this method should be kept as simple as possible.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static TResult ExecuteAssemblyProtectedCode<TResult>(
	Func<TResult> func
)
Public Shared Function ExecuteAssemblyProtectedCode(Of TResult) (
	func As Func(Of TResult)
) As TResult
Parameters
func
Type: System.Func<TResult>
The code to run that modifies one or more notification objects
Type Parameters
TResult
[Missing <typeparam name="TResult"/> documentation for "M:Rhino.Runtime.Notifications.Notification.ExecuteAssemblyProtectedCode``1(System.Func{``0})"]
Return Value
Type: TResult
[Missing <returns> documentation for "M:Rhino.Runtime.Notifications.Notification.ExecuteAssemblyProtectedCode``1(System.Func{``0})"]
Remarks
This method is not thread-safe and should only be manipulated in UI thread.
See Also
Reference
Notification Class
ExecuteAssemblyProtectedCode Overload
Rhino.Runtime.Notifications Namespace