RhinoCommon API
RenderPlugIn.EnableEditMaterialButton Method
 Called to enable/disable the "Edit" button located on the "Material" in the Properties and Layer dialog boxes. The default return value is false which will disable the button. If the button is disabled then the OnEditMaterial function is never called.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.12
Syntax
public virtual bool EnableEditMaterialButton(
	RhinoDoc doc,
	Material material
)
Public Overridable Function EnableEditMaterialButton (
	doc As RhinoDoc,
	material As Material
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.EnableEditMaterialButton(Rhino.RhinoDoc,Rhino.DocObjects.Material)"]
material
Type: Rhino.DocObjects.Material
[Missing <param name="material"/> documentation for "M:Rhino.PlugIns.RenderPlugIn.EnableEditMaterialButton(Rhino.RhinoDoc,Rhino.DocObjects.Material)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.RenderPlugIn.EnableEditMaterialButton(Rhino.RhinoDoc,Rhino.DocObjects.Material)"]
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace