RhinoCommon API
ObjRef.TextDot Method
 Gets the text dot if the referenced geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public TextDot TextDot()
Public Function TextDot As TextDot
Return Value
Type: TextDot
A text dot; or null if the referenced object is not a text dot, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace