RhinoCommon API
GetCancel.Wait<TResult> Method (Task<TResult>, RhinoDoc)
 Awaits a particular task to finish.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Result Wait<TResult>(
	Task<TResult> task,
	RhinoDoc doc
)
Public Function Wait(Of TResult) (
	task As Task(Of TResult),
	doc As RhinoDoc
) As Result
Parameters
task
Type: System.Threading.Tasks.Task<TResult>
The task.
doc
Type: Rhino.RhinoDoc
A document to set progress reporting.
Type Parameters
TResult
[Missing <typeparam name="TResult"/> documentation for "M:Rhino.Input.Custom.GetCancel.Wait``1(System.Threading.Tasks.Task{``0},Rhino.RhinoDoc)"]
Return Value
Type: Result
A result enumeration.
See Also
Reference
GetCancel Class
Wait Overload
Rhino.Input.Custom Namespace