RhinoCommon API
NurbsCurve.CreateHSpline Method (IEnumerable<Point3d>)
 Construct an H-spline from a sequence of interpolation points
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static NurbsCurve CreateHSpline(
	IEnumerable<Point3d> points
)
Public Shared Function CreateHSpline (
	points As IEnumerable(Of Point3d)
) As NurbsCurve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to interpolate
Return Value
Type: NurbsCurve
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurve.CreateHSpline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
See Also
Reference
NurbsCurve Class
CreateHSpline Overload
Rhino.Geometry Namespace