RhinoCommon API
Material.GetTransparencyTexture Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.GetTransparencyTexture"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Texture GetTransparencyTexture()
Public Function GetTransparencyTexture As Texture
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.GetTransparencyTexture"]
See Also
Reference
Material Class
Rhino.DocObjects Namespace
Material.GetTexture(TextureType)