RhinoCommon API
TextFields.PaperName Method
 Returns the layouts selected paper name example Letter / A4 / A6
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string PaperName()
Public Shared Function PaperName As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.PaperName"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace