RhinoCommon API
SupportOptions.ShowRenderContent Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.ShowRenderContent"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use 'Libraries_ShowRenderContent' instead")]
public static bool ShowRenderContent()
<ObsoleteAttribute("Use 'Libraries_ShowRenderContent' instead")>
Public Shared Function ShowRenderContent As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.ShowRenderContent"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace