RhinoCommon API
BrepFace.ShrinkFace Method
 Shrinks the underlying untrimmed surface of this Brep face close to trimming boundaries. Shrinking a surface is like extending smoothly, only backwards. knot of full multiplicity are added where you want the surface to be cut off. Then the remaining control points are thrown away.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ShrinkFace(
	BrepFace.ShrinkDisableSide disableSide
)
Public Function ShrinkFace (
	disableSide As BrepFace.ShrinkDisableSide
) As Boolean
Parameters
disableSide
Type: Rhino.Geometry.BrepFace.ShrinkDisableSide
The side(s) of the surface to not shrink.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace