RhinoCommon API
InstanceDefinitionTable.GetUnusedInstanceDefinitionName Method (String, UInt32)
Note: This API is now obsolete.
 Gets unused instance definition name used as default when creating new instance definitions.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("The defaultSuffix parameter is now ignored. Remove the second argument.")]
public string GetUnusedInstanceDefinitionName(
	string root,
	uint defaultSuffix
)
<ObsoleteAttribute("The defaultSuffix parameter is now ignored. Remove the second argument.")>
Public Function GetUnusedInstanceDefinitionName (
	root As String,
	defaultSuffix As UInteger
) As String
Parameters
root
Type: System.String
 The returned name is 'root nn' If root is empty, then 'Block' (localized) is used.
defaultSuffix
Type: System.UInt32
 Unique names are created by appending a decimal number to the localized term for "Block" as in "Block 01", "Block 02", and so on. When defaultSuffix is supplied, the search for an unused name begins at "Block suffix".
Return Value
Type: String
An unused instance definition name string.
See Also
Reference
InstanceDefinitionTable Class
GetUnusedInstanceDefinitionName Overload
Rhino.DocObjects.Tables Namespace