RhinoCommon API
DisplayPipeline.DrawRoundedRectangle Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawRoundedRectangle(System.Drawing.PointF,System.Single,System.Single,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DrawRoundedRectangle(
	PointF center,
	float pixelWidth,
	float pixelHeight,
	float cornerRadius,
	Color strokeColor,
	float strokeWidth,
	Color fillColor
)
Public Sub DrawRoundedRectangle (
	center As PointF,
	pixelWidth As Single,
	pixelHeight As Single,
	cornerRadius As Single,
	strokeColor As Color,
	strokeWidth As Single,
	fillColor As Color
)
Parameters
center
Type: System.Drawing.PointF
[Missing <param name="center"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawRoundedRectangle(System.Drawing.PointF,System.Single,System.Single,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)"]
pixelWidth
Type: System.Single
[Missing <param name="pixelWidth"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawRoundedRectangle(System.Drawing.PointF,System.Single,System.Single,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)"]
pixelHeight
Type: System.Single
[Missing <param name="pixelHeight"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawRoundedRectangle(System.Drawing.PointF,System.Single,System.Single,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)"]
cornerRadius
Type: System.Single
[Missing <param name="cornerRadius"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawRoundedRectangle(System.Drawing.PointF,System.Single,System.Single,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)"]
strokeColor
Type: System.Drawing.Color
[Missing <param name="strokeColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawRoundedRectangle(System.Drawing.PointF,System.Single,System.Single,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)"]
strokeWidth
Type: System.Single
[Missing <param name="strokeWidth"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawRoundedRectangle(System.Drawing.PointF,System.Single,System.Single,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)"]
fillColor
Type: System.Drawing.Color
[Missing <param name="fillColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawRoundedRectangle(System.Drawing.PointF,System.Single,System.Single,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace