RhinoCommon API
HatchLine Constructor
 Construts a new hatch line.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public HatchLine()
Public Sub New
See Also
Reference
HatchLine Class
HatchLine Overload
Rhino.DocObjects Namespace