RhinoCommon API
ObjectTable.AddInstanceObject Method (Int32, Transform)
 Adds an instance object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid AddInstanceObject(
	int instanceDefinitionIndex,
	Transform instanceXform
)
Public Function AddInstanceObject (
	instanceDefinitionIndex As Integer,
	instanceXform As Transform
) As Guid
Parameters
instanceDefinitionIndex
Type: System.Int32
The index of the instance definition.
instanceXform
Type: Rhino.Geometry.Transform
The instance transformation.
Return Value
Type: Guid
A unique identifier for the object if successful. Guid.Empty it not successful.
See Also
Reference
ObjectTable Class
AddInstanceObject Overload
Rhino.DocObjects.Tables Namespace