RhinoCommon API
LicenseUtils.DeleteLicense Method
 Deletes a license along with its license file.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool DeleteLicense(
	Guid productId
)
Public Shared Function DeleteLicense (
	productId As Guid
) As Boolean
Parameters
productId
Type: System.Guid
[Missing <param name="productId"/> documentation for "M:Rhino.PlugIns.LicenseUtils.DeleteLicense(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.DeleteLicense(System.Guid)"]
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace