RhinoCommon API
RenderContentKindList Constructor (IntPtr)
 Construct from native pointer - internal use only.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public RenderContentKindList(
	IntPtr pRdkRenderContentKindList
)
Public Sub New (
	pRdkRenderContentKindList As IntPtr
)
Parameters
pRdkRenderContentKindList
Type: System.IntPtr
C++ pointer to a kind list.
See Also
Reference
RenderContentKindList Class
RenderContentKindList Overload
Rhino.Render Namespace