RhinoCommon API
BrepVertexList.GetEnumerator Method
 Gets an enumerator that visits all surfaces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public IEnumerator<BrepVertex> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepVertex)
Return Value
Type: IEnumerator<BrepVertex>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
BrepVertexList Class
Rhino.Geometry.Collections Namespace