RhinoCommon API
IRhRdkThumbnailList.GetSize Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.GetSize"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
IRhRdkContentThumbnailList_Sizes GetSize()
Function GetSize As IRhRdkContentThumbnailList_Sizes
Return Value
Type: IRhRdkContentThumbnailList_Sizes
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.GetSize"]
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace