RhinoCommon API
RhinoObject.TryGetRenderPrimitiveBoundingBox Method (ViewportInfo, Boolean, BoundingBox)
Note: This API is now obsolete.
 Get the bounding box for the custom render meshes associated with this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
[ObsoleteAttribute("Use CustomRenderMeshesBoundingBox instead")]
public bool TryGetRenderPrimitiveBoundingBox(
	ViewportInfo viewport,
	bool preview,
	out BoundingBox boundingBox
)
<ObsoleteAttribute("Use CustomRenderMeshesBoundingBox instead")>
Public Function TryGetRenderPrimitiveBoundingBox (
	viewport As ViewportInfo,
	preview As Boolean,
	<OutAttribute> ByRef boundingBox As BoundingBox
) As Boolean
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
preview
Type: System.Boolean
 Type of mesh to build, if preview is true then a smaller mesh may be generated in less time, false is meant when actually rendering.
boundingBox
Type: Rhino.Geometry.BoundingBox
 This will be set to BoundingBox.Unset on failure otherwise it will be the bounding box for the custom render meshes associated with this object.
Return Value
Type: Boolean
 Returns true if the bounding box was successfully calculated otherwise returns false on error.
See Also
Reference
RhinoObject Class
TryGetRenderPrimitiveBoundingBox Overload
Rhino.DocObjects Namespace