RhinoCommon API
ShortcutKeySettings.IsAcceptableKeyCombo Method
 Is a key plus modifier combination one that can be used with Rhino
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public static bool IsAcceptableKeyCombo(
	KeyboardKey key,
	ModifierKey modifier
)
Public Shared Function IsAcceptableKeyCombo (
	key As KeyboardKey,
	modifier As ModifierKey
) As Boolean
Parameters
key
Type: Rhino.UI.KeyboardKey
[Missing <param name="key"/> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.IsAcceptableKeyCombo(Rhino.UI.KeyboardKey,Rhino.UI.ModifierKey)"]
modifier
Type: Rhino.UI.ModifierKey
[Missing <param name="modifier"/> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.IsAcceptableKeyCombo(Rhino.UI.KeyboardKey,Rhino.UI.ModifierKey)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.ShortcutKeySettings.IsAcceptableKeyCombo(Rhino.UI.KeyboardKey,Rhino.UI.ModifierKey)"]
See Also
Reference
ShortcutKeySettings Class
Rhino.ApplicationSettings Namespace