RhinoCommon API
RenderTexture.IsHdrCapable Method
 Return true if the texture is HDR capable. When creating a custom RenderTexture implementation that is HDR capable set the appropriate property on the CustomRenderContentAttribute decorator on that clas.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool IsHdrCapable()
Public Function IsHdrCapable As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.IsHdrCapable"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace