RhinoCommon API
SquishParameters Constructor
 Initializes a new instance with default values. Initial values are same as Default.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public SquishParameters()
Public Sub New
See Also
Reference
SquishParameters Class
Rhino.Geometry Namespace