RhinoCommon API
HatchPatternTable.GetUnusedHatchPatternName Method
 Gets unused hatchpattern name used as default when creating new hatchpatterns.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string GetUnusedHatchPatternName()
Public Function GetUnusedHatchPatternName As String
Return Value
Type: String
The unused hatchpattern name.
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace