RhinoCommon API
LocalizedStringHandler.AppendFormatted<T> Method (T, Int32)
[Missing <summary> documentation for "M:Rhino.UI.LocalizedStringHandler.AppendFormatted``1(``0,System.Int32)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public void AppendFormatted<T>(
	T value,
	int alignment
)
Public Sub AppendFormatted(Of T) (
	value As T,
	alignment As Integer
)
Parameters
value
Type: T
[Missing <param name="value"/> documentation for "M:Rhino.UI.LocalizedStringHandler.AppendFormatted``1(``0,System.Int32)"]
alignment
Type: System.Int32
[Missing <param name="alignment"/> documentation for "M:Rhino.UI.LocalizedStringHandler.AppendFormatted``1(``0,System.Int32)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.UI.LocalizedStringHandler.AppendFormatted``1(``0,System.Int32)"]
See Also
Reference
LocalizedStringHandler Structure
AppendFormatted Overload
Rhino.UI Namespace