RhinoCommon API
Dialogs.ShowColorDialog Method (Color4f, Boolean)
 Displays the standard modal color picker dialog for floating point colors.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool ShowColorDialog(
	ref Color4f color,
	bool allowAlpha
)
Public Shared Function ShowColorDialog (
	ByRef color As Color4f,
	allowAlpha As Boolean
) As Boolean
Parameters
color
Type: Rhino.Display.Color4f
The initial color to set the picker to and also accepts the user's choice.
allowAlpha
Type: System.Boolean
Specifies if the color picker should allow changes to the alpha channel or not.
Return Value
Type: Boolean
true if a color was picked, false if the user canceled the picker dialog.
See Also
Reference
Dialogs Class
ShowColorDialog Overload
Rhino.UI Namespace