RhinoCommon API
File3ds.Read Method
Read a 3ds file intof a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool Read(
	string path,
	RhinoDoc doc,
	File3dsReadOptions options
)
Public Shared Function Read (
	path As String,
	doc As RhinoDoc,
	options As File3dsReadOptions
) As Boolean
Parameters
path
Type: System.String
path to read a file from
doc
Type: Rhino.RhinoDoc
document to import geometry into
options
Type: Rhino.FileIO.File3dsReadOptions
options used for importing the 3ds file
Return Value
Type: Boolean
true on success
See Also
Reference
File3ds Class
Rhino.FileIO Namespace