RhinoCommon API
File3dmDisplacement.SetSubItemBlackPoint Method
 Sets the override for displacement 'black-point'. face_index is the index of the face on the polysurface/SubD.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public void SetSubItemBlackPoint(
	int face_index,
	double black_point
)
Public Sub SetSubItemBlackPoint (
	face_index As Integer,
	black_point As Double
)
Parameters
face_index
Type: System.Int32
[Missing <param name="face_index"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.SetSubItemBlackPoint(System.Int32,System.Double)"]
black_point
Type: System.Double
[Missing <param name="black_point"/> documentation for "M:Rhino.FileIO.File3dmDisplacement.SetSubItemBlackPoint(System.Int32,System.Double)"]
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace