RhinoCommon API
Brep.VariationalPatchSettings Constructor (RhinoDoc)
 Constructor that sets defaults and takes the tolerance, internal tolerance and angle tolerance from the document
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public VariationalPatchSettings(
	RhinoDoc doc
)
Public Sub New (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Geometry.Brep.VariationalPatchSettings.#ctor(Rhino.RhinoDoc)"]
See Also
Reference
Brep.VariationalPatchSettings Class
Brep.VariationalPatchSettings Overload
Rhino.Geometry Namespace