RhinoCommon API
CurvatureGraphSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static CurvatureGraphSettingsState GetCurrentState()
Public Shared Function GetCurrentState As CurvatureGraphSettingsState
Return Value
Type: CurvatureGraphSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.CurvatureGraphSettings.GetCurrentState"]
See Also
Reference
CurvatureGraphSettings Class
Rhino.ApplicationSettings Namespace