RhinoCommon API
CurveKinkDefinition.ComputeCurvatureRadiusRatio Method
 Calculates the curvature radius ratio and the angle between the two curvature vectors.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ComputeCurvatureRadiusRatio(
	Vector3d curvatureFromBelow,
	Vector3d curvatureFromAbove,
	out double radiusOfCurvatureRatio,
	out double curvatureVectorAngleDegrees
)
Public Function ComputeCurvatureRadiusRatio (
	curvatureFromBelow As Vector3d,
	curvatureFromAbove As Vector3d,
	<OutAttribute> ByRef radiusOfCurvatureRatio As Double,
	<OutAttribute> ByRef curvatureVectorAngleDegrees As Double
) As Boolean
Parameters
curvatureFromBelow
Type: Rhino.Geometry.Vector3d
[Missing <param name="curvatureFromBelow"/> documentation for "M:Rhino.Geometry.CurveKinkDefinition.ComputeCurvatureRadiusRatio(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Double@,System.Double@)"]
curvatureFromAbove
Type: Rhino.Geometry.Vector3d
[Missing <param name="curvatureFromAbove"/> documentation for "M:Rhino.Geometry.CurveKinkDefinition.ComputeCurvatureRadiusRatio(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Double@,System.Double@)"]
radiusOfCurvatureRatio
Type: System.Double
[Missing <param name="radiusOfCurvatureRatio"/> documentation for "M:Rhino.Geometry.CurveKinkDefinition.ComputeCurvatureRadiusRatio(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Double@,System.Double@)"]
curvatureVectorAngleDegrees
Type: System.Double
If one or both of the vectors have zero length, this returns RhinoMath.UnsetValue
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.CurveKinkDefinition.ComputeCurvatureRadiusRatio(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Double@,System.Double@)"]
See Also
Reference
CurveKinkDefinition Class
Rhino.Geometry Namespace