RhinoCommon API
WorksessionFileModel.GetParentLayerValues Method
 Gets a copy of the settings of the layer Rhino adds as the parent of all of a reference model's layers. Version 4 files do not have them.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionFileLayerValues GetParentLayerValues()
Public Function GetParentLayerValues As WorksessionFileLayerValues
Return Value
Type: WorksessionFileLayerValues
A copy. Changes to it are kept only after SetParentLayerValues(WorksessionFileLayerValues).
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace