RhinoCommon API
RenderPipeline.AddLightToScene Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.AddLightToScene(Rhino.DocObjects.LightObject)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool AddLightToScene(
	LightObject light
)
Protected Overridable Function AddLightToScene (
	light As LightObject
) As Boolean
Parameters
light
Type: Rhino.DocObjects.LightObject
[Missing <param name="light"/> documentation for "M:Rhino.Render.RenderPipeline.AddLightToScene(Rhino.DocObjects.LightObject)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.AddLightToScene(Rhino.DocObjects.LightObject)"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace