RhinoCommon API
HostUtils.GetActivePlugInVersionFolders Method
 Recurses through the auto install plug-in folders and returns the directories containing "active" versions of plug-ins.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.17
Syntax
public static IEnumerable<DirectoryInfo> GetActivePlugInVersionFolders()
Public Shared Function GetActivePlugInVersionFolders As IEnumerable(Of DirectoryInfo)
Return Value
Type: IEnumerable<DirectoryInfo>
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.GetActivePlugInVersionFolders"]
Remarks
If the same package is installed in both the user and machine locations, the newest directory wins.
See Also
Reference
HostUtils Class
GetActivePlugInVersionFolders Overload
Rhino.Runtime Namespace