RhinoCommon API
SubD.Subdivide Method (IEnumerable<Int32>)
 Apply the Catmull-Clark subdivision algorithm and save the results in this SubD.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Subdivide(
	IEnumerable<int> faceIndices
)
Public Function Subdivide (
	faceIndices As IEnumerable(Of Integer)
) As Boolean
Parameters
faceIndices
Type: System.Collections.Generic.IEnumerable<Int32>
Indices of the faces to subdivide.
Return Value
Type: Boolean
true on success
See Also
Reference
SubD Class
Subdivide Overload
Rhino.Geometry Namespace