RhinoCommon API
DimStyleTable.Modify Method (DimensionStyle, Int32, Boolean)
Modifies dimension style settings.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Modify(
	DimensionStyle newSettings,
	int dimstyleIndex,
	bool quiet
)
Public Function Modify (
	newSettings As DimensionStyle,
	dimstyleIndex As Integer,
	quiet As Boolean
) As Boolean
Parameters
newSettings
Type: Rhino.DocObjects.DimensionStyle
This information is copied.
dimstyleIndex
Type: System.Int32
 zero based index of dimension to set. Must be in the range 0 <= dimstyleIndex < DimStyleTable.Count.
quiet
Type: System.Boolean
if true, information message boxes pop up when illegal changes are attempted.
Return Value
Type: Boolean
 true if successful. false if dimstyleIndex is out of range
See Also
Reference
DimStyleTable Class
Modify Overload
Rhino.DocObjects.Tables Namespace