RhinoCommon API
DirectionGripUserInterfaceObject Methods
The DirectionGripUserInterfaceObject type exposes the following members.
Methods
Name | Description
ArrowsVisibleInViewport
 Are the arrows visible for a given viewport. Projections that cause the arrows to be end on are projections where arrows are not drawn.
Top
See Also
Reference
DirectionGripUserInterfaceObject Class
Rhino.UI Namespace