RhinoCommon API
Leader Methods
The Leader type exposes the following members.
Methods
Name | Description
Create
 Creates a Leader geometry object
CreateWithRichText
 Creates a Leader geometry object
Explode
 Explodes this leader into its geometric components.
Top
See Also
Reference
Leader Class
Rhino.Geometry Namespace