RhinoCommon API
UserDictionary Methods
The UserDictionary type exposes the following members.
Methods
Name | Description
OnDuplicate
 Clones the user data.
 (Overrides UserData.OnDuplicate(UserData).)
Read
 Is called to read this entity.
 (Overrides UserData.Read(BinaryArchiveReader).)
Write
 Is called to write this entity.
 (Overrides UserData.Write(BinaryArchiveWriter).)
Top
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace