RhinoCommon API
MeshCheckParameters Methods
The MeshCheckParameters type exposes the following members.
Methods
Name | Description
Defaults
 Gets the default mesh check parameters.
Top
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace