RhinoCommon API
ColorXYZ Methods
The ColorXYZ type exposes the following members.
Methods
Name | Description
CreateFromCMYK
 Create the nearest XYZ equivalent of a CMYK color.
CreateFromHSL
 Create the nearest XYZ equivalent of an HSL color.
CreateFromHSV
 Constructs the nearest XYZ equivalent of an HSV color.
CreateFromLAB
 Create the nearest XYZ equivalent of a Lab color.
CreateFromLCH
 Create the nearest XYZ equivalent of an LCH color.
CreateFromRGBA
 Create the nearest XYZ equivalent of a RGBA color.
Top
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace