RhinoCommon API
ContentUndoHelper Methods
The ContentUndoHelper type exposes the following members.
Methods
Name | Description
AddContent
 Call this *after* adding a content. Undo will cause the content to be deleted.
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
ModifyContent
 Call this before modifying or deleting a content. Undo will cause the content to be restored.
TweakContent
 Call this before tweaking a single content parameter. Undo will cause the parameter to be restored.
Top
See Also
Reference
ContentUndoHelper Class
Rhino.Render Namespace