RhinoCommon API
SweepOneRail Methods
The SweepOneRail type exposes the following members.
Methods
Name | Description
PerformSweep(Curve, Curve)
PerformSweep(Curve, IEnumerable<Curve>)
PerformSweep(Curve, Curve, Double)
PerformSweep(Curve, IEnumerable<Curve>, IEnumerable<Double>)
PerformSweepRebuild(Curve, Curve, Int32)
PerformSweepRebuild(Curve, IEnumerable<Curve>, Int32)
PerformSweepRebuild(Curve, Curve, Double, Int32)
PerformSweepRebuild(Curve, IEnumerable<Curve>, IEnumerable<Double>, Int32)
PerformSweepRefit(Curve, Curve, Double)
PerformSweepRefit(Curve, IEnumerable<Curve>, Double)
PerformSweepRefit(Curve, Curve, Double, Double)
PerformSweepRefit(Curve, IEnumerable<Curve>, IEnumerable<Double>, Double)
SetRoadlikeUpDirection
SetToRoadlikeFront
SetToRoadlikeRight
SetToRoadlikeTop
Top
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace