RhinoCommon API
CurveObject Methods
The CurveObject type exposes the following members.
Methods
Name | Description
DuplicateCurveGeometry
 Returns a copy of the underlying curve geometry.
GetLinetypeSegments()
 Converts the linetype pattern of the curve into curve segments and points based on the active Rhino viewport.
GetLinetypeSegments(RhinoViewport)
 Converts the linetype pattern of the curve into curve segments and points based on the specified Rhino viewport.
Top
See Also
Reference
CurveObject Class
Rhino.DocObjects Namespace