RhinoCommon API
FileGts Methods
The FileGts type exposes the following members.
Methods
Name | Description
Write
Write a Gts file based on the contents of a RhinoDoc
Top
See Also
Reference
FileGts Class
Rhino.FileIO Namespace