RhinoCommon API
PostEffectJobChannels Methods
The PostEffectJobChannels type exposes the following members.
Methods
Name | Description
Dispose
Finalize |  (Overrides Object.Finalize().)
GetChannel
Top
See Also
Reference
PostEffectJobChannels Class
Rhino.Render.PostEffects Namespace