RhinoCommon API
FileDst Methods
The FileDst type exposes the following members.
Methods
Name | Description
Read
Read a dst file into a RhinoDoc
Top
See Also
Reference
FileDst Class
Rhino.FileIO Namespace