RhinoCommon API
SHA1OpenNURBS Methods
The SHA1OpenNURBS type exposes the following members.
Methods
Name | Description
FileSystemPathHash
 Computes the SHA1 hash of a file system path, converted to UTF8.
These file system paths have identical values of FileSystemPathHash():
/x/y/z/name.ext
\x\y\z\name.ext
/x//y//z/name.ext
/x/y/a/b/c/../../../z/name.ext
/X/Y/Z/NAME.EXT (When ignoreCase is true)
Finalize
 Instructs the runtime to reclaim unmanaged resources if the developer forgot to call Dispose().
 (Overrides Object.Finalize().)
Initialize
 Resets this instance of the algorithm, so that it can be used again. It is not required to call this method after creation.
 (Overrides HashAlgorithm.Initialize().)
StringHash
 Computes the SHA1 hash of a string, converted to UTF8.
Top
See Also
Reference
SHA1OpenNURBS Class
Rhino.FileIO Namespace