RhinoCommon API
MeshFace Methods
The MeshFace type exposes the following members.
Methods
Name | Description
CompareTo
 Compares this MeshFace with another MeshFace and returns a value of 1, 0, or -1, referring to dictionary order.
Index evaluation priority is first A, then B, then C, then D.
Equals(MeshFace)
 Returns a value indicating whether the other mesh face has precisely the same value as the current one.
Equals(Object)
 Returns a value indicating whether the other object obj has precisely the same value as the current one.
 (Overrides ValueType.Equals(Object).)
Flip
 Reverses the orientation of the face by swapping corners. The first corner is always maintained.
GetHashCode
 Returns a runtime-stable hash code for the current mesh face. You are not allowed to rely on persistence of this hash code in serialization, but for each version of RhinoCommon, this hash code will be the same for each mesh face.
 (Overrides ValueType.GetHashCode().)
IsValid()
 Gets a value indicating whether or not this mesh face is considered to be valid. Note that even valid mesh faces could potentially be invalid in the context of a specific Mesh, if one or more of the corner indices exceeds the number of vertices on the mesh. If you want to perform a complete validity check, use IsValid(int) instead.
IsValid(Int32)
 Gets a value indicating whether or not this mesh face is considered to be valid. Unlike the simple IsValid function, this function takes upper bound indices into account.
IsValid(Point3d[])
 Gets a value indicating whether or not this mesh face is considered to be valid. Unlike the simple IsValid function, this function takes actual point locations into account.
IsValidEx
 Gets a value indicating whether or not this mesh face is considered to be valid. Unlike the simple IsValid function, this function takes actual point locations into account.
Repair
 Attempts to repair this mesh face by taking both face indexes and actual vertex locations into account.
RepairEx
 Attempts to repair this mesh face by taking both face indexes and actual vertex locations into account.
Set(Int32, Int32, Int32)
 Sets all the corners for this face as a triangle.
Set(Int32, Int32, Int32, Int32)
 Sets all the corners for this face as a quad.
ToString
 Returns a string representation for this MeshFace. This is to provide a meaningful visualization of this structure and is subject to change in newer releases.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace