RhinoCommon API
Point2d Methods
The Point2d type exposes the following members.
Methods
Name | Description
Add(Point2d, Point2d)
 Adds a point with a point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Add(Point2d, Vector2d)
 Adds a point with a vector.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Add(Vector2d, Point2d)
 Adds a vector with a point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
CompareTo
 Compares this Point2d with another Point2d.
Coordinates evaluation priority is first X, then Y.
DistanceTo
 Computes the distance between two points.
DistanceToSquared
 Computes the square of the distance between two 2d points.
This method is usually largely faster than DistanceTo().
Divide
 Divides a Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Point2d and has the same values as the present point.
 (Overrides ValueType.Equals(Object).)
Equals(Point2d)
 Determines whether the specified Point2d has the same values as the present point.
GetHashCode
 Computes a hash number that represents the current point.
 (Overrides ValueType.GetHashCode().)
Multiply(Double, Point2d)
 Multiplies a Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Point2d, Double)
 Multiplies a Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Subtract(Point2d, Point2d)
 Subtracts the second point from the first point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
Subtract(Point2d, Vector2d)
 Subtracts a vector from a point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
ToString()
 Constructs the string representation for the current point.
 (Overrides ValueType.ToString().)
ToString(String, IFormatProvider)
Formats the value of the current instance using the specified format.
Transform
 Transforms the present point in place. The transformation matrix acts on the left of the point. i.e.,
result = transformation*point
Top
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace