RhinoCommon API
Instance Methods
The Instance type exposes the following members.
Methods
Name | Description
Dispose()
 Dispose method
Dispose(Boolean)
 Dispose method.
Finalize
 Finalizer to ensure correctly implemented dispose pattern.
 (Overrides Object.Finalize().)
Top
See Also
Reference
Instance Class
Rhino.Render.CustomRenderMeshes Namespace