RhinoCommon API
MeshTopologyEdgeList Methods
The MeshTopologyEdgeList type exposes the following members.
Methods
Name | Description
CollapseEdge
 Replaces a mesh edge with a vertex at its center and update adjacent faces as needed.
EdgeLine
Gets the 3d line along an edge.
GetConnectedFaces(Int32)
 Gets indices of faces connected to an edge.
GetConnectedFaces(Int32, Boolean[])
 Gets indices of faces connected to an edge.
GetEdgeIndex
 Returns index of edge that connects topological vertices. returns -1 if no edge is found.
GetEdgesForFace(Int32)
 Gets indices of edges that surround a given face.
GetEdgesForFace(Int32, Boolean[])
 Gets indices of edges that surround a given face.
GetTopologyVertices
Gets the two topology vertices for a given topology edge.
IsEdgeUnwelded
 Determines if the mesh edge is unwelded, or if the mesh faces that share the edge have unique vertex indices.
IsHidden
 Returns true if the topological edge is hidden. The mesh topology edge is hidden only if either of its mesh topology vertices is hidden.
IsNgonInterior
 Returns true if the topological edge is an interior ngon edge
IsSwappableEdge
 Determines if a mesh edge index is valid input for SwapEdge(Int32).
SplitEdge(Int32, Point3d)
 Divides a mesh edge to create two or more triangles
SplitEdge(Int32, Double)
 Divides a mesh edge to create two or more triangles
SwapEdge
 If the edge is shared by two triangular face, then the edge is swapped.
Top
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace