RhinoCommon API
IRhRdkThumbnail Methods
The IRhRdkThumbnail type exposes the following members.
Methods
Name | Description
Dib
GetDib
GetDisplayRect
Id
IsHot
IsSelected
Label
Top
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls.ThumbnailUI Namespace