RhinoCommon API
Vector3d Methods
The Vector3d type exposes the following members.
Methods
Name | Description
Add
 Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
AreOrthogonal
 Test whether three vectors describe an orthogonal axis system. All vectors must be mutually perpendicular this to be the case.
AreOrthonormal
 Test whether three vectors describe an orthogonal, unit axis system. All vectors must be mutually perpendicular and have unit length for this to be the case.
AreRighthanded
 Test whether three vectors describe a right-handed, orthogonal, unit axis system. The vectors must be orthonormal and follow the right-hand ordering; index-finger=x, middle-finger=y, thumb=z.
CompareTo
 Compares this Vector3d with another Vector3d.
Component evaluation priority is first X, then Y, then Z.
CrossProduct
 Computes the cross product (or vector product, or exterior product) of two vectors.
This operation is not commutative.
Decompose
 Find scalars x and y so that the component of v in the plane of a and b is x*a + y*b
Divide
 Divides a Vector3d by a number, having the effect of shrinking it.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Vector3d and has the same values as the present vector.
 (Overrides ValueType.Equals(Object).)
Equals(Vector3d)
 Determines whether the specified vector has the same value as the present vector.
GetHashCode
 Computes the hash code for the current vector.
 (Overrides ValueType.GetHashCode().)
IsParallelTo(Vector3d)
 Determines whether this vector is parallel to another vector, within one degree (within Pi / 180).
IsParallelTo(Vector3d, Double)
 Determines whether this vector is parallel to another vector, within a provided tolerance.
IsPerpendicularTo(Vector3d)
 Test to see whether this vector is perpendicular to within one degree of another one.
IsPerpendicularTo(Vector3d, Double)
 Determines whether this vector is perpendicular to another vector, within a provided angle tolerance.
IsTiny()
 Uses RhinoMath.ZeroTolerance for IsTiny calculation.
IsTiny(Double)
 Determines whether a vector is very short.
Multiply(Double, Vector3d)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector3d, Vector3d)
 Multiplies two vectors together, returning the dot product (or inner product). This differs from the cross product.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector3d, Double)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Negate
 Computes the reversed vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
PerpendicularTo(Vector3d)
 Sets this vector to be perpendicular to another vector. Result is not unitized.
PerpendicularTo(Point3d, Point3d, Point3d)
 Set this vector to be perpendicular to a plane defined by 3 points.
Reverse
 Reverses this vector in place (reverses the direction).
If this vector is Invalid, no changes will occur and false will be returned.
Rotate
 Rotates this vector around a given axis.
Subtract
 Subtracts the second vector from the first one.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
ToString()
 Returns the string representation of the current vector, in the form X,Y,Z.
 (Overrides ValueType.ToString().)
ToString(String, IFormatProvider)
Formats the value of the current instance using the specified format.
Transform
 Transforms the vector in place.
The transformation matrix acts on the left of the vector; i.e.,
result = transformation*vector
Unitize
 Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
VectorAngle(Vector3d, Vector3d)
 Compute the angle between two vectors.
This operation is commutative.
VectorAngle(Vector3d, Vector3d, Plane)
 Computes the angle on a plane between two vectors.
VectorAngle(Vector3d, Vector3d, Vector3d)
 Computes the angle of v1, v2 with a normal vector.
Top
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace