RhinoCommon API
StringHolder Methods
The StringHolder type exposes the following members.
Methods
Name | Description
ConstPointer
 C++ pointer used to access the ON_wString, managed plug-ins should never need this.
Dispose()
 IDispose implementation
Dispose(Boolean)
 Called by Dispose and finalizer
Finalize
 Destructor
 (Overrides Object.Finalize().)
GetString
 Gets managed string from unmanaged ON_wString pointer.
NonConstPointer
 C++ pointer used to access the ON_wString, managed plug-ins should never need this.
ToString
 Marshals unmanaged ON_wString to a managed .NET string
 (Overrides Object.ToString().)
ToStringSafe
 Marshals unmanaged ON_wString to a managed .NET string and never returns null.
Top
See Also
Reference
StringHolder Class
Rhino.Runtime.InteropWrappers Namespace