RhinoCommon API
PlaneIntersectionCache Methods
The PlaneIntersectionCache type exposes the following members.
Methods
Name | Description
Clear
 Removes all entries, and releases the geometry the cache kept alive.
Dispose
 Releases the native cache.
Finalize
 Releases the native cache.
 (Overrides Object.Finalize().)
Top
See Also
Reference
PlaneIntersectionCache Class
Rhino.Geometry.Intersect Namespace