RhinoCommon API
NodeInCodeTable Methods
The NodeInCodeTable type exposes the following members.
Methods
Name | Description
Add
 Adds, or replaces a new instance of component function information.
Contains
 Check whether node is registered in this table or not
GetDynamicMemberNames
 Returns all additional names in the table.
 (Overrides DynamicObject.GetDynamicMemberNames().)
GetDynamicMembers
 Returns component info for all additional names in the table.
TryGetIndex
 Gets the ComponentFunctionInfo at
 (Overrides DynamicObject.TryGetIndex(GetIndexBinder, Object[], Object).)
TryGetMember
 Dynamically binds the table to property-like access via its item names.
 (Overrides DynamicObject.TryGetMember(GetMemberBinder, Object).)
TryInvokeMember
 Dynamically invokes a member of the table.
 (Overrides DynamicObject.TryInvokeMember(InvokeMemberBinder, Object[], Object).)
Top
See Also
Reference
NodeInCodeTable Class
Rhino.NodeInCode Namespace