RhinoCommon API
PlaneSurface Methods
The PlaneSurface type exposes the following members.
Methods
Name | Description
CreateThroughBox(Plane, BoundingBox)
 Create a plane that contains the intersection of a bounding box.
CreateThroughBox(Line, Vector3d, BoundingBox)
 Create a plane that contains the intersection of a bounding box.
GetExtents
 Gets the extents of the plane surface.
SetExtents
 Sets the extents of the plane surface.
ToMesh
 Computes a polygon mesh of the surface made of one quad.
Top
See Also
Reference
PlaneSurface Class
Rhino.Geometry Namespace