RhinoCommon API
Markup Methods
The Markup type exposes the following members.
Methods
Name | Description
CopyToClipboard
ReadRevisionHistory
Thumbnail
WriteToFile
Top
See Also
Reference
Markup Class
Rhino.DocObjects Namespace