RhinoCommon API
Extrusion Methods
The Extrusion type exposes the following members.
Methods
Name | Description
AddInnerProfile
 Adds an inner profile.
Create(Curve, Double, Boolean)
 Creates an extrusion of a 3d curve (which must be planar) and a height.
Create(Curve, Plane, Double, Boolean)
 Create an extrusion from a 3d curve, a plane and a height.
CreateBoxExtrusion
 Gets an extrusion from a box.
CreateCylinderExtrusion
 Gets an extrusion form of a cylinder.
CreatePipeExtrusion
 Gets an extrusion form of a pipe.
GetBrepFormComponentIndex
 Convert a component index that identifies a part of this extrusion to a component index that identifies a part of the Brep created by Extrusion.ToBrep(false).
GetMesh
 Obtains a reference to a specified type of mesh for this extrusion.
GetPathPlane
 Gets the 3D plane perpendicular to the path at a normalized path parameter.
GetProfilePlane
 Gets the 3D plane containing the profile curve at a normalized path parameter.
GetProfileTransformation
 Gets the transformation that maps the XY profile curve to its 3d location.
GetWireframe
 Constructs all the Wireframe curves for this Extrusion.
PathLineCurve
 Gets the line-like curve that is the conceptual axis of the extrusion.
Profile3d(ComponentIndex)
 Gets one of the profiles.
Profile3d(Int32, Double)
 Gets a transversal isocurve of the extruded profile.
ProfileIndex
 Gets the index of the profile curve at a domain related to a parameter.
SetMesh
 Sets a specified type of mesh for this extrusion.
SetOuterProfile
 Sets the outer profile of the extrusion.
SetPathAndUp
 Allows to set the two points at the extremes and the up vector.
ToBrep(Boolean)
 Constructs a brep form of the extrusion. The outer profile is always the first face of the brep. If there are inner profiles, additional brep faces are created for each profile. If the outer profile is closed, then end caps are added as the last two faces of the brep.
WallEdge
 Gets one of the longitudinal curves along the beam or extrusion.
WallSurface
 Gets one of the longitudinal surfaces of the extrusion.
Top
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace