RhinoCommon API
File3dmEmbeddedFile Methods
The File3dmEmbeddedFile type exposes the following members.
Methods
Name | Description
SaveToFile
 Saves the contents of the embedded file to a local file. Returns true if successful, else false.
Top
See Also
Reference
File3dmEmbeddedFile Class
Rhino.FileIO Namespace