RhinoCommon API
RhinoPageInterop Methods
The RhinoPageInterop type exposes the following members.
Methods
Name | Description
NewPropertiesPanelPagePointer
 For internal use only, provides access to unmanaged core
StackedDialogPageFromUnmanagedPointer
 For internal use only, provides access to unmanaged core
Top
See Also
Reference
RhinoPageInterop Class
Rhino.UI Namespace