RhinoCommon API
MeshVertexNormalList Methods
The MeshVertexNormalList type exposes the following members.
Methods
Name | Description
Add(Vector3d)
 Adds a new vertex normal at the end of the list.
Add(Vector3f)
 Adds a new vertex normal at the end of the list.
Add(Double, Double, Double)
 Adds a new vertex normal at the end of the list.
Add(Single, Single, Single)
 Adds a new vertex normal at the end of the list.
AddRange
 Appends a collection of normal vectors.
Clear
 Clears the vertex normal collection on the mesh.
ComputeNormals
 Computes the vertex normals based on the physical shape of the mesh.
Destroy
 Releases all memory allocated to store vertex normals. The list capacity will be 0 after this call.
Subsequent calls can add new items.
Flip
 Reverses direction of all vertex normals
This is the same as Mesh.Flip(true, false, false)
GetEnumerator
 Gets an enumerator that yields all normals (vectors) in this collection.
SetNormal(Int32, Vector3d)
 Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.
If [index] equals [Count], a new vertex normal is appended to the end of the list.
If [index] is larger than [Count], the function will return false.
SetNormal(Int32, Vector3f)
 Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.
If [index] equals [Count], a new vertex normal is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
SetNormal(Int32, Double, Double, Double)
 Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.
If [index] equals [Count], a new vertex normal is appended to the end of the list.
If [index] is larger than [Count], the function will return false.
SetNormal(Int32, Single, Single, Single)
 Sets or adds a normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.
If [index] equals [Count], a new vertex normal is appended to the end of the list.
If [index] is larger than [Count], the function will return false.
SetNormals
 Sets all normal vectors in one go. This method destroys the current normal array if it exists.
ToFloatArray
 Copies all vertex normals to a linear array of float in x,y,z order
UnitizeNormals
 Unitizes all vertex normals.
Top
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace