RhinoCommon API
LightArray Methods
The LightArray type exposes the following members.
Methods
Name | Description
Append
Count
Dispose
ElementAt
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
LightArray Class
Rhino.Render Namespace