RhinoCommon API
CollapsibleSectionViewModel Methods
The CollapsibleSectionViewModel type exposes the following members.
Methods
Name | Description
Commit
Discard
GetData
 Call for an interface to data
UndoHelper
 Helper function to ease the use of undo records
Top
See Also
Reference
CollapsibleSectionViewModel Class
Rhino.UI.Controls Namespace