RhinoCommon API
UndoRecord Methods
The UndoRecord type exposes the following members.
Methods
Name | Description
Dispose()
 UndoRecord Dispose
Dispose(Boolean)
 UndoRecord Dispose
Finalize
 UndoRecord Destructor
 (Overrides Object.Finalize().)
Top
See Also
Reference
UndoRecord Class
Rhino.UI.Controls Namespace