RhinoCommon API
Worksession Methods
The Worksession type exposes the following members.
Methods
Name | Description
Attach(IEnumerable<String>)
 Attaches several models to this worksession as reference models.
Attach(String)
 Attaches a model to this worksession as a reference model.
Detach(IEnumerable<UInt32>)
 Detaches several reference models from this worksession.
Detach(UInt32)
 Detaches a reference model from this worksession.
FileNameFromRuntimeSerialNumber
 Returns the path to the open worksession, or .rws, file. If there is no worksession file open, or the active worksession has not yet been saved, then null is returned.
GetLockInformation
 Describes whether a worksession model's file is locked, and by whom.
GetModels
 The models in this worksession, including the active model.
ModelPathFromSerialNumber
 Returns the path to a model, used by the worksession, given a reference model serial number
Open
 Opens a worksession (.rws) file.
Save
 Saves this worksession to its existing .rws file.
SaveAs
 Saves this worksession to a .rws file.
SetActiveModel
 Makes one of this worksession's reference models the active model.
Update
 Re-reads a reference model whose file has changed on disk.
UpdateAll
 Re-reads every reference model in this worksession whose file has changed on disk.
Top
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace