RhinoCommon API
UserDataListEnumerator Methods
The UserDataListEnumerator type exposes the following members.
Methods
Name | Description
Dispose
 Implement Dispose(). NOP.
MoveNext
 Advance enumerator to next UserData item.
Reset
 Reset the enumerator
Top
See Also
Reference
UserDataListEnumerator Class
Rhino.DocObjects.Custom Namespace