RhinoCommon API
ClippingPlaneObject Methods
The ClippingPlaneObject type exposes the following members.
Methods
Name | Description
AddClipViewport
 Adds a viewport to the list of viewports that this clipping plane clips.
ObjectParticipates
 Determines whether an object is clipped by this clipping plane, taking the clip participation (inclusion/exclusion) lists into account. This is the same test the display uses.
RemoveClipViewport
 Removes a viewport from the list of viewports that this clipping plane clips.
Top
See Also
Reference
ClippingPlaneObject Class
Rhino.DocObjects Namespace