RhinoCommon API
DisplayMaterial Methods
The DisplayMaterial type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
GetBitmapTexture
GetBumpTexture
 Gets the bump texture for this display material.
GetEnvironmentTexture
GetTransparencyTexture
SetBitmapTexture(String, Boolean)
SetBitmapTexture(Texture, Boolean)
SetBitmapTexture(String, Bitmap, Boolean)
 Uses the pixels of an in-memory bitmap as this material's bitmap texture, without writing an image file.
 The pixels are copied into TextureCache under name. Calling this again with the same name replaces them in place, and the change shows up on the next redraw.
SetBumpTexture(String, Boolean)
SetBumpTexture(Texture, Boolean)
SetEnvironmentTexture(String, Boolean)
SetEnvironmentTexture(Texture, Boolean)
SetTransparencyTexture(String, Boolean)
SetTransparencyTexture(Texture, Boolean)
Top
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace