RhinoCommon API
CustomRenderMeshProvider Methods
The CustomRenderMeshProvider type exposes the following members.
Methods
Name | Description
AllObjectsChanged() |  Obsolete.
 Call this method if your render meshes change.
AllObjectsChanged(RhinoDoc)
 Call this method if your render meshes change.
BoundingBox(ViewportInfo, RhinoObject, Guid, Boolean)
 Returns a bounding box for the custom render meshes for the given object.
BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes)
BuildCustomMeshes
 Build custom render mesh(es).
DocumentBasedMeshesChanged
ObjectChanged
RegisterProviders
 Call this method once from your plug-ins OnLoad override for each assembly containing a custom mesh provider. Only publicly exported classes derived from CustomRenderMeshProvider with a public constructor that has no parameters will get registered.
WillBuildCustomMeshes
 Determines if custom render meshes will be built for a particular object.
Top
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace