RhinoCommon API
RenderMeshes Methods
The RenderMeshes type exposes the following members.
Methods
Name | Description
AddInstance
 Adds a new instance to the render primitives collection.
Dispose()
 Dispose this collection
Dispose(Boolean)
 Dispose
Finalize
 Finalizer for this collection
 (Overrides Object.Finalize().)
GetEnumerator
 Return an object to iterator over the instances in the collection
GetHashCode
 Overrides default hash code function - just returns Hash
 (Overrides Object.GetHashCode().)
Top
See Also
Reference
RenderMeshes Class
Rhino.Render.CustomRenderMeshes Namespace