RhinoCommon API
FontTable Methods
The FontTable type exposes the following members.
Methods
Name | Description
FindOrCreate(String, Boolean, Boolean)
 Get a DimensionStyle with the specified characteristics the settings other than face, bold and italic are copied from the current style
FindOrCreate(String, Boolean, Boolean, DimensionStyle)
 Get a DimensionStyle with the specified characteristics
GetEnumerator
Top
See Also
Reference
FontTable Class
Rhino.DocObjects.Tables Namespace