RhinoCommon API
FileReference Methods
The FileReference type exposes the following members.
Methods
Name | Description
CreateFromFullAndRelativePaths
 Returns a new file reference. This returns a new instance even if the path does not exist.
CreateFromFullPath
 Returns a new file reference. This returns a new instance even if the path does not exist.
Dispose
 Reclaims unmanaged resources used by this object.
Finalize
 (Overrides Object.Finalize().)
Top
See Also
Reference
FileReference Class
Rhino.FileIO Namespace