RhinoCommon API
Cone Methods
The Cone type exposes the following members.
Methods
Name | Description
AngleInDegrees
 Computes the angle (in degrees) between the axis and the side of the cone. The angle and the height have the same sign.
AngleInRadians
 Computes the angle (in radians) between the axis and the side of the cone. The angle and the height have the same sign.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
ToBrep
 Gets a Brep representation of the cone with a single face for the cone, an edge along the cone seam, and vertices at the base and apex ends of this seam edge. The optional cap is a single face with one circular edge starting and ending at the base vertex.
ToNurbsSurface
 Constructs a Nurbs surface representation of this Cone. This is synonymous with calling NurbsSurface.CreateFromCone().
ToRevSurface
 Constructs a RevSurface representation of this Cone. This is synonymous with calling RevSurface.CreateFromCone().
Top
See Also
Reference
Cone Structure
Rhino.Geometry Namespace