RhinoCommon API
ToolbarFileCollection Methods
The ToolbarFileCollection type exposes the following members.
Methods
Name | Description
FindByName
 Gets an open toolbar file by name, or alias.
FindByPath
 Gets an open toolbar by full path.
GetEnumerator
 Gets a toolbar file enumerator.
Open
 Opens a toolbar file.
Top
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace