RhinoCommon API
File3dmViewTable Methods
The File3dmViewTable type exposes the following members.
Methods
Name | Description
Add
 Adds a
Clear
 Removes all items from the table.
Contains
 Returns an indication of the presence of a view in the table.
CopyTo
 Copies the content of the table to an array.
Delete(Int32)
 Removes an item.
Delete(ViewInfo)
 Deletes an item.
FindName
 Finds a ViewInfo given its name.
GetEnumerator
 Returns an enumerator that yields all views in the table.
IndexOf
 Returns the index of the current ViewInfo.
Top
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace