RhinoCommon API
FileStl Methods
The FileStl type exposes the following members.
Methods
Name | Description
Read
Read a STL file into a RhinoDoc
Write
Write a STL file based on the contents of a RhinoDoc
Top
See Also
Reference
FileStl Class
Rhino.FileIO Namespace