RhinoCommon API
OptionDouble Methods
The OptionDouble type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
OptionDouble Class
Rhino.Input.Custom Namespace