RhinoCommon API
GetObject Methods
The GetObject type exposes the following members.
Methods
Name | Description
ActiveGetObject
 Get the currently running GetObject for a given document
AppendToPickList
ClearObjects
 Clear possible special object drawing
CustomGeometryFilter
 Checks geometry to see if it can be selected. Override to provide fancy filtering.
DisablePreSelect
EnableClearObjectsOnEntry
 By default the picked object list is cleared when GetObject.GetObjects() is called. If you are reusing a GetObject class and do not want the existing object list cleared when you call Input, then call EnableClearObjectsOnEntry(false) before calling GetObjects().
EnableHighlight
 By default, any object post-pick selected by GetObjects() is highlighted. If you want to post-pick objects and not have them automatically highlight, then call EnableHighlight = false.
EnableIgnoreGrips
 By default, post selection will select objects with grips on. If you do not want to be able to post select objects with grips on, then call EnableIgnoreGrips = false. The ability to preselect an object with grips on is determined by the value returned by the virtual RhinoObject.IsSelectableWithGripsOn.
EnablePostSelect
 Control the availability of post selection in GetObjects.
EnablePreSelect
 Control the pre-selection behavior GetObjects.
EnablePressEnterWhenDonePrompt
 By default, when GetObject.GetObjects is called with minimumNumber > 0 and maximumNumber = 0, the command prompt automatically includes "Press Enter when done" after the user has selected at least minimumNumber of objects. If you want to prohibit the addition of the "Press Enter when done", then call EnablePressEnterWhenDonePrompt = false;
EnableSelPrevious
 By default, any object selected during a command becomes part of the "previous selection set" and can be reselected by the SelPrev command. If you need to select objects but do not want them to be selected by a subsequent call to SelPrev, then call EnableSelPrev = false.
EnableUnselectObjectsOnExit
 By default any objects in the object list are unselected when GetObject.GetObjects() exits with any return code besides Object. If you want to leave the objects selected when non-object input is returned, then call EnableUnselectObjectsOnExit(false) before calling GetObjects().
Get
 Call to select a single object.
GetMultiple
Call to select objects.
Object
Objects
PassesGeometryAttributeFilter
 Checks geometry to see if it passes the basic GeometryAttributeFilter.
SetCustomGeometryFilter
 Set filter callback function that will be called by the CustomGeometryFilter
SetPressEnterWhenDonePrompt
 The default prompt when EnablePressEnterWhenDonePrompt is enabled is "Press Enter when done". Use this function to specify a different string to be appended.
Top
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace