RhinoCommon API
AppearanceSettings Methods
The AppearanceSettings type exposes the following members.
Methods
Name | Description
DefaultPaintColor(PaintColor)
 Get a default paint color for Rhino. The current paint color may be different than the default
DefaultPaintColor(PaintColor, Boolean)
 Get a default paint color for Rhino. The current paint color may be different than the default
DefaultWidgetColor
 Get a default widget color for Rhino. The current widget color may be different than the default
GetCurrentState
 Gets the current settings of the application.
GetDefaultState()
 Gets the factory settings of the application.
GetDefaultState(Boolean)
 Gets the factory settings of the application.
GetPaintColor(PaintColor)
 Gets the color that is currently associated with a paint color.
GetPaintColor(PaintColor, Boolean)
 Gat a paint color. This overload provides a compute option for cases where colors are computed when they are "unset" colors.
GetWidgetColor
 Gets the .Net library color that is currently associated with a widget color.
InitialMainWindowPosition
 Location where the Main Rhino window attempts to show when the application is first started.
RestoreDefaults
 Commits the default settings as the current settings.
SetPaintColor(PaintColor, Color)
 Sets the logical paint color association to a specific .Net library color, without forced UI update.
SetPaintColor(PaintColor, Color, Boolean)
 Sets the logical paint color association to a specific .Net library color.
SetToDarkMode
Set UI to the default dark mode color scheme
SetToLightMode
Set UI to the default light mode color scheme
SetWidgetColor(WidgetColor, Color)
 Sets the logical widget color association to a specific .Net library color, without forced UI update.
SetWidgetColor(WidgetColor, Color, Boolean)
 Sets the logical widget color association to a specific .Net library color.
UpdateFromState
 Sets all settings to a particular defined joined state.
UsingDefaultDarkModeColors
 Determine if Rhino is running with default dark mode color settings
UsingDefaultLightModeColors
 Determine if Rhino is running with default light mode color settings
Top
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace