RhinoCommon API
Arc Methods
The Arc type exposes the following members.
Methods
Name | Description
BoundingBox
 Computes the 3D axis aligned bounding box for this arc.
ClosestParameter
 Gets parameter on the arc closest to a test point.
ClosestPoint
 Computes the point on an arc that is closest to a test point.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Arc)
 Determines whether another arc has the same value as this arc.
Equals(Object)
 Determines whether another object is an arc and has the same value as this arc.
 (Overrides ValueType.Equals(Object).)
GetHashCode
 Computes a hash code for the present arc.
 (Overrides ValueType.GetHashCode().)
PointAt
 Gets the point at the given arc parameter.
Reverse
 Reverses the orientation of the arc. Changes the domain from [a,b] to [-b,-a].
TangentAt
 Gets the tangent at the given parameter.
ToNurbsCurve()
 Initializes a nurbs curve representation of this arc. This amounts to the same as calling NurbsCurve.CreateFromArc().
ToNurbsCurve(Int32, Int32)
 Create a uniform non-rational cubic NURBS approximation of an arc.
Transform
 Transforms the arc using a Transformation matrix.
Trim
 Sets the arc's angle domain (in radians) to the specified interval, provided it is increasing and its length does not exceed 2.0 * Math.PI (plus a small tolerance). If the interval length exceeds 2.0 * Math.PI it will be clamped to exactly 2.0 * Math.PI. Returns true if the domain was set successfully, false otherwise.
Top
See Also
Reference
Arc Structure
Rhino.Geometry Namespace