RhinoCommon API
InitFrameBufferEventArgs Methods
The InitFrameBufferEventArgs type exposes the following members.
Methods
Name | Description
SetFill(Color)
SetFill(Color, Color)
SetFill(Color, Color, Color, Color)
Top
See Also
Reference
InitFrameBufferEventArgs Class
Rhino.Display Namespace