RhinoCommon API
DisplayAttributeMaterial Methods
The DisplayAttributeMaterial type exposes the following members.
Methods
Name | Description
GetTexture
 Gets the texture of the given type, or null when this material has none.
GetTextures
 Gets every texture this material uses.
RemoveTexture
 Removes every texture of the given type.
SetTexture
 Assigns a texture, replacing any texture this material already has of the same type.
Top
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace