RhinoCommon API
SurfaceDirectionIndicators Methods
The SurfaceDirectionIndicators type exposes the following members.
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Draw
 Draw the surface directions.
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
SurfaceDirectionIndicators Class
Rhino.Geometry Namespace