RhinoCommon API
ViewSettings Methods
The ViewSettings type exposes the following members.
Methods
Name | Description
GetCurrentState
 Gets the current settings.
GetDefaultState
 Gets the view factory settings.
RestoreDefaults
 Updates from the default setting state.
UpdateFromState
 Updates from a particular setting state.
Top
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace