RhinoCommon API
Transform2d Methods
The Transform2d type exposes the following members.
Methods
Name | Description
Clone
 Returns a deep copy of the transform. For languages that treat structures as value types, this can be accomplished by a simple assignment.
CompareTo
 Compares this transform with another transform.
M00 has highest value, then M01, etc..
Equals(Object)
 Determines if another object is a Transform2d and its value equals this transform value.
 (Overrides ValueType.Equals(Object).)
Equals(Transform2d)
 Determines if another transform equals this transform value.
FromAffineElements(Double[])
 Creates a transform from an array of six coefficients in (a, b, c, d, tx, ty) order.
FromAffineElements(Single[])
 Creates a transform from an array of six coefficients in (a, b, c, d, tx, ty) order.
FromAffineElements(Double, Double, Double, Double, Double, Double)
 Creates a transform from the six coefficients used by the traditional 2d drawing APIs. See the remarks on ToAffineElements().
GetAffineElements
 Gets the six coefficients used by the traditional 2d drawing APIs. See the remarks on ToAffineElements().
GetHashCode
 Gets a non-unique hashing code for this transform.
 (Overrides ValueType.GetHashCode().)
Multiply
 Multiplies (combines) two transformations.
This is the same as the * operator between two transformations.
Rotation(Double)
 Constructs a new rotation transformation with the origin as the rotation center.
Rotation(Double, Point2d)
 Constructs a new rotation transformation with a specified rotation center.
Rotation(Double, Double, Point2d)
 Constructs a new rotation transformation from the sine and cosine of an angle and a specified rotation center.
Rotation(Vector2d, Vector2d, Point2d)
 Constructs the rotation that maps one direction onto another while fixing a rotation center.
Scale(Point2d, Double)
 Constructs a new uniform scaling transformation with a specified anchor point.
Scale(Point2d, Double, Double)
 Constructs a new non-uniform scaling transformation with a specified anchor point.
ToAffineElements
 Gets the six coefficients used by the traditional 2d drawing APIs as an array in (a, b, c, d, tx, ty) order.
ToString
 Returns a string representation of this transform.
 (Overrides ValueType.ToString().)
ToTransform
 Gets the 4x4 transformation that applies this 2d transformation to the x and y coordinates and leaves the z coordinate unchanged.
Translation(Vector2d)
 Constructs a new translation (move) transformation.
Translation(Double, Double)
 Constructs a new translation (move) transformation. Right column is (dx, dy).
TryGetInverse
 Attempts to get the inverse transform of this transform.
TryGetTransform2d(Transform, Transform2d)
 Attempts to get the 2d transformation defined by the x and y rows and columns of a 4x4 transformation. This succeeds when transform is affine and maps the world xy plane to itself.
TryGetTransform2d(Transform, Double, Transform2d)
 Attempts to get the 2d transformation defined by the x and y rows and columns of a 4x4 transformation. This succeeds when transform is affine and maps the world xy plane to itself.
Top
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace