RhinoCommon API
LightManagerSupportClient Methods
The LightManagerSupportClient type exposes the following members.
Methods
Name | Description
DeleteLight
Dispose
Finalize |  (Overrides Object.Finalize().)
GetLightFromId
GetLights
GetLightSolo
GroupLights
LightDescription
LightsInSoloStorage
ModifyLight
ObjectFromLight
OnEditLight
SetLightSolo
UnGroup
Top
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace