RhinoCommon API
FileAi Methods
The FileAi type exposes the following members.
Methods
Name | Description
Read
Read a Ai file into a RhinoDoc
Write
Write a Ai file based on the contents of a RhinoDoc
Top
See Also
Reference
FileAi Class
Rhino.FileIO Namespace