RhinoCommon API
FileRaw Methods
The FileRaw type exposes the following members.
Methods
Name | Description
Read
Read a raw file into a RhinoDoc
Write
Write a raw file based on the contents of a RhinoDoc
Top
See Also
Reference
FileRaw Class
Rhino.FileIO Namespace