RhinoCommon API
HistoryRecord Methods
The HistoryRecord type exposes the following members.
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
SetBool
SetBools
SetBrep
SetColor
SetColors
SetCurve
SetDouble
SetDoubles
SetGuid
SetGuids
SetHistoryVersion
 Specifies a non-zero integer that identifies the version of this history record. The virtual ReplayHistory() functions can check this version to avoid replaying history using information created by earlier versions of the command.
SetInt
SetInts
SetMesh
SetObjRef
SetPoint3d
SetPoint3dOnObject
SetPoint3ds
SetString
SetStrings
SetSurface
SetTransorm
SetVector3d
SetVector3ds
Top
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace