RhinoCommon API
WorksessionFileModel Methods
The WorksessionFileModel type exposes the following members.
Methods
Name | Description
AddLayerOverride
Adds a copy of a layer override to the end of the list.
ClearLayerOverrides
Removes all of the layer overrides.
Dispose
Releases the native model.
Finalize
Releases the native model.
 (Overrides Object.Finalize().)
GetLayerOverride
Gets a copy of a layer override.
GetLayerOverrides
Gets copies of all of the layer overrides.
GetParentLayerValues
 Gets a copy of the settings of the layer Rhino adds as the parent of all of a reference model's layers. Version 4 files do not have them.
RemoveLayerOverrideAt
Removes a layer override.
SetLayerOverride
Replaces a layer override with a copy of another.
SetParentLayerValues
Replaces the parent layer settings with a copy of values.
Top
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace