RhinoCommon API
FileSlc Methods
The FileSlc type exposes the following members.
Methods
Name | Description
Write
Write a SLC file based on the contents of a RhinoDoc
Top
See Also
Reference
FileSlc Class
Rhino.FileIO Namespace