RhinoCommon API
WorldMapDayNight Methods
The WorldMapDayNight type exposes the following members.
Methods
Name | Description
Dispose
Finalize |  (Overrides Object.Finalize().)
HasMapForCurrentSettings
LocationToMap
MakeMapBitmap
Map
MapToLocation
SetDayNightDisplay
SetEnabled
SetTimeInfo
Top
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace