RhinoCommon API
RebuildCurveOptions Methods
The RebuildCurveOptions type exposes the following members.
Methods
Name | Description
CalculateInitialPreview
 When the rebuild options are presented in a dialog, the initial rebuild calculation is deferred so that the dialog appears immediately instead of after that calculation finishes. The dialog calls this one time, after it is on the screen, and the initial calculation and the first dynamic preview happen then. The dialog must update itself from these options when this returns. The calculation fills in the current output properties and it can increase the point count when kink splitting needs more points than the current settings specify. Calling this when no initial calculation is pending does nothing.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize |  (Overrides Object.Finalize().)
IntensityToInt
IntToIntensity
IntToKinkSplitting
KinkSplittingToInt
SetPointCountRange
 If PointCountRangePermitted is true, then the user interface may use SetPointCountRange(min,max,tolerance) to specify a range of acceptable point counts. Otherwise using PointCount to specify a single point count value.
Top
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace