RhinoCommon API
MeshVertexStatusList Methods
The MeshVertexStatusList type exposes the following members.
Methods
Name | Description
Add
 Adds a new flag at the end of the list.
AddRange
 Appends an array, a list or any enumerable of flags to the end of the list.
Clear
 Clears the hidden vertex list on the mesh. This results in a fully visible mesh.
Contains
 Determines if some vertices are hidden or some are shown.
CopyTo
 Copies to an array, starting at an index.
Destroy
 Releases all memory allocated to store hidden vertices. The list capacity will be 0 after this call.
Vertices will be immediately considered visible.
Subsequent calls can add new items.
GetEnumerator
 Gets an enumerator that yields all flags in this collection.
Top
See Also
Reference
MeshVertexStatusList Class
Rhino.Geometry.Collections Namespace