RhinoCommon API
Point4dField Methods
The Point4dField type exposes the following members.
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
Point4dField Class
Rhino.Render.Fields Namespace