RhinoCommon API
SimulatedTexture Methods
The SimulatedTexture type exposes the following members.
Methods
Name | Description
ConstPointer
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
MetersToUnits(Double) |  Obsolete.
MetersToUnits(RhinoDoc, Double)
SetMappingChannelAndProjectionMode
Texture
UnitsToMeters(Double) |  Obsolete.
UnitsToMeters(RhinoDoc, Double)
Top
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace