RhinoCommon API
MaterialTable Methods
The MaterialTable type exposes the following members.
Methods
Name | Description
Add()
 Adds a new material to the table based on the default material.
Add(Material)
 Adds a new material to the table based on a given material.
Add(Material, Boolean)
 Adds a new material to the table based on a given material.
Delete |  (Overrides CommonComponentTable<T>.Delete(T).)
DeleteAt
 Removes a material at a specific position from this material table.
Find(Guid, Boolean)
Finds a material with a matching id.
Find(Material, Boolean)
 Finds a material index.
Find(String, Boolean)
 Finds a material with a given name.
FindIndex
 Retrieves a Material object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
Modify
Modify material settings.
ResetMaterial
Top
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace