RhinoCommon API
NurbsCurveFitParameters Methods
The NurbsCurveFitParameters type exposes the following members.
Methods
Name | Description
Clone
 Supports the ICloneable inteface and creates a new NurbsCurveFitParameters object with the same property values as this instance.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetCurvatureBiasCoefficientFromIntensity
 Returns the Curvature bias coefficient that corresponds to a given NurbsCurveFitParameters.Intensity value.
GetCurvatureBiasIntensityFromCoefficient
 Returns the NurbsCurveFitParameters.Intensity value that corresponds to a given curvature bias coefficient.
GetPointCountRange
 Get the point count range and tolerance.
GetSmoothingCoefficientFromIntensity
 Returns the smoothing coefficient that corresponds to a given NurbsCurveFitParameters.Intensity value.
GetSmoothingIntensityFromCoefficient
 Returns the NurbsCurveFitParameters.Intensity value that corresponds to a given smoothing coefficient.
GetUniformityCoefficientFromIntensity
 Returns the uniformity coefficient that corresponds to a given NurbsCurveFitParameters.Intensity value.
GetUniformityIntensityFromCoefficient
 Returns the NurbsCurveFitParameters.Intensity value that corresponds to a given uniformity coefficient.
MaximumPointCountForDegree
 Given a point count and periodic setting, determine the maximum degree.
MinimumPointCountForDegree
 Give a degree and periodic setting, determine the minimum point count.
SetPointCountRange(Int32, Int32)
 Set the point count range and tolerance.
SetPointCountRange(Int32, Int32, Double)
 Set the point count range and tolerance.
ValidInput
 returns true if the input values are within the acceptable ranges for NURBS curve fitting. If false is returned, the input values should be adjusted before calling the curve fitting function. See also MinimumPointCountForDegree() and MaximumPointCountForDegree().
Top
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace