RhinoCommon API
FloatField Methods
The FloatField type exposes the following members.
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
FloatField Class
Rhino.Render.Fields Namespace