RhinoCommon API
AngularDimension Methods
The AngularDimension type exposes the following members.
Methods
Name | Description
AdjustFromPoints(Plane, Point3d, Point3d, Point3d, Point3d)
 Updates dimension geometry from point locations.
AdjustFromPoints(Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Update angular dimension from point locations.
Create(DimensionStyle, Line, Point3d, Line, Point3d, Point3d, Boolean)
 The angle between the lines is dimensioned. If the lines intersect in a single point, that point is used as the center of the angular dimension arc.In this case, there are eight possible angles to dimension.The pointOnAngularDimensionArc and pointOnLine parameters are used to select the correct angle to dimension. If a pointOnLine parameter is not set, the corresponding line's midpoint is used. If the lines are colinear, the point on the line closest to pointOnAngularDimensionArc is the center of the angular dimension arc.
Create(DimensionStyle, Plane, Vector3d, Point3d, Point3d, Point3d, Point3d)
 Creates an angular dimension with extension lines starting at plane origin (arc center).
Create(Guid, Plane, Point3d, Point3d, Point3d, Point3d, Point3d) |  Obsolete.
Create(DimensionStyle, Plane, Vector3d, Point3d, Point3d, Point3d, Point3d, Point3d)
 Creates an angular dimension from parameters.
Get3dPoints
 Get locations of dimension's 3d points
GetAngleDisplayText
GetDisplayLines
GetTextRectangle
Top
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace