RhinoCommon API
PreviewGeometry Methods
The PreviewGeometry type exposes the following members.
Methods
Name | Description
ElementKind
 ElementKind
SetUpPreview
 SetUpPreview
Top
See Also
Reference
PreviewGeometry Class
Rhino.Render Namespace