RhinoCommon API
FileX_TWriteOptions Methods
The FileX_TWriteOptions type exposes the following members.
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
FileX_TWriteOptions Class
Rhino.FileIO Namespace