RhinoCommon API
File3dmStringTable Methods
The File3dmStringTable type exposes the following members.
Methods
Name | Description
Delete(String)
 Removes a document string from the 3dm file.
Delete(String, String)
 Removes document strings from the 3dm file.
GetEntryNames
 Return list of all entry names for a given section of document strings in the 3dm file.
GetKey
 Returns a key value at a given index.
GetSectionNames
 Returns a list of all the section names for document strings in the 3dm file.
By default a section name is a key that is prefixed with a string separated by a backslash.
GetValue(Int32)
 Returns a string value at a given index.
GetValue(String)
 Returns a string value at a key.
GetValue(String, String)
 Returns a string value given a section and entry.
SetString(String, String)
 Adds or sets a document string in the 3dm file.
SetString(String, String, String)
 Adds or sets a document string in the 3dm file.
Top
See Also
Reference
File3dmStringTable Class
Rhino.FileIO Namespace