RhinoCommon API
ICollapsibleSectionHolder2 Methods
The ICollapsibleSectionHolder2 type exposes the following members.
Methods
Name | Description
EnableHeaderButton
SetFullHeightSection
ShowHeaderButton
Top
See Also
Reference
ICollapsibleSectionHolder2 Interface
Rhino.UI.Controls Namespace