RhinoCommon API
FileGHSReadOptions Methods
The FileGHSReadOptions type exposes the following members.
Methods
Name | Description
ToDictionary
Top
See Also
Reference
FileGHSReadOptions Class
Rhino.FileIO Namespace