RhinoCommon API
PageViewGroupTable Methods
The PageViewGroupTable type exposes the following members.
Methods
Name | Description
Add()
 Adds a new page view group to the table. The new page view group will be given a unique name.
Add(IEnumerable<RhinoPageView>)
 Adds a new page view group to the table, and adds page views to the group. The new page view group will be given a unique name.
Add(PageViewGroup)
 Adds a new page view group to the table.
Add(PageViewGroup, IEnumerable<RhinoPageView>)
 Adds a new page view group to the table, and adds page views to the group.
Delete(PageViewGroup)
 Deletes a page view group.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Guid, Boolean)
 Deletes a page view group.
Delete(Int32, Boolean)
 Deletes a page view group.
Delete(PageViewGroup, Boolean)
 Deletes a page view group.
FindIndex
 Finds a page view group given its index.
FindName
 Finds a page view group given its name.
FindNameHash
 Finds a page view group given its name hash.
GetEnumerator |  (Overrides CommonComponentTable<T>.GetEnumerator().)
GetSorted
 Gets an array of page view group indices that are sorted by the values of SortIndex.
GetUnusedName()
 Gets an unused page view group name.
GetUnusedName(String)
 Gets an unused page view group name.
Modify(PageViewGroup, Guid, Boolean)
 Modifies a page view group.
Modify(PageViewGroup, Int32, Boolean)
 Modifies a page view group.
Undelete(Guid)
 Undeletes a page view group that has been deleted.
Undelete(Int32)
 Undeletes a page view group that has been deleted.
UndoModify(Guid)
 If the page view group has been modified and the modification can be undone, then this will restore the page view group to its previous state.
UndoModify(Int32)
 If the page view group has been modified and the modification can be undone, then this will restore the page view group to its previous state.
UndoModify(Guid, UInt32)
 If the page view group has been modified and the modification can be undone, then this will restore the page view group to its previous state.
UndoModify(Int32, UInt32)
 If the page view group has been modified and the modification can be undone, then this will restore the page view group to its previous state.
Top
See Also
Reference
PageViewGroupTable Class
Rhino.DocObjects.Tables Namespace