RhinoCommon API
Decal Methods
The Decal type exposes the following members.
Methods
Name | Description
ConstPointer
Create
CustomData()
 Gets decal custom data for the current renderer. See Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
CustomData(Guid)
 Gets decal custom data for a specified renderer. See Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
GetTextureMapping
 Gets the Texture Mapping of the decal.
GetUVBounds
 The UV bounds of the decal. Only used when mapping is UV.
HorzSweep
 Gets the angles of the decal's arc of 'horizontal sweep'. Replaces StartLatitude and EndLatitude.
NonConstPointer
SetHorzSweep
 Sets the angles of the decal's arc of 'horizontal sweep'.
SetUVBounds
 Sets the UV bounds of the decal. Only used when mapping is UV.
SetVertSweep
 Sets the angles of the decal's arc of 'vertical sweep'.
TextureRenderCRC(TextureRenderHashFlags) |  Obsolete.
 This method is deprecated in favor of TextureRenderHash below.
TextureRenderCRC(TextureRenderHashFlags, LinearWorkflow) |  Obsolete.
 This method is deprecated in favor of TextureRenderHash below.
TextureRenderHash(CrcRenderHashFlags) |  Obsolete.
 Get the texture render hash for the referenced texture using the specified CrcRenderHashFlags.
TextureRenderHash(CrcRenderHashFlags, LinearWorkflow) |  Obsolete.
 Get the texture render hash for the referenced texture using the specified CrcRenderHashFlags and linear workflow.
TryGetColor
 Blend a color with the decal color at a given point. Please note that this function is very slow so you should only use it if you're not overly concerned about performance. Also please note that this function is actually a 'blend' operation, not a true 'get' operation and is sensitive to the value passed into the colInOut parameter. The alpha value of colInOut is used as the blend amount where 0 means 'all decal RGB' and 1 means 'all colInOut RGB'. If you want to simply GET the decal color, you must pass 0 for colInOut alpha.
UVBounds
 The UV bounds of the decal. Only used when mapping is UV.
VertSweep
 Gets the angles of the decal's arc of 'vertical sweep'. Replaces StartLongitude and EndLongitude.
Top
See Also
Reference
Decal Class
Rhino.Render Namespace