RhinoCommon API
CreatePreviewEventArgs Methods
The CreatePreviewEventArgs type exposes the following members.
Methods
Name | Description
SkipInitialisation
 Call this if you don't want the argument to handle data initialisation. This is for use with the ChangeQueue
Top
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace