RhinoCommon API
File3dmEmbeddedFiles Methods
The File3dmEmbeddedFiles type exposes the following members.
Methods
Name | Description
Add
 Add a new embedded file and load it from a local file.
GetEnumerator
Top
See Also
Reference
File3dmEmbeddedFiles Class
Rhino.FileIO Namespace