RhinoCommon API
PointCloudUnsafeLock Methods
The PointCloudUnsafeLock type exposes the following members.
Methods
Name | Description
ColorArray
 Retrieves a pointer to the raw array of colors, which are represented as 32-bit integers in ARGB format, or null if none is available.
NormalArray
 Retrieves a pointer to the raw array of point normals, or null if none is available.
PointArray
 Retrieves a pointer to the raw point array, which uses coordinates defined with double precision floating point numbers, or null if none is available.
Release
 Releases the lock and updates the underlying unmanaged data structures.
ValueArray
 Retrieves a pointer to the raw array of point values, or null if none is available.
Top
See Also
Reference
PointCloudUnsafeLock Class
Rhino.Geometry Namespace