RhinoCommon API
FileObjReadOptions Methods
The FileObjReadOptions type exposes the following members.
Methods
Name | Description
GetTransform
 Calculates the YToZ transform.
Top
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace