RhinoCommon API
ColorLCH Methods
The ColorLCH type exposes the following members.
Methods
Name | Description
CreateFromCMYK
 Create the nearest LCH equivalent of a CMYK color.
CreateFromHSL
 Create the nearest LCH equivalent of an HSL color.
CreateFromLAB
 Create the nearest LCH equivalent of a LAB color.
CreateFromRGBA
 Create the nearest LCH equivalent of an RGBA color.
CreateFromXYZ
 Create the nearest LCH equivalent of an XYZ color.
MakePositive
 Ensure the Chromaticity of this color is positive.
Top
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace