RhinoCommon API
NamedConstructionPlaneTable Methods
The NamedConstructionPlaneTable type exposes the following members.
Methods
Name | Description
Add(ConstructionPlane)
 Adds named construction plane to document.
Add(String, Plane)
 Adds named construction plane to document.
Delete(Int32)
 Remove named construction plane from the document.
Delete(String)
 Remove named construction plane from the document.
Find
Finds a named construction plane.
GetEnumerator
Top
See Also
Reference
NamedConstructionPlaneTable Class
Rhino.DocObjects.Tables Namespace