RhinoCommon API
HermiteSurface Methods
The HermiteSurface type exposes the following members.
Methods
Name | Description
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
PointAt
 Gets the interpolation point at the u,v parameter location.
SetPointAt
 Sets the interpolation point at the u,v parameter location.
SetTwistAt
 Set the twist direction (mixed second partial derivative) to interpolate at the u,v parameter location.
SetUParameterAt
 Sets the "u" parameter at an index. These parameters are strictly increasing.
SetUTangentAt
 Set the "u" tangent direction (actually first derivative) to interpolate at the u,v parameter location.
SetVParameterAt
 Sets the "v" parameter at an index. These parameters are strictly increasing.
SetVTangentAt
 Set the "v" tangent direction (actually first derivative) to interpolate at the u,v parameter location.
ToNurbsSurface
 Constructs a NURBS surface satisfying the Hermite interpolation conditions.
TwistAt
 Get the twist direction (mixed second partial derivative) to interpolate at the u,v parameter location.
UParameterAt
 Gets the "u" parameter at an index. These parameters are strictly increasing.
UTangentAt
 Get the "u" tangent direction (actually first derivative) to interpolate at the u,v parameter location.
VParameterAt
 Gets the "v" parameter at an index. These parameters are strictly increasing.
VTangentAt
 Get the "v" tangent direction (actually first derivative) to interpolate at the u,v parameter location.
Top
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace