RhinoCommon API
BrepObject Methods
The BrepObject type exposes the following members.
Methods
Name | Description
DuplicateBrepGeometry
 Constructs a new deep copy of the Brep geometry.
Top
See Also
Reference
BrepObject Class
Rhino.DocObjects Namespace