RhinoCommon API
StackedDialogPage Methods
The StackedDialogPage type exposes the following members.
Methods
Name | Description
AddChildPage
 Currently only supported on Windows. Call this method to add a child page to a page after the parent dialog has been created.
MakeActivePage
 Make this page the active, visible page
OnActivate
Called when this page is activated/deactivated.
OnApply
Called when stacked dialog OK button is pressed.
OnCancel
Called when stacked dialog Cancel button is pressed.
OnCreateParent
 Called when the parent window has been created on Windows platforms only.
OnDefaults
Called when stacked dialog Defaults button is pressed (see ShowDefaultsButton).
OnHelp
 Called when the parent dialog requests help for this page.
OnSizeParent
 Called when the parent window has been resized
RemovePage
 Remove this page from the dialog box
SetActivePageTo
SetEnglishPageTitle
 Change the title passed to the constructor and, this will cause LocalPageTitle to get called also.
Top
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace