RhinoCommon API
Interpolator Methods
The Interpolator type exposes the following members.
Methods
Name | Description
InterpolateCatmullRom
 Sample the list of numbers with Catmull-Rom interpolation.
InterpolateCosine
 Sample the list of numbers with cosine interpolation.
InterpolateCubic
 Sample the list of numbers with cubic interpolation.
InterpolateLinear
 Sample the list of numbers with linear interpolation.
InterpolateNearestNeighbour
 Sample the list of numbers with Nearest Neighbor interpolation.
Top
See Also
Reference
Interpolator Class
Rhino.Geometry Namespace