RhinoCommon API
LineCurve Methods
The LineCurve type exposes the following members.
Methods
Name | Description
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The NURBS Curves segments do not have fully multiple interior knots.
 3. Rational NURBS curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent co-linear or co-circular segments are combined.
Top
See Also
Reference
LineCurve Class
Rhino.Geometry Namespace