RhinoCommon API
DevelopableSrf Methods
The DevelopableSrf type exposes the following members.
Methods
Name | Description
GetLocalDevopableRuling
 Finds minimum twist ruling between 2 curves at local domains
RulingMinTwist(NurbsCurve, Double, NurbsCurve, Double, Interval, Double, Double)
 Find a ruling from rail0(t0) to rail1(t1_out) that has the least twist across the ruling with t1_out in domain1. max_cos_twist is cos(twist) for the returned ruling
RulingMinTwist(NurbsCurve, Double, Interval, NurbsCurve, Double, Interval, Double, Double, Double)
 Find a ruling from rail0(t0_out) to rail1(t1_out) that has the least twist across the ruling with t0_out in domain0 and t1_out in domain1. max_cos_twist is cos(twist) for the returned ruling
UntwistRulings
Top
See Also
Reference
DevelopableSrf Class
Rhino.Geometry Namespace