RhinoCommon API
ParticleSystem Methods
The ParticleSystem type exposes the following members.
Methods
Name | Description
Add
 Adds a particle to this ParticleSystem. A Particle can only be in one system at a time. If the Particle already exists in a different system, this function will return false. You should remove the particle from the other system first before adding it.
Clear
 Remove all Particles from this system.
GetEnumerator
Remove
 Removes a single particle from this system.
Update
 Calls Update on every particle in the system.
Top
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace