RhinoCommon API
ObjectPropertiesPage Methods
The ObjectPropertiesPage type exposes the following members.
Methods
Name | Description
AnySelectedObject<T>()
 Return true if any of the selected objects match the given type
AnySelectedObject<T>(Boolean)
 Return true if any of the selected objects match the given type
GetSelectedObjects(ObjectType)
 Get selected objects that match a given filter
GetSelectedObjects<T>()
 Get selected objects of a given type
InitializeControls |  Obsolete.
 Called on the active page after the selected objects list has changed to notify the page to initialize its content to reflect the new object list.
ModifyPage
 Call this method when the page is ready to modify the selected objects list. Rhino will suspend UpdatePageNotfictaion, call the passed action then restore UpdatePageNotfictaion.
OnActivate
Called when this page is activated/deactivated.
OnCreateParent
 Called when the parent container is initially created.
OnHelp
 Called when the F1 key or help button is pressed, override to display plug-in specific help for this page.
OnSizeParent
 Called when the parent containers client rectangle size has changed and the PageControl has been resized.
PageIcon
 Icon to display in the object properties tab control. Will not get called if PageIconEmbeddedResourceString is overridden and provides a string for a successfully loaded icon resource.
RunScript(ObjectPropertiesPageEventArgs)
 This method is called when scripting the Rhino Properties command and choosing this page.
RunScript(RhinoDoc, RhinoObject[]) |  Obsolete.
 This method is called when scripting the Rhino Properties command and choosing this page.
ShouldDisplay(ObjectPropertiesPageEventArgs)
 Called when the selected objects list changes, return true if the object list contains one or more object the page can modify.
ShouldDisplay(RhinoObject) |  Obsolete.
 Called when the selected objects list changes, return true if the object list contains one or more object the page can modify.
UpdatePage
 Called on the active page after the selected objects list has changed to notify the page to initialize its content to reflect the new object list.
Top
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace