RhinoCommon API
LocalizeStringPair Methods
The LocalizeStringPair type exposes the following members.
Methods
Name | Description
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
LocalizeStringPair Class
Rhino.UI Namespace