RhinoCommon API
GetNumber Methods
The GetNumber type exposes the following members.
Methods
Name | Description
Get
Call to get a number.
SetLowerLimit
 Sets a lower limit on the number that can be returned. By default there is no lower limit.
SetUpperLimit
 Sets an upper limit on the number that can be returned. By default there is no upper limit.
Top
See Also
Reference
GetNumber Class
Rhino.Input.Custom Namespace