RhinoCommon API
SceneServerData Methods
The SceneServerData type exposes the following members.
Methods
Name | Description
Dispose()
 Dispose for SceneServerData
Dispose(Boolean)
 Dispose for SceneServerData
Finalize
 Destructor for SceneServerData
 (Overrides Object.Finalize().)
Top
See Also
Reference
SceneServerData Class
Rhino.Render Namespace