RhinoCommon API
Squisher Methods
The Squisher type exposes the following members.
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Get2dMesh
 Get the 2d mesh that results from the squish operation
Get3dMesh
 Get the 3d mesh that was used for squish operation
GetAreaConstrainedTrianglesIndices
 Gets mesh vertex indices for the triangular faces that were constrained during the squish. Indices can be used in both the 2d and 3d mesh vertices arrays.
GetLengthConstrained2dLines
 Gets lines at the position of the mesh edges and diagonals that were constrained during the squish, in the 2d mesh. The line at any index here corresponds to the same line in GetLengthConstrained3dLines.
GetLengthConstrained3dLines
 Gets lines at the position of the mesh edges and diagonals that were constrained during the squish, in the 3d mesh. The line at any index here corresponds to the same line in GetLengthConstrained2dLines.
GetMesh2dEdges
 Gets lines at the position of the mesh edges and diagonals that were constrained during the squish, in the 2d mesh. The line at any index here corresponds to the same line in GetLengthConstrained3dLines.
GetMesh3dEdges
 Gets lines at the position of the mesh edges and diagonals that were constrained during the squish, in the 3d mesh. The line at any index here corresponds to the same line in GetLengthConstrained2dLines.
Is2dPatternSquished
 Returns true if the input geometry was the result of a squish operation
SquishBack2dMarks
 Maps 2D geometry from the squished surface or mesh back to the original 3D surface or mesh
SquishCurve
 Maps a curve on or near a previously squished 3d surface to the resulting 2d surface
SquishMesh(SquishParameters, Mesh)
 Squish the given mesh into a flat mesh
SquishMesh(SquishParameters, Mesh, IEnumerable<GeometryBase>, List<GeometryBase>)
 Squish the given mesh into a flat mesh
SquishPoint
 Maps a point on or near the previously squished 3d surface to the flattened surface
SquishSurface(SquishParameters, Surface)
 Squish the surface into a flat brep
SquishSurface(SquishParameters, Surface, IEnumerable<GeometryBase>, List<GeometryBase>)
 Squish the surface into a flat brep
SquishTextDot
 Maps a TextDot on or near a previously squished 3d surface to the resulting 2d surface
Top
See Also
Reference
Squisher Class
Rhino.Geometry Namespace