RhinoCommon API
Point3f Methods
The Point3f type exposes the following members.
Methods
Name | Description
CompareTo
 Compares this Point3f with another Point3f.
Component evaluation priority is first X, then Y, then Z.
DistanceTo
 Computes the distance between two points.
DistanceToSquared
 Computes the squared distance between two points.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Point3f and has the same values as the present point.
 (Overrides ValueType.Equals(Object).)
Equals(Point3f)
 Determines whether the specified Point3f has the same values as the present point.
GetHashCode
 Computes a hash code for the present point.
 (Overrides ValueType.GetHashCode().)
Subtract
 Subtracts a point from another point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
ToString()
 Constructs the string representation for the current point.
 (Overrides ValueType.ToString().)
ToString(String, IFormatProvider)
Formats the value of the current instance using the specified format.
Transform
 Transforms the present point in place. The transformation matrix acts on the left of the point. i.e.,
result = transformation*point
Top
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace