RhinoCommon API
FileAiReadOptions Methods
The FileAiReadOptions type exposes the following members.
Methods
Name | Description
ToDictionary
Top
See Also
Reference
FileAiReadOptions Class
Rhino.FileIO Namespace