RhinoCommon API
PostEffectData Methods
The PostEffectData type exposes the following members.
Methods
Name | Description
DataCRC
 Get a CRC representing the state of the entire post effect.
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
GetParameter
 Get an arbitrary parameter from this post effect by its name. If the parameter is not known to the post effect, the method will fail. Returns a variant object if successful or null on failure.
SetParameter
 Set an arbitrary parameter to the post effect by its name. If the parameter is not known to the post effect, the method will fail. Returns true if successful or false on failure.
Top
See Also
Reference
PostEffectData Class
Rhino.Render.PostEffects Namespace