RhinoCommon API
FileDwgWriteOptions Methods
The FileDwgWriteOptions type exposes the following members.
Methods
Name | Description
AddToDictionary
 Add these options to a dictionary, used by UIless dotnet export.
SetNamedParameters
 Add these options to a NamedParametersEventArgs, used in the dotnet version of the acad export UI.
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace