RhinoCommon API
Circle Methods
The Circle type exposes the following members.
Methods
Name | Description
ClosestParameter
 Gets the parameter on the circle which is closest to a test point.
ClosestPoint
 Gets the point on the circle which is closest to a test point.
DerivativeAt
 Determines the value of the Nth derivative at a parameter.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
IsInPlane
 Evaluates whether or not this circle is co-planar with a given plane.
PointAt
 Circles use trigonometric parameterization: t -> center + cos(t)*radius*xaxis + sin(t)*radius*yaxis.
Reverse
 Reverse the orientation of the circle. Changes the domain from [a,b] to [-b,-a].
Rotate(Double, Vector3d)
 Rotates the circle through a given angle.
Rotate(Double, Vector3d, Point3d)
 Rotates the circle through a given angle.
Rotate(Double, Double, Vector3d)
 Rotates the circle around an axis that starts at the base plane origin.
Rotate(Double, Double, Vector3d, Point3d)
 Rotates the circle around an axis that starts at the provided point.
TangentAt
 Circles use trigonometric parameterization: t -> center + cos(t)*radius*xaxis + sin(t)*radius*yaxis.
ToNurbsCurve()
 Constructs a nurbs curve representation of this circle. This amounts to the same as calling NurbsCurve.CreateFromCircle().
ToNurbsCurve(Int32, Int32)
 Create a uniform non-rational cubic NURBS approximation of a circle.
Transform
 Transforms this circle using an transformation matrix.
Translate
 Moves the circle.
TryFitCircleToPoints
 Attempt to fit a circle through a set of points.
TryFitCircleTT
 Try to fit a circle to two curves using tangent relationships.
TryFitCircleTTT
 Try to fit a circle to three curves using tangent relationships.
TrySmallestEnclosingCircle
 Attempt to create the smallest circle enclosing a set of planar points.
Top
See Also
Reference
Circle Structure
Rhino.Geometry Namespace