RhinoCommon API
HatchPatternTable Methods
The HatchPatternTable type exposes the following members.
Methods
Name | Description
Add
 Adds a new hatch pattern with specified definition to the table.
Delete(HatchPattern)
 Deletes a hatch pattern from the table.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32)
 Deletes a hatch pattern from the table.
Delete(HatchPattern, Boolean)
 Deletes a hatch pattern from the table.
Delete(IEnumerable<Int32>, Boolean)
 Delete multiple hatch patterns.
Delete(Int32, Boolean)
 Deletes a hatch pattern from the table.
Find |  Obsolete.
 Finds the hatch pattern with a given name. Search ignores case.
FindIndex
 Retrieves a HatchPattern object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds the hatch pattern with a given name. Search ignores case.
FindNameHash
 Finds a HatchPattern given its name hash.
GetUnusedHatchPatternName
 Gets unused hatchpattern name used as default when creating new hatchpatterns.
Modify
 Modify hatch pattern settings.
PurgeUnused
 Purges any unused hatch patterns.
Rename(HatchPattern, String)
 Renames a hatch pattern in the table.
Rename(Int32, String)
 Renames a hatch pattern in the table.
Top
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace