RhinoCommon API
SmartTrackSettings Methods
The SmartTrackSettings type exposes the following members.
Methods
Name | Description
GetCurrentState
 Gets the current settings.
GetDefaultState
 Gets the Smart Track factory settings.
UpdateFromState
 Updates from a particular setting state.
Top
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace