RhinoCommon API
Surface Methods
The Surface type exposes the following members.
Methods
Name | Description
ClosestPoint
 Input the parameters of the point on the surface that is closest to testPoint.
ClosestSide
 Gets the side that is closest, in terms of 3D-distance, to a U and V parameter.
CreateExtrusion
 Constructs a surface by extruding a curve along a vector.
CreateExtrusionToPoint
 Constructs a surface by extruding a curve to a point.
CreatePeriodicSurface(Surface, Int32)
 Constructs a periodic surface from a base surface and a direction.
CreatePeriodicSurface(Surface, Int32, Boolean)
 Constructs a periodic surface from a base surface and a direction.
CreateRollingBallFillet(Surface, Surface, Double, Double)
 Constructs a rolling ball fillet between two surfaces.
CreateRollingBallFillet(Surface, Point2d, Surface, Point2d, Double, Double)
 Constructs a rolling ball fillet between two surfaces.
CreateRollingBallFillet(Surface, Boolean, Surface, Boolean, Double, Double)
 Constructs a rolling ball fillet between two surfaces.
CreateSoftEditSurface
 Creates a soft edited surface from an existing surface using a smooth field of influence.
CreateTweenSurfacesWithSampling
 Create tween surfaces that gradually transition between two bounding surfaces using point sampling.
CurvatureAt
 Computes the curvature at the given UV coordinate.
Degree
 Returns the maximum algebraic degree of any span (or a good estimate if curve spans are not algebraic).
Domain
Gets the domain in a direction.
Evaluate
 Evaluates a surface mathematically.
Extend(Int32, Interval)
 Analytically extends the surface to include the interval.
Extend(IsoStatus, Double, Boolean)
 Extends an untrimmed surface along one edge.
Fit
Fits a new surface through an existing surface.
FitCurveToSurface
FrameAt
 Computes the orient plane on a surface given a U and V parameter.
This is the simple evaluation call with no error handling.
GetNextDiscontinuity(Int32, Continuity, Double, Double, Double)
 Searches for a derivative, tangent, or curvature discontinuity.
GetNextDiscontinuity(Int32, Continuity, Double, Double, Double, Double, Double)
 Searches for a derivative, tangent, or curvature discontinuity.
GetNurbsFormParameterFromSurfaceParameter
 Translates a parameter from the current surface to the parameter space of the surface returned by ToNurbsSurface().
GetSpanVector
 Gets array of span "knots".
GetSurfaceParameterFromNurbsFormParameter
 Translates a parameter from a value on the surface returned by ToNurbsSurface() to the current surface.
GetSurfaceSize
 Gets an estimate of the size of the rectangle that would be created if the 3d surface where flattened into a rectangle.
HasNurbsForm
 Is there a NURBS surface representation of this surface.
InterpolatedCurveOnSurface
 Constructs an interpolated curve on a surface, using 3D points.
InterpolatedCurveOnSurfaceUV(IEnumerable<Point2d>, Double)
 Returns a curve that interpolates points on a surface. The interpolant lies on the surface.
InterpolatedCurveOnSurfaceUV(IEnumerable<Point2d>, Double, Boolean, Int32)
 Returns a curve that interpolates points on a surface. The interpolant lies on the surface.
IsAtSeam
 Tests if a surface parameter value is at a seam.
IsAtSingularity
 Tests if a surface parameter value is at a singularity.
IsClosed
 Gets a value indicating if the surface is closed in a direction.
IsCone()
 Determines if the surface is a portion of a cone within RhinoMath.ZeroTolerance.
IsCone(Double)
Determines if the surface is a portion of a cone within a given tolerance.
IsContinuous
 Tests continuity at a surface parameter value.
IsCylinder()
 Determines if the surface is a portion of a cylinder within RhinoMath.ZeroTolerance.
IsCylinder(Double)
Determines if the surface is a portion of a cylinder within a given tolerance.
IsExtrusion()
Determines if the surface is a portion of an extrusion within RhinoMath.ZeroTolerance.
IsExtrusion(Double)
Determines if the surface is a portion of an extrusion within a given tolerance.
IsIsoparametric(BoundingBox)
 Determines if a 2d bounding box is isoparametric in the parameter space of this surface.
IsIsoparametric(Curve)
 Determines if a 2d curve is isoparametric in the parameter space of this surface.
IsIsoparametric(Curve, Interval)
 Determines if a 2D curve is isoparametric in the parameter space of this surface.
IsoCurve(IsoStatus)
 Gets isoparametric curve that corresponds to one of the four surface edges. Other IsoStatus values are not supported.
IsoCurve(Int32, Double)
Gets isoparametric curve.
IsoCurve(IsoStatus, Double)
 Gets isoparametric curve. None is not supported, and X and Y need valid t-values in the U- or V-domain respectively.
IsPeriodic
 Gets a value indicating if the surface is periodic in a direction (default is false).
IsPlanar()
 Tests a surface to see if it is planar to zero tolerance.
IsPlanar(Double)
 Tests a surface to see if it is planar to a given tolerance.
IsSingular
 true if surface side is collapsed to a point.
IsSphere()
 Determines if the surface is a portion of a sphere within RhinoMath.ZeroTolerance.
IsSphere(Double)
 Determines if the surface is a portion of a sphere within a given tolerance.
IsTorus()
Determines if the surface is a portion of a torus within RhinoMath.ZeroTolerance.
IsTorus(Double)
Determines if the surface is a portion of a torus within a given tolerance.
LocalClosestPoint
 Find parameters of the point on a surface that is locally closest to the testPoint. The search for a local close point starts at seed parameters.
NormalAt
 Computes the surface normal at a point.
This is the simple evaluation call - it does not support error handling.
Offset
 Constructs a new surface which is offset from the current surface.
PointAt
 Evaluates a point at a given parameter.
Pullback(Curve, Double)
 Pulls a 3d curve back to the surface's parameter space.
Pullback(Curve, Double, Interval)
 Pulls a 3d curve back to the surface's parameter space.
Pushup(Curve, Double)
 Computes a 3d curve that is the composite of a 2d curve and the surface map.
Pushup(Curve, Double, Interval)
 Computes a 3d curve that is the composite of a 2d curve and the surface map.
Rebuild
 Rebuilds an existing surface to a given degree and point count.
RebuildOneDirection
 Rebuilds an existing surface with a new surface to a given point count in either the u or v directions independently.
RefitSimplySplitSurface
 This routine accepts a 3-d trim curve (trimCrv3d). The trim curve is assumed to run from one surface edge to the opposite edge; this is referred to as a "simple" trim curve, roughly parallel to one of the srf directions (either u or v). We refer to that parameter as the "trim parameter". The routine splits the surface via the trim curve, and then refits either side ("upper" = "above the trim", and "lower" = "below the trim") as a set of untrimmed Nurbs surfaces. The idea is to retain, as much as possible, the Nurbs structure of srf, especially in the trim parameter.
RefitSplit
 Splits the surface into two and refits the split edge
Reverse(Int32)
 Reverses parameterization Domain changes from [a,b] to [-b,-a]
Reverse(Int32, Boolean)
 Same as Reverse, but if inPlace is set to true this Surface is modified instead of a new copy being created.
SetDomain
 Sets the domain in a direction.
ShortPath
 Constructs a geodesic between 2 points, used by ShortPath command in Rhino.
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem)
 Smooths a surface by averaging the positions of control points in a specified region.
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths a surface by averaging the positions of control points in a specified region.
SpanCount
 Gets number of smooth nonempty spans in the parameter direction.
Split
 Splits (divides) the surface into two parts at the specified parameter
ToBrep
 Converts the surface into a Brep.
ToNurbsSurface()
 Gets a NURBS surface representation of this surface. Default tolerance of 0.0 is used.
ToNurbsSurface(Double, Int32)
 Gets a NURBS surface representation of this surface.
Transpose()
 Transposes surface parameterization (swap U and V)
Transpose(Boolean)
 Transposes surface parameterization (swap U and V)
Trim
 Constructs a sub-surface that covers the specified UV trimming domain.
TryGetCone(Cone)
Tests a surface to see if it is a portion of a cone within RhinoMath.ZeroTolerance and return the cone.
TryGetCone(Cone, Double)
Tests a surface to see if it is a portion of a cone and returns the cone.
TryGetCylinder(Cylinder)
Tests a surface to see if it is a portion of a cylinder within RhinoMath.ZeroTolerance and return the cylinder.
TryGetCylinder(Cylinder, Double)
Tests a surface to see if it is a portion of a cylinder and return the infinite cylinder.
TryGetExtrusion(Extrusion)
Tests a surface to see if it is an extrusion within RhinoMath.ZeroTolerance and returns the extrusion.
TryGetExtrusion(Extrusion, Double)
Tests a surface to see if it is an extrusion and returns the extrusion.
TryGetFiniteCylinder
Tests a surface with the assumption that it might be a right circular cylinder and returns this geometry.
TryGetPlane(Plane)
Tests a surface for planarity and return the plane.
TryGetPlane(Plane, Double)
Tests a surface for planarity and return the plane.
TryGetSphere(Sphere)
Test a surface to see if it is a portion of a sphere and return the sphere.
TryGetSphere(Sphere, Double)
Test a surface to see if it is a portion of a sphere and return the sphere.
TryGetTorus(Torus)
Tests a surface to see if it is a portion of a torus within RhinoMath.ZeroTolerance and returns the torus.
TryGetTorus(Torus, Double)
Tests a surface to see if it is a portion of a torus and returns the torus.
VariableOffset(Double, Double, Double, Double, Double)
 Copies a surface so that all locations at the corners of the copied surface are specified distances from the original surface.
VariableOffset(Double, Double, Double, Double, IEnumerable<Point2d>, IEnumerable<Double>, Double)
 Copies a surface so that all locations at the corners, and from specified interior locations, of the copied surface are specified distances from the original surface.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace