RhinoCommon API
Decals Methods
The Decals type exposes the following members.
Methods
Name | Description
Add
 Add a new Decal to the collection. Use Decal.Create() to create a new decal instance to add.
Clear |  Obsolete.
GetEnumerator
Remove
 Remove a single decal from the collection.
RemoveAllDecals
 Remove all the decals from the collection.
Top
See Also
Reference
Decals Class
Rhino.Render Namespace