RhinoCommon API
FilePovWriteOptions Methods
The FilePovWriteOptions type exposes the following members.
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
FilePovWriteOptions Class
Rhino.FileIO Namespace