RhinoCommon API
ColorCMYK Methods
The ColorCMYK type exposes the following members.
Methods
Name | Description
CreateFromHSL
 Constructs the nearest CMYK equivalent of an HSL color.
CreateFromHSV
 Constructs the nearest CMYK equivalent of an HSV color.
CreateFromLAB
 Constructs the nearest CMYK equivalent of a LAB color.
CreateFromLCH
 Constructs the nearest CMYK equivalent of a LCH color.
CreateFromRGBA
 Create the nearest CMYK equivalent of a RGBA color.
CreateFromXYZ
 Constructs the nearest CMYK equivalent of an XYZ color.
Top
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace