RhinoCommon API
AssemblyResolver Methods
The AssemblyResolver type exposes the following members.
Methods
Name | Description
AddSearchFile
 Register another file with the Assembly Resolver. File must be a .NET assembly, so it should probably be a dll, rhp or exe.
AddSearchFolder
 Register a custom folder with the Assembly Resolver. Folders will be searched recursively, so this could potentially be a very expensive operation. If at all possible, you should consider only registering individual files.
Top
See Also
Reference
AssemblyResolver Class
Rhino.Runtime Namespace