RhinoCommon API
SubDDisplayParameters Methods
The SubDDisplayParameters type exposes the following members.
Methods
Name | Description
AbsoluteDisplayDensityFromSubD
 Gets absolute SubD display density for subd.
AbsoluteDisplayDensityFromSubDFaceCount |  Obsolete.
 Gets the absolute SubD display density for SubD with subdFaceCount faces.
ClampDisplayDensity
 Limits display density to a value useful in user interface code.
Coarse
 Parameters for a course limit surface display mesh. SubD display density = adaptive SubDDisplayParameters.Density.CoarseDensity.
CreateFromAbsoluteDisplayDensity
 Use of absolute display density is strongly discouraged. SubDs can have a single face or millions of faces. Adaptive display meshing produces more desirable results in almost all cases.
CreateFromDisplayDensity
 In most applications, the caller sets the mesh density and leaves the other parameters set to the default values.
CreateFromMeshDensity
 This function creates SubDDisplayParameters from a user interface "slider" like Rhino's simple mesh controls.
Default
 Parameters for the default limit surface display mesh. SubD display density = adaptive SubDDisplayParameters.Density.DefaultDensity.
DisplayDensity
 Gets the absolute display density to use when creating display meshes for SubD. When adaptive reduction is enabled, subd.Faces.Count is used to determine the appropriate display density.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Empty
 Get an empty SubDDisplayParameters.
ExtraCoarse
 Parameters for an extra course limit surface display mesh. SubD display density = adaptive SubDDisplayParameters.Density.ExtraCoarseDensity.
ExtraFine
 Parameters for an extra fine limit surface display mesh. SubD display density = adaptive SubDDisplayParameters.Density.ExtraFineDensity.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Fine
 Parameters for a fine limit surface display mesh. SubD display density = adaptive SubDDisplayParameters.Density.FineDensity.
FromEncodedString
 Converts encoded serialized string into a MeshingParameters
GetObjectData
Populates a SerializationInfo with the data needed to serialize the target object.
Medium
 Parameters for a medium limit surface display mesh. SubD display density = adaptive SubDDisplayParameters.Density.MediumDensity.
SetAbsoluteDisplayDensity
 In almast all cases, you are better off using SetAdaptiveDisplayDensity().
SetAdaptiveDisplayDensity
 Set an adaptive SubD display density that caps display mesh quad count at SubDDisplayParameters.AdaptiveDisplayMeshQuadMaximum.
ToEncodedString
 Returns a encoded string that represents the MeshingParameters.
Top
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace