RhinoCommon API
GumballObject Methods
The GumballObject type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
SetFromArc
SetFromBoundingBox(BoundingBox)
SetFromBoundingBox(Plane, BoundingBox)
 Sets the gumball bounding box with respect to a frame.
SetFromCircle
SetFromCurve
SetFromEllipse
SetFromExtrusion
SetFromHatch
SetFromLight
SetFromLine
SetFromPlane
Top
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace