RhinoCommon API
MatchSrfSettings Methods
The MatchSrfSettings type exposes the following members.
Methods
Name | Description
EnableRefinement
 Enable refinement of the surface being edited
Top
See Also
Reference
MatchSrfSettings Class
Rhino.Geometry Namespace