RhinoCommon API
StringTable Methods
The StringTable type exposes the following members.
Methods
Name | Description
Delete(String)
Delete(String, String)
 Removes user data strings from the document.
GetEntryNames
 Return list of all entry names for a given section of user data strings in the document.
GetKey
GetSectionNames
 Returns a list of all the section names for user data strings in the document.
By default a section name is a key that is prefixed with a string separated by a backslash.
GetValue(Int32)
GetValue(String)
GetValue(String, String)
 Gets a user data string from the document.
SetString(String, String)
 Adds or sets a user data string to the document.
SetString(String, String, String)
 Adds or sets a user data string to the document.
Top
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace