RhinoCommon API
SpaceMorph Methods
The SpaceMorph type exposes the following members.
Methods
Name | Description
IsMorphable
 true if the geometry can be morphed by calling SpaceMorph.Morph(geometry)
Morph(GeometryBase)
Apply the space morph to geometry.
Morph(Plane)
 Apply the space morph to a plane.
MorphPoint
Morphs an Euclidean point.
This method is abstract.
Top
See Also
Reference
SpaceMorph Class
Rhino.Geometry Namespace