RhinoCommon API
BoolField Methods
The BoolField type exposes the following members.
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
BoolField Class
Rhino.Render.Fields Namespace