RhinoCommon API
SuspendCollectionChangedNotifications<T> Methods
The SuspendCollectionChangedNotifications<T> generic type exposes the following members.
Methods
Name | Description
Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
Top
See Also
Reference
SuspendCollectionChangedNotifications<T> Class
Rhino.Notifications Namespace