RhinoCommon API
File3dmRenderTexture Methods
The File3dmRenderTexture type exposes the following members.
Methods
Name | Description
ToTexture
 Get a simulated texture that approximates this texture's appearance.
Top
See Also
Reference
File3dmRenderTexture Class
Rhino.FileIO Namespace