RhinoCommon API
CollapsibleSectionHolderImpl Methods
The CollapsibleSectionHolderImpl type exposes the following members.
Methods
Name | Description
Dispose
Find
IsSameObject
NewNativeWrapper
Top
See Also
Reference
CollapsibleSectionHolderImpl Class
Rhino.UI.Controls Namespace