RhinoCommon API
PostEffectPipeline Methods
The PostEffectPipeline type exposes the following members.
Methods
Name | Description
Dimensions
 Get the dimensions of the frame buffer. All channels in the frame buffer have the same dimensions.
Dispose
Execute
 Execute the pipeline. This executes all the post effects in order. Only this rectangle need be modified by the post effects.
ExecutionOrder
 Returns a list of the post effects to be executed by this pipeline in order.
Finalize |  (Overrides Object.Finalize().)
GetChannelForRead
 Get a channel for reading. A post effect will use this to get channel data as input to its process. Output will be written to new channel(s). \see GetChannelForWrite() This method returns the current state of the channel at this stage in the pipeline. If the first post effect calls this, it will get the actual frame buffer channel. Subsequent post effects will get the data left behind by the previous post effect. A post effect calls GetChannelForRead() to get its input and GetChannelForWrite() to get the object to which it will write its output. Even when the same channel id is specified, these are separate, unconnected objects.
GetChannelForWrite
 Get a channel for writing. A post effect will use this to get channel(s) to write the output of its processing to. Input will usually come from existing channels, although a post effect is free to read its own output channels if needed. See GetChannelForRead() You are allowed to create one new channel with the same identifier as an existing channel, in which case IChannel::Commit() will replace the existing channel with the new one in the pipeline.
GetEndTimeInMilliseconds
 Get the end time of the rendering expressed in milliseconds since some unspecified epoch. Do not make assumptions about what the epoch is; it might be different on different platforms.
GetMaxLuminance
 Get the max luminance in the rendering.
GetStartTimeInMilliseconds
 Get the start time of the rendering expressed in milliseconds since some unspecified epoch. Do not make assumptions about what the epoch is; it might be different on different platforms.
SetStartTimeInMilliseconds
 Set the start time of the rendering in milliseconds since some unspecified epoch.
ThreadEngine
 Get the post effect thread engine.
Top
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace