RhinoCommon API
IRhRdkThumbnailList Methods
The IRhRdkThumbnailList type exposes the following members.
Methods
Name | Description
Add
Clear
Get
GetGridMetrics
GetSize
GetStatisticsHeaderHeight
Mode
SetClientText
SetCustomBitmapSize
SetMode
SetShowLabels
Shape
ShowLabels
UUID
Top
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace