RhinoCommon API
HostUtils Methods
The HostUtils type exposes the following members.
Methods
Name | Description
AutoInstallPlugInFolder
 Gets the auto install plug-in folder for machine or current user.
CallFromCoreRhino
 Don't change this function in ANY way unless you chat with Steve first! This function is called by Rhino on initial startup and the signature must be exact
CheckForRdk
 Determines if the RDK is loaded.
ClearFpuExceptionStatus
 Clear FPU exception and busy flags (Intel assembly fnclex)
CreateCommands(PlugIn)
 Parses a plugin and create all the commands defined therein.
CreateCommands(IntPtr, Assembly)
 Parses a plugin and create all the commands defined therein.
CreatePlugIn
 Instantiates a plug-in type and registers the associated commands and classes.
DebugDumpToString(BezierCurve)
 Gets the debug dumps. This is a text description of the geometric contents. DebugDump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
DebugDumpToString(GeometryBase)
 Gets the debug dumps. This is a text description of the geometric contents. DebugDump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
DebugString(String)
 Prints a debug message to the Rhino Command Line. The message will only appear if the SendDebugToCommandLine property is set to true.
DebugString(String, Object[])
 Prints a debug message to the Rhino Command Line. The message will only appear if the SendDebugToCommandLine property is set to true.
DescribeGeometry
 Returns a description that is similar to the one in the _What command, except for not mentioning units and other attribute data. This description is translated in the current Rhino version.
DisplayOleAlerts
 Defines if Ole alerts ("Server busy") alerts should be visualized.
This function makes no sense on Mono.
ExceptionReport(Exception)
 Informs RhinoCommon of an exception that has been handled but that the developer wants to screen.
ExceptionReport(String, Exception)
 Informs RhinoCommon of an exception that has been handled but that the developer wants to screen.
ExecuteNamedCallback
 Execute a named callback
FileNameEndsWithRhinoBackupExtension
 Strip file extension from file name and check to see if it is a valid Rhino backup file extension.
FileNameEndsWithRhinoExtension
 Strip file extension from file name and check to see if it is a valid Rhino file extension.
GetAbsolutePath
 Call this method to convert a relative path to an absolute path relative to the specified path.
GetActivePlugInVersionFolders()
 Recurses through the auto install plug-in folders and returns the directories containing "active" versions of plug-ins.
GetActivePlugInVersionFolders(Boolean)
 Recurses through the auto install plug-in folders and returns the directories containing "active" versions of plug-ins.
GetAssemblySearchPaths
 Returns list of directory names where additional assemblies (plug-ins, DLLs, Grasshopper components) may be located
GetCurrentProcessInfo
 Returns information about the current process. If Rhino is the top level process, processName is "Rhino". Otherwise, processName is the name, without extension, of the main module that is executing. For example, "compute.backend" or "Revit". processVersion is the System.Version of the running process. It is the FileVersion of the executable.
GetCustomComputeEndpoints
 Used by compute to define custom endpoints
GetPlatformService<T>
For internal use only. Loads an assembly for dependency injection via IPlatformServiceLocator.
GetPrinterDPI
 Get the output resolution for a given printer.
GetPrinterFormMargins
 Get limit margins for a given form (page size) and a given printer. This is the physical limit area that a printer can print on a given page
GetPrinterFormNames
 Get list of form names available for a given printer
GetPrinterFormSize
 Get the size of a sheet for a given form name / printer combination
GetPrinterNames
 Get list of printers available on this system
GetRhinoDotNetAssembly
 Only works on Windows. Returns null on Mac.
GetSystemProcessorCount
 Get the processor count on this hardware. It supports querying on CPUs with more than 64 processors (Windows).
GetSystemReferenceAssemblies
 Gets the system reference assemblies to use when compiling code dynamically with Roslyn. Includes RhinoCommon, Rhino.UI, and Eto.
InitializeRhinoCommon
 Makes sure all static RhinoCommon components is set up correctly. This happens automatically when a plug-in is loaded, so you probably won't have to call this method.
InitializeRhinoCommon_RDK
 Makes sure all static RhinoCommon RDK components are set up correctly. This happens automatically when the RDK is loaded, so you probably won't have to call this method.
InitializeZooClient
 Initializes the ZooClient and Rhino license manager, this should get called automatically when RhinoCommon is loaded so you probably won't have to call this method.
InPlaceConstCast
 DO NOT USE UNLESS YOU ARE CERTAIN ABOUT THE IMPLICATIONS.
This is an expert user function which should not be needed in most cases. This function is similar to a const_cast in C++ to allow an object to be made temporarily modifiable without causing RhinoCommon to convert the class from const to non-const by creating a duplicate.
You must call this function with a true parameter, make your modifications, and then restore the const flag by calling this function again with a false parameter. If you have any questions, please contact McNeel developer support before using!
IsManagedDll
 Inspects a dll to see if it is compiled as native code or as a .NET assembly
IsRhinoBackupFileExtension
 Check to see if the file extension is a valid Rhino file extension.
IsRhinoFileExtension
 Check to see if the file extension is a valid Rhino file extension.
LoadAssemblyFrom
 Calls Assembly.LoadFrom in .NET 4.8. May call a different routine under .NET Core
LoadAssemblyFromName
 Calls Assembly.Load(AssemblyName) in .NET 4.8. May call a different routine under .NET Core
LoadAssemblyFromStream
 Calls Assembly.Load(byte[]) in .NET 4.8. May call a different routine under .NET Core
LogDebugEvent
 Logs a debug event. The function will log the filename and line number from where this function is called, in addition to the input message.
RecordInitInstanceTime
 Used to help record times at startup with the -stopwatch flag to help determine bottlenecks in start up speed
RegisterComputeEndpoint
 Register a class that can participate as a compute endpoint
RegisterDynamicCommand
 Adds a new dynamic command to Rhino.
RegisterNamedCallback
Register a named callback
RegisterStaticIDisposable
 Statics do not get disposed of in .NET. If you have a static IDisposable that you want to be disposed during shutdown, add your disposable to this list.
RemoveNamedCallback
 Remove a named callback from the dictionary of callbacks
RhinoCommonExceptionHandler
 For internal use only!!! Unhanded exception handler, writes stack trace to RhinoDotNet.txt file
SendLogMessageToCloudCallbackProc
 Informs RhinoCommon of an message that has been handled but that the developer wants to screen.
SetInShutDown
 Informs the runtime that the application is shutting down.
ShutDownRhinoCommon_RDK
 Makes sure all static RhinoCommon RDK components are de-initialized so they aren't calling into space when the RDK is unloaded.
UnhandledThreadException
 Exception handler for exceptions occurring on the UI thread
Top
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace