RhinoCommon API
FileUdo Methods
The FileUdo type exposes the following members.
Methods
Name | Description
Write
Write a Moray UDO file based on the contents of a RhinoDoc
Top
See Also
Reference
FileUdo Class
Rhino.FileIO Namespace