RhinoCommon API
CustomMeshObject Methods
The CustomMeshObject type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean) |  (Overrides CommonObject.Dispose(Boolean).)
Finalize |  (Overrides CommonObject.Finalize().)
Top
See Also
Reference
CustomMeshObject Class
Rhino.DocObjects.Custom Namespace