RhinoCommon API
Dimension Methods
The Dimension type exposes the following members.
Methods
Name | Description
Explode
 Explodes this dimension into its geometric components.
GetTextTransform
 Get the transform for this text object's text geometry
SetAltDimensionLengthDisplayWithZeroSuppressionReset
SetDimensionLengthDisplayWithZeroSuppressionReset
UpdateDimensionText(DimensionStyle, LengthUnit)
 Remakes dimension text geometry object and sets it on the dimension.
UpdateDimensionText(DimensionStyle, UnitSystem) |  Obsolete.
 Remakes dimension text geometry object and sets it on the dimension.
Top
See Also
Reference
Dimension Class
Rhino.Geometry Namespace