RhinoCommon API
Point2dField Methods
The Point2dField type exposes the following members.
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
Point2dField Class
Rhino.Render.Fields Namespace