RhinoCommon API
ContentUndoBlocker Methods
The ContentUndoBlocker type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
ContentUndoBlocker Class
Rhino.Render Namespace