RhinoCommon API
BrepTrim Methods
The BrepTrim type exposes the following members.
Methods
Name | Description
GetTolerances
 The values in tolerance[] record the accuracy of the parameter space trimming curves.
GetTrimParameter
 Get corresponding trim parameter at given edge parameter.
IsReversed
 Get orientation of trim with respect to it's corresponding edge.
SetTolerances
 The values in tolerance[] record the accuracy of the parameter space trimming curves.
SetTrimCurve(Int32)
 Set 2d curve geometry used by a b-rep trim.
SetTrimCurve(Int32, Interval)
 Set 2d curve geometry used by a b-rep trim.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The NURBS Curves segments do not have fully multiple interior knots.
 3. Rational NURBS curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent co-linear or co-circular segments are combined.
Top
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace