RhinoCommon API
SimpleArrayFloat Methods
The SimpleArrayFloat type exposes the following members.
Methods
Name | Description
Array
 Return the raw data.
ConstPointer
 Gets the constant (immutable) pointer of this array.
CopyTo
 Copies the contents of a SimpleArrayFloat into another SimpleArrayFloat.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToArray
 Returns the managed counterpart of the unmanaged array.
Top
See Also
Reference
SimpleArrayFloat Class
Rhino.Runtime.InteropWrappers Namespace