RhinoCommon API
PhysicallyBasedMaterial Methods
The PhysicallyBasedMaterial type exposes the following members.
Methods
Name | Description
GetTexture
 Get the texture that corresponds with the specified texture type for this material.
GetTextures
 Get array of textures that this material uses
SetTexture
 Set the texture that corresponds with the specified texture type for this material.
SynchronizeLegacyMaterial
Top
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace