RhinoCommon API
File3dmMaterialTable Methods
The File3dmMaterialTable type exposes the following members.
Methods
Name | Description
AddMaterial
 Adds a material to the model material table
FindIndex
 Retrieves a material based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
Top
See Also
Reference
File3dmMaterialTable Class
Rhino.FileIO Namespace