RhinoCommon API
Point4d Methods
The Point4d type exposes the following members.
Methods
Name | Description
Add
 Sums two Point4d together.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is Point4d and has same coordinates as the present point.
 (Overrides ValueType.Equals(Object).)
Equals(Point4d)
 Determines whether the specified point has same value as the present point.
GetHashCode
 Computes the hash code for the present point.
 (Overrides ValueType.GetHashCode().)
Multiply
 Multiplies a point by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Subtract
 Subtracts the second point from the first point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
ToString()
Returns the fully qualified type name of this instance.
 (Overrides ValueType.ToString().)
ToString(String, IFormatProvider)
Formats the value of the current instance using the specified format.
Transform
 Transforms the present point in place. The transformation matrix acts on the left of the point. i.e.,
result = transformation*point
Top
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace