RhinoCommon API
IRhinoUiDialogService Methods
The IRhinoUiDialogService type exposes the following members.
Methods
Name | Description
DetectColorScheme
IconFromResourceId
SetToDefaultColorScheme
ShowCheckListBox
ShowComboListBox
ShowEditBox
ShowLineTypes(String, String, RhinoDoc)
ShowLineTypes(String, String, RhinoDoc, Guid)
ShowListBox
ShowMultiListBox
ShowNumberBox
ShowPopupMenu
ShowPrintWidths(String, String)
ShowPrintWidths(String, String, Double)
ShowPropertyListBox(String, String, List<KeyValuePair<String, String>>)
ShowPropertyListBox(String, String, IList, IList<String>)
Top
See Also
Reference
IRhinoUiDialogService Interface
Rhino.UI Namespace