RhinoCommon API
LightObject Methods
The LightObject type exposes the following members.
Methods
Name | Description
DuplicateLightGeometry
Top
See Also
Reference
LightObject Class
Rhino.DocObjects Namespace