RhinoCommon API
IsoDrawEffect Methods
The IsoDrawEffect type exposes the following members.
Methods
Name | Description
GetBandColor
SetBandColor
Top
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace