RhinoCommon API
ContentCollectionIterator Methods
The ContentCollectionIterator type exposes the following members.
Methods
Name | Description
DeleteThis |  Obsolete.
Dispose
Finalize
 Finalizer
 (Overrides Object.Finalize().)
First
GetEnumerator
 Enumerates the contents, rewinding the iterator to the beginning first. This makes it possible to use the iterator in a foreach loop or with LINQ instead of manually calling First() and Next(). The iterator itself is not disposed by enumerating it, so it should still be wrapped in a 'using' statement, or the whole RenderContentCollection can be enumerated directly instead.
Next
Top
See Also
Reference
ContentCollectionIterator Class
Rhino.Render Namespace