RhinoCommon API
IRhinoAccountsManager Methods
The IRhinoAccountsManager type exposes the following members.
Methods
Name | Description
ExecuteProtectedCode
 Any synchronous method in the IRhinoAccountsManager class must be executed within the function passed to this method, or an InvalidOperationException will be thrown.
ExecuteProtectedCodeAsync
 Any asynchronous method in the IRhinoAccountsManager class must be executed within the function passed to this method, or an InvalidOperationException will be thrown.
GetAuthTokensAsync(String, String, SecretKey, CancellationToken)
 Asynchronously retrieves auth tokens with the given criteria from the Rhino Accounts server.
GetAuthTokensAsync(String, String, IEnumerable<String>, String, Nullable<Int32>, Boolean, IProgress<RhinoAccoountsProgressInfo>, SecretKey, CancellationToken)
 Asynchronously retrieves auth tokens with the given criteria from the Rhino Accounts server.
RevokeAuthTokenAsync
 Invalidates/revokes an IOAuth2Token object from the Rhino Accounts server.
TryGetAuthTokens(String, SecretKey)
 Attempts to return cached auth tokens that match the given criteria if any have been stored in cache.
TryGetAuthTokens(String, IEnumerable<String>, SecretKey)
 Attempts to return cached auth tokens that match the given criteria if any have been stored in cache.
UpdateOpenIDConnectTokenAsync
 Updates an OpenID Connect token so that it contains the latest user information by contacting the Rhino Account's server userinfo endpoint using a compatible O
Top
See Also
Reference
IRhinoAccountsManager Interface
Rhino.Runtime.RhinoAccounts Namespace