RhinoCommon API
RenderTabs Methods
The RenderTabs type exposes the following members.
Methods
Name | Description
FromRenderSessionId
 Get the instance of a render tab associated with a specific render session, this is useful when it is necessary to update a control from a RenderPipeline
RegisterTab(PlugIn, Type, String, Icon) |  Obsolete.
 Register custom render user interface with Rhino. This should only be done in RegisterRenderTabs(RenderTabs). Panels registered after RegisterRenderTabs(RenderTabs) is called will be ignored. If the class includes a public method "void DoHelp()" the method will get called when F1 is pressed and the custom tab is active.
RegisterTab(PlugIn, Type, Guid, String, Icon)
SessionIdFromTab
 Get the render session id that created the specified tab object. Only applies to tabs in the context of a render window, not other contexts like Rhino Options or View Properties. It actually returns the identifier associated with the side pane UI which is typically the same as the render session id.
SidePaneUiIdFromTab
 Get the id of the side pane UI that a tab is in.
Top
See Also
Reference
RenderTabs Class
Rhino.Render Namespace