RhinoCommon API
File3dm Methods
The File3dm type exposes the following members.
Methods
Name | Description
Audit |  Obsolete.
 This function is only kept for forward assembly compatibility.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Dump
Prepares a text dump of the entire model.
DumpSummary
Prepares a text dump of model properties and settings.
DumpToTextLog
Prepares a text dump of the entire model.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
FromByteArray
 Read a 3dm file from a byte array
GetPreviewImage
 Preview image used for file explorer
IsValid(String) |  Obsolete.
 The File3dm object is kept consistent during its creation. Therefore, this function now returns only true.
IsValid(TextLog) |  Obsolete.
 The File3dm object is kept consistent during its creation. Therefore, this function now returns only true.
Polish |  Obsolete.
 This function is only kept for forward assembly compatibility.
Read(String)
 Reads a 3dm file from a specified location.
Read(String, File3dm.TableTypeFilter, File3dm.ObjectTypeFilter)
 Reads a 3dm file from a specified location.
ReadApplicationData
 Reads only the application information from an existing 3dm file.
ReadArchiveVersion
 Reads only the archive 3dm version from an existing 3dm file.
ReadDimensionStyles
 Read the dimension styles table out of a 3dm file.
ReadEarthAnchorPoint
 Reads only the earth anchor point from an existing 3dm file
ReadNotes
Reads only the notes from an existing 3dm file.
ReadPageViews
 Reads page view, or layout, information from an existing 3dm file.
ReadPreviewImage
 Attempts to read the preview image out of a 3dm file.
ReadRevisionHistory
 Quickly check a file for it's revision information. This function does not read the entire file, just what it needs to get revision information out
ReadSettings
 Reads only the start section, properties, and settings from a 3dm file at a specified location. The rest of the model (objects, layers, and other tables) is not read.
ReadWithLog(String, String)
 Read a 3dm file from a specified location and log any archive reading errors.
ReadWithLog(String, File3dm.TableTypeFilter, File3dm.ObjectTypeFilter, String)
 Reads a 3dm file from a specified location.
SetPreviewImage
Preview image used for file explorer
ToByteArray()
 Write to an in-memory byte[]
ToByteArray(File3dmWriteOptions)
 Write to an in-memory byte[]
Write(String, File3dmWriteOptions)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
Write(String, Int32)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
WriteMultipleObjects
 Creates a simple 3dm file that contains a multiple geometric objects.
WriteOneObject
 Creates a simple 3dm file that contains a single geometric object.
WriteWithLog(String, File3dmWriteOptions, String)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
WriteWithLog(String, Int32, String)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
Top
See Also
Reference
File3dm Class
Rhino.FileIO Namespace