RhinoCommon API
UserData Methods
The UserData type exposes the following members.
Methods
Name | Description
Copy
 Expert user tool that copies user data that has a positive CopyCount from the source object to a destination object. Generally speaking you don't need to use Copy(). Simply rely on things like the copy constructors to do the right thing.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
MoveUserDataFrom
 Moves the user data from objectWithUserData to a temporary data storage identified by the return Guid. When MoveUserDataFrom returns, the objectWithUserData will not have any user data.
MoveUserDataTo
 Moves the user data.
See MoveUserDataFrom(CommonObject) for more information.
OnDuplicate
 Is called when the object is being duplicated.
OnTransform
 Is called when the object associated with this data is transformed. If you override this function, make sure to call the base class if you want the stored Transform to be updated.
Read
Reads the content of this data from a stream archive.
Write
Writes the content of this data to a stream archive.
Top
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace