RhinoCommon API
FileAiWriteOptions Methods
The FileAiWriteOptions type exposes the following members.
Methods
Name | Description
ToDictionary
Top
See Also
Reference
FileAiWriteOptions Class
Rhino.FileIO Namespace