RhinoCommon API
SubDFace Methods
The SubDFace type exposes the following members.
Methods
Name | Description
ClearSavedSubdivisionPoints
 Discards the cached subdivision and surface points for this face, so they are recomputed on next use.
ComponentIndex
 Gets the component index of this face.
EdgeAt
 Get an edge at a given index
EdgeDirectionMatchesFaceOrientation
 Check if a given edge in this face has the same direction as the face orientation
VertexAt
 Get a vertex that this face uses by index
Top
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace