RhinoCommon API
AncestryRecord Methods
The MeshInstance.AncestryRecord type exposes the following members.
Methods
Name | Description
Dispose()
 Dispose
Dispose(Boolean)
 Dispose. Disposes unmanaged memory.
Finalize
 Finalizer
 (Overrides Object.Finalize().)
Top
See Also
Reference
MeshInstance.AncestryRecord Class
Rhino.Render.ChangeQueue Namespace