RhinoCommon API
UserInterfaceSection Methods
The UserInterfaceSection type exposes the following members.
Methods
Name | Description
Expand
 Expand or collapse this content section.
FromWindow
 Find the UserInterfaceSection that created the specified instance of a window.
GetContentList
 Returns a list of currently selected content items to be edited.
Show
 Show or hide this content section.
Top
See Also
Reference
UserInterfaceSection Class
Rhino.Render.UI Namespace