RhinoCommon API
GetCylinder Methods
The GetCylinder type exposes the following members.
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Get(Cylinder)
 Prompt for the getting of a cylinder.
Get(Extrusion)
 Prompt for the getting of a cylinder.
GetMesh(Int32, Int32, Cylinder)
 Prompt for the getting of a mesh cylinder.
GetMesh(Int32, Int32, Int32, Cylinder)
 Prompt for the getting of a mesh cylinder.
Top
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace