RhinoCommon API
Line Methods
The Line type exposes the following members.
Methods
Name | Description
ClosestParameter
 Finds the parameter on the infinite line segment that is closest to a test point.
ClosestPoint
 Finds the point on the (in)finite line segment that is closest to a test point.
DistanceTo
 Compute the shortest distance between this line segment and a test point.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Line)
 Determines whether a line has the same value as this line.
Equals(Object)
 Determines whether an object is a line that has the same value as this line.
 (Overrides ValueType.Equals(Object).)
Extend
 Extend the line by custom distances on both sides.
ExtendThroughBox(BoundingBox)
 Ensure the line extends all the way through a box. Note, this does not result in the shortest possible line that overlaps the box.
ExtendThroughBox(Box)
 Ensure the line extends all the way through a box. Note, this does not result in the shortest possible line that overlaps the box.
ExtendThroughBox(BoundingBox, Double)
 Ensure the line extends all the way through a box. Note, this does not result in the shortest possible line that overlaps the box.
ExtendThroughBox(Box, Double)
 Ensure the line extends all the way through a box. Note, this does not result in the shortest possible line that overlaps the box.
Flip
 Flip the endpoints of the line segment.
GetHashCode
 Computes a hash number that represents this line.
 (Overrides ValueType.GetHashCode().)
MaximumDistanceTo(Line)
 Finds the largest distance between this line as a finite segment and another finite segment.
MaximumDistanceTo(Point3d)
 Finds the largest distance between this line as a finite segment and a test point.
MinimumDistanceTo(Line)
 Finds the shortest distance between this line as a finite segment and another finite segment.
MinimumDistanceTo(Point3d)
 Finds the shortest distance between this line as a finite segment and a test point.
PointAt
 Evaluates the line at the specified parameter.
PointAtLength
 Computes a point located at a specific metric distance from the line origin (From).
If line start and end coincide, then the start point is always returned.
ToNurbsCurve
 Constructs a nurbs curve representation of this line. This amounts to the same as calling NurbsCurve.CreateFromLine().
ToString()
 Constructs the string representation of this line, in the form "From,To".
 (Overrides ValueType.ToString().)
ToString(String, IFormatProvider)
Formats the value of the current instance using the specified format.
Transform
 Transform the line using a Transformation matrix.
TryCreateBetweenCurves
 Creates a line segment between a pair of curves such that the line segment is either tangent or perpendicular to each of the curves.
TryFitLineToPoints
 Attempt to fit a line through a set of points.
TryGetPlane
 Gets a plane that contains the line. The origin of the plane is at the start of the line. If possible, a plane parallel to the world XY, YZ, or ZX plane is returned.
Top
See Also
Reference
Line Structure
Rhino.Geometry Namespace