RhinoCommon API
FileSvg Methods
The FileSvg type exposes the following members.
Methods
Name | Description
Read
Read a Svg file into a RhinoDoc
Top
See Also
Reference
FileSvg Class
Rhino.FileIO Namespace