RhinoCommon API
FilePov Methods
The FilePov type exposes the following members.
Methods
Name | Description
Write
Write a POV file based on the contents of a RhinoDoc
Top
See Also
Reference
FilePov Class
Rhino.FileIO Namespace