RhinoCommon API
PostEffectExecutionControl Methods
The PostEffectExecutionControl type exposes the following members.
Methods
Name | Description
Detach
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
ReadyToExecutePostEffect
Top
See Also
Reference
PostEffectExecutionControl Class
Rhino.Render.PostEffects Namespace