RhinoCommon API
TransformObjectList Methods
The TransformObjectList type exposes the following members.
Methods
Name | Description
Add(ObjRef)
 Add an ObjRef to this list. Use this to add polyedges so the references are properly counted
Add(RhinoObject)
 Add a RhinoObject to this list
AddObjects
 Add objects to list with a GetObject
Clear
 Remove all elements from this list
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
GetBoundingBox
 Gets the bounding box of all of the objects that this list contains.
GripArray
 Gets access to the internal GripObject array of the TransformObjectList object.
GripOwnerArray
 Gets access to the internal GripOwner array of the TransformObjectList object.
ObjectArray
 Gets access to the internal RhinoObject array of the TransformObjectList object.
UpdateDisplayFeedbackTransform
Top
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace