RhinoCommon API
HatchPattern Methods
The HatchPattern type exposes the following members.
Methods
Name | Description
AddHatchLine
 Add a HatchLine to the pattern.
CreatePreviewGeometry
 Creates preview line segments of the hatch pattern.
DeleteAllUserStrings
DeleteUserString
GetDefaultHatchPatterns
 Gets Rhino default hatch patterns. These patterns are not in the document hatch pattern table.
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
HatchLineAt
 Gets a HatchLine at an index.
ReadFromFile
 Reads hatch pattern definitions from a file.
RemoveAllHatchLines
 Remove all of the hatch line from the pattern.
RemoveHatchLine
 Remove a hatch line from the pattern.
SetHatchLines
 Set all of the hatch lines at once. Existing hatch lines are deleted.
SetUserString
 Attach a user string (key,value combination) to this geometry.
WriteToFile(String, HatchPattern)
 Writes a hatch pattern defintion to a file.
WriteToFile(String, IEnumerable<HatchPattern>)
 Writes one or more hatch pattern defintions to a file.
Top
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace