RhinoCommon API
RenderSettings Methods
The RenderSettings type exposes the following members.
Methods
Name | Description
Duplicate
 Makes a free-floating copy of the object.
RenderEnvironment
 Get the render environment for a particular usage. Only works if this render settings is in a document. If usage is Background and the background mode is set to 'Solid Color' or 'Gradient' (i.e., not 'Environment'), then null will be returned.
RenderEnvironmentId
 Get the id of the render environment for a particular usage. If usage is Background and the background mode is set to 'Solid Color' or 'Gradient' (i.e., not 'Environment'), then Guid.Empty will be returned.
RenderEnvironmentOverride
 For usage background, this checks if the background style is set to 'Environment'. For reflection and skylighting, it checks if the relevant custom override is enabled.
SetRenderEnvironment
 Set the render environment for a particular usage. Passing null for usage Skylighting or Reflection will turn the override for that usage off.
SetRenderEnvironmentId
 Set the id of the render environment for a particular usage. Passing Guid.Empty for usage Skylighting or Reflection will turn the override for that usage off.
SetRenderEnvironmentOverride
 Set the given environment override on/off. Only works for usage Reflection and Skylighting.
Top
See Also
Reference
RenderSettings Class
Rhino.Render Namespace