RhinoCommon API
ModelComponent Methods
The ModelComponent type exposes the following members.
Methods
Name | Description
ClearId
 Resets the HasId property of the model component to false, if possible.
ClearIndex
 Resets the HasIndex property of the model component to false, if possible.
ClearName
 Resets the HasName property of the model component to false, if possible.
DataCRC
 Increments the Cyclic Redundancy Check value by this instance.
IsValidComponentName
 Tests for a valid model component name.
LockId
 Locks the component Id property.
LockIndex
 Locks the component Index property.
LockName
 Locks the component Name property.
ModelComponentTypeIgnoresCase
 Informs the developer if a particular model component type will require case-ignoring searching within a document. This is currently true with groups; false otherwise.
ModelComponentTypeIncludesParent
 Informs the developer if a particular model component type will include the hash of the parent.
ModelComponentTypeRequiresUniqueName
 Informs the developer if a particular model component type will require uniqueness within a document. This is currently true with render materials and model geometry; false otherwise.
ToString
 Returns the name of the model component type, and then its name and index.
 (Overrides Object.ToString().)
Top
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace