RhinoCommon API
MeshObject Methods
The MeshObject type exposes the following members.
Methods
Name | Description
CheckMeshes
 Examines mesh objects and logs a description of what it finds right or wrong. The various properties the function checks for are described in MeshCheckParameters.
DuplicateMeshGeometry
SetMesh
 Only for developers who are defining custom subclasses of MeshObject. Directly sets the internal mesh geometry for this object. Note that this function does not work with Rhino's "undo".
Top
See Also
Reference
MeshObject Class
Rhino.DocObjects Namespace