RhinoCommon API
SectionStyle Methods
The SectionStyle type exposes the following members.
Methods
Name | Description
GetBoundaryLinetype
 Get an optional custom linetype associated with this section style. If null, then the linetype will come from the parent attributes or layer
ReadFromFile
 Reads linetypes from a Rhino .3dm file.
RemoveBoundaryLinetype
SetBoundaryLinetype
Top
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace