RhinoCommon API
RdkUndo Methods
The RdkUndo type exposes the following members.
Methods
Name | Description
Dispose
 Dispose for RdkUndo
Finalize
 Destructor for RdkUndo
 (Overrides Object.Finalize().)
NewUndoRecord
 Get a new UndoRecord
Top
See Also
Reference
RdkUndo Class
Rhino.Render Namespace