RhinoCommon API
Box Methods
The Box type exposes the following members.
Methods
Name | Description
Clone
 Returns a deep copy of this instance.
ClosestPoint(Point3d)
 Finds the closest point on or in the Box. The box should be Valid for this to work.
ClosestPoint(Point3d, Boolean)
 Finds the closest point on or in the Box. The box should be Valid for this to work.
Contains(BoundingBox)
 Determines whether a BoundingBox is inside this Box, including its boundary. This is the same as calling Contains(box,false). Invalid boxes contain nothing. Invalid bounding boxes are never contained.
Contains(Box)
 Determines whether a Box is inside this Box, including its boundary. This is the same as calling Contains(box,false). Invalid boxes contain nothing. Invalid boxes are never contained.
Contains(Point3d)
 Determines whether a point is inside this Box, including its boundary. This is the same as calling Contains(point,false). Invalid boxes contain nothing. Invalid points are never contained.
Contains(BoundingBox, Boolean)
 Determines whether a BoundingBox is inside this Box (strict inclusion, if strict is true). Invalid boxes contain nothing. Invalid bounding boxes are never contained.
Contains(Box, Boolean)
 Determines whether a Box is inside this Box (strict inclusion, if strict is true). Invalid boxes contain nothing. Invalid boxes are never contained.
Contains(Point3d, Boolean)
 Determines whether a point is (strictly, if strict is true) inside this Box. Invalid boxes contain nothing. Invalid points are never contained.
EpsilonEquals
 Check that all values in Box other are within epsilon of the values in this Box.
FurthestPoint
 Finds the furthest point on the boundary of this Box. The Box should be Valid for this to work properly.
GetCorners
 Gets an array of the 8 corner points of this box, or an empty array if this box is not valid.
Inflate(Double)
 Inflates the box by a given offset in each direction. Inflating with negative amounts may result in decreasing boxes. InValid boxes cannot be inflated.
Inflate(Double, Double, Double)
 Inflates the box by a given offset in each direction. Inflating with negative amounts may result in decreasing boxes. InValid boxes cannot be inflated.
MakeValid |  Obsolete.
 DO NOT USE THIS FUNCTION If some of the box's values (Plane origin or axis, intervals bounds) are unset, do nothing. Else, make the Box valid by reversing the non-increasing intervals of this box. This is almost never what you want because it only makes Empty boxes not empty and with non-zero length.
PointAt
 Evaluates the box at the given unitized parameters.
The box is parametrized with a side length of 1x1x1.
RepositionBasePlane
 Repositions the origin of the Base plane for this box without affecting the physical dimensions.
ToBrep
 Constructs a brep representation of this box.
ToExtrusion
 Constructs an extrusion representation of this box.
Transform
 Transforms this Box using a Transformation matrix. If the Transform is not a Similarity, the dimensions of the resulting box cannot be trusted.
Union
 Constructs a union between this Box and the given point. This grows the box in directions so it contains the point.
Top
See Also
Reference
Box Structure
Rhino.Geometry Namespace