RhinoCommon API
FileUsd Methods
The FileUsd type exposes the following members.
Methods
Name | Description
Write
Write a USD file based on the contents of a RhinoDoc
Top
See Also
Reference
FileUsd Class
Rhino.FileIO Namespace