RhinoCommon API
InstanceObject Methods
The InstanceObject type exposes the following members.
Methods
Name | Description
Explode(Boolean, RhinoObject[], ObjectAttributes[], Transform[])
 Explodes the instance reference into pieces.
Explode(Boolean, Guid, Boolean, RhinoObject[], ObjectAttributes[], Transform[])
 Explodes the instance reference into pieces.
SubObjectFromComponentIndex
 Get a RhinoObject in this block
UsesDefinition
Determine if this reference uses an instance definition
Top
See Also
Reference
InstanceObject Class
Rhino.DocObjects Namespace