RhinoCommon API
Material Methods
The Material type exposes the following members.
Methods
Name | Description
ClearMaterialChannels
 Removes all material channels
CommitChanges
CopyFrom
Default
 Set material to default settings.
GetBitmapTexture
GetBumpTexture
 Gets the bump texture of this material.
GetEnvironmentTexture
GetTexture
 Get the texture that corresponds with the specified texture type for this material.
GetTextures
 Get array of textures that this material uses
GetTransparencyTexture
GetUserString
 Gets a user string.
GetUserStrings
 Gets an independent copy of the collection of (user text key, user text value) pairs attached to this object.
MaterialChannelIdFromIndex
 Finds id of the material channel at given index.
MaterialChannelIndexFromId
 Finds index of the material channel that refers to a material channel with the given id. Optionally adds channel if one is not found.
SetBitmapTexture(String)
SetBitmapTexture(Texture)
SetBitmapTexture(String, Bitmap)
 Uses the pixels of an in-memory bitmap as this material's bitmap texture, without writing an image file.
 The pixels are copied into TextureCache under name. Calling this again with the same name replaces them in place, and the change shows up on the next redraw.
SetBumpTexture(String)
SetBumpTexture(Texture)
SetEnvironmentTexture(String)
SetEnvironmentTexture(Texture)
SetTexture
 Set the texture that corresponds with the specified texture type for this material.
SetTransparencyTexture(String)
SetTransparencyTexture(Texture)
SetUserString
 Attach a user string (key,value combination) to this geometry.
ToPhysicallyBased
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace