RhinoCommon API
PreviewBackground Methods
The PreviewBackground type exposes the following members.
Methods
Name | Description
ElementKind
 ElementKind
EnvironmentInstanceId
 EnvironmentInstanceId
SetEnvironmentInstanceId
 SetEnvironmentInstanceId
SetUpPreview
 SetUpPreview
Top
See Also
Reference
PreviewBackground Class
Rhino.Render Namespace