RhinoCommon API
PostEffect Methods
The PostEffect type exposes the following members.
Methods
Name | Description
AddUISections
 Create each of your UI sections using 'new' and then call ui.AddSection() on them. RDK takes ownership of the sections.If your post effect does not need a UI, then your implementation of this method can be a no-op.
BeginChange
CanExecute
 Return true if the post effect can execute, else false. The base implementation checks if the post effect is 'On' and 'Shown'. Post effect authors can override this to include other criteria but cannot disable the base criteria.
Changed
DisplayHelp
 Displays the post effect's help page, if any.
Dispose()
Dispose(Boolean)
EndChange
Execute
 Execute the post effect.
Finalize |  (Overrides Object.Finalize().)
GetHashCode
 A CRC of the state of this post effect.
 (Overrides Object.GetHashCode().)
GetParam
 Get a parameter.
ReadFromDocumentDefaults |  Obsolete.
 Because post effects are now in the render settings, this function can no longer be called.
ReadState
 Read the state. If your post effect has no state, you must still return true for success.
RegisterPostEffect(PlugIn)
RegisterPostEffect(Assembly, Guid)
ResetToFactoryDefaults
 Reset the state to factory defaults.
SetParam
 Set a parameter.
WriteState
 Write the state. If your post effect has no state, you must still return true for success.
WriteToDocumentDefaults |  Obsolete.
 Because post effects are now in the render settings, this function can no longer be called.
Top
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace