RhinoCommon API
ExpandableContentUI Methods
The ExpandableContentUI type exposes the following members.
Methods
Name | Description
AddSection(ICollapsibleSection)
 Add a section to the UI. Called \e before Create(). A generic controller is attached.
AddSection(ICollapsibleSection, IRdkViewModel)
 Add a section to the UI with a custom controller. Called \e before Create().
Top
See Also
Reference
ExpandableContentUI Class
Rhino.UI.Controls Namespace