RhinoCommon API
Skylight Methods
The Skylight type exposes the following members.
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Dispose
Finalize |  (Overrides FreeFloatingBase.Finalize().)
Top
See Also
Reference
Skylight Class
Rhino.Render Namespace