RhinoCommon API
FileVda Methods
The FileVda type exposes the following members.
Methods
Name | Description
Write
Write a Vda file based on the contents of a RhinoDoc
Top
See Also
Reference
FileVda Class
Rhino.FileIO Namespace