RhinoCommon API
SimpleArrayGuid Methods
The SimpleArrayGuid type exposes the following members.
Methods
Name | Description
Append
 Appends a new Guid at the end of this array.
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToArray
 Returns the managed counterpart of the unmanaged array.
Top
See Also
Reference
SimpleArrayGuid Class
Rhino.Runtime.InteropWrappers Namespace