RhinoCommon API
OptionString Methods
The OptionString type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
OptionString Class
Rhino.Input.Custom Namespace