RhinoCommon API
BezierCurve Methods
The BezierCurve type exposes the following members.
Methods
Name | Description
ChangeDimension
Change dimension of bezier.
CreateBeziers
 Create an array of Bezier curves that fit to an existing curve. Please note, these Beziers can be of any order and may be rational.
CreateCubicBeziers
 Constructs an array of cubic, non-rational Beziers that fit a curve to a tolerance.
CreateLoftedBezier(IEnumerable<Point2d>)
 Loft a bezier through a list of points
CreateLoftedBezier(IEnumerable<Point3d>)
 Loft a bezier through a list of points
CurvatureAt
Evaluate the curvature vector at a curve parameter.
Derivative
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetBoundingBox
 Bounding box solver. Gets the world axis aligned bounding box for the curve.
GetControlVertex2d
Get location of a control vertex.
GetControlVertex3d
Gets the 3D location of a control vertex at the specified index.
GetControlVertex4d
 Gets the homogeneous (4D) value of a control vertex at the specified index.
GetObjectData
 Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
IncreaseDegree
Increase degree of bezier
MakeNonRational
Make bezier non-rational
MakeRational
Make bezier rational
PointAt
Evaluates point at a curve parameter.
Split
 Divides the Bezier curve at the specified parameter.
TangentAt
Evaluates the unit tangent vector at a curve parameter.
ToNurbsCurve
 Constructs a NURBS curve representation of this curve.
Top
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace