RhinoCommon API
FileAmf Methods
The FileAmf type exposes the following members.
Methods
Name | Description
Write
Write a amf file based on the contents of a RhinoDoc
Top
See Also
Reference
FileAmf Class
Rhino.FileIO Namespace