RhinoCommon API
RTree Methods
The RTree type exposes the following members.
Methods
Name | Description
Clear
 Removes all elements.
CreateFromPointArray
 Constructs a new tree with an element for each point cloud point.
CreateMeshFaceTree
 Constructs a new tree with an element for each face in the mesh. The element id is set to the index of the face.
CreatePointCloudTree
 Constructs a new tree with an element for each point cloud point.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Insert(BoundingBox, Int32)
Inserts an element into the tree.
Insert(BoundingBox, IntPtr)
Inserts an element into the tree.
Insert(Point2d, Int32)
Inserts an element into the tree.
Insert(Point2d, IntPtr)
Inserts an element into the tree.
Insert(Point3d, Int32)
Inserts an element into the tree.
Insert(Point3d, IntPtr)
Inserts an element into the tree.
Point3dClosestPoints
 Finds the point in a list of 3D points that is closest to a test point.
Point3dKNeighbors
 Finds a certain amount of points in a list of 3D points that are the k-closest to a test point.
PointCloudClosestPoints
 Finds the point in a list of 3D points that is closest to a test point.
PointCloudKNeighbors
 Finds a certain amount of points in a list of 3D points that are the k-closest to a test point.
Remove(BoundingBox, Int32)
Removes an element from the tree.
Remove(BoundingBox, IntPtr)
Removes an element from the tree.
Remove(Point2d, Int32)
Removes an element from the tree.
Remove(Point3d, Int32)
Removes an element from the tree.
Remove(Point3d, IntPtr)
Removes an element from the tree.
Search(BoundingBox, EventHandler<RTreeEventArgs>)
 Searches for items in a bounding box.
The bounding box can be singular and contain exactly one single point.
Search(Sphere, EventHandler<RTreeEventArgs>)
 Searches for items in a sphere.
Search(BoundingBox, EventHandler<RTreeEventArgs>, Object)
 Searches for items in a bounding box.
The bounding box can be singular and contain exactly one single point.
Search(Sphere, EventHandler<RTreeEventArgs>, Object)
 Searches for items in a sphere.
SearchOverlaps(Double, EventHandler<RTreeEventArgs>, Object)
 Searches for pairs of bounding boxes that overlap.
SearchOverlaps(RTree, RTree, Double, EventHandler<RTreeEventArgs>)
 Searches two R-trees for all pairs elements whose bounding boxes overlap.
Top
See Also
Reference
RTree Class
Rhino.Geometry Namespace