RhinoCommon API
PostProcessFrameBufferEventArgs Methods
The PostProcessFrameBufferEventArgs type exposes the following members.
Methods
Name | Description
TryCopyFrameBuffer(Byte[], Int32)
 Copies the frame into a caller owned array as 32 bit BGRA, with every pixel made opaque. Reuse one array across frames; allocating per frame defeats the point of this event.
TryCopyFrameBuffer(Byte[], Int32, Boolean)
 Copies the frame into a caller owned array as 32 bit BGRA. Reuse one array across frames; allocating per frame defeats the point of this event.
TryCopyFrameBuffer(IntPtr, Int32, Int32)
 Copies the frame into caller owned memory as 32 bit BGRA, with every pixel made opaque.
TryCopyFrameBuffer(IntPtr, Int32, Int32, Boolean)
 Copies the frame into caller owned memory as 32 bit BGRA.
Top
See Also
Reference
PostProcessFrameBufferEventArgs Class
Rhino.Display Namespace