RhinoCommon API
ICollapsibleSection2 Methods
The ICollapsibleSection2 type exposes the following members.
Methods
Name | Description
EnableHeaderButton
NewHeaderButtonHandler
OnAttachedToHolder
OnAttachingToHolder
OnDetachedFromHolder
OnDetachingFromHolder
ShowHeaderButton
Top
See Also
Reference
ICollapsibleSection2 Interface
Rhino.UI.Controls Namespace