RhinoCommon API
MeshingParameters Methods
The MeshingParameters type exposes the following members.
Methods
Name | Description
CopyFrom
 Call this method to copy MeshingParameters from another instance.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
DocumentCurrentSetting
 Gets the MeshingParameters that are currently set for a document. These are the same settings that are shown in the DocumentProperties "mesh settings" user interface.
Equals(MeshingParameters)
 Determines whether the specified MeshingParameters has the same values as the present MeshingParameters.
Equals(Object)
 Determines whether the specified MeshingParameters has the same values as the present MeshingParameters.
 (Overrides Object.Equals(Object).)
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
FromEncodedString
 Converts encoded serialized string into a MeshingParameters
GetHashCode
 Computes a hash number that represents the current MeshingParameters.
 (Overrides Object.GetHashCode().)
GetObjectData
Populates a SerializationInfo with the data needed to serialize the target object.
SetSubDDisplayParameters
 Sets the SubD display parameters.
SubDDisplayParameters
 Gets the SubD display parameters.
ToEncodedString
 Returns a encoded string that represents the MeshingParameters.
Top
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace