RhinoCommon API
File3dsReadOptions Methods
The File3dsReadOptions type exposes the following members.
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
File3dsReadOptions Class
Rhino.FileIO Namespace