RhinoCommon API
IRhRdkContentThumbnail Methods
The IRhRdkContentThumbnail type exposes the following members.
Methods
Name | Description
ChildContent
GroupId
TopLevelContent
Top
See Also
Reference
IRhRdkContentThumbnail Interface
Rhino.UI.Controls.ThumbnailUI Namespace