RhinoCommon API
ColorHSL Methods
The ColorHSL type exposes the following members.
Methods
Name | Description
CreateFromCMYK
 Create the nearest HSL equivalent of a CMYK color.
CreateFromHSV
 Constructs the nearest HSL equivalent of an HSV color.
CreateFromLAB
 Create the nearest HSL equivalent of a LAB color.
CreateFromLCH
 Create the nearest HSL equivalent of a LCH color.
CreateFromRGBA
 Create the nearest HSL equivalent of a RGBA color.
CreateFromXYZ
 Create the nearest HSL equivalent of an XYZ color.
ToArgbColor
 Convert HSL color to an equivalent System.Drawing.Color.
Top
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace