RhinoCommon API
RhinoViewport Methods
The RhinoViewport type exposes the following members.
Methods
Name | Description
ChangeToParallelProjection
 Use this function to change projections of valid viewports from perspective to parallel. It will make common additional adjustments to the frustum so the resulting views are similar. The camera location and direction will not be changed.
ChangeToParallelReflectedProjection
 When a viewport is set to Parallel Reflected projection, the geometry on the ceiling is shown as if it is mirrored to the floor below.
ChangeToPerspectiveProjection(Boolean, Double)
 Use this function to change projections of valid viewports from parallel to perspective. It will make common additional adjustments to the frustum and camera location so the resulting views are similar. The camera direction and target point are not be changed.
ChangeToPerspectiveProjection(Double, Boolean, Double)
 Use this function to change projections of valid viewports from parallel to perspective. It will make common additional adjustments to the frustum and camera location so the resulting views are similar. The camera direction and target point are not be changed.
ChangeToTwoPointPerspectiveProjection(Double)
 Use this function to change projections of valid viewports to a two point perspective. It will make common additional adjustments to the frustum and camera location and direction so the resulting views are similar.
ChangeToTwoPointPerspectiveProjection(Double, Vector3d, Double)
 Use this function to change projections of valid viewports to a two point perspective. It will make common additional adjustments to the frustum and camera location and direction so the resulting views are similar.
ClearTraceImage
 Remove trace image (background bitmap) for this viewport if one exists.
ClientToScreen(Point)
ClientToScreen(Point2d)
ClientToWorld(Point)
ClientToWorld(Point2d)
ConstructionPlane
 Simple plane information for this viewport's construction plane. If you want detailed construction plane information, use GetConstructionPlane.
DeleteAllUserStrings
DeleteUserString
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
FromId
 Call this method to get the viewport with the specified Id.
GetCameraAngle
GetCameraExtents
GetCameraFrame
 Gets the camera plane.
GetConstructionPlane
GetDepth(Point3d, Double)
Gets clipping distance of a point.
GetDepth(BoundingBox, Double, Double)
 Gets near and far clipping distances of a bounding box.
GetDepth(Sphere, Double, Double)
 Gets near and far clipping distances of a sphere.
GetFarRect
Get corners of far clipping plane rectangle.
GetFrustum
 Gets the view frustum.
GetFrustumBottomPlane
Get bottom world frustum clipping plane.
GetFrustumBoundingBox
GetFrustumCenter
 Returns world coordinates of frustum's center.
GetFrustumFarPlane
Get far clipping plane.
GetFrustumLeftPlane
Get left world frustum clipping plane.
GetFrustumLine
 Gets the world coordinate line in the view frustum that projects to a point on the screen.
GetFrustumNearPlane
Get near clipping plane.
GetFrustumRightPlane
Get right world frustum clipping plane.
GetFrustumTopPlane
Get top world frustum clipping plane.
GetNearRect
Get corners of near clipping plane rectangle.
GetPickTransform(Point)
 Takes a rectangle in screen coordinates and returns a transformation that maps the 3d frustum defined by the rectangle to a -1/+1 clipping coordinate box. This takes a single point and inflates it by Rhino.ApplicationSettings.ModelAidSettings.MousePickBoxRadius to define the screen rectangle.
GetPickTransform(Rectangle)
 Takes a rectangle in screen coordinates and returns a transformation that maps the 3d frustum defined by the rectangle to a -1/+1 clipping coordinate box.
GetPickTransform(Int32, Int32)
 Takes a rectangle in screen coordinates and returns a transformation that maps the 3d frustum defined by the rectangle to a -1/+1 clipping coordinate box. This takes a single point and inflates it by Rhino.ApplicationSettings.ModelAidSettings.MousePickBoxRadius to define the screen rectangle.
GetScreenPort
 Location of viewport in pixels. These are provided so you can set the port you are using and get the appropriate transformations to and from screen space.
GetTransform
 Gets a transform from origin coordinate system to a target coordinate system.
GetUserString
 Gets a user string.
GetUserStrings
 Gets an independent copy of the collection of (user text key, user text value) pairs attached to this object.
GetViewScale
 Get Scale transform applied to the viewport
GetWorldToScreenScale
 Gets the world to screen size scaling factor at a point in frustum.
IsVisible(BoundingBox)
 Returns true if some portion of a world coordinate bounding box is potentially visible in the viewing frustum.
IsVisible(Point3d)
 Determines if a world coordinate point is visible in the viewing frustum.
KeyboardDolly
 Emulates the keyboard arrow key in terms of interaction.
KeyboardDollyInOut
 Emulates the keyboard arrow key in terms of interaction.
KeyboardRotate
 Emulates the keyboard arrow key in terms of interaction.
LastLensLength
 Returns the lens length of this viewport the last time it was using perspective projection in this session.
Magnify(Double, Boolean)
 Zooms or dollies in order to scale the viewport projection of observed objects.
Magnify(Double, Boolean, Point)
 Zooms or dollies in order to scale the viewport projection of observed objects.
MouseAdjustLensLength
 Adjusts the camera lens length.
MouseDollyZoom
 Zooms lens (thus adjusting the field of view) while moving the camera.
MouseInOutDolly
 Moves the camera towards or away from the view maintaining focus on the view.
MouseLateralDolly
 Pans the camera
MouseMagnify
 Moves the camera towards or away from the view.
MouseRotateAroundTarget
 Rotates the viewport around target.
MouseRotateCamera
 Rotates the view around the camera location.
MouseTilt
 Tilts the camera view.
NextConstructionPlane
 Sets the construction plane to the plane that was active before the last call to PreviousConstructionPlane.
NextViewProjection
 Sets the view projection and target to the settings that were active before the last call to PrevView.
PopConstructionPlane
 Sets the construction plane to the plane that was active before the last call to PushConstructionPlane.
PopViewProjection
 Sets the view projection and target to the settings at the top of the view stack and removes those settings from the view stack.
PreviousConstructionPlane
 Sets the construction plane to the plane that was active before the last call to NextConstructionPlane or SetConstructionPlane.
PreviousViewProjection
 Sets the view projection and target to the settings that were active before the last call to NextViewProjection.
PushConstructionPlane
 Pushes the current construction plane on the viewport's construction plane stack and sets the construction plane to cplane.
PushViewInfo
PushViewProjection
 Appends the current view projection and target to the viewport's view stack.
Rotate
 Rotates about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule).
ScreenToClient
SetCameraDirection
 Set viewport camera direction. By default the target location is changed so that the vector from the camera location to the target is parallel to the camera direction.
SetCameraLocation
 Set viewport camera location. By default the target location is changed so that the vector from the camera location to the target is parallel to the camera direction vector.
SetCameraLocations
 Set viewport camera location and target location. The camera direction vector is changed so that it is parallel to the vector from the camera location to the target location.
SetCameraTarget
 Set viewport target point. By default the camera location is translated so that the camera direction vector is parallel to the vector from the camera location to the target location.
SetClippingPlanes
 Sets optimal clipping planes to view objects in a world coordinate 3d bounding box.
SetConstructionPlane(ConstructionPlane)
 Sets the construction plane to cplane.
SetConstructionPlane(Plane)
SetProjection(DefinedViewportProjection, String, Boolean)
 Set viewport to a defined projection.
SetProjection(IsometricCamera, String, Boolean)
 Set viewport to a defined projection.
SetScreenPort
 Location of viewport in pixels. These are provided so you can set the port you are using and get the appropriate transformations to and from screen space.
SetToPlanView
SetTraceImage
 Set trace image (background bitmap) for this viewport.
SetUserString
 Attach a user string (key,value combination) to this geometry.
SetUserStrings
 Attach a user string (key,value combination) to this viewport.
SetViewProjection
 Sets the viewport camera projection.
SetWallpaper(String, Boolean)
SetWallpaper(String, Boolean, Boolean)
WorldToClient
 Convert a point from world coordinates in the viewport to a 2d screen point in the local coordinates of the viewport (X/Y of point is relative to top left corner of viewport on screen)
ZoomBoundingBox
 Zooms the viewport to the given bounding box.
ZoomExtents
 Dollies the camera location and so that the view frustum contains all of the selected document objects that can be seen in view. If the projection is perspective, the camera angle is not changed.
ZoomExtentsSelected
 Dollies the camera location and so that the view frustum contains all of the selected document objects that can be seen in view. If the projection is perspective, the camera angle is not changed.
ZoomWindow
 Zooms the viewport to the given rectangle.
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace