RhinoCommon API
UserInterfaceCheckBox Methods
The UserInterfaceCheckBox type exposes the following members.
Methods
Name | Description
OnCheckedChanged
 Called after a click has changed the state. A click turns an indeterminate check box on. The default implementation raises the CheckedChanged event.
Top
See Also
Reference
UserInterfaceCheckBox Class
Rhino.UI Namespace