RhinoCommon API
MaterialRefs Methods
The MaterialRefs type exposes the following members.
Methods
Name | Description
Add(KeyValuePair<Guid, MaterialRef>)
 Adds an item to this dictionary.
Add(Guid, MaterialRef)
 Add or replace an element with the provided key and value to this dictionary.
Clear
 Removes all items from this dictionary.
Contains
 Determines whether this dictionary contains a specific value.
ContainsKey
 Determines whether this dictionary contains an MaterialRef with the specified plug-in id.
CopyTo
 Copies the elements of this dictionary to an System.Array, starting at a particular System.Array index.
Create
 Call this method to create a MaterialRef which can be used when calling one of the Add methods.
GetEnumerator
 Returns an enumerator that iterates through this dictionary.
Remove(Guid)
 Removes the MaterialRef with the specified plug-in Id from this dictionary.
Remove(KeyValuePair<Guid, MaterialRef>)
 Removes the element with the specified plug-in id from the this dictionary.
TryGetValue
 Gets the value associated with the specified key.
Top
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace