RhinoCommon API
Cylinder Methods
The Cylinder type exposes the following members.
Methods
Name | Description
CircleAt
 Compute the circle at the given elevation parameter.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
LineAt
 Compute the line at the given angle parameter. This line will be degenerate if the cylinder is infinite.
ToBrep
 Constructs a Brep representation of this Cylinder. This is synonymous with calling NurbsSurface.CreateFromCylinder().
ToNurbsSurface
 Constructs a Nurbs surface representation of this cylinder. This is synonymous with calling NurbsSurface.CreateFromCylinder().
ToRevSurface
 Constructs a RevSurface representation of this Cylinder. This is synonymous with calling RevSurface.CreateFromCylinder().
Transform
 Transforms this cylinder. Note that non-similarity preserving transformations cannot be applied to a cylinder.
Top
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace