RhinoCommon API
PythonCompiledCode Methods
The PythonCompiledCode type exposes the following members.
Methods
Name | Description
Execute
 Executes the script in a specific scope.
Top
See Also
Reference
PythonCompiledCode Class
Rhino.Runtime Namespace