RhinoCommon API
FileGltf Methods
The FileGltf type exposes the following members.
Methods
Name | Description
Write
Write a glTF file based on the contents of a RhinoDoc
Top
See Also
Reference
FileGltf Class
Rhino.FileIO Namespace