RhinoCommon API
FileEps Methods
The FileEps type exposes the following members.
Methods
Name | Description
Read
Read a Eps file into a RhinoDoc
Top
See Also
Reference
FileEps Class
Rhino.FileIO Namespace