RhinoCommon API
TextureGraphInfo Methods
The TextureGraphInfo type exposes the following members.
Methods
Name | Description
ActiveAxis
ActiveChannel
AmountU
AmountV
AmountW
Dispose
Finalize |  (Overrides Object.Finalize().)
SetActiveAxis
SetActiveChannel
SetAmountU
SetAmountV
SetAmountW
Top
See Also
Reference
TextureGraphInfo Class
Rhino.Render Namespace