RhinoCommon API
File3dmLayerTable Methods
The File3dmLayerTable type exposes the following members.
Methods
Name | Description
AddDefaultLayer
 Easy way to add a default layer to the model.
AddLayer(String, Color)
 Easy way to add a new layer to the model.
AddLayer(String, Color, Guid)
 Add a new layer to the model.
FindIndex
 Retrieves a Layer object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds a Layer given its name.
FindNameHash
 Finds a Layer given its name hash.
Top
See Also
Reference
File3dmLayerTable Class
Rhino.FileIO Namespace