RhinoCommon API
Matrix Methods
The Matrix type exposes the following members.
Methods
Name | Description
BackSolve
 Solves M*x=b where M is upper triangular with a unit diagonal and b is a column of values.
BackSolvePoints
 Solves M*x=b where M is upper triangular with a unit diagonal and b is a column of 3d points.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Duplicate
 Create a duplicate of this matrix.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetHashCode
 Gets the hash code for this matrix. The hash code will change when the matrix changes so you cannot change matrices while they are stored in hash tables.
 (Overrides Object.GetHashCode().)
GetObjectData
 Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
Invert
 Modifies this matrix to become its own inverse.
Matrix might be non-invertible (singular) and the return value will be false.
RowReduce(Double, Point3d[], Double)
 Row reduces a matrix as the first step in solving M*X=b where b is a column of 3d points.
RowReduce(Double, Double, Double)
Row reduces a matrix to calculate rank and determinant.
RowReduce(Double, Double[], Double)
 Row reduces a matrix as the first step in solving M*X=b where b is a column of values.
Scale
 Modifies the current matrix by multiplying its values by a number.
SetDiagonal
 Sets diagonal value and zeros off all non-diagonal values.
SwapColumns
 Exchanges two columns.
SwapRows
 Exchanges two rows.
Transpose
 Modifies this matrix to be its transpose.
This is like swapping rows with columns.
http://en.wikipedia.org/wiki/Transpose
Zero
 Sets all values inside the matrix to zero.
Top
See Also
Reference
Matrix Class
Rhino.Geometry Namespace