RhinoCommon API
GumballPickResult Methods
The GumballPickResult type exposes the following members.
Methods
Name | Description
SetToDefault
Top
See Also
Reference
GumballPickResult Class
Rhino.UI.Gumball Namespace