RhinoCommon API
ComponentStatus Methods
The ComponentStatus type exposes the following members.
Methods
Name | Description
Equals(ComponentStatus)
 Determines if another ComponentStatus and this are equal.
Equals(Object)
 Determines if an object and this are equal.
 (Overrides ValueType.Equals(Object).)
GetHashCode
 Serves as a special hash function. The inner value is used for the purpose.
 (Overrides ValueType.GetHashCode().)
HasAllEqualStates
 For the purposes of this test, Selected and SelectedPersistent are considered equal.
HasNoEqualStates
 For the purposes of this test, Selected and SelectedPersistent are considered equal.
HasSomeEqualStates
 For the purposes of this test, Selected and SelectedPersistent are considered equal.
ToString
 Provides a string representation of this ComponentStatus.
 (Overrides ValueType.ToString().)
WithStates
 Activates any information flag described in any of the two input component statuses and returns a new ComponentStatus with those flags checked.
Top
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace