RhinoCommon API
RhinoSettings Methods
The RhinoSettings type exposes the following members.
Methods
Name | Description
ActiveView
Dispose
Finalize |  (Overrides Object.Finalize().)
GetCurrentRenderer
GetCustomRenderSizes
GetRenderSettings
GroundPlaneOnInViewDisplayMode
RenderingView
SetCurrentRenderer
SetGroundPlaneOnInViewDisplayMode
SetRenderSettings
ViewSupportsShading
Top
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace