RhinoCommon API
SubDComponent Methods
The SubDComponent type exposes the following members.
Methods
Name | Description
Equals(Object)
 Determines whether an object is a SubDComponent referring to the same component, with the same orientation, in the same SubD.
 (Overrides Object.Equals(Object).)
Equals(SubDComponent)
 Determines whether this component and another refer to the same component, with the same orientation, in the same SubD.
GetHashCode
 Gets a hash code for this component.
 (Overrides Object.GetHashCode().)
ReverseComponentDirection
 Flips ComponentDirection and returns this component, so it can be used inline where an oppositely oriented reference is wanted.
ToString
 Returns a string of the form "SubDEdge(+12)", naming the component type, the orientation it is referenced with, and its id.
 (Overrides Object.ToString().)
Top
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace