RhinoCommon API
FileDgn Methods
The FileDgn type exposes the following members.
Methods
Name | Description
Read
Read a dgn file into a RhinoDoc
Top
See Also
Reference
FileDgn Class
Rhino.FileIO Namespace