RhinoCommon API
RdkUndoRecord Methods
The RdkUndoRecord type exposes the following members.
Methods
Name | Description
Dispose
 Dispose for RdkUndoRecord
Finalize
 Destructor for RdkUndoRecord
 (Overrides Object.Finalize().)
SetDescription
 Set description for RdkUndoRecord
Top
See Also
Reference
RdkUndoRecord Class
Rhino.Render Namespace