RhinoCommon API
FileIgs Methods
The FileIgs type exposes the following members.
Methods
Name | Description
Write
Write a Igs file based on the contents of a RhinoDoc
Top
See Also
Reference
FileIgs Class
Rhino.FileIO Namespace