RhinoCommon API
ColorRGBA Methods
The ColorRGBA type exposes the following members.
Methods
Name | Description
ApplyGamma
BlendTo
CompareTo
 Compares this ColorRGBA with another ColorRGBA.
Channels evaluation priority is first A, then R, then G, then B.
CreateFromArgb(Byte, Byte, Byte)
 Constructs a RGBA color from the specified 8-bit components (red, green, and blue) values. The alpha value is implicitly 1.0 (fully opaque).
CreateFromArgb(Byte, Byte, Byte, Byte)
 Constructs a RGBA color from the four ARGB components (alpha, red, green, and blue) values.
CreateFromCMYK
 Create the nearest RGBA equivalent of a CMYK color.
CreateFromHSL
 Constructs the nearest RGBA equivalent of an HSV color.
CreateFromHSV
 Constructs the nearest RGBA equivalent of an HSL color.
CreateFromLAB
 Create the nearest RGBA equivalent of a LAB color.
CreateFromLCH
 Create the nearest RGBA equivalent of a LCH color.
CreateFromXYZ
 Create the nearest RGBA equivalent of an XYZ color.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(ColorRGBA)
 Determines whether the specified ColorRGBA has the same values as the present color.
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToArgb
 Converts this color to a 32-bit ARGB value.
ToString() |  (Overrides ValueType.ToString().)
ToString(String, IFormatProvider)
Top
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace