RhinoCommon API
BrepEdgeList Methods
The BrepEdgeList type exposes the following members.
Methods
Name | Description
Add(Int32)
 Create and add a new edge to this list
Add(BrepVertex, BrepVertex, Int32, Double)
 Create and add a new edge to this list
Add(Int32, Int32, Int32, Double)
 Create and add a new edge to this list
Add(BrepVertex, BrepVertex, Int32, Interval, Double)
 Create and add a new edge to this list
Add(Int32, Int32, Int32, Interval, Double)
 Create and add a new edge to this list
GetEnumerator
 Gets an enumerator that visits all edges.
MergeAllEdges
 Merges all possible Brep edges. Edges across kinks cannot be merged. A pair of adjacent edges in a Brep are mergeable if the angle between them is less than tolerance and the valence of the shared vertex is 2.
MergeEdge
 Merge adjacent edges to a specified edge recursively. A pair of adjacent edges in a Brep are mergeable if the angle between them is less than tolerance and the valence of the shared vertex is 2.
RemoveNakedMicroEdges(Double)
 Finds any naked edges with the same start and end vertex and an arc-length less than tolerance and attempts to remove them by removing trims and extending the adjacent to meet.
RemoveNakedMicroEdges(Double, Boolean)
 Finds any naked edges with the same start and end vertex and an arc-length less than tolerance and attempts to remove them by removing trims and extending the adjacent to meet.
SplitEdgeAtParameters
 Splits an edge at the specified parameters.
SplitKinkyEdge
Splits the edge into G1 pieces.
Top
See Also
Reference
BrepEdgeList Class
Rhino.Geometry.Collections Namespace