RhinoCommon API
FileSwReadOptions Methods
The FileSwReadOptions type exposes the following members.
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Import function
Top
See Also
Reference
FileSwReadOptions Class
Rhino.FileIO Namespace