RhinoCommon API
Thumbnail Methods
The Thumbnail type exposes the following members.
Methods
Name | Description
Dib
Dispose
 Dispose for Thumbnail
Finalize
 Destructor for Thumbnail
 (Overrides Object.Finalize().)
GetDib
GetDisplayRect
Id
IsHot
IsSelected
Label
Top
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace