RhinoCommon API
MeshUnsafeLock Methods
The MeshUnsafeLock type exposes the following members.
Methods
Name | Description
FaceNormalsArray
 Retrieves a pointer to the raw mesh face normals array, which uses vectors defined with single precision floating point numbers, or throws an exception if none is available.
FacesArray
 Retrieves a pointer to the raw faces array, which uses 4 integers for each face. MeshFace.
NormalVector3fArray
 Retrieves a pointer to the raw mesh vertex normal array, which uses vectors defined with single precision floating point numbers, or throws an exception if none is available.
Release
 Releases the lock and updates the underlying unmanaged data structures.
VertexColorsArray
 Retrieves a pointer to the raw mesh vertex colors array, which uses RGBA integers or throws an exception if none is available.
VertexPoint3dArray
 Retrieves a pointer to the raw mesh vertex array, which uses coordinates defined with double precision floating point numbers, or throws an exception if none is available.
VertexPoint3fArray
 Retrieves a pointer to the raw mesh vertex array, which uses coordinates defined with single precision floating point numbers, or null if none is available.
Top
See Also
Reference
MeshUnsafeLock Class
Rhino.Geometry Namespace