RhinoCommon API
File3dmRenderTextures Methods
The File3dmRenderTextures type exposes the following members.
Methods
Name | Description
Find
 Finds a texture by its id, if possible. Returns null on failure.
GetEnumerator
Top
See Also
Reference
File3dmRenderTextures Class
Rhino.FileIO Namespace