RhinoCommon API
ExtensionMethods Methods
The ExtensionMethods type exposes the following members.
Methods
Name | Description
ToEnvironmentMappingMode
ToSimulatedEnvironmentMappingMode
ToSimulatedTextureProjectionMode
ToTextureProjectionMode
Top
See Also
Reference
ExtensionMethods Class
Rhino.Render Namespace