RhinoCommon API
CalculateBoundingBoxEventArgs Methods
The CalculateBoundingBoxEventArgs type exposes the following members.
Methods
Name | Description
IncludeBoundingBox
 Unites a bounding box with the current display bounding box in order to ensure dynamic objects in "box" are drawn.
Top
See Also
Reference
CalculateBoundingBoxEventArgs Class
Rhino.Display Namespace