RhinoCommon API
StdVectorGuid Methods
The StdVectorGuid type exposes the following members.
Methods
Name | Description
Append
 Appends a new Guid at the end of this vector.
ConstPointer
 Gets the constant (immutable) pointer of this vector.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this vector.
ToArray
 Returns the managed counterpart of the unmanaged vector.
Top
See Also
Reference
StdVectorGuid Class
Rhino.Runtime.InteropWrappers Namespace