RhinoCommon API
FileExportPlugIn Methods
The FileExportPlugIn type exposes the following members.
Methods
Name | Description
AddFileTypes
DisplayOptionsDialog
WriteFile
Top
See Also
Reference
FileExportPlugIn Class
Rhino.PlugIns Namespace