RhinoCommon API
Point3dList Methods
The Point3dList type exposes the following members.
Methods
Name | Description
Add(Double, Double, Double)
 Adds a Point3d to the end of the list with given x,y,z coordinates.
ClosestIndex
 Finds the index of the point that is closest to a test point in this list.
ClosestIndexInList
 Finds the index of the point in a list of points that is closest to a test point.
ClosestPointInList
 Finds the point in a list of points that is closest to a test point.
Duplicate
 Returns a deep copy of this point list instance.
Equals(Object)
 Overrides the default object equality to compare lists by value.
 (Overrides Object.Equals(Object).)
Equals(Point3dList)
 Determines if the point lists are exactly equal.
GetHashCode
 Creates a hash code for this object.
 (Overrides Object.GetHashCode().)
SetAllX
 Set all the X values for the points to a single value
SetAllY
 Set all the Y values for the points to a single value
SetAllZ
 Set all the Z values for the points to a single value
Transform
 Applies a transform to all the points in the list.
Top
See Also
Reference
Point3dList Class
Rhino.Collections Namespace