RhinoCommon API
LinearWorkflow Methods
The LinearWorkflow type exposes the following members.
Methods
Name | Description
CopyFrom
 Copy from another linear workflow object.
 (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Dispose
Equals
 Compare two LinearWorkflow objects. They are considered equal if their hashes match.
 (Overrides Object.Equals(Object).)
Finalize
 (Overrides FreeFloatingBase.Finalize().)
GetHashCode
 Get hash code for this object. It is the Hash property cast to int.
 (Overrides Object.GetHashCode().)
Top
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace