RhinoCommon API
InstanceDefinition Methods
The InstanceDefinition type exposes the following members.
Methods
Name | Description
CreatePreviewBitmap(DefinedViewportProjection, Size)
 Creates a wireframe preview bitmap of the instance definition.
CreatePreviewBitmap(DefinedViewportProjection, DisplayMode, Size)
 Creates a preview bitmap of the instance definition.
CreatePreviewBitmap(DefinedViewportProjection, Size, Boolean)
 Creates a wireframe preview bitmap of the instance definition.
CreatePreviewBitmap(DefinedViewportProjection, DisplayMode, Size, Boolean)
 Creates a preview bitmap of the instance definition.
CreatePreviewBitmap(Guid, DefinedViewportProjection, DisplayMode, Size, Boolean)
 Creates a preview bitmap of the instance definition.
CreatePreviewBitmap(Guid, DefinedViewportProjection, IsometricCamera, Boolean, Size, Boolean)
 Creates a preview bitmap of the instance definition.
Equals
 Equality is checked against InstanceDefinition.Id
 (Overrides Object.Equals(Object).)
GetContainers
 Gets a list of all the InstanceDefinitions that contain a reference this InstanceDefinition.
GetHashCode
 Use Id.GetHashCode()
 (Overrides Object.GetHashCode().)
GetObjects
 Gets an array with the objects that belong to this instance definition.
GetReferences
 Gets a list of the CRhinoInstanceObjects (inserts) that contains a reference this instance definition.
InUse
 Determines whether the instance definition is referenced.
Object
 returns an object used as part of this definition.
UseCount()
 Returns the number of references of this instance definition in the model. Both top-level references and nested instances are included in the count.
UseCount(Int32, Int32)
 Returns the number of references of this instance definition in the model. Both top-level references and nested instances are included in the count.
UsesDefinition
 Determines if this instance definition contains a reference to another instance definition.
UsesLayer
 Returns true if some object in the instance definition is on the layer with the specified layer index.
UsesLinetype
 Returns true if some object in the instance definition references the linetype with the specified linetype index.
Top
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace