RhinoCommon API
SubDEdgeChain Methods
The SubDEdgeChain type exposes the following members.
Methods
Name | Description
AddAllNeighbors
 Extends the chain as far as it will go at one or both ends.
AddEdge
 Adds an edge to whichever end of the chain it connects to.
AddOneNeighbor
 Extends the chain by one edge at one or both ends.
Begin
 Clears the chain and restarts it from a single edge.
Clear
 Removes every edge from the chain.
Dispose
 Frees the unmanaged chain.
EdgeAt
 Gets the edge at the given position in the chain. The returned edge carries the direction the chain traverses it with, in ComponentDirection.
Finalize
 Finalizer.
 (Overrides Object.Finalize().)
IsConvexLoop
 True when the chain is a closed loop that is convex.
Reverse
 Reverses the direction of the chain.
SortEdgesIntoEdgeChains
 Sorts a set of edges into chains.
ToLoftCurve
 Gets a NURBS curve suitable for lofting SubDs, following this chain.
ToNurbsCurve
 Gets a NURBS curve on the SubD surface following this chain.
TrimToRange
 Trims the chain down to the run of edges between firstEdge and lastEdge, removing everything before firstEdge and everything after lastEdge.
VertexAt
 Gets the vertex at the given position along the chain. A chain of N edges has N+1 vertices, or N when it is a closed loop.
Top
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace