RhinoCommon API
Skylight Methods
The Skylight type exposes the following members.
Methods
Name | Description
ToString
 Textual representation of Skylight
 (Overrides Object.ToString().)
Top
See Also
Reference
Skylight Class
Rhino.Render.ChangeQueue Namespace