RhinoCommon API
FileFbxWriteOptions Methods
The FileFbxWriteOptions type exposes the following members.
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
FileFbxWriteOptions Class
Rhino.FileIO Namespace