RhinoCommon API
RenderChannels Methods
The RenderChannels type exposes the following members.
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Dispose
Finalize |  (Overrides FreeFloatingBase.Finalize().)
Top
See Also
Reference
RenderChannels Class
Rhino.Render Namespace