RhinoCommon API
GeometryBase Methods
The GeometryBase type exposes the following members.
Methods
Name | Description
ComponentIndex
 If this piece of geometry is a component in something larger, like a BrepEdge in a Brep, then this function returns the component index.
DataCRC
 Returns a CRC calculated from the information that defines the object. This CRC can be used as a quick way to see if two objects are not identical.
DeleteAllUserStrings
DeleteUserString
Dispose(Boolean)
 Overridden in order to destroy local display cache information
 (Overrides CommonObject.Dispose(Boolean).)
Duplicate
 Constructs a deep (full) copy of this object.
DuplicateShallow
 Constructs a light copy of this object. By "light", it is meant that the same underlying data is used until something is done to attempt to change it. For example, you could have a shallow copy of a very heavy mesh object and the same underlying data will be used when doing things like inspecting the number of faces on the mesh. If you modify the location of one of the mesh vertices, the shallow copy will create a full duplicate of the underlying mesh data and the shallow copy will become a deep copy.
GeometryEquals
 Determines if two geometries equal one another, in pure geometrical shape. This version only compares the geometry itself and does not include any user data comparisons. This is a comparison by value: for two identical items it will be true, no matter where in memory they may be stored.
GeometryReferenceEquals
 Determines if two objects are respectively shallow copies, new managed instantiations of the same geometry, or similar internal references to the exact same geometry, both in managed and in unmanaged code.
GetBoundingBox(Boolean)
 Bounding box solver. Gets the world axis aligned bounding box for the geometry.
GetBoundingBox(Plane)
 Aligned Bounding box solver. Gets the plane aligned bounding box.
GetBoundingBox(Transform)
 Aligned Bounding box solver. Gets the world axis aligned bounding box for the transformed geometry.
GetBoundingBox(Plane, Box)
 Aligned Bounding box solver. Gets the plane aligned bounding box.
GetOverlaps
 Detects overlapping regions among a set of input objects after they are orthogonally projected onto the supplied plane, and reports what should happen to each input object so that the overlaps can be removed.
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
MakeDeformable
 If possible, converts the object into a form that can be accurately modified with "squishy" transformations like projections, shears, an non-uniform scaling.
MemoryEstimate
 Computes an estimate of the number of bytes that this object is using in memory.
NonConstOperation
 Destroy cache handle
 (Overrides CommonObject.NonConstOperation().)
OnSwitchToNonConst
 Is called when a non-constant operation occurs.
 (Overrides CommonObject.OnSwitchToNonConst().)
Rotate
 Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule).
Scale
 Scales the object by the specified factor. The scale is centered at the origin.
SetUserString
 Attach a user string (key,value combination) to this geometry.
Transform
 Transforms the geometry. If the input Transform has a SimilarityType of OrientationReversing, you may want to consider flipping the transformed geometry after calling this function when it makes sense. For example, you may want to call Flip() on a Brep after transforming it.
Translate(Vector3d)
Translates the object along the specified vector.
Translate(Double, Double, Double)
Translates the object along the specified vector.
Top
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace