RhinoCommon API
IPlatformServiceLocator Methods
The IPlatformServiceLocator type exposes the following members.
Methods
Name | Description
GetService<T>
Used to get service of a specific type
Top
See Also
Reference
IPlatformServiceLocator Interface
Rhino.Runtime Namespace