RhinoCommon API
SimpleArrayArrayPoint3d Methods
The SimpleArrayArrayPoint3d type exposes the following members.
Methods
Name | Description
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
PointCountAt
 Gets the amount of points in a polyline.
PolylineAt
 Gets a polyline at an index.
Top
See Also
Reference
SimpleArrayArrayPoint3d Class
Rhino.Runtime.InteropWrappers Namespace