RhinoCommon API
TransformField Methods
The TransformField type exposes the following members.
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
TransformField Class
Rhino.Render.Fields Namespace