RhinoCommon API
ScaleValue Methods
The ScaleValue type exposes the following members.
Methods
Name | Description
Create(String, StringParserSettings)
 Create from string
Create(LengthValue, LengthValue, ScaleValue.ScaleStringFormat)
 Create from 2 length values
Dispose
actively reclaim native allocated ON_SacleValue*
Finalize
passively reclaim native allocated ON_ScaleValue*
 (Overrides Object.Finalize().)
IsUnset
 Test IsUnset
LeftLengthValue
 Get the Left LengthValue from Scale
OneToOne
 Make a new ScaleValue set to OneToOne
RightLengthValue
 Get the Right LengthValue from Scale
Top
See Also
Reference
ScaleValue Class
Rhino Namespace