RhinoCommon API
FileX_T Methods
The FileX_T type exposes the following members.
Methods
Name | Description
Write
Write a X_T file based on the contents of a RhinoDoc
Top
See Also
Reference
FileX_T Class
Rhino.FileIO Namespace