RhinoCommon API
WorksessionFileLayerOverride Methods
The WorksessionFileLayerOverride type exposes the following members.
Methods
Name | Description
Dispose
Releases the native layer override.
Finalize
Releases the native layer override.
 (Overrides Object.Finalize().)
GetFileValues
 Gets a copy of the layer's settings in the reference model when the worksession was saved.
GetWorksessionValues
Gets a copy of the layer's settings in the worksession.
SetFileValues
Replaces the file values with a copy of values.
SetWorksessionValues
Replaces the worksession values with a copy of values.
Top
See Also
Reference
WorksessionFileLayerOverride Class
Rhino.FileIO Namespace