RhinoCommon API
DisplayDeviceInfo Methods
The DisplayDeviceInfo type exposes the following members.
Methods
Name | Description
GpuDeviceInfos
 Get a list of GpuDeviceInfo for GPUs found on this machine.
GpuNames
 Get a list with the names of all GPUs on this machine.
Top
See Also
Reference
DisplayDeviceInfo Class
Rhino Namespace