RhinoCommon API
HiddenLineDrawing Methods
The HiddenLineDrawing type exposes the following members.
Methods
Name | Description
BoundingBox
 Get tight bounding box of the hidden line drawing.
Compute(HiddenLineDrawingParameters, Boolean)
 Perform the hidden line drawing calculation based on input parameters
Compute(HiddenLineDrawingParameters, Boolean, IProgress<Double>, CancellationToken)
 Perform the hidden line drawing calculation based on input parameters
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
RejoinCompatibleVisible
 Join consecutive visible curves from a single FullCurve
Top
See Also
Reference
HiddenLineDrawing Class
Rhino.Geometry Namespace