RhinoCommon API
File3dmObject Methods
The File3dmObject type exposes the following members.
Methods
Name | Description
Equals(File3dmObject)
 Verified that two File3dmObject items refer to the same object in a document.
Equals(Object)
 Verified that two objects refer to the same object in a document.
 (Overrides Object.Equals(Object).)
GetHashCode
 Provides an hash code for this item.
 (Overrides Object.GetHashCode().)
GetTextureMapping
 Gets the texture mapping from the File3dmObject object.
TryReadUserData
 Attempts to read a Rhino plug-in's custom userdata from the File3dmObject object.
Top
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace