RhinoCommon API
Torus Methods
The Torus type exposes the following members.
Methods
Name | Description
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
ToBrep
 Converts this torus to a Brep. This is synonymous with calling CreateFromTorus(Torus).
ToNurbsSurface
 Converts this torus to its NURBS surface representation. This is synonymous with calling CreateFromTorus(Torus).
ToRevSurface
 Converts this torus to a surface of revolution representation. This is synonymous with calling CreateFromTorus(Torus).
Top
See Also
Reference
Torus Structure
Rhino.Geometry Namespace