RhinoCommon API
RotationGripUserInterfaceObject Methods
The RotationGripUserInterfaceObject type exposes the following members.
Methods
Name | Description
ArcVisibleInViewport
 If the arc for a given viewport visible.
OnRotationDrag
 Called when dragging a rotation grip. Angle is the amount that the plane will be rotated when dragging
Top
See Also
Reference
RotationGripUserInterfaceObject Class
Rhino.UI Namespace