RhinoCommon API
FileTxt Methods
The FileTxt type exposes the following members.
Methods
Name | Description
Read
Read a Txt file into a RhinoDoc
Write
Write a Txt file based on the contents of a RhinoDoc
Top
See Also
Reference
FileTxt Class
Rhino.FileIO Namespace