RhinoCommon API
PolylineCurve Methods
The PolylineCurve type exposes the following members.
Methods
Name | Description
CreateConvexHull2d
 Attempts to create a closed PolylineCurve that is the anti-clockwise planar convex hull of the input points. In addition, the indices of the extremal points among the input points are returned in correct order. Possible duplicates among the input points are taken care of. The input pointsThe indices into the input points such that points[hullIndices[i]] = result[i]. Since the result is a closed polyline if successful, the start/end index is repeated at the beginning and end of the hullIndices.
Return Value
Type:
 The closed PolylineCurve encompassing the input points, or null if the input points were either too few, or were found to be collinear.
Parameter
 Gets a parameter at a specified index in the polyline curve.
Point
 Gets a point at a specified index in the polyline curve.
SetArcLengthParameterization
 Sets the polyline curve to use arc length parameterization for higher quality geometry.
SetParameter
 Sets a parameter at a specified index in the polyline curve.
SetPoint
 Sets a point at a specified index in the polyline curve.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The NURBS Curves segments do not have fully multiple interior knots.
 3. Rational NURBS curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent co-linear or co-circular segments are combined.
ToArray
 Returns the underlying Polyline points as an array.
ToPolyline()
 Returns the underlying Polyline, or points.
Top
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace