RhinoCommon API
ToolbarFile Methods
The ToolbarFile type exposes the following members.
Methods
Name | Description
Close
 Closes the toolbar file.
GetGroup(Int32)
 Gets a toolbar group.
GetGroup(String)
 Gets a toolbar group.
GetSvg
 Gets the SVG string for an image in this toolbar file.
GetToolbar
 Gets a toolbar.
Save
 Saves the toolbar file.
SaveAs
 Saves the toolbar file to a different path.
Top
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace