RhinoCommon API
NameHash Methods
The NameHash type exposes the following members.
Methods
Name | Description
Clone
 Creates a copy of this name hash. Because content hash is immutable, this can be used as a deep copy.
CreateFilePathHash
 Creates a new NameHash, representing the name of a file.
Equals(NameHash)
 Determines if another name hash has the same value.
Equals(Object)
 Determines if another object is a name hash with same value.
 (Overrides Object.Equals(Object).)
GetHashCode
 Gets an hash code for this name hash. Two equal content hashes have equal hash code. The other way around might not be true.
 (Overrides Object.GetHashCode().)
Top
See Also
Reference
NameHash Class
Rhino.FileIO Namespace