RhinoCommon API
RealtimeDisplayMode Methods
The RealtimeDisplayMode type exposes the following members.
Methods
Name | Description
CaptureProgress
 Override to communicate the progress of a capture.
ComputeViewportCrc
 Compute viewport CRC for the given ViewInfo
CreateWorld
 Implement if you need to handle the initial CreateWorld call initiated by the display pipeline system. Note that this is not the same as the CreateWorld call in Rhino.Render.ChangeQueue.ChangeQueue, although related.
DrawOpenGl
GetRealtimeViewport(IntPtr)
 Retrieve RealtimeDisplayMode instance that the IntPtr refers to.
GetRealtimeViewport(IntPtr, Boolean)
Retrieve RealtimeDisplayMode instance. If create is set to true then a new instance is created if not found, null is returned for false.
GetRenderSize
 Get the current render resolution for the running render session.
GetView
 Get ViewInfo that has been registered with this RealtimeDisplayMode instance.
HudAllowEditMaxPasses
 Override to allow maximum pass editing. By default disabled.
HudCustomStatusText
 Override to display status of the render engine.
HudLastRenderedPass
 Override to communicate the last completed pass. Can be shown in the HUD
HudMaximumPasses
 Override to communicate the maximum passes count currently in use for the render session. Can be shown in the HUD
HudProductName
 Override to return the name of your product. This will be printed in the HUD.
HudRendererLocked
 Implement to support locking in the viewport
HudRendererPaused
 Implement to support pausing and resuming in the viewport
HudShow
 Override if you want to hide the HUD. Shown by default
HudShowControls
 Show control buttons on the realtime display HUD. By default these are shown, override this function and return false if HUD controls aren't needed.
HudShowCustomStatusText
 Override to show status text in HUD. By default disabled.
HudShowMaxPasses
 Override to show maximum passes in HUD. By default disabled.
HudShowPasses
 Override to show current pass in HUD. By default disabled.
HudStartTime
IsCompleted
 Implement to tell if your render engine has completed a frame for drawing into the viewport
IsFrameBufferAvailable
 Implement to tell the render pipeline that a framebuffer is ready
IsRendererStarted
 Override to tell the started state of your render engine.
LastRenderedPass
 Implement to communicate last completed pass to the underlying system.
OnRenderSizeChanged
 Override to restart your render engine
OpenGlVersion
PostConstruct
 Override PostConstruct if you need to initialize where the underlying RealtimeDisplayMode is available. The connection is made right after RealtimeDisplayMode has been instantiated, but just before PostConstruct is called. For instance finding out OpenGL information can be done in PostConstruct.
RegisterDisplayModes(PlugIn)
 Find and register classes that derive from RealtimeDisplayMode from the given plug-in.
RegisterDisplayModes(Assembly, Guid)
 Find and register classes that derive from RealtimeDisplayMode from the given plug-in. The plug-in is found in the given assembly
RemoveRealtimeViewport
 Remove RealtimeDisplayMode instance from internal dictionary.
SetUseDrawOpenGl
 During run-time change whether to use OpenGL drawing of results or not. For instance offline rendering (viewcapture* with different resolution than viewport) could use RenderWindow instead of direct OpenGL drawing.
SetView
 Set ViewInfo for this RealtimeDisplayMode instance.
ShowCaptureProgress
 Override if you want to i.e. hide the progress dialog for capture progress.
ShutdownRenderer
 Override to shutdown your render engine
SignalRedraw
 Use to signal the underlying pipeline a redraw is wanted. This can be used for instance when a renderer has completed a pass which should be updated in the associated viewport.
StartRenderer
 Override to start your render engine. Note that before using the RenderWindow you *must* call SetSize to properly initialize the underlying DIB.
UnregisterDisplayModes(PlugIn)
UnregisterDisplayModes(Assembly, Guid)
UseFastDraw
 Implement and return true if you want the display pipeline to not wait for IsFramebufferAvailable during the MiddleGround draw phase. This will also tell the pipeline to draw a complete middleground pass in OpenGL.
Top
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace