RhinoCommon API
Color4f Methods
The Color4f type exposes the following members.
Methods
Name | Description
ApplyGamma
AsSystemColor
BlendTo
Equals |  (Overrides ValueType.Equals(Object).)
FromArgb(Single, Color4f)
FromArgb(Single, Single, Single, Single)
GetHashCode |  (Overrides ValueType.GetHashCode().)
Top
See Also
Reference
Color4f Structure
Rhino.Display Namespace