RhinoCommon API
SelCommand Methods
The SelCommand type exposes the following members.
Methods
Name | Description
RunCommand |  (Overrides Command.RunCommand(RhinoDoc, RunMode).)
SelFilter
 Override this abstract function and return true if object should be selected.
SelSubObjectFilter
 To select subobjects, override this virtual function, add component indices of the subobjects that should get selected to indicesToSelect list and return true. This is called only if the SelFilter returns false and the whole object does not get selected.
Top
See Also
Reference
SelCommand Class
Rhino.Commands Namespace