RhinoCommon API
ChannelGPU Methods
The RenderWindow.ChannelGPU type exposes the following members.
Methods
Name | Description
Clone
 Return a clone of the channel.
Close
 Close the channel.
CopyTo
 Copy the channel to a 'CPU' channel.
Dispose
 Dispose of the channel.
Finalize |  (Overrides Object.Finalize().)
Height
 Return the channel height.
Id
 Return the channel id.
PixelSize
 Return the size of one pixel's data in the channel.
TextureHandle |  Obsolete.
 Return the channel's texture handle.
TextureHandleMetal
 Return the channel's Metal texture handle (id<MTLTexture>) as an IntPtr. If there isn't one, IntPtr.Zero will be returned. The ChannelGPU.DisplayTechnology property will indicate which type of texture is stored in the channel. The IntPtr can be turned back into an Objective-C id<MTLTexture> using id<MTLTexture> texture = CFBridgingRelease(ptr);
TextureHandleOpenGL
 Return the channel's OpenGL texture handle. If there isn't one, a value of 0 will be returned. The ChannelGPU.DisplayTechnology property will indicate which type of texture is stored in the channel.
Width
 Return the channel width.
Top
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace