RhinoCommon API
DraftAngleAnalysisSettings Methods
The DraftAngleAnalysisSettings type exposes the following members.
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
RestoreDefaults
 Commits the default settings as the current settings.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
See Also
Reference
DraftAngleAnalysisSettings Class
Rhino.ApplicationSettings Namespace