RhinoCommon API
TextureMapping Methods
The TextureMapping type exposes the following members.
Methods
Name | Description
CreateBoxMapping
Create a box projection texture mapping.
CreateCustomMeshMapping
 Create custom mesh mapping
CreateCylinderMapping
Create a cylindrical projection texture mapping.
CreateOcsMapping
 Create a Ocs texture mapping. Note that OCS mappings must be placed on mapping channel ON_ObjectRenderingAttributes::OCSMappingChannelId() otherwise they will not work.
CreatePlaneMapping(Plane, Interval, Interval, Interval)
Create a planar UV projection texture mapping
CreatePlaneMapping(Plane, Interval, Interval, Interval, Boolean)
Create a planar projection texture mapping
CreateSphereMapping
 Create a spherical projection texture mapping.
CreateSurfaceParameterMapping
Create a mapping that will convert surface parameters into normalized(0,1)x(0,1) texture coordinates.
Decompose
 Gets the same decomposition of the texture mapping transforms as is used in the UI.
Evaluate(Point3d, Vector3d, Point3d)
 Evaluate the mapping to get a texture coordinate
Evaluate(Point3d, Vector3d, Point3d, Transform, Transform)
 Evaluate the mapping to get a texture coordinate
TryGetMappingBox(Plane, Interval, Interval, Interval)
 Get a box projection from the texture mapping.
TryGetMappingBox(Plane, Interval, Interval, Interval, Boolean)
 Get a box projection from the texture mapping, including capped information
TryGetMappingCylinder(Cylinder)
 Get a cylindrical projection parameters from this texture mapping.
TryGetMappingCylinder(Cylinder, Boolean)
 Get a cylindrical projection parameters from this texture mapping.
TryGetMappingMesh
 Get custom mapping mesh from this texture mapping.
TryGetMappingPlane(Plane, Interval, Interval, Interval)
 Get plane mapping parameters from this texture mapping.
TryGetMappingPlane(Plane, Interval, Interval, Interval, Boolean)
 Get plane mapping parameters from this texture mapping, including capping information
TryGetMappingSphere
 Get a spherical projection parameters from this texture mapping.
Top
See Also
Reference
TextureMapping Class
Rhino.Render Namespace