RhinoCommon API
ObjectPropertiesPageEventArgs Methods
The ObjectPropertiesPageEventArgs type exposes the following members.
Methods
Name | Description
GetObjects(ObjectType)
 Get selected objects that match a given filter
GetObjects<T>()
 Get selected objects of a given type
IncludesObjectsType(ObjectType)
IncludesObjectsType(ObjectType, Boolean)
IncludesObjectsType<T>()
 Return true if any of the selected objects match the given type
IncludesObjectsType<T>(Boolean)
 Return true if any of the selected objects match the given type
Top
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace