RhinoCommon API
File3ds Methods
The File3ds type exposes the following members.
Methods
Name | Description
Read
Read a 3ds file intof a RhinoDoc
Write
Write a 3ds file based on the contents of a RhinoDoc
Top
See Also
Reference
File3ds Class
Rhino.FileIO Namespace