RhinoCommon API
IRdkViewModel Methods
The IRdkViewModel type exposes the following members.
Methods
Name | Description
Commit
Discard
GetData
Top
See Also
Reference
IRdkViewModel Interface
Rhino.UI.Controls Namespace