RhinoCommon API
DisplayBitmapDrawList Methods
The DisplayBitmapDrawList type exposes the following members.
Methods
Name | Description
SetPoints(IEnumerable<Point3d>)
SetPoints(IEnumerable<Point3d>, IEnumerable<Color>)
SetPoints(IEnumerable<Point3d>, Color)
Sort
Top
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace