RhinoCommon API
File3dmDisplacement Methods
The File3dmDisplacement type exposes the following members.
Methods
Name | Description
AddSubItem
 Adds a new sub-item to the displacement. face_index is the index of the face on the polysurface/SubD.on is the override for File3dmDisplacement.On.texture is the override for File3dmDisplacement.TextureId.mapping_channel is the override for File3dmDisplacement.MappingChannel.black_point is the override for File3dmDisplacement.BlackPoint.white_point is the override for File3dmDisplacement.WhitePoint.
DeleteAllSubItems
 Deletes all the sub-items from the displacement.
DeleteSubItem
 Deletes a sub-item by its face index. face_index is the index of the face on the polysurface/SubD.
GetSubItemFaceIndexes
 Gets all the sub-items on the displacement. Sub-items can exist to override the top-level parameters for polysurface/SubD faces. Sub-items are identified by the face index that they apply to. An array of the face indexes of each sub-item on the displacement.
SetSubItemBlackPoint
 Sets the override for displacement 'black-point'. face_index is the index of the face on the polysurface/SubD.
SetSubItemMappingChannel
 Sets the override for displacement 'mapping channel'. face_index is the index of the face on the polysurface/SubD.
SetSubItemOn
 Sets the override for displacement 'on'. face_index is the index of the face on the polysurface/SubD.
SetSubItemTexture
 Sets the override for displacement 'texture'. face_index is the index of the face on the polysurface/SubD.
SetSubItemWhitePoint
 Sets the override for displacement 'white-point'. face_index is the index of the face on the polysurface/SubD.
SubItemBlackPoint
 Gets the override for displacement 'black-point'. face_index is the index of the face on the polysurface/SubD.
SubItemMappingChannel
 Gets the override for displacement 'mapping channel'. face_index is the index of the face on the polysurface/SubD.
SubItemOn
 Gets the override for displacement 'on'. face_index is the index of the face on the polysurface/SubD.
SubItemTexture
 Gets the override for displacement 'texture'. face_index is the index of the face on the polysurface/SubD.
SubItemWhitePoint
 Gets the override for displacement 'white-point'. face_index is the index of the face on the polysurface/SubD.
Top
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace