RhinoCommon API
FileSkp Methods
The FileSkp type exposes the following members.
Methods
Name | Description
Read
Read a Skp file into a RhinoDoc
Write
Write a Skp file based on the contents of a RhinoDoc
Top
See Also
Reference
FileSkp Class
Rhino.FileIO Namespace