RhinoCommon API
IAssemblyRestrictedObject Methods
The IAssemblyRestrictedObject type exposes the following members.
Methods
Name | Description
Editable
 Determines whether an assembly can modify the instance.
Top
See Also
Reference
IAssemblyRestrictedObject Interface
Rhino.Runtime.Notifications Namespace