RhinoCommon API
Mesh Methods
The Mesh type exposes the following members.
Methods
Name | Description
Append(IEnumerable<Mesh>)
 Append a list of meshes. This function is much more efficient than making repeated calls to Mesh.Append(Mesh) when lots of meshes are being joined into a single large mesh.
Append(Mesh)
 Appends a copy of another mesh to this one and updates indices of appended mesh parts.
Check
 Examines the mesh and logs a description of what it finds right or wrong. The various properties the function checks for are described in MeshCheckParameters.
ClearSurfaceData
 Removes surface parameters, curvature parameters and surface statistics from the mesh.
ClearTextureData
 Removes all texture coordinate information from this mesh.
ClosestMeshPoint
 Gets the point on the mesh that is closest to a given test point. Similar to the ClosestPoint function except this returns a MeshPoint class which includes extra information beyond just the location of the closest point.
ClosestPoint(Point3d)
 Gets the point on the mesh that is closest to a given test point.
ClosestPoint(Point3d, Point3d, Double)
 Gets the point on the mesh that is closest to a given test point.
ClosestPoint(Point3d, Point3d, Vector3d, Double)
 Gets the point on the mesh that is closest to a given test point.
CollapseFacesByArea
 Collapses multiple mesh faces, with areas less than LessThanArea and greater than GreaterThanArea, based on the principles found in Stan Melax's mesh reduction PDF, see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
CollapseFacesByByAspectRatio
 Collapses a multiple mesh faces, determined by face aspect ratio, based on criteria found in Stan Melax's polygon reduction, see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
CollapseFacesByEdgeLength
 Collapses multiple mesh faces, with greater/less than edge length, based on the principles found in Stan Melax's mesh reduction PDF, see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
ColorAt(MeshPoint)
 Evaluate a mesh color at a set of barycentric coordinates.
ColorAt(Int32, Double, Double, Double, Double)
 Evaluate a mesh normal at a set of barycentric coordinates. Barycentric coordinates must be assigned in accordance with the rules as defined by MeshPoint.T.
Compact
 Removes any unreferenced objects from arrays, re-indexes as needed and shrinks arrays to minimum required size.
ComputeCurvatureApproximation
 Compute an approximation of the discrete curvatures of the mesh vertices, according to which type of curvature information is requested. This method will not yield meaningful values on nonmanifold vertices, and nan on naked vertices. For now, this method operates solely on the mesh topology (the fully welded mesh), but distribtes the result across all the ordinary vertices. This method is a const and thread-safe method and will leave the m_K array untouched. An integer indicating which curvature is desired. gaussian_curvature = 1, mean_curvature = 2, minimum unsigned radius of curvature = 3, maximum unsigned radius of curvature = 4 Resulting curvature array on success, null on failure. On success, the length of the array is the number of vertices.
ComputeThickness(IEnumerable<Mesh>, Double)
 Compute thickness metrics for this mesh.
ComputeThickness(IEnumerable<Mesh>, Double, CancellationToken)
 Compute thickness metrics for this mesh.
ComputeThickness(IEnumerable<Mesh>, Double, Double, CancellationToken)
 Compute thickness metrics for this mesh.
CopyFrom
 Copies mesh values into this mesh from another mesh.
CreateBooleanDifference(IEnumerable<Mesh>, IEnumerable<Mesh>)
 Computes the solid difference of two sets of Meshes.
CreateBooleanDifference(IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result)
 Computes the solid difference of two sets of Meshes.
CreateBooleanDifference(IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result, Int32[][])
 Computes the solid difference of two sets of meshes and reports which inputs contributed to each output.
CreateBooleanIntersection(IEnumerable<Mesh>, IEnumerable<Mesh>)
 Computes the solid intersection of two sets of meshes.
CreateBooleanIntersection(IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result)
 Computes the solid intersection of two sets of meshes.
CreateBooleanIntersection(IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result, Int32[][])
 Computes the solid intersection of two sets of meshes and reports which inputs contributed to each output.
CreateBooleanSplit(IEnumerable<Mesh>, IEnumerable<Mesh>)
 Splits a set of meshes with another set.
CreateBooleanSplit(IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result)
 Splits a set of meshes with another set.
CreateBooleanSplit(IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result, Int32[][])
 Splits a set of meshes with another set and reports which inputs contributed to each output.
CreateBooleanUnion(IEnumerable<Mesh>)
 Computes the solid union of a set of meshes. WARNING: Use the overload that takes a tolerance or options.
CreateBooleanUnion(IEnumerable<Mesh>, Double)
 Computes the solid union of a set of meshes.
CreateBooleanUnion(IEnumerable<Mesh>, MeshBooleanOptions, Result)
 Computes the solid union of a set of meshes.
CreateBooleanUnion(IEnumerable<Mesh>, MeshBooleanOptions, Result, Int32[][])
 Computes the solid union of a set of meshes and reports which inputs contributed to each output.
CreateContourCurves(Mesh, Plane) |  Obsolete.
 (Old call maintained for compatibility.)
CreateContourCurves(Mesh, Plane, Double)
 Constructs contour curves for a mesh, sectioned at a plane.
CreateContourCurves(Mesh, Point3d, Point3d, Double) |  Obsolete.
 (Old call maintained for compatibility.)
CreateContourCurves(Mesh, Point3d, Point3d, Double, Double)
 Constructs contour curves for a mesh, sectioned along a linear axis.
CreateConvexHull3D
Attempts to create a 3d convex hull mesh from input points.
CreateExtrusion(Curve, Vector3d)
 Constructs a mesh by extruding a curve along a vector.
CreateExtrusion(Curve, Vector3d, MeshingParameters)
 Constructs a mesh by extruding a curve along a vector.
CreateFromBox(BoundingBox, Int32, Int32, Int32)
 Constructs new mesh that matches a bounding box.
CreateFromBox(Box, Int32, Int32, Int32)
 Constructs new mesh that matches an aligned box.
CreateFromBox(IEnumerable<Point3d>, Int32, Int32, Int32)
 Constructs new mesh from 8 corner points.
CreateFromBrep(Brep) |  Obsolete.
 Constructs a mesh from a brep.
CreateFromBrep(Brep, MeshingParameters)
 Constructs a mesh from a brep.
CreateFromClosedPolyline
 Attempts to create a Mesh that is a triangulation of a simple closed polyline that projects onto a plane.
CreateFromCone(Cone, Int32, Int32)
Constructs a solid mesh cone.
CreateFromCone(Cone, Int32, Int32, Boolean)
Constructs a mesh cone.
CreateFromCone(Cone, Int32, Int32, Boolean, Boolean)
Constructs a mesh cone.
CreateFromCurveExtrusion
 Constructs a mesh from an extruded curve. This method is designed for projecting curves onto a mesh. In most cases, a better to use CreateExtrusion(Curve, Vector3d).
CreateFromCurvePipe
 Constructs a new mesh pipe from a curve.
CreateFromCylinder(Cylinder, Int32, Int32)
Constructs a capped mesh cylinder.
CreateFromCylinder(Cylinder, Int32, Int32, Boolean, Boolean)
Constructs a mesh cylinder.
CreateFromCylinder(Cylinder, Int32, Int32, Boolean, Boolean, Boolean)
Constructs a mesh cylinder.
CreateFromCylinder(Cylinder, Int32, Int32, Boolean, Boolean, Boolean, Boolean)
Constructs a mesh cylinder.
CreateFromExtrusion
 Constructs a mesh from a brep.
CreateFromFilteredFaceList
 Constructs a sub-mesh, that contains a filtered list of faces.
CreateFromIsosurface
 Create an isosurface mesh based on a scalar field evaluator
CreateFromIterativeCleanup
Repairs meshes with vertices that are too near, using a tolerance value.
CreateFromLines
 Creates a mesh by analizing the edge structure. Input lines could be from the extraction of edges from an original mesh.
CreateFromPatchSingleFace
 Creates a single mesh face from the given input.
CreateFromPlanarBoundary(Curve, MeshingParameters) |  Obsolete.
 Do not use this overload. Use version that takes a tolerance parameter instead.
CreateFromPlanarBoundary(Curve, MeshingParameters, Double)
 Attempts to construct a mesh from a closed planar curve.RhinoMakePlanarMeshes
CreateFromPlane
 Constructs a planar mesh grid.
CreateFromSphere
 Constructs a mesh sphere.
CreateFromSubD(SubD)
 Create a mesh from a SubD limit surface, using the default meshing density for SubDs.
CreateFromSubD(SubD, SubDDisplayParameters.Density)
 Create a mesh from a SubD limit surface
CreateFromSubD(SubD, Int32)
 Create a mesh from a SubD limit surface
CreateFromSubDControlNet
Create a mesh from a SubD control net
CreateFromSubDControlNetWithTextureCoordinates
Create a mesh from a SubD control net including texture coordinates
CreateFromSurface(Surface)
 Constructs a mesh from a surface
CreateFromSurface(Surface, MeshingParameters)
 Constructs a mesh from a surface
CreateFromSurfaceControlNet
 Calculate a mesh representation of a surface's control net.
CreateFromTessellation
 Attempts to create a mesh that is a triangulation of a list of points, projected on a plane, including its holes and fixed edges.
CreateFromTorus
 Constructs a mesh torus.
CreateIcoSphere
 Constructs a icospherical mesh. A mesh icosphere differs from a standard UV mesh sphere in that it's vertices are evenly distributed. A mesh icosphere starts from an icosahedron (a regular polyhedron with 20 equilateral triangles). It is then refined by splitting each triangle into 4 smaller triangles. This splitting can be done several times.
CreatePartitions
 In ancient times (or modern smart phone times), some rendering engines were only able to process small batches of triangles and the CreatePartitions() function was provided to partition the mesh into subsets of vertices and faces that those rendering engines could handle.
CreatePatch
 Construct a mesh patch from a variety of input geometry.
CreateQuadSphere
 Constructs a quad mesh sphere. A quad mesh sphere differs from a standard UV mesh sphere in that it's vertices are evenly distributed. A quad mesh sphere starts from a cube (a regular polyhedron with 6 square sides). It is then refined by splitting each quad into 4 smaller quads. This splitting can be done several times.
CreateQuickHull3D(IEnumerable<Point3d>)
 Attempts to create a 3d convex hull mesh from input points using the QuickHull algorithm. Hull faces whose shared edges are not clearly convex are merged, so faces of the resulting mesh may be triangles, quads, or larger convex polygons (returned as mesh ngons).
CreateQuickHull3D(PointCloud)
 Attempts to create a 3d convex hull mesh from an input point cloud using the QuickHull algorithm. Hull faces whose shared edges are not clearly convex are merged, so faces of the resulting mesh may be triangles, quads, or larger convex polygons (returned as mesh ngons).
CreateQuickHull3D(IEnumerable<Point3d>, List<Int32[]>)
 Attempts to create a 3d convex hull mesh from input points using the QuickHull algorithm. Hull faces whose shared edges are not clearly convex are merged, so faces of the resulting mesh may be triangles, quads, or larger convex polygons (returned as mesh ngons).
CreateQuickHull3D(PointCloud, List<Int32[]>)
 Attempts to create a 3d convex hull mesh from an input point cloud using the QuickHull algorithm, also returning the input points that make up each hull face.
CreateUnweldedMesh
 Creates a new unwelded mesh from an existing mesh. Texture coordinates are ignored.
CreateVertexColorsFromBitmap
 Populate the vertex colors from a bitmap image.
DestroyPartition
 Destroys mesh partition.
DestroyTopology
 Removes topology data, forcing all topology information to be recomputed.
DestroyTree
 Destroys the mesh vertex access tree.
Duplicate
 Constructs a copy of this mesh. This is the same as DuplicateMesh().
 (Overrides GeometryBase.Duplicate().)
DuplicateMesh
Constructs a copy of this mesh. This is the same as Duplicate().
EvaluateMeshGeometry
 If the mesh has SurfaceParameters, the surface is evaluated at these parameters and the mesh geometry is updated.
ExplodeAtUnweldedEdges
 Explode the mesh into sub-meshes where a sub-mesh is a collection of faces that are contained within a closed loop of "unwelded" edges. Unwelded edges are edges where the faces that share the edge have unique mesh vertices (not mesh topology vertices) at both ends of the edge.
ExtendSelectionByEdgeRidge
 Suggests an extension of a selection set by using information related with topology and alignment.
ExtendSelectionByFaceLoop
 Suggests an extension of a face selection set by using information related with topology and alignment.
ExtractNonManifoldEdges
 Extracts, or removes, non-manifold mesh edges.
FileHole |  Obsolete.
FillHole
 Given a starting "naked" edge index, this function attempts to determine a "hole" by chaining additional naked edges together until if returns to the start index. Then it triangulates the closed polygon and either adds the faces to the mesh.
FillHoles
 Attempts to determine "holes" in the mesh by chaining naked edges together. Then it triangulates the closed polygons adds the faces to the mesh.
Flip(Boolean, Boolean, Boolean)
Reverses the direction of the mesh.
Flip(Boolean, Boolean, Boolean, Boolean)
Reverses the direction of the mesh.
GetCachedTextureCoordinates(Guid)
 Call this method to get cached texture coordinates for a texture mapping with the specified Id.
GetCachedTextureCoordinates(RhinoObject, Texture)
 Returns cached texture coordinate set based on the texture. Make sure to set up cached texture coordinates for all textures in the material first by calling SetCachedTextureCoordinatesFromMaterial(RhinoObject rhinoObject, Rhino.DocObjects.Material material) If this function returns null then there are no texture coordinates available.
GetNakedEdgePointStatus
 Returns an array of Boolean values equal in length to the number of vertices in this mesh. Each value corresponds to a mesh vertex and is set to true if the vertex is not completely surrounded by faces.
GetNakedEdges
 Returns all edges of a mesh that are considered "naked" in the sense that the edge only has one face.
GetNgonAndFacesCount
 Retrieves the count of items that GetNgonAndFacesEnumerable() will provide.
GetNgonAndFacesEnumerable
 Retrieves a complete enumerable, i.e., one that provides an iterator over every face that is present, no matter if defined as a triangle, a quad, or a strictly over-four-sided ngon.
GetOutlines(Plane)
 Constructs the outlines of a mesh projected against a plane.
GetOutlines(RhinoViewport)
 Constructs the outlines of a mesh. The projection information in the viewport is used to determine how the outlines are projected.
GetOutlines(ViewportInfo, Plane)
 Constructs the outlines of a mesh.
GetPartition
 Retrieves a partition. See CreatePartitions(Int32, Int32) for details.
GetSelfIntersections
 Gets the intersections of this mesh with itself.
GetUnsafeLock
 Allows to obtain unsafe pointers to the underlying unmanaged data structures of the mesh.
HealNakedEdges
 Attempts to "heal" naked edges in a mesh based on a given distance. First attempts to move vertices to neighboring vertices that are within that distance away. Then it finds edges that have a closest point to the vertex within the distance and splits the edge. When it finds one it splits the edge and makes two new edges using that point.
InvalidateCachedTextureCoordinates
 Invalidates all cached texture coordinates. Call this function when you have made changes that will affect the texture coordinates on the mesh.
IsManifold()
 Returns true if every mesh "edge" has at most two faces.
IsManifold(Boolean, Boolean, Boolean)
 Gets a value indicating whether or not the mesh is manifold. A manifold mesh does not have any edge that borders more than two faces.
IsPointInside
 Determines if a point is inside a solid mesh.
MatchEdges(Double, Boolean)
 Moves face edges of an open mesh to meet adjacent face edges. The method will first try to match vertices, and then it will try to split edges to make the edges match.
MatchEdges(IEnumerable<Mesh>, Double, Boolean, Boolean, Boolean, Boolean)
 Moves face edges of open meshes to meet near face edges. The method will first try to match vertices, and then then it will try to split edges to make the edges match.
MergeAllCoplanarFaces(Double)
 Merges adjacent coplanar faces into single faces.
MergeAllCoplanarFaces(Double, Double)
 Merges adjacent coplanar faces into single faces.
NonConstOperation
 Clear local cache on non constant calls
 (Overrides GeometryBase.NonConstOperation().)
NormalAt(MeshPoint)
 Evaluate a mesh normal at a set of barycentric coordinates.
NormalAt(Int32, Double, Double, Double, Double)
 Evaluate a mesh normal at a set of barycentric coordinates. Barycentric coordinates must be assigned in accordance with the rules as defined by MeshPoint.T.
Offset(Double)
 Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals. Same as Mesh.Offset(distance, false)
Offset(Double, Boolean)
 Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals. Optionally, based on the value of solidify, adds the input mesh and a ribbon of faces along any naked edges. If solidify is false it acts exactly as the Offset(distance) function.
Offset(Double, Boolean, Vector3d)
 Makes a new mesh with vertices offset a distance along the direction parameter. Optionally, based on the value of solidify, adds the input mesh and a ribbon of faces along any naked edges. If solidify is false it acts exactly as the Offset(distance) function.
Offset(Double, Boolean, Vector3d, List<Int32>)
 Makes a new mesh with vertices offset a distance along the direction parameter. Optionally, based on the value of solidify, adds the input mesh and a ribbon of faces along any naked edges. If solidify is false it acts exactly as the Offset(distance) function. Returns list of wall faces, i.e. the faces that connect original and offset mesh when solidified.
OnSwitchToNonConst
 Performs some memory cleanup if necessary
 (Overrides GeometryBase.OnSwitchToNonConst().)
PartitionMesh
 Some file formats and rendering engines are only able to process small batches of triangles. Use this function to partition the mesh into subsets of vertices and faces that those file formats and rendering engines can handle.
PatchSingleFace
 Creates a single mesh face from the given input. The new mesh will be apppended to this mesh.
PointAt(MeshPoint)
 Evaluate a mesh at a set of barycentric coordinates.
PointAt(Int32, Double, Double, Double, Double)
 Evaluates a mesh at a set of barycentric coordinates. Barycentric coordinates must be assigned in accordance with the rules as defined by MeshPoint.T.
PullCurve
 Gets a polyline approximation of the input curve and then moves its control points to the closest point on the mesh. Then it "connects the points" over edges so that a polyline on the mesh is formed.
PullPointsToMesh
 Pulls a collection of points to a mesh.
QuadRemesh(QuadRemeshParameters)
 Quad remesh this mesh.
QuadRemesh(QuadRemeshParameters, IEnumerable<Curve>)
 Quad remesh this mesh.
QuadRemesh(IEnumerable<Int32>, QuadRemeshParameters, IEnumerable<Curve>, IProgress<Int32>, CancellationToken)
 Quad remesh this mesh.
QuadRemeshAsync(QuadRemeshParameters, IProgress<Int32>, CancellationToken)
 Quad remesh this mesh asynchronously.
QuadRemeshAsync(QuadRemeshParameters, IEnumerable<Curve>, IProgress<Int32>, CancellationToken)
 Quad remesh this mesh asynchronously.
QuadRemeshAsync(IEnumerable<Int32>, QuadRemeshParameters, IEnumerable<Curve>, IProgress<Int32>, CancellationToken)
 Quad remesh this mesh asynchronously.
QuadRemeshBrep(Brep, QuadRemeshParameters)
 Create QuadRemesh from a Brep Set Brep Face Mode by setting QuadRemeshParameters.PreserveMeshArrayEdgesMode
QuadRemeshBrep(Brep, QuadRemeshParameters, IEnumerable<Curve>)
 Create Quad Remesh from a Brep
QuadRemeshBrep(Brep, QuadRemeshParameters, IEnumerable<Curve>, IProgress<Int32>, CancellationToken)
 Quad remesh this Brep.
QuadRemeshBrepAsync(Brep, QuadRemeshParameters, IProgress<Int32>, CancellationToken)
 Quad remesh this Brep asynchronously.
QuadRemeshBrepAsync(Brep, QuadRemeshParameters, IEnumerable<Curve>, IProgress<Int32>, CancellationToken)
 Quad remesh this Brep asynchronously.
RebuildMesh(Mesh)
 Use this function to rebuild meshes that are not acting properly. Vertices and faces are kept. Face normals and vertex normals are recalculated. Texture coordinates, vertex colors, surface curvatures, and surfaces parameters are not replaced.
RebuildMesh(Mesh, Boolean, Boolean)
 Use this function to rebuild meshes that are not acting properly. Vertices and faces are kept. Face normals and vertex normals are recalculated. Surface curvatures, and surfaces parameters are not replaced.
RebuildNormals
 Removes mesh normals and reconstructs the face and vertex normals based on the orientation of the faces.
Reduce(ReduceMeshParameters)
Reduce polygon count
Reduce(ReduceMeshParameters, Boolean)
Reduce polygon count
Reduce(Int32, Boolean, Int32, Boolean)
 Reduce polygon count
Reduce(Int32, Boolean, Int32, Boolean, Boolean)
 Reduce polygon count
Reduce(Int32, Boolean, Int32, Boolean, CancellationToken, IProgress<Double>, String)
Reduce polygon count
Reduce(Int32, Boolean, Int32, Boolean, CancellationToken, IProgress<Double>, String, Boolean)
Reduce polygon count
ReleaseUnsafeLock
 Updates the Mesh data with the information that was stored via the MeshUnsafeLock.
RequireIterativeCleanup
 Analyzes some meshes, and determines if a pass of CreateFromIterativeCleanup would change the array.
All available cleanup steps are used. Currently available cleanup steps are:
- mending of single precision coincidence even though double precision vertices differ.
- union of nearly identical vertices, irrespectively of their origin.
- removal of t-joints along edges.
SelfSplit(Double)
 Split a mesh with itself.
SelfSplit(MeshSplitOptions)
 Split a mesh with itself.
SelfSplit(Double, Boolean, Boolean, TextLog, CancellationToken, IProgress<Double>)
 Split a mesh with itself.
SetCachedTextureCoordinates
 Set cached texture coordinates using the specified mapping.
SetCachedTextureCoordinatesFromMaterial
 Sets up cached texture coordinate set for each texture in the material. Textures in the Material define which mapping channels are used and the RhinoObject defines what texture mapping is used for each mapping channel. After this method is called all necessary texture coordinate sets are cached and correct texture coordinates for each texture can be fetched using GetCachedTextureCoordinates(RhinoObject rhinoObject, Rhino.DocObjects.Texture texture) If any texture coordinates are already cached they will not be re-computed.
SetSurfaceParametersFromTextureCoordinates
 If the mesh does not have surface evaluation parameters, has texture coordinates, and the surface parameters can be set in a way so the existing texture coordinates can be computed from the surface parameters, then this function sets the surface parameters. This is useful when meshes that have texture coordinates and do not have surface parameters want to set the surface parameters in a way so that the texture mapping of type TextureMappingType.SurfaceParameters will restore the texture coordinates.
SetTextureCoordinates(TextureMapping, Transform, Boolean)
 Sets texture coordinates using the given texture mapping and transform.
SetTextureCoordinates(TextureMapping, Transform, Boolean, Boolean)
 Sets texture coordinates using the given texture mapping and transform.
ShrinkWrap(ShrinkWrapParameters)
 Returns a ShrinkWrapped mesh or null when a mesh was not created or error.
ShrinkWrap(IEnumerable<Mesh>, ShrinkWrapParameters)
 Creates a unified ShrinkWrap mesh from a collection of input meshes. Returns null on error or failure.
ShrinkWrap(PointCloud, ShrinkWrapParameters)
 Creates a unified ShrinkWrap mesh from a point cloud returns null on error or failure
ShrinkWrap(ShrinkWrapParameters, CancellationToken)
 Returns a ShrinkWrapped mesh or null when a mesh was not created or error. Supports cancellation during volumetric calculations.
ShrinkWrap(IEnumerable<GeometryBase>, ShrinkWrapParameters, MeshingParameters)
 Creates a unified ShrinkWrap mesh from a collection of GeometryBase objects. returns null or error on failure
ShrinkWrap(IEnumerable<Mesh>, ShrinkWrapParameters, CancellationToken)
 Creates a unified ShrinkWrap mesh from a collection of input meshes. Returns null on error or failure. Supports cancellation during volumetric calculations.
ShrinkWrap(PointCloud, ShrinkWrapParameters, CancellationToken)
 Creates a unified ShrinkWrap mesh from a point cloud returns null on error or failure Supports cancellation during volumetric calculations.
ShrinkWrap(IEnumerable<GeometryBase>, ShrinkWrapParameters, MeshingParameters, CancellationToken)
 Creates a unified ShrinkWrap mesh from a collection of GeometryBase objects. returns null or error on failure Supports cancellation during volumetric calculations. geometryBase mesh creation is not cancellable
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem)
 Smooths a mesh by averaging the positions of mesh vertices in a specified region.
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths a mesh by averaging the positions of mesh vertices in a specified region.
Smooth(Double, Int32, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths a mesh by averaging the positions of mesh vertices in a specified region.
Smooth(IEnumerable<Int32>, Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths part of a mesh by averaging the positions of mesh vertices in a specified region.
Smooth(IEnumerable<Int32>, Double, Int32, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths part of a mesh by averaging the positions of mesh vertices in a specified region.
SolidOrientation
 Determines orientation of a "solid" mesh.
Split(IEnumerable<Mesh>)
 Split a mesh with a collection of meshes. Suggestion: upgrade to overload with tolerance. Does not split at coplanar intersections.
Split(Mesh)
 Split a mesh with another mesh. Suggestion: upgrade to overload with tolerance.
Split(Plane)
 Split a mesh by an infinite plane.
Split(IEnumerable<Mesh>, MeshSplitOptions)
 Split a mesh with a collection of meshes.
Split(IEnumerable<Mesh>, Double, Boolean, TextLog, CancellationToken, IProgress<Double>)
 Split a mesh with a collection of meshes.
Split(IEnumerable<Mesh>, Double, Boolean, Boolean, TextLog, CancellationToken, IProgress<Double>)
 Split a mesh with a collection of meshes.
SplitDisjointPieces
 Splits up the mesh into its unconnected pieces.
SplitMesh
 Some file formats and rendering engines are only able to process small batches of triangles. Use this function to split the mesh into subsets of vertices and faces that those file formats and rendering engines can handle.
SplitNon2Manifolds()
 Split a mesh where at non-2 manifolds boundaries.
SplitNon2Manifolds(TextLog, CancellationToken, IProgress<Double>)
 Split a mesh where at non-2 manifolds boundaries.
SplitWithProjectedPolylines(IEnumerable<PolylineCurve>, Double)
 Splits a mesh by adding edges in correspondence with input polylines, and divides the mesh at partitioned areas. Polyline segments that are measured not to be on the mesh will be ignored.
SplitWithProjectedPolylines(IEnumerable<PolylineCurve>, Double, TextLog, CancellationToken, IProgress<Double>)
 Splits a mesh by adding edges in correspondence with input polylines, and divides the mesh at partitioned areas. Polyline segments that are measured not to be on the mesh will be ignored.
Subdivide()
 Subdivides the faces of the mesh.
Subdivide(IEnumerable<Int32>)
 Subdivides specific faces of the mesh.
UnifyNormals()
 Attempts to fix inconsistencies in the directions of mesh faces in a mesh. This function does not modify mesh vertex normals, it rearranges the mesh face winding and face normals to make them all consistent. Note, you may want to call Mesh.Normals.ComputeNormals() to recompute vertex normals after calling this functions.
UnifyNormals(Boolean)
 Attempts to fix inconsistencies in the directions of mesh faces in a mesh. This function does not modify mesh vertex normals, it rearranges the mesh face winding and face normals to make them all consistent. Note, you may want to call Mesh.Normals.ComputeNormals() to recompute vertex normals after calling this functions.
Unweld
 Makes sure that faces sharing an edge and having a difference of normal greater than or equal to angleToleranceRadians have unique vertices along that edge, adding vertices if necessary.
UnweldEdge
 Adds creases to a smooth mesh by creating coincident vertices along selected edges.
UnweldVertices
 Ensures that faces sharing a common topological vertex have unique indices into the MeshVertexList collection.
Volume
 Compute volume of the mesh.
Weld(Double)
 Makes sure that faces sharing an edge and having a difference of normal less than or equal to angleToleranceRadians share vertices along that edge, vertex normals are averaged.
Weld(Double, Boolean)
 Makes sure that faces sharing an edge and having a difference of normal less than or equal to angleToleranceRadians share vertices along that edge, vertex normals are averaged.
WithDisplacement
 Constructs new mesh from the current one, with displacement applied to it.
WithEdgeSoftening
 Constructs new mesh from the current one, with edge softening applied to it.
WithShutLining
 Constructs new mesh from the current one, with shut lining applied to it.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace