RhinoCommon API
GetEllipse Methods
The GetEllipse type exposes the following members.
Methods
Name | Description
Dispose()
 Actively releases the unmanaged object.
Dispose(Boolean)
 Releases the unmanaged object.
Finalize
 Passively releases the unmanaged object.
 (Overrides Object.Finalize().)
Get
 Prompt for the getting of an ellipse.
Top
See Also
Reference
GetEllipse Class
Rhino.Input.Custom Namespace