RhinoCommon API
SafeFrame Methods
The SafeFrame type exposes the following members.
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Dispose
Finalize
 (Overrides FreeFloatingBase.Finalize().)
Top
See Also
Reference
SafeFrame Class
Rhino.Render Namespace