RhinoCommon API
StringWrapper Methods
The StringWrapper type exposes the following members.
Methods
Name | Description
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetStringFromPointer
 Get string from an ON_wString*
SetString
 Set contents of this string.
SetStringOnPointer
 Set contents of an ON_wString*
ToString
 Returns the string contents of this wrapper.
 (Overrides Object.ToString().)
Top
See Also
Reference
StringWrapper Class
Rhino.Runtime.InteropWrappers Namespace