RhinoCommon API
DisplayModeDescription Methods
The DisplayModeDescription type exposes the following members.
Methods
Name | Description
AddDisplayMode(DisplayModeDescription)
 Adds a new display mode from an existing description. Note that this only registers the mode in memory; call UpdateDisplayMode to persist it to disk.
AddDisplayMode(String)
 Adds a new display mode. Note that this only registers the mode in memory; call UpdateDisplayMode to persist it to disk.
CopyDisplayMode
 Copies an existing display mode. Note that this only registers the new mode in memory; call UpdateDisplayMode to persist it to disk.
DeleteDiplayMode |  Obsolete.
 Deletes an existing display mode.
DeleteDisplayMode
 Deletes an existing display mode.
Dispose()
Dispose(Boolean)
ExportToFile
 Exports a DisplayModeDescription to a Windows-style .ini file.
Finalize |  (Overrides Object.Finalize().)
FindByName
 Finds a display mode description by its English name.
GetDisplayMode
 Gets a display mode description by id.
GetDisplayModes
 Gets all display mode descriptions that Rhino currently knows about.
ImportFromFile(String)
 Imports a DisplayModeDescription from a Windows-style .ini file.
ImportFromFile(String, Boolean)
 Imports a DisplayModeDescription from a Windows-style .ini file.
SaveDisplayModes
 Saves all display modes to disk.
UpdateDisplayMode(DisplayModeDescription)
 Updates an existing display mode and immediately saves it to disk. Call this after AddDisplayMode/CopyDisplayMode or changing DisplayAttributes to persist the change; otherwise an unrelated settings save elsewhere in Rhino can reload the display mode list from disk and silently discard the unsaved mode.
UpdateDisplayMode(DisplayModeDescription, Boolean)
 Updates an existing display mode.
Top
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace