RhinoCommon API
PhysicallyBased Methods
The PhysicallyBased type exposes the following members.
Methods
Name | Description
FromTextureType
Top
See Also
Reference
PhysicallyBased Class
Rhino.Render.ChildSlotNames Namespace