RhinoCommon API
ExtrusionObject Methods
The ExtrusionObject type exposes the following members.
Methods
Name | Description
DuplicateExtrusionGeometry
Top
See Also
Reference
ExtrusionObject Class
Rhino.DocObjects Namespace