RhinoCommon API
NurbsSurface Methods
The NurbsSurface type exposes the following members.
Methods
Name | Description
ConvertSpanToBezier
 Convert a NURBS surface bispan into a Bezier surface.
CopyFrom
 Copies this NURBS surface from another NURBS surface.
Create
 Constructs a new NURBS surface with internal uninitialized arrays.
CreateCurveOnSurface
 Fit a sequence of 2d points on a surface to make a curve on the surface.
CreateCurveOnSurfacePoints
 Computes a discrete spline curve on the surface. In other words, computes a sequence of points on the surface, each with a corresponding parameter value.
CreateFromCone
 Constructs a new NURBS surfaces from cone data.
CreateFromCorners(Point3d, Point3d, Point3d)
 Makes a surface from 3 corner points.
CreateFromCorners(Point3d, Point3d, Point3d, Point3d)
 Makes a surface from 4 corner points.
This is the same as calling CreateFromCorners(Point3d, Point3d, Point3d, Point3d, Double) with tolerance 0.
CreateFromCorners(Point3d, Point3d, Point3d, Point3d, Double)
 Makes a surface from 4 corner points.
CreateFromCylinder
 Constructs a new NURBS surfaces from cylinder data.
CreateFromPlane
 Creates a NURBS surface from a plane and additional parameters.
CreateFromPoints
 Constructs a NURBS surface from a 2D grid of control points.
CreateFromSphere
 Constructs a new NURBS surfaces from sphere data.
CreateFromTorus
 Constructs a new NURBS surfaces from torus data.
CreateNetworkSurface(IEnumerable<Curve>, Int32, Double, Double, Double, Int32)
 Builds a surface from an auto-sorted network of curves/edges.
CreateNetworkSurface(IEnumerable<Curve>, Int32, Int32, IEnumerable<Curve>, Int32, Int32, Double, Double, Double, Int32)
 Builds a surface from an ordered network of curves/edges.
CreateRailRevolvedSurface
 Constructs a railed Surface-of-Revolution.
CreateRuledSurface
 Constructs a ruled surface between two curves. Curves must share the same knot-vector.
CreateSubDFriendly
 Create a bi-cubic SubD friendly surface from a surface.
CreateThroughPoints
 Constructs a NURBS surface from a 2D grid of points.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
FindClosestIsoCurve
 Find the closest isoparamentric curve, given a test point.
IncreaseDegreeU
 Increase the degree of this surface in U direction.
IncreaseDegreeV
 Increase the degree of this surface in V direction.
MakeCompatible
 For expert use only. Makes a pair of compatible NURBS surfaces based on two input surfaces.
MakeNonRational
 Makes this surface non-rational.
MakeRational
 Makes this surface rational.
MakeUniform
 Changes a NURBS surface so each control point affects the surface exactly the same way. This make the knot vectors uniform without changing the control point locations. This will change the object shape slightly.
MatchToCurve
 Constructs a NURBS surface with start and end edge isocurve matching the start and end of targetCurve, and Greville points on targetCurve.
UVNDirectionsAt
 Calculates the U, V, and N directions of a NURBS surface at a u,v parameter similar to the method used by Rhino's MoveUVN command.
Top
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace