RhinoCommon API
UserInterfaceButton Methods
The UserInterfaceButton type exposes the following members.
Methods
Name | Description
OnMouseClick |  (Overrides UserInterfaceObjectBase.OnMouseClick(MouseState).)
Top
See Also
Reference
UserInterfaceButton Class
Rhino.UI Namespace