RhinoCommon API
FileLwo Methods
The FileLwo type exposes the following members.
Methods
Name | Description
Read
Read a lwo file into a RhinoDoc
Write
Write a lwo file based on the contents of a RhinoDoc
Top
See Also
Reference
FileLwo Class
Rhino.FileIO Namespace