RhinoCommon API
ObjectPropertiesPageCollection Methods
The ObjectPropertiesPageCollection type exposes the following members.
Methods
Name | Description
Add
 Custom page to add
Top
See Also
Reference
ObjectPropertiesPageCollection Class
Rhino.UI Namespace