RhinoCommon API
RenderWindow Methods
The RenderWindow type exposes the following members.
Methods
Name | Description
AddChannel
 Add a channel to the frame buffer in addition to the fixed Red, Green, Blue and Alpha channels.
AddWireframeChannel
 This method sets the frame buffer size and adds all the necessary wireframe channels automatically. It also creates the wireframe channel data automatically so that your renderer doesn't have to. You typically call this method only when your renderer does not support wireframe rendering itself. If you call this method, then you should not add any wireframe channels returned by GetRenderChannels(). If your renderer is capable of rendering the wireframe channels itself, you should not call this method. Instead, you must make sure you add the wireframe channels if GetRenderChannels() requests them. See IRhRdkRenderWindow::GetRenderChannels(). After the wires are rendered, the wireframe post effects will composite them into the final rendered image. Note: This method should really be called AddWireframeChannels(). [SDK_UNFREEZE] */
ChannelId
Create
Dispose
EndAsyncRender
 Must be called when an asynchronous render has finished or ended for any reason.
FromSessionId
GetAdjust |  Obsolete.
 OBSOLETE. NOT IMPLEMENTED.
GetBitmap
GetRequestedRenderChannels
 Get array of Guids representing the channels requested by the post effect pipeline for this RenderWindow.
GetRequestedRenderChannelsAsStandardChannels
 Get array of StandardChannels enum values representing the channels requested by the post effect pipeline for this RenderWindow.
Invalidate
 Invalidate the entire view window so that the pixels get painted.
InvalidateArea
IsChannelAvailable
 Query if a channel is available.
IsChannelShown
 Query if a channel is being shown.
OpenChannel
RegisterPostEffectExecutionControl
 Register an instance of PostEffectExecutionControl.
SaveDibAsBitmap
 Save current Dib of RenderWindow as file Helper function for debugging purposes.
SaveRenderImageAs(String, Boolean)
 Like RenderWindow.SaveRenderImageAs(string,Guid,bool), but with Guid set to Guid.Empty.
SaveRenderImageAs(String, Guid, Boolean)
 Save current RenderWindow contents as an image file with the given name. The filetype will be determine. Pass in render engine Guid if an engine implements saving to a format that is not supported by Rhino. Guid.Empty if there is no need for that.
SetAdjust |  Obsolete.
 OBSOLETE. NOT IMPLEMENTED.
SetIsRendering
 Set whether or not rendering is in progress. Added to support raytraced mode.
SetProgress
 Accepts a rendering progress value to inform the user of the rendering advances.
SetRenderOutputRect
 Specify a sub-rectangle of the render window to indicate where the relevant render output has been written. For example, if a renderer chooses to render at half resolution, it could write its data to the top left quadrant of the render window, which can be indicated by setting the render output rectangle. This is set to the full render window size by default. When the render window size is modified, the render output rectangle will be set to reflect the new size.
SetRGBAChannelColors(Rectangle, Color4f[])
 Call this method to open the RenderWindow.StandardChannels.RGBA channel and set a block of color values
SetRGBAChannelColors(Size, Color4f[])
 Call this method to open the RenderWindow.StandardChannels.RGBA channel and set a block of color values
SetSize
SetView
Size
StandardChannelForGuid
 Get the StandardChannels for the given Guid
Top
See Also
Reference
RenderWindow Class
Rhino.Render Namespace