RhinoCommon API
CloudHostUtils Methods
The CloudHostUtils type exposes the following members.
Methods
Name | Description
CheckEntitlement
 Performs the cloud entitlement check (and on AMI-based Marketplace products, also submits a metering record). Re-callable — each invocation runs the gate independently and the platform implementation makes no claim of idempotency. On EC2 with a Marketplace-attached product code and the right IAM role this calls AWS Marketplace MeterUsage; elsewhere this is a no-op.
Top
See Also
Reference
CloudHostUtils Class
Rhino.Runtime Namespace