RhinoCommon API
TextObject Methods
The TextObject type exposes the following members.
Methods
Name | Description
GetTextCorners
 Gets the world 3D corner points of the whole text object.
Top
See Also
Reference
TextObject Class
Rhino.DocObjects Namespace