RhinoCommon API
Rectangle3d Methods
The Rectangle3d type exposes the following members.
Methods
Name | Description
ClosestPoint(Point3d)
 Gets the point on the rectangle that is closest to a test-point.
ClosestPoint(Point3d, Boolean)
 Gets the point on the rectangle that is closest to a test-point.
Contains(Point3d)
 Determines if a point is included in this rectangle.
Contains(Double, Double)
 Determines if two plane parameters are included in this rectangle.
Corner
 Gets the corner at the given index.
CreateFromPolyline(IEnumerable<Point3d>)
 Attempts to create a rectangle from a polyline. This method only works well for polylines that already closely resemble rectangles. If the polyline contains more than four vertices, the least significant ones will be ignored. If the polylines is non-orthogonal, the discrepancies will be averaged away. This method should not be used as a Rectangle fitter.
CreateFromPolyline(IEnumerable<Point3d>, Double, Double)
 Attempts to create a rectangle from a polyline. This method only works well for polylines that already closely resemble rectangles. If the polyline contains more than four vertices, the least significant ones will be ignored. If the polylines is non-orthogonal, the discrepancies will be averaged away. This method should not be used as a Rectangle fitter.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
MakeIncreasing
 Ensures the X and Y dimensions are increasing or singleton intervals.
PointAt(Double)
 Gets a point along the rectangle boundary.
PointAt(Double, Double)
 Gets a point in Rectangle space.
RecenterPlane(Int32)
 Re-centers the base plane on one of the corners.
RecenterPlane(Point3d)
 Re-centers the base plane on a new origin.
ToNurbsCurve
 Constructs a nurbs curve representation of this rectangle.
ToPolyline
 Constructs a polyline from this rectangle.
Transform
 Transforms this rectangle. Note that rectangles cannot be skewed or tapered.
Top
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace