RhinoCommon API
CustomRenderSaveFileTypes Methods
The CustomRenderSaveFileTypes type exposes the following members.
Methods
Name | Description
RegisterFileType
 Call this method to register a custom file save type with the render output window save dialog.
Top
See Also
Reference
CustomRenderSaveFileTypes Class
Rhino.PlugIns Namespace