RhinoCommon API
BrepFace Methods
The BrepFace type exposes the following members.
Methods
Name | Description
AdjacentEdges
 Gets the indices of all the BrepEdges that delineate this Face.
AdjacentFaces
 Gets the indices of all the BrepFaces that surround (are adjacent to) this face.
ChangeSurface
 Expert user tool that replaces the 3d surface geometry use by the face.
ClearMaterialChannelIndex
 Clear this face's rendering material channel index.
ClearPackId
 Sets BrepFace.PackId to 0.
ClosestPointOnFace
 Get the closest point to this face. Closest point finding respects the trims on the face.
CreateExtrusion
 Extrude a face in a Brep.
DraftAnglePoint
 Returns the surface draft angle and point at a parameter.
DuplicateFace
 Duplicate a face from the brep to create new single face brep.
DuplicateSurface
 Gets a copy to the untrimmed surface that this face is based on.
FilletSurfaceToCurve
 Creates a constant-radius fillet surface between a surface and the curve.
FilletSurfaceToRail
 Creates a surface between two surfaces, with a fixed rail curve on the first surface.
GetMesh
 Obtains a reference to a specified type of mesh for this brep face.
IsPointOnFace(Double, Double)
 Tests if a parameter space point is in the active region of a face.
IsPointOnFace(Double, Double, Double)
 Tests if a parameter space point is in the active region of a face.
PullPointsToFace
 Pulls one or more points to a brep face.
RebuildEdges
 Rebuild the edges used by a face so they lie on the surface.
RefitTrim
 The RefitTrim command replaces a trimmed surface edge with an untrimmed edge.
RemoveHoles
 Remove all inner loops, or holes, from a Brep face.
SetDomain
 Sets the surface domain of this face.
 (Overrides Surface.SetDomain(Int32, Interval).)
SetMesh
 Sets a reference to a specified type of mesh for this brep face.
SetPackId
 Used by SubD functions that create breps to transmit the subd face SubDFace.PackId value to the brep face or faces generated from the subd face. Unless you are an expert and doing something very carefully and very fancy, to not call this function.
ShrinkFace
 Shrinks the underlying untrimmed surface of this Brep face close to trimming boundaries. Shrinking a surface is like extending smoothly, only backwards. knot of full multiplicity are added where you want the surface to be cut off. Then the remaining control points are thrown away.
ShrinkSurfaceToEdge
 Shrinks the underlying untrimmed surface of this Brep face right to the trimming boundaries. Note, shrinking the trimmed surface can sometimes cause problems later since having the edges so close to the trimming boundaries can cause commands that use the surface edges as input to fail.
Split(IEnumerable<Curve>, Double)
 Split this face using 3D trimming curves.
TrimAwareIsoCurve
 Similar to IsoCurve function, except this function pays attention to trims on faces and may return multiple curves.
TrimAwareIsoIntervals
 Gets intervals where the iso curve exists on a BrepFace (trimmed surface)
TryGetInteriorPoint
 Tries to get a 3-D point that is comfortably in the interior of this face, which is useful for face labeling and for face classification.
UnderlyingSurface
 Gets the untrimmed surface that is the base of this face.
Top
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace