RhinoCommon API
ConvertibleExtensions Methods
The ConvertibleExtensions type exposes the following members.
Methods
Name | Description
ToColor4f
ToVector2d
ToVector3d
Top
See Also
Reference
ConvertibleExtensions Class
Rhino.Render Namespace