RhinoCommon API
SubDEdge Methods
The SubDEdge type exposes the following members.
Methods
Name | Description
ClearSavedSubdivisionPoints
 Discards the cached subdivision and surface points for this edge, so they are recomputed on next use.
ComponentIndex
 Gets the component index of this edge.
EndSharpness
 Gets the sharpness of this edge at one of its ends.
FaceAt
 Retrieve a SubDFace from this edge.
GetSharpness()
 Gets the sharpness of this edge, reporting Crease for a crease edge.
GetSharpness(Boolean)
 Gets the sharpness of this edge.
RelativeFaceAt
 Gets the face on one side of this edge, relative to the direction this edge is referenced with.
RelativeVertexAt
 Gets one of this edge's two vertices, relative to the direction this edge is referenced with.
ToNurbsCurve
 Get a cubic, uniform, non-rational, NURBS curve that is on the edge's limit curve.
Top
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace