RhinoCommon API
LengthUnit Methods
The LengthUnit type exposes the following members.
Methods
Name | Description
CompareTo
 Compares the current instance with another object of the same type and returns an integer that indicates whether the current instance precedes, follows, or occurs in the same position in the sort order as the other object.
Equals(LengthUnit)
 Indicates whether the current object is equal to another object of the same type.
Equals(Object)
 Indicates whether the current object is equal to another object of the same type.
 (Overrides ValueType.Equals(Object).)
FromCustomUnitSystem
 Creates a custom LengthUnit based on its size expressed on a known UnitSystem.
FromKnownUnitSystem
 Constructs a LengthUnit from a UnitSystem.
GetHashCode
 Returns the hash code for this instance.
 (Overrides ValueType.GetHashCode().)
IsCustom
 Determines whether the specified value is a custom unit.
IsKnownLengthUnit
 Determines whether the provided value is a known unit system.
IsKnownUnitSystem
 Determines whether the instance value is a known unit system.
IsNone
 Determines whether the specified value is None.
IsUnset
 Determines whether the specified value is Unset.
Scale
 Computes the scale factor for changing a measurement on different units.
Size
 Returns the size of this unit expressed on a different length unit.
ToUnitSystem(Double)
 Returns a UnitSystem equivalent to this instance and its size expressed on meters.
ToUnitSystem(Double, ISet<UnitSystem>)
 Returns the most similar UnitSystem to this instance available on unitSystems set.
Top
See Also
Reference
LengthUnit Structure
Rhino Namespace