RhinoCommon API
ClassArrayOnObjRef Methods
The ClassArrayOnObjRef type exposes the following members.
Methods
Name | Description
Add
 Adds an ObjRef to the list.
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToNonConstArray()
 Copies the unmanaged array to a managed counterpart.
ToNonConstArray(RhinoDoc)
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
ClassArrayOnObjRef Class
Rhino.Runtime.InteropWrappers Namespace