RhinoCommon API
ThumbnailViewModelFactory Methods
The ThumbnailViewModelFactory type exposes the following members.
Methods
Name | Description
Get |  (Overrides FactoryBase.Get(Guid).)
Top
See Also
Reference
ThumbnailViewModelFactory Class
Rhino.UI.Controls.ThumbnailUI Namespace