RhinoCommon API
DirectionAnalysisSettings Methods
The DirectionAnalysisSettings type exposes the following members.
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
Top
See Also
Reference
DirectionAnalysisSettings Class
Rhino.ApplicationSettings Namespace