RhinoCommon API
OptionInteger Methods
The OptionInteger type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
OptionInteger Class
Rhino.Input.Custom Namespace