RhinoCommon API
MeshPoint Methods
The MeshPoint type exposes the following members.
Methods
Name | Description
GetTriangle
 Gets the mesh face indices of the triangle where the intersection is on the face takes into consideration the way the quad was split during the intersection.
Top
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace