RhinoCommon API
BinaryArchiveFile Methods
The BinaryArchiveFile type exposes the following members.
Methods
Name | Description
Close
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Open
Top
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace