RhinoCommon API
Interval Methods
The Interval type exposes the following members.
Methods
Name | Description
CompareTo
 Compares this Interval with another interval.
The lower bound has first evaluation priority.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Interval)
 Determines whether the specified Interval is equal to the current Interval, comparing by value.
Equals(Object)
 Determines whether the specified Object is equal to the current Interval, comparing by value.
 (Overrides ValueType.Equals(Object).)
Expand
 Expand an interval by adding the value to T1 and subtracting it from T0. If T1 < T0, T0 and T1 are swapped.
FromIntersection
 Returns a new Interval that is the Intersection of the two input Intervals.
FromUnion
 Returns a new Interval which contains both inputs.
GetHashCode
 Computes the hash code for this Interval object.
 (Overrides ValueType.GetHashCode().)
Grow
 Grows the Interval to include the given number.
IncludesInterval(Interval)
 Tests another interval for Interval inclusion.
IncludesInterval(Interval, Boolean)
 Tests another interval for Interval inclusion.
IncludesParameter(Double)
 Tests a parameter for Interval inclusion.
IncludesParameter(Double, Boolean)
 Tests a parameter for Interval inclusion.
MakeIncreasing
 Ensures this Interval is either singleton or increasing.
NormalizedIntervalAt
Converts interval value, or pair of values, to normalized parameter.
NormalizedParameterAt
Converts interval value, or pair of values, to normalized parameter.
ParameterAt
Converts normalized parameter to interval value, or pair of values.
ParameterIntervalAt
Converts normalized parameter to interval value, or pair of values.
Reverse
 Changes interval to [-T1, -T0].
Swap
 Exchanges T0 and T1.
ToString
 Returns a string representation of this Interval.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
Interval Structure
Rhino.Geometry Namespace