RhinoCommon API
MarkupTable Methods
The MarkupTable type exposes the following members.
Methods
Name | Description
Add
 Adds a new markup with specified definition to the table.
AddReferenceMarkup
 Adds a reference markup that will not be saved in files.
Delete(Markup)
 Deletes a markup.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(IEnumerable<Int32>, Boolean)
 Delete multiple markups.
Delete(Int32, Boolean)
 Deletes a markup.
Delete(IEnumerable<Int32>, Boolean, Int32)
 Delete multiple markups.
Duplicate
 Duplicates a markup.
Find(String)
Finds the markup with a given name.
Find(Guid, Boolean)
Finds a markup with a matching ID.
FindIndex
 Retrieves a markup based on Index. This type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
Finds the markup with a given name.
GetEnumerator |  (Overrides CommonComponentTable<T>.GetEnumerator().)
GetUnusedMarkupName
 Gets unused markup name used as default when creating new markups.
Modify
Modify markup settings.
Top
See Also
Reference
MarkupTable Class
Rhino.DocObjects.Tables Namespace