RhinoCommon API
WorksessionFile Methods
The WorksessionFile type exposes the following members.
Methods
Name | Description
AddModel
Adds a copy of a model to the end of the list.
ClearModels
Removes all of the models.
Dispose
Releases the native worksession.
Dump
 Describes the worksession: its version, and for each model its paths and saved layer settings. For each saved layer it gives its name and the settings Rhino uses.
Finalize
Releases the native worksession.
 (Overrides Object.Finalize().)
FromByteArray
Reads a worksession from the contents of a worksession file.
GetModel
Gets a copy of a model.
GetModels
Gets copies of all of the models.
Read
Reads a worksession file.
ReadFileVersion
 Reads only the version from the header of a worksession file.
RemoveModelAt
Removes a model.
SetModel
Replaces a model with a copy of another.
ToByteArray()
Writes the worksession as the contents of a version 5 .rws file.
ToByteArray(Int32)
Writes the worksession as the contents of a .rws file.
Write(String)
 Writes a version 5 worksession file.
Write(String, Int32)
Writes a worksession file.
Top
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace