RhinoCommon API
UserInterfaceTextBox Methods
The UserInterfaceTextBox type exposes the following members.
Methods
Name | Description
OnEditCanceled
 Called when Escape is pressed. The text has already been put back to what it was when the box took focus. The default implementation raises the EditCanceled event.
OnKeyboardFocusChanged
 Called when the box gains or loses keyboard focus. Read HasKeyboardFocus to find out which. The default implementation raises the KeyboardFocusChanged event.
OnTextChanged
 Called every time the text changes, once per keystroke. The default implementation raises the TextChanged event.
OnTextCommitted
 Called when Enter is pressed, and when the box loses focus with the text changed from what it started with. This is where you do something about the new text. The default implementation raises the TextCommitted event.
TakeKeyboardFocus
 Give this text box keyboard focus, as clicking it does
Top
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace