RhinoCommon API
FileX3dv Methods
The FileX3dv type exposes the following members.
Methods
Name | Description
Write
Write a x3dv file based on the contents of a RhinoDoc
Top
See Also
Reference
FileX3dv Class
Rhino.FileIO Namespace