RhinoCommon API
FileImportPlugIn Methods
The FileImportPlugIn type exposes the following members.
Methods
Name | Description
AddFileTypes
DisplayOptionsDialog
MakeReferenceTableName(String) |  Obsolete.
MakeReferenceTableName(RhinoDoc, String)
ReadFile
Top
See Also
Reference
FileImportPlugIn Class
Rhino.PlugIns Namespace