RhinoCommon API
RuiUpdateUi Methods
The RuiUpdateUi type exposes the following members.
Methods
Name | Description
RegisterMenuItem(Guid, Guid, Guid, RuiUpdateUi.UpdateMenuItemEventHandler)
Register menu item update delegate
RegisterMenuItem(String, String, String, RuiUpdateUi.UpdateMenuItemEventHandler)
Register menu item update delegate
Top
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace