RhinoCommon API
SubDVertexList Methods
The SubDVertexList type exposes the following members.
Methods
Name | Description
Add
 Add a new vertex to the end of the Vertex list.
Find(Int32)
 Find a vertex in this SubD with a given id
Find(UInt32)
 Find a vertex in this SubD with a given id
GetEnumerator
 Implementation of IEnumerable, so a vertex list can be used with foreach and LINQ the same way SubDEdgeList and SubDFaceList can.
SetVertexTags(IEnumerable<SubDVertex>, SubDVertexTag)
 Set vertex tags for a list of vertices. Useful for adding creases to SubDs
SetVertexTags(IEnumerable<Int32>, SubDVertexTag)
 Set vertex tags for a list of vertices. Useful for adding creases to SubDs
Top
See Also
Reference
SubDVertexList Class
Rhino.Geometry.Collections Namespace