RhinoCommon API
UserInterfaceGrid Methods
The UserInterfaceGrid type exposes the following members.
Methods
Name | Description
AddChild
 Append a control to the next cell.
AddEmptyCell
 Append a cell with nothing in it. Use this to leave a hole in a row.
AddHeading
 Append a label that spans every column, for a section heading.
AddLabel
 Append a label to the next cell, which is what most first column cells are. The label is returned so that its text alignment, color or height can be adjusted.
Cell
 Control in a cell by row and column, or null when that cell is empty. The grid has to have been added to a document for this to find anything, since it is the native grid that knows which cell a child ended up in.
Child
 Control in a cell, or null for an empty cell or an out of range index.
EnableRowSeparatorBelowRow
 Draw a horizontal line under one row, for a heading row that wants a rule under it when a line between every row would be too much. RowSeparators draws them all whatever this is set to.
GetChildColumnSpan
GetColumnSizing
GetColumnWidth
 Width of a column in logical pixels as of the most recent layout. This is 0 until the grid has been drawn once.
GetComputedRowHeight
 Height of a row in logical pixels as of the most recent layout. This is 0 until the grid has been drawn once.
InsertChild
 Insert a control at a cell index, shifting the controls after it along.
RemoveAllChildren
 Empty the grid.
RemoveChild
 Take a control out of the grid. Returns the control that was in the cell, or null for an empty cell or an out of range index.
SetChildColumnSpan
 Number of columns a cell occupies. The default is 1. Use this for a section heading or a control that runs the full width of the grid. A span is clamped to the number of columns left in the row.
SetColumnAutoWidth
 Make a column as wide as the widest control in it. Controls report their width from their computed size, so a label column sized this way is exactly as wide as its longest description.
SetColumnContentAlignment
 How the controls in a column sit in their cells. The default is Stretch / Center, which makes a control fill the column width and center itself in the row. Any horizontal setting other than Stretch gives the control the width it reports from its computed size.
SetColumnFixedWidth
 Give a column a width in logical pixels that is never resized.
SetColumnFlexibleWidth
 Have a column share the width the fixed and auto columns do not use. With one flexible column that column gets all of the remaining width; with more than one the remainder is divided in proportion to the weights.
SetColumnMinimumWidth
 Width a column never goes below, in logical pixels. The default is 0.
SetPadding(Double)
 Space between the edges of the grid and its cells in logical pixels. The default is 6 on all four sides.
SetPadding(Double, Double, Double, Double)
Top
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace