RhinoCommon API
ManifestTable Methods
The ManifestTable type exposes the following members.
Methods
Name | Description
ActiveObjectCount
 Total number of items in the manifest, including deleted items.
Clear
 Marks all items as deleted.
Contains
 Determines if an items is contained in this table.
CopyTo
 Copies the content of this table to an array.
FindId(Guid)
 Uses the guid to find a model component. Deleted objects cannot be found by id. The guid is the value that is stored in the .Id property. In a single document, no two active objects have the same guid. If an object is replaced with a new object, then the guid persists. For example, if the _Move command moves an object, then the moved object inherits its guid from the starting object. If the Copy command copies an object, then the copy gets a new guid. This guid persists through file saving/opening operations. This function will not find grip objects.
FindId(Guid, ModelComponentType)
 Uses the guid to find a model component. Deleted objects cannot be found by id. The guid is the value that is stored in the .Id property. In a single document, no two active objects have the same guid. If an object is replaced with a new object, then the guid persists. For example, if the _Move command moves an object, then the moved object inherits its guid from the starting object. If the Copy command copies an object, then the copy gets a new guid. This guid persists through file saving/opening operations. This function will not find grip objects.
FindId<T>(Guid)
 Uses the guid to find a model component. Deleted objects cannot be found by id. The guid is the value that is stored in the .Id property. In a single document, no two active objects have the same guid. If an object is replaced with a new object, then the guid persists. For example, if the _Move command moves an object, then the moved object inherits its guid from the starting object. If the Copy command copies an object, then the copy gets a new guid. This guid persists through file saving/opening operations. This function will not find grip objects.
FindIndex(Int32, ModelComponentType)
 Uses the index to find a model component. The index is the value that is stored in the .Index property.
FindIndex<T>(Int32)
 Uses the index to find a model component. The index is the value that is stored in the .Index property.
FindName(String, ModelComponentType, Guid)
 Uses the name to find a model component. The name is the value that is stored in the .Name property. Deleted objects have no name.
FindName<T>(String, Guid)
 Uses the name to find a model component. The name is the value that is stored in the .Name property. Deleted objects have no name.
FindNameHash(NameHash, ModelComponentType)
 Uses the hash of the name to find a model component. Deleted objects have no name.
FindNameHash<T>(NameHash)
 Uses the hash of the name to find a model component. Deleted objects have no name.
GetEnumerator()
 Visits all model components in the document, including default ones.
GetEnumerator(ModelComponentType)
 Returns an enumerators that yields all model components, including default ones, relating to a particular type.
GetEnumerator<T>()
 Visits all model components in the document, including default ones.
GetModelComponentTypeFromGenericType<T>
 Returns the result of the ComponentType property of a ModelComponent.
Top
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace