RhinoCommon API
Intersection Methods
The Intersection type exposes the following members.
Methods
Name | Description
ArcArc
 Intersects two arcs using exact calculations.
BrepBrep(Brep, Brep, Double, Curve[], Point3d[])
 Intersects two Breps.
BrepBrep(Brep, Brep, Double, Boolean, Curve[], Point3d[])
 Intersects two Breps.
BrepPlane(Brep, Plane, Double, Curve[], Point3d[])
 Intersects a Brep with an (infinite) plane.
BrepPlane(Brep, Plane, Double, Boolean, Curve[], Point3d[])
 Intersects a Brep with an (infinite) plane.
BrepSurface(Brep, Surface, Double, Curve[], Point3d[])
 Intersects a Brep and a Surface.
BrepSurface(Brep, Surface, Double, Boolean, Curve[], Point3d[])
 Intersects a Brep and a Surface.
CircleCircle
 Intersects two circles using exact calculations.
CurveBrep(Curve, Brep, Double, Curve[], Point3d[])
 Intersects a curve with a Brep. This function returns the 3D points of intersection and 3D overlap curves. If an error occurs while processing overlap curves, this function will return false, but it will still provide partial results.
CurveBrep(Curve, Brep, Double, Double, Double[])
 Intersect a curve with a Brep. This function returns the intersection parameters on the curve.
CurveBrep(Curve, Brep, Double, Curve[], Point3d[], Double[])
 Intersects a curve with a Brep. This function returns the 3D points of intersection, curve parameters at the intersection locations, and 3D overlap curves. If an error occurs while processing overlap curves, this function will return false, but it will still provide partial results.
CurveBrepFace
 Intersects a curve with a Brep face.
CurveCurve
 Finds the intersections between two curves.
CurveCurveValidate
 Finds the intersections between two curves.
CurveLine
 Intersects a curve and an infinite line.
CurvePlane
 Intersects a curve with an (infinite) plane.
CurveSelf
 Finds the places where a curve intersects itself.
CurveSurface(Curve, Surface, Double, Double)
 Intersects a curve and a surface.
CurveSurface(Curve, Interval, Surface, Double, Double)
 Intersects a sub-curve and a surface.
CurveSurfaceValidate(Curve, Surface, Double, Double, Int32[], TextLog)
 Intersects a curve and a surface.
CurveSurfaceValidate(Curve, Interval, Surface, Double, Double, Int32[], TextLog)
 Intersects a sub-curve and a surface.
GeometryPlane(GeometryBase, Plane, Double, Boolean, RhinoDoc, Curve[], Point3d[])
 Intersects geometry with an (infinite) plane.
GeometryPlane(GeometryBase, Plane, Double, Boolean, Boolean, Boolean, RhinoDoc, Transform, PlaneIntersectionCache, CancellationToken, Curve[], Point3d[])
 Intersects geometry with an (infinite) plane.
LineBox(Line, BoundingBox, Double, Interval)
 Intersects an infinite line and an axis aligned bounding box.
LineBox(Line, Box, Double, Interval)
 Intersects an infinite line with a box volume.
LineCircle
 Intersects a line with a circle using exact calculations.
LineCylinder
 Intersects a line with a cylinder using exact calculations.
LineLine(Line, Line, Double, Double)
 Find the unique closest-points pair between two infinite lines, if it exists.
LineLine(Line, Line, Double, Double, Double, Boolean)
 Intersects two lines.
LinePlane
 Intersects a line and a plane. This function only returns true if the intersection result is a single point (i.e. if the line is coincident with the plane then no intersection is assumed).
LineSphere
 Intersects a line with a sphere using exact calculations.
MeshLine(Mesh, Line)
 Finds the intersections of a mesh and a line.
MeshLine(Mesh, Line, Int32[])
 Finds the intersections of a mesh and a line. The points are not necessarily sorted.
MeshLineSorted
 Finds the intersections of a mesh and a line. Points are sorted along the line.
MeshMesh
 Intersects meshes. Overlaps and perforations are provided in the output list.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient.
MeshMeshAccurate
 Intersects two meshes. Overlaps and near misses are handled. This is an old method kept for compatibility.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient.
MeshMeshFast
 Fast intersection of two meshes, returned as loose line segments rather than assembled polylines.
Vertices are read in double precision when the mesh has them. Faces that cross or touch within tolerance produce segments; coplanar overlaps are ignored. Use MeshMesh(IEnumerable<Mesh>, Double, Polyline[], Boolean, Polyline[], Boolean, Mesh, TextLog, CancellationToken, IProgress<Double>) when overlaps or joined curves are needed, and MeshMeshPredicate(IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Boolean, TextLog, CancellationToken) when only the yes/no answer is needed.
MeshMeshPredicate(IEnumerable<Mesh>, Double, Int32[], TextLog)
 Determines which meshes intersect. No geometry is computed: each pair of meshes is tested only until its first crossing is found, with the fast intersector behind MeshMeshFast(Mesh, Mesh). Faces that cross or touch within tolerance count; coplanar overlap without a crossing does not.
The same as MeshMeshPredicate(IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Boolean, IntersectingMeshPair[], TextLog, CancellationToken) with fast = true.
MeshMeshPredicate(IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Boolean, TextLog, CancellationToken)
 Determines whether any of the meshes intersect. No geometry is computed, and the search stops at the first pair of meshes that intersect: this is the quickest answer when the intersecting pairs are not needed.
MeshMeshPredicate(IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Boolean, IntersectingMeshPair[], TextLog, CancellationToken)
 Determines which meshes intersect, and reports one intersecting face couple for each pair found. No geometry is computed: each pair of meshes is tested only until its first hit.
MeshMeshTwoSets
 Intersects two sets of meshes with each other. Overlaps and perforations are provided in the output list.
Only events between a mesh of the first set and a mesh of the second set are computed. Intersections among meshes of the same set, and self-intersections within a single mesh, are ignored.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient.
MeshPlane(Mesh, Plane)
 Intersects a mesh with an infinite plane. ZeroTolerance is used as fixed tolerance. We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient instaed.
MeshPlane(Mesh, IEnumerable<Plane>)
 Intersects a mesh with a collection of infinite planes.
ZeroTolerance is used as fixed tolerance.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient instaed.
MeshPlane(Mesh, MeshIntersectionCache, Plane, Double)
 Intersects a mesh with an infinite plane.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient.
MeshPlane(Mesh, MeshIntersectionCache, IEnumerable<Plane>, Double)
 Intersects a mesh with a collection of infinite planes, providing both overlaps and perforations.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient.
MeshPlane(Mesh, MeshIntersectionCache, Plane, Double, Boolean)
 Intersects a mesh with an infinite plane.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient.
MeshPlane(Mesh, MeshIntersectionCache, IEnumerable<Plane>, Double, Boolean)
 Intersects a mesh with a collection of infinite planes.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient.
MeshPolyline
 Finds the intersection of a mesh and a polyline. Starting from version 7, points are always sorted along the polyline.
MeshPolylineSorted
 Finds the intersection of a mesh and a polyline. Points are guaranteed to be sorted along the polyline.
MeshRay(Mesh, Ray3d)
Finds the first intersection of a ray with a mesh.
MeshRay(Mesh, Ray3d, Int32[])
Finds the first intersection of a ray with a mesh.
MeshRays(Mesh, IEnumerable<Ray3d>)
 Finds the first intersection of each one of a set of rays with a mesh.
MeshRays(Mesh, IEnumerable<Ray3d>, Boolean)
 Finds the first intersection of each one of a set of rays with a mesh.
PlaneBoundingBox
 Intersects a plane and a bounding box.
PlaneCircle
 Intersects a plane with a circle using exact calculations.
PlanePlane
 Intersects two planes and return the intersection line. If the planes are parallel or coincident, no intersection is assumed.
PlanePlanePlane
 Intersects three planes to find the single point they all share.
PlaneSphere
 Intersects a plane with a sphere using exact calculations.
ProjectPointsToBreps
 Projects points onto breps.
ProjectPointsToBrepsEx
 Projects points onto breps.
ProjectPointsToMeshes
 Projects points onto meshes.
ProjectPointsToMeshesEx
 Projects points onto meshes.
RayShoot(IEnumerable<GeometryBase>, Ray3d, Int32)
 Computes point intersections that occur when shooting a ray to a collection of surfaces and Breps.
RayShoot(Ray3d, IEnumerable<GeometryBase>, Int32)
 Computes point intersections that occur when shooting a ray to a collection of surfaces and Breps.
RayShoot(IEnumerable<GeometryBase>, Ray3d, Int32, Boolean)
 Computes point intersections that occur when shooting a ray to a collection of surfaces and Breps.
SphereSphere
 Intersects two spheres using exact calculations.
SurfaceSurface
 Intersects two Surfaces.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace