RhinoCommon API
File3dmRenderContent Methods
The File3dmRenderContent type exposes the following members.
Methods
Name | Description
ChildSlotOn
True if a particular child slot is 'on'.
DeleteChild
 Deletes any existing child with the specified child slot name. True if successful, else false.
FindChild
The child with the specified child slot name, or null if no such child exists.
GetParameter
 Gets a named parameter. The parameter value or null if not found.
SetParameter
 Sets a named parameter. True if the parameter was set, else false.
XML
 Gets the render content's state as an XML string.
Top
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace