RhinoCommon API
ContentFactory Methods
The ContentFactory type exposes the following members.
Methods
Name | Description
ContentTypeId
Dispose
Finalize |  (Overrides Object.Finalize().)
Kind
NewContent
 New Content returns a new content, which is Initialized with the Initialize() function. The content should be unitilized after use with the Unitialize function.
Top
See Also
Reference
ContentFactory Class
Rhino.Render.DataSources Namespace