RhinoCommon API
GetCurve Methods
The GetCurve type exposes the following members.
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetControlPointCurve
 Interactively picks the control points of a curve. This is what the Rhino Curve command uses.
GetInterpolatedCurve
 Interactively picks the points an interpolated curve passes through. This is what the Rhino InterpCrv command uses.
Top
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace