RhinoCommon API
TrulyObservableOrderedSet<T> Methods
The TrulyObservableOrderedSet<T> generic type exposes the following members.
Methods
Name | Description
Add
 Adds an object to the end of the ordered set if the set does not already contain the item.
AddRange
 Add multiple objects to the end of the ordered set. Only distinct items are added. If new items were added, one CollectionChanged event is fired.
Clear
 Clears the ordered set.
Contains
 Determines whether an element is in the set.
CopyTo
 Copies the values of the set to an array.
GetEnumerator
 Returns an enumerator that iterates through the set.
IndexOf
 Searches for the specified object and returns the zero-based index of the first occurrence.
Insert
 Inserts an element at the specified index.
Remove
 Removes an element from the set.
RemoveAt
 Removes an element at the specified index from the set.
RemoveRange
 Remove a number of items. If at least one item was removed, one CollectionChanged event is fired.
Sort<TKey>
 Sorts the set.
Top
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace