RhinoCommon API
Command Methods
The Command type exposes the following members.
Methods
Name | Description
DisplayHelp
 Displays help for a command.
GetCommandContextHelpUrl
 Returns a command's context help url.
GetCommandNames
 Gets list of command names in Rhino. This list does not include Test, Alpha, or System commands.
GetCommandStack
 Determines if Rhino is currently running a command. Because Rhino allow for transparent commands (commands that can be run from inside of other commands), this method returns the total ids of active commands.
GetCommandStyle
 Returns a command's style flags.
GetMostRecentCommands
 Gets an array of most recent command descriptions.
InCommand
 Determines if Rhino is currently running a command.
InScriptRunnerCommand
 This is a low level tool to determine if Rhino is currently running a script running command like "ReadCommandFile" or the RhinoScript plug-in's "RunScript".
IsCommand
 Determines is a string is a command.
IsValidCommandName
 Determines if a string is a valid command name.
LookupCommandId
 Returns the ID of a command.
LookupCommandName
 Returns the command name given a command ID.
OnHelp
 Is called when the user needs assistance with this command.
ReplayHistory
 Repeats an operation of a command.
In order to make this function work, you will likely need to grab the Result property that gives the list of input objects. Then, you will be able to replace these inputs by using one of the UpdateToX() methods of the ReplayHistoryResult.
You should NOT use any document AddX() or ReplaceX() functions, as they will break history.
RunCommand
 Executes the command.
RunProxyCommand
 Execute some code as if it were running in a command
Top
See Also
Reference
Command Class
Rhino.Commands Namespace