RhinoCommon API
RhinoList<T> Methods
The RhinoList<T> generic type exposes the following members.
Methods
Name | Description
Add
 Adds an object to the end of the List.
AddRange(IEnumerable)
 Adds the elements of the specified collection to the end of the List.
AddRange(IEnumerable<T>)
 Adds the elements of the specified collection to the end of the List.
AsReadOnly
 Constructs a read-only wrapper of this class.
BinarySearch(T)
 Searches the entire sorted List for an element using the default comparer and returns the zero-based index of the element.
BinarySearch(T, IComparer<T>)
 Searches the entire sorted List for an element using the specified comparer and returns the zero-based index of the element.
BinarySearch(Int32, Int32, T, IComparer<T>)
 Searches the entire sorted List for an element using the specified comparer and returns the zero-based index of the element.
Clear
 Removes all elements from the List.
Contains
 Determines whether an element is in the List.
ConvertAll<TOutput>
 Aggregates all results of a conversion function over this table into a new list.
CopyTo(T[])
 Copies the entire List to a compatible one-dimensional array, starting at the beginning of the target array.
CopyTo(T[], Int32)
 Copies the entire List to a compatible one-dimensional array, starting at the specified index of the target array.
CopyTo(Int32, T[], Int32, Int32)
 Copies a range of elements from the List to a compatible one-dimensional array, starting at the specified index of the target array.
Duplicate
 Returns a shallow copy of this instance. If the generic type is comprised of only value types (struct, enum, ptr), then the result will be a deep copy.
Exists
 Determines whether the List contains elements that match the conditions defined by the specified predicate.
Find
 Searches for an element that matches the conditions defined by the specified predicate, and returns the first occurrence within the entire List.
FindAll
 Retrieves all the elements that match the conditions defined by the specified predicate.
FindIndex(Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the first occurrence within the entire List.
FindIndex(Int32, Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the first occurrence within the entire List.
FindIndex(Int32, Int32, Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the first occurrence within the range of elements in the List that extends from the specified index to the last element.
FindLast
 Searches for an element that matches the conditions defined by the specified predicate, and returns the last occurrence within the entire List.
FindLastIndex(Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the last occurrence within the entire List.
FindLastIndex(Int32, Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the last occurrence within the entire List.
FindLastIndex(Int32, Int32, Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the last occurrence within the entire List.
ForEach
 Performs the specified action on each element of the List.
GetEnumerator
 Constructs an enumerator that is capable of iterating over all items in this list.
GetRange
 Constructs a shallow copy of a range of elements in the source List.
IndexOf(T)
 Searches for the specified object and returns the zero-based index of the first occurrence within the entire List.
IndexOf(T, Int32)
 Searches for the specified object and returns the zero-based index of the first occurrence within the range of elements in the List that extends from the specified index to the last element.
IndexOf(T, Int32, Int32)
 Searches for the specified object and returns the zero-based index of the first occurrence within the range of elements in the List that starts at the specified index and contains the specified number of elements.
Insert
 Inserts an element into the List at the specified index.
InsertRange
 Inserts the elements of a collection into the List at the specified index.
LastIndexOf(T)
 Searches for the specified object and returns the zero-based index of the last occurrence within the entire List.
LastIndexOf(T, Int32)
 Searches for the specified object and returns the zero-based index of the last occurrence within the range of elements in the List that extends from the first element to the specified index.
LastIndexOf(T, Int32, Int32)
 Searches for the specified object and returns the zero-based index of the last occurrence within the range of elements in the List that contains the specified number of elements and ends at the specified index.
RemapIndex
 Remap an index in the infinite range onto the List index range.
Remove
 Removes the first occurrence of a specific object from the List.
RemoveAll
 Removes the all the elements that match the conditions defined by the specified predicate.
RemoveAt
 Removes the element at the specified index of the List.
RemoveNulls
 Removes all elements from the List that are null references (Nothing in Visual Basic). This function will not do anything if T is not a Reference type.
RemoveRange
 Removes a range of elements from the List.
Reverse()
 Reverses the order of the elements in the entire List.
Reverse(Int32, Int32)
 Reverses the order of the elements in the specified range.
Sort()
 Sorts the elements in the entire List using the default comparer.
Sort(Comparison<T>)
 Sorts the elements in the entire list using the specified comparer.
Sort(Double[])
 Sort this list based on a list of numeric keys of equal length. The keys array will not be altered.
Sort(IComparer<T>)
 Sorts the elements in the entire list using the specified System.Comparison(T)
Sort(Int32[])
 Sort this list based on a list of numeric keys of equal length. The keys array will not be altered.
Sort(Int32, Int32, IComparer<T>)
 Sorts the elements in a range of elements in list using the specified comparer.
ToArray
 Constructs an array that contains all items in this list.
TrimExcess
 Sets the capacity to the actual number of elements in the List, if that number is less than a threshold value.
TrueForAll
 Determines whether every element in the List matches the conditions defined by the specified predicate.
Top
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace