RhinoCommon API
CustomGripObject Methods
The CustomGripObject type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean) |  (Overrides CommonObject.Dispose(Boolean).)
EvaluateCurveCVIndices
 The indices of the NURBS curve control points this grip drives. A grip may drive more than one, as at a closed or periodic seam.
EvaluateCurveParameter
 The curve parameter of the control point this grip drives.
EvaluateGripDirections
 Evaluates this grip's directions. For a surface control point these are the two surface tangents and the normal; for a curve control point, the tangent and a frame around it. Rhino caches the result per grip and does not ask again, so the directions must not change once reported.
EvaluateSurfaceCVIndices
 The indices of the NURBS surface control points this grip drives. A grip may drive more than one, as at a closed or periodic seam or a singular edge. Every index must lie inside the surface returned by the owning CustomObjectGrips' NurbsSurface(). Rhino writes through these indices without checking them, so a grip reporting one outside the control point grid is refused whole.
EvaluateSurfaceParameters
 The surface parameters of the control point this grip drives.
Finalize |  (Overrides CommonObject.Finalize().)
NewLocation
OnUndoMove
 Called when Rhino undoes a grip move. Restore anything the grip changed alongside its location, such as a weight. The location itself is restored by Rhino.
Top
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace