RhinoCommon API
StringParser Methods
The StringParser type exposes the following members.
Methods
Name | Description
ParseAngleExpession
ParseAngleExpressionDegrees
ParseAngleExpressionRadians
ParseLengthExpession(String, StringParserSettings, UnitSystem, Double)
 Parse a string for a length value. Expression can include complex expressions Simplest version of Length parsing
ParseLengthExpession(String, Int32, Int32, StringParserSettings, UnitSystem, Double, StringParserSettings, UnitSystem)
 Parse a string for a length value. Expression can include complex expressions Most complex version of length parsing
ParseNumber
 Parse a string expression to get a number
Top
See Also
Reference
StringParser Class
Rhino.Input Namespace