RhinoCommon API
Notification Methods
The Notification type exposes the following members.
Methods
Name | Description
Editable
 Determines whether an assembly can modify the instance. Any code that modifies an assembly protected notification must be wrapped in a ExecuteAssemblyProtectedCode(Action) method.
ExecuteAssemblyProtectedCode(Action)
 If a Notification object is only allowed to be modified by certain assemblies, then any code that interacts with it must be wrapped around this method, or a InvalidOperationException will be thrown. For performance reasons, the code wrapped by this method should be kept as simple as possible.
ExecuteAssemblyProtectedCode<TResult>(Func<TResult>)
 If a Notification object is only allowed to be modified by certain assemblies, then any code that interacts with it must be wrapped around this method, or a InvalidOperationException will be thrown. For performance reasons, the code wrapped by this method should be kept as simple as possible.
HideModal
 Tells Rhino to hide the notification if it is being currently shown as a modal.
RemoveMetadata
 Removes metadata from this instance.
ShowModal
 Tells Rhino to display the notification modally.
ToString
 Returns a readable string representation of the instance.
 (Overrides Object.ToString().)
Top
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace