RhinoCommon API
SubDEdgeSharpness Methods
The SubDEdgeSharpness type exposes the following members.
Methods
Name | Description
CreateEdgeChainSharpness
 Builds a sequence of evenly changing sharpnesses for the edges of a chain.
EndSharpness
 Gets the sharpness at the start or the end of the edge.
EqualDelta
 Determines whether two sharpnesses have the same Delta and meet with the same value.
EqualEndSharpness
 Determines whether two sharpnesses meet with the same value, that is, whether s0.EndSharpness(1) equals s1.EndSharpness(0).
Equals(Object)
 Determines whether an object is a sharpness with the same end values as this one.
 (Overrides ValueType.Equals(Object).)
Equals(SubDEdgeSharpness)
 Determines whether this sharpness has the same end values as another one.
EqualTrend
 Determines whether two sharpnesses have the same Trend and meet with the same value.
FromConstantPercentage
 Creates a sharpness with the same value at both ends, from a percentage. This is useful in user interface code that expresses sharpness as a percentage.
FromIntervalPercentage(Interval)
 Creates a sharpness that varies from one end of the edge to the other, from percentages. This is useful in user interface code that expresses sharpness as a percentage.
FromIntervalPercentage(Double, Double)
 Creates a sharpness that varies from one end of the edge to the other, from percentages. This is useful in user interface code that expresses sharpness as a percentage.
GetHashCode
 Gets a hash code for this sharpness.
 (Overrides ValueType.GetHashCode().)
IsValidValue
 Determines whether a value can be used as an edge end sharpness.
Reversed
 Gets this sharpness with its two end values swapped.
Sanitize(Double)
 Verifies that sharpness is between 0.0 and MaximumValue, and snaps it to an integer when it is within Tolerance of one.
Sanitize(Double, Double)
 Verifies that sharpness is between 0.0 and MaximumValue, and snaps it to an integer when it is within Tolerance of one.
SharpnessFromNormalizedValue
 Converts a normalized slider value to an edge end sharpness value.
SharpnessFromSliderValue
 Converts a user facing slider value to an edge end sharpness value.
Subdivided
 Gets the sharpness this edge would have after one subdivision.
ToPercentage
 Converts a sharpness value to a percentage between 0.0 and 100.0.
ToPercentageText(Boolean)
 Describes this sharpness as a percentage, for user interface code. A constant sharpness gives a single percentage, a variable one gives a range, and an invalid one gives a warning sign.
ToPercentageText(Double)
 Describes a single end sharpness value as a percentage, for user interface code.
ToString
 Returns a string that represents this sharpness as a percentage.
 (Overrides ValueType.ToString().)
Union
 Gets the union of two sharpness ranges, ignoring the ones that are zero, a crease, or not valid.
VertexSharpness
 Calculates the sharpness of a vertex from the sharp edges attached to it. Vertices tagged as corners always have a sharpness of 0.0.
Top
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace