RhinoCommon API
UserDataList Methods
The UserDataList type exposes the following members.
Methods
Name | Description
Add
 If the user-data is already in a different UserDataList, it will be removed from that list and added to this list.
Contains
 Checks for the existence of a specific type of user-data in this list Both .NET and native user-data is checked
Find
 Finds a specific data type in this regulated collection.
GetEnumerator
 Get enumerator for UserDataList
Purge
 Removes all user data from this geometry.
Remove
 Remove the user-data from this list
Top
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace