RhinoCommon API
File3mfWriteOptions Methods
The File3mfWriteOptions type exposes the following members.
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
File3mfWriteOptions Class
Rhino.FileIO Namespace