RhinoCommon API
RenderContentCollection Methods
The RenderContentCollection type exposes the following members.
Methods
Name | Description
Add
 Add an array of non-const contents to the collection.
Append
 Append a RenderContent to the collection
Clear
 Clear the collection.
ContentAt
 Content at index
ContentNeedsPreviewThumbnail
 To be documented
Count
 The number of items in the collection.
Dispose
 Dispose function for RenderContentCollection
Finalize
 Finalizer for RenderContentCollection
 (Overrides Object.Finalize().)
Find_Sel
 TODO
FirstTag
 Gets the first tag
GetEnumerator
 Enumerates the contents in the collection. This makes it possible to use the collection directly in a foreach loop instead of manually driving a ContentCollectionIterator:
foreach (RenderContent content in collection) { ... }
 The collection also implements IEnumerable<RenderContent>, so LINQ can be used on it directly. Note that this method returns the non-generic enumerator for backwards compatibility, which is why the loop variable above is declared as RenderContent rather than var.
GetFilterContentByUsage
 Gets usage filter type for collection
GetForcedVaries
 See SetForcedVaries
GetSearchPattern
 See SetSearchPattern
Iterator
 Gets an iterator for the collection
NextTag
 Call FirstTag first - this gets the next tag
Remove
 Remove an array of contents from the collection.
Set
 Set an array of const contents as the collection.
SetForcedVaries
 Set the collection to 'varies'. Only valid if the collection is a 'selection' collection. Useful for clients that only support single content selections.
SetSearchPattern
 Sets a search pattern for filtering contents. This is not actually used by the iterator, but is stored for use by any UI that wants to filter contents based on a search string by using the function RhRdkCheckSearchPattern()
Top
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace