RhinoCommon API
RenderPrimitive Methods
The RenderPrimitive type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Mesh
 Returns the mesh associated with the object, this will mesh primitives and always return a mesh.
TryGetBox
 Call this method to get a Box primitive for this mesh. If this meshes PrimitiveType is not a Box then the box parameter is set to Empty.
TryGetCone
 Call this method to get a Cone primitive for this mesh. If this meshes PrimitiveType is not a Cone then the cone parameter is set to Unset and the truncation parameter is set to Unset.
TryGetPlane
 Call this method to get a Plane primitive for this mesh. If this meshes PrimitiveType is not a Plane then the plane parameter is set to null.
TryGetSphere
 Call this method to get a sphere primitive for this mesh. If this meshes PrimitiveType is not a Sphere then the sphere parameter is set to Unset.
Top
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace