RhinoCommon API
SurfaceFilletBase Methods
The SurfaceFilletBase type exposes the following members.
Methods
Name | Description
ChangeFilletRadius
 This will clear out the existing rails and fillet surfaces, and redo the offset intersections, etc.
CreateG2ChordalQuinticFilletSrf
 Creates a surface fillet using G2 chordal Quintic arc approximations as sections
CreateNonRationalCubicArcsFilletSrf
 Creates a surface fillet using Non-rational Cubic arc approximations as sections
CreateNonRationalCubicFilletSrf
 Creates a fillet using non-rational Cubic sections with a tangent slider
CreateNonRationalQuarticArcsFilletSrf
 Creates a surface fillet using Non-rational Quartic arc approximations as sections
CreateNonRationalQuarticFilletSrf
 Creates a fillet using non-rational Quartic sections with a tangent and inner slider
CreateNonRationalQuinticArcsFilletSrf
 Creates a surface fillet using Non-rational Quintic arc approximations as sections
CreateNonRationalQuinticFilletSrf
 Creates a fillet using non-rational Quintic sections with a tangent and inner slider
CreateRationalArcsFilletSrf
 Creates a standard surface fillet using rational arc sections
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 (Overrides Object.Finalize().)
G2ChordalQuintic
 make fillet surfaces and hack them up to active pieces. Adjusts cross sections
IsInitialized
 Check to see if the fillet is properly initialized. If it is not, then the selected curves, surfaces, and/or radius must be adjusted in some way before creating the fillet
Lines
 make chamfer surfaces and hack them up to active pieces. Adjusts cross sections
NonRationalCubic
 make fillet surfaces and hack them up to active pieces. Adjusts cross sections
NonRationalCubicArcs
 make fillet surfaces and hack them up to active pieces. Adjusts cross sections
NonRationalQuartic
 make fillet surfaces and hack them up to active pieces. Adjusts cross sections
NonRationalQuarticArcs
 make fillet surfaces and hack them up to active pieces. Adjusts cross sections
NonRationalQuintic
 make fillet surfaces and hack them up to active pieces. Adjusts cross sections
NonRationalQuinticArcs
 make fillet surfaces and hack them up to active pieces. Adjusts cross sections
RationalArcs
 make fillet surfaces and hack them up to active pieces. Adjusts cross sections
TrimBreps
 If the two input breps are the same, TrimmedBreps[1] will be empty. The constructor idoes everything necessary for this to be called. Calles to the various fillet creation members will not change the result.
Top
See Also
Reference
SurfaceFilletBase Class
Rhino.Geometry Namespace