RhinoCommon API
SurfaceCurvature Methods
The SurfaceCurvature type exposes the following members.
Methods
Name | Description
CompareTo
 Compares the current instance with another object of the same type and returns an integer that indicates whether the current instance precedes, follows, or occurs in the same position in the sort order as the other object.
Create
 Create a SurfaceCurvature from explicit principal curvatures and the geometric frame at the evaluation point. Use this when you have already computed curvature data from a non-RhinoCommon surface representation (planes, spheres, cylinders, cones, etc.).
CreateFromGaussianAndMeanCurvatures
 Create a SurfaceCurvature from a gaussian and mean curvature values using the relationship between the principal curvatures, gaussian and mean: kappa1 = mean + sqrt(mean*mean - gaussian) kappa2 = mean - sqrt(mean*mean - gaussian) If the radicand is negative, we assume we're dealing with a bit of numerical noise or estimates and set the principal curvatures: kappa1 = kappa2 = sign(mean)*sqrt(gaussian)
CreateFromPrincipalCurvatures
 Create a SurfaceCurvature from the principal curvature values. The principal curvature values are the most fundamental curvature properties of a surface. Other curvatures are calculated from them.
CreateFromSubD(SubD, SubDComponentParameter)
 Create a SurfaceCurvature by evaluating a SubD's surface (its limit surface) at a surface parameter.
CreateFromSubD(SubD, SubDComponentParameter, SubD.ExtraordinaryVertexCurvature)
 Create a SurfaceCurvature by evaluating a SubD's surface (its limit surface) at a surface parameter, choosing what to report exactly on an extraordinary vertex.
CreateFromSurface
 Create a SurfaceCurvature from by evaluating surface and a u,v parameter.
Direction
 Gets the principal curvature direction vector at the u,v parameter where the surface curvature was evaluated..
Dispose
 Actively releases the unmanaged pointer.
Equals(Object)
 Indicates whether the current object is equal to another object of the same type.
 (Overrides Object.Equals(Object).)
Equals(SurfaceCurvature)
 Indicates whether the current object is equal to another object of the same type.
Finalize
 Passively releases the unmanaged pointer.
 (Overrides Object.Finalize().)
GetHashCode
 Returns a runtime-stable hash code for this object.
 (Overrides Object.GetHashCode().)
Kappa
 Gets the principal curvature values: kappa1 - Principal curvature with maximum absolute value. kappa2 - Principal curvature with minimum absolute value.
KappaValue
 Calculate one of the four typical curvature values associated with the two principal curvatures and frequently used in false color curvature analysis.
OsculatingCircle
 Computes the osculating circle along the given direction.
Top
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace