RhinoCommon API
ViewCaptureWriter Methods
The ViewCaptureWriter type exposes the following members.
Methods
Name | Description
Draw
DrawBitmap
DrawCircle
DrawGradientHatch
DrawPath
DrawRectangle
DrawScreenText
FillPolygon
Flush
PopClipPath
PushClipPath(ViewCaptureWriter.PathPoint[])
PushClipPath(RectangleF)
SetClipPath
SupportsArc
Top
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace