RhinoCommon API
File3dmNamedConstructionPlanes Methods
The File3dmNamedConstructionPlanes type exposes the following members.
Methods
Name | Description
Add(ConstructionPlane)
 Adds a named construction plane to the table.
Add(String, Plane)
 Adds a named construction plane to the table.
Clear
 Removes all named construction planes from the table.
Contains
 Returns an indication of the presence of a named construction plane in the table.
CopyTo
 Copies the content of the table to an array.
Delete(ConstructionPlane)
 Deletes a named construction plane from the table.
Delete(Int32)
 Remove a named construction plane from the table.
FindName
 Finds a named construction plane given its name.
GetEnumerator
 Gets an enumerator that yields all construction planes in this collection.
IndexOf
 Returns the index of a named construction plane.
Top
See Also
Reference
File3dmNamedConstructionPlanes Class
Rhino.FileIO Namespace