RhinoCommon API
ILocalizationService Methods
The ILocalizationService type exposes the following members.
Methods
Name | Description
LocalizeCommandName
LocalizeDialogItem
LocalizeForm
LocalizeString
Top
See Also
Reference
ILocalizationService Interface
Rhino.UI Namespace