RhinoCommon API
CustomObjectGrips Methods
The CustomObjectGrips type exposes the following members.
Methods
Name | Description
AddGrip
Dispose()
Dispose(Boolean)
Dragging
 Determines if grips are currently being dragged.
Finalize |  (Overrides Object.Finalize().)
Grip
NeighborGrip
Get neighbors.
NewGeometry
 If the grips control just one object, then override NewGeometry(). When NewGeometry() is called, return new geometry calculated from the current grip locations. This happens once at the end of a grip drag.
NurbsCurve
 If the grips control a NURBS curve, this returns a pointer to that curve. You can look at but you must NEVER change this curve. Return a curve held in a field, never a temporary: Rhino keeps the underlying pointer after this call returns.
NurbsCurveGrip
 If the grips are control points of a NURBS curve, then this gets the grip that controls the i-th CV.
NurbsSurface
 If the grips control a NURBS surface, this returns a pointer to that surface. You can look at but you must NEVER change this surface. Return a surface held in a field, never a temporary: Rhino keeps the underlying pointer after this call returns.
NurbsSurfaceGrip
 If the grips are control points of a NURBS surface, then this gets the index of the grip that controls the (i,j)-th CV.
OnDraw
 Draws the grips. In your implementation, override this if you need to draw dynamic elements and then call this base implementation to draw the grips themselves.
OnReset
 Resets location of all grips to original spots and cleans up stuff that was created by dynamic dragging. This is required when dragging is canceled or in the Copy command when grips are "copied". The override should clean up dynamic workspace stuff.
OnResetMeshes
 Just before Rhino turns off object grips, it calls this function. If grips have modified any display meshes, they must override this function and restore the meshes to their original states.
OnUpdateMesh
 Just before Rhino shades an object with grips on, it calls this method to update the display meshes. Grips that modify surface or mesh objects must override this function and modify the display meshes here.
RegisterGripsEnabler
Top
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace