RhinoCommon API
ComponentIndex Methods
The ComponentIndex type exposes the following members.
Methods
Name | Description
CompareTo
 Compares this ComponentIndex with another ComponentIndex.
Equals(ComponentIndex)
 Determines whether the specified ComponentIndex is equal to the current ComponentIndex, comparing by value.
Equals(Object)
 Determines whether the specified Object is equal to the current ComponentIndex, comparing by value.
 (Overrides ValueType.Equals(Object).)
GetHashCode
 Computes the hash code for this ComponentIndex object.
 (Overrides ValueType.GetHashCode().)
IsUnset
 Return true is this component index is the same as the Unset component index
Top
See Also
Reference
ComponentIndex Structure
Rhino.Geometry Namespace