RhinoCommon API
ControlPoint Methods
The ControlPoint type exposes the following members.
Methods
Name | Description
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(ControlPoint)
 Determines if two points exactly match.
Top
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace