RhinoCommon API
LightTable Methods
The LightTable type exposes the following members.
Methods
Name | Description
Add(Light)
Add(Light, ObjectAttributes)
Delete(LightObject) |  (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32, Boolean)
Find
FindIndex
 Retrieves a object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds the LightObject with a given name.
Deleted lights have no name.
FindNameHash
 Finds a LightObject given its name hash.
GetEnumerator |  (Overrides CommonComponentTable<T>.GetEnumerator().)
Modify(Guid, Light)
Modify(Int32, Light)
Undelete
Restores a light that has been deleted.
Top
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace