RhinoCommon API
FileSvgReadOptions Methods
The FileSvgReadOptions type exposes the following members.
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Import function
Top
See Also
Reference
FileSvgReadOptions Class
Rhino.FileIO Namespace