RhinoCommon API
GroupTable Methods
The GroupTable type exposes the following members.
Methods
Name | Description
Add()
Adds a new empty group to the group table.
Add(IEnumerable<Guid>)
 Adds a new group to the group table with a set of objects.
Add(String)
Adds a new empty group to the group table.
Add(String, IEnumerable<Guid>)
 Adds a new group to the group table with a set of objects.
AddToGroup(Int32, IEnumerable<Guid>)
 Adds a list of objects to an existing group.
AddToGroup(Int32, Guid)
 Adds an object to an existing group.
ChangeGroupName
 Changes the name of a group.
Delete(Group) |  (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32)
 Deletes a group from this table.
Deleted groups are kept in the runtime group table so that undo will work with groups. Call IsDeleted() to determine if a group is deleted.
FindIndex
 Retrieves a Group object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds a group given its name. Returns the instance, rather than the index.
FindNameHash
 Finds a group given its name hash.
GroupMembers
 Gets an array of all of the objects in a group.
GroupName
 Returns the name of a group.
GroupNames
 Returns an array of all group names.
GroupObjectCount
 Returns the number of objects that are members of a group.
Hide
 Hides all objects that are members of a group.
IsDeleted
 Verifies a group is deleted.
Lock
 Locks all objects that are members of a group.
PurgeUnused
 Purges any unused groups.
RemapObjects(IEnumerable<RhinoObject>)
 Remaps an enumeration of Rhino objects to new groups.
RemapObjects(IEnumerable<RhinoObject>, Dictionary<Int32, Int32>)
 Remaps an enumeration of Rhino objects to new groups.
Show
 Shows, or unhides, all objects that are members of a group.
Undelete
 Undeletes a previously deleted group.
Unlock
 Unlocks all objects that are members of a group.
Top
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace