RhinoCommon API
Vector2d Methods
The Vector2d type exposes the following members.
Methods
Name | Description
Add
 Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
CompareTo
 Compares this Vector2d with another Vector2d.
Components evaluation priority is first X, then Y.
Divide
 Divides a Vector2d by a number, having the effect of shrinking it.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Vector2d and has the same value as the present vector.
 (Overrides ValueType.Equals(Object).)
Equals(Vector2d)
 Determines whether the specified vector has the same value as the present vector.
GetHashCode
 Provides a hashing value for the present vector.
 (Overrides ValueType.GetHashCode().)
IsTiny()
 Uses RhinoMath.ZeroTolerance for IsTiny calculation.
IsTiny(Double)
 Determines whether a vector is very short.
Multiply(Double, Vector2d)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector2d, Vector2d)
 Multiplies two vectors together, returning the dot product (or inner product).
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector2d, Double)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Negate
 Computes the reversed vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
Rotate
 Rotates this vector.
Subtract
 Subtracts the second vector from the first one.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
ToString()
 Constructs a string representation of the current vector.
 (Overrides ValueType.ToString().)
ToString(String, IFormatProvider)
Formats the value of the current instance using the specified format.
Unitize
 Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
Top
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace