RhinoCommon API
NamedLayerStateTable Methods
The NamedLayerStateTable type exposes the following members.
Methods
Name | Description
Delete
 Deletes an existing named layer state.
FindName
 Returns the index of an existing named layer state.
Import
 Imports named layer states from a 3dm file.
Rename
 Renames an existing named layer state.
Restore(String, RestoreLayerProperties)
 Restores a named layer state.
Restore(String, RestoreLayerProperties, Guid)
 Restores a named layer state.
Save(String)
 Saves or updates a named layer state.
Save(String, Guid)
 Saves or updates a named layer state.
Top
See Also
Reference
NamedLayerStateTable Class
Rhino.DocObjects.Tables Namespace