RhinoCommon API
RhinoPageView Methods
The RhinoPageView type exposes the following members.
Methods
Name | Description
AddDetailView
 Creates a detail view object that is displayed on this page and adds it to the document.
AddToPageViewGroup
 Add this page view to a page view group.
Duplicate
Copies a page view.
GetDetailViews
 Gets a list of the detail view objects associated with this layout.
GetPageViewGroupList
 Gets an array of page view group indices this page view belongs to.
GetPreviewImage
 Creates a preview image of the page.
IsInPageViewGroup
 Determines if this page view belongs in a page view group.
PageViewGroupSortIndex
 Gets this page view's sort index within a page view group. The sort index determines the order of the page view among the other members of the group, independent of the document page (view-table) order.
RemoveFromAllageViewGroups
 Removes this page view to all page view groups.
RemoveFromPageViewGroup
 Removes this page view to a page view group.
SetActiveDetail(Guid)
 Sets the active detail.
SetActiveDetail(String, Boolean)
 Sets the active detail.
SetPageAsActive
 Deactivates the active details and sets the page view as active.
SetPageViewGroupSortIndex
 Sets this page view's sort index (position) within a page view group, repositioning it among the group's members and renumbering the rest so the group stays contiguously ordered. A sort index at or beyond the member count moves the page view to the end. If the page view is not yet in the group, it is added.
Top
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace