RhinoCommon API
MeshExtruder Methods
The MeshExtruder type exposes the following members.
Methods
Name | Description
Dispose
 Dispose of this object and any unmanaged memory associated with it.
ExtrudedMesh(Mesh)
 Creates new extruded mesh. Returns true if any edges or faces were extruded.
ExtrudedMesh(Mesh, List<ComponentIndex>)
 Creates new extruded mesh. Returns true if any edges or faces were extruded.
Finalize
 Destructor
 (Overrides Object.Finalize().)
GetWallFaces
 Return list of faces that were added to connect transformed edges/faces to non-transformed edges/faces.
Top
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace