RhinoCommon API
FileX3dvWriteOptions Methods
The FileX3dvWriteOptions type exposes the following members.
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
FileX3dvWriteOptions Class
Rhino.FileIO Namespace