RhinoCommon API
SimpleArrayClippingPlaneObjectPointer Methods
The SimpleArrayClippingPlaneObjectPointer type exposes the following members.
Methods
Name | Description
Add
 Adds a clipping plane to the list.
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
Top
See Also
Reference
SimpleArrayClippingPlaneObjectPointer Class
Rhino.Runtime.InteropWrappers Namespace