RhinoCommon API
File3dmRenderMaterials Methods
The File3dmRenderMaterials type exposes the following members.
Methods
Name | Description
Find
 Finds a material by its id, if possible. Returns null on failure.
GetEnumerator
Top
See Also
Reference
File3dmRenderMaterials Class
Rhino.FileIO Namespace