RhinoCommon API
FileNwdWriteOptions Methods
The FileNwdWriteOptions type exposes the following members.
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
FileNwdWriteOptions Class
Rhino.FileIO Namespace