RhinoCommon API
PointCloudObject Methods
The PointCloudObject type exposes the following members.
Methods
Name | Description
DuplicatePointCloudGeometry
Top
See Also
Reference
PointCloudObject Class
Rhino.DocObjects Namespace