RhinoCommon API
MeshUnwrapper Methods
The MeshUnwrapper type exposes the following members.
Methods
Name | Description
Dispose
 Dispose of this object and any unmanaged memory associated with it.
Finalize
 Destructor
 (Overrides Object.Finalize().)
Unwrap
 Unwraps the meshes passed in as constructor arguments and stores the results in texture coordinates.
Top
See Also
Reference
MeshUnwrapper Class
Rhino.Geometry Namespace