RhinoCommon API
LengthMassProperties Methods
The LengthMassProperties type exposes the following members.
Methods
Name | Description
CentroidCoordinatesPrincipalMoments
 Calculates the eigenvalues and eigenvectors of the moments matrix with respect to centroid coordinates.
CentroidCoordinatesPrincipalMomentsOfInertia
 Calculates the principal moments of inertia and principal axes with respect to centroid coordinates.
Compute(Curve)
 Calculates the length mass properties of a curve.
Compute(IEnumerable<Curve>)
 Calculates the length mass properties of an enumeration of curves.
Compute(Curve, Boolean, Boolean, Boolean, Boolean)
 Calculates the length mass properties of a curve.
Compute(IEnumerable<Curve>, Boolean, Boolean, Boolean, Boolean)
 Calculates the length mass properties of an enumeration of curves.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Sum(LengthMassProperties)
 Sum mass properties together to get an aggregate mass.
Sum(IEnumerable<LengthMassProperties>, Boolean)
 Sum mass properties together to get an aggregate mass.
WeightedSum
 Sum a list of mass properties together to get an aggregate mass, weighting each by a density factor.Ignores existing mass properties in this object.
WorldCoordinatesPrincipalMoments
 Calculates the eigenvalues and eigenvectors of moments matrix in world coordinates.
WorldCoordinatesPrincipalMomentsOfInertia
 Calculates the principal moments of inertia and principal axes with respect to world coordinates.
Top
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace