RhinoCommon API
PreviewJobSignature Methods
The PreviewJobSignature type exposes the following members.
Methods
Name | Description
Compare
 Compare two Preview Job Signatures. True if they are the same, otherwise false.
Dispose
 Dispose
Finalize
 Preview Job Signature destructor
 (Overrides Object.Finalize().)
ImageHeight
 The Height of the rendered preview image
ImageWidth
 The Width of the rendered preview image
Top
See Also
Reference
PreviewJobSignature Class
Rhino.Render Namespace