RhinoCommon API
IntersectingMeshPair Methods
The IntersectingMeshPair type exposes the following members.
Methods
Name | Description
Deconstruct
 Deconstructs this pair, so that it can be written as var (meshIndexA, meshIndexB, _, _) = pair;.
Top
See Also
Reference
IntersectingMeshPair Structure
Rhino.Geometry.Intersect Namespace