RhinoCommon API
TwoColorRenderTexture Methods
The TwoColorRenderTexture type exposes the following members.
Methods
Name | Description
AddAdditionalUISections
OnAddUserInterfaceSections |  (Overrides RenderContent.OnAddUserInterfaceSections().)
Top
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace