RhinoCommon API
OptionColor Methods
The OptionColor type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
OptionColor Class
Rhino.Input.Custom Namespace