RhinoCommon API
DigitizerPlugIn Methods
The DigitizerPlugIn type exposes the following members.
Methods
Name | Description
EnableDigitizer
 Called by Rhino to enable/disable input from the digitizer. If enable is true and EnableDigitizer() returns false, then Rhino will not calibrate the digitizer.
SendPoint
 If the digitizer is enabled, call this function to send a point to Rhino. Call this function as much as you like. The digitizers that Rhino currently supports send a point every 15 milliseconds or so. This function should be called when users press or release any digitizer button.
SendRay
 If the digitizer is enabled, call this function to send a point and direction to Rhino. Call this function as much as you like. The digitizers that Rhino currently supports send a point every 15 milliseconds or so. This function should be called when users press or release any digitizer button.
Top
See Also
Reference
DigitizerPlugIn Class
Rhino.PlugIns Namespace