RhinoCommon API
DetailViewObject Methods
The DetailViewObject type exposes the following members.
Methods
Name | Description
CommitViewportChanges
GetFormattedScale
 Returns the detail view object's scale as a formatted string. The detail view object's viewport must be to parallel projection.
TryGetModelLength
 Converts a paper length into a model length.
TryGetPaperLength
 Converts a paper length into a model length.
Top
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace