RhinoCommon API
ModelAidSettings Methods
The ModelAidSettings type exposes the following members.
Methods
Name | Description
GetCurrentState
 Gets the current settings.
GetDefaultState
 Gets the factory settings.
UpdateFromState
 Updates from a particular setting state.
Top
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace