RhinoCommon API
AnnotationBase Methods
The AnnotationBase type exposes the following members.
Methods
Name | Description
ClearPropertyOverrides
 Clears all overridden properties for this annotation
FirstCharProperties
 Extracts the font properties (bold, italic, underline, and facename) from the first character run of an RTF string.
FormatRtfString
 Modifies the formatting of an RTF (Rich Text Format) string by setting or clearing bold, italic, underline, and font face properties on the first character run.
GetBoundingBox(Transform)
 Aligned bounding box solver. Gets the world axis aligned bounding box for the transformed geometry.
 (Overrides GeometryBase.GetBoundingBox(Transform).)
GetDimensionScale
 Get view dependent dimension scale
GetDimensionStyle
 Return the proper dimension style from which to get properties for this annotation object If this object has style overrides, those will be included in the returned dimension style and the style will be updated to include the current state of the parent style for non-overridden fields
GetPlainTextWithRunMap
 Return plain text string for this annotation with field expressions unevaluated.
IsAllBold
 Returns true if all of the text in the annotation is Bold, otherwise returns false
IsAllItalic
 Returns true if all of the text in the annotation is Italic, otherwise returns false
IsAllUnderlined
 Returns true if all of the text in the annotation is Underlined, otherwise returns false
IsPropertyOverridden
 Returns true if a property is overridden
PlainTextToRtf
RunReplace
 Replace text within a formatted string
SetBold
SetFacename
SetItalic
SetOverrideDimStyle
 Set a style including overrides for this annotation object. The DimensionStyle OverrideStyle must have the override fields marked as overridden and must have it's Id set to nil. Use DimensionStyle.SetFieldOverride(Field field) and related functions to manage override settings. To override a field, the field value must be set and the field must be marked as an override. The DimensionStyle passed in here must not be in the dimstyle table
SetRichText
 Sets the annotation's text as rich text (RTF), optionally using a specified dimension style for formatting overrides.
SetUnderline
WrapText
 Wrap text
Top
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace