RhinoCommon API
File3dmPlugInDataTable Methods
The File3dmPlugInDataTable type exposes the following members.
Methods
Name | Description
Clear
 Remove all entries from this table.
Dump
Prepares a text dump of table.
GetEnumerator
 Gets the enumerator that visits any File3dmPlugInData in this table.
TryRead
 Attempts to read a Rhino plug-in's custom data from the File3dm file.
Top
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace