RhinoCommon API
RhinoDoc Methods
The RhinoDoc type exposes the following members.
Methods
Name | Description
AddCustomUndoEvent(String, EventHandler<CustomUndoEventArgs>)
AddCustomUndoEvent(String, EventHandler<CustomUndoEventArgs>, Object)
 Add a custom undo event so you can undo private plug-in data when the user performs an undo or redo
AdjustLengthUnits
AdjustModelUnitSystem
AdjustPageUnitSystem
Audit
 Audits the contents of the document.
BeginUndoRecord
 Instructs Rhino to begin recording undo information when the document is changed outside of a command. We use this, e.g., to save changes caused by the modeless layer or object properties dialogs when commands are not running.
ClearRedoRecords
ClearUndoRecords(Boolean)
ClearUndoRecords(UInt32, Boolean)
Create
 Creates a new RhinoDoc
CreateDefaultAttributes
 Gets the default object attributes for this document. The attributes will be linked to the currently active layer and they will inherit the Document WireDensity setting.
CreateHeadless
 Create a new headless RhinoDoc from a template file
CustomRenderMeshesBoundingBox
 Returns the bounding box of custom render primitives for this object .
Dispose
EndUndoRecord
 Ends the undo record.
Equals |  (Overrides Object.Equals(Object).)
Export(String)
 Export the entire document to a file. All file formats that Rhino can export to are supported by this function.
Export(String, ArchivableDictionary)
 Export the entire document to a file. All file formats that Rhino can export to are supported by this function.
ExportSelected(String)
 Export selected geometry to a file. All file formats that Rhino can export to are supported by this function.
ExportSelected(String, ArchivableDictionary)
 Export selected geometry to a file. All file formats that Rhino can export to are supported by this function.
ExtractPreviewImage
 Extracts the bitmap preview image from the specified .3dm file.
Finalize |  (Overrides Object.Finalize().)
FindFile
 Search for a file using Rhino's search path. Rhino will look in the following places: 1. Current model folder 2. Path specified in options dialog/File tab 3. Rhino system folders 4. Rhino executable folder
FormatNumber(Double)
 Call this method to get string representing the specified value using the documents display coordinate system and display precision.
FormatNumber(Double, Boolean, Boolean)
 Call this method to get string representing the specified value using the documents display coordinate system and display precision.
FromFilePath
 Search the open document list for a document with a Path equal to the specified file path.
FromRuntimeSerialNumber
GetAnalysisMeshingParameters
 Get analysis meshing parameters currently used by the document
GetCurrentMeshingParameters
 Get the custom meshing parameters that this document will use.
GetCustomUnitSystem
 Get the custom unit system name and custom unit scale.
GetEmbeddedFilesList
GetGridDefaults
GetGumballPlane
 Returns the active plane of Rhino's auto-gumball widget. Note, when calling from a Rhino command, make sure the command class has the Rhino.Commands.Style.Transparent command style attribute.
GetHashCode |  (Overrides Object.GetHashCode().)
GetMeshingParameters
 Get MeshingParameters currently used by the document
GetModelUrl
 Gets the link address, or URL, for the model.
GetRedoRecords
 Gets this document's redo history, ordered from the action that the next call to Redo() repeats to the oldest action that can be redone.
GetUndoRecords
 Gets this document's undo history, ordered from the most recently recorded action to the oldest recorded action.
GetUnitSystemName
HasCustomRenderMeshes
 Returns true if the document has a set of custom render primitives - ie, CustomRenderMeshes will return non-null.
Import(String)
 Import geometry into a RhinoDoc from a file. This can be any file format that Rhino can import
Import(String, ArchivableDictionary)
 Import geometry into a RhinoDoc from a file. This can be any file format that Rhino can import
InCommand
 This is a low level tool to determine if Rhino is currently running a command.
IsMetricUnitSystem
 Determines if a document unit system is a metric unit system.
Open
 Opens a 3dm file and makes it the active document. If called on windows the active document will be saved and closed and the new document will be opened and become the active document. If called on the Mac the file will be opened in a new document window.
OpenDocuments()
 Returns a list of currently open Rhino documents
OpenDocuments(Boolean)
 Returns a list of currently open Rhino documents
OpenHeadless(String)
 Opens a 3DM file into a new headless RhinoDoc.
OpenHeadless(String, ArchivableDictionary)
 Opens a file into a new headless RhinoDoc.
OpenInteractive
 Opens a 3dm file and makes it the active document. If called on windows the active document will be saved and closed and the new document will be opened and become the active document. If called on the Mac the file will be opened in a new document window. This function is interactive in that it will ask you if you want to open a document as read only if it is already open in a different process
Purge(PurgeFilter)
 Purges unused table objects from this document, the same way the Purge command does.
Purge(PurgeFilter, Boolean)
 Purges unused table objects from this document, the same way the Purge command does.
PurgeObjectHistory()
 Purges the history records of every object in this document.
PurgeObjectHistory(IEnumerable<RhinoObject>)
 Purges the history records of a list of objects.
PurgeObjectHistory(Int32)
 Purges the history records of every object in this document.
ReadFile
ReadFileVersion
 Returns the major version of Rhino that wrote the .3dm file this document was read from. Values from referenced or merged files are not reported.
Redo
 Redo the last action that was "undone"
RenderMeshes
 Returns a set of non-object custom render primitives for this document.
Save
 Save doc to disk using the document's Path
SaveAs(String)
 Save doc as a 3dm to a specified path using the current Rhino file version
SaveAs(String, Int32)
 Save doc as a 3dm to a specified path
SaveAs(String, Int32, Boolean, Boolean, Boolean, Boolean)
 Save doc as a 3dm to a specified path
SaveAs(String, Int32, Boolean, Boolean, Boolean, Boolean, Boolean)
 Save doc as a 3dm to a specified path
SaveAsTemplate(String)
 Save this document as a template
SaveAsTemplate(String, Int32)
 Save this document as a template to a specific Rhino file version
SelectRenderContentInEditor
 Selects a collection of contents in any editors they appear in.
SetCustomMeshingParameters
 Set the custom meshing parameters that this document will use. You must also modify the MeshingParameterStyle property on the document to Custom if you want these meshing parameters to be used
SetCustomUnitSystem
 Changes the unit system to custom units and sets the custom unit scale.
SetGridDefaults
SetModelUrl
 Sets the link address, or URL, for the model.
TimeoutActiveGet
 Exit the active get operation with a timeout
Undo
 Undo the last action
Write3dmFile
 Write information in this document to a .3dm file. Note, the active document's name will not be changed.
WriteFile
 Write information in this document to a file. Note, the active document's name will be changed to that of the path provided.
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace