RhinoCommon API
CurveIntersections Methods
The CurveIntersections type exposes the following members.
Methods
Name | Description
CopyTo
 Copies all intersection results into another array, departing at an index in the target array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Destructor.
 (Overrides Object.Finalize().)
GetEnumerator
 Returns an enumerator that is capable of yielding all IntersectionEvents in the collection.
Top
See Also
Reference
CurveIntersections Class
Rhino.Geometry.Intersect Namespace