RhinoCommon API
ClassArrayString Methods
The ClassArrayString type exposes the following members.
Methods
Name | Description
Add
 Adds a string to the list.
ConstPointer
Gets the constant (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
Gets the non-constant pointer (for modification) of this array.
ToArray
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
ClassArrayString Class
Rhino.Runtime.InteropWrappers Namespace