RhinoCommon API
Texture Methods
The Texture type exposes the following members.
Methods
Name | Description
GetAlphaBlendValues
 If the TextureCombineMode is Blend, then the blending function for alpha is determined by
 new alpha = constant + a0*(current alpha) + a1*(texture alpha) + a2*min(current alpha,texture alpha) + a3*max(current alpha,texture alpha)
SetAlphaBlendValues
 If the TextureCombineMode is Blend, then the blending function for alpha is determined by
 new alpha = constant + a0*(current alpha) + a1*(texture alpha) + a2*min(current alpha,texture alpha) + a3*max(current alpha,texture alpha)
SetRGBBlendValues
 If the TextureCombineMode is Blend, then the blending function for RGB is determined by
 new rgb = colorcolor + a0[0]*(current RGB) + a1[1]*(texture RGB) + a2[2]*min(current RGB,texture RGB) + a3[3]*max(current RGB,texture RGB)
Top
See Also
Reference
Texture Class
Rhino.DocObjects Namespace