RhinoCommon API
ReplayHistoryResult Methods
The ReplayHistoryResult type exposes the following members.
Methods
Name | Description
UpdateToAngularDimension
UpdateToArc
UpdateToBrep
UpdateToCircle
UpdateToClippingPlane(Plane, Double, Double, IEnumerable<Guid>, ObjectAttributes)
UpdateToClippingPlane(Plane, Double, Double, Guid, ObjectAttributes)
UpdateToCurve
UpdateToEllipse
UpdateToExtrusion
UpdateToHatch
UpdateToInstanceReferenceGeometry
UpdateToLeader
UpdateToLine
UpdateToLinearDimension
UpdateToMesh
UpdateToPoint
UpdateToPointCloud(IEnumerable<Point3d>, ObjectAttributes)
UpdateToPointCloud(PointCloud, ObjectAttributes)
UpdateToPolyline
UpdateToRadialDimension
UpdateToSphere
UpdateToSubD
UpdateToSurface
UpdateToText(TextEntity, ObjectAttributes)
UpdateToText(String, Plane, Double, String, Boolean, Boolean, TextJustification, ObjectAttributes)
UpdateToTextDot
Top
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace