RhinoCommon API
Curve Methods
The Curve type exposes the following members.
Methods
Name | Description
ChangeClosedCurveSeam
 If this curve is closed, then modify it so that the start/end point is at curve parameter t.
ChangeDimension
 Changes the dimension of a curve.
ClosedCurveOrientation()
 Determines the orientation (counterclockwise or clockwise) of a closed, planar curve in the world XY plane. Only works with simple (no self intersections) closed, planar curves.
ClosedCurveOrientation(Plane)
 Determines the orientation (counterclockwise or clockwise) of a closed, planar curve in a given plane. Only works with simple (no self intersections) closed, planar curves.
ClosedCurveOrientation(Transform)
 Determines the orientation (counterclockwise or clockwise) of a closed, planar curve. Only works with simple (no self intersections) closed, planar curves.
ClosedCurveOrientation(Vector3d)
 Determines the orientation (counterclockwise or clockwise) of a closed, planar curve in a given plane. Only works with simple (no self intersections) closed, planar curves.
ClosestPoint(Point3d, Double)
 Finds parameter of the point on a curve that is closest to testPoint. If the maximumDistance parameter is > 0, then only points whose distance to the given point is <= maximumDistance will be returned. Using a positive value of maximumDistance can substantially speed up the search.
ClosestPoint(Point3d, Double, Double)
 Finds the parameter of the point on a curve that is closest to testPoint. If the maximumDistance parameter is > 0, then only points whose distance to the given point is <= maximumDistance will be returned. Using a positive value of maximumDistance can substantially speed up the search.
ClosestPoints(Curve, Point3d, Point3d)
 Gets closest points between this and another curves.
ClosestPoints(IEnumerable<GeometryBase>, Point3d, Point3d, Int32)
 Finds the object (and the closest point in that object) that is closest to this curve.
Breps, surfaces, curves and point clouds are examples of objects that can be passed to this function.
ClosestPoints(IEnumerable<GeometryBase>, Point3d, Point3d, Int32, Double)
 Finds the object (and the closest point in that object) that is closest to this curve.
Breps, surfaces, curves and point clouds are examples of objects that can be passed to this function.
CombineShortSegments
 Looks for segments that are shorter than tolerance that can be combined. For NURBS of degree greater than 1, spans are combined by removing knots. Similarly for NURBS segments of polycurves. Otherwise, RemoveShortSegments() is called. Does not change the domain, but it will change the relative parameterization.
Contains(Point3d) |  Obsolete.
 Computes the relationship between a point and a closed curve region. This curve must be closed or the return value will be Unset. Both curve and point are projected to the World XY plane.
Contains(Point3d, Plane) |  Obsolete.
 Computes the relationship between a point and a closed curve region. This curve must be closed or the return value will be Unset.
Contains(Point3d, Plane, Double)
 Computes the relationship between a point and a closed curve region. This curve must be closed or the return value will be Unset.
ControlPolygon
 Gets the curve's control polygon.
CreateArcBlend
 Creates a polycurve consisting of two tangent arc segments that connect two points and two directions.
CreateArcCornerRectangle
 Creates an arc-cornered (rounded) rectangular curve.
CreateArcLineArcBlend
 Creates an arc-line-arc blend curve between two curves. The output is generally a PolyCurve with three segments: arc, line, arc. In some cases, one or more of those segments will be absent because they would have 0 length. If there is only a single segment, the result will either be an ArcCurve or a LineCurve.
CreateBlendCurve(Curve, Curve, BlendContinuity)
 Create a Blend curve between two existing curves.
CreateBlendCurve(Curve, Curve, BlendContinuity, Double, Double)
 Create a Blend curve between two existing curves.
CreateBlendCurve(Curve, Double, Boolean, BlendContinuity, Curve, Double, Boolean, BlendContinuity)
 Makes a curve blend between two curves at the parameters specified with the directions and continuities specified.
CreateBooleanDifference(Curve, Curve) |  Obsolete.
 Calculates the boolean difference between two closed, planar curves. Note, curves must be co-planar.
CreateBooleanDifference(Curve, IEnumerable<Curve>) |  Obsolete.
 Calculates the boolean difference between a closed planar curve, and a list of closed planar curves. Note, curves must be co-planar.
CreateBooleanDifference(Curve, Curve, Double)
 Calculates the boolean difference between two closed, planar curves. Note, curves must be co-planar.
CreateBooleanDifference(Curve, IEnumerable<Curve>, Double)
 Calculates the boolean difference between a closed planar curve, and a list of closed planar curves. Note, curves must be co-planar.
CreateBooleanIntersection(Curve, Curve) |  Obsolete.
 Calculates the boolean intersection of two closed, planar curves. Note, curves must be co-planar.
CreateBooleanIntersection(Curve, Curve, Double)
 Calculates the boolean intersection of two closed, planar curves. Note, curves must be co-planar.
CreateBooleanRegions(IEnumerable<Curve>, Plane, Boolean, Double)
 Calculates curve Boolean regions, which trims and splits curves based on their overlapping regions.
CreateBooleanRegions(IEnumerable<Curve>, Plane, IEnumerable<Point3d>, Boolean, Double)
 Curve Boolean method, which trims and splits curves based on their overlapping regions.
CreateBooleanUnion(IEnumerable<Curve>) |  Obsolete.
 Calculates the boolean union of two or more closed, planar curves. Note, curves must be co-planar.
CreateBooleanUnion(IEnumerable<Curve>, Double)
 Calculates the boolean union of two or more closed, planar curves. Note, curves must be co-planar.
CreateBooleanUnion(IEnumerable<Curve>, Double, Int32[])
 Calculates the boolean union of two or more closed, planar curves, and reports which input curve ended up in which output curve. Note, curves must be co-planar.
CreateCatenaryCurveFromApex
 Generate a catenary curve through catenary apex.
CreateCatenaryCurveFromLength
 Generate a catenary curve of specific length.
CreateCatenaryCurveFromParameter
 Generate a catenary curve from catenary parameter.
CreateCatenaryCurveThroughPoint
 Generate a catenary curve through a point
CreateConicCornerRectangle
 Creates a conic-corned (rounded) rectangular curve.
CreateControlPointCurve(IEnumerable<Point3d>)
 Constructs a control-point of degree=3 (or less).
CreateControlPointCurve(IEnumerable<Point3d>, Int32)
 Constructs a curve from a set of control-point locations.
CreateCurve2View
 Creates a third curve from two curves that are planar in different construction planes. The new curve looks the same as each of the original curves when viewed in each plane.
CreateFillet
 Computes the fillet arc for a curve filleting operation.
CreateFilletCornersCurve
 Rounds the corners of a kinked curve with arcs of a single, specified radius.
CreateFilletCurves
 Creates a tangent arc between two curves and trims or extends the curves to the arc.
CreateInterpolatedCurve(IEnumerable<Point3d>, Int32)
 Interpolates a sequence of points. Used by InterpCurve Command This routine works best when degree=3.
CreateInterpolatedCurve(IEnumerable<Point3d>, Int32, CurveKnotStyle)
 Interpolates a sequence of points. Used by InterpCurve Command This routine works best when degree=3.
CreateInterpolatedCurve(IEnumerable<Point3d>, Int32, CurveKnotStyle, Vector3d, Vector3d)
 Interpolates a sequence of points. Used by InterpCurve Command This routine works best when degree=3.
CreateMatchCurve
 Changes a curve end to meet a specified curve with a specified continuity.
CreateMeanCurve(Curve, Curve)
 Constructs a mean, or average, curve from two curves.
CreateMeanCurve(Curve, Curve, Double)
 Constructs a mean, or average, curve from two curves.
CreateNurbsCurveFit
 Rebuilds the curve to a NURBS curve with the specified options.
CreatePeriodicCurve(Curve)
 Removes kinks from a curve. Periodic curves deform smoothly without kinks.
CreatePeriodicCurve(Curve, Boolean)
 Removes kinks from a curve. Periodic curves deform smoothly without kinks.
CreateRevisionCloud(IEnumerable<Point3d>, Double, Boolean)
 Creates a revision cloud curve from points that make up a planar polyline.
CreateRevisionCloud(Curve, Int32, Double, Boolean)
 Creates a revision cloud curve from a planar curve.
CreateSoftEditCurve
 Creates a soft edited curve from an existing curve using a smooth field of influence.
CreateTextOutlines
 Creates outline curves created from a text string. The functionality is similar to what you find in Rhino's TextObject command or TextEntity.Explode() in RhinoCommon.
CreateTweenCurves(Curve, Curve, Int32) |  Obsolete.
 Creates curves between two open or closed input curves. Uses the control points of the curves for finding tween curves. That means the first control point of first curve is matched to first control point of the second curve and so on. There is no matching of curves direction. Caller must match input curves direction before calling the function.
CreateTweenCurves(Curve, Curve, Int32, Double)
 Creates curves between two open or closed input curves. Uses the control points of the curves for finding tween curves. That means the first control point of first curve is matched to first control point of the second curve and so on. There is no matching of curves direction. Caller must match input curves direction before calling the function.
CreateTweenCurvesWithMatching(Curve, Curve, Int32) |  Obsolete.
 Creates curves between two open or closed input curves. Make the structure of input curves compatible if needed. Refits the input curves to have the same structure. The resulting curves are usually more complex than input unless input curves are compatible and no refit is needed. There is no matching of curves direction. Caller must match input curves direction before calling the function.
CreateTweenCurvesWithMatching(Curve, Curve, Int32, Double)
 Creates curves between two open or closed input curves. Make the structure of input curves compatible if needed. Refits the input curves to have the same structure. The resulting curves are usually more complex than input unless input curves are compatible and no refit is needed. There is no matching of curves direction. Caller must match input curves direction before calling the function.
CreateTweenCurvesWithSampling(Curve, Curve, Int32, Int32) |  Obsolete.
 Creates curves between two open or closed input curves. Use sample points method to make curves compatible. This is how the algorithm works: Divides the two curves into an equal number of points, finds the midpoint between the corresponding points on the curves and interpolates the tween curve through those points. There is no matching of curves direction. Caller must match input curves direction before calling the function.
CreateTweenCurvesWithSampling(Curve, Curve, Int32, Int32, Double)
 Creates curves between two open or closed input curves. Use sample points method to make curves compatible. This is how the algorithm works: Divides the two curves into an equal number of points, finds the midpoint between the corresponding points on the curves and interpolates the tween curve through those points. There is no matching of curves direction. Caller must match input curves direction before calling the function.
CurvatureAt
Evaluate the curvature vector at a curve parameter.
DerivativeAt(Double, Int32)
 Evaluate the derivatives at the specified curve parameter.
DerivativeAt(Double, Int32, CurveEvaluationSide)
 Evaluate the derivatives at the specified curve parameter.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
 (Overrides GeometryBase.Dispose(Boolean).)
DivideAsContour
 Divides this curve at fixed steps along a defined contour line.
DivideByCount(Int32, Boolean)
 Divide the curve into a number of equal-length segments.
DivideByCount(Int32, Boolean, Point3d[])
 Divide the curve into a number of equal-length segments.
DivideByLength(Double, Boolean)
 Divide the curve into specific length segments.
DivideByLength(Double, Boolean, Point3d[])
 Divide the curve into specific length segments.
DivideByLength(Double, Boolean, Boolean)
 Divide the curve into specific length segments.
DivideByLength(Double, Boolean, Boolean, Point3d[])
 Divide the curve into specific length segments.
DivideEquidistant(Double)
 Calculates 3d points on a curve where the linear distance between the points is equal.
DivideEquidistant(Double, Double[])
 Calculates 3d points on a curve where the linear distance between the points is equal.
DoDirectionsMatch
 Determines whether two curves travel more or less in the same direction.
Duplicate
 Constructs an exact duplicate of this Curve.
 (Overrides GeometryBase.Duplicate().)
DuplicateCurve
 Constructs an exact duplicate of this curve.
DuplicateSegments
 Duplicates curve segments. Explodes polylines, polycurves and G1 discontinuous NURBS curves. Single segment curves, such as lines, arcs, unkinked NURBS curves, are duplicated.
Extend(Interval)
 Where possible, analytically extends curve to include the given domain. This will not work on closed curves. The original curve will be identical to the restriction of the resulting curve to the original curve domain.
Extend(Double, Double)
 Where possible, analytically extends curve to include the given domain. This will not work on closed curves. The original curve will be identical to the restriction of the resulting curve to the original curve domain.
Extend(CurveEnd, CurveExtensionStyle, Point3d)
 Extends a curve to a point.
Extend(CurveEnd, CurveExtensionStyle, IEnumerable<GeometryBase>)
 Extends a curve until it intersects a collection of objects.
Extend(CurveEnd, Double, CurveExtensionStyle)
 Extends a curve by a specific length.
ExtendByArc
 Extends a curve by an Arc until it intersects a collection of objects.
ExtendByLine
 Extends a curve by a line until it intersects a collection of objects.
ExtendOnSurface(CurveEnd, BrepFace)
 Extends a curve on a surface.
ExtendOnSurface(CurveEnd, Surface)
 Extends a curve on a surface.
ExtremeParameters
 Returns the parameter values of all local extrema. Parameter values are in increasing order so consecutive extrema define an interval on which each component of the curve is monotone. Note, non-periodic curves always return the end points.
Fair
 Fairs a curve object. Fair works best on degree 3 (cubic) curves. Attempts to remove large curvature variations while limiting the geometry changes to be no more than the specified tolerance.
FilletSurfaceToCurve
 Creates a constant-radius fillet surface between a surface and the curve.
FilletSurfaceToRail
 Creates a surface between two surfaces, with a fixed rail curve on the first surface.
FindLocalInflection
 Local minimization for point on a curve with tangent perpendicular to N.
Fit
 Fits a new curve through an existing curve.
FrameAt
Returns a 3d frame at a parameter.
GetConicSectionType()
 Returns the type of conic section based on the curve's shape.
GetConicSectionType(Point3d, Point3d, Point3d)
 Returns the type of conic section based on the curve's shape.
GetCurveParameterFromNurbsFormParameter
 Convert a NURBS curve parameter to a curve parameter.
GetDistancesBetweenCurves
 Calculates the minimum and maximum distances between two curves. This function is useful for computing curve deviation. If you are not computing curve deviation, use .
GetFilletPoints
 Finds points at which to cut a pair of curves so that a fillet of given radius can be inserted.
GetLength()
 Gets the length of the curve with a fractional tolerance of 1.0e-8.
GetLength(Double)
Get the length of the curve.
GetLength(Interval)
Get the length of a sub-section of the curve with a fractional tolerance of 1e-8.
GetLength(Double, Interval)
Get the length of a sub-section of the curve.
GetLocalPerpPoint(Point3d, Double, Double)
 Search for a location on the curve, near seedParmameter, that is perpendicular to a test point.
GetLocalPerpPoint(Point3d, Double, Interval, Double)
 Search for a location on the curve, near seedParmameter, that is perpendicular to a test point.
GetLocalTangentPoint(Point3d, Double, Double)
 Search for a location on the curve, near seedParmameter, that is tangent to a test point.
GetLocalTangentPoint(Point3d, Double, Interval, Double)
 Search for a location on the curve, near seedParmameter, that is tangent to a test point.
GetNextDiscontinuity(Continuity, Double, Double, Double)
 Searches for a derivative, tangent, or curvature discontinuity.
GetNextDiscontinuity(Continuity, Double, Double, Double, Double, Double)
 Searches for a derivative, tangent, or curvature discontinuity.
GetNurbsFormParameterFromCurveParameter
Convert a curve parameter to a NURBS curve parameter.
GetPerpendicularFrames
 Gets a collection of perpendicular frames along the curve. Perpendicular frames are also known as 'Zero-twisting frames' and they minimize rotation from one frame to the next.
GetSubCurves
 Gets subcurves from a curve. The results will be similar to what is produced by Rhino's Explode command.
HasNurbsForm
 Does a NURBS curve representation of this curve exist?
InflectionPoints()
 Returns a curve's inflection points. An inflection point is a location on a curve at which the sign of the curvature (i.e., the concavity) changes. The curvature at these locations is always 0.
InflectionPoints(Double[])
 Returns a curve's inflection points. An inflection point is a location on a curve at which the sign of the curvature (i.e., the concavity) changes. The curvature at these locations is always 0.
IsArc()
 Test a curve to see if it can be represented by an arc or circle within RhinoMath.ZeroTolerance.
IsArc(Double)
 Test a curve to see if it can be represented by an arc or circle within the given tolerance.
IsCircle()
 Test a curve to see if it can be represented by a circle within RhinoMath.ZeroTolerance.
IsCircle(Double)
 Test a curve to see if it can be represented by a circle within the given tolerance.
IsClosable(Double)
 Decide if it makes sense to close off this curve by moving the endpoint to the start based on start-end gap size and length of curve as approximated by chord defined by 6 points.
IsClosable(Double, Double, Double)
 Decide if it makes sense to close off this curve by moving the endpoint to the start based on start-end gap size and length of curve as approximated by chord defined by 6 points.
IsContinuous
 Test continuity at a curve parameter value.
IsEllipse()
 Test a curve to see if it can be represented by an ellipse within RhinoMath.ZeroTolerance.
IsEllipse(Double)
 Test a curve to see if it can be represented by an ellipse within a given tolerance.
IsInPlane(Plane)
Test a curve to see if it lies in a specific plane.
IsInPlane(Plane, Double)
Test a curve to see if it lies in a specific plane.
IsLinear()
 Test a curve to see if it is linear to within RhinoMath.ZeroTolerance units (1e-12).
IsLinear(Double)
 Test a curve to see if it is linear to within the custom tolerance.
IsPlanar()
Test a curve for planarity.
IsPlanar(Double)
Test a curve for planarity.
IsPolyline
 Several types of Curve can have the form of a polyline including a degree 1 NurbsCurve, a PolylineCurve, and a PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline.
IsShort(Double)
Used to quickly find short curves.
IsShort(Double, Interval)
Used to quickly find short curves.
JoinCurves(IEnumerable<Curve>)
 Joins a collection of curve segments together.
JoinCurves(IEnumerable<Curve>, Double)
 Joins a collection of curve segments together.
JoinCurves(IEnumerable<Curve>, Double, Boolean)
 Joins a collection of curve segments together.
JoinCurves(IEnumerable<Curve>, Double, Boolean, Int32[])
 Joins a collection of curve segments together.
JoinCurves(IEnumerable<Curve>, Double, Boolean, Boolean, Int32[])
 Joins a collection of curve segments together.
LengthParameter(Double, Double)
 Gets the parameter along the curve which coincides with a given length along the curve. A fractional tolerance of 1e-8 is used in this version of the function.
LengthParameter(Double, Double, Interval)
 Gets the parameter along the curve which coincides with a given length along the curve. A fractional tolerance of 1e-8 is used in this version of the function.
LengthParameter(Double, Double, Double)
 Gets the parameter along the curve which coincides with a given length along the curve.
LengthParameter(Double, Double, Double, Interval)
 Gets the parameter along the curve which coincides with a given length along the curve.
LocalClosestPoint
 Find parameter of the point on a curve that is locally closest to the testPoint. The search for a local close point starts at a seed parameter.
MakeClosed
 If IsClosed, just return true. Otherwise, decide if curve can be closed as follows: Linear curves polylinear curves with 2 segments, NURBS with 3 or less control points cannot be made closed. Also, if tolerance > 0 and the gap between start and end is larger than tolerance, curve cannot be made closed. Adjust the curve's endpoint to match its start point.
MakeEndsMeet
 Makes adjustments to the ends of one or both input curves so that they meet at a point.
MaxCurvaturePoints()
 Returns a curve's maximum curvature points. The maximum curvature points identify where the curvature starts to decrease in both directions from the points.
MaxCurvaturePoints(Double[])
 Returns a curve's maximum curvature points. The maximum curvature points identify where the curvature starts to decrease in both directions from the points.
NonConstOperation
 For derived classes implementers.
Defines the necessary implementation to free the instance from being constant.
 (Overrides GeometryBase.NonConstOperation().)
NormalizedLengthParameter(Double, Double)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve. A fractional tolerance of 1e-8 is used in this version of the function.
NormalizedLengthParameter(Double, Double, Interval)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve. A fractional tolerance of 1e-8 is used in this version of the function.
NormalizedLengthParameter(Double, Double, Double)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
NormalizedLengthParameter(Double, Double, Double, Interval)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
NormalizedLengthParameters(Double[], Double)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve. A fractional tolerance of 1e-8 is used in this version of the function.
NormalizedLengthParameters(Double[], Double, Interval)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve. A fractional tolerance of 1e-8 is used in this version of the function.
NormalizedLengthParameters(Double[], Double, Double)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
NormalizedLengthParameters(Double[], Double, Double, Interval)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
Offset(Plane, Double, Double, CurveOffsetCornerStyle)
 Offsets this curve. If you have a nice offset, then there will be one entry in the array. If the original curve had kinks or the offset curve had self intersections, you will get multiple segments in the output array.
Offset(Point3d, Vector3d, Double, Double, CurveOffsetCornerStyle)
 Offsets this curve. If you have a nice offset, then there will be one entry in the array. If the original curve had kinks or the offset curve had self intersections, you will get multiple segments in the output array.
Offset(Point3d, Vector3d, Double, Double, Double, Boolean, CurveOffsetCornerStyle, CurveOffsetEndStyle)
 Offsets this curve. If you have a nice offset, then there will be one entry in the array. If the original curve had kinks or the offset curve had self intersections, you will get multiple segments in the output array.
OffsetNormalToSurface
 Finds a curve by offsetting an existing curve normal to a surface. The caller is responsible for ensuring that the curve lies on the input surface.
OffsetOnSurface(BrepFace, Point2d, Double)
 Offset a curve on a brep face surface. This curve must lie on the surface.
This overload allows to specify a surface point at which the offset will pass.
OffsetOnSurface(BrepFace, Double, Double)
 Offset this curve on a brep face surface. This curve must lie on the surface.
OffsetOnSurface(Surface, Point2d, Double)
 Offset a curve on a surface. This curve must lie on the surface.
This overload allows to specify a surface point at which the offset will pass.
OffsetOnSurface(Surface, Double, Double)
 Offset a curve on a surface. This curve must lie on the surface.
OffsetOnSurface(BrepFace, Double[], Double[], Double)
 Offset a curve on a brep face surface. This curve must lie on the surface.
This overload allows to specify different offsets for different curve parameters.
OffsetOnSurface(Surface, Double[], Double[], Double)
 Offset this curve on a surface. This curve must lie on the surface.
This overload allows to specify different offsets for different curve parameters.
OffsetTangentToSurface
 Finds a curve by offsetting an existing curve tangent to a surface. The caller is responsible for ensuring that the curve lies on the input surface.
PerpendicularFrameAt
 Return a 3d frame at a parameter. This is slightly different than FrameAt in that the frame is computed in a way so there is minimal rotation from one frame to the next.
PlanarClosedCurveRelationship
 Determines whether two coplanar simple closed curves are disjoint or intersect; otherwise, if the regions have a containment relationship, discovers which curve encloses the other.
PlanarCurveCollision
 Determines if two coplanar curves collide (intersect).
PointAt
Evaluates point at a curve parameter.
PointAtLength
 Gets a point at a certain length along the curve. The length must be non-negative and less than or equal to the length of the curve. Lengths will not be wrapped when the curve is closed or periodic.
PointAtNormalizedLength
 Gets a point at a certain normalized length along the curve. The length must be between or including 0.0 and 1.0, where 0.0 equals the start of the curve and 1.0 equals the end of the curve.
ProjectToBrep(Curve, Brep, Vector3d, Double)
 Projects a Curve onto a Brep along a given direction.
ProjectToBrep(Curve, IEnumerable<Brep>, Vector3d, Double)
 Projects a Curve onto a collection of Breps along a given direction.
ProjectToBrep(IEnumerable<Curve>, IEnumerable<Brep>, Vector3d, Double)
 Projects a collection of Curves onto a collection of Breps along a given direction.
ProjectToBrep(Curve, IEnumerable<Brep>, Vector3d, Double, Int32[])
 Projects a Curve onto a collection of Breps along a given direction.
ProjectToBrep(IEnumerable<Curve>, IEnumerable<Brep>, Vector3d, Double, Int32[], Int32[])
 Projects a collection of Curves onto a collection of Breps along a given direction.
ProjectToBrep(IEnumerable<Curve>, IEnumerable<Brep>, Vector3d, Double, Boolean, Int32[], Int32[])
 Projects a collection of Curves onto a collection of Breps along a given direction.
ProjectToMesh(Curve, Mesh, Vector3d, Double)
 Projects a curve to a mesh using a direction and tolerance.
ProjectToMesh(Curve, IEnumerable<Mesh>, Vector3d, Double)
 Projects a curve to a set of meshes using a direction and tolerance.
ProjectToMesh(IEnumerable<Curve>, IEnumerable<Mesh>, Vector3d, Double)
 Projects a curve to a set of meshes using a direction and tolerance.
ProjectToMesh(IEnumerable<Curve>, IEnumerable<Mesh>, Vector3d, Double, Boolean)
 Projects a curve to a set of meshes using a direction and tolerance.
ProjectToPlane
 Constructs a curve by projecting an existing curve to a plane.
PullToBrepFace(BrepFace, Double)
 Pulls this curve to a brep face and returns the result of that operation.
PullToBrepFace(Curve, BrepFace, Double)
 Pull a curve to a BrepFace using closest point projection.
PullToBrepFace(Curve, BrepFace, Double, Boolean)
 Pull a curve to a BrepFace using closest point projection.
PullToMesh(Mesh, Double)
 Makes a polyline approximation of the curve and gets the closest point on the mesh for each point on the curve. Then it "connects the points" so that you have a polyline on the mesh.
PullToMesh(Mesh, Double, Boolean)
 Projects this curve onto a mesh.
Rebuild
 Rebuild a curve with a specific point count.
RebuildToMatchTemplateCurve
 Rebuilds this curve so it takes on the degree, knot vector, and control point count of a template curve.
RemoveShortSegments
 Looks for segments that are shorter than tolerance that can be removed. Does not change the domain, but it will change the relative parameterization.
Repair
 Repairs a curve.
Reparameterize
 Reparameterizes a curve using automatic parameterization.
Reverse
 Reverses the direction of the curve.
RibbonOffset(RibbonOffsetParameters, Curve[], Curve[], Brep[])
 Ribbon offset method to mimic RibbonOffset command
RibbonOffset(Double, Double, Point3d, Vector3d, Double)
 Offsets a closed curve in the following way: pProject the curve to a plane with given normal. Then, loose Offset the projection by distance + blend_radius and trim off self-intersection. THen, Offset the remaining curve back in the opposite direction by blend_radius, filling gaps with blends. Finally, use the elevations of the input curve to get the correct elevations of the result.
RibbonOffset(Double, Double, Point3d, Vector3d, Double, Curve[], Surface[])
 Offsets a closed curve in the following way: pProject the curve to a plane with given normal. Then, loose Offset the projection by distance + blend_radius and trim off self-intersection. THen, Offset the remaining curve back in the opposite direction by blend_radius, filling gaps with blends. Finally, use the elevations of the input curve to get the correct elevations of the result.
RibbonOffset(Double, Double, Point3d, Vector3d, Double, Double[], Double[])
 Offsets a closed curve in the following way: pProject the curve to a plane with given normal. Then, loose Offset the projection by distance + blend_radius and trim off self-intersection. THen, Offset the remaining curve back in the opposite direction by blend_radius, filling gaps with blends. Finally, use the elevations of the input curve to get the correct elevations of the result.
SetEndPoint
Forces the curve to end at a specified point. Not all curve types support this operation.
SetStartPoint
Forces the curve to start at a specified point. Not all curve types support this operation.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The NURBS Curves segments do not have fully multiple interior knots.
 3. Rational NURBS curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent co-linear or co-circular segments are combined.
 6. Segments that meet with G1-continuity have there ends tuned up so that they meet with G1-continuity to within machine precision.
SimplifyEnd
 Same as SimplifyCurve, but simplifies only the last two segments at "side" end.
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem)
 Smooths a curve by averaging the positions of control points in a specified region.
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths a curve by averaging the positions of control points in a specified region.
SortCurves
 Sorts the curves into joinable segment groups. No joining is performed, the curves are only analyzed for start/end proximity.
SpanDomain
 Get the domain of the curve span with the given index. Use the SpanCount property to test how many spans there are.
SpanVector
 Returns the vector of span division parameters for this curve.
Split(Double)
 Splits (divides) the curve at the specified parameter. The parameter must be in the interior of the curve's domain.
Split(IEnumerable<Double>)
 Splits (divides) the curve at a series of specified parameters. The parameter must be in the interior of the curve domain.
Split(Brep, Double) |  Obsolete.
 Splits a curve into pieces using a polysurface.
Split(Surface, Double) |  Obsolete.
 Splits a curve into pieces using a surface.
Split(Brep, Double, Double)
 Splits a curve into pieces using a polysurface.
Split(Plane, Double, Double)
 Splits a curve into pieces using a cutting plane.
Split(Surface, Double, Double)
 Splits a curve into pieces using a surface.
TangentAt
Evaluates the unit tangent vector at a curve parameter.
ToArcsAndLines
 Converts a curve into polycurve consisting of arc segments. Sections of the input curves that are nearly straight are converted to straight-line segments.
ToNurbsCurve()
 Constructs a NURBS curve representation of this curve.
ToNurbsCurve(Interval)
 Constructs a NURBS curve representation of this curve.
ToPolyline(Double, Double, Double, Double)
 Gets a polyline approximation of a curve.
ToPolyline(Int32, Int32, Double, Double, Double, Double, Double, Double, Boolean)
 Gets a polyline approximation of a curve.
ToPolyline(Int32, Int32, Double, Double, Double, Double, Double, Double, Boolean, Interval)
 Gets a polyline approximation of a curve.
TorsionAt
 Evaluate the torsion of a curve at a parameter. Sometimes also called the "second curvature", torsion is the rate of change of a curve's osculating plane.
Trim(Interval)
 Removes portions of the curve outside the specified interval.
Trim(CurveEnd, Double)
 Shortens a curve by a given length
Trim(Double, Double)
 Removes portions of the curve outside the specified interval.
TrimInterval(Interval)
 Trims the curve in-place by removing portions of the curve outside the specified interval.
TrimInterval(Double, Double)
 Trims the curve in-place by removing portions of the curve outside the specified interval.
TryGetArc(Arc)
 Try to convert this curve into an Arc using RhinoMath.ZeroTolerance.
TryGetArc(Arc, Double)
 Try to convert this curve into an Arc using a custom tolerance.
TryGetArc(Plane, Arc)
 Try to convert this curve into an Arc using RhinoMath.ZeroTolerance.
TryGetArc(Plane, Arc, Double)
 Try to convert this curve into an Arc using a custom tolerance.
TryGetCircle(Circle)
 Try to convert this curve into a circle using RhinoMath.ZeroTolerance.
TryGetCircle(Circle, Double)
 Try to convert this curve into a Circle using a custom tolerance.
TryGetEllipse(Ellipse)
 Try to convert this curve into an Ellipse within RhinoMath.ZeroTolerance.
TryGetEllipse(Ellipse, Double)
 Try to convert this curve into an Ellipse using a custom tolerance.
TryGetEllipse(Plane, Ellipse)
 Try to convert this curve into an Ellipse within RhinoMath.ZeroTolerance.
TryGetEllipse(Plane, Ellipse, Double)
 Try to convert this curve into an Ellipse using a custom tolerance.
TryGetPlane(Plane)
Test a curve for planarity and return the plane.
TryGetPlane(Plane, Double)
Test a curve for planarity and return the plane.
TryGetPolyline(Polyline)
 Several types of Curve can have the form of a polyline including a degree 1 NurbsCurve, a PolylineCurve, and a PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline.
TryGetPolyline(Polyline, Double[])
 Several types of Curve can have the form of a polyline including a degree 1 NurbsCurve, a PolylineCurve, and a PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace