RhinoCommon API
PostEffectState Methods
The PostEffectState type exposes the following members.
Methods
Name | Description
Dispose
Finalize |  (Overrides Object.Finalize().)
SetValue<T>
TryGetValue<T>
Top
See Also
Reference
PostEffectState Class
Rhino.Render.PostEffects Namespace