RhinoCommon API
LocalizedStringHandler Methods
The LocalizedStringHandler type exposes the following members.
Methods
Name | Description
AppendFormatted<T>(T)
AppendFormatted<T>(T, Int32)
AppendFormatted<T>(T, String)
AppendFormatted<T>(T, Int32, String)
AppendLiteral
Top
See Also
Reference
LocalizedStringHandler Structure
Rhino.UI Namespace