RhinoCommon API
SubDEdgeList Methods
The SubDEdgeList type exposes the following members.
Methods
Name | Description
Add
 Add a new edge to the list.
Find(Int32)
 Find an edge in this SubD with a given id
Find(UInt32)
 Find an edge in this SubD with a given id
FindOrAdd
 Gets the edge between two vertices, adding a smooth edge if there is not one yet.
GetEnumerator
 Implementation of IEnumerable
SetEdgeTags(IEnumerable<SubDEdge>, SubDEdgeTag)
 Set edge tags for a list of edges. Useful for adding creases to SubDs
SetEdgeTags(IEnumerable<Int32>, SubDEdgeTag)
 Set edge tags for a list of edges. Useful for adding creases to SubDs
Top
See Also
Reference
SubDEdgeList Class
Rhino.Geometry.Collections Namespace