RhinoCommon API
File3dmSettings Methods
The File3dmSettings type exposes the following members.
Methods
Name | Description
LoadedPlugIns
 Information about the plug-ins loaded when the file was last saved
Top
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace