RhinoCommon API
Channel Methods
The RenderWindow.Channel type exposes the following members.
Methods
Name | Description
AddValue
 Add value to existing values at point x, y. If x or y are out of range, the function will fail and may crash Rhino.
Clone
 Return a clone of the channel.
Dispose()
Dispose(Boolean)
GetMinMaxValues
 Get the minimum and maximum values in the channel. minThe channel's minimum value. maxThe channel's maximum value.
GetValue
 Get values from the channel.
GetValues
 Get a rectangle of values from the channel. The input parameters are checked for validity. If the rectangle is not fully inside the frame buffer, the function will fail.
PixelSize
 Returns the size of the data in one pixel in the channel. For RDK standard channels, this value is always sizeof(float). For the special chanRGBA collective channel, this value is 4 * sizeof(float).
SetValue(Int32, Int32, Color4f)
 If x or y are out of range, the function will fail and may crash Rhino.
SetValue(Int32, Int32, Single)
 Assign value to a pixel at coordinate (x, y).
SetValues
 Set a pixel buffer
SetValuesFlipped
 Set a pixel buffer y-flipped.
Top
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace