RhinoCommon API
PostEffectUI Methods
The PostEffectUI type exposes the following members.
Methods
Name | Description
AddSection
 Add a section to the UI.
Dispose
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
PostEffectUI Class
Rhino.Render.PostEffects Namespace