RhinoCommon API
File3dmLinetypeTable Methods
The File3dmLinetypeTable type exposes the following members.
Methods
Name | Description
FindIndex
 Retrieves a Linetype object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds a Linetype given its name.
FindNameHash
 Finds a Linetype given its name hash.
Top
See Also
Reference
File3dmLinetypeTable Class
Rhino.FileIO Namespace