RhinoCommon API
MeshCurvatureStats Methods
The MeshCurvatureStats type exposes the following members.
Methods
Name | Description
CreateFromMesh
 Gets curvature statistics from analysis mesh.
CreateFromMeshes
 Gets curvature statistics from analysis meshes, and calculate total statistics.
Dispose
 Actively releases the unmanaged pointer.
Finalize
 Passively releases the unmanaged pointer.
 (Overrides Object.Finalize().)
Top
See Also
Reference
MeshCurvatureStats Class
Rhino.Geometry Namespace