RhinoCommon API
IZooClientUtilities Methods
The IZooClientUtilities type exposes the following members.
Methods
Name | Description
AskUserForLicense
CheckInLicense
 Checks in a checked out license to the owning Zoo.
CheckOutLicense
 Checks out a loaned out license from the owning Zoo.
ConvertLicense
 Converts a standalone license to a network license.
DeleteLicense
 31-Mar-2015 Dale Fugier, http://mcneel.myjetbrains.com/youtrack/issue/MR-1725 Deletes a license along with its license file.
Echo
GetCurrentTime
 Gets the current time, trying to access an NTP server before using local time.
GetLicense
GetLicenseStatus
 Returns the current status of every license for ui purposes
GetLicenseType
 Returns the type of a specified product license
GetOneLicenseStatus
 Returns the current status of a license for ui purposes
GetRegisteredOwnerInfo
 Returns the registered owner and organization of a license 4-Sept-2014 Dale Fugier, http://mcneel.myjetbrains.com/youtrack/issue/RH-28623
Initialize
IsCheckOutEnabled
 Returns whether or not license checkout is enabled
LicenseOptionsHandler
LoginToCloudZoo
 Logs the user in to the cloud zoo. This logs out the current user and voids any existing leases.
LogoutOfCloudZoo
 Logs the user out of the cloud zoo. This logs out the current user and voids any existing leases.
ReturnLicense(Object, Guid)
ReturnLicense(Object, String, Guid)
ShowBuyLicenseUi
ShowLicenseValidationUi
 Shows user interface to validate and register a license. Returns true if the license is successfully validated; false otherwise
ShowRhinoExpiredMessage
Top
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace