RhinoCommon API
SectionStyleTable Methods
The SectionStyleTable type exposes the following members.
Methods
Name | Description
Add
 Adds a new section style with specified definition to the table.
AddReferenceSectionStyle
 Adds a reference section style that will not be saved in files.
Delete(SectionStyle)
 Deletes a section style.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(IEnumerable<Int32>, Boolean)
 Delete multiple section styles.
Delete(Int32, Boolean)
 Deletes a section style.
Delete(IEnumerable<Int32>, Boolean, Int32)
 Delete multiple section styles.
Find(String)
Finds the section style with a given name.
Find(Guid, Boolean)
Finds a section style with a matching ID.
FindIndex
 Retrieves a section style based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
Finds the section style with a given name.
GetEnumerator |  (Overrides CommonComponentTable<T>.GetEnumerator().)
GetUnusedSectionStyleName
 Gets unused section style name used as default when creating new section styles.
InUse
 Returns true if a section style is use by an object, layer, or instance definition.
Modify
Modify section style settings.
Top
See Also
Reference
SectionStyleTable Class
Rhino.DocObjects.Tables Namespace