RhinoCommon API
MetaData Methods
The MetaData type exposes the following members.
Methods
Name | Description
ContentInstanceId
Dispose
Finalize |  (Overrides Object.Finalize().)
Geometry
Top
See Also
Reference
MetaData Class
Rhino.Render.DataSources Namespace