RhinoCommon API
BinaryArchiveWriter Methods
The BinaryArchiveWriter type exposes the following members.
Methods
Name | Description
BeginWrite3dmChunk(UInt32, Int64)
 Begins writing a chunk
BeginWrite3dmChunk(UInt32, Int32, Int32)
 Begins writing a chunk
EnableCRCCalculation
 Expert user function to control CRC calculation while reading and writing. Typically this is used when seeking around and reading/writing information in non-serial order.
EndWrite3dmChunk
 updates length in chunk header
Write3dmChunkVersion
 A chunk version is a single byte that encodes a major.minor version number. Useful when creating I/O code for 3dm chunks that may change in the future. Increment the minor version number if new information is added to the end of the chunk. Increment the major version if the format of the chunk changes in some other way.
WriteBool
 Writes a Boolean value to the archive.
WriteBoolArray
 Writes a list, an array, or any enumerable of Boolean to the archive.
The return will always be an array.
WriteBoundingBox
 Writes a BoundingBox value to the archive.
WriteByte
 Writes a Byte value to the archive.
WriteByteArray
 Writes a list, an array, or any enumerable of Byte to the archive.
The return will always be an array.
WriteColor
 Writes a Color value to the archive.
WriteCompressedBuffer
 Writes a list, an array, or any enumerable of Byte to the archive as a compressed buffer.
The return will always be an array.
WriteDictionary
 Delivers the complete content of a dictionary to the archive.
WriteDouble
 Writes a Double value to the archive.
WriteDoubleArray
 Writes a list, an array, or any enumerable of Double to the archive.
The return will always be an array.
WriteFont
 Writes a Font value to the archive.
WriteGeometry
 Writes a GeometryBase value to the archive.
WriteGeometryArray
WriteGuid
 Writes a Guid value to the archive.
WriteGuidArray
 Writes a list, an array, or any enumerable of Guid to the archive.
The return will always be an array.
WriteInt
 Writes a Int32 value to the archive.
WriteInt64
 Writes a Int64 value to the archive.
WriteIntArray
 Writes a list, an array, or any enumerable of Int32 to the archive.
The return will always be an array.
WriteInterval
 Writes a Interval value to the archive.
WriteLine
 Writes a Line value to the archive.
WriteMeshingParameters
 Writes a MeshingParameters value to the archive.
WriteObjRef
 Writes a ObjRef to the archive
WriteObjRefArray
 Writes a list, an array, or any enumerable of ObjRef to the archive.
The return will always be an array.
WritePlane
 Writes a Plane value to the archive.
WritePoint
 Writes a Point value to the archive.
WritePoint2d
 Writes a Point2d value to the archive.
WritePoint3d
 Writes a Point3d value to the archive.
WritePoint3f
 Writes a Point3f value to the archive.
WritePoint4d
 Writes a Point4d value to the archive.
WritePointF
 Writes a PointF value to the archive.
WriteRay3d
 Writes a Ray3d value to the archive.
WriteRectangle
 Writes a Rectangle value to the archive.
WriteRectangleF
 Writes a RectangleF value to the archive.
WriteRenderSettings
 Writes a RenderSettings value to the archive.
WriteSByte
 Writes a SByte value to the archive.
WriteSByteArray
 Writes a list, an array, or any enumerable of SByte to the archive.
The return will always be an array.
WriteShort
 Writes a Int16 value to the archive.
WriteShortArray
 Writes a list, an array, or any enumerable of Int16 to the archive.
The return will always be an array.
WriteSingle
 Writes a Single value to the archive.
WriteSingleArray
 Writes a list, an array, or any enumerable of Single to the archive.
The return will always be an array.
WriteSize
 Writes a Size value to the archive.
WriteSizeF
 Writes a SizeF value to the archive.
WriteString
 Writes a String value to the archive.
WriteStringArray
 Writes a list, an array, or any enumerable of String to the archive.
The return will always be an array.
WriteTransform
 Writes a Transform value to the archive.
WriteUInt
 Writes a UInt32 value to the archive.
WriteUShort
 Writes a UInt16 value to the archive.
WriteUtf8String
 Writes a String value to the archive.
WriteVector2d
 Writes a Vector2d value to the archive.
WriteVector3d
 Writes a Vector3d value to the archive.
WriteVector3f
 Writes a Vector3f value to the archive.
Top
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace