RhinoCommon API
File3mf Methods
The File3mf type exposes the following members.
Methods
Name | Description
Write
Write a 3mf file based on the contents of a RhinoDoc
Top
See Also
Reference
File3mf Class
Rhino.FileIO Namespace