RhinoCommon API
LicenseLeaseChangedEventArgs Methods
The LicenseLeaseChangedEventArgs type exposes the following members.
Methods
Name | Description
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
LicenseLeaseChangedEventArgs Class
Rhino.PlugIns Namespace