RhinoCommon API
PointCloud Methods
The PointCloud type exposes the following members.
Methods
Name | Description
Add(Point3d)
 Append a new point to the end of the list.
Add(Point3d, Vector3d)
 Append a new point to the end of the list.
Add(Point3d, Color)
 Append a new point to the end of the list.
Add(Point3d, Vector3d, Color)
 Append a new point to the end of the list.
Add(Point3d, Vector3d, Color, Double)
 Append a new point to the end of the list.
AddRange(IEnumerable<Point3d>)
 Appends a collection of points to this point cloud.
AddRange(IEnumerable<Point3d>, IEnumerable<Vector3d>)
 Appends a collection of points and normal vectors to this point cloud.
AddRange(IEnumerable<Point3d>, IEnumerable<Color>)
 Appends a collection of points and normal vectors to this point cloud.
AddRange(IEnumerable<Point3d>, IEnumerable<Vector3d>, IEnumerable<Color>)
 Appends a collection of points, normal vectors, and colors to this point cloud.
AddRange(IEnumerable<Point3d>, IEnumerable<Vector3d>, IEnumerable<Color>, IEnumerable<Double>)
 Appends a collection of points, normal vectors, colors, and extra values to this point cloud.
AppendNew
 Appends a new PointCloudItem to the end of this point cloud.
AsReadOnlyListOfPoints
 Returns an enumerator and list indexer over point cloud locations.
ClearColors
 Destroys the color information in this point cloud.
ClearHiddenFlags
 Destroys the hidden flag information in this point cloud.
ClearNormals
 Destroys the normal vector information in this point cloud.
ClearPointValues
 Destroys the extra value information in this point cloud. Extra values can be used to store a user-defined values, such as intensity.
ClosestPoint
 Returns index of the closest point in the point cloud to a given test point.
CreateContourCurves(Point3d, Point3d, Double, Double)
 Creates a planar curves by intersecting a plane with a point cloud.
CreateContourCurves(Point3d, Point3d, Double, Double, Double, Double, Boolean, Boolean, Boolean, Double)
 Creates a planar curves by intersecting a plane with a point cloud.
CreateFromMesh
 Creates a point cloud from a mesh.
CreateSectionCurve(Plane, Double)
 Creates planar curves by intersecting a plane with a point cloud.
CreateSectionCurve(Plane, Double, Double, Double, Boolean, Boolean, Boolean, Double)
 Creates a planar curve by intersecting a plane with a point cloud.
ExpertGetValues
 Expert tool to get all values of a point cloud item. This method minimizes the number of pInvoke function calls.
GetColors
 Copy all the point colors in this point cloud to an array.
GetEnumerator
 Gets an enumerator that allows to modify each point cloud point.
GetNormals
 Copy all the normal vectors in this point cloud to an array.
GetPoints
 Copy all the point coordinates in this point cloud to an array.
GetPointValues
 Copy all the extra point values in this point cloud to an array. Extra values can be used to store a user-defined value, such as intensity.
GetRandomSubsample(UInt32)
 Returns a random subsample of a point cloud.
GetRandomSubsample(UInt32, CancellationToken, IProgress<Double>)
 Returns a random subsample of a point cloud.
GetUnsafeLock
 Allows the developer to obtain unsafe pointers to the underlying unmanaged data structures of the PointCloud.
Insert(Int32, Point3d)
Inserts a new point into the point list.
Insert(Int32, Point3d, Vector3d)
Inserts a new point into the point list.
Insert(Int32, Point3d, Color)
 Inserts a new point into the point list.
Insert(Int32, Point3d, Vector3d, Color)
 Inserts a new point into the point list.
Insert(Int32, Point3d, Vector3d, Color, Double)
 Inserts a new point into the point list.
InsertNew
 Inserts a new PointCloudItem at a specific position of the point cloud.
InsertRange
 Append a collection of points to this point cloud.
Merge
 Merges, or appends, a specified point cloud into this one.
PointAt
 Returns the location of the point at a specific index.
ReleaseUnsafeLock
 Updates the PointCloud data with the information that was stored via the PointCloudUnsafeLock.
RemoveAt
 Remove the point at the given index.
RemoveRange
 Removes points at given indices.
ShrinkWrap
 Returns a ShrinkWrap mesh from this point cloud object.
Split
 Split a point cloud into two parts using a plane, or returns false if the pointcloud is not partitioned by plane.
Top
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace