RhinoCommon API
ViewCaptureSettings Methods
The ViewCaptureSettings type exposes the following members.
Methods
Name | Description
CreatePreviewSettings
 Create a ViewCaptureSettings based on this instance, but scaled to fit in a different sized area. Scaling is also performed on dpi. This is primarily used to for capturing images that are shown as print previews
Dispose
Actively reclaims unmanaged resources that this instance uses.
Equals(ViewCaptureSettings)
 Check if the contents of this object is the same as another object
Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetMargins
 Get distances from the edge of the paper (MediaSize) to the CropRectangle in a defined unit system
GetModelScale
 Returns the model scale factor.
GetOffset
GetViewport
 Get RhinoViewport that this view capture settings is targeting
Load
MatchViewportAspectRatio
 Adjust crop rectangle to match the aspect ratio of the original viewport that these settings reference
MaximizePrintableArea
 Minimize cropping so the full drawable area is used
Save
SetLayout
SetMarginBottom
 Set the distance from the bottom edge of the paper to the CropRectangle
SetMarginLeft
 Set the distance from the left edge of the paper to the CropRectangle
SetMarginRight
 Set the distance from the right edge of the paper to the CropRectangle
SetMargins
 Set distances from the edge of the paper (MediaSize) to the CropRectange in a defined unit system
SetMarginTop
 Set the distance from the top edge of the paper to the CropRectangle
SetModelScaleToFit
 Scales the model to fit.
SetModelScaleToValue
 Sets the model scale to a value.
SetOffset
SetViewport
SetWindowRect(Point2d, Point2d)
 Set the print area to a window selection based on two points in screen coordinates
SetWindowRect(Point3d, Point3d)
 Set the print area to a window selection based on two points in world coordinates
Top
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace