RhinoCommon API
RenderContentType Methods
The RenderContentType type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
GetAllAvailableTypes
 Gets an array of all available render content types registered with Rhino.
NewContentFromTypeId(Guid)
 Create a new content specified by the Guid. This function can be used to create temporary content, as it calls ::RhRdkContentFactories().NewContentFromType().
NewContentFromTypeId(Guid, RhinoDoc)
NewRenderContent
 Returns a new instance of the render content of this type. This content can be added to a persistent list.
Top
See Also
Reference
RenderContentType Class
Rhino.Render Namespace