RhinoCommon API
NurbsSurfacePointList Methods
The NurbsSurfacePointList type exposes the following members.
Methods
Name | Description
EnsurePrivateCopy
 If you want to keep a copy of this class around by holding onto it in a variable after a command completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can call this function as many times as you want.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
GetControlPoint
 Gets the control point at the given (u, v) index.
GetGrevillePoint
 Gets the 2-D Greville point associated with the control point at the given (u, v) index.
GetPoint(Int32, Int32, Point3d)
 Gets a world 3-D, or Euclidean, control point at the given (u, v) index. The 4-D representation is (x, y, z, 1.0).
GetPoint(Int32, Int32, Point4d)
 Gets a homogeneous control point at the given (u, v) index, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
GetWeight
 Gets the weight of a control point at the given (u, v) index. Note, if the surface is non-rational, the weight will be 1.0.
SetControlPoint(Int32, Int32, ControlPoint)
 Sets the control point at the given (u, v) index.
SetControlPoint(Int32, Int32, Point3d) |  Obsolete.
 Sets the control point at the given (u, v) index.
SetPoint(Int32, Int32, Point3d)
 Sets a world 3-D, or Euclidean, control point at the given (u, v) index. The 4-D representation is (x, y, z, 1.0).
SetPoint(Int32, Int32, Point4d)
 Sets a homogeneous control point at the given (u, v) index, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
SetPoint(Int32, Int32, Point3d, Double)
 Sets a world 3-D, or Euclidean, control point and weight at a given index. The 4-D representation is (x*w, y*w, z*w, w).
SetPoint(Int32, Int32, Double, Double, Double)
 Sets a world 3-D, or Euclidean, control point at the given (u, v) index. The 4-D representation is (x, y, z, 1.0).
SetPoint(Int32, Int32, Double, Double, Double, Double)
 Sets a homogeneous control point at the given (u, v) index, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
SetWeight
 Sets the weight of a control point at the given (u, v) index. Note, if the surface is non-rational, it will be converted to rational.
UVNDirectionsAt
 Calculates the U, V, and N directions of a NURBS surface control point similar to the method used by Rhino's MoveUVN command.
ValidateSpacing
 Simple check of distance between adjacent control points
Top
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace