RhinoCommon API
FileSat Methods
The FileSat type exposes the following members.
Methods
Name | Description
Write
Write a Sat file based on the contents of a RhinoDoc
Top
See Also
Reference
FileSat Class
Rhino.FileIO Namespace