RhinoCommon API
RenderPipeline Methods
The RenderPipeline type exposes the following members.
Methods
Name | Description
AddLightToScene
AddRenderMeshToScene
CloseWindow
 Closes the render window associated with this render instance.
CommandResult
ContinueModal
 Frequently called during a rendering by the frame work in order to determine if the rendering should continue.
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
GetRenderWindow()
 Get the RenderWindow associated with this RenderPipeline instance. This is virtual rather than abstract for V5 compat
GetRenderWindow(Boolean)
 As GetRenderWindow(), but if withWireframeChannel is true the returned RenderWindow will have the channel added.
GetRenderWindow(Boolean, Boolean)
 As GetRenderWindow(). The parameter withWireframeChannel controls whether the returned RenderWindow will have the channel added. The parameter fromRenderViewSource controls from where the RenderSize is queried.
GetRenderWindow(ViewportInfo, Boolean)
 As GetRenderWindow(). The parameter withWireframeChannel controls whether the returned RenderWindow will have the channel added. The parameter fromRenderViewSource controls from where the RenderSize is queried. The viewportInfo instance will be used to set up wireframe channel. This is necessary for rendering different view than is currently active in the viewport
GetRenderWindow(ViewportInfo, Boolean, Rectangle)
 As GetRenderWindow(). The parameter withWireframeChannel controls whether the returned RenderWindow will have the channel added. The parameter fromRenderViewSource controls from where the RenderSize is queried. The viewportInfo instance will be used to set up wireframe channel. This is necessary for rendering different view than is currently active in the viewport
GetRenderWindowFromRenderViewSource
 Like GetRenderWindow(), but with the size for RenderWindow set from RenderViewSources if fromRenderViewSource is set to true
IgnoreRhinoObject
LocalizeRenderReturnCode
NeedToProcessGeometryTable
NeedToProcessLightTable
OnRenderBegin
 Called by the framework when it is time to start rendering, the render window will be created at this point and it is safe to start
OnRenderBeginQuiet
 Called by the framework when it is time to start rendering quietly, there is no user interface when rendering in this mode and the default post process effects will get applied to the scene when the rendering is complete.
OnRenderEnd
 Called by the framework when the user closes the render window or clicks on the stop button in the render window.
OnRenderWindowBegin
PauseRendering
 Implement to pause the current render session
Render
 Call this function to render the scene normally. The function returns when rendering is complete (or cancelled).
RenderEnterModalLoop
RenderExitModalLoop
RenderPreCreateWindow
RenderSceneWithNoMeshes
RenderSize() |  Obsolete.
RenderSize(RhinoDoc)
 Get the render size as specified in the ON_3dmRenderSettings. Will automatically return the correct size based on the ActiveView or custom settings.
RenderSize(RhinoDoc, Boolean)
 Get the render size as specified in the ON_3dmRenderSettings, and from RenderSources when fromRenderSources is true.
RenderWindow
 Call this function to render the scene in a view window. The function returns when rendering is complete (or cancelled).
ResumeRendering
 Implement to resume current render session
SaveImage
 Saves the rendered image to a file. Does not prompt the user in any way.
SetAsyncRenderContext
SupportsPause
 Override and return true if the renderer supports pausing
Top
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace