RhinoCommon API
CommonComponentTable<T> Methods
The CommonComponentTable<T> generic type exposes the following members.
Methods
Name | Description
Clear
 Marks all items as deleted.
Delete
 Deletes an item. Items that are deleted are still keeping their space, but the 'IsDeleted' flag is checked.
FindId
 Uses the guid to find a model component. Deleted objects cannot be found by id. The guid is the value that is stored in the .Id property. In a single document, no two active objects have the same guid. If an object is replaced with a new object, then the guid persists. For example, if the _Move command moves an object, then the moved object inherits its guid from the starting object. If the Copy command copies an object, then the copy gets a new guid. This guid persists through file saving/opening operations. This function will not find grip objects.
GetEnumerator
 Returns the enumerator that yields all items.
Top
See Also
Reference
CommonComponentTable<T> Class
Rhino.FileIO Namespace