RhinoCommon API
LightManagerSupport Methods
The LightManagerSupport type exposes the following members.
Methods
Name | Description
DeleteLight
 Delete light
GetLights
 Get all the lights that are associated to the light manager. The lights are added to the LightArray parameter passed to the GetLights method
GetLightSolo
 Returns the value of "ON_LIght::m_bOn" if the light is in solo storage, or false if not in solo storage (ie - this is the checkbox state on the light manager dialog)
GroupLights
 Creates a new group with the lights
LightDescription
 Gets the string representation of the light description
LightFromId
 Get Rhino.Geometry.Light object associated to Guig uuid
LightsInSoloStorage
 Returns the number of lights in solo storage - any number other than 0 means "in solo mode"
ModifyLight
 Modify properties of the light
ObjectSerialNumberFromLight
 Get the object serial number of the light
OnCustomLightEvent
 Generates LightMangerSupportCustomEvent: light_added, light_deleted, light_undeleted, light_modified, light_sorted, The event triggers a Light table event that the rdk lightmanager listens too
OnEditLight
 The default implementation of OnEditLight selects the lights and opens the Lights Properties page
PluginId
 The Guid of the plugin
RegisterLightManager
 Find and register classes that derive from LightManagerSupport from the given plug-in.
RegisterProviders
 Find and register classes that derive from RealtimeDisplayMode from the given plug-in. The plug-in is found in the given assembly
RenderEngineId
 The Guid of the render engine
SetLightSolo
 First checks to see if we are in "solo mode" - which means that there are any lights that respond "true" to IsInSoloStorage. If in solo mode: If bSolo = true Sets this light on. If bSolo = false If this is the last light "on", forces all lights out of solo mode. If there are other lights on, turns this light off. If not in solo mode: If bSolo = true Forces all lights into solo storage and sets this light on. If bSolo = false This shouldn't happen. Will cause an ASSERT
UnGroup
 UnGroups the lights
Top
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace