RhinoCommon API
FileNwd Methods
The FileNwd type exposes the following members.
Methods
Name | Description
Write
Write a nwd file based on the contents of a RhinoDoc
Top
See Also
Reference
FileNwd Class
Rhino.FileIO Namespace