RhinoCommon API
ImageFile Methods
The ImageFile type exposes the following members.
Methods
Name | Description
SupportsAlphaChannel
 Returns true if file at given path is an image file and that file format supports an alpha channel
Top
See Also
Reference
ImageFile Class
Rhino.FileIO Namespace