RhinoCommon API
PreviewSceneServer Methods
The PreviewSceneServer type exposes the following members.
Methods
Name | Description
ApplyRotation
 Set Scene Server Rotation
Dispose()
 Dispose for PreviewSceneServer
Dispose(Boolean)
 Dispose for PreviewSceneServer
Finalize
 Destructor for PreviewSceneServer
 (Overrides Object.Finalize().)
SetSceneScale
 Set Scene Server Scale
Top
See Also
Reference
PreviewSceneServer Class
Rhino.Render Namespace