RhinoCommon API
File3dmInstanceDefinitionTable Methods
The File3dmInstanceDefinitionTable type exposes the following members.
Methods
Name | Description
Add(String, String, Point3d, IEnumerable<GeometryBase>)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, GeometryBase, ObjectAttributes)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Adds an instance definition to the instance definition table.
Add(String, String, String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Adds an instance definition to the instance definition table.
AddLinked
 Adds a linked instance definition to the instance definition table.
FindName
 Finds an InstanceDefinitionGeometry given its name.
FindNameHash
 Finds a InstanceDefinitionGeometry given its name hash.
Top
See Also
Reference
File3dmInstanceDefinitionTable Class
Rhino.FileIO Namespace