RhinoCommon API
File3dmRenderEnvironment Methods
The File3dmRenderEnvironment type exposes the following members.
Methods
Name | Description
ToEnvironment
 Get a simulated environment that approximates this environment's appearance.
Top
See Also
Reference
File3dmRenderEnvironment Class
Rhino.FileIO Namespace