RhinoCommon API
SaveFileDialog Methods
The SaveFileDialog type exposes the following members.
Methods
Name | Description
ShowDialog |  Obsolete.
ShowSaveDialog
Top
See Also
Reference
SaveFileDialog Class
Rhino.UI Namespace