RhinoCommon API
PreviewAppearance Methods
The PreviewAppearance type exposes the following members.
Methods
Name | Description
Background
 Background
Dispose
 Dispose for previewappearance
Duplicate
 Deep copy
Finalize
 Destructor for previewappearance
 (Overrides Object.Finalize().)
FromMetaData
 Copy data from MetaData to PreviewAppearance
Geometry
 Geometry
Lighting
 Lighting
RotationType
 RotationType
RotationX
 RotationX
RotationY
 RotationY
SetRotationType
 SetRotationType
SetRotationX
 SetRotationX
SetRotationY
 SetRotationY
SetSize |  Obsolete.
 SetSize
Size |  Obsolete.
 Size - used in the UI. Always meters.
ToMetaData()
 Copy PreviewAppearance to MetaData
ToMetaData(MetaDataProxy)
 Copy PreviewAppearance to MetaData
Top
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace