RhinoCommon API
RiskyAction Methods
The RiskyAction type exposes the following members.
Methods
Name | Description
Dispose
 IDisposable implementation
Top
See Also
Reference
RiskyAction Class
Rhino.Runtime Namespace