RhinoCommon API
IPostEffects Methods
The IPostEffects type exposes the following members.
Methods
Name | Description
GetPostEffects
PostEffectFromId
Top
See Also
Reference
IPostEffects Interface
Rhino.Render.PostEffects Namespace