RhinoCommon API
BitmapTable Methods
The BitmapTable type exposes the following members.
Methods
Name | Description
AddBitmap
Adds a new bitmap with specified name to the bitmap table.
Delete
 Removes the bitmap from the table.
 (Overrides CommonComponentTable<T>.Delete(T).)
DeleteBitmap
Deletes a bitmap.
ExportToFile
Writes a bitmap to a file.
ExportToFiles
Exports all the bitmaps in the table to files.
Find
 This function first attempts to find the file with "name" on the disk. If it does find it, "fileName" is set to the full path of the file and the BitmapEntry returned will be null, even if there was a BitmapEntry with "name" in the bitmap table. If the function cannot find the file on the disk, it searches the bitmap table. If it finds it, the returned BitmapEntry entry will be the entry in the table with that name. Additionally, if "createFile" is true, and an entry is found, the file will be written to the disk and it's full path will be contained in "fileName".
FindIndex
 Retrieves a BitmapEntry object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
Top
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace