RhinoCommon API
DoubleField Methods
The DoubleField type exposes the following members.
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
DoubleField Class
Rhino.Render.Fields Namespace