RhinoCommon API
EventWatcher Methods
The EventWatcher type exposes the following members.
Methods
Name | Description
Dispose
 Stops watching and releases the underlying native watcher.
Finalize
Releases the native watcher if Dispose() was not called.
 (Overrides Object.Finalize().)
Top
See Also
Reference
EventWatcher Class
Rhino Namespace