RhinoCommon API
RenderMaterial Methods
The RenderMaterial type exposes the following members.
Methods
Name | Description
AssignTo(ObjRef)
AssignTo(IEnumerable<ObjRef>, RenderMaterial.AssignToSubFaceChoices, RenderMaterial.AssignToBlockChoices, Boolean)
ConvertToPhysicallyBased
 Returns a material that is the best approximation of the original, but as a physically based material.
CreateBasicMaterial(Material) |  Obsolete.
 Constructs a new basic material from a Material.
CreateBasicMaterial(Material, RhinoDoc)
CreateImportedMaterial
FromMaterial
 Constructs a new material from a Material.
GetTextureAmountFromUsage
GetTextureFromUsage
GetTextureOnFromUsage
HandleTexturedValue<T>
 Handle a textured content field. Values will be read into an instance of TexturedColor
ImportMaterialAndAssignToLayers
Imports a material file (.RMTL) and assigns the imported material to one or more layers.
SimulatedMaterial |  Obsolete.
SimulateMaterial(Boolean) |  Obsolete.
 Call this function to receive the simulation for a RenderMaterial used by the display and other rendering engines.
SimulateMaterial(Material, RenderTexture.TextureGeneration)
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
SimulateMaterial(Material, Boolean) |  Obsolete.
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
SlotFromTextureType
TextureChildSlotName
 Override this function to provide information about which texture is used for the standard (ie - defined in ON_Texture) texture channels.
TextureTypeFromSlot
ToMaterial
Top
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace