RhinoCommon API
BrepVertexList Methods
The BrepVertexList type exposes the following members.
Methods
Name | Description
Add()
 Create and add a new vertex to this list
Add(Point3d, Double)
 Create and add a new vertex to this list
AddPointOnFace
Adds a new point on face to the brep
GetEnumerator
 Gets an enumerator that visits all surfaces.
Top
See Also
Reference
BrepVertexList Class
Rhino.Geometry.Collections Namespace