RhinoCommon API
FileFbx Methods
The FileFbx type exposes the following members.
Methods
Name | Description
Read
Read a Fbx file intof a RhinoDoc
Write
Write a Fbx file based on the contents of a RhinoDoc
Top
See Also
Reference
FileFbx Class
Rhino.FileIO Namespace