RhinoCommon API
OptionToggle Methods
The OptionToggle type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
OptionToggle Class
Rhino.Input.Custom Namespace