RhinoCommon API
MeshIntersectionCache Methods
The MeshIntersectionCache type exposes the following members.
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 Disposes the mesh intersection cache.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Top
See Also
Reference
MeshIntersectionCache Class
Rhino.Geometry.Intersect Namespace