RhinoCommon API
HatchLine Methods
The HatchLine type exposes the following members.
Methods
Name | Description
AppendDash
 Add a dash to the pattern.
DashAt
 Get the dash length at the specified index.
Dispose()
 Actively releases the unmanaged object.
Dispose(Boolean)
 Releases the unmanaged object.
Finalize
 Passively releases the unmanaged object.
 (Overrides Object.Finalize().)
SetDashes
 Sets a new dash array.
Top
See Also
Reference
HatchLine Class
Rhino.DocObjects Namespace