RhinoCommon API
StringParserSettings Methods
The StringParserSettings type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
SetAllExpressionSettingsToFalse
SetAllFieldsToFalse
Top
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace