RhinoCommon API
CursorTooltipSettings Methods
The CursorTooltipSettings type exposes the following members.
Methods
Name | Description
GetCurrentState
 Gets the current settings.
GetDefaultState
 Gets the cursor tooltip factory settings.
UpdateFromState
Top
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace