RhinoCommon API
ViewInfo Methods
The ViewInfo type exposes the following members.
Methods
Name | Description
ClippingPlaneSurfaces
 Returns a list of ClippingPlaneSurfaces for this view.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetConstructionPlane
 Gets the view's construction plane, including its grid settings: grid and snap spacing, grid line count, thick-line frequency, and depth buffering.
GetPageSettings
 Gets the paper size and margins of this view. Only meaningful when ViewType is PageView.
GetWindowPosition
 Gets the position of the view window in the frame window, expressed as fractions (0 to 1) of the frame window size.
SetConstructionPlane
 Sets the view's construction plane, including its grid settings.
SetPageSettings
 Sets the paper size and margins of this view. Set ViewType to PageView as well, or the page settings are ignored.
SetWindowPosition
 Sets the position of the view window in the frame window, expressed as fractions (0 to 1) of the frame window size. The Maximized state is preserved.
Top
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace