RhinoCommon API
DetailView Methods
The DetailView type exposes the following members.
Methods
Name | Description
SetScale(Double, LengthUnit, Double, LengthUnit)
 Sets the detail viewport's projection so geometry is displayed at a certain scale.
SetScale(Double, UnitSystem, Double, UnitSystem) |  Obsolete.
 Sets the detail viewport's projection so geometry is displayed at a certain scale.
Top
See Also
Reference
DetailView Class
Rhino.Geometry Namespace