RhinoCommon API
Triangle3d Methods
The Triangle3d type exposes the following members.
Methods
Name | Description
BarycentricCoordsAt
 Gets the projection of a point onto the barycentric coordinates.
ClosestParameterOnBoundary
 Gets the parameter on the triangle boundary closest to a test point.
ClosestPointOnBoundary
 Gets the point on the triangle boundary closest to a test point.
PointAlongBoundary
 Gets the point along the boundary of the triangle. The triangle boundary has a domain [0, 3] where each subsequent unit domain maps to a different edge.
PointAtBarycentricCoords
 Gets a point within this triangle using barycentric coordinates.
PointOnInterior
 Gets the point on the triangle using the AB and AC primary axes.
ToMesh
 Create a mesh from this triangle.
ToPolyline
 Create a polyline from this triangle.
Transform
 Transform this triangle.
TrySmallestEnclosingTriangle
 Attempt to create the smallest triangle containing a set of planar points.
WithA
 Replace the A corner.
WithB
 Replace the B corner.
WithC
 Replace the C corner.
Top
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace