RhinoCommon API
ColorLAB Methods
The ColorLAB type exposes the following members.
Methods
Name | Description
CreateFromCMYK
 Create the nearest LAB equivalent of a CMYK color.
CreateFromHSL
 Create the nearest LAB equivalent of an HSL color.
CreateFromHSV
 Constructs the nearest LAB equivalent of an HSV color.
CreateFromLCH
 Create the nearest LAB equivalent of an LCH color.
CreateFromRGBA
 Create the nearest LAB equivalent of an RGBA color.
CreateFromXYZ
 Create the nearest LAB equivalent of an XYZ color.
Top
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace