RhinoCommon API
CurveList Methods
The CurveList type exposes the following members.
Methods
Name | Description
Add(Arc)
 Adds an arc to this list.
Add(Circle)
 Adds a circle to this list.
Add(Ellipse)
 Adds an ellipse to this list.
Add(IEnumerable<Point3d>)
 Adds a polyline to this list.
Add(Line)
 Adds a line to this list.
Insert(Int32, Arc)
 Inserts an arc at a given index of this list.
Insert(Int32, Circle)
 Inserts a line at a given index of this list.
Insert(Int32, Ellipse)
 Inserts an ellipse at a given index of this list.
Insert(Int32, Line)
 Inserts a line at a given index of this list.
Insert(Int32, IEnumerable<Point3d>)
 Inserts a polyline at a given index of this list.
Transform
 Transform all the curves in this list. If at least a single transform failed this function returns false.
Top
See Also
Reference
CurveList Class
Rhino.Collections Namespace