RhinoCommon API
Font Methods
The Font type exposes the following members.
Methods
Name | Description
AvailableFontFaceNames
FromQuartetProperties
FromRichTextProperties
 Returns a font with the requested rich-text (family) name, preserving that name even when the font is not installed on the current machine. If an installed font matches it is returned; otherwise a "not on device" managed font that keeps the requested name is returned (rendered with a fallback quartet). Use this to author a font by name on a machine that does not have it installed: the Font constructor and FromQuartetProperties(String, Boolean, Boolean) both substitute the family in that case, losing the requested name when the file is written.
GetObjectData
 Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
GetSubstituteFont
 If this font is not installed on the system, try to find a substitute
InstalledFonts()
InstalledFonts(String)
InstalledFontsAsQuartets
Top
See Also
Reference
Font Class
Rhino.DocObjects Namespace