RhinoCommon API
ByteArrayField Methods
The ByteArrayField type exposes the following members.
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
ByteArrayField Class
Rhino.Render.Fields Namespace