RhinoCommon API
UserInterfaceObjectBase Methods
The UserInterfaceObjectBase type exposes the following members.
Methods
Name | Description
ClearKeyboardFocus
 Take keyboard focus away from whichever user interface object has it, so that typing goes to the command line again.
IsMouseOver
 Called to test if the mouse is actively over this object
IsRegistered
 Is this user interface object active
OnDraw
 All user interface objects are drawn and can customize their look with the OnDraw function
OnMouseClick
 Called during a mouse click event on this object
OnMouseDoubleClick
 Called during a mouse double click event on this object
OnMouseDown
 Called when the mouse goes down on this object
OnMouseEnter
 Called when the mouse goes over this object
OnMouseLeave
 Called when the mouse leaves this object
OnMouseMove
 Called when the mouse is moved
OnMouseUp
 Called when the mouse is released on this object
OnRunCommand
 Called after the above RunCommand function is called. This will be executing while inside of a Rhino command.
RegisterForAllDocuments
 Make this object visible for all documents. Typically you will only have user interface objects work with single documents. For that case, call doc.ViewUserInterface.Add
RunCommand
 Call RunCommand to have the virtual OnRunCommand function executed in the scope of a Rhino command. If you are modifying the document from one of the mouse functions on this object, this is the best approach to do so since changes made inside of a command are recorded for undo.
Unregister
 Unregister this object
Top
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace