RhinoCommon API
IZooClientUtilities2 Methods
The IZooClientUtilities2 type exposes the following members.
Methods
Name | Description
ValidateStandaloneLicense
 RH-92777: Validates a stand-alone license key for the given account email against the validation server, asking the user for no input (progress and any server-reported problems are shown by the validation wizard). Returns true on success.
Top
See Also
Reference
IZooClientUtilities2 Interface
Rhino.Runtime Namespace