RhinoCommon API
GeneralSettings Methods
The GeneralSettings type exposes the following members.
Methods
Name | Description
GetCurrentState
 Gets the current settings.
GetDefaultState
 Gets the factory settings.
Top
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace