RhinoCommon API
FilletSurfaceSettings Methods
The Brep.FilletSurfaceSettings type exposes the following members.
Methods
Name | Description
CreateChamferSettings
 Create settings for chamfered surfaces
CreateG2BlendSettings
 Create settings for G2-blended fillet surfaces
CreateNonRationalSettings
 Create settings for non-rational approximated arc fillet surfaces
CreateRationalArcSettings
 Create settings for rational arc fillet surfaces
Top
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace