RhinoCommon API
NeverRepeatList Methods
The NeverRepeatList type exposes the following members.
Methods
Name | Description
CommandNames
The list of commands to not repeat.
SetList
Puts the command name tokens in m_dont_repeat_list.
Top
See Also
Reference
NeverRepeatList Class
Rhino.ApplicationSettings Namespace