RhinoCommon API
FilePdf Methods
The FilePdf type exposes the following members.
Methods
Name | Description
AddPage(ViewCaptureSettings)
 Add a new page to this document and draw a viewport into it based on provided ViewCaptureSettings
AddPage(Int32, Int32, Int32)
 Add a blank page to this document
Create
 Create a new instance of a FilePdf class
DrawBitmap
 Draw a bitmap
DrawLine
 Draw a line
DrawPolyline
 Draw a polyline path
DrawText
 Draw text on a page
FirePreWriteEvent
 Called by the framework to fire a PreWrite event
GetCustomPages
 Get a list of custom PDF page definitions defined by the user
PdfDocumentImplementation
 Get actual implementation of PdfDocument class
Read
Read a PDF file into a RhinoDoc
SetCustomPages
 Set the list of custom PDF page definitions
Write(Stream)
 Write PDF to a stream
Write(String)
 Write PDF to a file
Top
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace