RhinoCommon API
InstanceDefinitionGeometry Methods
The InstanceDefinitionGeometry type exposes the following members.
Methods
Name | Description
DeleteAllUserStrings
 Deletes all user strings attached to this geometry.
DeleteUserString
 Deletes the user string with the specified key from this geometry.
GetObjectIds
 Returns the unique identifiers of all objects that are part of this instance definition's geometry table.
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
SetUserString
 Attach a user string (key,value combination) to this geometry.
Top
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace