RhinoCommon API
MouseState Methods
The MouseState type exposes the following members.
Methods
Name | Description
IsMouseOver(Line)
 Test if the mouse is currently over a 3d line
IsMouseOver(Point3d)
 Test if the mouse is currently over a 3d location
IsMouseOver(Curve, Double)
 Test if the mouse is over a curve
Top
See Also
Reference
MouseState Class
Rhino.UI Namespace