RhinoCommon API
BrepEdge Methods
The BrepEdge type exposes the following members.
Methods
Name | Description
AdjacentFaces
 Gets the indices of all the BrepFaces that use this edge.
ConcavityAt
 Determine the concavity of this edge at a specific parameter.
Get3dVectorsIntoFaces
 For each trim at this edge, find the 3d unit vector at the edge parameter in the trim's surface tangent plane, perpendicular to the edge, which points to the active side of the trim.
GetEdgeParameter
 Get corresponding edge parameter for given trim at given trim parameter.
IsSmoothManifoldEdge
 For a manifold, non-boundary edge, decides whether or not the two surfaces on either side meet smoothly.
SetEdgeCurve(Int32)
 Set 3d curve geometry used by a b-rep edge.
SetEdgeCurve(Int32, Interval)
 Set 3d curve geometry used by a b-rep edge.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The NURBS Curves segments do not have fully multiple interior knots.
 3. Rational NURBS curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent co-linear or co-circular segments are combined.
TrimIndices
 Gets the indices of all trims associated with this edge.
Top
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace