RhinoCommon API
File3dmRenderMaterial Methods
The File3dmRenderMaterial type exposes the following members.
Methods
Name | Description
ToMaterial
 Get a simulated material that approximates this material's appearance.
Top
See Also
Reference
File3dmRenderMaterial Class
Rhino.FileIO Namespace