RhinoCommon API
CachedTextureCoordinates Methods
The CachedTextureCoordinates type exposes the following members.
Methods
Name | Description
Contains
 Determines whether this collection contains a specific value.
CopyTo
 Copies the elements of the this collection to an System.Array, starting at a particular System.Array index.
GetEnumerator
 Returns an enumerator that iterates through this collection.
IndexOf
 Determines the index of a specific point in this collection.
TryGetAt
 Use this method to iterate the cached texture coordinate array.
Top
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace