RhinoCommon API
AreaMassProperties Methods
The AreaMassProperties type exposes the following members.
Methods
Name | Description
CentroidCoordinatesPrincipalMoments
 Calculates the eigenvalues and eigenvectors of the moments matrix with respect to centroid coordinates.
CentroidCoordinatesPrincipalMomentsOfInertia
 Calculates the principal moments of inertia and principal axes with respect to centroid coordinates.
Compute(Brep)
 Computes an AreaMassProperties for a brep.
Compute(Curve)
 Computes an AreaMassProperties for a closed planar curve.
Compute(Hatch)
 Computes an AreaMassProperties for a hatch.
Compute(IEnumerable<GeometryBase>)
 Computes the Area properties for a collection of geometric objects. At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
Compute(Mesh)
 Computes an AreaMassProperties for a mesh.
Compute(Surface)
 Computes an AreaMassProperties for a surface.
Compute(Curve, Double)
 Computes an AreaMassProperties for a closed planar curve.
Compute(Brep, Boolean, Boolean, Boolean, Boolean)
 Compute the AreaMassProperties for a single Brep.
Compute(IEnumerable<GeometryBase>, Boolean, Boolean, Boolean, Boolean)
 Computes the AreaMassProperties for a collection of geometric objects. At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
Compute(Mesh, Boolean, Boolean, Boolean, Boolean)
 Compute the AreaMassProperties for a single Mesh.
Compute(Surface, Boolean, Boolean, Boolean, Boolean)
 Compute the AreaMassProperties for a single Surface.
Compute(Brep, Boolean, Boolean, Boolean, Boolean, Double, Double)
 Compute the AreaMassProperties for a single Brep.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Sum(AreaMassProperties)
 Sum mass properties together to get an aggregate mass.
Sum(IEnumerable<AreaMassProperties>, Boolean)
 Sum mass properties together to get an aggregate mass.
WeightedSum
 Sum a list of mass properties together to get an aggregate mass, weighting each by a density factor.Ignores existing mass properties in this object.
WorldCoordinatesPrincipalMoments
 Calculates the eigenvalues and eigenvectors of moments matrix in world coordinates.
WorldCoordinatesPrincipalMomentsOfInertia
 Calculates the principal moments of inertia and principal axes with respect to world coordinates.
Top
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace