RhinoCommon API
GetInteger Methods
The GetInteger type exposes the following members.
Methods
Name | Description
Get
 Call to get an integer.
Number
SetLowerLimit
 Sets a lower limit on the number that can be returned. By default there is no lower limit.
SetUpperLimit
 Sets an upper limit on the number that can be returned. By default there is no upper limit.
Top
See Also
Reference
GetInteger Class
Rhino.Input.Custom Namespace