RhinoCommon API
Components Methods
The Components type exposes the following members.
Methods
Name | Description
__getAllFunctions
 Returns a collection with all component functions. For infrastructure usage only.
FindComponent
 Finds a component given its full name.
Top
See Also
Reference
Components Class
Rhino.NodeInCode Namespace