RhinoCommon API
ReplayHistoryData Methods
The ReplayHistoryData type exposes the following members.
Methods
Name | Description
AppendHistoryResult
 Create an empty history result and add it to the end of the Results array. Note that you should call Results again if you need them as the old Results array will be out of sync with this class.
Dispose
GetRhinoObjRef
 In ReplayHistory, use GetRhinoObjRef to convert the information in a history record into the ObjRef that has up to date RhinoObject pointers
TryGetBool
TryGetColor
TryGetDouble
TryGetDoubles
TryGetGuid
TryGetGuids
TryGetInt
TryGetInts
TryGetPoint3d
TryGetPoint3dOnObject
TryGetString
TryGetTransform
TryGetVector3d
UpdateResultArray
 Update the Results array with a different set of values. Null entries in the newResults will result in empty ReplayHistoryResult elements
Top
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace