RhinoCommon API
IHeaderButtonHandler Methods
The IHeaderButtonHandler type exposes the following members.
Methods
Name | Description
ButtonDetails
 Implement this method to describe custom buttons on the section header. RDK calls this method continually increasing iIndex until it returns \e false
ButtonRect
 Implement this method to get the rectangle of a button on the header window.
DeleteThis
OnButtonClicked
 Implement this method to handle a button click.
Top
See Also
Reference
IHeaderButtonHandler Interface
Rhino.UI.Controls Namespace