RhinoCommon API
SuspendCollectionChangedEventHandler<T> Methods
The SuspendCollectionChangedEventHandler<T> generic type exposes the following members.
Methods
Name | Description
Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
Top
See Also
Reference
SuspendCollectionChangedEventHandler<T> Class
Rhino.Notifications Namespace