RhinoCommon API
PostEffectThreadEngine Methods
The PostEffectThreadEngine type exposes the following members.
Methods
Name | Description
Dispose
Finalize |  (Overrides Object.Finalize().)
RunPostEffect
Top
See Also
Reference
PostEffectThreadEngine Class
Rhino.Render.PostEffects Namespace