RhinoCommon API
Group Methods
The Group type exposes the following members.
Methods
Name | Description
DeleteAllUserStrings
DeleteUserString
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
SetUserString
 Attach a user string (key,value combination) to this geometry.
Top
See Also
Reference
Group Class
Rhino.DocObjects Namespace