RhinoCommon API
VolumeMassProperties Methods
The VolumeMassProperties type exposes the following members.
Methods
Name | Description
CentroidCoordinatesPrincipalMoments
 Calculates the eigenvalues and eigenvectors of the moments matrix with respect to centroid coordinates.
CentroidCoordinatesPrincipalMomentsOfInertia
 Calculates the principal moments of inertia and principal axes with respect to centroid coordinates.
Compute(Brep)
 Compute the VolumeMassProperties for a single Brep.
Compute(IEnumerable<GeometryBase>)
 Computes the VolumeMassProperties for a collection of geometric objects. At present only Breps, Surfaces, and Meshes are supported.
Compute(Mesh)
 Compute the VolumeMassProperties for a single Mesh.
Compute(Surface)
 Compute the VolumeMassProperties for a single Surface.
Compute(Brep, Boolean, Boolean, Boolean, Boolean)
 Compute the VolumeMassProperties for a single Brep.
Compute(IEnumerable<GeometryBase>, Boolean, Boolean, Boolean, Boolean)
 Computes the VolumeMassProperties for a collection of geometric objects. At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
Compute(Mesh, Boolean, Boolean, Boolean, Boolean)
 Compute the VolumeMassProperties for a single Mesh.
Compute(Surface, Boolean, Boolean, Boolean, Boolean)
 Compute the VolumeMassProperties for a single Surface.
Compute(Brep, Boolean, Boolean, Boolean, Boolean, Double, Double)
 Compute the VolumeMassProperties for a single Brep.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Sum(VolumeMassProperties)
 Sum mass properties together to get an aggregate mass.
Sum(IEnumerable<VolumeMassProperties>, Boolean)
 Sum mass properties together to get an aggregate mass.
Transform
 On input, this contains the mass properties for some geometry G. On exit, this contains the mass properties for the transformed geometry xform(G).
WeightedSum
 Sum a list of mass properties together to get an aggregate mass, weighting each by a density factor.Ignores existing mass properties in this object.
WorldCoordinatesPrincipalMoments
 Calculates the eigenvalues and eigenvectors of moments matrix in world coordinates.
WorldCoordinatesPrincipalMomentsOfInertia
 Calculates the principal moments of inertia and principal axes with respect to world coordinates.
Top
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace