RhinoCommon API
FileDwg Methods
The FileDwg type exposes the following members.
Methods
Name | Description
Read
Read a DWG file into a RhinoDoc
Write
Write a DWG file based on the contents of a RhinoDoc
Top
See Also
Reference
FileDwg Class
Rhino.FileIO Namespace