RhinoCommon API
Color4fField Methods
The Color4fField type exposes the following members.
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
Color4fField Class
Rhino.Render.Fields Namespace