RhinoCommon API
UserInterfaceRadioButton Methods
The UserInterfaceRadioButton type exposes the following members.
Methods
Name | Description
OnCheckedChanged
 Called after a click or a key has changed the state of this button. Both ends of the change are told, the button that came on and the button that went off, so a set can be watched from any one of its buttons. The default implementation raises the CheckedChanged event.
Top
See Also
Reference
UserInterfaceRadioButton Class
Rhino.UI Namespace