RhinoCommon API
IStackedDialogPageService Methods
The IStackedDialogPageService type exposes the following members.
Methods
Name | Description
GetImageHandle(Icon, Boolean)
 Convert image to platform specific unmanaged pointer
GetImageHandle(Image, Boolean)
 Convert image to platform specific unmanaged pointer
GetNativePageWindow(Object, Boolean, Boolean, Object)
 Get the unmanaged pointer associated with the pages content control
GetNativePageWindow(Object, Boolean, Boolean, Object, Object)
 Get the unmanaged pointer associated with the pages content control
NativeHandle
 Gets the native window handle associated with the host object if there is one.
RedrawPageControl
 Redraw the specified control.
SetNativeParent
 Sets the parent on a host returned from GetNativePageWindow
TryGetControlMinimumSize
 Get the minimum size associated with a control object
Top
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace