RhinoCommon API
CommandAliasList Methods
The CommandAliasList type exposes the following members.
Methods
Name | Description
Add
Adds a new command alias to Rhino.
Clear
Removes all aliases from the list.
Delete
Deletes an existing command alias from Rhino.
FindAlias
 Find an existing CommandAlias given the alias string
GetAlias
 Get command alias from the list
GetDefaults
 Constructs a dictionary containing as keys the default names and as value the default macro.
The returned dictionary contains a copy of the settings.
GetMacro
Returns the macro of a command alias.
GetNames
Returns a list of command alias names.
IsAlias
Verifies that a command alias exists in Rhino.
IsDefault
 Computes a value indicating if the current alias list is the same as the default alias list.
SetMacro
Modifies the macro of a command alias.
ToDictionary
 Constructs a new dictionary that contains: as keys all names and as values all macros.
Modifications to this dictionary do not affect any Rhino command alias.
Update
 Add or modify the command aliases with a list of aliases
Top
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace