RhinoCommon API
MouseCallback Methods
The MouseCallback type exposes the following members.
Methods
Name | Description
OnEndMouseDown
 Called at the end of handling of a mouse down event in Rhino. All of the default Rhino mouse down functionality has already been executed unless a MouseCallback has set Cancel to true for the event arguments. You can tell if this is the case by inspecting the Cancel property in the event arguments parameter. Base class implementation of this function does nothing
OnEndMouseMove
 Called at the end of handling of a mouse move event in Rhino. All of the default Rhino mouse move functionality has already been executed unless a MouseCallback has set Cancel to true for the event arguments. You can tell if this is the case by inspecting the Cancel property in the event arguments parameter. Base class implementation of this function does nothing.
OnEndMouseUp
 Called at the end of handling of a mouse up event in Rhino. All of the default Rhino mouse down functionality has already been executed unless a MouseCallback has set Cancel to true for the event arguments. You can tell if this is the case by inspecting the Cancel property in the event arguments parameter. Base class implementation of this function does nothing
OnMouseDoubleClick
OnMouseDown
 Called at the beginning of handling of a mouse down event in Rhino. If you don't want the default Rhino functionality to be run, then set Cancel to true on the passed in event arguments Base class implementation of this function does nothing
OnMouseEnter
OnMouseHover
OnMouseLeave
OnMouseMove
 Called at the beginning of handling of a mouse move event in Rhino. If you don't want the default Rhino functionality to be run, then set Cancel to true on the passed in event arguments. Base class implementation of this function does nothing.
OnMouseUp
 Called at the beginning of handling of a mouse up event in Rhino. If you don't want the default Rhino functionality to be run, then set Cancel to true on the passed in event arguments Base class implementation of this function does nothing
Top
See Also
Reference
MouseCallback Class
Rhino.UI Namespace