RhinoCommon API
ProxyObject Methods
The ProxyObject type exposes the following members.
Methods
Name | Description
CreateMeshes
 Create meshes used to render and analyze surface and polysurface objects.
 (Overrides RhinoObject.CreateMeshes(MeshType, MeshingParameters, Boolean).)
GetMeshes
 Get existing meshes used to render and analyze surface and polysurface objects.
 (Overrides RhinoObject.GetMeshes(MeshType).)
Top
See Also
Reference
ProxyObject Class
Rhino.DocObjects Namespace