RhinoCommon API
DisplayPipelineAttributes Methods
The DisplayPipelineAttributes type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
GetColorFadeEffect
 Get the current color fade effect data.
GetDiagonalHatchEffect
 Get the current diagonal hatch strength and width in pixels.
GetDitherTransparencyEffect
 Get the current dither transparency amount.
GetFill
 Get fill colors used for clearing the frame buffer
GetObjectData
GetSurfaceEdgeThicknessUsage
 Helper function for setting the SurfaceEdgeThicknessFlags
GetSurfaceIsoApplyPattern
GetSurfaceIsoColorUsage
 Helper function for getting SurfaceIsoColorsUsed and SurfaceSingleIsoColor
GetSurfaceIsoThicknessUsage
 This is a helper function that combines getting IsoThicknessUsed and SurfaceNakedEdgeThicknessUsageFlags settings to correspond to the behavor of the Settings page.
GetSurfaceNakedEdgeThicknessUsage
 This is a helper function that combines getting SurfaceNakeEdgeUseNormalThickness and SurfaceNakedEdgeThicknessUsageFlags settings to correspond to the behavor of the Settings page.
HasColorFadeEffect
 Returns TRUE if there is a color fade effect enabled with a color fade effect amount larger than 0.0, FALSE otherwise.
HasDiagonalHatchEffect
 Returns TRUE if there is a diagonal hatch effect enabled with a hatch strength larger than 0.0, FALSE otherwise.
HasDitherTransparencyEffect
 Returns TRUE if there is a dither transparency effect enabled with a transparency amount larger than 0.0, FALSE otherwise.
SetColorFadeEffect
 Set a color fade effect to make objects fade a given amount towards a given color.
SetDiagonalHatchEffect
 Set a diagonal hatch effect to make objects render with diagonal hatch with a given strength and width in pixels. The effect works by brightening and darkening pixels in a diagonal pattern.
SetDitherTransparencyEffect
 Set a dither transparency effect to make objects render with a given amount of transparency using a dither effect.
SetFill(Color)
 Set fill mode to solid color and set the fill color
SetFill(Color, Color)
 Set fill mode to two color and set the colors
SetFill(Color, Color, Color, Color)
 Set the fill mode to four color gradient and set the colors
SetSurfaceEdgeThicknessUsage
 Helper function for getting the SurfaceEdgeThicknessFlags
SetSurfaceIsoApplyPattern
SetSurfaceIsoColorUsage
 Helper function for setting SurfaceIsoColorsUsed and SurfaceIsoSingleColor
SetSurfaceIsoThicknessUsage
 This is a helper function that combines setting IsoThicknessUsed and SurfaceNakedEdgeThicknessUsageFlags settings to correspond to the behavor of the Settings page.
SetSurfaceNakedEdgeThicknessUsage
 This is a helper function that combines setting SurfaceNakeEdgeUseNormalThickness and SurfaceNakedEdgeThicknessUsageFlags settings to correspond to the behavor of the Settings page.
Top
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace