RhinoCommon API
MappingTag Methods
The MappingTag type exposes the following members.
Methods
Name | Description
CompareTo
 Compares this mapping tag with another mapping tag.
Top
See Also
Reference
MappingTag Class
Rhino.Render Namespace