RhinoCommon API
GetCancel Methods
The GetCancel type exposes the following members.
Methods
Name | Description
Cancel
 Cancel all running tasks
Wait(Task, RhinoDoc)
 Awaits a particular task to finish.
Wait<TResult>(Task<TResult>, RhinoDoc)
 Awaits a particular task to finish.
WaitAll(IEnumerable<Task>, RhinoDoc)
 Awaits some tasks to finish.
WaitAll<TResult>(IEnumerable<Task<TResult>>, RhinoDoc)
 Awaits some tasks to finish.
Top
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace