RhinoCommon API
SubDCreationOptions Methods
The SubDCreationOptions type exposes the following members.
Methods
Name | Description
Dispose
 Delete unmanaged pointer for this
Finalize
 Finalizer
 (Overrides Object.Finalize().)
Top
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace