RhinoCommon API
SubDFaceList Methods
The SubDFaceList type exposes the following members.
Methods
Name | Description
Add
 Adds a face bounded by the given edges.
ClearPerFaceColors
 Removes all per face color overrides on the active level.
Find(Int32)
 Find a face in this SubD with a given id
Find(UInt32)
 Find a face in this SubD with a given id
GetEnumerator
 Implementation of IEnumerable
Top
See Also
Reference
SubDFaceList Class
Rhino.Geometry.Collections Namespace