RhinoCommon API
RhinoDocUndoRecord Methods
The RhinoDocUndoRecord type exposes the following members.
Methods
Name | Description
Dispose
 IDisposable implementaton
Top
See Also
Reference
RhinoDocUndoRecord Class
Rhino Namespace