RhinoCommon API
NullField Methods
The NullField type exposes the following members.
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
NullField Class
Rhino.Render.Fields Namespace