RhinoCommon API
FileObjWriteOptions Methods
The FileObjWriteOptions type exposes the following members.
Methods
Name | Description
GetTransform
 Calculates the transform combination of ZToY and any the translation that might occur in a SavewithOrigin.
Top
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace