RhinoCommon API
ComponentFunctionInfo Methods
The ComponentFunctionInfo type exposes the following members.
Methods
Name | Description
Evaluate
 Evaluates the component with a set of arguments. There needs to be an argument for each input param, and each output param gives an entry in the output array.
Invoke
 Runs Evaluate(IEnumerable, Boolean, String[]) with keepTree equal to false, and raises an exception on the first warning.
InvokeKeepTree
 Runs Evaluate(IEnumerable, Boolean, String[]) with keepTree equal to true and raises an exception on the first warning.
InvokeKeepTreeSilenceWarnings
 Runs Evaluate(IEnumerable, Boolean, String[]) with keepTree equal to true, and discards warnings (this is a dangerous operation!).
InvokeSilenceWarnings
 Runs Evaluate(IEnumerable, Boolean, String[]) with keepTree equal to false, then simplifies output with SimplifyTreeOutput(Object[], String[], Boolean) and discards warnings (this is a dangerous operation!).
ToString
 Returns a string representing this function.
 (Overrides Object.ToString().)
Top
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace