RhinoCommon API
ColorGradient Methods
The ColorGradient type exposes the following members.
Methods
Name | Description
Duplicate
 Create a duplicate of this color gradient.
GetColorStops
 Get sorted list of colors / positions that a gradient is defined over
SetColorStops
 Set color stops for the gradient
Top
See Also
Reference
ColorGradient Class
Rhino.Display Namespace