RhinoCommon API
DisplayPointSet Methods
The DisplayPointSet type exposes the following members.
Methods
Name | Description
Create
Dispose
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
DisplayPointSet Class
Rhino.Display Namespace