RhinoCommon API
StdVectorByte Methods
The StdVectorByte type exposes the following members.
Methods
Name | Description
ConstPointer
 Gets the constant (immutable) pointer of this vector.
CopyTo
 Copies the contents of a StdVectorByte into another StdVectorByte.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Memory
 Return the raw data.
NonConstPointer
 Gets the non-constant pointer (for modification) of this vector.
ToArray
 Returns the managed counterpart of the unmanaged array.
Top
See Also
Reference
StdVectorByte Class
Rhino.Runtime.InteropWrappers Namespace