RhinoCommon API
File3dmGroupTable Methods
The File3dmGroupTable type exposes the following members.
Methods
Name | Description
AddGroup
 Adds a new empty group to the group table.
FindIndex
 Retrieves a Group object based on an index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds a Group given its name.
FindNameHash
 Finds a Group given its name hash.
GroupMembers
 Gets an array of all of the objects in a group.
Top
See Also
Reference
File3dmGroupTable Class
Rhino.FileIO Namespace