RhinoCommon API
UserInterfaceSlider Methods
The UserInterfaceSlider type exposes the following members.
Methods
Name | Description
OnValueChanged
 Called when the slider's value changes. The default implementation calls the ValueChanged event
ValueAsFormattedString
 Formatted string shown based on value and digit precision
Top
See Also
Reference
UserInterfaceSlider Class
Rhino.UI Namespace