RhinoCommon API
MeshFaceNormalList Methods
The MeshFaceNormalList type exposes the following members.
Methods
Name | Description
AddFaceNormal(Vector3d)
 Appends a face normal to the list of mesh face normals.
AddFaceNormal(Vector3f)
 Appends a face normal to the list of mesh face normals.
AddFaceNormal(Double, Double, Double)
 Appends a face normal to the list of mesh face normals.
AddFaceNormal(Single, Single, Single)
 Appends a face normal to the list of mesh face normals.
Clear
 Clears the Face Normal list on the mesh.
ComputeFaceNormals
 Computes all the face normals for this mesh based on the physical shape of the mesh.
Destroy
 Releases all memory allocated to store face normals. The list capacity will be 0 after this call.
Subsequent calls can add new items.
GetEnumerator
 Gets an enumerator that yields all normals (vectors) in this collection.
SetFaceNormal(Int32, Vector3d)
 Sets a face normal vector at an index using a single-precision vector.
SetFaceNormal(Int32, Vector3f)
 Sets a face normal vector at an index using a single-precision vector.
SetFaceNormal(Int32, Double, Double, Double)
 Sets a face normal vector at an index using three double-precision numbers.
SetFaceNormal(Int32, Single, Single, Single)
 Sets a face normal vector at an index using three single-precision numbers.
UnitizeFaceNormals
 Unitizes all the existing face normals.
Top
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace