RhinoCommon API
FileXaml Methods
The FileXaml type exposes the following members.
Methods
Name | Description
Write
Write a Xaml file based on the contents of a RhinoDoc
Top
See Also
Reference
FileXaml Class
Rhino.FileIO Namespace