RhinoCommon API
PolyCurve Methods
The PolyCurve type exposes the following members.
Methods
Name | Description
Append(Arc)
 Appends and matches the start of the arc to the end of polycurve. This function will fail if the polycurve is closed or if SegmentCount > 0 and the arc is closed.
Append(Curve)
 Appends and matches the start of the curve to the end of polycurve. This function will fail if the PolyCurve is closed or if SegmentCount > 0 and the new segment is closed.
Append(Line)
 Appends and matches the start of the line to the end of polycurve. This function will fail if the polycurve is closed.
AppendSegment
 Appends the curve to the polycurve without changing the new segment's geometry. This function will fail if the PolyCurve is closed or if SegmentCount > 0 and the new segment is closed.
CleanUp
 Removes any nesting of polycurves. If this polycurve has just a single segment, the segment is returned. If, after nest removal, there are adjacent segments which are polylines, they are combined into a single polyline. The new curve may have a different domain from this polycurve. If the start and end segments of a closed input are polylines, the result may have a different seam location since the start and end segments will be combined.
Duplicate
 Duplicates this polycurve.
When not overridden in a derived class, this calls DuplicatePolyCurve().
 (Overrides Curve.Duplicate().)
DuplicatePolyCurve
 Duplicates this polycurve.
This is the same as Duplicate().
Explode
 Explodes this PolyCurve into a list of Curve segments. This will not explode nested polycurves. Call RemoveNesting() first if you need all individual segments.
PolyCurveParameter
 Converts a segment curve parameter to a polycurve parameter.
RemoveNesting
 Explodes nested polycurve segments and reconstructs this curve from the shattered remains. The result will have not have any PolyCurves as segments but it will have identical locus and parameterization.
SegmentCurve
 Gets the segment curve at the given index.
SegmentCurveParameter
 Converts a polycurve parameter to a segment curve parameter.
SegmentDomain
 Returns the polycurve sub-domain assigned to a segment curve.
SegmentIndex
 Finds the segment used for evaluation at polycurve_parameter.
SegmentIndexes
Finds the segments that overlap the Polycurve sub domain.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The NURBS Curves segments do not have fully multiple interior knots.
 3. Rational NURBS curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent co-linear or co-circular segments are combined.
Top
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace