RhinoCommon API
AsyncRenderContext Methods
The AsyncRenderContext type exposes the following members.
Methods
Name | Description
DeleteThis
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
JoinRenderThread
 Join the render thread, then set to null;
StartRenderThread
 Start a new render thread with given function.
StopRendering
 Override StopRendering if you need to do additional tasks besides having Cancel set to true. Note: you should always base.StopRendering() in your overriding implementation.
Top
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace