RhinoCommon API
PostEffectJob Methods
The PostEffectJob type exposes the following members.
Methods
Name | Description
Clone
Dispose()
Dispose(Boolean)
Execute
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
PostEffectJob Class
Rhino.Render.PostEffects Namespace