RhinoCommon API
Hatch Methods
The Hatch type exposes the following members.
Methods
Name | Description
Create(Curve, Int32, Double, Double) |  Obsolete.
 Constructs an array of hatches from one curve.
Create(IEnumerable<Curve>, Int32, Double, Double) |  Obsolete.
 Constructs an array of hatches from a set of curves.
Create(Curve, Int32, Double, Double, Double)
 Constructs an array of hatches from one curve.
Create(IEnumerable<Curve>, Int32, Double, Double, Double)
 Constructs an array of hatches from a set of curves.
Create(Plane, Curve, IEnumerable<Curve>, Int32, Double, Double)
 Create a hatch with a given set of outer and inner loops
CreateDisplayGeometry
 Generate geometry that would be used to draw the hatch with a given hatch pattern
CreateFromBrep
 Create a hatch from a planar face of a Brep
Explode
 Decomposes the hatch pattern into an array of geometry.
Get2dCurves
 Gets 2d curves that define the boundaries of the hatch
Get3dCurves
 Gets 3d curves that define the boundaries of the hatch
GetGradientFill
 Get gradient fill information for this hatch. If the "GradientType" for the fill is None, then this hatch doesn't have any gradient fill.
ScalePattern
 Scale the hatch's pattern
SetGradientFill
ToBrep
 Constructs a Brep representation of this hatch.
Top
See Also
Reference
Hatch Class
Rhino.Geometry Namespace