RhinoCommon API
CurvatureAnalysisSettings Methods
The CurvatureAnalysisSettings type exposes the following members.
Methods
Name | Description
CalculateCurvatureAutoRange
CalculateCurvatureMaxRange
 Calculates the full range of curvature values found on the analysis meshes. On success the range is written to the range of settings that matches settings.Style.
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
RestoreDefaults
 Commits the default settings as the current settings.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace