RhinoCommon API
IShrinkWrapService Methods
Methods
Name | Description
ShrinkWrap(IEnumerable<Mesh>, ShrinkWrapParameters)
 Create mesh from input meshes. Null on error or incompatible settings
ShrinkWrap(Mesh, ShrinkWrapParameters)
 Create a shrinkwrap from a single mesh Null on error or incompatible settings
ShrinkWrap(PointCloud, ShrinkWrapParameters)
 Create mesh from point cloud input. Null on error or incompatible settings
ShrinkWrap(IEnumerable<GeometryBase>, ShrinkWrapParameters, MeshingParameters)
 Create a mesh from a collection of geometry base objects Null on error or incompatible settings
ShrinkWrap(IEnumerable<Mesh>, ShrinkWrapParameters, CancellationToken)
 Create mesh from input meshes. Null on error or incompatible settings
ShrinkWrap(Mesh, ShrinkWrapParameters, CancellationToken)
 Create a shrinkwrap from a single mesh Null on error or incompatible settings
ShrinkWrap(PointCloud, ShrinkWrapParameters, CancellationToken)
 Create mesh from point cloud input. Null on error or incompatible settings
ShrinkWrap(IEnumerable<GeometryBase>, ShrinkWrapParameters, MeshingParameters, CancellationToken)
 Create a mesh from a collection of geometry base objects Null on error or incompatible settings
Top
See Also
Reference
IShrinkWrapService Interface
Rhino.Runtime Namespace