RhinoCommon API
IndexPair Methods
The IndexPair type exposes the following members.
Methods
Name | Description
Contains
 Determines whether the IndexPair contains a specific value.
CopyTo
 Copies the elements of the IndexPair to an Array, starting at a particular Array index.
GetEnumerator
 Gets an enumerator that goes over I and J, in this order.
IndexOf
 Determines the index of a specific item in IndexPair.
Top
See Also
Reference
IndexPair Structure
Rhino Namespace