RhinoCommon API
IPanelsService Methods
The IPanelsService type exposes the following members.
Methods
Name | Description
CreateDockBar
DestroyNativeWindow
DockBarIdInUse
DockBarIsVisible
FactoryResetSettings
Float
ResizeFloating
SetF1Hook
ShowDockBar
StartDraggingDockBar
SupportedType
ToggleDocking
UnhookDeleteAndDestroyDockBar
Top
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace