RhinoCommon API
FileTypeList Methods
The FileTypeList type exposes the following members.
Methods
Name | Description
AddFileType(String, IEnumerable<String>)
AddFileType(String, String)
AddFileType(String, IEnumerable<String>, Boolean)
AddFileType(String, String, Boolean)
AddFileType(String, String, String)
AddFileType(String, String, String, Boolean)
Top
See Also
Reference
FileTypeList Class
Rhino.PlugIns Namespace