RhinoCommon API
SimpleArrayBinaryArchiveReader Methods
The SimpleArrayBinaryArchiveReader type exposes the following members.
Methods
Name | Description
Add
 Adds a new BinaryArchiveReader at the end of this array.
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Get
 Get the BinaryArchiveReader at index.
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
Top
See Also
Reference
SimpleArrayBinaryArchiveReader Class
Rhino.Runtime.InteropWrappers Namespace