RhinoCommon API
File3dmHatchPatternTable Methods
The File3dmHatchPatternTable type exposes the following members.
Methods
Name | Description
FindIndex
 Retrieves a HatchPattern object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds a HatchPattern given its name.
FindNameHash
 Finds a HatchPattern given its name hash.
Top
See Also
Reference
File3dmHatchPatternTable Class
Rhino.FileIO Namespace