RhinoCommon API
FileUsdWriteOptions Methods
The FileUsdWriteOptions type exposes the following members.
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to Export(String, ArchivableDictionary)
Top
See Also
Reference
FileUsdWriteOptions Class
Rhino.FileIO Namespace