RhinoCommon API
FreeFloatingBase Methods
The FreeFloatingBase type exposes the following members.
Methods
Name | Description
CopyFrom
 Copy from another object
Finalize
 Handle destruction of the un-managed CPP object.
 (Overrides Object.Finalize().)
Top
See Also
Reference
FreeFloatingBase Class
Rhino.Render Namespace