RhinoCommon API
RenderTexture Methods
The RenderTexture type exposes the following members.
Methods
Name | Description
CreateEvaluator() |  Obsolete.
 Constructs a texture evaluator. This is an independent lightweight object capable of evaluating texture color throughout uvw space. May be called from within a rendering shade pipeline.
CreateEvaluator(RenderTexture.TextureEvaluatorFlags)
 Constructs a texture evaluator. This is an independent lightweight object capable of evaluating texture color throughout uvw space. May be called from within a rendering shade pipeline.
GenerateTextureSimulation
GetDisplayInViewport
GetEnvironmentMappingMode
GetEnvironmentMappingProjection
GetInternalEnvironmentMappingMode
GetLocalMappingType
GetMappingChannel
GetOffset
 Get offset value across UVW space. If the projection type is WCS or other type specified in model units, then this is the offset in meters.
GetOffsetLocked
GetPreviewIn3D
GetPreviewLocalMapping
GetProceduralAaltonenNoiseArrayPointer
GetProceduralAaltonenNoiseArraySize
GetProceduralImpulseNoiseArrayPointer
GetProceduralImpulseNoiseArraySize
GetProceduralPerlinNoiseArrayPointer
GetProceduralPerlinNoiseArraySize
GetProceduralVcNoiseArrayPointer
GetProceduralVcNoiseArraySize
GetProjectionMode
GetRepeat
 Get repeat value across UVW space. If the projection type is WCS or other type specified in model units, then this is the repeat across 1 meter of the model.
GetRepeatLocked
GetRotation
GetWcsBoxMapping
GetWrapType
GraphInfo
IsHdrCapable
 Return true if the texture is HDR capable. When creating a custom RenderTexture implementation that is HDR capable set the appropriate property on the CustomRenderContentAttribute decorator on that clas.
IsImageBased
 Query if the texture is image based. When creating a custom RenderTexture implementation of an image-based texture set the appropriate property on the CustomRenderContentAttribute decorator on that class. Do not override this function
IsLinear
 Return true if the texture color data is linear. NOTE: this function is marked as virtual, but the correct way to make a custom RenderTexture linear is by setting the correct property for the CustomRenderContentAttribute decorator on the class.
IsNormalMap
 Return true if the texture is a normalmap. When creating a custom RenderTexture implementation of a normal map set the appropriate property on the CustomRenderContentAttribute decorator on that clas.
NewBitmapTexture(SimulatedTexture) |  Obsolete.
 Constructs a new basic texture from a SimulatedTexture.
NewBitmapTexture(Bitmap, RhinoDoc)
 Constructs a new basic texture from a Bitmap.
NewBitmapTexture(SimulatedTexture, RhinoDoc)
 Constructs a new basic texture from a SimulatedTexture.
PixelSize
 Get the texture dimensions for the RenderTexture.
SaveAsImage
 Save texture as image
SetDisplayInViewport(Boolean)
SetDisplayInViewport(Boolean, RenderContent.ChangeContexts)
SetEnvironmentMappingMode(TextureEnvironmentMappingMode)
SetEnvironmentMappingMode(TextureEnvironmentMappingMode, RenderContent.ChangeContexts)
SetGraphInfo
SetMappingChannel
SetOffset
 Set offset value across UVW space. If the projection type is WCS or other type specified in model units, then this is the offset in meters.
SetOffsetLocked
SetPreviewIn3D
SetPreviewLocalMapping(Boolean)
SetPreviewLocalMapping(Boolean, RenderContent.ChangeContexts)
SetProjectionMode
SetRepeat
 Set repeat value across UVW space. If the projection type is WCS or other type specified in model units, then this is the repeat across 1 meter of the model.
SetRepeatLocked
SetRotation
SetWrapType
SimulatedTexture
SimulateTexture(SimulatedTexture, Boolean) |  Obsolete.
SimulateTexture(SimulatedTexture, RenderTexture.TextureGeneration, Int32, RhinoObject)
Top
See Also
Reference
RenderTexture Class
Rhino.Render Namespace