RhinoCommon API
DisplayPen Methods
The DisplayPen type exposes the following members.
Methods
Name | Description
Duplicate
 Create a duplicate of this display pen.
FromLinetype(Linetype, Color)
 Create a display pen that matches a linetype definition on any viewport.
FromLinetype(Linetype, Color, Double)
 Create a display pen that matches a linetype definition
PatternAsArray
 Get the pattern for this pen as an array of dash,gap,dash,gap... values
SetPattern
 Set pattern to apply for a stroke.
SetTaper
 Positions and thickness at those positions along a curve that define a taper.
TaperAsArray
 Collection of positions and thicknesses at those positions to define a taper Rhino currently only supports either no taper or a single taper. An array is used here in case Rhino supports multiple taper values in the future.
Top
See Also
Reference
DisplayPen Class
Rhino.Display Namespace