RhinoCommon API
ContentUI Methods
The ContentUI type exposes the following members.
Methods
Name | Description
ContentUIHolder
 Returns the holder that contains the UI sections, if this is an expandable content UI with sections inside holders. Returns null for custom UIs.
Dispose
EditorUuid
 Get the unique identifier of the editor that the UI is being displayed in.
Finalize
 ContentUI destructor
 (Overrides Object.Finalize().)
IsCreated
 Returns true if the UI is created, else false
IsShown
 Returns true if the UI is being shown, else false
Uuid
 Get the unique identifier of the UI.
Top
See Also
Reference
ContentUI Class
Rhino.UI.Controls Namespace