RhinoCommon API
FileSettings Methods
The FileSettings type exposes the following members.
Methods
Name | Description
AddSearchPath
 Adds a new imagePath to Rhino's search imagePath list. See "Options Files settings" in the Rhino help file for more details.
AutoSaveBeforeCommands
Input list of commands that force AutoSave prior to running.
DefaultTemplateFolderForLanguageID
 Returns the default template folder for a given language id.
DeleteSearchPath
 Removes an existing imagePath from Rhino's search imagePath list. See "Options Files settings" in the Rhino help file for more details.
FindFile
 Searches for a file using Rhino's search imagePath. Rhino will look for a file in the following locations: 1. The current document's folder. 2. Folder's specified in Options dialog, File tab. 3. Rhino's System folders.
GetCurrentState
 Returns the current state.
GetDataFolder
 Gets the data folder for machine or current user.
GetDefaultState
 Returns the default state.
GetSearchPaths
 Returns all of the imagePath items in Rhino's search imagePath list. See "Options Files settings" in the Rhino help file for more details.
RecentlyOpenedFiles
 Returns a list of recently opened files. Note that this function does not check to make sure that these files still exist.
SetAutoSaveBeforeCommands
Set list of commands that force AutoSave prior to running.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace