RhinoCommon API
FactoryBase Methods
The FactoryBase type exposes the following members.
Methods
Name | Description
Finalize
 Finalizer
 (Overrides Object.Finalize().)
Get
 Override this method to return a new instance of your class for the given ID
Register()
 Call this function during startup of current assembly to load classes with factory creation support are registed
Register(PlugIn)
 Call this function during the startup of your plug-in to ensure that all classes that support factory creation are registed
Top
See Also
Reference
FactoryBase Class
Rhino.UI.Controls Namespace