RhinoCommon API
FileSW Methods
The FileSW type exposes the following members.
Methods
Name | Description
Read
Read a .sldprt or .sldasm file into a RhinoDoc
Top
See Also
Reference
FileSW Class
Rhino.FileIO Namespace