RhinoCommon API
UndoRecordEntry Methods
The UndoRecordEntry type exposes the following members.
Methods
Name | Description
ToString
 Returns Description.
 (Overrides Object.ToString().)
Top
See Also
Reference
UndoRecordEntry Class
Rhino Namespace