RhinoCommon API
NamedParametersEventArgs Methods
The NamedParametersEventArgs type exposes the following members.
Methods
Name | Description
Dispose
 Dispose native resources
Finalize
 Finalizer in case Dispose wasn't called
 (Overrides Object.Finalize().)
Set(String, Arc)
 Set an arc for the specified key
Set(String, GeometryBase)
 Set geometry for a given key name
Set(String, Line)
 Set a line for the specified key
Set(String, MeshingParameters)
 Set an MeshingParameters for the specified key
Set(String, Plane)
 Set a plane for the specified key
Set(String, Point3d)
 Set a Point3d value for a given key name
Set(String, Point3d[])
 Set a point array for the specified key
Set(String, Vector3d)
 Set a Vector3d value for a given key name
Set(String, Boolean)
 Set a bool value for a given key name
Set(String, IEnumerable<ObjRef>)
 Set a list of ObjRef instances as a value for a given key name
Set(String, IEnumerable<GeometryBase>)
 Set a list of geometry for a given key name
Set(String, IEnumerable<Guid>)
 Set a list of UUIDs as a value for a given key name
Set(String, IEnumerable<String>)
 Set a list of strings as a value for a given key name
Set(String, IEnumerable<UInt32>)
 Set a list of uint as a value for a given key name
Set(String, Double)
 Set a double value for a given key name
Set(String, Color)
 Set a Color value for a given key name
Set(String, Point)
 Set a Point value for a given key name
Set(String, Guid)
 Set a Color value for a given key name
Set(String, Int32)
 Set an int value for a given key name
Set(String, String)
 Set a string value for a given key name
Set(String, UInt32)
 Set an unsigned int for a given key name
SetWindowHandle
 Set a HWND on Windows or NSView* on Mac
SetWindowImageHandle
 Set a HWND on Windows or NSView* on Mac
TryGetArc
 Get a arc for the specified key
TryGetBool
 Try to get a bool value for a given key name
TryGetColor
 Try to get a Color value for a given key name
TryGetDouble
 Try to get a double value for a given key name
TryGetGeometry
TryGetGuid
 Try to get a Color value for a given key name
TryGetGuids
 Try to get a UUID array value for a given key name
TryGetInt
 Try to get an int value for a given key name
TryGetLine
 Get a line for the specified key
TryGetMeshParameters
 Get an MeshingParameters for the specified key
TryGetObjRefs
 Try to get an array of ObjRef instances for a given key name
TryGetPlane
 Get a plane for the specified key
TryGetPoint
 Try to get a Point3d value for a given key name
TryGetPoint2i
 Try to get a Point value for a given key name
TryGetPoints
 Gets a point array for the specified key
TryGetRhinoObjects
 Get array of RhinoObject for the specified key
TryGetString
 Try to get a string value for a given key name
TryGetStrings
 Try to get a string array for a given key name
TryGetUints
 Try to get a uint array value for a given key name
TryGetUnmangedPointer
 Gets a HWND on Windows or NSVIew* on Mac
TryGetUnsignedInt
 Try to get an unsigned int for a given key name
TryGetVector
 Try to get a Vector3d value for a given key name
TryGetViewport
 Try to get a viewport for a given key name
TryGetWindowHandle
 Gets a HWND on Windows or NSVIew* on Mac
TryGetWindowImageHandle
 Gets a HWND on Windows or NSVIew* on Mac
Top
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace