RhinoCommon API
EmapAnalysisSettings Methods
The EmapAnalysisSettings type exposes the following members.
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultFileNames
 Get list of emap's Default MRU filenames
GetDefaultState
 Gets the factory settings of the application.
GetFileNames
 Get available list of emap filenames
SetFileNames
 Set available list of emap filenames
Top
See Also
Reference
EmapAnalysisSettings Class
Rhino.ApplicationSettings Namespace