RhinoCommon API
PlugInInfo Methods
The PlugInInfo type exposes the following members.
Methods
Name | Description
Icon
 Returns the plug-in's icon in bitmap form.
IsLoadProtected
 Returns the load protection state for a plug-in
Top
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace