RhinoCommon API
Text3d Methods
The Text3d type exposes the following members.
Methods
Name | Description
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Top
See Also
Reference
Text3d Class
Rhino.Display Namespace