RhinoCommon API
PostEffectCollection Methods
The PostEffectCollection type exposes the following members.
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Dispose
Finalize |  (Overrides FreeFloatingBase.Finalize().)
GetEnumerator
GetSelectedPostEffect
 Gets the selected post effect for a certain type into 'id'. Returns true if successful or false if the selection information could not be found.
MovePostEffectBefore
 Move a post effect before another post effect in the list. Param 'id_move' is the id of the post effect to move. Param 'id_before' is the id of a post effect before which the post effect should be moved. If this is Guid.Empty, the post effect is moved to the end of the list. If the post effect identified by 'id_before' is not found, the method will fail. Returns true if successful, else false.
PostEffectDataFromId
 Get a post effect data for an id.
SetSelectedPostEffect
 Sets the selected post effect for a certain type.
Top
See Also
Reference
PostEffectCollection Class
Rhino.Render.PostEffects Namespace