RhinoCommon API
BrepFaceList Methods
The BrepFaceList type exposes the following members.
Methods
Name | Description
Add(Int32)
 Create and add a new face to this list. An incomplete face is added. The caller must create and fill in the loops used by the face.
Add(Surface)
 Add a new face to a brep. This creates a complete face with new vertices at the surface corners, new edges along the surface boundary, etc. The loop of the returned face has four trims that correspond to the south, east, north, and west side of the surface in that order. If you use this version of Add to add an exiting brep, then you are responsible for using a tool like JoinEdges() to hook the new face to its neighbors.
AddConeFace
 Add a new face to the brep whose surface geometry is a ruled cone with the edge as the base and the vertex as the apex point.
AddRuledFace
 Add a new face to the brep whose surface geometry is a ruled surface between two edges.
ClearPerFaceColors
 Removes all per face color overrides on the active level.
ExtractFace
 Extracts a face from a Brep.
Flip
 Flips the orientation of faces.
GetEnumerator
 Gets an enumerators that yields BrepFace objects.
RemoveAt
 Deletes a face at a specified index.
RemoveSlits
 Remove slit trims and slit boundaries from each face.
ShrinkFaces
 Shrinks all the underlying surfaces in this Brep. Sometimes the surfaces extend far beyond the trimming boundaries of the Brep Face. This function will remove those portions of the surfaces that are not used.
SplitBipolarFaces
 Splits surfaces with two singularities, like spheres, so the results have at most one singularity.
SplitClosedFaces
 Splits closed surfaces so they are not closed.
SplitFaceAtTangents(Int32)
 Splits the face of a Brep at tangent locations. The face surface will be split at locations of curvature discontinuities with constant tangents.
SplitFaceAtTangents(Int32, Boolean)
 Splits the face of a Brep at tangent locations. The face surface will be split at locations of curvature discontinuities with constant tangents.
SplitFacesAtTangents()
 Splits all of the faces of a Brep at tangent locations. The face surfaces will be split at locations of curvature discontinuities with constant tangents.
SplitFacesAtTangents(Boolean)
 Splits all of the faces of a Brep at tangent locations.
SplitKinkyFace
 Splits a single face into G1 pieces.
SplitKinkyFaces()
 Splits any faces with creases into G1 pieces.
SplitKinkyFaces(Double)
 Splits any faces with creases into G1 pieces.
SplitKinkyFaces(Double, Boolean)
 Splits any faces with creases into G1 pieces.
StandardizeFaceSurface
 Standardizes the relationship between a BrepFace and the 3d surface it uses. When done, the face will be the only face that references its 3d surface, and the orientations of the face and 3d surface will be the same.
StandardizeFaceSurfaces
Standardize all faces in the brep.
Top
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace