RhinoCommon API
GetString Methods
The GetString type exposes the following members.
Methods
Name | Description
Get
Returns the string that the user typed. By default, space stops the string input.
GetLiteralString
Returns the string that the user typed. By default, space does not stop input.
Top
See Also
Reference
GetString Class
Rhino.Input.Custom Namespace