RhinoCommon API
Sphere Methods
The Sphere type exposes the following members.
Methods
Name | Description
ClosestParameter
 Finds the angle parameters on this sphere that are closest to a test point.
ClosestPoint
 Returns point on sphere that is closest to given point.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
FitSphereToPoints
 Attempts to fit a sphere to a collection of points.
LatitudeDegrees
 Computes the parallel at a specific latitude angle.
The angle is specified in degrees.
LatitudeRadians
 Computes the parallel at a specific latitude angle.
The angle is specified in radians.
LongitudeDegrees
 Computes the meridian at a specific longitude angle.
The angle is specified in degrees.
LongitudeRadians
 Computes the meridian at a specific longitude angle.
The angle is specified in radians.
NormalAt
 Computes the normal at a specific angular location on the sphere.
PointAt
Evaluates the sphere at specific longitude and latitude angles.
Rotate(Double, Vector3d)
 Rotates the sphere about the center point.
Rotate(Double, Vector3d, Point3d)
 Rotates this sphere about a point and an axis.
Rotate(Double, Double, Vector3d)
 Rotates this sphere about the center point.
Rotate(Double, Double, Vector3d, Point3d)
 Rotates this sphere about a point and an axis.
ToBrep
 Converts this sphere is it Brep representation
ToNurbsSurface
 Converts this sphere to its NurbsSurface representation. This is synonymous with calling NurbsSurface.CreateFromSphere().
ToRevSurface
 Converts this Sphere to a RevSurface representation. This is synonymous with calling RevSurface.CreateFromSphere().
Transform
 Transforms this sphere. Note that non-similarity preserving transformations cannot be applied to a sphere as that would result in an ellipsoid.
Translate
 Moves this sphere along a motion vector.
Top
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace