RhinoCommon API
StringField Methods
The StringField type exposes the following members.
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
StringField Class
Rhino.Render.Fields Namespace