RhinoCommon API
PointObject Methods
The PointObject type exposes the following members.
Methods
Name | Description
DuplicatePointGeometry
Top
See Also
Reference
PointObject Class
Rhino.DocObjects Namespace