RhinoCommon API
SubDComponentParameter Methods
The SubDComponentParameter type exposes the following members.
Methods
Name | Description
CreateEdgeParameter
 Creates a parameter that identifies a surface point on a SubD edge.
CreateFaceParameter
 Creates a parameter that identifies a surface point inside a SubD face.
CreateVertexParameter
 Creates a parameter that identifies the surface point at a SubD vertex.
Equals(Object)
Indicates whether this instance and a specified object are equal.
 (Overrides ValueType.Equals(Object).)
Equals(SubDComponentParameter)
Indicates whether the current object is equal to another object of the same type.
GetHashCode
Returns the hash code for this instance.
 (Overrides ValueType.GetHashCode().)
ToString
Returns the fully qualified type name of this instance.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace