RhinoCommon API
RenderMeshProvider Methods
The RenderMeshProvider type exposes the following members.
Methods
Name | Description
Dispose()
 Dispose method
Dispose(Boolean)
 Dispose method. Note that you should only ever call Dispose if you explicitly registered this RenderMeshProvider using RegisterProvider If this provider was created using automatic registration, the Dispose function will thrown an exception.
Finalize
 Finalizer to ensure correctly implemented dispose pattern.
 (Overrides Object.Finalize().)
GetParameter
 Runtime access to specific parameters on for a given objectId relating to this primitive provider.
HasCustomRenderMeshes
 Determine if custom render primitives will be supplied for a particular object.
Progress
 Provides details on the progress of custom render meshes for a document or collection of objects
ProgressForAll
 Returns a complete list of progress reports for all providers for either the document or a collection of objects
RegisterProvider
 Register RenderMeshProvider without relying on the auto-plug-in registration.
RegisterProviders(PlugIn)
 Register RenderMeshProviders without relying on the auto-plug-in registration
RegisterProviders(Assembly, PlugIn)
 Register RenderMeshProviders without relying on the auto-plug-in registration
RenderMeshes
 Returns a complete set of custom render primitives for a given ObjectId.
SetParameter
Top
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace