RhinoCommon API
PageViewGroup Methods
The PageViewGroup type exposes the following members.
Methods
Name | Description
CopyAttributesFrom
 Copy attributes from another page view group.
DeleteAllUserStrings
DeleteUserString
GetMembers
 Get an array of all of the page views in this page view group.
GetUserString
 Gets user string from this component.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this component.
SetUserString
 Attach a user string (key,value combination) to this component.
Top
See Also
Reference
PageViewGroup Class
Rhino.DocObjects Namespace