RhinoCommon API
BitmapExtensions Methods
The BitmapExtensions type exposes the following members.
Methods
Name | Description
BitmapAsTextureFileReference
 Inserts bitmap into Rhino's texture manager and returns a FileReference.
ConvertToNormalMap
 Use this function to convert a System.Drawing.Bitmap from a bump to a normal texture
IsNormalMap
 Call this method to see if the DIB appears to be a normal map.
Top
See Also
Reference
BitmapExtensions Class
Rhino Namespace