RhinoCommon API
TransformCommand Methods
The TransformCommand type exposes the following members.
Methods
Name | Description
DuplicateObjects
ResetGrips
 Sets dynamic grip locations back to starting grip locations. This makes things like the Copy command work when grips are "copied".
SelectObjects(String, TransformObjectList)
 Selects objects within the command.
SelectObjects(String, ObjectType, TransformObjectList)
 Selects objects within the command.
TransformObjects
Top
See Also
Reference
TransformCommand Class
Rhino.Commands Namespace