RhinoCommon API
Ellipse Methods
The Ellipse type exposes the following members.
Methods
Name | Description
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
GetFoci
 Gets the foci. The foci are two points whose sum of distances from any point on the ellipse is always the same.
ToNurbsCurve
 Constructs a nurbs curve representation of this ellipse.
This is equivalent to calling NurbsCurve.CreateFromEllipse().
TryFitEllipseToPoints
 Attempt to fit an ellipse through a set of points.
Top
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace