RhinoCommon API
City Methods
The City type exposes the following members.
Methods
Name | Description
Cities
 Returns number of available cities.
CityAt
 Returns city at given index.
FindNearest
 Finds nearest city of specified input parameters.
Top
See Also
Reference
City Class
Rhino.Render Namespace