RhinoCommon API
OpenGLSettings Methods
The OpenGLSettings type exposes the following members.
Methods
Name | Description
GetCurrentState
 Gets the current settings.
GetDefaultState
 Gets the OpenGL factory settings.
RestoreDefaults
 Updates from the default setting state.
UpdateFromState
 Updates from a particular setting state.
Top
See Also
Reference
OpenGLSettings Class
Rhino.ApplicationSettings Namespace