RhinoCommon API
MetaDataProxy Methods
The MetaDataProxy type exposes the following members.
Methods
Name | Description
Dispose
 Dispose for MetaDataProxy
Finalize
 Destructor for MetaDataProxy
 (Overrides Object.Finalize().)
SetContentInstanceId
 Set Content instance id for meta data
Top
See Also
Reference
MetaDataProxy Class
Rhino.Render Namespace