RhinoCommon API
Linetype Methods
The Linetype type exposes the following members.
Methods
Name | Description
AddShape(Curve, Double)
 Add a curve shape to this linetype definition
AddShape(TextEntity, Double)
 Add text as a shape to this linetype definition
AppendSegment
Adds a segment to the pattern.
CommitChanges
CreateFromPatternString
 Creates a linetype from a pattern string. Values greater than zero represent line segments, and values less than or equal to zero represents space segments.
Default
 Set linetype to default settings.
DeleteAllUserStrings
DeleteUserString
DuplicateLinetype
 Duplicates a linetype, clears the name, id, and locked bits.
GetSegment
 Gets the segment information at a index.
GetTaperPoints
 Taper points are positions/width combinations along the length of a curve
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
PatternString
 Returns a string that represents the pattern of the linetype, which can be used in user interface. Values greater than zero represent line segments, and values less than or equal to zero represent space segments.
ReadFromFile
 Reads linetypes from either a Rhino .3dm file or an AutoCAD .lin file.
RemoveAllShapes
 Remove all shapes from this linetype
RemoveSegment
Removes a segment in the linetype.
RemoveTaper
 Remove taper information for stroke
SetSegment
Sets the length and type of the segment at index.
SetSegments
Set all segments.
SetTaper(Double, Double)
 Set taper to a simple start width / end width
SetTaper(Double, Point2d, Double)
 Set taper for this linetype width a single internal taper point
SetUserString
 Attach a user string (key,value combination) to this geometry.
Top
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace