RhinoCommon API
ContentHash Methods
The ContentHash type exposes the following members.
Methods
Name | Description
Clone
 Creates a copy of this content hash. Because content hash is immutable, this can be used as a deep copy.
CreateFromFile
 Creates a new ContentHash, representing the content of a file.
Equals(ContentHash)
 Determines if another content hash has the same value.
Equals(Object)
 Determines if another object is a content hash with same value.
 (Overrides Object.Equals(Object).)
GetHashCode
 Gets an hash code for this content hash. Two equal content hashes have equal hash code. The other way around might not be true.
 (Overrides Object.GetHashCode().)
Top
See Also
Reference
ContentHash Class
Rhino.FileIO Namespace