RhinoCommon API
LicenseData Methods
The LicenseData type exposes the following members.
Methods
Name | Description
Dispose
IsNotValid
 Indicates whether a LicenseData object is either null or invalid.
IsValid()
 Public validator.
IsValid(Boolean)
IsValid(LicenseData)
 Indicates whether a LicenseData object is not null and valid.
Top
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace