RhinoCommon API
ClippingPlaneSurface Methods
The ClippingPlaneSurface type exposes the following members.
Methods
Name | Description
AddClipViewportId
 Adds a viewport id to the list of viewports that this clipping plane clips.
ClearClipParticipationLists
 Remove list of object ids that this clipping plane surface clips. This causes the clipping plane surface to clip all objects
GetClipParticipation
RemoveClipViewportId
 Removes a viewport id that this being clipped by this clipping plane.
SetClipParticipation
 Set a list of specific object ids and layers that this clipping plane surface clips.
ViewportIds
 Returns the ids of RhinoViewport objects that are clipped by this clipping plane.
Top
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace