RhinoCommon API
OpenFileDialog Methods
The OpenFileDialog type exposes the following members.
Methods
Name | Description
ShowDialog |  Obsolete.
ShowOpenDialog
Show the actual dialog to allow the user to select a file.
Top
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace