RhinoCommon API
WorksessionFileLayerValues Methods
The WorksessionFileLayerValues type exposes the following members.
Methods
Name | Description
Dispose
Releases the native layer settings.
Finalize
Releases the native layer settings.
 (Overrides Object.Finalize().)
GetLayer
 Gets a copy of the rest of the layer's settings, saved by Rhino 9 and later. Reading an older file leaves this set to a default layer.
SetLayer
Replaces the layer settings with a copy of layer.
Top
See Also
Reference
WorksessionFileLayerValues Class
Rhino.FileIO Namespace