RhinoCommon API
Layer Methods
The Layer type exposes the following members.
Methods
Name | Description
CopyAttributesFrom
 Copy typical attributes from another layer
Default
 Sets layer to default settings.
DeleteAllUserStrings
DeleteModelVisible
 Remove any model visibility setting so the layer's global setting will be used for all viewports.
DeletePerViewportColor
 Remove any per viewport layer color setting so the layer's overall setting will be used for all viewports.
DeletePerViewportPlotColor
 Remove any per viewport layer plot color setting so the layer's overall setting will be used for all viewports.
DeletePerViewportPlotWeight
 Remove any per viewport layer plot weight setting so the layer's overall setting will be used for all viewports.
DeletePerViewportSettings
 Deletes per viewport layer settings.
DeletePerViewportVisible
 Remove any per viewport visibility setting so the layer's overall setting will be used for all viewports.
DeletePlotColor
 Removes the plot color for layer. The layer's color will be used for the plot color.
DeleteUserString
Equals(Layer)
Equals(Object) |  (Overrides Object.Equals(Object).)
GetChildren()
 Gets immediate children of this layer. Note that child layers may have their own children.
GetChildren(Boolean)
 Gets the children of this layer.
GetCustomSectionStyle
 Get an optional custom section style associated with these attributes.
GetDefaultLayerProperties
 Constructs a layer with the current default properties. The default layer properties are:
color = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerColor
line style = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerLineStyle
material index = -1
IGES level = -1
mode = NormalLayer
name = empty
layer index = 0 (ignored by AddLayer)
GetHashCode |  (Overrides Object.GetHashCode().)
GetLeafName(Layer)
 Get a layer name's "leaf" level name
GetLeafName(String)
 Get a layer name's "leaf" level name
GetParentName(Layer)
 Get a layer's "parent" path name
GetParentName(String)
 Get a layer's "parent" path name
GetPersistentLocking
 The persistent locking setting is used for layers that can be locked by a "parent" object. A common case is when a layer is a child layer (Layer.ParentI is not nil). In this case, when a parent layer is locked, then child layers are also locked. The persistent locking setting determines what happens when the parent is unlocked again.
GetPersistentVisibility
 The global persistent visibility setting is used for layers whose visibility can be changed by a "parent" object. A common case is when a layer is a child layer (ParentId is not nil). In this case, when a parent layer is turned off, then child layers are also turned off. The persistent visibility setting determines what happens when the parent is turned on again.
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
HasPerViewportSettings
 Verifies that a layer has per viewport settings.
HasSelectedObjects
 Returns true if the layer has one or more selected Rhino objects.
IsChildOf(Guid)
IsChildOf(Int32)
IsChildOf(Layer)
IsParentOf(Guid)
IsParentOf(Int32)
IsParentOf(Layer)
ParentLayer
 Returns parent of a layer.
PerViewportColor
 Gets the display color for this layer.
PerViewportIsVisible
 Gets the per viewport visibility of this layer.
PerViewportPersistentVisibility
 Gets the per layer persistent visibility. The persistent viability setting is used for layers whose visibility can be changed by a parent layer. In this case, when a parent layer is turned off, then child layers are also turned off. The persistent visibility setting determines what happens when the parent is turned on again.
PerViewportPlotColor
 Gets the plot color for this layer.
PerViewportPlotWeight
 Gets the plot weight, in millimeters, for this layer.
RemoveCustomSectionStyle
SetCustomSectionStyle
SetPersistentLocking
 Set the persistent locking setting for this layer
SetPersistentVisibility
 Set the global persistent visibility setting for this layer.
SetPerViewportColor
 Sets the display color for this layer.
SetPerViewportPersistentVisibility
 Sets the per layer persistent visibility. The persistent viability setting is used for layers whose visibility can be changed by a parent layer. In this case, when a parent layer is turned off, then child layers are also turned off. The persistent visibility setting determines what happens when the parent is turned on again.
SetPerViewportPlotColor
 Sets the plot color for this layer.
SetPerViewportPlotWeight
 Sets the plot weight, in millimeters, for this layer.
SetPerViewportVisible
 Controls layer visibility in specific viewports.
SetUserString
 Attach a user string (key,value combination) to this geometry.
ToString |  (Overrides ModelComponent.ToString().)
UnsetModelPersistentVisibility
 Remove any model persistent visibility setting from this layer.
UnsetPersistentLocking
 Remove any explicitly persistent locking settings from this layer
UnsetPersistentVisibility
 Remove any explicit persistent visibility setting from this layer
UnsetPerViewportPersistentVisibility
 Remove any per viewport persistent visibility setting so the layer's overall setting will be used for all viewports.
Top
See Also
Reference
Layer Class
Rhino.DocObjects Namespace