RhinoCommon API
IUserInterfaceSection Methods
The IUserInterfaceSection type exposes the following members.
Methods
Name | Description
OnUserInterfaceSectionExpanding
 The UserInterfaceSection object that called this interface method.
UserInterfaceDisplayData
 Called by UserInterfaceSection when the selected content changes or a content field property value changes.
Top
See Also
Reference
IUserInterfaceSection Interface
Rhino.Render.UI Namespace