RhinoCommon API
ThumbData Methods
The ThumbData type exposes the following members.
Methods
Name | Description
GetPreviewHeigth
GetPreviewWidth
Top
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace