RhinoCommon API
File3dmDimStyleTable Methods
The File3dmDimStyleTable type exposes the following members.
Methods
Name | Description
FindIndex
 Retrieves a DimensionStyle object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds a DimensionStyle given its name.
FindNameHash
 Finds a DimensionStyle given its name hash.
Top
See Also
Reference
File3dmDimStyleTable Class
Rhino.FileIO Namespace