RhinoCommon API
PersistentSettingsConverter Methods
The PersistentSettingsConverter type exposes the following members.
Methods
Name | Description
IsStringDictionary
 Determines if the string value is formatted as a key value pair string list.
IsStringList
 Determines if the string value is formatted as a string list.
ToString(Double)
 Converts a double value to a string.
ToString(KeyValuePair<String, String>[])
 Converts a key value string pair array to a properly formatted string dictionary XML string.
ToString(String[])
 Converts a string array to a properly formatted string list XML string.
TryParseDouble
 Converts the string representation of a number to its double-precision floating-point number equivalent. A return value indicates whether the conversion succeeded or failed. system culture.
TryParseEnum(Type, String, Int32)
 Converts an enumerated value name to its integer equivalent.
TryParseEnum(Type, String, String)
 Converts an enumerated value string (integer as string) to a enumerated value name.
TryParseStringDictionary
 Attempts to convert a string to a key value string pair array.
TryParseStringList
 Attempts to convert a string to a string value list.
Top
See Also
Reference
PersistentSettingsConverter Class
Rhino Namespace