RhinoCommon API
LicenseLease Methods
The LicenseLease type exposes the following members.
Methods
Name | Description
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace