RhinoCommon API
Ray3d Methods
The Ray3d type exposes the following members.
Methods
Name | Description
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Ray3d and has the same values as the present ray.
 (Overrides ValueType.Equals(Object).)
Equals(Ray3d)
 Determines whether the specified Ray3d has the same value as the present ray.
GetHashCode
 Computes a hashing number that represents the current ray.
 (Overrides ValueType.GetHashCode().)
PointAt
 Evaluates a point along the ray.
Top
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace