RhinoCommon API
GuidField Methods
The GuidField type exposes the following members.
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
GuidField Class
Rhino.Render.Fields Namespace