RhinoCommon API
PersistentSettingsSavedEventArgs Methods
The PersistentSettingsSavedEventArgs type exposes the following members.
Methods
Name | Description
CommandSettings
 The new command settings
Top
See Also
Reference
PersistentSettingsSavedEventArgs Class
Rhino Namespace