RhinoCommon API
FileCsv Methods
The FileCsv type exposes the following members.
Methods
Name | Description
Write
Write a Csv file based on the contents of a RhinoDoc
Top
See Also
Reference
FileCsv Class
Rhino.FileIO Namespace