RhinoCommon API
File3dsWriteOptions Methods
The File3dsWriteOptions type exposes the following members.
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
File3dsWriteOptions Class
Rhino.FileIO Namespace