RhinoCommon API
File3dmRenderEnvironments Methods
The File3dmRenderEnvironments type exposes the following members.
Methods
Name | Description
Find
 Finds an environment by its id, if possible. Returns null on failure.
GetEnumerator
Top
See Also
Reference
File3dmRenderEnvironments Class
Rhino.FileIO Namespace