RhinoCommon API
FileCd Methods
The FileCd type exposes the following members.
Methods
Name | Description
Write
Write a CD file based on the contents of a RhinoDoc
Top
See Also
Reference
FileCd Class
Rhino.FileIO Namespace