RhinoCommon API
PurgeStatistics Methods
The PurgeStatistics type exposes the following members.
Methods
Name | Description
PurgedCount
 The number of table objects that were purged.
Top
See Also
Reference
PurgeStatistics Class
Rhino Namespace