RhinoCommon API
GetTransform Methods
The GetTransform type exposes the following members.
Methods
Name | Description
AddTransformObjects
 Adds any objects you want transformed and grips you want transformed. Make sure no duplicates are in the list and that no grip owners are passed in as objects.
CalculateTransform
 Retrieves the final transformation.
Override this virtual function to provide your own custom transformation method.
GetXform
 Gets the Transformation.
Call this after having set up options and so on.
Top
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace