RhinoCommon API
RdkSelectionNavigator Methods
The RdkSelectionNavigator type exposes the following members.
Methods
Name | Description
Add
 Add a selection of contents at the current position. Clears the navigator ahead of the current position.
CanGoBackwards
 Check the backwards status of the navigator
CanGoForwards
 Check the forwards status of the navigator
Clear
 Clear the navigator.
Dispose
Finalize |  (Overrides Object.Finalize().)
GoBackwards
 Navigate backwards if possible
GoForwards
 Navigate forwards if possible
Top
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace