RhinoCommon API
OptionsDialogPage Methods
The OptionsDialogPage type exposes the following members.
Methods
Name | Description
RunScript
Top
See Also
Reference
OptionsDialogPage Class
Rhino.UI Namespace