RhinoCommon API
Centermark Methods
The Centermark type exposes the following members.
Methods
Name | Description
AdjustFromPoints
 Update dimension geometry from point locations.
Create(DimensionStyle, Plane, Curve, Double)
Creates a new center mark dimension.
Create(DimensionStyle, Plane, Point3d, Double)
Creates a new center mark dimension.
Top
See Also
Reference
Centermark Class
Rhino.Geometry Namespace