RhinoCommon API
SubDVertex Methods
The SubDVertex type exposes the following members.
Methods
Name | Description
ClearSavedSubdivisionPoints
 Discards the cached subdivision and surface points for this vertex, so they are recomputed on next use.
ComponentIndex
 Gets the component index of this vertex.
EdgeAt
 Retrieve a SubDEdge from this vertex
FaceAt
 Retrieve a SubDFace from this vertex
SetControlNetPoint
 Change the location of the "control net" point that this SubDVertex represents
SurfacePoint
 The SubD surface point
Top
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace