RhinoCommon API
ViewUserInterfaceTable Methods
The ViewUserInterfaceTable type exposes the following members.
Methods
Name | Description
Add(UserInterfaceObjectBase)
Add(UserInterfaceObjectBase, Guid)
Find<T>
Remove(IEnumerable<UserInterfaceObjectBase>)
Remove(UserInterfaceObjectBase)
RemoveByGroupId
Top
See Also
Reference
ViewUserInterfaceTable Class
Rhino.DocObjects.Tables Namespace