RhinoCommon API
RenderEnvironment Methods
The RenderEnvironment type exposes the following members.
Methods
Name | Description
NewBasicEnvironment(SimulatedEnvironment)
 Constructs a new RenderEnvironment from a SimulatedEnvironment.
NewBasicEnvironment(SimulatedEnvironment, RhinoDoc)
SimulateEnvironment(Boolean)
SimulateEnvironment(SimulatedEnvironment, Boolean)
Top
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace