RhinoCommon API
WorksessionModel Methods
The WorksessionModel type exposes the following members.
Methods
Name | Description
ToString
 Returns the model's alias, or its path when it has no alias.
 (Overrides Object.ToString().)
Top
See Also
Reference
WorksessionModel Class
Rhino.DocObjects Namespace