RhinoCommon API
MeshPrincipalCurvatureList Methods
The MeshPrincipalCurvatureList type exposes the following members.
Methods
Name | Description
Add
 Adds a new principal curvature to the end of the principal curvature list.
Clear
 Clears the principal curvature list on the mesh.
Destroy
 Releases all memory allocated to store principal curvatures. The list capacity will be 0 after this call.
Subsequent calls can add new items.
GetCurvatureStats
 Gets the mesh's curvature statistics.
GetEnumerator
 Gets an enumerator that yields all principal curvatures in this collection.
SetSurfaceCurvature
 Sets or adds a principal curvature to the principal curvature iist.
If [index] is less than [Count], the existing principal curvature at [index] will be modified.
If [index] equals [Count], a new principal curvature is appended to the end of the principal curvature list.
If [index] is larger than [Count], the function will return false.
Top
See Also
Reference
MeshPrincipalCurvatureList Class
Rhino.Geometry.Collections Namespace