RhinoCommon API
RenderContentKindList Methods
The RenderContentKindList type exposes the following members.
Methods
Name | Description
Add
 Add a kind to a kind list.
Contains
 Query whether or not the collection contains a particular kind designation.
Count
 The number of kinds in the collection
Dispose
 Dispose a kind list.
Finalize
 Kind list finalizer
 (Overrides Object.Finalize().)
SingleKind
 The single kind in the list. If the list does not contain exactly one kind, returns 'None'.
Top
See Also
Reference
RenderContentKindList Class
Rhino.Render Namespace