RhinoCommon API
BendSpaceMorph Methods
The BendSpaceMorph type exposes the following members.
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
MorphPoint
Morphs an Euclidean point.
 (Overrides SpaceMorph.MorphPoint(Point3d).)
Top
See Also
Reference
BendSpaceMorph Class
Rhino.Geometry.Morphs Namespace