RhinoCommon API
FileGHS Methods
The FileGHS type exposes the following members.
Methods
Name | Description
Read
Read a Ghs file into a RhinoDoc
Top
See Also
Reference
FileGHS Class
Rhino.FileIO Namespace