RhinoCommon API
Vector3f Operators and Type Conversions
The Vector3f type exposes the following members.
Operators
Name | Description
Addition(Point3f, Vector3f)
 Sums up a point and a vector, and returns a new point.
Addition(Vector3f, Vector3f)
 Sums up two vectors.
Division(Vector3f, Double)
 Divides a Vector3f by a number, having the effect of shrinking it, t times.
Division(Vector3f, Single)
 Divides a Vector3f by a number, having the effect of shrinking it, t times.
Equality
 Determines whether two vectors have equal values.
Explicit(Vector3d to Vector3f)
 Converts a double-precision vector in a single-precision vector. Needs explicit casting to help retain precision.
GreaterThan
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector.
Components evaluation priority is first X, then Y, then Z.
GreaterThanOrEqual
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector, or it is equal to it.
Components evaluation priority is first X, then Y, then Z.
Inequality
 Determines whether two vectors have different values.
LessThan
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector.
Components evaluation priority is first X, then Y, then Z.
LessThanOrEqual
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector, or it is equal to it.
Components evaluation priority is first X, then Y, then Z.
Multiply(Single, Vector3f)
 Multiplies a vector by a number, having the effect of scaling it.
Multiply(Vector3f, Vector3f)
 Multiplies two Vector3f together, returning the dot (internal) product of the two. This is not the cross product.
Multiply(Vector3f, Single)
 Multiplies a vector by a number, having the effect of scaling it.
Subtraction
 Subtracts the second vector from the first one.
UnaryNegation
 Computes the opposite vector.
Top
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace