RhinoCommon API
SubDEdgeSharpness Operators
The SubDEdgeSharpness type exposes the following members.
Operators
Name | Description
Equality
 Determines whether two sharpnesses have the same end values.
Inequality
 Determines whether two sharpnesses have different end values.
Top
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace