RhinoCommon API
Vector2d Operators
The Vector2d type exposes the following members.
Operators
Name | Description
Addition
 Sums up two vectors.
Division
 Divides a Vector2d by a number, having the effect of shrinking it.
Equality
 Determines whether two vectors have equal values.
GreaterThan
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
GreaterThanOrEqual
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
Inequality
 Determines whether two vectors have different values.
LessThan
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
LessThanOrEqual
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
Multiply(Double, Vector2d)
 Multiplies a vector by a number, having the effect of scaling it.
Multiply(Vector2d, Vector2d)
 Multiplies two vectors together, returning the dot product (or inner product).
Multiply(Vector2d, Double)
 Multiplies a vector by a number, having the effect of scaling it.
Subtraction
 Subtracts the second vector from the first one.
UnaryNegation
 Computes the opposite vector.
Top
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace