RhinoCommon API
Vector2f Operators
The Vector2f type exposes the following members.
Operators
Name | Description
Addition(Point2f, Vector2f)
 Sums up a point and a vector, and returns a new point.
Addition(Vector2f, Vector2f)
 Computes the sum between two vectors.
Equality
 Determines whether two vectors have equal values.
GreaterThan
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
GreaterThanOrEqual
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
Inequality
 Determines whether two vectors have different values.
LessThan
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
LessThanOrEqual
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
Multiply
 Multiplies two Vector2f together, returning the dot (internal) product of the two.
Subtraction
 Computes the difference between two vectors.
UnaryNegation
 Computes the opposite vector.
Top
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace