RhinoCommon API
Transform Operators
The Transform type exposes the following members.
Operators
Name | Description
Equality
 Determines if two transformations are equal in value.
Inequality
 Determines if two transformations are different in value.
Multiply(Transform, Point3d)
 Multiplies a transformation by a point and gets a new point.
Multiply(Transform, Transform)
 Multiplies (combines) two transformations.
Multiply(Transform, Vector3d)
 Multiplies a transformation by a vector and gets a new vector.
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace