RhinoCommon API
Transform2d Operators
The Transform2d type exposes the following members.
Operators
Name | Description
Equality
 Determines if two transformations are equal in value.
Inequality
 Determines if two transformations are different in value.
Multiply(Transform2d, Point2d)
 Multiplies a transformation by a point and gets a new point.
Multiply(Transform2d, Transform2d)
 Multiplies (combines) two transformations.
Multiply(Transform2d, Vector2d)
 Multiplies a transformation by a vector and gets a new vector.
Top
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace