RhinoCommon API
Interval Operators
The Interval type exposes the following members.
Operators
Name | Description
Addition(Double, Interval)
 Shifts an interval by a specific amount (addition).
Addition(Interval, Double)
 Shifts a Interval by a specific amount (addition).
Equality
 Determines whether the two Intervals have equal values.
GreaterThan
 Determines whether the first specified Interval comes after (has superior sorting value than) the second Interval.
The lower bound has first evaluation priority.
GreaterThanOrEqual
 Determines whether the first specified Interval comes after (has superior sorting value than) the second Interval, or is equal to it.
The lower bound has first evaluation priority.
Inequality
 Determines whether the two Intervals have different values.
LessThan
 Determines whether the first specified Interval comes before (has inferior sorting value than) the second Interval.
The lower bound has first evaluation priority.
LessThanOrEqual
 Determines whether the first specified Interval comes before (has inferior sorting value than) the second Interval, or is equal to it.
The lower bound has first evaluation priority.
Subtraction(Double, Interval)
 Shifts an interval by a specific amount (subtraction).
Subtraction(Interval, Double)
 Shifts an interval by a specific amount (subtraction).
Top
See Also
Reference
Interval Structure
Rhino.Geometry Namespace