RhinoCommon API
ColorHSV Type Conversions
The ColorHSV type exposes the following members.
Operators
Name | Description
Implicit(ColorHSV to Color)
 Implicitly converts a ColorHSV in a .Net library color.
Top
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace