RhinoCommon API
MeshNgon Operators
The MeshNgon type exposes the following members.
Operators
Name | Description
Equality
 Determines whether two MeshNgon structures have equal values.
Inequality
 Determines whether two MeshNgon structures have different values.
Top
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace