RhinoCommon API
Point3f Operators and Type Conversions
The Point3f type exposes the following members.
Operators
Name | Description
Addition
 Adds a point to another point.
Equality
 Determines whether two points have equal values.
Explicit(Point3d to Point3f)
 Converts a double-precision point in a single-precision point. Needs explicit casting to help retain precision.
Explicit(Point3f to Vector3f)
 Converts a single-precision point in a single-precision vector. Needs explicit casting to help retain precision.
GreaterThan
 Determines whether the first specified point comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
GreaterThanOrEqual
 Determines whether the first specified point comes after (has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then Z.
Inequality
 Determines whether two points have different values.
LessThan
 Determines whether the first specified point comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
LessThanOrEqual
 Determines whether the first specified point comes before (has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then Z.
Multiply(Point3f, Single)
 Multiplies a point by a factor.
Multiply(Single, Point3f)
 Multiplies a point by a factor.
Subtraction
 Subtracts a point from another point.
Top
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace