RhinoCommon API
MeshFace Operators
The MeshFace type exposes the following members.
Operators
Name | Description
Equality
 Determines whether two MeshFace structures have equal values.
Inequality
 Determines whether two MeshFace structures have different values.
Top
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace