RhinoCommon API
Matrix Operators
The Matrix type exposes the following members.
Operators
Name | Description
Addition
 Adds two matrices and returns a new sum matrix.
Multiply
 Multiplies two matrices and returns a new product matrix.
Top
See Also
Reference
Matrix Class
Rhino.Geometry Namespace