RhinoCommon API
ColorRGBA Operators and Type Conversions
The ColorRGBA type exposes the following members.
Operators
Name | Description
Equality
Explicit(ColorRGBA to Color)
 Converts a ColorRGBA in a Color.
Implicit(Color to ColorRGBA)
Inequality
Top
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace