RhinoCommon API
Vector3d Operators and Type Conversions
The Vector3d type exposes the following members.
Operators
Name | Description
Addition
 Sums up two vectors.
Division
 Divides a Vector3d by a number, having the effect of shrinking it.
Equality
 Determines whether two vectors have the same value.
GreaterThan
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector.
Components evaluation priority is first X, then Y, then Z.
GreaterThanOrEqual
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector, or it is equal to it.
Components evaluation priority is first X, then Y, then Z.
Implicit(Vector3f to Vector3d)
 Converts a single-precision (float) vector in a double-precision vector, without needing casting.
Inequality
 Determines whether two vectors have different values.
LessThan
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector.
Components evaluation priority is first X, then Y, then Z.
LessThanOrEqual
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector, or it is equal to it.
Components evaluation priority is first X, then Y, then Z.
Multiply(Double, Vector3d)
 Multiplies a vector by a number, having the effect of scaling it.
Multiply(Vector3d, Vector3d)
 Multiplies two vectors together, returning the dot product (or inner product). This differs from the cross product.
Multiply(Vector3d, Double)
 Multiplies a vector by a number, having the effect of scaling it.
Subtraction
 Subtracts the second vector from the first one.
UnaryNegation
 Computes the opposite vector.
Top
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace