RhinoCommon API
LocalizeStringPair Type Conversions
The LocalizeStringPair type exposes the following members.
Operators
Name | Description
Implicit(LocalizeStringPair to String)
Top
See Also
Reference
LocalizeStringPair Class
Rhino.UI Namespace