RhinoCommon API
ColorLAB Type Conversions
The ColorLAB type exposes the following members.
Operators
Name | Description
Implicit(ColorLAB to Color)
 Implicitly converts a LAB color into a .Net library color.
Top
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace