RhinoCommon API
ColorLCH Type Conversions
The ColorLCH type exposes the following members.
Operators
Name | Description
Implicit(ColorLCH to Color)
 Implicitly converts a LCH color into a .Net library color.
Top
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace