RhinoCommon API
ColorXYZ Type Conversions
The ColorXYZ type exposes the following members.
Operators
Name | Description
Implicit(ColorXYZ to Color)
 Implicitly converts a XYZ color into a .Net library color.
Top
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace