RhinoCommon API
LengthUnit Operators
The LengthUnit type exposes the following members.
Operators
Name | Description
Equality
Equality operator.
GreaterThan
Greater than operator.
GreaterThanOrEqual
Greater than or equal operator.
Inequality
Inequality operator.
LessThan
Less than operator.
LessThanOrEqual
Less than or equal operator.
Top
See Also
Reference
LengthUnit Structure
Rhino Namespace