RhinoCommon API
ComponentIndex Operators
The ComponentIndex type exposes the following members.
Operators
Name | Description
Equality
 Determines whether two ComponentIndexes have equal values.
GreaterThan
 Determines whether the first ComponentIndex comes after the second.
GreaterThanOrEqual
 Determines whether the first ComponentIndex comes after the second, or it is equal to it.
Inequality
 Determines whether two ComponentIndexes have different values.
LessThan
 Determines whether the first ComponentIndex comes before the second.
LessThanOrEqual
 Determines whether the first ComponentIndex comes before the second, or it is equal to it.
Top
See Also
Reference
ComponentIndex Structure
Rhino.Geometry Namespace