RhinoCommon API
SubDComponentParameter Operators
The SubDComponentParameter type exposes the following members.
Operators
Name | Description
Equality
 Determines whether two parameters are equal.
Inequality
 Determines whether two parameters are different.
Top
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace