RhinoCommon API
Quaternion Operators
The Quaternion type exposes the following members.
Operators
Name | Description
Addition
 Adds two quaternions.
This sums each quaternion coefficient with its correspondent and returns a new result quaternion.
Division
 Divides all quaternion coefficients by a factor and returns a new quaternion with the result.
Equality
 Determines whether two quaternions have the same value.
Inequality
 Determines whether two quaternions have different values.
Multiply(Quaternion, Quaternion)
 Multiplies a quaternion with another one.
Quaternion multiplication (Hamilton product) is not commutative.
Multiply(Quaternion, Double)
 Multiplies (scales) all quaternion coefficients by a factor and returns a new quaternion with the result.
Multiply(Quaternion, Int32)
 Multiplies (scales) all quaternion coefficients by a factor and returns a new quaternion with the result.
Multiply(Quaternion, Single)
 Multiplies (scales) all quaternion coefficients by a factor and returns a new quaternion with the result.
Subtraction
 Subtracts a quaternion from another one.
This computes the difference of each quaternion coefficient with its correspondent and returns a new result quaternion.
Top
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace