RhinoCommon API
NameHash Operators
The NameHash type exposes the following members.
Operators
Name | Description
Equality
 Determines if two NameHash instances are equal by value.
Inequality
 Determines if two NameHash instances are different by value.
Top
See Also
Reference
NameHash Class
Rhino.FileIO Namespace