RhinoCommon API
Point2f Operators and Type Conversions
The Point2f type exposes the following members.
Operators
Name | Description
Addition
 Sums two Point2fs.
Division
 Divides a Point2f by a scalar.
Equality
 Determines whether two Point2f have equal values.
Explicit(Point2d to Point2f)
 Converts a double-precision point in a single-precision point. Needs explicit casting to help retain precision.
GreaterThan
 Determines whether the first specified Point2f comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
GreaterThanOrEqual
 Determines whether the first specified Point2f comes after (has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
Inequality
 Determines whether two Point2f have different values.
LessThan
 Determines whether the first specified Point2f comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
LessThanOrEqual
 Determines whether the first specified Point2f comes before (has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
Multiply
 Multiplies a Point2f by a scalar.
Subtraction
 Subtracts two Point2fs.
Top
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace