RhinoCommon API
SubDComponent Operators
The SubDComponent type exposes the following members.
Operators
Name | Description
Equality
 Determines whether two components refer to the same component, with the same orientation, in the same SubD.
Inequality
 Determines whether two components refer to different components, orientations, or SubDs.
Top
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace