RhinoCommon API
MeshingParameters Operators
The MeshingParameters type exposes the following members.
Operators
Name | Description
Equality
 Determines whether the two MeshingParameters have equal values.
Inequality
 Determines whether the two MeshingParameters do not have equal values.
Top
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace