RhinoCommon API
ObjRef Constructor
Overload List
Name | Description
ObjRef(Guid) |  Obsolete.
 Initializes a new object reference from a globally unique identifier (Guid).
ObjRef(ObjRef)
 Copy constructor
ObjRef(RhinoObject)
 Initializes a new object reference from a Rhino object.
ObjRef(Guid, ComponentIndex) |  Obsolete.
 Initializes a new object reference from a guid and component index. The component index is used to specify a "piece" of the geometry
ObjRef(RhinoDoc, Guid)
 Initializes a new object reference from a globally unique identifier (Guid).
ObjRef(RhinoObject, PickContext)
 Initialized a new object reference from a Rhino object and pick context
ObjRef(RhinoDoc, Guid, ComponentIndex)
 Initializes a new object reference from a guid and component index. The component index is used to specify a "piece" of the geometry
Top
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace