RhinoCommon API
RenderPanels.RegisterPanel Method
Overload List
Name | Description
RegisterPanel(PlugIn, RenderPanelType, Type, String, Boolean, Boolean) |  Obsolete.
 Register custom render user interface with Rhino. This should only be done in RegisterRenderPanels(RenderPanels). Panels registered after RegisterRenderPanels(RenderPanels) is called will be ignored.
RegisterPanel(PlugIn, RenderPanelType, Type, Guid, String, Boolean, Boolean)
 Register custom render user interface with Rhino. This should only be done in RegisterRenderPanels(RenderPanels). Panels registered after RegisterRenderPanels(RenderPanels) is called will be ignored.
RegisterPanel(PlugIn, RenderPanelType, Type, Guid, String, Boolean, Boolean, RenderPanels.ExtraSidePanePosition)
 Register custom render user interface with Rhino. This should only be done in RegisterRenderPanels(RenderPanels). Panels registered after RegisterRenderPanels(RenderPanels) is called will be ignored.
Top
See Also
Reference
RenderPanels Class
Rhino.Render Namespace