RhinoCommon API
GumballDisplayConduit Constructor
Overload List
Name | Description
GumballDisplayConduit() |  Obsolete.
Initializes a new instance of the GumballDisplayConduit class
GumballDisplayConduit(ActiveSpace)
Initializes a new instance of the GumballDisplayConduit class
Top
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace