RhinoCommon API
LengthUnit.Equals Method
Overload List
Name | Description
Equals(LengthUnit)
 Indicates whether the current object is equal to another object of the same type.
Equals(Object)
 Indicates whether the current object is equal to another object of the same type.
 (Overrides ValueType.Equals(Object).)
Top
See Also
Reference
LengthUnit Structure
Rhino Namespace