RhinoCommon API
DisplayPen.FromLinetype Method
Overload List
Name | Description
FromLinetype(Linetype, Color)
 Create a display pen that matches a linetype definition on any viewport.
FromLinetype(Linetype, Color, Double)
 Create a display pen that matches a linetype definition
Top
See Also
Reference
DisplayPen Class
Rhino.Display Namespace