RhinoCommon API
GetBaseClass.AddOptionDouble Method
Overload List
Name | Description
AddOptionDouble(LocalizeStringPair, OptionDouble)
 Adds a command line option to get numbers and automatically save the value.
AddOptionDouble(String, OptionDouble)
 Adds a command line option to get numbers and automatically save the value.
AddOptionDouble(LocalizeStringPair, OptionDouble, String)
 Adds a command line option to get numbers and automatically saves the value.
AddOptionDouble(String, OptionDouble, String)
 Adds a command line option to get numbers and automatically save the value.
Top
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace