RhinoCommon API
Worksession.Detach Method
Overload List
Name | Description
Detach(IEnumerable<UInt32>)
 Detaches several reference models from this worksession.
Detach(UInt32)
 Detaches a reference model from this worksession.
Top
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace