RhinoCommon API
TextEntity.CreatePolySurfaces Method
Overload List
Name | Description
CreatePolySurfaces(DimensionStyle, Double, Double, Double)
 Creates breps from the outline curves with specified height.
CreatePolySurfaces(DimensionStyle, Double, Boolean, Double, Double)
 Creates breps from the outline curves with specified height.
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace