RhinoCommon API
ArcCurve Constructor
Overload List
Name | Description
ArcCurve()
 Initializes a new ArcCurve instance.
Radius is set to 1, position to Origin and Domain to full span (circle).
ArcCurve(Arc)
 Initializes a new ArcCurve instance, copying values from another Arc.
ArcCurve(ArcCurve)
 Initializes a new ArcCurve instance, copying values from another ArcCurve.
ArcCurve(Circle)
 Initializes a new ArcCurve instance, copying the shape of a Circle.
Parameterization will be [0;circle.Circumference]
ArcCurve(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
ArcCurve(Arc, Double, Double)
 Initializes a new ArcCurve instance, copying values from another Arc and specifying the needed parametrization of the arc.
Arc will not be cut again at these parameterizations.
ArcCurve(Circle, Double, Double)
 Initializes a new ArcCurve instance, copying values from a Circle and specifying the needed parametrization of the arc.
Circle will not be newly cut at these parameterizations.
Top
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace