RhinoCommon API
ObjectTable.AddPointCloud Method
Overload List
Name | Description
AddPointCloud(IEnumerable<Point3d>)
Adds a point cloud object to the document.
AddPointCloud(PointCloud)
Adds a point cloud object to the document.
AddPointCloud(IEnumerable<Point3d>, ObjectAttributes)
Adds a point cloud object to the document.
AddPointCloud(PointCloud, ObjectAttributes)
Adds a point cloud object to the document.
AddPointCloud(IEnumerable<Point3d>, ObjectAttributes, HistoryRecord, Boolean)
Adds a point cloud object to the document.
AddPointCloud(PointCloud, ObjectAttributes, HistoryRecord, Boolean)
Adds a point cloud object to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace