RhinoCommon API
ObjectTable.AddSurface Method
Overload List
Name | Description
AddSurface(Surface)
Adds a surface object to Rhino.
AddSurface(Surface, ObjectAttributes)
Adds a surface object to Rhino.
AddSurface(Surface, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace