RhinoCommon API
File3dmObjectTable.AddLine Method
Overload List
Name | Description
AddLine(Line)
Adds a line object to Rhino.
AddLine(Line, ObjectAttributes)
Adds a line object to Rhino.
AddLine(Point3d, Point3d)
Adds a line object to Rhino.
AddLine(Point3d, Point3d, ObjectAttributes)
Adds a line object to Rhino.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace