RhinoCommon API
RhinoList<T>.IndexOf Method
Overload List
Name | Description
IndexOf(T)
 Searches for the specified object and returns the zero-based index of the first occurrence within the entire List.
IndexOf(T, Int32)
 Searches for the specified object and returns the zero-based index of the first occurrence within the range of elements in the List that extends from the specified index to the last element.
IndexOf(T, Int32, Int32)
 Searches for the specified object and returns the zero-based index of the first occurrence within the range of elements in the List that starts at the specified index and contains the specified number of elements.
Top
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace