RhinoCommon API
ObjectAttributes.ComputedPlotColor Method
Overload List
Name | Description
ComputedPlotColor(RhinoDoc)
ComputedPlotColor(RhinoDoc, Guid)
Top
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace