RhinoCommon API
Vector3f.Add Method
Overload List
Name | Description
Add(Point3f, Vector3f)
 Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Add(Vector3f, Vector3f)
 Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Top
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace