RhinoCommon API
SpaceMorph.Morph Method
Overload List
Name | Description
Morph(GeometryBase)
Apply the space morph to geometry.
Morph(Plane)
 Apply the space morph to a plane.
Top
See Also
Reference
SpaceMorph Class
Rhino.Geometry Namespace