RhinoCommon API
PolylineCurve Constructor
Overload List
Name | Description
PolylineCurve()
 Initializes a new empty polyline curve.
PolylineCurve(IEnumerable<Point3d>)
 Initializes a new polyline curve by copying its content from another set of points.
PolylineCurve(PolylineCurve)
 Initializes a new polyline curve by copying its content from another polyline curve.
PolylineCurve(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace