RhinoCommon API
DisplayPipeline.DrawBitmap Method
Overload List
Name | Description
DrawBitmap(DisplayBitmap, Int32, Int32)
 Draws a bitmap in screen coordinates
DrawBitmap(DisplayBitmap, Int32, Int32, Int32, Int32)
 Draws a bitmap in screen coordinates, scaled to fit the given size.
DrawBitmap(DisplayBitmap, Int32, Int32, Int32, Int32, Transform2d)
 Draws a bitmap in screen coordinates, scaled to fit the given size, through a 2d transform.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace