RhinoCommon API
Curve.RibbonOffset Method
Overload List
Name | Description
RibbonOffset(RibbonOffsetParameters, Curve[], Curve[], Brep[])
 Ribbon offset method to mimic RibbonOffset command
RibbonOffset(Double, Double, Point3d, Vector3d, Double)
 Offsets a closed curve in the following way: pProject the curve to a plane with given normal. Then, loose Offset the projection by distance + blend_radius and trim off self-intersection. THen, Offset the remaining curve back in the opposite direction by blend_radius, filling gaps with blends. Finally, use the elevations of the input curve to get the correct elevations of the result.
RibbonOffset(Double, Double, Point3d, Vector3d, Double, Curve[], Surface[])
 Offsets a closed curve in the following way: pProject the curve to a plane with given normal. Then, loose Offset the projection by distance + blend_radius and trim off self-intersection. THen, Offset the remaining curve back in the opposite direction by blend_radius, filling gaps with blends. Finally, use the elevations of the input curve to get the correct elevations of the result.
RibbonOffset(Double, Double, Point3d, Vector3d, Double, Double[], Double[])
 Offsets a closed curve in the following way: pProject the curve to a plane with given normal. Then, loose Offset the projection by distance + blend_radius and trim off self-intersection. THen, Offset the remaining curve back in the opposite direction by blend_radius, filling gaps with blends. Finally, use the elevations of the input curve to get the correct elevations of the result.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace