RhinoCommon API
MeshFaceList.SetFace Method
Overload List
Name | Description
SetFace(Int32, MeshFace)
 Sets a face at a specific index of the mesh.
SetFace(Int32, Int32, Int32, Int32)
 Sets a triangular face at a specific index of the mesh.
SetFace(Int32, Int32, Int32, Int32, Int32)
 Sets a quadrangular face at a specific index of the mesh.
Top
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace