RhinoCommon API
Brep.ExtendBrepFacesToConnect Method
Overload List
Name | Description
ExtendBrepFacesToConnect(BrepFace, Point3d, BrepFace, Point3d, Double, Double, Brep, Brep)
 Extends Faces to meet and trims the faces to each other. If input faces intersect without extending, the selection point indicates the side to keep
ExtendBrepFacesToConnect(BrepFace, Int32, BrepFace, Int32, Double, Double, Brep, Brep)
 Extends Faces to meet and trims the faces to each other. If input faces intersect without extending, the selection point indicates the side to keep
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace