RhinoCommon API
Linetype.AddShape Method
Overload List
Name | Description
AddShape(Curve, Double)
 Add a curve shape to this linetype definition
AddShape(TextEntity, Double)
 Add text as a shape to this linetype definition
Top
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace