RhinoCommon API
SectionStyle Constructor
Overload List
Name | Description
SectionStyle()
Create a new instance of a SectionStyle
SectionStyle(SectionStyle)
Create a new SetionStyle that is a copy of another SectionStyle
Top
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace