RhinoCommon API
RenderSourceView.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the RenderSourceView
Dispose(Boolean)
Releases the unmanaged resources used by the RenderSourceView and optionally releases the managed resources
Top
See Also
Reference
RenderSourceView Class
Rhino.Render Namespace