RhinoCommon API
Interval Constructor
Overload List
Name | Description
Interval(Interval)
 Initializes a new instance copying the other instance values.
Interval(Double, Double)
 Initializes a new instance of the Rhino.Geometry.Interval class.
Top
See Also
Reference
Interval Structure
Rhino.Geometry Namespace