RhinoCommon API
File3dmViewTable.Delete Method
Overload List
Name | Description
Delete(Int32)
 Removes an item.
Delete(ViewInfo)
 Deletes an item.
Top
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace