RhinoCommon API
File3dmObjectTable.AddBrep Method
Overload List
Name | Description
AddBrep(Brep)
Adds a brep object to Rhino.
AddBrep(Brep, ObjectAttributes)
Adds a brep object to Rhino.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace