RhinoCommon API
AreaMassProperties.Sum Method
Overload List
Name | Description
Sum(AreaMassProperties)
 Sum mass properties together to get an aggregate mass.
Sum(IEnumerable<AreaMassProperties>, Boolean)
 Sum mass properties together to get an aggregate mass.
Top
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace