RhinoCommon API
DisplayPipeline.Draw2dText Method
Overload List
Name | Description
Draw2dText(String, Color, Point2d, Boolean)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point3d, Boolean)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point2d, Boolean, Int32)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point3d, Boolean, Int32)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point2d, Boolean, Int32, String)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point3d, Boolean, Int32, String)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point2d, TextHorizontalAlignment, TextVerticalAlignment, Single, String, Boolean, Boolean, Boolean, Boolean, Boolean)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point3d, TextHorizontalAlignment, TextVerticalAlignment, Single, String, Boolean, Boolean, Boolean, Boolean, Boolean)
 Draws 2D text on the viewport.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace