RhinoCommon API
RhinoDoc.OpenDocuments Method
Overload List
Name | Description
OpenDocuments()
 Returns a list of currently open Rhino documents
OpenDocuments(Boolean)
 Returns a list of currently open Rhino documents
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace