RhinoCommon API
GroupTable.Delete Method
Overload List
Name | Description
Delete(Group) |  (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32)
 Deletes a group from this table.
Deleted groups are kept in the runtime group table so that undo will work with groups. Call IsDeleted() to determine if a group is deleted.
Top
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace