RhinoCommon API
LOC.STR Method
Overload List
Name | Description
STR(String)
 Strings that need to be localized should call this function. The STR function doesn't actually do anything but return the original string. The LocalizationProcessor application walks through the source code of a project and looks for LOC.STR. The function is then replaced with a call to Localization.LocalizeString using a unique context ID.
STR(String, Int32) |  Obsolete.
DO NOT use this function, it is a trap to determine where context IDs have been copied from other, already extracted, strings.
STR(String, Object)
 Similar to Format(String, Object) function.
Top
See Also
Reference
LOC Class
Rhino.UI Namespace