RhinoCommon API
RhinoAccountsServerNotReachableException Constructor
Overload List
Name | Description
RhinoAccountsServerNotReachableException(Exception)
 Generates a new instance of the exception.
RhinoAccountsServerNotReachableException(String, Exception)
 Generates a new instance of the exception.
Top
See Also
Reference
RhinoAccountsServerNotReachableException Class
Rhino.Runtime.RhinoAccounts Namespace