RhinoCommon API
NamedPositionTable.ObjectIds Method
Overload List
Name | Description
ObjectIds(Guid)
Array of Rhino Object Guids related to a Named Position.
ObjectIds(String)
Array of Rhino Object Guids related to a Named Position.
Top
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace