RhinoCommon API
PersistentSettings.TryGetPoint3d Method
Overload List
Name | Description
TryGetPoint3d(String, Point3d)
TryGetPoint3d(String, Point3d, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace