RhinoCommon API
NurbsCurveKnotList.InsertKnot Method
Overload List
Name | Description
InsertKnot(Double)
 Inserts a knot and update control point locations. Does not change parameterization or locus of curve.
InsertKnot(Double, Int32)
 Inserts a knot and update control point locations. Does not change parameterization or locus of curve.
Top
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace