RhinoCommon API
RenderContent.SetParameter Method
Overload List
Name | Description
SetParameter(String, Object)
 Set the named parameter value for this content instance. If you do not support this parameter, call the base class.
SetParameter(String, Object, RenderContent.ChangeContexts) |  Obsolete.
 Set the named parameter value for this content instance. If you do not support this parameter, call the base class.
Top
See Also
Reference
RenderContent Class
Rhino.Render Namespace