RhinoCommon API
ObjectPropertiesPage.GetSelectedObjects Method
Overload List
Name | Description
GetSelectedObjects<T>()
 Get selected objects of a given type
GetSelectedObjects(ObjectType)
 Get selected objects that match a given filter
Top
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace