RhinoCommon API
TransformObjectList.Add Method
Overload List
Name | Description
Add(ObjRef)
 Add an ObjRef to this list. Use this to add polyedges so the references are properly counted
Add(RhinoObject)
 Add a RhinoObject to this list
Top
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace