RhinoCommon API
Curve.CreateInterpolatedCurve Method
Overload List
Name | Description
CreateInterpolatedCurve(IEnumerable<Point3d>, Int32)
 Interpolates a sequence of points. Used by InterpCurve Command This routine works best when degree=3.
CreateInterpolatedCurve(IEnumerable<Point3d>, Int32, CurveKnotStyle)
 Interpolates a sequence of points. Used by InterpCurve Command This routine works best when degree=3.
CreateInterpolatedCurve(IEnumerable<Point3d>, Int32, CurveKnotStyle, Vector3d, Vector3d)
 Interpolates a sequence of points. Used by InterpCurve Command This routine works best when degree=3.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace