RhinoCommon API
Skylight Constructor
Overload List
Name | Description
Skylight()
 Create a utility object not associated with any document
Skylight(Skylight)
 Create a utility object not associated with any document from another object
Top
See Also
Reference
Skylight Class
Rhino.Render Namespace