RhinoCommon API
HermiteSurface Constructor
Overload List
Name | Description
HermiteSurface()
 Initializes a new HermiteSurface instance.
HermiteSurface(Int32, Int32)
 Initializes a new HermiteSurface instance.
Top
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace