RhinoCommon API
MeshVertexNormalList.Add Method
Overload List
Name | Description
Add(Vector3d)
 Adds a new vertex normal at the end of the list.
Add(Vector3f)
 Adds a new vertex normal at the end of the list.
Add(Double, Double, Double)
 Adds a new vertex normal at the end of the list.
Add(Single, Single, Single)
 Adds a new vertex normal at the end of the list.
Top
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace