RhinoCommon API
Brep.CreatePipe Method
Overload List
Name | Description
CreatePipe(Curve, Double, Boolean, PipeCapMode, Boolean, Double, Double)
 Creates a single walled pipe.
CreatePipe(Curve, IEnumerable<Double>, IEnumerable<Double>, Boolean, PipeCapMode, Boolean, Double, Double)
 Creates a single walled pipe.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace