RhinoCommon API
CustomDisplay.AddVector Method
Overload List
Name | Description
AddVector(Point3d, Vector3d)
 Adds a new, black vector to the display list.
AddVector(Point3d, Vector3d, Color)
 Adds a new, colored vector to the display list.
AddVector(Point3d, Vector3d, Color, Boolean)
 Adds a new, colored vector to the display list.
Top
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace