RhinoCommon API
NurbsCurve.SetEndCondition Method
Overload List
Name | Description
SetEndCondition(Boolean, NurbsCurve.NurbsCurveEndConditionType, Point3d, Vector3d)
 Set end condition of a NURBS curve to point, tangent and curvature.
SetEndCondition(Boolean, NurbsCurve.NurbsCurveEndConditionType, Point3d, Vector3d, Vector3d)
 Set end condition of a NURBS curve to point, tangent and curvature.
Top
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace