RhinoCommon API
RhinoObject.SelectSubObject Method
Overload List
Name | Description
SelectSubObject(ComponentIndex, Boolean, Boolean)
Reports if an object can be selected.
SelectSubObject(ComponentIndex, Boolean, Boolean, Boolean)
Reports if an object can be selected.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace