RhinoCommon API
CustomDisplay.AddPoint Method
Overload List
Name | Description
AddPoint(Point3d)
 Adds a new, black point to the display list.
AddPoint(Point3d, Color)
 Adds a new colored point to the display list.
AddPoint(Point3d, Color, PointStyle, Int32)
 Adds a new stylized point to the display list.
Top
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace