RhinoCommon API
Mesh.GetOutlines Method
Overload List
Name | Description
GetOutlines(Plane)
 Constructs the outlines of a mesh projected against a plane.
GetOutlines(RhinoViewport)
 Constructs the outlines of a mesh. The projection information in the viewport is used to determine how the outlines are projected.
GetOutlines(ViewportInfo, Plane)
 Constructs the outlines of a mesh.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace