RhinoCommon API
Surface.Smooth Method
Overload List
Name | Description
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem)
 Smooths a surface by averaging the positions of control points in a specified region.
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths a surface by averaging the positions of control points in a specified region.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace