RhinoCommon API
Curve.CreateBooleanIntersection Method
Overload List
Name | Description
CreateBooleanIntersection(Curve, Curve) |  Obsolete.
 Calculates the boolean intersection of two closed, planar curves. Note, curves must be co-planar.
CreateBooleanIntersection(Curve, Curve, Double)
 Calculates the boolean intersection of two closed, planar curves. Note, curves must be co-planar.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace