RhinoCommon API
Panels.IsPanelVisible Method
Overload List
Name | Description
IsPanelVisible(Guid)
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
IsPanelVisible(Type)
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
IsPanelVisible(Guid, Boolean)
 Check to see if a panel is currently visible, if isSelectedTab is true then the tab must be the active tab as well.
IsPanelVisible(Type, Boolean)
 Check to see if a panel is currently visible, if isSelectedTab is true then the tab must be the active tab as well.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace