RhinoCommon API
ArchivableDictionary.GetDouble Method
Overload List
Name | Description
GetDouble(String)
 Get value as double, will only succeed if value was created using Set(string key, double value)
GetDouble(String, Double)
 Get value as double, will only succeed if value was created using Set(string key, double value)
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace