RhinoCommon API
Aligner.AlignVertices Method
Overload List
Name | Description
AlignVertices(IEnumerable<GeometryBase>, Double, Boolean, Boolean)
 Moves vertices that lie within the specified distance of one another onto the same location.
This is helpful to close the seams between separate pieces of geometry.
All vertices are considered, not only those on naked edges, unless onlyNaked says otherwise.
See the
_AlignVertices
 Rhino command for more information.
AlignVertices(IEnumerable<GeometryBase>, Double, Boolean, Boolean, IEnumerable<IEnumerable<Boolean>>)
 Moves vertices that lie within the specified distance of one another onto the same location.
This is helpful to close the seams between separate pieces of geometry.
See the
_AlignVertices
 Rhino command for more information.
Top
See Also
Reference
Aligner Class
Rhino.Geometry Namespace