RhinoCommon API
CustomRenderMeshProvider2.WillBuildCustomMeshes Method
Overload List
Name | Description
WillBuildCustomMeshes(ViewportInfo, RhinoObject, Guid, Boolean) |  (Overrides CustomRenderMeshProvider.WillBuildCustomMeshes(ViewportInfo, RhinoObject, Guid, Boolean).)
WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes)
Top
See Also
Reference
CustomRenderMeshProvider2 Class
Rhino.Render Namespace