RhinoCommon API
Transform2d.Multiply Operator
Overload List
Name | Description
Multiply(Transform2d, Point2d)
 Multiplies a transformation by a point and gets a new point.
Multiply(Transform2d, Transform2d)
 Multiplies (combines) two transformations.
Multiply(Transform2d, Vector2d)
 Multiplies a transformation by a vector and gets a new vector.
Top
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace