RhinoCommon API
Curve.DivideByLength Method
Overload List
Name | Description
DivideByLength(Double, Boolean)
 Divide the curve into specific length segments.
DivideByLength(Double, Boolean, Point3d[])
 Divide the curve into specific length segments.
DivideByLength(Double, Boolean, Boolean)
 Divide the curve into specific length segments.
DivideByLength(Double, Boolean, Boolean, Point3d[])
 Divide the curve into specific length segments.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace