RhinoCommon API
ObjectTable.GetObjectList Method
Overload List
Name | Description
GetObjectList(ObjectEnumeratorSettings)
 Returns an enumerable based on a ObjectEnumeratorSettings filter.
GetObjectList(ObjectType)
GetObjectList(Type)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace