RhinoCommon API
Point3d.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines whether the specified Object is a Point3d and has the same values as the present point.
 (Overrides ValueType.Equals(Object).)
Equals(Point3d)
 Determines whether the specified Point3d has the same values as the present point.
Top
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace