RhinoCommon API
PointCloud.Insert Method
Overload List
Name | Description
Insert(Int32, Point3d)
Inserts a new point into the point list.
Insert(Int32, Point3d, Vector3d)
Inserts a new point into the point list.
Insert(Int32, Point3d, Color)
 Inserts a new point into the point list.
Insert(Int32, Point3d, Vector3d, Color)
 Inserts a new point into the point list.
Insert(Int32, Point3d, Vector3d, Color, Double)
 Inserts a new point into the point list.
Top
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace