RhinoCommon API
DisplayPipeline.DrawCylinder Method
Overload List
Name | Description
DrawCylinder(Cylinder, Color)
 Draw a wireframe cylinder.
DrawCylinder(Cylinder, Color, Int32)
 Draw a wireframe cylinder.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace