RhinoCommon API
UserInterfaceCheckBox Constructor
Overload List
Name | Description
UserInterfaceCheckBox()
Initializes a new instance of the UserInterfaceCheckBox class
UserInterfaceCheckBox(String)
Initializes a new instance of the UserInterfaceCheckBox class
Top
See Also
Reference
UserInterfaceCheckBox Class
Rhino.UI Namespace