RhinoCommon API
Decal.CustomData Method
Overload List
Name | Description
CustomData()
 Gets decal custom data for the current renderer. See Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
CustomData(Guid)
 Gets decal custom data for a specified renderer. See Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
Top
See Also
Reference
Decal Class
Rhino.Render Namespace