RhinoCommon API
ObjectTable.DeleteGrip Method
Overload List
Name | Description
DeleteGrip(GripObject)
 Deletes a grip object.
DeleteGrip(Guid)
 Deletes a grip object.
DeleteGrip(ObjRef)
 Deletes a grip object.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace