RhinoCommon API
Plane.ExtendThroughBox Method
Overload List
Name | Description
ExtendThroughBox(BoundingBox, Interval, Interval)
 Extends this plane through a bounding box.
ExtendThroughBox(Box, Interval, Interval)
 Extend this plane through a Box.
Top
See Also
Reference
Plane Structure
Rhino.Geometry Namespace