RhinoCommon API
FileCsvDocument.TryGetLong Method
Overload List
Name | Description
TryGetLong(Int32, Int32, Int64)
 Retrieves the value of a cell as a 64-bit integer, parsed using the invariant culture.
TryGetLong(String, Int32, Int64)
 Retrieves the value of a cell as a 64-bit integer, addressing the column by header name.
Top
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace