RhinoCommon API
RhinoDocUndoRecord Constructor
Overload List
Name | Description
RhinoDocUndoRecord(RhinoDoc, String)
 Begin a RhinoDoc undo record.
RhinoDocUndoRecord(UInt32, String)
 Begin a RhinoDoc undo record.
Top
See Also
Reference
RhinoDocUndoRecord Class
Rhino Namespace