RhinoCommon API
File3dmStringTable.SetString Method
Overload List
Name | Description
SetString(String, String)
 Adds or sets a document string in the 3dm file.
SetString(String, String, String)
 Adds or sets a document string in the 3dm file.
Top
See Also
Reference
File3dmStringTable Class
Rhino.FileIO Namespace