RhinoCommon API
ObjectPropertiesPageEventArgs.GetObjects Method
Overload List
Name | Description
GetObjects<T>()
 Get selected objects of a given type
GetObjects(ObjectType)
 Get selected objects that match a given filter
Top
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace