RhinoCommon API
PlugIn.LoadPlugIn Method
Overload List
Name | Description
LoadPlugIn(Guid)
 Loads an installed plug-in.
LoadPlugIn(String, Guid)
 Attempt to load a plug-in at a path. Loaded plug-ins are remembered by Rhino between sessions, so this function can also be considered a plug-in installation routine
LoadPlugIn(Guid, Boolean, Boolean)
 Loads an installed plug-in.
Top
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace