RhinoCommon API
LengthUnit.ToUnitSystem Method
Overload List
Name | Description
ToUnitSystem(Double)
 Returns a UnitSystem equivalent to this instance and its size expressed on meters.
ToUnitSystem(Double, ISet<UnitSystem>)
 Returns the most similar UnitSystem to this instance available on unitSystems set.
Top
See Also
Reference
LengthUnit Structure
Rhino Namespace