RhinoCommon API
RenderMeshProvider.RegisterProviders Method
Overload List
Name | Description
RegisterProviders(PlugIn)
 Register RenderMeshProviders without relying on the auto-plug-in registration
RegisterProviders(Assembly, PlugIn)
 Register RenderMeshProviders without relying on the auto-plug-in registration
Top
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace