RhinoCommon API
RhinoList<T>.AddRange Method
Overload List
Name | Description
AddRange(IEnumerable)
 Adds the elements of the specified collection to the end of the List.
AddRange(IEnumerable<T>)
 Adds the elements of the specified collection to the end of the List.
Top
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace