RhinoCommon API
ObjectTable.AddText Method
Overload List
Name | Description
AddText(Text3d)
 Adds an annotation text object to the document.
AddText(TextEntity)
 Adds a v6_TextObject to the document.
AddText(Text3d, ObjectAttributes)
 Adds an annotation text object to the document.
AddText(TextEntity, ObjectAttributes)
 Adds a text object to the document.
AddText(TextEntity, ObjectAttributes, HistoryRecord, Boolean)
 Adds a text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean, ObjectAttributes)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean, TextJustification)
AddText(String, Plane, Double, String, Boolean, Boolean, TextJustification, ObjectAttributes)
AddText(String, Plane, Double, String, Boolean, Boolean, ObjectAttributes, HistoryRecord, Boolean)
AddText(String, Plane, Double, String, Boolean, Boolean, TextJustification, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace