RhinoCommon API
StringParser.ParseLengthExpession Method
Overload List
Name | Description
ParseLengthExpession(String, StringParserSettings, UnitSystem, Double)
 Parse a string for a length value. Expression can include complex expressions Simplest version of Length parsing
ParseLengthExpession(String, Int32, Int32, StringParserSettings, UnitSystem, Double, StringParserSettings, UnitSystem)
 Parse a string for a length value. Expression can include complex expressions Most complex version of length parsing
Top
See Also
Reference
StringParser Class
Rhino.Input Namespace