RhinoCommon API
ViewTable.Find Method
Overload List
Name | Description
Find(Guid)
 Finds a view in this document with a given main viewport Id.
Find(String, Boolean)
 Finds a view in this document with a main viewport that has a given name. Note that there may be multiple views in this document that have the same name. This function only returns the first view found. If you want to find all the views with a given name, use the GetViewList function and iterate through the views.
Top
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace