RhinoCommon API
GetBaseClass.AddOption Method
Overload List
Name | Description
AddOption(LocalizeStringPair)
 Adds a command line option.
AddOption(String)
 Adds a command line option.
AddOption(LocalizeStringPair, LocalizeStringPair)
 Adds a command line option.
AddOption(String, String)
 Adds a command line option.
AddOption(LocalizeStringPair, LocalizeStringPair, Boolean)
 Adds a command line option.
AddOption(String, String, Boolean)
 Adds a command line option.
Top
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace