RhinoCommon API
ObjectTable.DeleteGrips Method
Overload List
Name | Description
DeleteGrips(IEnumerable<GripObject>)
 Deletes one or more grip objects.
DeleteGrips(IEnumerable<ObjRef>)
 Deletes one or more grip objects.
DeleteGrips(IEnumerable<Guid>)
 Deletes one or more grip objects.
DeleteGrips(RhinoObject, IEnumerable<Int32>)
 Deletes one or more grip objects.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace