RhinoCommon API
Curve.ProjectToBrep Method
Overload List
Name | Description
ProjectToBrep(Curve, Brep, Vector3d, Double)
 Projects a Curve onto a Brep along a given direction.
ProjectToBrep(Curve, IEnumerable<Brep>, Vector3d, Double)
 Projects a Curve onto a collection of Breps along a given direction.
ProjectToBrep(IEnumerable<Curve>, IEnumerable<Brep>, Vector3d, Double)
 Projects a collection of Curves onto a collection of Breps along a given direction.
ProjectToBrep(Curve, IEnumerable<Brep>, Vector3d, Double, Int32[])
 Projects a Curve onto a collection of Breps along a given direction.
ProjectToBrep(IEnumerable<Curve>, IEnumerable<Brep>, Vector3d, Double, Int32[], Int32[])
 Projects a collection of Curves onto a collection of Breps along a given direction.
ProjectToBrep(IEnumerable<Curve>, IEnumerable<Brep>, Vector3d, Double, Boolean, Int32[], Int32[])
 Projects a collection of Curves onto a collection of Breps along a given direction.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace