RhinoCommon API
AngularDimension.AdjustFromPoints Method
Overload List
Name | Description
AdjustFromPoints(Plane, Point3d, Point3d, Point3d, Point3d)
 Updates dimension geometry from point locations.
AdjustFromPoints(Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Update angular dimension from point locations.
Top
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace