RhinoCommon API
RenderMaterial.CreateBasicMaterial Method
Overload List
Name | Description
CreateBasicMaterial(Material) |  Obsolete.
 Constructs a new basic material from a Material.
CreateBasicMaterial(Material, RhinoDoc)
Top
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace