RhinoCommon API
Intersection.LineBox Method
Overload List
Name | Description
LineBox(Line, BoundingBox, Double, Interval)
 Intersects an infinite line and an axis aligned bounding box.
LineBox(Line, Box, Double, Interval)
 Intersects an infinite line with a box volume.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace