RhinoCommon API
FileCsvDocument.TryGetInt Method
Overload List
Name | Description
TryGetInt(Int32, Int32, Int32)
 Retrieves the value of a cell as a 32-bit integer, parsed using the invariant culture.
TryGetInt(String, Int32, Int32)
 Retrieves the value of a cell as a 32-bit integer, addressing the column by header name.
Top
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace