RhinoCommon API
ArchivableDictionary.SetEnumValue Method
Overload List
Name | Description
SetEnumValue<T>(T)
 Set an enum value
SetEnumValue<T>(String, T)
 Set an enum value in the dictionary with a custom key.
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace