RhinoCommon API
TextFields.ObjectName Method
Overload List
Name | Description
ObjectName()
 Returns an attached Text objects attribute name.
ObjectName(String)
 Return an object's name
Top
See Also
Reference
TextFields Class
Rhino.Runtime Namespace