RhinoCommon API
GetBaseClass.AddOptionEnumList Method
Overload List
Name | Description
AddOptionEnumList<T>(LocalizeStringPair, T)
 Adds a choice of enumerated values as list option
AddOptionEnumList<T>(String, T)
 Adds a choice of enumerated values as list option
AddOptionEnumList<T>(LocalizeStringPair, T, T[])
 Adds a choice of enumerated values as list option. Allows to include only some enumerated values.
AddOptionEnumList<T>(String, T, T[])
 Adds a choice of enumerated values as list option. Allows to include only some enumerated values.
Top
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace