RhinoCommon API
PersistentSettings.TryGetDefault Method
Overload List
Name | Description
TryGetDefault(String, Point3d)
TryGetDefault(String, Boolean)
TryGetDefault(String, Byte)
TryGetDefault(String, Char)
TryGetDefault(String, DateTime)
TryGetDefault(String, Double)
TryGetDefault(String, Color)
TryGetDefault(String, Rectangle)
TryGetDefault(String, Size)
TryGetDefault(String, Int32)
TryGetDefault(String, String)
TryGetDefault(String, String[])
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace