RhinoCommon API
BrepFaceList.SplitKinkyFaces Method
Overload List
Name | Description
SplitKinkyFaces()
 Splits any faces with creases into G1 pieces.
SplitKinkyFaces(Double)
 Splits any faces with creases into G1 pieces.
SplitKinkyFaces(Double, Boolean)
 Splits any faces with creases into G1 pieces.
Top
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace