RhinoCommon API
Mesh.CreateFromPlanarBoundary Method
Overload List
Name | Description
CreateFromPlanarBoundary(Curve, MeshingParameters) |  Obsolete.
 Do not use this overload. Use version that takes a tolerance parameter instead.
CreateFromPlanarBoundary(Curve, MeshingParameters, Double)
 Attempts to construct a mesh from a closed planar curve.RhinoMakePlanarMeshes
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace