RhinoCommon API
PersistentSettings.TryGetInteger Method
Overload List
Name | Description
TryGetInteger(String, Int32)
TryGetInteger(String, Int32, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace