RhinoCommon API
RTree.Search Method
Overload List
Name | Description
Search(BoundingBox, EventHandler<RTreeEventArgs>)
 Searches for items in a bounding box.
The bounding box can be singular and contain exactly one single point.
Search(Sphere, EventHandler<RTreeEventArgs>)
 Searches for items in a sphere.
Search(BoundingBox, EventHandler<RTreeEventArgs>, Object)
 Searches for items in a bounding box.
The bounding box can be singular and contain exactly one single point.
Search(Sphere, EventHandler<RTreeEventArgs>, Object)
 Searches for items in a sphere.
Top
See Also
Reference
RTree Class
Rhino.Geometry Namespace