RhinoCommon API
Analytics.Send Method
Overload List
Name | Description
Send(NameValueCollection)
 Advanced method for sending Google Analytics data. It is the caller's responsibility to make sure that all parameters passed will result in a valid Google Analytics hit. Failure to do so will result in Google Analytics ignoring your hit, and the caller will get no data. The Analytics class will populate data from the Application, the GoogleAnalyticsTrackingID, the User ID, and set the hit type "t" to "event". It also sets other information about the system.
Send(String)
 Sends a Google Analytics event using the Measurement Protocol. See https://developers.google.com/analytics/devguides/collection/protocol/v1/devguide#event for details.
Send(String, String)
 Sends a Google Analytics event using the Measurement Protocol. See https://developers.google.com/analytics/devguides/collection/protocol/v1/devguide#event for details.
Send(String, String, String)
 Sends a Google Analytics event using the Measurement Protocol. See https://developers.google.com/analytics/devguides/collection/protocol/v1/devguide#event for details.
Send(String, String, String, UInt32)
 Sends a Google Analytics event using the Measurement Protocol. See https://developers.google.com/analytics/devguides/collection/protocol/v1/devguide#event for details. This method is asyncrhonous and the return code is completely ignored. Validate the data you send
Top
See Also
Reference
Analytics Class
Rhino.Runtime Namespace