RhinoCommon API
TextEntity.CreateSurfacesGrouped Method
Overload List
Name | Description
CreateSurfacesGrouped(DimensionStyle, Double, Double)
 Creates planar Breps from text outline curves. Breps are grouped such that each element in the list being returned represents a single character.
CreateSurfacesGrouped(DimensionStyle, Boolean, Double, Double)
 Creates planar Breps from text outline curves. Breps are grouped such that each element in the list being returned represents a single character.
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace