RhinoCommon API
SubDVertexList.Find Method
Overload List
Name | Description
Find(Int32)
 Find a vertex in this SubD with a given id
Find(UInt32)
 Find a vertex in this SubD with a given id
Top
See Also
Reference
SubDVertexList Class
Rhino.Geometry.Collections Namespace