RhinoCommon API
Mesh.CreateFromCylinder Method
Overload List
Name | Description
CreateFromCylinder(Cylinder, Int32, Int32)
Constructs a capped mesh cylinder.
CreateFromCylinder(Cylinder, Int32, Int32, Boolean, Boolean)
Constructs a mesh cylinder.
CreateFromCylinder(Cylinder, Int32, Int32, Boolean, Boolean, Boolean)
Constructs a mesh cylinder.
CreateFromCylinder(Cylinder, Int32, Int32, Boolean, Boolean, Boolean, Boolean)
Constructs a mesh cylinder.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace