RhinoCommon API
Brep.CreateFilletEdges Method
Overload List
Name | Description
CreateFilletEdges(Brep, IEnumerable<Int32>, IEnumerable<Double>, IEnumerable<Double>, BlendType, RailType, Double) |  Obsolete.
 Fillets, chamfers, or blends the edges of a brep.
CreateFilletEdges(Brep, IEnumerable<Int32>, IEnumerable<Double>, IEnumerable<Double>, BlendType, RailType, Boolean, Double, Double)
 Fillets, chamfers, or blends the edges of a brep.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace