RhinoCommon API
SubD.DuplicateEdgeCurves Method
Overload List
Name | Description
DuplicateEdgeCurves()
 Gets Nurbs form of all edges in this SubD, with clamped knots. NB: Does not update the SubD evaluation cache before getting the edges.
DuplicateEdgeCurves(Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Gets Nurbs form of edges in this SubD. NB: Does not update the SubD evaluation cache before getting the edges.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace