RhinoCommon API
LayerTable.Duplicate Method
Overload List
Name | Description
Duplicate(IEnumerable<Int32>, Boolean, Boolean)
 Duplicates, or copies, one or more layers. Duplicated layers are added to the document.
Duplicate(Int32, Boolean, Boolean)
 Duplicates, or copies, a layer. Duplicated layers are added to the document.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace