RhinoCommon API
Surface.IsExtrusion Method
Overload List
Name | Description
IsExtrusion()
Determines if the surface is a portion of an extrusion within RhinoMath.ZeroTolerance.
IsExtrusion(Double)
Determines if the surface is a portion of an extrusion within a given tolerance.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace