RhinoCommon API
RenderMeshProvider.Dispose Method
Overload List
Name | Description
Dispose()
 Dispose method
Dispose(Boolean)
 Dispose method. Note that you should only ever call Dispose if you explicitly registered this RenderMeshProvider using RegisterProvider If this provider was created using automatic registration, the Dispose function will thrown an exception.
Top
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace