RhinoCommon API
Curve.IsPlanar Method
Overload List
Name | Description
IsPlanar()
Test a curve for planarity.
IsPlanar(Double)
Test a curve for planarity.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace