RhinoCommon API
Panels.GetPanel Method
Overload List
Name | Description
GetPanel<T>() |  Obsolete.
 Return an instance of a .Net panel
GetPanel(Guid) |  Obsolete.
 Will return an instance of a .Net panel if the panel has been displayed at least once. Panel instances are not created until a panel is displayed.
GetPanel<T>(RhinoDoc)
 Return an instance of a .Net panel
GetPanel<T>(UInt32)
 Return an instance of a .Net panel
GetPanel(Guid, RhinoDoc)
 Will return an instance of a .Net panel if the panel has been displayed at least once. Panel instances are not created until a panel is displayed.
GetPanel(Guid, UInt32)
 Will return an instance of a .Net panel if the panel has been displayed at least once. Panel instances are not created until a panel is displayed.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace