RhinoCommon API
GetEllipse.Dispose Method
Overload List
Name | Description
Dispose()
 Actively releases the unmanaged object.
Dispose(Boolean)
 Releases the unmanaged object.
Top
See Also
Reference
GetEllipse Class
Rhino.Input.Custom Namespace