RhinoCommon API
NurbsCurve.Reparameterize Method
Overload List
Name | Description
Reparameterize(Double)
 Use a linear fractional transformation to re-parameterize the NURBS curve. This does not change the curve's domain.
Top
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace