RhinoCommon API
DisplayPipeline.Draw2dLine Method
Overload List
Name | Description
Draw2dLine(Point2f, Point2f, DisplayPen)
 Draws a line whose coordinates are viewport pixels rather than world units. The origin is the top left of the frame, with y increasing downwards - the same space Draw2dText and DrawBitmap work in.
Draw2dLine(PointF, PointF, DisplayPen)
 Draws a line whose coordinates are viewport pixels rather than world units. The origin is the top left of the frame, with y increasing downwards - the same space Draw2dText and DrawBitmap work in.
Draw2dLine(Point, Point, Color, Single)
Draw2dLine(PointF, PointF, Color, Single)
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace