RhinoCommon API
Ray3d.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines whether the specified System.Object is a Ray3d and has the same values as the present ray.
 (Overrides ValueType.Equals(Object).)
Equals(Ray3d)
 Determines whether the specified Ray3d has the same value as the present ray.
Top
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace