RhinoCommon API
NurbsCurveFitParameters.SetPointCountRange Method
Overload List
Name | Description
SetPointCountRange(Int32, Int32)
 Set the point count range and tolerance.
SetPointCountRange(Int32, Int32, Double)
 Set the point count range and tolerance.
Top
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace