RhinoCommon API
BrepTrim.SetTrimCurve Method
Overload List
Name | Description
SetTrimCurve(Int32)
 Set 2d curve geometry used by a b-rep trim.
SetTrimCurve(Int32, Interval)
 Set 2d curve geometry used by a b-rep trim.
Top
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace