RhinoCommon API
Brep.WireCut Method
Overload List
Name | Description
WireCut(IEnumerable<Curve>, Vector3d, Double, Boolean, Double, Boolean, Brep[], Brep[])
 Cuts this solid brep with extrusions of closed planar curves
WireCut(Curve, Vector3d, Vector3d, Double, Double, Boolean, Boolean, Double, Boolean, Brep[], Brep[])
 Cuts this solid brep with a single open cutting curve. The curve is extruded along direction into a sheet, then along trimDirection to close the sheet into a solid cutter.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace