RhinoCommon API
DisplayMaterial.SetBumpTexture Method
Overload List
Name | Description
SetBumpTexture(String, Boolean)
SetBumpTexture(Texture, Boolean)
Top
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace