RhinoCommon API
SubD.Evaluate Method
Overload List
Name | Description
Evaluate(SubDComponentParameter, Point3d)
 Evaluates the location of a point on this SubD's surface.
Evaluate(SubDComponentParameter, Point3d, Vector3d)
 Evaluates the location and unit normal of a point on this SubD's surface.
Evaluate(SubDComponentParameter, Point3d, Vector3d, Vector3d, Vector3d)
 Evaluates the location, first derivatives and unit normal of a point on this SubD's surface.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace