RhinoCommon API
Curve.PullToMesh Method
Overload List
Name | Description
PullToMesh(Mesh, Double)
 Makes a polyline approximation of the curve and gets the closest point on the mesh for each point on the curve. Then it "connects the points" so that you have a polyline on the mesh.
PullToMesh(Mesh, Double, Boolean)
 Projects this curve onto a mesh.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace