RhinoCommon API
LinearDimension Constructor
Overload List
Name | Description
LinearDimension()
Initializes a new instance of the LinearDimension class
LinearDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
LinearDimension(Plane, Point2d, Point2d, Point2d)
Initializes a new instance of the LinearDimension class
Top
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace