RhinoCommon API
DisplayPipeline.DrawPointCloud Method
Overload List
Name | Description
DrawPointCloud(PointCloud, Int32)
 Draws a point cloud.
DrawPointCloud(PointCloud, Single)
 Draws a point cloud.
DrawPointCloud(PointCloud, Int32, Color)
 Draws a point cloud.
DrawPointCloud(PointCloud, Single, Color)
 Draws a point cloud.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace