RhinoCommon API
Panels.FloatPanel Method
Overload List
Name | Description
FloatPanel(Guid, Panels.FloatPanelMode)
 Mac support: Display the specified panel in a floating window on Mac, the floating window will only contain the specified panel. Windows support: On Windows this will show or hide the floating container containing the specified panel. If the tab is docked with other tabs it will be floated in a new container.
FloatPanel(Type, Panels.FloatPanelMode)
 Mac support: Display the specified panel in a floating window on Mac, the floating window will only contain the specified panel. Windows support: On Windows this will show or hide the floating container containing the specified panel. If the tab is docked with other tabs it will be floated in a new container.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace