RhinoCommon API
RhinoAccountsInvalidResponseException Constructor
Overload List
Name | Description
RhinoAccountsInvalidResponseException(Exception)
 Generates a new instance of the exception.
RhinoAccountsInvalidResponseException(String, Exception)
 Generates a new instance of the exception.
Top
See Also
Reference
RhinoAccountsInvalidResponseException Class
Rhino.Runtime.RhinoAccounts Namespace