RhinoCommon API
ManifestTable.FindNameHash Method
Overload List
Name | Description
FindNameHash<T>(NameHash)
 Uses the hash of the name to find a model component. Deleted objects have no name.
FindNameHash(NameHash, ModelComponentType)
 Uses the hash of the name to find a model component. Deleted objects have no name.
Top
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace