RhinoCommon API
Surface.Extend Method
Overload List
Name | Description
Extend(Int32, Interval)
 Analytically extends the surface to include the interval.
Extend(IsoStatus, Double, Boolean)
 Extends an untrimmed surface along one edge.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace