RhinoCommon API
Curve.ClosestPoints Method
Overload List
Name | Description
ClosestPoints(Curve, Point3d, Point3d)
 Gets closest points between this and another curves.
ClosestPoints(IEnumerable<GeometryBase>, Point3d, Point3d, Int32)
 Finds the object (and the closest point in that object) that is closest to this curve.
Breps, surfaces, curves and point clouds are examples of objects that can be passed to this function.
ClosestPoints(IEnumerable<GeometryBase>, Point3d, Point3d, Int32, Double)
 Finds the object (and the closest point in that object) that is closest to this curve.
Breps, surfaces, curves and point clouds are examples of objects that can be passed to this function.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace