RhinoCommon API
RhinoApp.RunScript Method
Overload List
Name | Description
RunScript(String, Boolean)
Runs a Rhino command script.
RunScript(String, String, Boolean)
Runs a Rhino command script.
RunScript(UInt32, String, Boolean)
Runs a Rhino command script.
RunScript(UInt32, String, String, Boolean)
Runs a Rhino command script.
Top
See Also
Reference
RhinoApp Class
Rhino Namespace