RhinoCommon API
WorksessionFileLayerOverride Constructor
Overload List
Name | Description
WorksessionFileLayerOverride()
Creates a layer override with default values.
WorksessionFileLayerOverride(WorksessionFileLayerOverride)
Creates a copy of another layer override.
Top
See Also
Reference
WorksessionFileLayerOverride Class
Rhino.FileIO Namespace