RhinoCommon API
Line Constructor
Overload List
Name | Description
Line(Point3d, Point3d)
 Constructs a new line segment between two points.
Line(Point3d, Vector3d)
 Constructs a new line segment from start point and span vector.
Line(Point3d, Vector3d, Double)
 Constructs a new line segment from start point, direction and length.
Line(Double, Double, Double, Double, Double, Double)
 Constructs a new line segment between two points.
Top
See Also
Reference
Line Structure
Rhino.Geometry Namespace