RhinoCommon API
RhinoViewport.SetWallpaper Method
Overload List
Name | Description
SetWallpaper(String, Boolean)
SetWallpaper(String, Boolean, Boolean)
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace