RhinoCommon API
Squisher.SquishMesh Method
Overload List
Name | Description
SquishMesh(SquishParameters, Mesh)
 Squish the given mesh into a flat mesh
SquishMesh(SquishParameters, Mesh, IEnumerable<GeometryBase>, List<GeometryBase>)
 Squish the given mesh into a flat mesh
Top
See Also
Reference
Squisher Class
Rhino.Geometry Namespace