RhinoCommon API
InstanceDefinitionTable.ModifyGeometry Method
Overload List
Name | Description
ModifyGeometry(Int32, IEnumerable<GeometryBase>)
ModifyGeometry(Int32, GeometryBase, ObjectAttributes)
ModifyGeometry(Int32, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Modifies the instance definition geometry and replaces all references to the current definition with references to the new definition.
Top
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace