RhinoCommon API
LayerTable.AddReferenceLayer Method
Overload List
Name | Description
AddReferenceLayer()
 Adds a new reference layer with default definition to the layer table. Reference layers are not saved in files.
AddReferenceLayer(Layer)
 Adds a new reference layer with specified definition to the layer table Reference layers are not saved in files.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace