RhinoCommon API
RhinoMath.Clamp Method
Overload List
Name | Description
Clamp(Double, Double, Double)
 Limits a Double to be specified within an interval of two numbers, by specifying a fixed minimum and maximum.
Clamp(Int32, Int32, Int32)
 Restricts a Int32 to be specified within an interval of two integers.
Top
See Also
Reference
RhinoMath Class
Rhino Namespace