RhinoCommon API
PersistentSettings.GetBool Method
Overload List
Name | Description
GetBool(String)
GetBool(String, Boolean)
GetBool(String, Boolean, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace