RhinoCommon API
RhinoGet.StringToCommandOptionName Method
Overload List
Name | Description
StringToCommandOptionName(String)
 Convert some arbitrary string value to a valid command option name removing any invalid characters.
StringToCommandOptionName(String, String)
 Convert some arbitrary string value to a valid command option name removing any invalid characters.
Top
See Also
Reference
RhinoGet Class
Rhino.Input Namespace