RhinoCommon API
MeshNgonList.IsValid Method
Overload List
Name | Description
IsValid(Int32)
 Tests an ngon to see if the vertex and face references are valid and pass partial boundary validity checks.
IsValid(Int32, TextLog)
 Tests an ngon to see if the vertex and face references are valid and pass partial boundary validity checks.
Top
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace