RhinoCommon API
SimpleArrayGuid Constructor
Overload List
Name | Description
SimpleArrayGuid()
 Initializes a new SimpleArrayGuid class.
SimpleArrayGuid(IEnumerable<Guid>)
 Initializes a new SimpleArrayGuid class
Top
See Also
Reference
SimpleArrayGuid Class
Rhino.Runtime.InteropWrappers Namespace