RhinoCommon API
PersistentSettings.GetRectangle Method
Overload List
Name | Description
GetRectangle(String)
GetRectangle(String, Rectangle)
GetRectangle(String, Rectangle, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace