RhinoCommon API
CustomDisplay.AddLine Method
Overload List
Name | Description
AddLine(Line)
 Adds a new, black line to the display list.
AddLine(Line, Color)
 Adds a new, colored line to the display list.
AddLine(Line, Color, Int32)
 Adds a new, colored line to the display list.
Top
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace