RhinoCommon API
LicenseLease Constructor
Overload List
Name | Description
LicenseLease(IntPtr)
Initializes a new instance of the LicenseLease class
LicenseLease(String, String, String, String, String, String, String, String, String, DateTime, DateTime)
Initializes a new instance of the LicenseLease class
LicenseLease(String, String, String, String, String, String, String, String, String, DateTime, DateTime, DateTime)
Initializes a new instance of the LicenseLease class
Top
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace