RhinoCommon API
NamedConstructionPlaneTable.Delete Method
Overload List
Name | Description
Delete(Int32)
 Remove named construction plane from the document.
Delete(String)
 Remove named construction plane from the document.
Top
See Also
Reference
NamedConstructionPlaneTable Class
Rhino.DocObjects.Tables Namespace