RhinoCommon API
MeshNgonList.AddPlanarNgons Method
Overload List
Name | Description
AddPlanarNgons(Double)
 Add an ngon for each group of connected coplanar faces.
AddPlanarNgons(Double, Int32, Int32, Boolean)
 Add an ngon for each group of connected coplanar faces.
Top
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace