RhinoCommon API
GroupTable.Add Method
Overload List
Name | Description
Add()
Adds a new empty group to the group table.
Add(IEnumerable<Guid>)
 Adds a new group to the group table with a set of objects.
Add(String)
Adds a new empty group to the group table.
Add(String, IEnumerable<Guid>)
 Adds a new group to the group table with a set of objects.
Top
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace