RhinoCommon API
Mesh.Weld Method
Overload List
Name | Description
Weld(Double)
 Makes sure that faces sharing an edge and having a difference of normal less than or equal to angleToleranceRadians share vertices along that edge, vertex normals are averaged.
Weld(Double, Boolean)
 Makes sure that faces sharing an edge and having a difference of normal less than or equal to angleToleranceRadians share vertices along that edge, vertex normals are averaged.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace