RhinoCommon API
ObjectTable.AddRhinoObject Method
Overload List
Name | Description
AddRhinoObject(CustomBrepObject)
AddRhinoObject(CustomMeshObject)
AddRhinoObject(CustomPointObject)
AddRhinoObject(BrepObject, Brep)
AddRhinoObject(CurveObject, Curve)
AddRhinoObject(CustomBrepObject, HistoryRecord)
AddRhinoObject(CustomCurveObject, HistoryRecord)
AddRhinoObject(CustomMeshObject, HistoryRecord)
AddRhinoObject(CustomPointObject, HistoryRecord)
AddRhinoObject(MeshObject, Mesh)
AddRhinoObject(PointObject, Point)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace