RhinoCommon API
OrdinateDimension.GetDistanceDisplayText Method
Overload List
Name | Description
GetDistanceDisplayText(LengthUnit, DimensionStyle)
GetDistanceDisplayText(UnitSystem, DimensionStyle) |  Obsolete.
Top
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace