RhinoCommon API
Vector3d.Multiply Method
Overload List
Name | Description
Multiply(Double, Vector3d)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector3d, Vector3d)
 Multiplies two vectors together, returning the dot product (or inner product). This differs from the cross product.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector3d, Double)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Top
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace