RhinoCommon API
SimulatedTexture.MetersToUnits Method
Overload List
Name | Description
MetersToUnits(Double) |  Obsolete.
MetersToUnits(RhinoDoc, Double)
Top
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace