RhinoCommon API
TextFields.UserText Method
Overload List
Name | Description
UserText(String, String)
 User text associated with an object, block or layout
UserText(String, String, String)
 User text associated with an object, block or layout
UserText(String, String, String, String)
 User text associated with an object, block or layout
Top
See Also
Reference
TextFields Class
Rhino.Runtime Namespace