RhinoCommon API
BoundingBox.Inflate Method
Overload List
Name | Description
Inflate(Double)
 Inflates the box with equal amounts in all directions. Inflating with negative amounts may result in decreasing boxes.
Invalid boxes can not be inflated.
Inflate(Double, Double, Double)
 Inflate the box with custom amounts in all directions. Inflating with negative amounts may result in decreasing boxes.
InValid boxes can not be inflated.
Top
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace