RhinoCommon API
Dialogs.ShowPropertyListBox Method
Overload List
Name | Description
ShowPropertyListBox(String, String, List<KeyValuePair<String, String>>)
 Displays Rhino's property list box.
ShowPropertyListBox(String, String, IList, IList<String>)
 Displays Rhino's property list box.
Top
See Also
Reference
Dialogs Class
Rhino.UI Namespace