RhinoCommon API
HostUtils.GetActivePlugInVersionFolders Method
Overload List
Name | Description
GetActivePlugInVersionFolders()
 Recurses through the auto install plug-in folders and returns the directories containing "active" versions of plug-ins.
GetActivePlugInVersionFolders(Boolean)
 Recurses through the auto install plug-in folders and returns the directories containing "active" versions of plug-ins.
Top
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace