RhinoCommon API
PersistentSettings.GetSettingIsHiddenFromUserInterface Method
Overload List
Name | Description
GetSettingIsHiddenFromUserInterface(String)
 Values read from all users settings files will be marked as read-only which will cause any future calls to Set... to fail.
GetSettingIsHiddenFromUserInterface(String, IEnumerable<String>)
 Values read from all users settings files will be marked as read-only which will cause any future calls to Set... to fail.
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace