RhinoCommon API
RhinoDoc.SaveAsTemplate Method
Overload List
Name | Description
SaveAsTemplate(String)
 Save this document as a template
SaveAsTemplate(String, Int32)
 Save this document as a template to a specific Rhino file version
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace