RhinoCommon API
NamedViewTable.Rename Method
Overload List
Name | Description
Rename(Int32, String)
 Renames a named view.
Rename(String, String)
 Renames a named view.
Top
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace