RhinoCommon API
File3dmObjectTable.AddHatch Method
Overload List
Name | Description
AddHatch(Hatch)
 Adds a hatch to the document.
AddHatch(Hatch, ObjectAttributes)
 Adds a hatch to the document.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace