RhinoCommon API
DisplayConduit.SetObjectIdFilter Method
Overload List
Name | Description
SetObjectIdFilter(Guid)
 Set an object Id that this conduit's per-object functions will only be called for
SetObjectIdFilter(IEnumerable<Guid>)
 Set object Ids that this conduit's per-object functions will only be called for
Top
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace