RhinoCommon API
PageViewGroupTable.UndoModify Method
Overload List
Name | Description
UndoModify(Guid)
 If the page view group has been modified and the modification can be undone, then this will restore the page view group to its previous state.
UndoModify(Int32)
 If the page view group has been modified and the modification can be undone, then this will restore the page view group to its previous state.
UndoModify(Guid, UInt32)
 If the page view group has been modified and the modification can be undone, then this will restore the page view group to its previous state.
UndoModify(Int32, UInt32)
 If the page view group has been modified and the modification can be undone, then this will restore the page view group to its previous state.
Top
See Also
Reference
PageViewGroupTable Class
Rhino.DocObjects.Tables Namespace