RhinoCommon API
Silhouette.ComputeDraftCurve Method
Overload List
Name | Description
ComputeDraftCurve(GeometryBase, Double, Vector3d, Double, Double)
 Computes draft curve silhouettes of a shape.
ComputeDraftCurve(GeometryBase, Double, Vector3d, Double, Double, CancellationToken)
 Computes draft curve silhouettes of a shape.
Top
See Also
Reference
Silhouette Class
Rhino.Geometry Namespace