RhinoCommon API
Notification Constructor
Overload List
Name | Description
Notification()
 Creates a new instance that can be edited by any assembly.
Notification(IEnumerable<Assembly>)
 Creates a new instance that can be edited by the given assemblies.
Top
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace