RhinoCommon API
Panels.GetPanels Method
Overload List
Name | Description
GetPanels<T>(RhinoDoc)
GetPanels<T>(UInt32)
 Gets the panels.
GetPanels(Guid, RhinoDoc)
 Gets the panels.
GetPanels(Guid, UInt32)
 Gets the panels.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace