RhinoCommon API
RenderContent.IsFactoryProductAcceptableAsChild Method
Overload List
Name | Description
IsFactoryProductAcceptableAsChild(ContentFactory, String)
IsFactoryProductAcceptableAsChild(Guid, String, String)
 Override this method to restrict the type of acceptable child content. The default implementation of this method returns true if the factory kind is 'texture'.
Top
See Also
Reference
RenderContent Class
Rhino.Render Namespace