RhinoCommon API
ObjectTable.GetObjectsByType Method
Overload List
Name | Description
GetObjectsByType<T>()
 Returns Rhino object by type.
GetObjectsByType<T>(ObjectEnumeratorSettings)
 Returns Rhino object by type.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace