RhinoCommon API
GetBaseClass.AddOptionString Method
Overload List
Name | Description
AddOptionString(LocalizeStringPair, OptionString)
 Add a command line option to get a string and automatically save the value.
AddOptionString(String, OptionString)
 Add a command line option to get a string and automatically save the value.
AddOptionString(LocalizeStringPair, OptionString, String)
 Add a command line option to get a string and automatically save the value.
AddOptionString(String, OptionString, String)
 Add a command line option to get a string and automatically save the value.
Top
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace