RhinoCommon API
UserInterfaceLabel Constructor
Overload List
Name | Description
UserInterfaceLabel()
Initializes a new instance of the UserInterfaceLabel class
UserInterfaceLabel(String)
Initializes a new instance of the UserInterfaceLabel class
Top
See Also
Reference
UserInterfaceLabel Class
Rhino.UI Namespace