RhinoCommon API
Interval.Subtraction Operator
Overload List
Name | Description
Subtraction(Double, Interval)
 Shifts an interval by a specific amount (subtraction).
Subtraction(Interval, Double)
 Shifts an interval by a specific amount (subtraction).
Top
See Also
Reference
Interval Structure
Rhino.Geometry Namespace