RhinoCommon API
Transform2d.TryGetTransform2d Method
Overload List
Name | Description
TryGetTransform2d(Transform, Transform2d)
 Attempts to get the 2d transformation defined by the x and y rows and columns of a 4x4 transformation. This succeeds when transform is affine and maps the world xy plane to itself.
TryGetTransform2d(Transform, Double, Transform2d)
 Attempts to get the 2d transformation defined by the x and y rows and columns of a 4x4 transformation. This succeeds when transform is affine and maps the world xy plane to itself.
Top
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace