RhinoCommon API
RenderContent.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the RenderContent
Dispose(Boolean)
 Dispose
Top
See Also
Reference
RenderContent Class
Rhino.Render Namespace