RhinoCommon API
PersistentSettings.GetUnsignedInteger Method
Overload List
Name | Description
GetUnsignedInteger(String)
GetUnsignedInteger(String, UInt32)
GetUnsignedInteger(String, UInt32, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace