RhinoCommon API
MeshExtruder.ExtrudedMesh Method
Overload List
Name | Description
ExtrudedMesh(Mesh)
 Creates new extruded mesh. Returns true if any edges or faces were extruded.
ExtrudedMesh(Mesh, List<ComponentIndex>)
 Creates new extruded mesh. Returns true if any edges or faces were extruded.
Top
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace