RhinoCommon API
SumSurface.Create Method
Overload List
Name | Description
Create(Curve, Curve)
 Constructs a new sum surface by extruding a curve A along a path B.
Create(Curve, Vector3d)
 Constructs a new sum surface by extruding a curve in a specified direction.
Top
See Also
Reference
SumSurface Class
Rhino.Geometry Namespace