RhinoCommon API
AngularDimension.Create Method
Overload List
Name | Description
Create(DimensionStyle, Line, Point3d, Line, Point3d, Point3d, Boolean)
 The angle between the lines is dimensioned. If the lines intersect in a single point, that point is used as the center of the angular dimension arc.In this case, there are eight possible angles to dimension.The pointOnAngularDimensionArc and pointOnLine parameters are used to select the correct angle to dimension. If a pointOnLine parameter is not set, the corresponding line's midpoint is used. If the lines are colinear, the point on the line closest to pointOnAngularDimensionArc is the center of the angular dimension arc.
Create(DimensionStyle, Plane, Vector3d, Point3d, Point3d, Point3d, Point3d)
 Creates an angular dimension with extension lines starting at plane origin (arc center).
Create(Guid, Plane, Point3d, Point3d, Point3d, Point3d, Point3d) |  Obsolete.
Create(DimensionStyle, Plane, Vector3d, Point3d, Point3d, Point3d, Point3d, Point3d)
 Creates an angular dimension from parameters.
Top
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace