RhinoCommon API
DisplayPipeline.Draw3dText Method
Overload List
Name | Description
Draw3dText(Text3d, Color)
Draw3dText(Text3d, Color, Plane)
 Draws 3d text with a different plane than what is defined in the Text3d class.
Draw3dText(Text3d, Color, Point3d)
 Draws 3d text using the Text3d plane with an adjusted origin.
Draw3dText(String, Color, Plane, Double, String)
Draw3dText(String, Color, Plane, Double, String, Boolean, Boolean)
Draw3dText(String, Color, Plane, Double, String, Boolean, Boolean, TextHorizontalAlignment, TextVerticalAlignment)
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace