RhinoCommon API
Arc.Equals Method
Overload List
Name | Description
Equals(Arc)
 Determines whether another arc has the same value as this arc.
Equals(Object)
 Determines whether another object is an arc and has the same value as this arc.
 (Overrides ValueType.Equals(Object).)
Top
See Also
Reference
Arc Structure
Rhino.Geometry Namespace