RhinoCommon API
ClassArrayOnObjRef.ToNonConstArray Method
Overload List
Name | Description
ToNonConstArray()
 Copies the unmanaged array to a managed counterpart.
ToNonConstArray(RhinoDoc)
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
ClassArrayOnObjRef Class
Rhino.Runtime.InteropWrappers Namespace