RhinoCommon API
Dialogs.ShowMessage Method
Overload List
Name | Description
ShowMessage(String, String)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessage(String, String, ShowMessageButton, ShowMessageIcon)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessage(Object, String, String, ShowMessageButton, ShowMessageIcon, ShowMessageDefaultButton, ShowMessageOptions, ShowMessageMode)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
Top
See Also
Reference
Dialogs Class
Rhino.UI Namespace