RhinoCommon API
SubD.DissolveOrDeleteComponents Method
Overload List
Name | Description
DissolveOrDeleteComponents(IEnumerable<ComponentIndex>)
 Dissolves or deletes components, identified by component index. See DissolveOrDeleteComponents(IEnumerable<SubDComponent>).
DissolveOrDeleteComponents(IEnumerable<SubDComponent>)
 Dissolves the given edges and vertices, merging the faces around them, and deletes the given faces.
 This is the difference between removing an edge between two quads to get one bigger face, and removing the two quads to leave a hole. Use DeleteComponents(IEnumerable<SubDComponent>, Boolean) when a hole is what you want.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace