RhinoCommon API
Mesh.IsManifold Method
Overload List
Name | Description
IsManifold()
 Returns true if every mesh "edge" has at most two faces.
IsManifold(Boolean, Boolean, Boolean)
 Gets a value indicating whether or not the mesh is manifold. A manifold mesh does not have any edge that borders more than two faces.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace