RhinoCommon API
ViewportInfo.GetFrustumLine Method
Overload List
Name | Description
GetFrustumLine(Point)
 Gets the world coordinate line in the view frustum that projects to a point on the screen.
GetFrustumLine(PointF)
 Gets the world coordinate line in the view frustum that projects to a point on the screen.
GetFrustumLine(Double, Double)
 Gets the world coordinate line in the view frustum that projects to a point on the screen.
Top
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace