RhinoCommon API
HatchPattern Constructor
Overload List
Name | Description
HatchPattern()
Initializes a new instance of the HatchPattern class
HatchPattern(HatchPattern)
Initializes a new instance of the HatchPattern class
Top
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace