RhinoCommon API
Brep.CreateFromCornerPoints Method
Overload List
Name | Description
CreateFromCornerPoints(Point3d, Point3d, Point3d, Double)
 Makes a Brep with one face from three corner points.
CreateFromCornerPoints(Point3d, Point3d, Point3d, Point3d, Double)
 Makes a Brep with one face from four corner points.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace