RhinoCommon API
SurfaceDirectionIndicators Constructor
Overload List
Name | Description
SurfaceDirectionIndicators(BrepFace)
 Construct for a Brep face.
SurfaceDirectionIndicators(Surface)
 Construct for a surface.
SurfaceDirectionIndicators(NurbsSurface, Point2d)
 Construct for a Nurbs surface.
Top
See Also
Reference
SurfaceDirectionIndicators Class
Rhino.Geometry Namespace