RhinoCommon API
Vector3f.Division Operator
Overload List
Name | Description
Division(Vector3f, Double)
 Divides a Vector3f by a number, having the effect of shrinking it, t times.
Division(Vector3f, Single)
 Divides a Vector3f by a number, having the effect of shrinking it, t times.
Top
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace