RhinoCommon API
GumballObject.SetFromBoundingBox Method
Overload List
Name | Description
SetFromBoundingBox(BoundingBox)
SetFromBoundingBox(Plane, BoundingBox)
 Sets the gumball bounding box with respect to a frame.
Top
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace