RhinoCommon API
Matrix Constructor
Overload List
Name | Description
Matrix(Transform)
 Initializes a new instance of the matrix based on a 4x4 matrix Transform.
Matrix(Int32, Int32)
 Initializes a new instance of the matrix.
Matrix(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
See Also
Reference
Matrix Class
Rhino.Geometry Namespace