RhinoCommon API
RhinoObject.GetRenderPrimitiveList Method
Overload List
Name | Description
GetRenderPrimitiveList(ViewportInfo, DisplayPipelineAttributes) |  Obsolete.
 Build custom render mesh(es) for this object.
GetRenderPrimitiveList(ViewportInfo, Boolean) |  Obsolete.
 Build custom render mesh(es) for this object.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace