RhinoCommon API
FactoryBase.Register Method
Overload List
Name | Description
Register()
 Call this function during startup of current assembly to load classes with factory creation support are registed
Register(PlugIn)
 Call this function during the startup of your plug-in to ensure that all classes that support factory creation are registed
Top
See Also
Reference
FactoryBase Class
Rhino.UI.Controls Namespace