RhinoCommon API
RhinoObject.GetFillSurfaces Method
Overload List
Name | Description
GetFillSurfaces(RhinoObject, ClippingPlaneObject)
 Return list of fill surfaces if any for object and clipping plane.
GetFillSurfaces(RhinoObject, IEnumerable<ClippingPlaneObject>)
 Return list of fill surfaces if any for object and clipping plane. Fills are trimmed by clipping planes that did not generate them.
GetFillSurfaces(RhinoObject, IEnumerable<ClippingPlaneObject>, Boolean)
 Return list of fill surfaces if any for object and clipping plane.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace