RhinoCommon API
SubD.Dispose Method
Overload List
Name | Description
Dispose(Boolean)
 Deletes the underlying native pointer during a Dispose call or GC collection
 (Overrides GeometryBase.Dispose(Boolean).)
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace