RhinoCommon API
Curve.CreateRevisionCloud Method
Overload List
Name | Description
CreateRevisionCloud(IEnumerable<Point3d>, Double, Boolean)
 Creates a revision cloud curve from points that make up a planar polyline.
CreateRevisionCloud(Curve, Int32, Double, Boolean)
 Creates a revision cloud curve from a planar curve.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace