RhinoCommon API
FileDwgWriteOptions Constructor
Overload List
Name | Description
FileDwgWriteOptions()
 AutoCAD version format to write to
FileDwgWriteOptions(FileDwgWriteOptions)
Initializes a new instance of the FileDwgWriteOptions class
Top
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace