RhinoCommon API
SectionStyleTable.Find Method
Overload List
Name | Description
Find(String)
Finds the section style with a given name.
Find(Guid, Boolean)
Finds a section style with a matching ID.
Top
See Also
Reference
SectionStyleTable Class
Rhino.DocObjects.Tables Namespace