RhinoCommon API
Curve.ClosestPoint Method
Overload List
Name | Description
ClosestPoint(Point3d, Double)
 Finds parameter of the point on a curve that is closest to testPoint. If the maximumDistance parameter is > 0, then only points whose distance to the given point is <= maximumDistance will be returned. Using a positive value of maximumDistance can substantially speed up the search.
ClosestPoint(Point3d, Double, Double)
 Finds the parameter of the point on a curve that is closest to testPoint. If the maximumDistance parameter is > 0, then only points whose distance to the given point is <= maximumDistance will be returned. Using a positive value of maximumDistance can substantially speed up the search.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace