RhinoCommon API
Point Constructor
Overload List
Name | Description
Point(Point3d)
 Initializes a new point instance with a location.
Point(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
See Also
Reference
Point Class
Rhino.Geometry Namespace