RhinoCommon API
IStackedDialogPageService.GetNativePageWindow Method
Overload List
Name | Description
GetNativePageWindow(Object, Boolean, Boolean, Object)
 Get the unmanaged pointer associated with the pages content control
GetNativePageWindow(Object, Boolean, Boolean, Object, Object)
 Get the unmanaged pointer associated with the pages content control
Top
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace