RhinoCommon API
LayerTable.Modify Method
Overload List
Name | Description
Modify(Layer, Guid, Boolean)
Modifies layer settings.
Modify(Layer, Int32, Boolean)
Modifies layer settings.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace