RhinoCommon API
RhinoDoc.ExportSelected Method
Overload List
Name | Description
ExportSelected(String)
 Export selected geometry to a file. All file formats that Rhino can export to are supported by this function.
ExportSelected(String, ArchivableDictionary)
 Export selected geometry to a file. All file formats that Rhino can export to are supported by this function.
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace