RhinoCommon API
SimulatedTexture.UnitsToMeters Method
Overload List
Name | Description
UnitsToMeters(Double) |  Obsolete.
UnitsToMeters(RhinoDoc, Double)
Top
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace