RhinoCommon API
NamedLayerStateTable.Restore Method
Overload List
Name | Description
Restore(String, RestoreLayerProperties)
 Restores a named layer state.
Restore(String, RestoreLayerProperties, Guid)
 Restores a named layer state.
Top
See Also
Reference
NamedLayerStateTable Class
Rhino.DocObjects.Tables Namespace