RhinoCommon API
Extrusion.ToBrep Method
Overload List
Name | Description
ToBrep(Boolean)
 Constructs a brep form of the extrusion. The outer profile is always the first face of the brep. If there are inner profiles, additional brep faces are created for each profile. If the outer profile is closed, then end caps are added as the last two faces of the brep.
Top
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace