RhinoCommon API
Light Constructor
Overload List
Name | Description
Light()
 Initializes a new light.
Light(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
Light Class
Rhino.Geometry Namespace