RhinoCommon API
CustomDisplay.AddCurve Method
Overload List
Name | Description
AddCurve(Curve)
 Adds a new, black curve to the display list. The curve will be duplicated so changes to the original will not affect the display.
AddCurve(Curve, Color)
 Adds a new, colored curve to the display list. The curve will be duplicated so changes to the original will not affect the display.
AddCurve(Curve, Color, Int32)
 Adds a new, colored curve to the display list. The curve will be duplicated so changes to the original will not affect the display.
Top
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace