RhinoCommon API
InstanceReferenceGeometry Constructor
Overload List
Name | Description
InstanceReferenceGeometry(Guid, Transform)
 Constructor used when creating nested instance references.
InstanceReferenceGeometry(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
See Also
Reference
InstanceReferenceGeometry Class
Rhino.Geometry Namespace