RhinoCommon API
ArchivableDictionary.GetInteger Method
Overload List
Name | Description
GetInteger(String)
 Get value as int, will only succeed if value was created using Set(string key, int value)
GetInteger(String, Int32)
 Get value as int, will return defaultValue unless value was created using Set(string key, int value)
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace