RhinoCommon API
PersistentSettings.TryGetDate Method
Overload List
Name | Description
TryGetDate(String, DateTime)
TryGetDate(String, DateTime, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace