RhinoCommon API
MeshFace.Equals Method
Overload List
Name | Description
Equals(MeshFace)
 Returns a value indicating whether the other mesh face has precisely the same value as the current one.
Equals(Object)
 Returns a value indicating whether the other object obj has precisely the same value as the current one.
 (Overrides ValueType.Equals(Object).)
Top
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace