RhinoCommon API
VisualAnalysisMode.Find Method
Overload List
Name | Description
Find(Guid)
 Finds a visual analysis mode by guid.
Find(Type)
 Finds a visual analysis mode by type.
Top
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace