RhinoCommon API
Rectangle3d.ClosestPoint Method
Overload List
Name | Description
ClosestPoint(Point3d)
 Gets the point on the rectangle that is closest to a test-point.
ClosestPoint(Point3d, Boolean)
 Gets the point on the rectangle that is closest to a test-point.
Top
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace