RhinoCommon API
WorksessionFile Constructor
Overload List
Name | Description
WorksessionFile()
Creates an empty worksession with no models.
WorksessionFile(WorksessionFile)
Creates a copy of another worksession.
Top
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace