RhinoCommon API
RhinoDoc.AddCustomUndoEvent Method
Overload List
Name | Description
AddCustomUndoEvent(String, EventHandler<CustomUndoEventArgs>)
AddCustomUndoEvent(String, EventHandler<CustomUndoEventArgs>, Object)
 Add a custom undo event so you can undo private plug-in data when the user performs an undo or redo
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace