RhinoCommon API
Mesh.Reduce Method
Overload List
Name | Description
Reduce(ReduceMeshParameters)
Reduce polygon count
Reduce(ReduceMeshParameters, Boolean)
Reduce polygon count
Reduce(Int32, Boolean, Int32, Boolean)
 Reduce polygon count
Reduce(Int32, Boolean, Int32, Boolean, Boolean)
 Reduce polygon count
Reduce(Int32, Boolean, Int32, Boolean, CancellationToken, IProgress<Double>, String)
Reduce polygon count
Reduce(Int32, Boolean, Int32, Boolean, CancellationToken, IProgress<Double>, String, Boolean)
Reduce polygon count
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace