RhinoCommon API
PointCloud.Add Method
Overload List
Name | Description
Add(Point3d)
 Append a new point to the end of the list.
Add(Point3d, Vector3d)
 Append a new point to the end of the list.
Add(Point3d, Color)
 Append a new point to the end of the list.
Add(Point3d, Vector3d, Color)
 Append a new point to the end of the list.
Add(Point3d, Vector3d, Color, Double)
 Append a new point to the end of the list.
Top
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace