RhinoCommon API
Mesh.Smooth Method
Overload List
Name | Description
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem)
 Smooths a mesh by averaging the positions of mesh vertices in a specified region.
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths a mesh by averaging the positions of mesh vertices in a specified region.
Smooth(Double, Int32, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths a mesh by averaging the positions of mesh vertices in a specified region.
Smooth(IEnumerable<Int32>, Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths part of a mesh by averaging the positions of mesh vertices in a specified region.
Smooth(IEnumerable<Int32>, Double, Int32, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths part of a mesh by averaging the positions of mesh vertices in a specified region.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace