RhinoCommon API
Brep.CreateCurvatureAnalysisMesh Method
Overload List
Name | Description
CreateCurvatureAnalysisMesh(Brep, CurvatureAnalysisSettingsState)
 Create an array of analysis meshes for the brep using the specified settings. Meshes aren't set on the brep.
CreateCurvatureAnalysisMesh(Brep, CurvatureAnalysisSettingsState, MeshingParameters)
 Creates an array of analysis meshes for the brep, one per face. The meshes are not set on the brep.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace