RhinoCommon API
RenderContent.GenerateQuickContentPreview Method
Overload List
Name | Description
GenerateQuickContentPreview(RenderContent, Int32, Int32, PreviewSceneServer, Boolean, Int32, Result)
 Generate a quick render content preview
GenerateQuickContentPreview(LinearWorkflow, RenderContent, Int32, Int32, PreviewSceneServer, Boolean, Int32, Result)
 Generate a quick render content preview
Top
See Also
Reference
RenderContent Class
Rhino.Render Namespace