RhinoCommon API
Brep.CreatePlanarUnion Method
Overload List
Name | Description
CreatePlanarUnion(IEnumerable<Brep>, Plane, Double)
 CreatePlanarUnion
CreatePlanarUnion(Brep, Brep, Plane, Double)
 CreatePlanarUnion
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace