RhinoCommon API
PersistentSettings.SetEnumValue Method
Overload List
Name | Description
SetEnumValue<T>(T)
 Set an enumerated value in the settings.
SetEnumValue<T>(String, T)
 Set an enumerated value in the settings using a custom key
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace