RhinoCommon API
FileCsvDocument.Set Method
Overload List
Name | Description
Set(Int32, Point3d)
 Sets a row from a 3-D point. This is only valid when ColumnCount is 3: the point's X, Y, and Z are written to columns 0, 1, and 2 with the general ("G") format specifier and the invariant culture.
Set(Int32, Point3d, String)
 Sets a row from a 3-D point, using the specified .NET numeric format string. This is only valid when ColumnCount is 3: the point's X, Y, and Z are written to columns 0, 1, and 2 with the invariant culture.
Set(Int32, Int32, Boolean)
 Sets the value of a cell to a boolean, written as "1" (true) or "0" (false).
Set(Int32, Int32, DateTime)
 Sets the value of a cell to a date and time, formatted as a round-trip ISO 8601 string (the "o" format) using the invariant culture.
Set(Int32, Int32, Double)
 Sets the value of a specific cell to a double-precision number, formatted with the general ("G") format specifier and the invariant culture.
Set(Int32, Int32, Color)
 Sets the value of a cell to a color, stored as its 32-bit ARGB integer (ToArgb()), so that the alpha channel round-trips.
Set(Int32, Int32, Guid)
 Sets the value of a cell to a globally unique identifier, formatted with hyphens and no braces (the "D" format, for example "11f820ff-952a-4b0b-b10a-59f82c2eb1f4").
Set(Int32, Int32, Int32)
 Sets the value of a specific cell to a 32-bit integer, formatted using the invariant culture.
Set(Int32, Int32, Int64)
 Sets the value of a specific cell to a 64-bit integer, formatted using the invariant culture.
Set(Int32, Int32, String)
 Sets the value of a cell, addressed by column and row. Rows are added as needed (any intervening rows are created and filled with empty fields), but the column count is fixed.
Set(Int32, Int32, DateTime, String)
 Sets the value of a cell to a date and time, formatted with the specified .NET date/time format string and the invariant culture.
Set(Int32, Int32, Double, String)
 Sets the value of a specific cell to a double-precision number, formatted with the specified .NET numeric format string and the invariant culture.
Set(Int32, Int32, Double, LengthUnit, DistanceDisplayMode, Int32)
 Sets the value of a cell to a double-precision number, formatted with FormatNumber(Double, LengthUnit, DistanceDisplayMode, Int32, Boolean). The unit system name is never appended to the field.
Set(Int32, Int32, Double, UnitSystem, DistanceDisplayMode, Int32)
 Sets the value of a cell to a double-precision number, formatted with FormatNumber(Double, UnitSystem, DistanceDisplayMode, Int32, Boolean). The unit system name is never appended to the field.
Top
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace