RhinoCommon API
Surface.VariableOffset Method
Overload List
Name | Description
VariableOffset(Double, Double, Double, Double, Double)
 Copies a surface so that all locations at the corners of the copied surface are specified distances from the original surface.
VariableOffset(Double, Double, Double, Double, IEnumerable<Point2d>, IEnumerable<Double>, Double)
 Copies a surface so that all locations at the corners, and from specified interior locations, of the copied surface are specified distances from the original surface.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace