RhinoCommon API
Panels.OpenPanel Method
Overload List
Name | Description
OpenPanel(Guid)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
OpenPanel(Type)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
OpenPanel(Guid, Boolean)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
OpenPanel(Guid, Guid)
 In Mac Rhino this will just call the version of OpenPanel that takes a class type Id. In Windows Rhino this will look for a dock bar with the specified Id and open or move the specified panel to that dock bar.
OpenPanel(Guid, Type)
 In Mac Rhino this will just call the version of OpenPanel that takes a class type Id. In Windows Rhino this will look for a dock bar with the specified Id and open or move the specified panel to that dock bar.
OpenPanel(Type, Boolean)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
OpenPanel(Guid, Guid, Boolean)
 In Mac Rhino this will just call the version of OpenPanel that takes a class type Id. In Windows Rhino this will look for a dock bar with the specified Id and open or move the specified panel to that dock bar.
OpenPanel(Guid, Type, Boolean)
 In Mac Rhino this will just call the version of OpenPanel that takes a class type Id. In Windows Rhino this will look for a dock bar with the specified Id and open or move the specified panel to that dock bar.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace