RhinoCommon API
Curve.DivideEquidistant Method
Overload List
Name | Description
DivideEquidistant(Double)
 Calculates 3d points on a curve where the linear distance between the points is equal.
DivideEquidistant(Double, Double[])
 Calculates 3d points on a curve where the linear distance between the points is equal.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace