RhinoCommon API
DisplayPipeline.DrawMeshShaded Method
Overload List
Name | Description
DrawMeshShaded(Mesh, DisplayMaterial)
 Draws the shaded faces of a given mesh.
DrawMeshShaded(Mesh, GrasshopperDisplayMaterial)
 Draws a single mesh with the Grasshopper 2 ("G2") shaded display. This is a convenience overload of DrawMeshesShaded(IEnumerable<Mesh>, GrasshopperDisplayMaterial); see it for the mesh requirements and vertex-colour handling.
DrawMeshShaded(Mesh, DisplayMaterial, IEnumerable<Int32>)
 Draws the shaded faces of a given mesh.
DrawMeshShaded(Mesh, DisplayMaterial, Int32[])
 Draws the shaded faces of a given mesh.
DrawMeshShaded(Mesh, Color, IsoDrawEffect)
 Draws shaded mesh with isodraw settings applied (zebra)
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace