RhinoCommon API
RhinoAccountsServerException Constructor
Overload List
Name | Description
RhinoAccountsServerException(Exception)
 Generates a new instance of the exception.
RhinoAccountsServerException(String, Exception)
 Generates a new instance of the exception.
Top
See Also
Reference
RhinoAccountsServerException Class
Rhino.Runtime.RhinoAccounts Namespace