RhinoCommon API
NurbsCurve.CreateFromCircle Method
Overload List
Name | Description
CreateFromCircle(Circle)
 Gets a rational degree 2 NURBS curve representation of the circle. Note that the parameterization of NURBS curve does not match circle's transcendental parameterization. Use GetRadianFromNurbFormParameter() and GetParameterFromRadian() to convert between the NURBS curve parameter and the transcendental parameter.
CreateFromCircle(Circle, Int32, Int32)
 Create a uniform non-rational cubic NURBS approximation of a circle.
Top
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace