RhinoCommon API
ToolbarFile.GetGroup Method
Overload List
Name | Description
GetGroup(Int32)
 Gets a toolbar group.
GetGroup(String)
 Gets a toolbar group.
Top
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace