RhinoCommon API
ArchivableDictionary.GetBool Method
Overload List
Name | Description
GetBool(String)
 Get value as Boolean, will only succeed if value was created using Set(string key, Boolean value)
GetBool(String, Boolean)
 Get value as Boolean, will return defaultValue unless value was created using Set(string key, Boolean value)
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace