RhinoCommon API
Point3dList.Add Method
Overload List
Name | Description
Add(Double, Double, Double)
 Adds a Point3d to the end of the list with given x,y,z coordinates.
Top
See Also
Reference
Point3dList Class
Rhino.Collections Namespace