RhinoCommon API
InstanceDefinitionTable.CreateFromFile Method
Overload List
Name | Description
CreateFromFile(String, String, InstanceDefinitionUpdateType, InstanceDefinitionLayerStyle, InstanceDefinitionNameConflictResolution, Boolean)
 Creates an instance definition by reading a file, the way the Insert command does when inserting a file as a block. No instance reference is created.
CreateFromFile(String, String, String, String, String, InstanceDefinitionUpdateType, InstanceDefinitionLayerStyle, InstanceDefinitionNameConflictResolution, Boolean)
 Creates an instance definition by reading a file, the way the Insert command does when inserting a file as a block. No instance reference is created.
Top
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace