RhinoCommon API
LayerTable.UndoModify Method
Overload List
Name | Description
UndoModify(Guid)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
UndoModify(Int32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
UndoModify(Guid, UInt32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
UndoModify(Int32, UInt32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace