RhinoCommon API
Mesh.SetTextureCoordinates Method
Overload List
Name | Description
SetTextureCoordinates(TextureMapping, Transform, Boolean)
 Sets texture coordinates using the given texture mapping and transform.
SetTextureCoordinates(TextureMapping, Transform, Boolean, Boolean)
 Sets texture coordinates using the given texture mapping and transform.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace