RhinoCommon API
GumballDisplayConduit.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the GumballDisplayConduit
Dispose(Boolean)
Releases the unmanaged resources used by the GumballDisplayConduit and optionally releases the managed resources
Top
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace