RhinoCommon API
Point2d.Subtract Method
Overload List
Name | Description
Subtract(Point2d, Point2d)
 Subtracts the second point from the first point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
Subtract(Point2d, Vector2d)
 Subtracts a vector from a point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
Top
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace