RhinoCommon API
File3dmObjectTable.AddPoint Method
Overload List
Name | Description
AddPoint(Point3d)
Adds a point object to the table.
AddPoint(Point3f)
Adds a point object to the document.
AddPoint(Point3d, ObjectAttributes)
Adds a point object to the document.
AddPoint(Point3f, ObjectAttributes)
Adds a point object to the document.
AddPoint(Double, Double, Double)
 Adds a point object to the table.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace