RhinoCommon API
GetEllipsoid.GetMesh Method
Overload List
Name | Description
GetMesh(Int32, Int32, Mesh)
 Prompt for the getting of a mesh ellipsoid.
GetMesh(Int32, Int32, Boolean, Mesh)
 Prompt for the getting of a mesh ellipsoid.
Top
See Also
Reference
GetEllipsoid Class
Rhino.Input.Custom Namespace