RhinoCommon API
Transform.Translation Method
Overload List
Name | Description
Translation(Vector3d)
 Constructs a new translation (move) transformation.
Translation(Double, Double, Double)
 Constructs a new translation (move) transformation. Right column is (dx, dy, dz, 1.0).
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace