RhinoCommon API
ViewportInfo.GetDollyCameraVector Method
Overload List
Name | Description
GetDollyCameraVector(Point, Point, Double)
 Gets a world coordinate dolly vector that can be passed to DollyCamera().
GetDollyCameraVector(Int32, Int32, Int32, Int32, Double)
 Gets a world coordinate dolly vector that can be passed to DollyCamera().
Top
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace