RhinoCommon API
DisplayMaterial.SetTransparencyTexture Method
Overload List
Name | Description
SetTransparencyTexture(String, Boolean)
SetTransparencyTexture(Texture, Boolean)
Top
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace