RhinoCommon API
StdVectorFloat Constructor
Overload List
Name | Description
StdVectorFloat()
 Initializes a new StdVectorFloat class.
StdVectorFloat(IEnumerable<Single>)
 Initializes a new SimpleArrayFloat class
StdVectorFloat(StdVectorFloat)
 Initializes a new StdVectorFloat with the contents of another SimpleArrayFloat.
StdVectorFloat(UInt64)
 Initializes a new StdVectorFloat class. Initial size of the array - all values are set to zero.
Top
See Also
Reference
StdVectorFloat Class
Rhino.Runtime.InteropWrappers Namespace