RhinoCommon API
InstanceDefinition.CreatePreviewBitmap Method
Overload List
Name | Description
CreatePreviewBitmap(DefinedViewportProjection, Size)
 Creates a wireframe preview bitmap of the instance definition.
CreatePreviewBitmap(DefinedViewportProjection, DisplayMode, Size)
 Creates a preview bitmap of the instance definition.
CreatePreviewBitmap(DefinedViewportProjection, Size, Boolean)
 Creates a wireframe preview bitmap of the instance definition.
CreatePreviewBitmap(DefinedViewportProjection, DisplayMode, Size, Boolean)
 Creates a preview bitmap of the instance definition.
CreatePreviewBitmap(Guid, DefinedViewportProjection, DisplayMode, Size, Boolean)
 Creates a preview bitmap of the instance definition.
CreatePreviewBitmap(Guid, DefinedViewportProjection, IsometricCamera, Boolean, Size, Boolean)
 Creates a preview bitmap of the instance definition.
Top
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace