RhinoCommon API
PickContext.PickFrustumTest Method
Overload List
Name | Description
PickFrustumTest(BoundingBox, Boolean)
 Fast test to check if a bounding box intersects a pick frustum.
PickFrustumTest(Point3d, Double, Double)
Utility for picking 3d point
PickFrustumTest(BezierCurve, Double, Double, Double)
PickFrustumTest(Line, Double, Double, Double)
PickFrustumTest(NurbsCurve, Double, Double, Double)
PickFrustumTest(Point3d[], Int32, Double, Double)
PickFrustumTest(PointCloud, Int32, Double, Double)
PickFrustumTest(Mesh, PickContext.MeshPickStyle, Point3d, Double, Double, PickContext.MeshHitFlag, Int32)
Utility for picking meshes
PickFrustumTest(Mesh, PickContext.MeshPickStyle, Point3d, Point2d, Point2d, Double, Double, PickContext.MeshHitFlag, Int32)
Utility for picking meshes
Top
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace