RhinoCommon API
SimpleArrayDouble Constructor
Overload List
Name | Description
SimpleArrayDouble()
 Initializes a new SimpleArrayDouble instance.
SimpleArrayDouble(IEnumerable<Double>)
 Initializes a new SimpleArrayDouble instance, with items.
Top
See Also
Reference
SimpleArrayDouble Class
Rhino.Runtime.InteropWrappers Namespace