RhinoCommon API
SnapShotsClient.IsCurrentModelStateInAnySnapshot Method
Overload List
Name | Description
IsCurrentModelStateInAnySnapshot(RhinoDoc, BinaryArchiveReader, SimpleArrayBinaryArchiveReader, TextLog)
 Called before restoring a snapshot. Warns the user if the current model state is not already saved.
IsCurrentModelStateInAnySnapshot(RhinoDoc, RhinoObject, BinaryArchiveReader, SimpleArrayBinaryArchiveReader, TextLog)
 Called before restoring a snapshot. Warns the user if the current model state is not already saved.
Top
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace