RhinoCommon API
RhinoDoc.GetRenderPrimitives Method
Overload List
Name | Description
GetRenderPrimitives(Boolean, Boolean) |  Obsolete.
 Get a enumerable list of custom mesh primitives
GetRenderPrimitives(ViewportInfo, Boolean, Boolean) |  Obsolete.
 Get a enumerable list of custom mesh primitives
GetRenderPrimitives(Guid, ViewportInfo, Boolean, Boolean) |  Obsolete.
 Get a enumerable list of custom mesh primitives
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace