RhinoCommon API
IRhinoUiDialogService.ShowPrintWidths Method
Overload List
Name | Description
ShowPrintWidths(String, String)
ShowPrintWidths(String, String, Double)
Top
See Also
Reference
IRhinoUiDialogService Interface
Rhino.UI Namespace