RhinoCommon API
GetTruncatedCone.GetMesh Method
Overload List
Name | Description
GetMesh(Int32, Int32, Mesh)
 Prompt for the getting of a mesh truncated cone.
GetMesh(Int32, Int32, Int32, Mesh)
 Prompt for the getting of a mesh truncated cone.
Top
See Also
Reference
GetTruncatedCone Class
Rhino.Input.Custom Namespace