RhinoCommon API
SimulatedEnvironment.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the SimulatedEnvironment
Dispose(Boolean)
Releases the unmanaged resources used by the SimulatedEnvironment and optionally releases the managed resources
Top
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace