RhinoCommon API
SimpleArrayClippingPlaneObjectPointer.Dispose Method
Overload List
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
Releases the unmanaged resources used by the SimpleArrayClippingPlaneObjectPointer and optionally releases the managed resources
Top
See Also
Reference
SimpleArrayClippingPlaneObjectPointer Class
Rhino.Runtime.InteropWrappers Namespace