RhinoCommon API
Panels.OpenPanelAsSibling Method
Overload List
Name | Description
OpenPanelAsSibling(Guid, Guid)
 In Mac Rhino this will currently just call OpenPanel, in Windows Rhino this will look for a dock bar which contains the sibling panel and add this panel to that dock bar as necessary, if the panel was in another dock bar it will be moved to this dock bar.
OpenPanelAsSibling(Guid, Guid, Boolean)
 In Mac Rhino this will currently just call OpenPanel, in Windows Rhino this will look for a dock bar which contains the sibling panel and add this panel to that dock bar as necessary, if the panel was in another dock bar it will be moved to this dock bar.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace