RhinoCommon API
OrdinateDimension Constructor
Overload List
Name | Description
OrdinateDimension()
Initializes a new instance of the OrdinateDimension class
OrdinateDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
OrdinateDimension(Plane, OrdinateDimension.MeasuredDirection, Point3d, Point3d, Point3d, Double, Double)
 Constructs an ordinate dimension from parameters.
Top
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace