RhinoCommon API
RhinoDoc.SaveAs Method
Overload List
Name | Description
SaveAs(String)
 Save doc as a 3dm to a specified path using the current Rhino file version
SaveAs(String, Int32)
 Save doc as a 3dm to a specified path
SaveAs(String, Int32, Boolean, Boolean, Boolean, Boolean)
 Save doc as a 3dm to a specified path
SaveAs(String, Int32, Boolean, Boolean, Boolean, Boolean, Boolean)
 Save doc as a 3dm to a specified path
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace