RhinoCommon API
PersistentSettings.GetGuid Method
Overload List
Name | Description
GetGuid(String)
GetGuid(String, Guid)
GetGuid(String, Guid, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace