RhinoCommon API
ContentUndoHelper.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the ContentUndoHelper
Dispose(Boolean)
Releases the unmanaged resources used by the ContentUndoHelper and optionally releases the managed resources
Top
See Also
Reference
ContentUndoHelper Class
Rhino.Render Namespace