RhinoCommon API
TextFields.Date Method
Overload List
Name | Description
Date()
 Current date
Date(String)
 Current date in a specified format
Date(String, String)
 Current Date in a specific format and language
Top
See Also
Reference
TextFields Class
Rhino.Runtime Namespace