RhinoCommon API
StatusBar.HideProgressMeter Method
Overload List
Name | Description
HideProgressMeter()
 Ends, or hides, Rhino's status bar progress meter.
HideProgressMeter(UInt32)
 Ends, or hides, Rhino's status bar progress meter.
Top
See Also
Reference
StatusBar Class
Rhino.UI Namespace