RhinoCommon API
PersistentSettings.TryGetSettingIsHiddenFromUserInterface Method
Overload List
Name | Description
TryGetSettingIsHiddenFromUserInterface(String, Boolean)
 Values read from all users settings files will be marked as read-only which will cause any future calls to Set... to fail.
TryGetSettingIsHiddenFromUserInterface(String, Boolean, IEnumerable<String>)
 Values read from all users settings files will be marked as read-only which will cause any future calls to Set... to fail.
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace