RhinoCommon API
DisplayPipeline.DrawArrows Method
Overload List
Name | Description
DrawArrows(IEnumerable<Line>, Color)
 Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
DrawArrows(Line[], Color)
 Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace