RhinoCommon API
Intersection.MeshPlane Method
Overload List
Name | Description
MeshPlane(Mesh, Plane)
 Intersects a mesh with an infinite plane. ZeroTolerance is used as fixed tolerance. We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient instaed.
MeshPlane(Mesh, IEnumerable<Plane>)
 Intersects a mesh with a collection of infinite planes.
ZeroTolerance is used as fixed tolerance.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient instaed.
MeshPlane(Mesh, MeshIntersectionCache, Plane, Double)
 Intersects a mesh with an infinite plane.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient.
MeshPlane(Mesh, MeshIntersectionCache, IEnumerable<Plane>, Double)
 Intersects a mesh with a collection of infinite planes, providing both overlaps and perforations.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient.
MeshPlane(Mesh, MeshIntersectionCache, Plane, Double, Boolean)
 Intersects a mesh with an infinite plane.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient.
MeshPlane(Mesh, MeshIntersectionCache, IEnumerable<Plane>, Double, Boolean)
 Intersects a mesh with a collection of infinite planes.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by MeshIntersectionsTolerancesCoefficient.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace