RhinoCommon API
Mesh.SplitWithProjectedPolylines Method
Overload List
Name | Description
SplitWithProjectedPolylines(IEnumerable<PolylineCurve>, Double)
 Splits a mesh by adding edges in correspondence with input polylines, and divides the mesh at partitioned areas. Polyline segments that are measured not to be on the mesh will be ignored.
SplitWithProjectedPolylines(IEnumerable<PolylineCurve>, Double, TextLog, CancellationToken, IProgress<Double>)
 Splits a mesh by adding edges in correspondence with input polylines, and divides the mesh at partitioned areas. Polyline segments that are measured not to be on the mesh will be ignored.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace