RhinoCommon API
Linetype Constructor
Overload List
Name | Description
Linetype()
Initializes a new instance of the Linetype class
Linetype(Linetype)
Initializes a new instance of the Linetype class
Top
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace