RhinoCommon API
PersistentSettings.TryGetUnsignedInteger Method
Overload List
Name | Description
TryGetUnsignedInteger(String, UInt32)
TryGetUnsignedInteger(String, UInt32, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace