RhinoCommon API
SubD.EvaluateCurvature Method
Overload List
Name | Description
EvaluateCurvature(SubDComponentParameter, SurfaceCurvature)
 Evaluates the curvature of a point on this SubD's surface.
EvaluateCurvature(SubDComponentParameter, SubD.ExtraordinaryVertexCurvature, SurfaceCurvature)
 Evaluates the curvature of a point on this SubD's surface, choosing what to report exactly on an extraordinary vertex.
EvaluateCurvature(SubDComponentParameter, Point3d, Vector3d, Double, Double)
 Evaluates the principal curvatures of a point on this SubD's surface.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace