RhinoCommon API
Brep.JoinBreps Method
Overload List
Name | Description
JoinBreps(IEnumerable<Brep>, Double)
 Joins the breps in the input array at any overlapping edges to form as few as possible resulting breps. There may be more than one brep in the result array.
JoinBreps(IEnumerable<Brep>, Double, Double)
 Joins the breps in the input array at any overlapping edges to form as few as possible resulting breps. There may be more than one brep in the result array.
JoinBreps(IEnumerable<Brep>, Double, Double, List<Int32[]>)
 Joins the breps in the input array at any overlapping edges to form as few as possible resulting breps. There may be more than one brep in the result array.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace