RhinoCommon API
RhinoObject.GetMaterial Method
Overload List
Name | Description
GetMaterial(Boolean)
 Gets material that this object uses based on it's attributes and the document that the object is associated with. In the rare case that a document is not associated with this object, null will be returned.
GetMaterial(ComponentIndex)
 Get the Material associated with the sub object identified by componentIndex if the component index is set to ComponentIndex.Unset then the top level material is returned.
GetMaterial(ComponentIndex, Guid)
 Get the Material associated with the sub object identified by componentIndex if the component index is set to ComponentIndex.Unset then the top level material is returned.
GetMaterial(ComponentIndex, Guid, ObjectAttributes)
 Get the Material associated with the sub object identified by componentIndex if the component index is set to ComponentIndex.Unset then the top level material is returned.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace