RhinoCommon API
Unroller Constructor
Overload List
Name | Description
Unroller(Brep)
 Initializes a new instance of the Unroller class with a brep.
Unroller(Surface)
 Initializes a new instance of the Unroller class with surface.
Top
See Also
Reference
Unroller Class
Rhino.Geometry Namespace