RhinoCommon API
ShortcutKeySettings.SetMacro Method
Overload List
Name | Description
SetMacro(ShortcutKey, String)
 Set macro associated with a keyboard shortcut
SetMacro(KeyboardKey, ModifierKey, String)
 Set a macro for a given key and modifier combination
Top
See Also
Reference
ShortcutKeySettings Class
Rhino.ApplicationSettings Namespace