RhinoCommon API
Interval.Addition Operator
Overload List
Name | Description
Addition(Double, Interval)
 Shifts an interval by a specific amount (addition).
Addition(Interval, Double)
 Shifts a Interval by a specific amount (addition).
Top
See Also
Reference
Interval Structure
Rhino.Geometry Namespace