RhinoCommon API
Curve.GetNextDiscontinuity Method
Overload List
Name | Description
GetNextDiscontinuity(Continuity, Double, Double, Double)
 Searches for a derivative, tangent, or curvature discontinuity.
GetNextDiscontinuity(Continuity, Double, Double, Double, Double, Double)
 Searches for a derivative, tangent, or curvature discontinuity.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace