RhinoCommon API
NamedViewTable.Restore Method
Overload List
Name | Description
Restore(Int32, RhinoViewport)
 Sets the MainViewport of a standard RhinoView to a named views settings
Restore(Int32, RhinoView, Boolean) |  Obsolete.
Restore(Int32, RhinoViewport, Boolean) |  Obsolete.
Top
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace