RhinoCommon API
Plane.FitPlaneToPoints Method
Overload List
Name | Description
FitPlaneToPoints(IEnumerable<Point3d>, Plane)
Fit a plane through a collection of points.
FitPlaneToPoints(IEnumerable<Point3d>, Plane, Double)
Fit a plane through a collection of points.
Top
See Also
Reference
Plane Structure
Rhino.Geometry Namespace