RhinoCommon API
TextEntity.CreatePolysurfacesGrouped Method
Overload List
Name | Description
CreatePolysurfacesGrouped(DimensionStyle, Double, Double, Double)
 Creates 3d Breps from text outline curves. Breps are grouped such that each element in the list being returned represents a single character.
CreatePolysurfacesGrouped(DimensionStyle, Boolean, Double, Double, Double)
 Creates 3d Breps from text outline curves. Breps are grouped such that each element in the list being returned represents a single character.
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace