RhinoCommon API
DocumentCollectedException Constructor
Overload List
Name | Description
DocumentCollectedException()
 Initializes a new instance of the document controlled exception class.
DocumentCollectedException(String)
 Initializes a new instance of the document collected exception class.
Top
See Also
Reference
DocumentCollectedException Class
Rhino.Runtime Namespace