RhinoCommon API
Dimension Constructor
Overload List
Name | Description
Dimension()
Initializes a new instance of the Dimension class
Dimension(SerializationInfo, StreamingContext)
Initializes a new instance of the Dimension class
Top
See Also
Reference
Dimension Class
Rhino.Geometry Namespace