RhinoCommon API
NamedPositionTable.Append Method
Overload List
Name | Description
Append(Guid, IEnumerable<RhinoObject>)
Append objects to a Named Position.
Append(Guid, IEnumerable<Guid>)
Append objects to a Named Position.
Append(String, IEnumerable<RhinoObject>)
Append objects to a Named Position.
Append(String, IEnumerable<Guid>)
Append objects to a Named Position.
Top
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace