RhinoCommon API
PersistentSettings.GetInteger Method
Overload List
Name | Description
GetInteger(String)
GetInteger(String, Int32)
GetInteger(String, Int32, IEnumerable<String>)
GetInteger(String, Int32, Int32, Boolean)
GetInteger(String, Int32, Int32, Int32)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace