RhinoCommon API
BinaryArchiveWriter.BeginWrite3dmChunk Method
Overload List
Name | Description
BeginWrite3dmChunk(UInt32, Int64)
 Begins writing a chunk
BeginWrite3dmChunk(UInt32, Int32, Int32)
 Begins writing a chunk
Top
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace