RhinoCommon API
RhinoAccountsCannotListenException Constructor
Overload List
Name | Description
RhinoAccountsCannotListenException(Exception)
 Generates a new instance of the exception.
RhinoAccountsCannotListenException(String, Exception)
 Generates a new instance of the exception.
Top
See Also
Reference
RhinoAccountsCannotListenException Class
Rhino.Runtime.RhinoAccounts Namespace