RhinoCommon API
OptionInteger Constructor
Overload List
Name | Description
OptionInteger(Int32)
Initializes a new instance of the OptionInteger class
OptionInteger(Int32, Boolean, Int32)
 Initializes a new instance of the OptionInteger class.
OptionInteger(Int32, Int32, Int32)
 Initializes a new instance of the OptionInteger class with both lower and upper limits.
Top
See Also
Reference
OptionInteger Class
Rhino.Input.Custom Namespace