RhinoCommon API
ContentUndoBlocker.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the ContentUndoBlocker
Dispose(Boolean)
Releases the unmanaged resources used by the ContentUndoBlocker and optionally releases the managed resources
Top
See Also
Reference
ContentUndoBlocker Class
Rhino.Render Namespace