RhinoCommon API
Localization.LocalizeCommandOptionName Method
Overload List
Name | Description
LocalizeCommandOptionName(String, Int32)
LocalizeCommandOptionName(String, Int32, Int32) |  Obsolete.
 DO NOT use this function, it is a trap to determine where context IDs have been copied from other, already extracted, strings.
LocalizeCommandOptionName(String, Object, Int32)
Top
See Also
Reference
Localization Class
Rhino.UI Namespace