RhinoCommon API
AnimationProperties Constructor
Overload List
Name | Description
AnimationProperties()
 Initializes a new instance of the AnimationProperties class.
AnimationProperties(AnimationProperties)
 Initialize new instance of the AnimationProperties class.
Top
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace