RhinoCommon API
RhinoList<T>.FindLastIndex Method
Overload List
Name | Description
FindLastIndex(Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the last occurrence within the entire List.
FindLastIndex(Int32, Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the last occurrence within the entire List.
FindLastIndex(Int32, Int32, Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the last occurrence within the entire List.
Top
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace