RhinoCommon API
Sun.SetPosition Method
Overload List
Name | Description
SetPosition(Double, Double) |  Obsolete.
SetPosition(DateTime, Double, Double) |  Obsolete.
Top
See Also
Reference
Sun Class
Rhino.Render Namespace