RhinoCommon API
LengthValue.Length Method
Overload List
Name | Description
Length()
 Length value in this instance's current unit system
Length(LengthUnit)
 Length value in a given unit system
Length(UnitSystem)
 Length value in a given unit system
Top
See Also
Reference
LengthValue Class
Rhino Namespace