RhinoCommon API
ViewTable.GetViewList Method
Overload List
Name | Description
GetViewList(ViewTypeFilter)
 Gets an array of all the views.
GetViewList(Boolean, Boolean) |  Obsolete.
Gets an array of all the views.
Top
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace