RhinoCommon API
Plane.DistanceTo Method
Overload List
Name | Description
DistanceTo(Point3d)
 Returns the signed distance from testPoint to its projection onto this plane. If the point is below the plane, a negative distance is returned.
DistanceTo(BoundingBox, Double, Double)
 Returns the signed minimum and maximum distances from bounding box to this plane.
Top
See Also
Reference
Plane Structure
Rhino.Geometry Namespace