RhinoCommon API
Brep.IsExtrusion Method
Overload List
Name | Description
IsExtrusion()
Determines if the Brep is a portion of an extrusion within RhinoMath.ZeroTolerance.
IsExtrusion(Double)
Determines if the Brep is a portion of an extrusion within a given tolerance.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace