RhinoCommon API
SimpleArrayLinetypePointer.Dispose Method
Overload List
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 Dispose
Top
See Also
Reference
SimpleArrayLinetypePointer Class
Rhino.Runtime.InteropWrappers Namespace