RhinoCommon API
File3dmStringTable.GetValue Method
Overload List
Name | Description
GetValue(Int32)
 Returns a string value at a given index.
GetValue(String)
 Returns a string value at a key.
GetValue(String, String)
 Returns a string value given a section and entry.
Top
See Also
Reference
File3dmStringTable Class
Rhino.FileIO Namespace