RhinoCommon API
File3dmObjectTable.AddAngularDimension Method
Overload List
Name | Description
AddAngularDimension(AngularDimension)
 Adds a angular dimension object to the 3dm file object table.
AddAngularDimension(AngularDimension, ObjectAttributes)
 Adds a angular dimension object to the 3dm file object table.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace