RhinoCommon API
GetCancel.Wait Method
Overload List
Name | Description
Wait(Task, RhinoDoc)
 Awaits a particular task to finish.
Wait<TResult>(Task<TResult>, RhinoDoc)
 Awaits a particular task to finish.
Top
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace