RhinoCommon API
MeshTopologyEdgeList.GetEdgesForFace Method
Overload List
Name | Description
GetEdgesForFace(Int32)
 Gets indices of edges that surround a given face.
GetEdgesForFace(Int32, Boolean[])
 Gets indices of edges that surround a given face.
Top
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace