RhinoCommon API
PersistentSettings.SetColor Method
Overload List
Name | Description
SetColor(String, Color)
SetColor(String, Nullable<Color>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace