RhinoCommon API
TextDot Constructor
Overload List
Name | Description
TextDot(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
TextDot(String, Point3d)
 Initializes a new text dot based on the text and the location.
Top
See Also
Reference
TextDot Class
Rhino.Geometry Namespace