RhinoCommon API
RhinoView.ShowToast Method
Overload List
Name | Description
ShowToast(String)
 Shows a temporary popup message in the lower right corner of the view
ShowToast(String, Int32)
 Shows a temporary popup message in the lower right corner of the view
ShowToast(String, Int32, PointF)
 Shows a temporary popup message in the lower right corner of the view
Top
See Also
Reference
RhinoView Class
Rhino.Display Namespace