RhinoCommon API
ColorRGBA Constructor
Overload List
Name | Description
ColorRGBA(Color)
 Constructs a new instance of ColorRGBA that is equivalent to an ARGB color.
ColorRGBA(ColorRGBA)
Initializes a new instance of the ColorRGBA class
ColorRGBA(Int32)
 Constructs a new instance of ColorRGBA that is equivalent to an ARGB color.
ColorRGBA(ColorRGBA, Double)
Initializes a new instance of the ColorRGBA class
ColorRGBA(Double, Double, Double)
Initializes a new instance of the ColorRGBA class
ColorRGBA(Double, Double, Double, Double)
Initializes a new instance of the ColorRGBA class
Top
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace