RhinoCommon API
Brep.CreateFromLoftRebuild Method
Overload List
Name | Description
CreateFromLoftRebuild(IEnumerable<Curve>, Point3d, Point3d, LoftType, Boolean, Int32)
 Constructs one or more Breps by lofting through a set of curves. Input for the loft is simplified by rebuilding to a specified number of control points.
CreateFromLoftRebuild(IEnumerable<Curve>, Point3d, Point3d, LoftType, Boolean, Double, Int32)
 Constructs one or more Breps by lofting through a set of curves. Input for the loft is simplified by rebuilding to a specified number of control points.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace