RhinoCommon API
PostEffectJob.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the PostEffectJob
Dispose(Boolean)
Releases the unmanaged resources used by the PostEffectJob and optionally releases the managed resources
Top
See Also
Reference
PostEffectJob Class
Rhino.Render.PostEffects Namespace