RhinoCommon API
MeshClash.Search Method
Overload List
Name | Description
Search(IEnumerable<RhinoObject>, IEnumerable<RhinoObject>, Double)
 Searches for locations where the distance from a RhinoObject, in one set of objects, is less than the specified distance to another RhinoObject in a second set of objects. This function uses the object's mesh to calculate the interferences. Acceptable object types include: BrepObject, ExtrusionObject, MeshObject, and SubDObject.
Search(IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Int32)
 Searches for locations where the distance from a mesh in one set of meshes is less than distance to another mesh in a second set of meshes.
Search(Mesh, Mesh, Double, Int32)
 Searches the locations where the distance from the first mesh to the second mesh is less than the provided value.
Search(Mesh, IEnumerable<Mesh>, Double, Int32)
 Searches the locations where the distance from the first mesh to a mesh in the second set of meshes is less than the provided value.
Search(IEnumerable<RhinoObject>, IEnumerable<RhinoObject>, Double, MeshType, MeshingParameters)
 Searches for locations where the distance from a RhinoObject, in one set of objects, is less than the specified distance to another RhinoObject in a second set of objects. This function uses the object's mesh to calculate the interferences. Acceptable object types include: BrepObject, ExtrusionObject, MeshObject, and SubDObject.
Top
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace