RhinoCommon API
Vector3d.VectorAngle Method
Overload List
Name | Description
VectorAngle(Vector3d, Vector3d)
 Compute the angle between two vectors.
This operation is commutative.
VectorAngle(Vector3d, Vector3d, Plane)
 Computes the angle on a plane between two vectors.
VectorAngle(Vector3d, Vector3d, Vector3d)
 Computes the angle of v1, v2 with a normal vector.
Top
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace