RhinoCommon API
Extrusion Constructor
Overload List
Name | Description
Extrusion()
 Initializes a new instance of the Extrusion class.
Extrusion(SerializationInfo, StreamingContext)
 Protected serialization constructor.
Top
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace