RhinoCommon API
Brep.DuplicateEdgeCurves Method
Overload List
Name | Description
DuplicateEdgeCurves()
 Duplicate all the edges of this Brep.
DuplicateEdgeCurves(Boolean)
 Duplicate edges of this Brep.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace