RhinoCommon API
File3dm.ToByteArray Method
Overload List
Name | Description
ToByteArray()
 Write to an in-memory byte[]
ToByteArray(File3dmWriteOptions)
 Write to an in-memory byte[]
Top
See Also
Reference
File3dm Class
Rhino.FileIO Namespace