RhinoCommon API
FilePdf.Write Method
Overload List
Name | Description
Write(Stream)
 Write PDF to a stream
Write(String)
 Write PDF to a file
Top
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace