RhinoCommon API
Curve.LengthParameter Method
Overload List
Name | Description
LengthParameter(Double, Double)
 Gets the parameter along the curve which coincides with a given length along the curve. A fractional tolerance of 1e-8 is used in this version of the function.
LengthParameter(Double, Double, Interval)
 Gets the parameter along the curve which coincides with a given length along the curve. A fractional tolerance of 1e-8 is used in this version of the function.
LengthParameter(Double, Double, Double)
 Gets the parameter along the curve which coincides with a given length along the curve.
LengthParameter(Double, Double, Double, Interval)
 Gets the parameter along the curve which coincides with a given length along the curve.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace