RhinoCommon API
PersistentSettings.TryGetPoint Method
Overload List
Name | Description
TryGetPoint(String, Point)
TryGetPoint(String, Point, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace