RhinoCommon API
Brep.CreateFromMatch Method
Overload List
Name | Description
CreateFromMatch(BrepEdge, Curve, MatchSrfSettings, Brep, Brep)
 Match an edge to the target curve using the settings provided
CreateFromMatch(BrepEdge, IEnumerable<Curve>, MatchSrfSettings, Brep, Brep)
 Match an edge to the target curves using the settings provided
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace