RhinoCommon API
Curve.InflectionPoints Method
Overload List
Name | Description
InflectionPoints()
 Returns a curve's inflection points. An inflection point is a location on a curve at which the sign of the curvature (i.e., the concavity) changes. The curvature at these locations is always 0.
InflectionPoints(Double[])
 Returns a curve's inflection points. An inflection point is a location on a curve at which the sign of the curvature (i.e., the concavity) changes. The curvature at these locations is always 0.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace