RhinoCommon API
Markup Constructor
Overload List
Name | Description
Markup()
Create a new instance of a Markup
Markup(Markup)
Create a new Markup that is a copy of another Markup
Top
See Also
Reference
Markup Class
Rhino.DocObjects Namespace