RhinoCommon API
Brep.CreatePatch Method
Overload List
Name | Description
CreatePatch(IEnumerable<GeometryBase>, Surface, Double)
 Constructs a brep patch.
This is the simple version of fit that uses a specified starting surface.
CreatePatch(IEnumerable<GeometryBase>, Int32, Int32, Double)
 Constructs a brep patch.
This is the simple version of fit that uses a plane with u x v spans. It makes a plane by fitting to the points from the input geometry to use as the starting surface. The surface has the specified u and v span count.
CreatePatch(IEnumerable<GeometryBase>, Surface, Int32, Int32, Boolean, Boolean, Double, Double, Double, Boolean[], Double)
 Constructs a brep patch using all controls
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace