RhinoCommon API
RhinoAccountsException Constructor
Overload List
Name | Description
RhinoAccountsException(Exception)
 Generates a new instance of the exception.
RhinoAccountsException(String, Exception)
 Generates a new instance of the exception.
Top
See Also
Reference
RhinoAccountsException Class
Rhino.Runtime.RhinoAccounts Namespace