RhinoCommon API
Mesh.CreateFromBrep Method
Overload List
Name | Description
CreateFromBrep(Brep) |  Obsolete.
 Constructs a mesh from a brep.
CreateFromBrep(Brep, MeshingParameters)
 Constructs a mesh from a brep.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace