RhinoCommon API
CustomDisplay.AddPoints Method
Overload List
Name | Description
AddPoints(IEnumerable<Point3d>)
 Adds a collection of black points to the display list.
AddPoints(IEnumerable<Point3d>, Color)
 Adds a collection of colored points to the display list.
AddPoints(IEnumerable<Point3d>, Color, PointStyle, Int32)
 Adds a collection of stylized points to the display list.
Top
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace