RhinoCommon API
FileCsvDocument.SetRow Method
Overload List
Name | Description
SetRow(Int32, IEnumerable<String>)
 Sets the fields of a row, addressed by index, growing the document as needed (any intervening rows are created and filled with empty fields). This is the row-level counterpart to GetRow(Int32). The number of fields must equal ColumnCount. A null field is stored as an empty field.
SetRow(Int32, String[])
 Sets the fields of a row, addressed by index, growing the document as needed (any intervening rows are created and filled with empty fields). This is the row-level counterpart to GetRow(Int32). The number of fields must equal ColumnCount. A null field is stored as an empty field.
Top
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace