RhinoCommon API
SubD.CreateFromSweep Method
Overload List
Name | Description
CreateFromSweep(NurbsCurve, NurbsCurve, IEnumerable<NurbsCurve>, Boolean, Boolean)
 Fits a SubD through a series of profile curves that define the SubD cross-sections and two curves that defines SubD edges.
CreateFromSweep(NurbsCurve, IEnumerable<NurbsCurve>, Boolean, Boolean, Boolean, Vector3d)
 Fits a SubD through a series of profile curves that define the SubD cross-sections and one curve that defines a SubD edge.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace