RhinoCommon API
Brep.CreateFromLoft Method
Overload List
Name | Description
CreateFromLoft(IEnumerable<Curve>, Point3d, Point3d, LoftType, Boolean)
 Constructs one or more Breps by lofting through a set of curves.
CreateFromLoft(IEnumerable<Curve>, Point3d, Point3d, LoftType, Boolean, Double)
 Constructs one or more Breps by lofting through a set of curves.
CreateFromLoft(IEnumerable<Curve>, Point3d, Point3d, Boolean, Boolean, BrepTrim, BrepTrim, LoftType, Boolean)
 Constructs one or more Breps by lofting through a set of curves, optionally matching start and end tangents of surfaces when first and/or last loft curves are surface edges
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace