RhinoCommon API
PersistentSettings.GetSize Method
Overload List
Name | Description
GetSize(String)
GetSize(String, Size)
GetSize(String, Size, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace