RhinoCommon API
WorksessionFile.Write Method
Overload List
Name | Description
Write(String)
 Writes a version 5 worksession file.
Write(String, Int32)
Writes a worksession file.
Top
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace