RhinoCommon API
LicenseData Constructor
Overload List
Name | Description
LicenseData()
 Public constructor.
LicenseData(String, String, String)
 Public constructor
LicenseData(String, String, String, LicenseBuildType)
 Public constructor
LicenseData(String, String, String, LicenseBuildType, Int32)
 Public constructor
LicenseData(String, String, String, LicenseBuildType, Int32, Nullable<DateTime>)
 Public constructor
LicenseData(String, String, String, LicenseBuildType, Int32, Nullable<DateTime>, Icon)
 Public constructor
LicenseData(String, String, String, LicenseBuildType, Int32, Nullable<DateTime>, Icon, Boolean, Boolean)
 Public constructor
Top
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace