RhinoCommon API
ObjectTable.Delete Method
Overload List
Name | Description
Delete(RhinoObject)
 Deletes an object, taking into account modes and not showing error message boxes.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Guid, Boolean)
 Deletes object from document. The deletion can be undone by calling UndeleteObject().
Delete(IEnumerable<Guid>, Boolean)
 Deletes a collection of objects from the document.
Delete(ObjRef, Boolean)
 Deletes objref.Object(). The deletion can be undone by calling UndeleteObject().
Delete(RhinoObject, Boolean)
 Deletes object from document. The deletion can be undone by calling UndeleteObject().
Delete(ObjRef, Boolean, Boolean)
 Deletes objref.Object(). The deletion can be undone by calling UndeleteObject().
Delete(RhinoObject, Boolean, Boolean)
 Deletes object from document. The deletion can be undone by calling UndeleteObject().
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace