RhinoCommon API
File3dmObjectTable.AddRadialDimension Method
Overload List
Name | Description
AddRadialDimension(RadialDimension)
 Adds a radial dimension object to the 3dm file object table.
AddRadialDimension(RadialDimension, ObjectAttributes)
 Adds a radial dimension object to the 3dm file object table.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace