RhinoCommon API
BrepFaceList.Add Method
Overload List
Name | Description
Add(Int32)
 Create and add a new face to this list. An incomplete face is added. The caller must create and fill in the loops used by the face.
Add(Surface)
 Add a new face to a brep. This creates a complete face with new vertices at the surface corners, new edges along the surface boundary, etc. The loop of the returned face has four trims that correspond to the south, east, north, and west side of the surface in that order. If you use this version of Add to add an exiting brep, then you are responsible for using a tool like JoinEdges() to hook the new face to its neighbors.
Top
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace