RhinoCommon API
File3dmObjectTable.AddPointCloud Method
Overload List
Name | Description
AddPointCloud(IEnumerable<Point3d>)
Adds a point cloud object to the document.
AddPointCloud(PointCloud)
Adds a point cloud object to the document.
AddPointCloud(IEnumerable<Point3d>, ObjectAttributes)
Adds a point cloud object to the document.
AddPointCloud(PointCloud, ObjectAttributes)
Adds a point cloud object to the document.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace