RhinoCommon API
StatusBar.UpdateProgressMeter Method
Overload List
Name | Description
UpdateProgressMeter(Int32, Boolean)
 Sets the current position of Rhino's status bar progress meter.
UpdateProgressMeter(String, Int32, Boolean)
 Sets the label and current position of Rhino's status bar progress meter.
UpdateProgressMeter(UInt32, Int32, Boolean)
 Sets the current position of Rhino's status bar progress meter.
UpdateProgressMeter(UInt32, String, Int32, Boolean)
 Sets the label and current position of Rhino's status bar progress meter.
Top
See Also
Reference
StatusBar Class
Rhino.UI Namespace