RhinoCommon API
Vector3f.Multiply Operator
Overload List
Name | Description
Multiply(Single, Vector3f)
 Multiplies a vector by a number, having the effect of scaling it.
Multiply(Vector3f, Vector3f)
 Multiplies two Vector3f together, returning the dot (internal) product of the two. This is not the cross product.
Multiply(Vector3f, Single)
 Multiplies a vector by a number, having the effect of scaling it.
Top
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace