RhinoCommon API
DrawingUtilities.BitmapFromSvg Method
Overload List
Name | Description
BitmapFromSvg(String, Int32, Int32)
 Create bitmap of a given size from an svg string
BitmapFromSvg(String, Int32, Int32, Boolean)
 Create bitmap of a given size from an svg string
Top
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace