RhinoCommon API
RhinoViewport.IsVisible Method
Overload List
Name | Description
IsVisible(BoundingBox)
 Returns true if some portion of a world coordinate bounding box is potentially visible in the viewing frustum.
IsVisible(Point3d)
 Determines if a world coordinate point is visible in the viewing frustum.
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace