RhinoCommon API
Panels.RegisterPanel Method
Overload List
Name | Description
RegisterPanel(PlugIn, Type, String, Icon)
 You typically register your panel class in your plug-in's OnLoad function. This will register your custom call with Rhino, Rhino will create an instance of your class the first time your panel is created and embed this instance of your class in a panel container.
RegisterPanel(PlugIn, Type, String, Icon, PanelType)
 Call once to register a panel type which will get dynamically created and embedded in a Rhino docking/floating location.
RegisterPanel(PlugIn, Type, String, Assembly, String, PanelType)
 You typically register your panel class in your plug-in's OnLoad function. This will register your custom call with Rhino, Rhino will create an instance of your class the first time your panel is created and embed this instance of your class in a panel container.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace