RhinoCommon API
Rectangle3d.RecenterPlane Method
Overload List
Name | Description
RecenterPlane(Int32)
 Re-centers the base plane on one of the corners.
RecenterPlane(Point3d)
 Re-centers the base plane on a new origin.
Top
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace