RhinoCommon API
SubD.CreateSubDBox Method
Overload List
Name | Description
CreateSubDBox(Box, Double, UInt32, UInt32, UInt32)
 Creates a SubD box from a Box.
CreateSubDBox(IEnumerable<Point3d>, Double, UInt32, UInt32, UInt32)
 Creates a SubD box.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace