RhinoCommon API
SubDEdgeSharpness.FromIntervalPercentage Method
Overload List
Name | Description
FromIntervalPercentage(Interval)
 Creates a sharpness that varies from one end of the edge to the other, from percentages. This is useful in user interface code that expresses sharpness as a percentage.
FromIntervalPercentage(Double, Double)
 Creates a sharpness that varies from one end of the edge to the other, from percentages. This is useful in user interface code that expresses sharpness as a percentage.
Top
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace