RhinoCommon API
SubDSurfaceInterpolator.IsInterpolatedVertex Method
Overload List
Name | Description
IsInterpolatedVertex(SubDVertex)
IsInterpolatedVertex(UInt32)
Top
See Also
Reference
SubDSurfaceInterpolator Class
Rhino.Geometry Namespace