RhinoCommon API
FileCsvDocument.TryGetString Method
Overload List
Name | Description
TryGetString(Int32, Int32, String)
 Retrieves the value of a cell as a string.
TryGetString(String, Int32, String)
 Retrieves the value of a cell as a string, addressing the column by header name.
Top
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace