RhinoCommon API
FileCsvDocument.Read Method
Overload List
Name | Description
Read(String)
 Reads a CSV file from disk. The file is assumed to have no header row.
Read(TextReader)
 Reads CSV content from a text reader. The content is assumed to have no header row.
Read(String, Boolean)
 Reads a CSV file from disk.
Read(TextReader, Boolean)
 Reads CSV content from a text reader.
Top
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace