RhinoCommon API
File3dmObjectTable.Add Method
Overload List
Name | Description
Add(File3dmObject)
 Duplicates the object, then adds a copy of the object to the document.
 (Overrides File3dmCommonComponentTable<T>.Add(T).)
Add(GeometryBase, ObjectAttributes)
 Duplicates the object, then adds a copy of the object to the document.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace