RhinoCommon API
Material.SetBitmapTexture Method
Overload List
Name | Description
SetBitmapTexture(String)
SetBitmapTexture(Texture)
SetBitmapTexture(String, Bitmap)
 Uses the pixels of an in-memory bitmap as this material's bitmap texture, without writing an image file.
 The pixels are copied into TextureCache under name. Calling this again with the same name replaces them in place, and the change shows up on the next redraw.
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace