RhinoCommon API
Vector3f.Divide Method
Overload List
Name | Description
Divide(Vector3f, Double)
 Divides a Vector3f by a number, having the effect of shrinking it, t times.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
Divide(Vector3f, Single)
 Divides a Vector3f by a number, having the effect of shrinking it, t times.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
Top
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace