RhinoCommon API
Brep.CreateTrimmedPlane Method
Overload List
Name | Description
CreateTrimmedPlane(Plane, Curve)
 Create a Brep trimmed plane.
CreateTrimmedPlane(Plane, IEnumerable<Curve>)
 Create a Brep trimmed plane.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace