RhinoCommon API
File3dmObjectTable.AddText Method
Overload List
Name | Description
AddText(Text3d)
 Adds an annotation text object to the document.
AddText(Text3d, ObjectAttributes)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean, ObjectAttributes)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean, TextJustification)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean, TextJustification, ObjectAttributes)
 Adds an annotation text object to the document.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace