RhinoCommon API
Mesh.CreateFromSurface Method
Overload List
Name | Description
CreateFromSurface(Surface)
 Constructs a mesh from a surface
CreateFromSurface(Surface, MeshingParameters)
 Constructs a mesh from a surface
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace