RhinoCommon API
Brep.CreateBooleanUnion Method
Overload List
Name | Description
CreateBooleanUnion(IEnumerable<Brep>, Double)
 Compute the Boolean Union of a set of Breps.
CreateBooleanUnion(IEnumerable<Brep>, Double, Boolean)
 Compute the Boolean Union of a set of Breps.
CreateBooleanUnion(IEnumerable<Brep>, Double, Boolean, Point3d[], Point3d[], Point3d[])
 Compute the Boolean Union of a set of Breps.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace