RhinoCommon API
PersistentSettings.TryGetStringList Method
Overload List
Name | Description
TryGetStringList(String, String[])
TryGetStringList(String, String[], IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace