RhinoCommon API
File3dmLayerTable.AddLayer Method
Overload List
Name | Description
AddLayer(String, Color)
 Easy way to add a new layer to the model.
AddLayer(String, Color, Guid)
 Add a new layer to the model.
Top
See Also
Reference
File3dmLayerTable Class
Rhino.FileIO Namespace