RhinoCommon API
RenderPipeline.RenderSize Method
Overload List
Name | Description
RenderSize() |  Obsolete.
RenderSize(RhinoDoc)
 Get the render size as specified in the ON_3dmRenderSettings. Will automatically return the correct size based on the ActiveView or custom settings.
RenderSize(RhinoDoc, Boolean)
 Get the render size as specified in the ON_3dmRenderSettings, and from RenderSources when fromRenderSources is true.
Top
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace