RhinoCommon API
FieldDictionary.TryGetValue Method
Overload List
Name | Description
TryGetValue(String, Color4f)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Point2d)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Point3d)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Point4d)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Transform)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Vector2d)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Vector3d)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Boolean)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Byte[])
 Find a field with the specified key and get its value if found.
TryGetValue(String, DateTime)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Double)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Color)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Guid)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Int32)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Single)
 Find a field with the specified key and get its value if found.
TryGetValue(String, String)
 Find a field with the specified key and get its value if found.
TryGetValue<T>(String, T)
 Parametrized version of TryGetValue.
Top
See Also
Reference
FieldDictionary Class
Rhino.Render.Fields Namespace