RhinoCommon API
BrepTrimList.Add Method
Overload List
Name | Description
Add(Int32)
 Add a new trim that will be part of an inner, outer, or slit loop to the brep.
Add(Boolean, BrepEdge, Int32)
 Add a new trim that will be part of an inner, outer, or slit loop to the brep
Add(Boolean, BrepLoop, Int32)
 Add a new trim that will be part of an inner, outer, or slit loop to the brep
Add(BrepEdge, Boolean, BrepLoop, Int32)
 Add a new trim that will be part of an inner, outer, or slit loop to the brep.
Top
See Also
Reference
BrepTrimList Class
Rhino.Geometry.Collections Namespace