RhinoCommon API
ViewInfo Constructor
Overload List
Name | Description
ViewInfo()
 Create a default ViewInfo instance
ViewInfo(RhinoViewport)
 Access to the ViewInfo for given RhinoViewport
ViewInfo(UInt32)
 Construct the ViewInfo for active viewport of given doc.
Top
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace