RhinoCommon API
Surface.Pushup Method
Overload List
Name | Description
Pushup(Curve, Double)
 Computes a 3d curve that is the composite of a 2d curve and the surface map.
Pushup(Curve, Double, Interval)
 Computes a 3d curve that is the composite of a 2d curve and the surface map.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace