RhinoCommon API
RhinoObject.Select Method
Overload List
Name | Description
Select(Boolean)
Selects an object.
Select(Boolean, Boolean)
Selects an object.
Select(Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
Selects an object.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace