RhinoCommon API
GetBaseClass.AddOptionEnumSelectionList Method
Overload List
Name | Description
AddOptionEnumSelectionList<T>(LocalizeStringPair, IEnumerable<T>, Int32)
 Adds a list of enumerated values as option list. Use enumSelection[go.Option.CurrentListOptionIndex] to retrieve selection.
AddOptionEnumSelectionList<T>(String, IEnumerable<T>, Int32)
 Adds a list of enumerated values as option list. Use enumSelection[go.Option.CurrentListOptionIndex] to retrieve selection.
Top
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace