RhinoCommon API
RhinoDoc.OpenHeadless Method
Overload List
Name | Description
OpenHeadless(String)
 Opens a 3DM file into a new headless RhinoDoc.
OpenHeadless(String, ArchivableDictionary)
 Opens a file into a new headless RhinoDoc.
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace