RhinoCommon API
Worksession.Attach Method
Overload List
Name | Description
Attach(IEnumerable<String>)
 Attaches several models to this worksession as reference models.
Attach(String)
 Attaches a model to this worksession as a reference model.
Top
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace