RhinoCommon API
LayerTable.AddPath Method
Overload List
Name | Description
AddPath(String)
 Adds all of the layer in the specified layer path, beginning with the root. Layer paths contain one or more valid layers names, with each name separated by NamePathSeparator. For example, "Grandfather::Father::Son".
AddPath(String, Color)
 Adds all of the layer in the specified layer path, beginning with the root. Layer paths contain one or more valid layers names, with each name separated by NamePathSeparator. For example, "Grandfather::Father::Son".
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace