RhinoCommon API
Vector2d.Multiply Method
Overload List
Name | Description
Multiply(Double, Vector2d)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector2d, Vector2d)
 Multiplies two vectors together, returning the dot product (or inner product).
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector2d, Double)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Top
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace