RhinoCommon API
Mesh.NormalAt Method
Overload List
Name | Description
NormalAt(MeshPoint)
 Evaluate a mesh normal at a set of barycentric coordinates.
NormalAt(Int32, Double, Double, Double, Double)
 Evaluate a mesh normal at a set of barycentric coordinates. Barycentric coordinates must be assigned in accordance with the rules as defined by MeshPoint.T.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace