RhinoCommon API
DisplayPipeline.DrawInstanceDefinition Method
Overload List
Name | Description
DrawInstanceDefinition(InstanceDefinition)
 Draws an InstanceDefinition.
DrawInstanceDefinition(InstanceDefinition, Transform)
 Draws an InstanceDefinition.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace