RhinoCommon API
ObjectTable.AddRectangle Method
Overload List
Name | Description
AddRectangle(Rectangle3d)
 Adds a rectangle to the object table.
AddRectangle(Rectangle3d, ObjectAttributes)
 Adds a rectangle to the object table.
AddRectangle(Rectangle3d, ObjectAttributes, HistoryRecord, Boolean)
 Adds a rectangle to the object table.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace