RhinoCommon API
Sphere.Rotate Method
Overload List
Name | Description
Rotate(Double, Vector3d)
 Rotates the sphere about the center point.
Rotate(Double, Vector3d, Point3d)
 Rotates this sphere about a point and an axis.
Rotate(Double, Double, Vector3d)
 Rotates this sphere about the center point.
Rotate(Double, Double, Vector3d, Point3d)
 Rotates this sphere about a point and an axis.
Top
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace