RhinoCommon API
ObjectAttributes.RemoveDisplayModeOverride Method
Overload List
Name | Description
RemoveDisplayModeOverride()
 By default, objects are drawn using the display mode of the viewport that the object is being drawn in. Setting a specific display mode, instructs Rhino to always use that display mode, regardless of the viewport's mode. This function resets an object to use the viewport's display mode for all viewports.
RemoveDisplayModeOverride(Guid)
 By default, objects are drawn using the display mode of the viewport that the object is being drawn in. Setting a specific display mode, instructs Rhino to always use that display mode, regardless of the viewport's mode. This function resets an object to use the viewport's display mode.
Top
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace