RhinoCommon API
Transform2d.Scale Method
Overload List
Name | Description
Scale(Point2d, Double)
 Constructs a new uniform scaling transformation with a specified anchor point.
Scale(Point2d, Double, Double)
 Constructs a new non-uniform scaling transformation with a specified anchor point.
Top
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace