RhinoCommon API
BrepEdgeList.Add Method
Overload List
Name | Description
Add(Int32)
 Create and add a new edge to this list
Add(BrepVertex, BrepVertex, Int32, Double)
 Create and add a new edge to this list
Add(Int32, Int32, Int32, Double)
 Create and add a new edge to this list
Add(BrepVertex, BrepVertex, Int32, Interval, Double)
 Create and add a new edge to this list
Add(Int32, Int32, Int32, Interval, Double)
 Create and add a new edge to this list
Top
See Also
Reference
BrepEdgeList Class
Rhino.Geometry.Collections Namespace