RhinoCommon API
RuntimeDocumentDataTable.TryGetValue Method
Overload List
Name | Description
TryGetValue<T>(Object)
 Check dictionary for value and return it properly cast if found.
Top
See Also
Reference
RuntimeDocumentDataTable Class
Rhino.DocObjects.Tables Namespace