RhinoCommon API
LinetypeTable.LoadDefaultLinetypes Method
Overload List
Name | Description
LoadDefaultLinetypes()
 Fills in the linetype table with any default linetypes not already included.
LoadDefaultLinetypes(Boolean)
 Fills in the linetype table with any default linetypes not already included.
Top
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace