RhinoCommon API
FileImportPlugIn.MakeReferenceTableName Method
Overload List
Name | Description
MakeReferenceTableName(String) |  Obsolete.
MakeReferenceTableName(RhinoDoc, String)
Top
See Also
Reference
FileImportPlugIn Class
Rhino.PlugIns Namespace