RhinoCommon API
Mesh.CreateBooleanIntersection Method
Overload List
Name | Description
CreateBooleanIntersection(IEnumerable<Mesh>, IEnumerable<Mesh>)
 Computes the solid intersection of two sets of meshes.
CreateBooleanIntersection(IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result)
 Computes the solid intersection of two sets of meshes.
CreateBooleanIntersection(IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result, Int32[][])
 Computes the solid intersection of two sets of meshes and reports which inputs contributed to each output.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace