RhinoCommon API
LicenseUtils.GetLicense Method
Overload List
Name | Description
GetLicense(ValidateProductKeyDelegate, OnLeaseChangedDelegate, Int32, Int32, String, String, String, Guid, Guid)
 This version of Rhino.PlugIns.LicenseUtils.GetLicense is used by Rhino C++ plug-ins.
GetLicense(ValidateProductKeyDelegate, OnLeaseChangedDelegate, VerifyLicenseKeyDelegate, VerifyPreviousVersionLicenseDelegate, Int32, Int32, String, String, String, Guid, Guid)
Top
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace