RhinoCommon API
CustomRenderMeshProvider.BoundingBox Method
Overload List
Name | Description
BoundingBox(ViewportInfo, RhinoObject, Guid, Boolean)
 Returns a bounding box for the custom render meshes for the given object.
BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes)
Top
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace