RhinoCommon API
RhinoViewport.ChangeToPerspectiveProjection Method
Overload List
Name | Description
ChangeToPerspectiveProjection(Boolean, Double)
 Use this function to change projections of valid viewports from parallel to perspective. It will make common additional adjustments to the frustum and camera location so the resulting views are similar. The camera direction and target point are not be changed.
ChangeToPerspectiveProjection(Double, Boolean, Double)
 Use this function to change projections of valid viewports from parallel to perspective. It will make common additional adjustments to the frustum and camera location so the resulting views are similar. The camera direction and target point are not be changed.
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace