RhinoCommon API
FieldDictionary.AddTextured Method
Overload List
Name | Description
AddTextured(String, String)
 Add a new NullField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Color4f, String) |  Obsolete.
AddTextured(String, Point2d, String)
 Add a new Point2dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point3d, String)
 Add a new Point3dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point4d, String)
 Add a new Point4dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Transform, String)
 Add a new TransformField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Vector2d, String)
 Add a new Vector2dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Vector3d, String)
 Add a new Vector3dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Boolean, String)
 Add a new BoolField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, DateTime, String)
 Add a new DateTimeField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Double, String)
 Add a new DoubleField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Color, String)
 Add a new Color4fField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Guid, String)
 Add a new GuidField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Int32, String)
 Add a new IntField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Single, String)
 Add a new FloatField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, String, Boolean)
 Add a new NullField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, String, String)
 Add a new StringField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Color4f, String, Boolean)
 Add a new Color4fField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point2d, String, Boolean)
 Add a new Point2dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point3d, String, Boolean)
 Add a new Point3dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point4d, String, Boolean)
 Add a new Point4dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Transform, String, Boolean)
 Add a new TransformField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Vector2d, String, Boolean)
 Add a new Vector2dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Vector3d, String, Boolean)
 Add a new Vector3dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Boolean, String, Boolean)
 Add a new BoolField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, DateTime, String, Boolean)
 Add a new DateTimeField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Double, String, Boolean)
 Add a new DoubleField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Color, String, Boolean)
 Add a new Color4fField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Guid, String, Boolean)
 Add a new GuidField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Int32, String, Boolean)
 Add a new IntField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Single, String, Boolean)
 Add a new FloatField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, String, Boolean, Int32)
 Add a new NullField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, String, String, Boolean)
 Add a new StringField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Color4f, String, Boolean, Int32)
 Add a new Color4fField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point2d, String, Boolean, Int32)
 Add a new Point2dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point3d, String, Boolean, Int32)
 Add a new Point3dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point4d, String, Boolean, Int32)
 Add a new Point4dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Transform, String, Boolean, Int32)
 Add a new TransformField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Vector2d, String, Boolean, Int32)
 Add a new Vector2dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Vector3d, String, Boolean, Int32)
 Add a new Vector3dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Boolean, String, Boolean, Int32)
 Add a new BoolField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, DateTime, String, Boolean, Int32)
 Add a new DateTimeField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Double, String, Boolean, Int32)
 Add a new DoubleField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Guid, String, Boolean, Int32)
 Add a new GuidField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Int32, String, Boolean, Int32)
 Add a new IntField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Single, String, Boolean, Int32)
 Add a new FloatField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, String, String, Boolean, Int32)
 Add a new StringField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
Top
See Also
Reference
FieldDictionary Class
Rhino.Render.Fields Namespace