RhinoCommon API
MeshFaceList.ToIntArray Method
Overload List
Name | Description
ToIntArray(Boolean)
 Copies all of the face indices to a linear array of indices per face. Note that this includes indices from invalid faces too.
ToIntArray(Boolean, List<Int32>)
 Copies all of the faces to a linear array of indices. Clean-up of vertex indices if replacedIndices is a valid List<int> ///
Top
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace