RhinoCommon API
Interop.NSFontFromFont Method
Overload List
Name | Description
NSFontFromFont(Font)
 Get native NSFont* from a Rhino Font. Only works on Mac
NSFontFromFont(Font, Double)
 Get native NSFont* from a Rhino Font. Only works on Mac
Top
See Also
Reference
Interop Class
Rhino.Runtime Namespace