RhinoCommon API
RenderTabs.RegisterTab Method
Overload List
Name | Description
RegisterTab(PlugIn, Type, String, Icon) |  Obsolete.
 Register custom render user interface with Rhino. This should only be done in RegisterRenderTabs(RenderTabs). Panels registered after RegisterRenderTabs(RenderTabs) is called will be ignored. If the class includes a public method "void DoHelp()" the method will get called when F1 is pressed and the custom tab is active.
RegisterTab(PlugIn, Type, Guid, String, Icon)
Top
See Also
Reference
RenderTabs Class
Rhino.Render Namespace