RhinoCommon API
IStackedDialogPageService.GetImageHandle Method
Overload List
Name | Description
GetImageHandle(Icon, Boolean)
 Convert image to platform specific unmanaged pointer
GetImageHandle(Image, Boolean)
 Convert image to platform specific unmanaged pointer
Top
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace