RhinoCommon API
Brep.IsBox Method
Overload List
Name | Description
IsBox()
 Verifies a Brep is in the form of a solid box.
IsBox(Double)
 Verifies a Brep is in the form of a solid box.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace