RhinoCommon API
Curve.GetLocalPerpPoint Method
Overload List
Name | Description
GetLocalPerpPoint(Point3d, Double, Double)
 Search for a location on the curve, near seedParmameter, that is perpendicular to a test point.
GetLocalPerpPoint(Point3d, Double, Interval, Double)
 Search for a location on the curve, near seedParmameter, that is perpendicular to a test point.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace