RhinoCommon API
DisplayPipeline.DrawDraftAnglePreview Method
Overload List
Name | Description
DrawDraftAnglePreview(Brep, Color)
 Draws a Brep in Draft Angle preview.
DrawDraftAnglePreview(Mesh, Color)
 Draws a Mesh in Draft Angle preview.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace