RhinoCommon API
TextureMapping.Evaluate Method
Overload List
Name | Description
Evaluate(Point3d, Vector3d, Point3d)
 Evaluate the mapping to get a texture coordinate
Evaluate(Point3d, Vector3d, Point3d, Transform, Transform)
 Evaluate the mapping to get a texture coordinate
Top
See Also
Reference
TextureMapping Class
Rhino.Render Namespace