RhinoCommon API
Mesh.Append Method
Overload List
Name | Description
Append(IEnumerable<Mesh>)
 Append a list of meshes. This function is much more efficient than making repeated calls to Mesh.Append(Mesh) when lots of meshes are being joined into a single large mesh.
Append(Mesh)
 Appends a copy of another mesh to this one and updates indices of appended mesh parts.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace