RhinoCommon API
RhinoApp.Write Method
Overload List
Name | Description
Write(String)
Print formatted text in the command window.
Write(String, Object)
Print formatted text in the command window.
Write(String, Object, Object)
Print formatted text in the command window.
Write(String, Object, Object, Object)
Print formatted text in the command window.
Top
See Also
Reference
RhinoApp Class
Rhino Namespace