RhinoCommon API
Brep.GetVolume Method
Overload List
Name | Description
GetVolume()
 Compute the Volume of the Brep. If you want proper Volume data with moments and error information, use the VolumeMassProperties class.
GetVolume(Double, Double)
 Compute the Volume of the Brep. If you want proper Volume data with moments and error information, use the VolumeMassProperties class.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace