RhinoCommon API
ViewCapture.SendToPrinter Method
Overload List
Name | Description
SendToPrinter(String, ViewCaptureSettings[])
 Send a list of view capture settings to a printer. Each setting represents a single page.
SendToPrinter(String, ViewCaptureSettings[], Int32)
 Send a list of view capture settings to a printer. Each setting represents a single page.
Top
See Also
Reference
ViewCapture Class
Rhino.Display Namespace