RhinoCommon API
ColorRGBA.CreateFromArgb Method
Overload List
Name | Description
CreateFromArgb(Byte, Byte, Byte)
 Constructs a RGBA color from the specified 8-bit components (red, green, and blue) values. The alpha value is implicitly 1.0 (fully opaque).
CreateFromArgb(Byte, Byte, Byte, Byte)
 Constructs a RGBA color from the four ARGB components (alpha, red, green, and blue) values.
Top
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace