RhinoCommon API
ArchivableDictionary Constructor
Overload List
Name | Description
ArchivableDictionary()
Initializes an instance of a dictionary for writing to a 3dm archive.
ArchivableDictionary(Int32)
Initializes an instance of a dictionary for writing to a 3dm archive.
ArchivableDictionary(UserData)
Initializes an instance of a dictionary for writing to a 3dm archive
ArchivableDictionary(Int32, String)
Initializes an instance of a dictionary for writing to a 3dm archive.
ArchivableDictionary(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace