RhinoCommon API
TextEntity.CreateExtrusions Method
Overload List
Name | Description
CreateExtrusions(DimensionStyle, Double, Double, Double)
 Creates extrusions from the outline curves with specified height.
CreateExtrusions(DimensionStyle, Double, Boolean, Double, Double)
 Creates extrusions from the outline curves with specified height.
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace