RhinoCommon API
CustomPointObject.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the CustomPointObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomPointObject and optionally releases the managed resources
 (Overrides CommonObject.Dispose(Boolean).)
Top
See Also
Reference
CustomPointObject Class
Rhino.DocObjects.Custom Namespace