RhinoCommon API
RenderPipeline.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the RenderPipeline
Dispose(Boolean)
Releases the unmanaged resources used by the RenderPipeline and optionally releases the managed resources
Top
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace