RhinoCommon API
RenderSettings Constructor
Overload List
Name | Description
RenderSettings()
 Initialize a new instance of the RenderSettings class.
RenderSettings(RenderSettings)
 Initialize new instance of the RenderSettings class.
Top
See Also
Reference
RenderSettings Class
Rhino.Render Namespace