RhinoCommon API
DisplayMaterial.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the DisplayMaterial
Dispose(Boolean)
Releases the unmanaged resources used by the DisplayMaterial and optionally releases the managed resources
Top
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace