RhinoCommon API
NurbsCurve.CreateFromFitPoints Method
Overload List
Name | Description
CreateFromFitPoints(IEnumerable<Point3d>, Double, Boolean)
 Fits a NURBS curve to a dense, ordered set of points.
CreateFromFitPoints(IEnumerable<Point3d>, Double, Int32, Boolean, Vector3d, Vector3d)
 Fits a NURBS curve to a dense, ordered set of points.
Top
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace