RhinoCommon API
ArchivableDictionary.Set Method
Overload List
Name | Description
Set(String, ArchivableDictionary)
 Sets another ArchivableDictionary as entry in this dictionary.
Set(String, ObjRef)
 Sets a ObjRef
Set(String, BoundingBox)
 Sets a BoundingBox.
Set(String, GeometryBase)
 Sets any class deriving from the GeometryBase base class.
Set(String, Interval)
 Sets an Interval.
Set(String, Line)
 Sets a Line.
Set(String, MeshingParameters)
 Sets a MeshingParameters.
Set(String, Plane)
 Sets a Plane.
Set(String, Point2d)
 Sets a Point2d.
Set(String, Point3d)
 Sets a Point3d.
Set(String, Point3f)
 Sets a Point3f.
Set(String, Point4d)
 Sets a Point4d.
Set(String, Ray3d)
 Sets a Ray3d.
Set(String, Transform)
 Sets a Transform.
Set(String, Vector2d)
 Sets a Vector2d.
Set(String, Vector3d)
 Sets a Vector3d.
Set(String, Vector3f)
 Sets a Vector3f.
Set(String, Boolean)
 Sets a Boolean.
Set(String, Byte)
 Sets a Byte.
Set(String, IEnumerable<ObjRef>)
 Sets an array of ObjRef
Set(String, IEnumerable<GeometryBase>)
 Sets an array of GeometryBase
Set(String, IEnumerable<Boolean>)
 Sets a list, an array or any enumerable of Boolean.
Set(String, IEnumerable<Byte>)
 Sets a list, an array or any enumerable of Byte.
Set(String, IEnumerable<Double>)
 Sets a list, an array or any enumerable of Double.
Set(String, IEnumerable<Guid>)
 Sets a list, an array or any enumerable of Guid.
Set(String, IEnumerable<Int16>)
 Sets a list, an array or any enumerable of Int16.
Set(String, IEnumerable<Int32>)
 Sets a list, an array or any enumerable of Int32.
Set(String, IEnumerable<SByte>)
 Sets a list, an array or any enumerable of SByte.
Set(String, IEnumerable<Single>)
 Sets a list, an array or any enumerable of Single.
Set(String, IEnumerable<String>)
 Sets a list, an array or any enumerable of String.
Set(String, Double)
 Sets a Double.
Set(String, Color)
 Sets a Color.
Set(String, Font)
 Sets a Font.
Set(String, Point)
 Sets a Point.
Set(String, PointF)
 Sets a PointF.
Set(String, Rectangle)
 Sets a Rectangle.
Set(String, RectangleF)
 Sets a RectangleF.
Set(String, Size)
 Sets a Size.
Set(String, SizeF)
 Sets a SizeF.
Set(String, Guid)
 Sets a Guid.
Set(String, Int16)
 Sets a Int16.
Set(String, Int32)
 Sets a Int32.
Set(String, Int64)
 Sets a Int64.
Set(String, SByte)
 Sets a SByte.
Set(String, Single)
 Sets a Single.
Set(String, String)
 Sets a String.
Set(String, UInt16)
 Sets a UInt16.
Set(String, UInt32)
 Sets a UInt32.
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace