RhinoCommon API
PersistentSettings.TryGetDouble Method
Overload List
Name | Description
TryGetDouble(String, Double)
TryGetDouble(String, Double, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace