RhinoCommon API
FileCsvDocument.TryGetDouble Method
Overload List
Name | Description
TryGetDouble(Int32, Int32, Double)
 Retrieves the value of a cell as a double-precision number. The cell is evaluated with TryParseNumber(String, Double), so command-line math expressions (for example "1/2") are supported.
TryGetDouble(String, Int32, Double)
 Retrieves the value of a cell as a double-precision number, addressing the column by header name.
Top
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace