RhinoCommon API
Color4f.FromArgb Method
Overload List
Name | Description
FromArgb(Single, Color4f)
FromArgb(Single, Single, Single, Single)
Top
See Also
Reference
Color4f Structure
Rhino.Display Namespace