RhinoCommon API
Brep.CreateBooleanIntersection Method
Overload List
Name | Description
CreateBooleanIntersection(Brep, Brep, Double)
 Compute the Solid Intersection of two Breps.
CreateBooleanIntersection(IEnumerable<Brep>, IEnumerable<Brep>, Double)
 Compute the Solid Intersection of two sets of Breps.
CreateBooleanIntersection(Brep, Brep, Double, Boolean)
 Compute the Solid Intersection of two Breps.
CreateBooleanIntersection(IEnumerable<Brep>, IEnumerable<Brep>, Double, Boolean)
 Compute the Solid Intersection of two sets of Breps.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace