RhinoCommon API
LengthMassProperties.Compute Method
Overload List
Name | Description
Compute(Curve)
 Calculates the length mass properties of a curve.
Compute(IEnumerable<Curve>)
 Calculates the length mass properties of an enumeration of curves.
Compute(Curve, Boolean, Boolean, Boolean, Boolean)
 Calculates the length mass properties of a curve.
Compute(IEnumerable<Curve>, Boolean, Boolean, Boolean, Boolean)
 Calculates the length mass properties of an enumeration of curves.
Top
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace