RhinoCommon API
ObjectPropertiesPage.AnySelectedObject Method
Overload List
Name | Description
AnySelectedObject<T>()
 Return true if any of the selected objects match the given type
AnySelectedObject<T>(Boolean)
 Return true if any of the selected objects match the given type
Top
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace