RhinoCommon API
Transform2d.FromAffineElements Method
Overload List
Name | Description
FromAffineElements(Double[])
 Creates a transform from an array of six coefficients in (a, b, c, d, tx, ty) order.
FromAffineElements(Single[])
 Creates a transform from an array of six coefficients in (a, b, c, d, tx, ty) order.
FromAffineElements(Double, Double, Double, Double, Double, Double)
 Creates a transform from the six coefficients used by the traditional 2d drawing APIs. See the remarks on ToAffineElements().
Top
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace