RhinoCommon API
Mesh.Flip Method
Overload List
Name | Description
Flip(Boolean, Boolean, Boolean)
Reverses the direction of the mesh.
Flip(Boolean, Boolean, Boolean, Boolean)
Reverses the direction of the mesh.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace