RhinoCommon API
ColorHSL Constructor
Overload List
Name | Description
ColorHSL(Color)
 Constructs a new instance of ColorHSL that is equivalent to an ARGB color.
ColorHSL(Double, Double, Double)
 Constructs a new instance of ColorHSL with custom channel values.
ColorHSL(Double, Double, Double, Double)
 Constructs a new instance of ColorHSL with custom channel values.
Top
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace