RhinoCommon API
ChangeQueue.ApplyRenderSettingsChanges Method
Overload List
Name | Description
ApplyRenderSettingsChanges(DisplayRenderSettings)
 Override this when you want to handle render setting changes. These are for the viewport settings.
ApplyRenderSettingsChanges(RenderSettings)
 Override this when you need to handle background changes (through RenderSettings)
Top
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace