RhinoCommon API
Curve.NormalizedLengthParameter Method
Overload List
Name | Description
NormalizedLengthParameter(Double, Double)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve. A fractional tolerance of 1e-8 is used in this version of the function.
NormalizedLengthParameter(Double, Double, Interval)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve. A fractional tolerance of 1e-8 is used in this version of the function.
NormalizedLengthParameter(Double, Double, Double)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
NormalizedLengthParameter(Double, Double, Double, Interval)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace