RhinoCommon API
RenderMaterial.SimulateMaterial Method
Overload List
Name | Description
SimulateMaterial(Boolean) |  Obsolete.
 Call this function to receive the simulation for a RenderMaterial used by the display and other rendering engines.
SimulateMaterial(Material, RenderTexture.TextureGeneration)
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
SimulateMaterial(Material, Boolean) |  Obsolete.
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
Top
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace