RhinoCommon API
GetBaseClass.AddOptionToggle Method
Overload List
Name | Description
AddOptionToggle(LocalizeStringPair, OptionToggle)
 Adds a command line option to toggle a setting.
AddOptionToggle(String, OptionToggle)
 Adds a command line option to toggle a setting.
Top
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace