RhinoCommon API
SubD.InterpolateSurfacePoints Method
Overload List
Name | Description
InterpolateSurfacePoints(Point3d[])
 Modifies the SubD so that the SubD vertex limit surface points are equal to surface_points[]
InterpolateSurfacePoints(UInt32[], Point3d[])
 Modifies the SubD so that the SubD vertex limit surface points of the listed vertices are equal to surface_points[].
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace