RhinoCommon API
Decal.TextureRenderCRC Method
Overload List
Name | Description
TextureRenderCRC(TextureRenderHashFlags) |  Obsolete.
 This method is deprecated in favor of TextureRenderHash below.
TextureRenderCRC(TextureRenderHashFlags, LinearWorkflow) |  Obsolete.
 This method is deprecated in favor of TextureRenderHash below.
Top
See Also
Reference
Decal Class
Rhino.Render Namespace