RhinoCommon API
Curve.CreateBooleanDifference Method
Overload List
Name | Description
CreateBooleanDifference(Curve, Curve) |  Obsolete.
 Calculates the boolean difference between two closed, planar curves. Note, curves must be co-planar.
CreateBooleanDifference(Curve, IEnumerable<Curve>) |  Obsolete.
 Calculates the boolean difference between a closed planar curve, and a list of closed planar curves. Note, curves must be co-planar.
CreateBooleanDifference(Curve, Curve, Double)
 Calculates the boolean difference between two closed, planar curves. Note, curves must be co-planar.
CreateBooleanDifference(Curve, IEnumerable<Curve>, Double)
 Calculates the boolean difference between a closed planar curve, and a list of closed planar curves. Note, curves must be co-planar.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace