RhinoCommon API
Surface.TryGetExtrusion Method
Overload List
Name | Description
TryGetExtrusion(Extrusion)
Tests a surface to see if it is an extrusion within RhinoMath.ZeroTolerance and returns the extrusion.
TryGetExtrusion(Extrusion, Double)
Tests a surface to see if it is an extrusion and returns the extrusion.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace