RhinoCommon API
Localization.LocalizeString Method
Overload List
Name | Description
LocalizeString(String, Int32)
 Returns localized version of a given English string. This function should be auto-generated by the RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
LocalizeString(String, Int32, Int32) |  Obsolete.
 DO NOT use this function, it is a trap to determine where context IDs have been copied from other, already extracted, strings.
LocalizeString(String, Object, Int32)
 Returns localized version of a given English string. This function should be auto-generated by the RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
Top
See Also
Reference
Localization Class
Rhino.UI Namespace