RhinoCommon API
BrepTrimList.MatchEnds Method
Overload List
Name | Description
MatchEnds()
 Matches the endpoints of all trims in the Brep.
MatchEnds(BrepLoop)
 Match the endpoints of all trims in a loop.
MatchEnds(Int32)
 Match the endpoints of a trim to the next and previous trim.
MatchEnds(BrepTrim, BrepTrim)
 Match the end of a trim to the start of the next trim.
Top
See Also
Reference
BrepTrimList Class
Rhino.Geometry.Collections Namespace