RhinoCommon API
ArchivableDictionary.GetFloat Method
Overload List
Name | Description
GetFloat(String)
 Get value as float, will only succeed if value was created using Set(string key, float value)
GetFloat(String, Single)
 Get value as float, will return defaultValue unless value was created using Set(string key, float value)
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace