RhinoCommon API
StringTable.SetString Method
Overload List
Name | Description
SetString(String, String)
 Adds or sets a user data string to the document.
SetString(String, String, String)
 Adds or sets a user data string to the document.
Top
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace