RhinoCommon API
ObjectTable.Replace Method
Overload List
Name | Description
Replace(Guid, Arc)
Replaces one object with new curve object.
Replace(Guid, Brep)
Replaces one object with new brep object.
Replace(Guid, Circle)
Replaces one object with new curve object.
Replace(Guid, Curve)
Replaces one object with new curve object.
Replace(Guid, Extrusion)
Replaces one object with new extrusion object.
Replace(Guid, Hatch)
Replaces one object with new hatch object.
Replace(Guid, Leader)
Replaces one object with new text object.
Replace(Guid, Line)
Replaces one object with new line curve object.
Replace(Guid, Mesh)
Replaces one object with new mesh object.
Replace(Guid, Point)
Replaces one object with new point object.
Replace(Guid, Point3d)
Replaces one object with new point object.
Replace(Guid, PointCloud)
 Replaces one object with new point cloud object.
Replace(Guid, Polyline)
Replaces one object with new curve object.
Replace(Guid, SubD)
Replaces one object with new subd object.
Replace(Guid, Surface)
Replaces one object with new surface object.
Replace(Guid, TextDot)
Replaces one object with new text dot object.
Replace(Guid, TextEntity)
Replaces one object with new text object.
Replace(ObjRef, RhinoObject)
 Replaces one object with another. Conceptually, this function is the same as calling Setting new_object attributes = old_object attributes DeleteObject(old_object); AddObject(old_object);
Replace(ObjRef, Arc)
Replaces one object with new curve object.
Replace(ObjRef, Brep)
 Replaces one object with new brep object.
Replace(ObjRef, Circle)
Replaces one object with new curve object.
Replace(ObjRef, Curve)
 Replaces one object with new curve object.
Replace(ObjRef, Extrusion)
Replaces one object with new extrusion object.
Replace(ObjRef, Hatch)
Replaces one object with new hatch object.
Replace(ObjRef, Leader)
Replaces one object with new text object.
Replace(ObjRef, Line)
Replaces one object with new line curve object.
Replace(ObjRef, Mesh)
 Replaces one object with new mesh object.
Replace(ObjRef, Point)
Replaces one object with new point object.
Replace(ObjRef, Point3d)
Replaces one object with new point object.
Replace(ObjRef, PointCloud)
 Replaces one object with new point cloud object.
Replace(ObjRef, Polyline)
Replaces one object with new curve object.
Replace(ObjRef, SubD)
 Replaces one object with a new SubD object.
Replace(ObjRef, Surface)
 Replaces one object with new surface object.
Replace(ObjRef, TextDot)
Replaces one object with new text dot object.
Replace(ObjRef, TextEntity)
Replaces one object with new text object.
Replace(Guid, Brep, Boolean)
Replace(Guid, GeometryBase, Boolean)
 Replaces the geometry in one object.
Replace(ObjRef, Brep, Boolean)
Replace(ObjRef, GeometryBase, Boolean)
 Replaces the geometry in one object.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace