RhinoCommon API
RenderContentType.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the RenderContentType
Dispose(Boolean)
Releases the unmanaged resources used by the RenderContentType and optionally releases the managed resources
Top
See Also
Reference
RenderContentType Class
Rhino.Render Namespace