RhinoCommon API
SubDDisplayParameters Constructor
Overload List
Name | Description
SubDDisplayParameters()
 Initializes a new instance with default values.
SubDDisplayParameters(SerializationInfo, StreamingContext)
 Called by BinaryFormatter.Deserialize to create a new MeshParamaters object.
Top
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace