RhinoCommon API
Curve.TryGetCircle Method
Overload List
Name | Description
TryGetCircle(Circle)
 Try to convert this curve into a circle using RhinoMath.ZeroTolerance.
TryGetCircle(Circle, Double)
 Try to convert this curve into a Circle using a custom tolerance.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace