RhinoCommon API
ViewportInfo.ZoomToScreenRect Method
Overload List
Name | Description
ZoomToScreenRect(Rectangle)
 Zooms to a screen zone.
View changing from screen input points. Handy for using a mouse to manipulate a view. ZoomToScreenRect() may change camera and frustum settings.
ZoomToScreenRect(Int32, Int32, Int32, Int32)
 Zooms to a screen zone.
View changing from screen input points. Handy for using a mouse to manipulate a view. ZoomToScreenRect() may change camera and frustum settings.
Top
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace