RhinoCommon API
DisplayPipeline.DrawSprite Method
Overload List
Name | Description
DrawSprite(DisplayBitmap, Point2d, Single)
DrawSprite(DisplayBitmap, Point2d, Single, Color)
DrawSprite(DisplayBitmap, Point2d, Single, Single)
 Draw screen oriented image centered at 2d screen location
DrawSprite(DisplayBitmap, Point3d, Single, Boolean)
DrawSprite(DisplayBitmap, Point3d, Single, Color, Boolean)
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace