RhinoCommon API
PersistentSettingsConverter.TryParseEnum Method
Overload List
Name | Description
TryParseEnum(Type, String, Int32)
 Converts an enumerated value name to its integer equivalent.
TryParseEnum(Type, String, String)
 Converts an enumerated value string (integer as string) to a enumerated value name.
Top
See Also
Reference
PersistentSettingsConverter Class
Rhino Namespace