RhinoCommon API
PostEffectCollection Constructor
Overload List
Name | Description
PostEffectCollection()
 Create a utility object not associated with any document
PostEffectCollection(PostEffectCollection)
 Create a utility object not associated with any document from another object
Top
See Also
Reference
PostEffectCollection Class
Rhino.Render.PostEffects Namespace