RhinoCommon API
SimulatedTexture Constructor
Overload List
Name | Description
SimulatedTexture() |  Obsolete.
Initializes a new instance of the SimulatedTexture class
SimulatedTexture(RhinoDoc)
Initializes a new instance of the SimulatedTexture class
SimulatedTexture(Texture) |  Obsolete.
Initializes a new instance of the SimulatedTexture class
SimulatedTexture(RhinoDoc, Texture)
Initializes a new instance of the SimulatedTexture class
Top
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace