RhinoCommon API
BinaryArchiveReader.SeekFromCurrentPosition Method
Overload List
Name | Description
SeekFromCurrentPosition(Int64)
 seek from current position ( like fseek( ,SEEK_CUR) )
SeekFromCurrentPosition(UInt64, Boolean)
 seek from current position ( like fseek( ,SEEK_CUR) )
Top
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace