RhinoCommon API
SubD.ClosestPoint Method
Overload List
Name | Description
ClosestPoint(Point3d)
 Gets the point on this SubD's surface that is closest to a test point.
ClosestPoint(Point3d, Point3d, SubDComponentParameter)
 Gets the point on this SubD's surface that is closest to a test point.
ClosestPoint(Point3d, Point3d, SubDComponentParameter, Double)
 Gets the point on this SubD's surface that is closest to a test point.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace