RhinoCommon API
HostUtils.DebugDumpToString Method
Overload List
Name | Description
DebugDumpToString(BezierCurve)
 Gets the debug dumps. This is a text description of the geometric contents. DebugDump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
DebugDumpToString(GeometryBase)
 Gets the debug dumps. This is a text description of the geometric contents. DebugDump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
Top
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace