RhinoCommon API
SimpleArrayExtrusionPointer.Dispose Method
Overload List
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
Releases the unmanaged resources used by the SimpleArrayExtrusionPointer and optionally releases the managed resources
Top
See Also
Reference
SimpleArrayExtrusionPointer Class
Rhino.Runtime.InteropWrappers Namespace