RhinoCommon API
AppearanceSettings.SetWidgetColor Method
Overload List
Name | Description
SetWidgetColor(WidgetColor, Color)
 Sets the logical widget color association to a specific .Net library color, without forced UI update.
SetWidgetColor(WidgetColor, Color, Boolean)
 Sets the logical widget color association to a specific .Net library color.
Top
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace