RhinoCommon API
MeshNgonList.GetNgonBoundingBox Method
Overload List
Name | Description
GetNgonBoundingBox(Int32)
 Gets the bounding box of an ngon.
GetNgonBoundingBox(MeshNgon)
 Gets the bounding box of an ngon.
Top
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace