RhinoCommon API
SubD.DeleteComponents Method
Overload List
Name | Description
DeleteComponents(IEnumerable<SubDComponent>)
 Deletes components from this SubD, leaving the edges that bounded any deleted face unmarked. See DeleteComponents(IEnumerable<SubDComponent>, Boolean).
DeleteComponents(IEnumerable<ComponentIndex>, Boolean)
 Deletes components from this SubD, identified by component index.
DeleteComponents(IEnumerable<SubDComponent>, Boolean)
 Deletes components from this SubD.
 Deleting a vertex deletes every edge and face attached to it. Deleting an edge deletes every face attached to it. Deleting a face deletes only that face.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace