RhinoCommon API
RhinoList<T>.CopyTo Method
Overload List
Name | Description
CopyTo(T[])
 Copies the entire List to a compatible one-dimensional array, starting at the beginning of the target array.
CopyTo(T[], Int32)
 Copies the entire List to a compatible one-dimensional array, starting at the specified index of the target array.
CopyTo(Int32, T[], Int32, Int32)
 Copies a range of elements from the List to a compatible one-dimensional array, starting at the specified index of the target array.
Top
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace