RhinoCommon API
RenderPipeline.GetRenderWindow Method
Overload List
Name | Description
GetRenderWindow()
 Get the RenderWindow associated with this RenderPipeline instance. This is virtual rather than abstract for V5 compat
GetRenderWindow(Boolean)
 As GetRenderWindow(), but if withWireframeChannel is true the returned RenderWindow will have the channel added.
GetRenderWindow(Boolean, Boolean)
 As GetRenderWindow(). The parameter withWireframeChannel controls whether the returned RenderWindow will have the channel added. The parameter fromRenderViewSource controls from where the RenderSize is queried.
GetRenderWindow(ViewportInfo, Boolean)
 As GetRenderWindow(). The parameter withWireframeChannel controls whether the returned RenderWindow will have the channel added. The parameter fromRenderViewSource controls from where the RenderSize is queried. The viewportInfo instance will be used to set up wireframe channel. This is necessary for rendering different view than is currently active in the viewport
GetRenderWindow(ViewportInfo, Boolean, Rectangle)
 As GetRenderWindow(). The parameter withWireframeChannel controls whether the returned RenderWindow will have the channel added. The parameter fromRenderViewSource controls from where the RenderSize is queried. The viewportInfo instance will be used to set up wireframe channel. This is necessary for rendering different view than is currently active in the viewport
Top
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace