RhinoCommon API
FileWriteOptions.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the FileWriteOptions
Dispose(Boolean)
Releases the unmanaged resources used by the FileWriteOptions and optionally releases the managed resources
Top
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace