RhinoCommon API
NamedLayerStateTable.Save Method
Overload List
Name | Description
Save(String)
 Saves or updates a named layer state.
Save(String, Guid)
 Saves or updates a named layer state.
Top
See Also
Reference
NamedLayerStateTable Class
Rhino.DocObjects.Tables Namespace