RhinoCommon API
FontTable.FindOrCreate Method
Overload List
Name | Description
FindOrCreate(String, Boolean, Boolean)
 Get a DimensionStyle with the specified characteristics the settings other than face, bold and italic are copied from the current style
FindOrCreate(String, Boolean, Boolean, DimensionStyle)
 Get a DimensionStyle with the specified characteristics
Top
See Also
Reference
FontTable Class
Rhino.DocObjects.Tables Namespace