RhinoCommon API
Transform2d.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines if another object is a Transform2d and its value equals this transform value.
 (Overrides ValueType.Equals(Object).)
Equals(Transform2d)
 Determines if another transform equals this transform value.
Top
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace