RhinoCommon API
Brep.CreateOffsetBrep Method
Overload List
Name | Description
CreateOffsetBrep(Brep, Double, Boolean, Boolean, Double, Brep[], Brep[])
 Offsets a Brep.
CreateOffsetBrep(Brep, Double, Boolean, Boolean, Boolean, Double, Brep[], Brep[])
 Offsets a Brep.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace