RhinoCommon API
StringHolder.Dispose Method
Overload List
Name | Description
Dispose()
 IDispose implementation
Dispose(Boolean)
 Called by Dispose and finalizer
Top
See Also
Reference
StringHolder Class
Rhino.Runtime.InteropWrappers Namespace