RhinoCommon API
ObjectTable.ModifyRenderMaterial Method
Overload List
Name | Description
ModifyRenderMaterial(Guid, RenderMaterial)
 Modifies an object's render material assignment, this will set the objects material source to ObjectMaterialSource.MaterialFromObject.
ModifyRenderMaterial(ObjRef, RenderMaterial)
 Modifies an object's render material assignment, this will set the objects material source to ObjectMaterialSource.MaterialFromObject.
ModifyRenderMaterial(RhinoObject, RenderMaterial)
 Modifies an object's render material assignment, this will set the objects material source to ObjectMaterialSource.MaterialFromObject.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace