RhinoCommon API
AppearanceSettings.DefaultPaintColor Method
Overload List
Name | Description
DefaultPaintColor(PaintColor)
 Get a default paint color for Rhino. The current paint color may be different than the default
DefaultPaintColor(PaintColor, Boolean)
 Get a default paint color for Rhino. The current paint color may be different than the default
Top
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace