RhinoCommon API
ObjectTable.ModifyAttributes Method
Overload List
Name | Description
ModifyAttributes(Guid, ObjectAttributes, Boolean)
 Modifies an object's attributes. Cannot be used to change object id.
ModifyAttributes(ObjRef, ObjectAttributes, Boolean)
 Modifies an object's attributes. Cannot be used to change object id.
ModifyAttributes(RhinoObject, ObjectAttributes, Boolean)
 Modifies an object's attributes. Cannot be used to change object id.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace