RhinoCommon API
OptionDouble.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the OptionDouble
Dispose(Boolean)
Releases the unmanaged resources used by the OptionDouble and optionally releases the managed resources
Top
See Also
Reference
OptionDouble Class
Rhino.Input.Custom Namespace