RhinoCommon API
ObjectTable.AddPoints Method
Overload List
Name | Description
AddPoints(IEnumerable<Point3d>)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3f>)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3d>, ObjectAttributes)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3f>, ObjectAttributes)
 Adds multiple points to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace