RhinoCommon API
TextureMapping.TryGetMappingBox Method
Overload List
Name | Description
TryGetMappingBox(Plane, Interval, Interval, Interval)
 Get a box projection from the texture mapping.
TryGetMappingBox(Plane, Interval, Interval, Interval, Boolean)
 Get a box projection from the texture mapping, including capped information
Top
See Also
Reference
TextureMapping Class
Rhino.Render Namespace