RhinoCommon API
Brep.TryGetExtrusion Method
Overload List
Name | Description
TryGetExtrusion(Extrusion)
Tests a Brep to see if it is an extrusion within RhinoMath.ZeroTolerance and returns the extrusion.
TryGetExtrusion(Extrusion, Double)
Tests a Brep to see if it is an extrusion and returns the extrusion.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace