RhinoCommon API
LayerTable.Purge Method
Overload List
Name | Description
Purge(Guid, Boolean)
 Deletes a layer and all geometry objects on a layer.
Purge(Int32, Boolean)
 Deletes a layer and all geometry objects on a layer
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace