RhinoCommon API
Surface.IsIsoparametric Method
Overload List
Name | Description
IsIsoparametric(BoundingBox)
 Determines if a 2d bounding box is isoparametric in the parameter space of this surface.
IsIsoparametric(Curve)
 Determines if a 2d curve is isoparametric in the parameter space of this surface.
IsIsoparametric(Curve, Interval)
 Determines if a 2D curve is isoparametric in the parameter space of this surface.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace