RhinoCommon API
WorksessionFileModel Constructor
Overload List
Name | Description
WorksessionFileModel()
Creates a reference model with no paths and no layer overrides.
WorksessionFileModel(String)
Creates a reference model for a model file.
WorksessionFileModel(WorksessionFileModel)
Creates a copy of another model.
Top
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace