RhinoCommon API
MeshIntersectionCache.Dispose Method
Overload List
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 Disposes the mesh intersection cache.
Top
See Also
Reference
MeshIntersectionCache Class
Rhino.Geometry.Intersect Namespace