RhinoCommon API
RhinoObject.ObjectFrame Method
Overload List
Name | Description
ObjectFrame()
ObjectFrame(RhinoObject.ObjectFrameFlags)
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace