RhinoCommon API
Curve.CreateBlendCurve Method
Overload List
Name | Description
CreateBlendCurve(Curve, Curve, BlendContinuity)
 Create a Blend curve between two existing curves.
CreateBlendCurve(Curve, Curve, BlendContinuity, Double, Double)
 Create a Blend curve between two existing curves.
CreateBlendCurve(Curve, Double, Boolean, BlendContinuity, Curve, Double, Boolean, BlendContinuity)
 Makes a curve blend between two curves at the parameters specified with the directions and continuities specified.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace