RhinoCommon API
ChangeQueue.CreateWorld Method
Overload List
Name | Description
CreateWorld()
 Calls CreateWorld with true passed.
CreateWorld(Boolean)
 Signal the queue to do the initialisation of the queue, seeding it with the content currently available.
Top
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace