RhinoCommon API
PersistentSettings.GetPoint Method
Overload List
Name | Description
GetPoint(String)
GetPoint(String, Point)
GetPoint(String, Point, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace