RhinoCommon API
Curve.ToNurbsCurve Method
Overload List
Name | Description
ToNurbsCurve()
 Constructs a NURBS curve representation of this curve.
ToNurbsCurve(Interval)
 Constructs a NURBS curve representation of this curve.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace