RhinoCommon API
Plane.ToString Method
Overload List
Name | Description
ToString()
 Constructs the string representation of this plane.
 (Overrides ValueType.ToString().)
ToString(String, IFormatProvider)
Formats the value of the current instance using the specified format.
Top
See Also
Reference
Plane Structure
Rhino.Geometry Namespace