RhinoCommon API
RhinoViewport.SetConstructionPlane Method
Overload List
Name | Description
SetConstructionPlane(ConstructionPlane)
 Sets the construction plane to cplane.
SetConstructionPlane(Plane)
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace