RhinoCommon API
BoundingBox.ClosestPoint Method
Overload List
Name | Description
ClosestPoint(Point3d)
 Finds the closest point on or in the bounding box.
ClosestPoint(Point3d, Boolean)
 Finds the closest point on or in the bounding box.
Top
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace