RhinoCommon API
DisplayPipeline.DrawDot Method
Overload List
Name | Description
DrawDot(Point3d, String)
 Draws a text dot in world coordinates.
DrawDot(Single, Single, String)
 Draws a text dot in screen coordinates.
DrawDot(Point3d, String, Color, Color)
 Draw a text dot in world coordinates.
DrawDot(TextDot, Color, Color, Color)
 Draw a text dot as defined by the text dot class
DrawDot(Single, Single, String, Color, Color)
 Draws a text dot in screen coordinates.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace