RhinoCommon API
FileTypeList.AddFileType Method
Overload List
Name | Description
AddFileType(String, IEnumerable<String>)
AddFileType(String, String)
AddFileType(String, IEnumerable<String>, Boolean)
AddFileType(String, String, Boolean)
AddFileType(String, String, String)
AddFileType(String, String, String, Boolean)
Top
See Also
Reference
FileTypeList Class
Rhino.PlugIns Namespace