RhinoCommon API
ViewportInfo.DollyExtents Method
Overload List
Name | Description
DollyExtents(BoundingBox, Double)
 Dolly the camera location and so that the view frustum contains all of the document objects that can be seen in view. If the projection is perspective, the camera angle is not changed.
DollyExtents(IEnumerable<GeometryBase>, Double)
 Dolly the camera location and so that the view frustum contains all of the document objects that can be seen in view. If the projection is perspective, the camera angle is not changed.
Top
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace