RhinoCommon API
TextFields.DateModified Method
Overload List
Name | Description
DateModified()
 Date the document was last edited
DateModified(String)
 Date the document was last edited in a specified format
DateModified(String, String)
 Date the document was last edited in a specific format and language in local time
Top
See Also
Reference
TextFields Class
Rhino.Runtime Namespace