RhinoCommon API
CustomDisplay.AddCircle Method
Overload List
Name | Description
AddCircle(Circle)
 Adds a new, black circle to the display list.
AddCircle(Circle, Color)
 Adds a new, colored arc to the display list.
AddCircle(Circle, Color, Int32)
 Adds a new, colored circle to the display list.
Top
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace