RhinoCommon API
DimensionStyle.Duplicate Method
Overload List
Name | Description
Duplicate()
 Construct a deep (full) copy of this object.
Duplicate(String, Guid, Guid)
 Construct a deep (full) copy of this object.
Top
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace