RhinoCommon API
Mesh.CreateQuickHull3D Method
Overload List
Name | Description
CreateQuickHull3D(IEnumerable<Point3d>)
 Attempts to create a 3d convex hull mesh from input points using the QuickHull algorithm. Hull faces whose shared edges are not clearly convex are merged, so faces of the resulting mesh may be triangles, quads, or larger convex polygons (returned as mesh ngons).
CreateQuickHull3D(PointCloud)
 Attempts to create a 3d convex hull mesh from an input point cloud using the QuickHull algorithm. Hull faces whose shared edges are not clearly convex are merged, so faces of the resulting mesh may be triangles, quads, or larger convex polygons (returned as mesh ngons).
CreateQuickHull3D(IEnumerable<Point3d>, List<Int32[]>)
 Attempts to create a 3d convex hull mesh from input points using the QuickHull algorithm. Hull faces whose shared edges are not clearly convex are merged, so faces of the resulting mesh may be triangles, quads, or larger convex polygons (returned as mesh ngons).
CreateQuickHull3D(PointCloud, List<Int32[]>)
 Attempts to create a 3d convex hull mesh from an input point cloud using the QuickHull algorithm, also returning the input points that make up each hull face.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace