RhinoCommon API
Point3dList.Equals Method
Overload List
Name | Description
Equals(Object)
 Overrides the default object equality to compare lists by value.
 (Overrides Object.Equals(Object).)
Equals(Point3dList)
 Determines if the point lists are exactly equal.
Top
See Also
Reference
Point3dList Class
Rhino.Collections Namespace