RhinoCommon API
FileObj.Write Method
Overload List
Name | Description
Write(StreamWriter, RhinoDoc, FileObjWriteOptions)
Write an obj stream based on the contents of a RhinoDoc
Write(String, Mesh[], FileObjWriteOptions)
Write an obj file with an array of meshes
Write(String, RhinoDoc, FileObjWriteOptions)
Write an obj file based on the contents of a RhinoDoc
Top
See Also
Reference
FileObj Class
Rhino.FileIO Namespace