RhinoCommon API
SimpleArrayInterval Constructor
Overload List
Name | Description
SimpleArrayInterval()
 Initializes a new SimpleArrayInterval class.
SimpleArrayInterval(IEnumerable<Interval>)
 Create an array of intervals
Top
See Also
Reference
SimpleArrayInterval Class
Rhino.Runtime.InteropWrappers Namespace