RhinoCommon API
SimpleArrayVector3d Constructor
Overload List
Name | Description
SimpleArrayVector3d()
 Initializes a new empty SimpleArrayVector3d instance.
SimpleArrayVector3d(IEnumerable<Vector3d>)
 Initializes a new SimpleArrayVector3d instance from a set of vectors
Top
See Also
Reference
SimpleArrayVector3d Class
Rhino.Runtime.InteropWrappers Namespace