RhinoCommon API
BrepEdgeList.RemoveNakedMicroEdges Method
Overload List
Name | Description
RemoveNakedMicroEdges(Double)
 Finds any naked edges with the same start and end vertex and an arc-length less than tolerance and attempts to remove them by removing trims and extending the adjacent to meet.
RemoveNakedMicroEdges(Double, Boolean)
 Finds any naked edges with the same start and end vertex and an arc-length less than tolerance and attempts to remove them by removing trims and extending the adjacent to meet.
Top
See Also
Reference
BrepEdgeList Class
Rhino.Geometry.Collections Namespace