RhinoCommon API
ColorLCH Constructor
Overload List
Name | Description
ColorLCH(Color)
 Constructs a new instance of ColorLCH that is equivalent to an ARGB color.
ColorLCH(Double, Double, Double)
 Constructs a new instance of ColorLCH with custom channel values.
ColorLCH(Double, Double, Double, Double)
 Constructs a new instance of ColorLCH with custom channel values.
Top
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace