RhinoCommon API
SimpleArrayMeshPointer.Dispose Method
Overload List
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
Releases the unmanaged resources used by the SimpleArrayMeshPointer and optionally releases the managed resources
Top
See Also
Reference
SimpleArrayMeshPointer Class
Rhino.Runtime.InteropWrappers Namespace