RhinoCommon API
GrasshopperDisplayMaterial Constructor
Overload List
Name | Description
GrasshopperDisplayMaterial()
 Constructs a default material with an opaque white diffuse colour.
GrasshopperDisplayMaterial(Color)
 Constructs a material with a specific diffuse colour.
Top
See Also
Reference
GrasshopperDisplayMaterial Class
Rhino.Display Namespace