RhinoCommon API
DisplayPipeline.DrawBrepWires Method
Overload List
Name | Description
DrawBrepWires(Brep, Color)
 Draws all the wireframe curves of a brep object.
DrawBrepWires(Brep, Color, Int32)
 Draws all the wireframe curves of a brep object.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace