RhinoCommon API
Mesh.MatchEdges Method
Overload List
Name | Description
MatchEdges(Double, Boolean)
 Moves face edges of an open mesh to meet adjacent face edges. The method will first try to match vertices, and then it will try to split edges to make the edges match.
MatchEdges(IEnumerable<Mesh>, Double, Boolean, Boolean, Boolean, Boolean)
 Moves face edges of open meshes to meet near face edges. The method will first try to match vertices, and then then it will try to split edges to make the edges match.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace