RhinoCommon API
HatchPatternTable.Rename Method
Overload List
Name | Description
Rename(HatchPattern, String)
 Renames a hatch pattern in the table.
Rename(Int32, String)
 Renames a hatch pattern in the table.
Top
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace