RhinoCommon API
Mesh.Subdivide Method
Overload List
Name | Description
Subdivide()
 Subdivides the faces of the mesh.
Subdivide(IEnumerable<Int32>)
 Subdivides specific faces of the mesh.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace