RhinoCommon API
ObjectTable.AddSphere Method
Overload List
Name | Description
AddSphere(Sphere)
AddSphere(Sphere, ObjectAttributes)
AddSphere(Sphere, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace