RhinoCommon API
ObjectTable.ReplaceInstanceObject Method
Overload List
Name | Description
ReplaceInstanceObject(Guid, Int32)
 Replaces the underlying instance definition of an instance object.
ReplaceInstanceObject(ObjRef, Int32)
 Replaces the underlying instance definition of an instance object.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace