RhinoCommon API
File3dmObjectTable.AddArc Method
Overload List
Name | Description
AddArc(Arc)
Adds a curve object to the document representing an arc.
AddArc(Arc, ObjectAttributes)
Adds a curve object to the document representing an arc.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace