RhinoCommon API
FilePdf.AddPage Method
Overload List
Name | Description
AddPage(ViewCaptureSettings)
 Add a new page to this document and draw a viewport into it based on provided ViewCaptureSettings
AddPage(Int32, Int32, Int32)
 Add a blank page to this document
Top
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace