RhinoCommon API
GetPoint.Constrain Method
Overload List
Name | Description
Constrain(Arc)
Constrains the picked point to lie on an arc.
Constrain(Circle)
Constrains the picked point to lie on a circle.
Constrain(Cylinder)
Constrains the picked point to lie on a cylinder.
Constrain(Line)
Constrains the picked point to lie on a line.
Constrain(Sphere)
Constrains the picked point to lie on a sphere.
Constrain(Curve, Boolean)
Constrains the picked point to lie on a curve.
Constrain(Mesh, Boolean)
Constrains the picked point to lie on a mesh.
Constrain(Plane, Boolean)
constrain the picked point to lie on a plane.
Constrain(Point3d, Point3d)
Constrains the picked point to lie on a line.
Constrain(Surface, Boolean)
Constrains the picked point to lie on a surface.
Constrain(Brep, Int32, Int32, Boolean)
Constrains the picked point to lie on a brep.
Top
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace