RhinoCommon API
RenderPlugIn.RenderWindow Method
Overload List
Name | Description
RenderWindow(RhinoDoc, RunMode, Boolean, RhinoView, Rectangle, Boolean)
 This function is obsolete and only exists for legacy purposes. Do not override this function - prefer overriding the version with the blowup parameter.
RenderWindow(RhinoDoc, RunMode, Boolean, RhinoView, Rectangle, Boolean, Boolean)
Top
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace