RhinoCommon API
RhinoMath.Integrate Method
Overload List
Name | Description
Integrate(Func<Object, Int32, Double, Double>, Object, Curve, Double, Double, Double)
 Calculates the definite integral of a smooth (C-infinity) function of one variable using a Rhomberg integration technique and returns returns Integral(f(t)*|curve'(t)|*dt). The C-infinity requirement is used by the Rhomberg algorithm when estimating error bounds and convergence. If you choose to pass a C2 function, you are likely to converge while getting less accurate results and incorrect error bound estimates. Using a C0 or C1 fucntion will often return nonsense.
Integrate(Func<Object, Int32, Double, Double>, Object, Interval, Double, Double, Double)
 Calculates the definite integral of a smooth (C-infinity) function using a Rhomberg integration technique.
Integrate(Func<Object, Int32, Double, Double, Double>, Object, Surface, Double, Double, Double)
Integrate(Func<Object, Int32, Double, Double>, Object, Curve, Double, Double, CancellationToken, Double)
 Calculates the definite integral of a smooth (C-infinity) function of one variable using a Rhomberg integration technique and returns returns Integral(f(t)*|curve'(t)|*dt). The C-infinity requirement is used by the Rhomberg algorithm when estimating error bounds and convergence. If you choose to pass a C2 function, you are likely to converge while getting less accurate results and incorrect error bound estimates. Using a C0 or C1 fucntion will often return nonsense. The calculation can be canceled through the cancellation token.
Integrate(Func<Object, Int32, Double, Double>, Object, Interval, Double, Double, CancellationToken, Double)
 Calculates the definite integral of a smooth (C-infinity) function using a Rhomberg integration technique. The calculation can be canceled through the cancellation token.
Integrate(Func<Object, Int32, Double, Double, Double>, Object, Interval, Interval, Double, Double, Double)
Integrate(Func<Object, Int32, Double, Double, Double>, Object, Surface, Double, Double, CancellationToken, Double)
Integrate(Func<Object, Int32, Double, Double, Double>, Object, Interval, Interval, Double, Double, CancellationToken, Double)
Top
See Also
Reference
RhinoMath Class
Rhino Namespace