RhinoCommon API
DisplayPipeline.DrawSubDWires Method
Overload List
Name | Description
DrawSubDWires(SubD, Color, Single)
 Draws all the wireframe curves of a SubD object
DrawSubDWires(SubD, DisplayPen, DisplayPen, DisplayPen, DisplayPen)
 Draws all the wireframe curves os a SubD object using different pens
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace