RhinoCommon API
Curve.ClosedCurveOrientation Method
Overload List
Name | Description
ClosedCurveOrientation()
 Determines the orientation (counterclockwise or clockwise) of a closed, planar curve in the world XY plane. Only works with simple (no self intersections) closed, planar curves.
ClosedCurveOrientation(Plane)
 Determines the orientation (counterclockwise or clockwise) of a closed, planar curve in a given plane. Only works with simple (no self intersections) closed, planar curves.
ClosedCurveOrientation(Transform)
 Determines the orientation (counterclockwise or clockwise) of a closed, planar curve. Only works with simple (no self intersections) closed, planar curves.
ClosedCurveOrientation(Vector3d)
 Determines the orientation (counterclockwise or clockwise) of a closed, planar curve in a given plane. Only works with simple (no self intersections) closed, planar curves.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace