RhinoCommon API
MeshFaceList.RemoveAt Method
Overload List
Name | Description
RemoveAt(Int32)
 Removes a face from the mesh.
RemoveAt(Int32, Boolean)
 Removes a face from the mesh.
Top
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace