RhinoCommon API
PersistentSettings.GetEnumValue Method
Overload List
Name | Description
GetEnumValue<T>(T)
 Get a stored enumerated value, or return default value if not found
GetEnumValue<T>(String)
 Get a stored enumerated value using a custom key.
GetEnumValue<T>(String, T)
 Gets a stored enumerated value using a custom key, or return default value if not found.
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace