RhinoCommon API
RhinoViewport.ChangeToTwoPointPerspectiveProjection Method
Overload List
Name | Description
ChangeToTwoPointPerspectiveProjection(Double)
 Use this function to change projections of valid viewports to a two point perspective. It will make common additional adjustments to the frustum and camera location and direction so the resulting views are similar.
ChangeToTwoPointPerspectiveProjection(Double, Vector3d, Double)
 Use this function to change projections of valid viewports to a two point perspective. It will make common additional adjustments to the frustum and camera location and direction so the resulting views are similar.
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace