RhinoCommon API
TextEntity.Transform Method
Overload List
Name | Description
Transform(Transform, DimensionStyle)
 Transform the object by a 4x4 transform matrix and change text height override to accommodate scaling in the transform if necessary
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace