RhinoCommon API
GeometryBase.Translate Method
Overload List
Name | Description
Translate(Vector3d)
Translates the object along the specified vector.
Translate(Double, Double, Double)
Translates the object along the specified vector.
Top
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace