RhinoCommon API
Point3d.Add Method
Overload List
Name | Description
Add(Point3d, Point3d)
 Sums two Point3d instances.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Add(Point3d, Vector3d)
 Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Add(Point3d, Vector3f)
 Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Add(Vector3d, Point3d)
 Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Top
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace