RhinoCommon API
PostEffectData.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the PostEffectData
Dispose(Boolean)
Releases the unmanaged resources used by the PostEffectData and optionally releases the managed resources
Top
See Also
Reference
PostEffectData Class
Rhino.Render.PostEffects Namespace