RhinoCommon API
Transform.Rotation Method
Overload List
Name | Description
Rotation(Double, Point3d)
 Constructs a new rotation transformation with specified angle and rotation center. The axis of rotation is ZAxis.
Rotation(Double, Vector3d, Point3d)
 Constructs a new rotation transformation with specified angle, rotation center and rotation axis.
Rotation(Vector3d, Vector3d, Point3d)
 Constructs a new rotation transformation with start and end directions and rotation center.
Rotation(Double, Double, Vector3d, Point3d)
 Constructs a new rotation transformation with specified angle, rotation center and rotation axis.
Rotation(Vector3d, Vector3d, Vector3d, Vector3d, Vector3d, Vector3d)
 Constructs a transformation that maps X0 to X1, Y0 to Y1, Z0 to Z1. The frames should be right hand orthonormal frames (unit vectors with Z = X x Y). The resulting rotation fixes the origin (0,0,0), maps initial X to final X, initial Y to final Y, and initial Z to final Z.
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace