RhinoCommon API
Dialogs.ShowPrintWidths Method
Overload List
Name | Description
ShowPrintWidths(String, String)
 Shows the print widths dialogs
ShowPrintWidths(String, String, Double)
 Shows the print widths dialogs
Top
See Also
Reference
Dialogs Class
Rhino.UI Namespace