RhinoCommon API
FileCsvDocument.TryGetColor Method
Overload List
Name | Description
TryGetColor(Int32, Int32, Color)
 Retrieves the value of a cell as a color from its 32-bit ARGB integer (FromArgb(Int32)), as written by Set(Int32, Int32, Color).
TryGetColor(String, Int32, Color)
 Retrieves the value of a cell as a color, addressing the column by header name.
Top
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace