RhinoCommon API
GroupTable.AddToGroup Method
Overload List
Name | Description
AddToGroup(Int32, IEnumerable<Guid>)
 Adds a list of objects to an existing group.
AddToGroup(Int32, Guid)
 Adds an object to an existing group.
Top
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace