RhinoCommon API
NurbsSurface Constructor
Overload List
Name | Description
NurbsSurface(NurbsSurface)
 Initializes a new NURBS surface by copying the values from another surface.
NurbsSurface(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
NurbsSurface(Int32, Boolean, Int32, Int32, Int32, Int32)
 Constructs a new NURBS surface with knot and control point memory allocated.
Top
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace