RhinoCommon API
LineCurve Constructor
Overload List
Name | Description
LineCurve()
 Initializes a new instance of the LineCurve class.
LineCurve(Line)
 Initializes a new instance of the LineCurve class, by retrieving its value from a line.
LineCurve(LineCurve)
 Initializes a new instance of the LineCurve class, by copying values from another linear curve.
LineCurve(Point2d, Point2d)
 Initializes a new instance of the LineCurve class, by setting start and end point from two 2D points.
LineCurve(Point3d, Point3d)
 Initializes a new instance of the LineCurve class, by setting start and end point from two 3D points.
LineCurve(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
LineCurve(Line, Double, Double)
 Initializes a new instance of the LineCurve class, by retrieving its value from a line and setting the domain.
Top
See Also
Reference
LineCurve Class
Rhino.Geometry Namespace