RhinoCommon API
SubD Constructor
Overload List
Name | Description
SubD()
 Create a new instance of SubD geometry
SubD(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace