RhinoCommon API
SimpleArrayHatchLinePointer Constructor
Overload List
Name | Description
SimpleArrayHatchLinePointer()
 Initializes a new SimpleArrayHatchLinePointer instance.
SimpleArrayHatchLinePointer(IEnumerable<HatchLine>)
 Initializes a new SimpleArrayHatchLinePointer instance, from a set of input hatch lines.
Top
See Also
Reference
SimpleArrayHatchLinePointer Class
Rhino.Runtime.InteropWrappers Namespace