RhinoCommon API
RevSurface.Create Method
Overload List
Name | Description
Create(Curve, Line)
 Constructs a new surface of revolution from a generatrix curve and an axis.
Create(Line, Line)
 Constructs a new surface of revolution from a generatrix line and an axis.
If the operation succeeds, results can be (truncated) cones, cylinders and circular hyperboloids.
Create(Polyline, Line)
 Constructs a new surface of revolution from a generatrix polyline and an axis.
Create(Curve, Line, Double, Double)
 Constructs a new surface of revolution from a generatrix curve and an axis.
This overload accepts a slice start and end angles.
Create(Line, Line, Double, Double)
 Constructs a new surface of revolution from a generatrix line and an axis.
This overload accepts a slice start and end angles.
Results can be (truncated) cones, cylinders and circular hyperboloids, or can fail.
Create(Polyline, Line, Double, Double)
 Constructs a new surface of revolution from a generatrix polyline and an axis.
This overload accepts a slice start and end angles.
Top
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace