RhinoCommon API
ArchivableDictionary.GetGuid Method
Overload List
Name | Description
GetGuid(String)
 Get value as Guid, will only succeed if value was created using Set(string key, Guid value)
GetGuid(String, Guid)
 Get value as Guid, will return defaultValue unless value was created using Set(string key, Guid value)
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace