RhinoCommon API
IZooClientUtilities.ReturnLicense Method
Overload List
Name | Description
ReturnLicense(Object, Guid)
ReturnLicense(Object, String, Guid)
Top
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace