RhinoCommon API
ArchivableDictionary.GetPlane Method
Overload List
Name | Description
GetPlane(String)
 Get value as Plane, will return defaultValue unless value was created using Set(string key, Plane value)
GetPlane(String, Plane)
 Get value as Plane, will return defaultValue unless value was created using Set(string key, Plane value)
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace