RhinoCommon API
PostEffect.RegisterPostEffect Method
Overload List
Name | Description
RegisterPostEffect(PlugIn)
RegisterPostEffect(Assembly, Guid)
Top
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace