RhinoCommon API
AncestryRecord.Dispose Method
Overload List
Name | Description
Dispose()
 Dispose
Dispose(Boolean)
 Dispose. Disposes unmanaged memory.
Top
See Also
Reference
MeshInstance.AncestryRecord Class
Rhino.Render.ChangeQueue Namespace