RhinoCommon API
RenderContentCollection Constructor
Overload List
Name | Description
RenderContentCollection()
 Construct an empty collection of RenderContent objects
RenderContentCollection(IntPtr)
 Internal function to create collection from native pointer
Top
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace