RhinoCommon API
SimpleArrayBinaryArchiveReader Constructor
Overload List
Name | Description
SimpleArrayBinaryArchiveReader()
 Initializes a new SimpleArrayBinaryArchiveReader class.
SimpleArrayBinaryArchiveReader(IntPtr)
 Initializes a new SimpleArrayBinaryArchiveReader class.
Top
See Also
Reference
SimpleArrayBinaryArchiveReader Class
Rhino.Runtime.InteropWrappers Namespace