RhinoCommon API
RuiUpdateUi.RegisterMenuItem Method
Overload List
Name | Description
RegisterMenuItem(Guid, Guid, Guid, RuiUpdateUi.UpdateMenuItemEventHandler)
Register menu item update delegate
RegisterMenuItem(String, String, String, RuiUpdateUi.UpdateMenuItemEventHandler)
Register menu item update delegate
Top
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace