RhinoCommon API
PointCloud.CreateSectionCurve Method
Overload List
Name | Description
CreateSectionCurve(Plane, Double)
 Creates planar curves by intersecting a plane with a point cloud.
CreateSectionCurve(Plane, Double, Double, Double, Boolean, Boolean, Boolean, Double)
 Creates a planar curve by intersecting a plane with a point cloud.
Top
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace