RhinoCommon API
RadialDimension Constructor
Overload List
Name | Description
RadialDimension()
 Constructs a radial dimension.
RadialDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
RadialDimension(AnnotationType, Plane, Point3d, Point3d, Point3d)
 Constructs a radial dimension from parameters.
Top
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace