RhinoCommon API
CurveConstraint Constructor
Overload List
Name | Description
Brep.CurveConstraint(Curve)
 Constructor, use curve as positional constraint
Brep.CurveConstraint(Curve, Continuity)
 Subclass constructor for any continuity
Top
See Also
Reference
Brep.CurveConstraint Class
Rhino.Geometry Namespace