RhinoCommon API
StretchSpaceMorph Constructor
Overload List
Name | Description
StretchSpaceMorph(Point3d, Point3d, Point3d)
 Constructs a stretch space morph.
StretchSpaceMorph(Point3d, Point3d, Double)
 Constructs a stretch space morph.
Top
See Also
Reference
StretchSpaceMorph Class
Rhino.Geometry.Morphs Namespace