RhinoCommon API
CommonObject Constructor
Overload List
Name | Description
CommonObject()
 Allows construction from inheriting classes.
CommonObject(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace