RhinoCommon API
GetCylinder.Get Method
Overload List
Name | Description
Get(Cylinder)
 Prompt for the getting of a cylinder.
Get(Extrusion)
 Prompt for the getting of a cylinder.
Top
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace