RhinoCommon API
BrepFace.IsPointOnFace Method
Overload List
Name | Description
IsPointOnFace(Double, Double)
 Tests if a parameter space point is in the active region of a face.
IsPointOnFace(Double, Double, Double)
 Tests if a parameter space point is in the active region of a face.
Top
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace