RhinoCommon API
Mesh.CreateBooleanSplit Method
Overload List
Name | Description
CreateBooleanSplit(IEnumerable<Mesh>, IEnumerable<Mesh>)
 Splits a set of meshes with another set.
CreateBooleanSplit(IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result)
 Splits a set of meshes with another set.
CreateBooleanSplit(IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result, Int32[][])
 Splits a set of meshes with another set and reports which inputs contributed to each output.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace