RhinoCommon API
GetCone.GetMesh Method
Overload List
Name | Description
GetMesh(Int32, Int32, Cone)
 Prompt for the getting of a mesh cone.
GetMesh(Int32, Int32, Int32, Cone)
 Prompt for the getting of a mesh cone.
Top
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace