RhinoCommon API
DisplayPipeline.DrawGradientHatch Method
Overload List
Name | Description
DrawGradientHatch(Hatch, IEnumerable<ColorStop>, Point3d, Point3d, Boolean, Single, DisplayPen, Color)
DrawGradientHatch(Hatch, IEnumerable<ColorStop>, Point3d, Point3d, Boolean, Single, Single, Color)
DrawGradientHatch(Hatch, Color, Color, Point3d, Point3d, Boolean, Single, Color)
 Draw a two point gradient filled hatch
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace