RhinoCommon API
CustomObjectGrips Constructor
Overload List
Name | Description
CustomObjectGrips()
Initializes a new instance of the CustomObjectGrips class
CustomObjectGrips(ObjectGripsType)
 Creates grips that present themselves to Rhino as gripsType.
Top
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace