RhinoCommon API
DisplayPipeline.DrawAnnotation Method
Overload List
Name | Description
DrawAnnotation(AnnotationBase, Color)
DrawAnnotation(AnnotationBase, RhinoObject, Color)
 Draws an annotation geometry while evaluating any embedded text fields (e.g. %<Date>%, %<DocumentText("...")>%) against the supplied parent RhinoObject. Intended for preview conduits that draw a modified copy of an annotation's geometry while the user is editing it — the regular geometry-only overload skips field evaluation because it has no display cache to anchor to.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace