RhinoCommon API
ObjectAttributes.DrawColor Method
Overload List
Name | Description
DrawColor(RhinoDoc)
 Gets an object's draw color, which is based on the object's color source
DrawColor(RhinoDoc, Guid)
 Gets an object's draw color, which is based on the object's color source
Top
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace