RhinoCommon API
Mesh.QuadRemeshBrep Method
Overload List
Name | Description
QuadRemeshBrep(Brep, QuadRemeshParameters)
 Create QuadRemesh from a Brep Set Brep Face Mode by setting QuadRemeshParameters.PreserveMeshArrayEdgesMode
QuadRemeshBrep(Brep, QuadRemeshParameters, IEnumerable<Curve>)
 Create Quad Remesh from a Brep
QuadRemeshBrep(Brep, QuadRemeshParameters, IEnumerable<Curve>, IProgress<Int32>, CancellationToken)
 Quad remesh this Brep.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace