RhinoCommon API
NurbsSurfacePointList.SetControlPoint Method
Overload List
Name | Description
SetControlPoint(Int32, Int32, ControlPoint)
 Sets the control point at the given (u, v) index.
SetControlPoint(Int32, Int32, Point3d) |  Obsolete.
 Sets the control point at the given (u, v) index.
Top
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace