RhinoCommon API
TransformCommand.SelectObjects Method
Overload List
Name | Description
SelectObjects(String, TransformObjectList)
 Selects objects within the command.
SelectObjects(String, ObjectType, TransformObjectList)
 Selects objects within the command.
Top
See Also
Reference
TransformCommand Class
Rhino.Commands Namespace