RhinoCommon API
Transform Constructor
Overload List
Name | Description
Transform(Double)
 Initializes a new transform matrix with a specified value along the diagonal.
Transform(Transform)
 Initializes a new transform matrix with a specified value.
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace