RhinoCommon API
CustomBrepObject.Dispose Method
Overload List
Name | Description
Dispose(Boolean)
Releases the unmanaged resources used by the CustomBrepObject and optionally releases the managed resources
 (Overrides CommonObject.Dispose(Boolean).)
Top
See Also
Reference
CustomBrepObject Class
Rhino.DocObjects.Custom Namespace