RhinoCommon API
Transform.Diagonal Method
Overload List
Name | Description
Diagonal(Vector3d)
 Constructs a new transformation with diagonal (d0,d1,d2,1.0).
Diagonal(Double, Double, Double)
 Constructs a new transformation with diagonal (d0,d1,d2,1.0).
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace