RhinoCommon API
CurveList.Add Method
Overload List
Name | Description
Add(Arc)
 Adds an arc to this list.
Add(Circle)
 Adds a circle to this list.
Add(Ellipse)
 Adds an ellipse to this list.
Add(IEnumerable<Point3d>)
 Adds a polyline to this list.
Add(Line)
 Adds a line to this list.
Top
See Also
Reference
CurveList Class
Rhino.Collections Namespace