RhinoCommon API
SubD.MergeAllCoplanarFaces Method
Overload List
Name | Description
MergeAllCoplanarFaces(Double)
 Merges adjacent coplanar faces into single faces.
MergeAllCoplanarFaces(Double, Double)
 Merges adjacent coplanar faces into single faces.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace