RhinoCommon API
Curve.IsShort Method
Overload List
Name | Description
IsShort(Double)
Used to quickly find short curves.
IsShort(Double, Interval)
Used to quickly find short curves.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace