RhinoCommon API
CurveKinkDefinition.IsTangentKink Method
Overload List
Name | Description
IsTangentKink(Curve, Double)
 True if there is a tangent discontinuity at curve(t) and the agnle between the two tangents is > KinkAngleDegrees
IsTangentKink(Vector3d, Vector3d)
 True if the angle between tangent_from_below and tangent_from_above is > KinkAngleDegrees
Top
See Also
Reference
CurveKinkDefinition Class
Rhino.Geometry Namespace