RhinoCommon API
Vector2d.Multiply Operator
Overload List
Name | Description
Multiply(Double, Vector2d)
 Multiplies a vector by a number, having the effect of scaling it.
Multiply(Vector2d, Vector2d)
 Multiplies two vectors together, returning the dot product (or inner product).
Multiply(Vector2d, Double)
 Multiplies a vector by a number, having the effect of scaling it.
Top
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace