RhinoCommon API
NurbsCurve.CreateSpiral Method
Overload List
Name | Description
CreateSpiral(Point3d, Vector3d, Point3d, Double, Double, Double, Double)
 Creates a C1 cubic NURBS approximation of a helix or spiral. For a helix, you may have radius0 == radius1. For a spiral radius0 == radius1 produces a circle. Zero and negative radii are permissible.
CreateSpiral(Curve, Double, Double, Point3d, Double, Double, Double, Double, Int32)
 Create a C2 non-rational uniform cubic NURBS approximation of a swept helix or spiral.
Top
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace