RhinoCommon API
NamedPositionTable.Rename Method
Overload List
Name | Description
Rename(Guid, String)
Rename a Named Position.
Rename(String, String)
Rename a Named Position.
Top
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace