RhinoCommon API
Brep.MergeSurfaces Method
Overload List
Name | Description
MergeSurfaces(Brep, Brep, Double, Double)
 Merges two surfaces into one surface at untrimmed edges. Both surfaces must be untrimmed and share an edge.
MergeSurfaces(Surface, Surface, Double, Double)
 Merges two surfaces into one surface at untrimmed edges.
MergeSurfaces(Brep, Brep, Double, Double, Point2d, Point2d, Double, Boolean)
 Merges two surfaces into one surface at untrimmed edges. Both surfaces must be untrimmed and share an edge.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace