RhinoCommon API
SubDVertexList.SetVertexTags Method
Overload List
Name | Description
SetVertexTags(IEnumerable<SubDVertex>, SubDVertexTag)
 Set vertex tags for a list of vertices. Useful for adding creases to SubDs
SetVertexTags(IEnumerable<Int32>, SubDVertexTag)
 Set vertex tags for a list of vertices. Useful for adding creases to SubDs
Top
See Also
Reference
SubDVertexList Class
Rhino.Geometry.Collections Namespace