RhinoCommon API
CustomCurveObject.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the CustomCurveObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomCurveObject and optionally releases the managed resources
 (Overrides CommonObject.Dispose(Boolean).)
Top
See Also
Reference
CustomCurveObject Class
Rhino.DocObjects.Custom Namespace