RhinoCommon API
File3dm.Read Method
Overload List
Name | Description
Read(String)
 Reads a 3dm file from a specified location.
Read(String, File3dm.TableTypeFilter, File3dm.ObjectTypeFilter)
 Reads a 3dm file from a specified location.
Top
See Also
Reference
File3dm Class
Rhino.FileIO Namespace