RhinoCommon API
Vector2f.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines whether the specified System.Object is a Vector2f and has the same values as the present vector.
 (Overrides ValueType.Equals(Object).)
Equals(Vector2f)
 Determines whether the specified vector has the same values as the present vector.
Top
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace