RhinoCommon API
SimpleArrayInt Constructor
Overload List
Name | Description
SimpleArrayInt()
 Initializes a new SimpleArrayInt class.
SimpleArrayInt(IEnumerable<Int32>)
 Initializes a new SimpleArrayInt class
Top
See Also
Reference
SimpleArrayInt Class
Rhino.Runtime.InteropWrappers Namespace