RhinoCommon API
ObjectTable.Show Method
Overload List
Name | Description
Show(Guid, Boolean)
 If Object().IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
Show(ObjRef, Boolean)
 If objref.Object().IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
Show(RhinoObject, Boolean)
 If obj.IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace