RhinoCommon API
TextEntity.GetTextTransform Method
Overload List
Name | Description
GetTextTransform(Double, DimensionStyle)
 Get the transform for this text object's text geometry
GetTextTransform(ViewportInfo, Double, DimensionStyle)
 Get the transform for this text object's text geometry as it is drawn in a particular viewport. Unlike the parameterless-viewport overload, this honors the dimension style's TextOrientation (for example "Horizontal to view") and DrawForward, orienting the text against the viewport exactly as the display pipeline does. Use this when previewing text so the preview matches how the placed object will be drawn.
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace