RhinoCommon API
Dialogs.ShowListBox Method
Overload List
Name | Description
ShowListBox(String, String, IList)
 Displays Rhino's list box.
ShowListBox(String, String, IList, Object)
 Displays Rhino's list box.
Top
See Also
Reference
Dialogs Class
Rhino.UI Namespace