RhinoCommon API
LinetypeTable.GetUnusedLinetypeName Method
Overload List
Name | Description
GetUnusedLinetypeName()
 Gets unused linetype name used as default when creating new linetypes.
GetUnusedLinetypeName(Boolean) |  Obsolete.
 Obsolete. Use the other overload. Gets unused linetype name used as default when creating new linetypes.
Top
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace