RhinoCommon API
ViewUserInterfaceTable.Remove Method
Overload List
Name | Description
Remove(IEnumerable<UserInterfaceObjectBase>)
Remove(UserInterfaceObjectBase)
Top
See Also
Reference
ViewUserInterfaceTable Class
Rhino.DocObjects.Tables Namespace