RhinoCommon API
GumballObject.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the GumballObject
Dispose(Boolean)
Releases the unmanaged resources used by the GumballObject and optionally releases the managed resources
Top
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace