RhinoCommon API
ArchivableDictionary.GetString Method
Overload List
Name | Description
GetString(String)
 Get value as string, will only succeed if value was created using Set(string key, string value)
GetString(String, String)
 Get value as string, will return defaultValue unless value was created using Set(string key, string value)
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace