RhinoCommon API
ChangeQueue.Dispose Method
Overload List
Name | Description
Dispose()
 Dispose our ChangeQueue
Dispose(Boolean)
 Dispose our ChangeQueue. Disposes unmanaged memory.
Top
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace