RhinoCommon API
Point2d.Multiply Method
Overload List
Name | Description
Multiply(Double, Point2d)
 Multiplies a Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Point2d, Double)
 Multiplies a Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Top
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace