RhinoCommon API
SurfaceCurvature.Equals Method
Overload List
Name | Description
Equals(Object)
 Indicates whether the current object is equal to another object of the same type.
 (Overrides Object.Equals(Object).)
Equals(SurfaceCurvature)
 Indicates whether the current object is equal to another object of the same type.
Top
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace