RhinoCommon API
PersistentSettings.GetDouble Method
Overload List
Name | Description
GetDouble(String)
GetDouble(String, Double)
GetDouble(String, Double, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace