RhinoCommon API
GetCylinder.GetMesh Method
Overload List
Name | Description
GetMesh(Int32, Int32, Cylinder)
 Prompt for the getting of a mesh cylinder.
GetMesh(Int32, Int32, Int32, Cylinder)
 Prompt for the getting of a mesh cylinder.
Top
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace