RhinoCommon API
NamedPositionTable.Objects Method
Overload List
Name | Description
Objects(Guid)
Array of Rhino Objects related to a Named Position.
Objects(String)
Array of Rhino Objects related to a Named Position.
Top
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace