RhinoCommon API
RenderMeshes.Dispose Method
Overload List
Name | Description
Dispose()
 Dispose this collection
Dispose(Boolean)
 Dispose
Top
See Also
Reference
RenderMeshes Class
Rhino.Render.CustomRenderMeshes Namespace