RhinoCommon API
Material.SetTransparencyTexture Method
Overload List
Name | Description
SetTransparencyTexture(String)
SetTransparencyTexture(Texture)
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace