RhinoCommon API
DisplayModeDescription.AddDisplayMode Method
Overload List
Name | Description
AddDisplayMode(DisplayModeDescription)
 Adds a new display mode from an existing description. Note that this only registers the mode in memory; call UpdateDisplayMode to persist it to disk.
AddDisplayMode(String)
 Adds a new display mode. Note that this only registers the mode in memory; call UpdateDisplayMode to persist it to disk.
Top
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace