RhinoCommon API
RhinoViewport.SetProjection Method
Overload List
Name | Description
SetProjection(DefinedViewportProjection, String, Boolean)
 Set viewport to a defined projection.
SetProjection(IsometricCamera, String, Boolean)
 Set viewport to a defined projection.
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace