RhinoCommon API
Dimension.UpdateDimensionText Method
Overload List
Name | Description
UpdateDimensionText(DimensionStyle, LengthUnit)
 Remakes dimension text geometry object and sets it on the dimension.
UpdateDimensionText(DimensionStyle, UnitSystem) |  Obsolete.
 Remakes dimension text geometry object and sets it on the dimension.
Top
See Also
Reference
Dimension Class
Rhino.Geometry Namespace