RhinoCommon API
Point2f Constructor
Overload List
Name | Description
Point2f(Double, Double)
 Initializes a new two-dimensional point from two double-precision floating point numbers as coordinates.
Coordinates will be internally converted to floating point numbers. This might cause precision loss.
Point2f(Single, Single)
 Initializes a new two-dimensional point from two components.
Top
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace