RhinoCommon API
PersistentSettings.GetStringDictionary Method
Overload List
Name | Description
GetStringDictionary(String)
GetStringDictionary(String, KeyValuePair<String, String>[])
GetStringDictionary(String, KeyValuePair<String, String>[], IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace