RhinoCommon API
NurbsSurface.CreateNetworkSurface Method
Overload List
Name | Description
CreateNetworkSurface(IEnumerable<Curve>, Int32, Double, Double, Double, Int32)
 Builds a surface from an auto-sorted network of curves/edges.
CreateNetworkSurface(IEnumerable<Curve>, Int32, Int32, IEnumerable<Curve>, Int32, Int32, Double, Double, Double, Int32)
 Builds a surface from an ordered network of curves/edges.
Top
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace