RhinoCommon API
Plane Constructor
Overload List
Name | Description
Plane(Plane)
Copy constructor.
Plane(Point3d, Vector3d)
 Constructs a plane from a point and a normal vector.
Plane(Point3d, Point3d, Point3d)
 Initializes a plane from three non-collinear points.
Plane(Point3d, Vector3d, Vector3d)
 Constructs a plane from a point and two vectors in the plane.
Plane(Double, Double, Double, Double)
 Constructs a plane from an equation Ax+By+Cz+D=0.
Top
See Also
Reference
Plane Structure
Rhino.Geometry Namespace