RhinoCommon API
Curve.TryGetPolyline Method
Overload List
Name | Description
TryGetPolyline(Polyline)
 Several types of Curve can have the form of a polyline including a degree 1 NurbsCurve, a PolylineCurve, and a PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline.
TryGetPolyline(Polyline, Double[])
 Several types of Curve can have the form of a polyline including a degree 1 NurbsCurve, a PolylineCurve, and a PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace