RhinoCommon API
Vector3d Constructor
Overload List
Name | Description
Vector3d(Point3d)
 Initializes a new instance of a vector, copying the three components from the three coordinates of a point.
Vector3d(Vector3d)
 Initializes a new instance of a vector, copying the three components from a vector.
Vector3d(Vector3f)
 Initializes a new instance of a vector, copying the three components from a single-precision vector.
Vector3d(Double, Double, Double)
 Initializes a new instance of a vector, using its three components.
Top
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace