RhinoCommon API
SporphSpaceMorph Constructor
Overload List
Name | Description
SporphSpaceMorph(Surface, Surface)
 Constructs a Sporph space morph.
SporphSpaceMorph(Surface, Surface, Point2d, Point2d)
 Constructs a Sporph space morph.
Top
See Also
Reference
SporphSpaceMorph Class
Rhino.Geometry.Morphs Namespace