RhinoCommon API
LayerTable.GetUnusedLayerName Method
Overload List
Name | Description
GetUnusedLayerName()
 Gets the next unused layer name used as default when creating new layers.
GetUnusedLayerName(Boolean) |  Obsolete.
 Gets the next unused layer name used as default when creating new layers.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace