RhinoCommon API
SubDEdgeList.SetEdgeTags Method
Overload List
Name | Description
SetEdgeTags(IEnumerable<SubDEdge>, SubDEdgeTag)
 Set edge tags for a list of edges. Useful for adding creases to SubDs
SetEdgeTags(IEnumerable<Int32>, SubDEdgeTag)
 Set edge tags for a list of edges. Useful for adding creases to SubDs
Top
See Also
Reference
SubDEdgeList Class
Rhino.Geometry.Collections Namespace