RhinoCommon API
Linetype.SetTaper Method
Overload List
Name | Description
SetTaper(Double, Double)
 Set taper to a simple start width / end width
SetTaper(Double, Point2d, Double)
 Set taper for this linetype width a single internal taper point
Top
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace