RhinoCommon API
RhinoObject.InVisualAnalysisMode Method
Overload List
Name | Description
InVisualAnalysisMode()
 Reports if any visual analysis mode is currently active for an object.
InVisualAnalysisMode(VisualAnalysisMode)
 Reports if a visual analysis mode is currently active for an object.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace