RhinoCommon API
SubDFaceList.Find Method
Overload List
Name | Description
Find(Int32)
 Find a face in this SubD with a given id
Find(UInt32)
 Find a face in this SubD with a given id
Top
See Also
Reference
SubDFaceList Class
Rhino.Geometry.Collections Namespace