RhinoCommon API
ObjectTable.AddTextDot Method
Overload List
Name | Description
AddTextDot(TextDot)
Adds a text dot object to Rhino.
AddTextDot(String, Point3d)
Adds a text dot object to Rhino.
AddTextDot(TextDot, ObjectAttributes)
Adds a text dot object to Rhino.
AddTextDot(String, Point3d, ObjectAttributes)
Adds a text dot object to Rhino.
AddTextDot(TextDot, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace