RhinoCommon API
RadialDimension.GetDistanceDisplayText Method
Overload List
Name | Description
GetDistanceDisplayText(LengthUnit, DimensionStyle)
GetDistanceDisplayText(UnitSystem, DimensionStyle) |  Obsolete.
Top
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace