RhinoCommon API
ClippingPlaneSurface Constructor
Overload List
Name | Description
ClippingPlaneSurface()
 Constructs an empty clipping plane surface
ClippingPlaneSurface(Plane)
 Constructs a clipping plane surface from a Plane
ClippingPlaneSurface(PlaneSurface)
 Constructs a ClippingPlaneSurface from a PlaneSurface
ClippingPlaneSurface(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace