RhinoCommon API
Panels.PanelDockBar Method
Overload List
Name | Description
PanelDockBar(Guid)
 Will always return Guid.Empty in Mac Rhino. In Windows Rhino it will look for the dock bar which contains the specified panel class Id and return the dock bar Id.
PanelDockBar(Type)
 Will always return Guid.Empty in Mac Rhino. In Windows Rhino it will look for the dock bar which contains the specified panel class Id and return the dock bar Id.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace