RhinoCommon API
DisplayPipeline.DrawCurvaturePreview Method
Overload List
Name | Description
DrawCurvaturePreview(Brep, Color)
 Draws a Brep in Curvature Analysis preview.
DrawCurvaturePreview(Mesh, Color)
 Draws a Mesh in Curvature Analysis preview.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace