RhinoCommon API
InstanceDefinitionTable.Add Method
Overload List
Name | Description
Add(String, String, Point3d, IEnumerable<GeometryBase>)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, GeometryBase, ObjectAttributes)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>, Boolean)
 Adds an instance definition to the instance definition table, optionally replacing an existing definition of the same name.
Add(String, String, String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Adds an instance definition to the instance definition table.
Add(String, String, String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>, Boolean)
 Adds an instance definition to the instance definition table, optionally replacing an existing definition of the same name.
Top
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace