RhinoCommon API
Channel.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the RenderWindow.Channel
Dispose(Boolean)
Releases the unmanaged resources used by the RenderWindow.Channel and optionally releases the managed resources
Top
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace