RhinoCommon API
RhinoMath.UnitScale Method
Overload List
Name | Description
UnitScale(UnitSystem, UnitSystem)
 Computes the scale factor for changing the measurements unit systems.
UnitScale(UnitSystem, Double, UnitSystem, Double)
 Computes the scale factor for changing the measurements unit systems.
Top
See Also
Reference
RhinoMath Class
Rhino Namespace