RhinoCommon API
ObjectTable.AddInstanceObject Method
Overload List
Name | Description
AddInstanceObject(Int32, Transform)
 Adds an instance object to the document.
AddInstanceObject(Int32, Transform, ObjectAttributes)
 Adds an instance object to the document.
AddInstanceObject(Int32, Transform, ObjectAttributes, HistoryRecord, Boolean)
 Adds an instance object to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace