RhinoCommon API
ViewCaptureSettings Constructor
Overload List
Name | Description
ViewCaptureSettings()
Construct default view capture settings
ViewCaptureSettings(ViewCaptureSettings)
Copy constructor
ViewCaptureSettings(RhinoPageView, Double)
Constructor
ViewCaptureSettings(RhinoView, Size, Double)
Constructor
Top
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace