RhinoCommon API
ContentUndoHelper Constructor
Overload List
Name | Description
ContentUndoHelper(RhinoDoc)
 Constructs a ContentUndoHelper object inside a using block to handle undo when modifying a RenderContent or - alternatively - create the ContentUndoHelper and explicitly call Dispose when you are done.
ContentUndoHelper(RhinoDoc, String) |  Obsolete.
 DEPRECATED: Constructs a ContentUndoHelper object inside a using block to handle undo when modifying a RenderContent or - alternatively - create the ContentUndoHelper and explicitly call Dispose when you are done.
Top
See Also
Reference
ContentUndoHelper Class
Rhino.Render Namespace