RhinoCommon API
SubDEdgeSharpness.ToPercentageText Method
Overload List
Name | Description
ToPercentageText(Boolean)
 Describes this sharpness as a percentage, for user interface code. A constant sharpness gives a single percentage, a variable one gives a range, and an invalid one gives a warning sign.
ToPercentageText(Double)
 Describes a single end sharpness value as a percentage, for user interface code.
Top
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace