RhinoCommon API
UndoRecord.Dispose Method
Overload List
Name | Description
Dispose()
 UndoRecord Dispose
Dispose(Boolean)
 UndoRecord Dispose
Top
See Also
Reference
UndoRecord Class
Rhino.UI.Controls Namespace