RhinoCommon API
Surface.IsoCurve Method
Overload List
Name | Description
IsoCurve(IsoStatus)
 Gets isoparametric curve that corresponds to one of the four surface edges. Other IsoStatus values are not supported.
IsoCurve(Int32, Double)
Gets isoparametric curve.
IsoCurve(IsoStatus, Double)
 Gets isoparametric curve. None is not supported, and X and Y need valid t-values in the U- or V-domain respectively.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace