RhinoCommon API
Squisher.SquishSurface Method
Overload List
Name | Description
SquishSurface(SquishParameters, Surface)
 Squish the surface into a flat brep
SquishSurface(SquishParameters, Surface, IEnumerable<GeometryBase>, List<GeometryBase>)
 Squish the surface into a flat brep
Top
See Also
Reference
Squisher Class
Rhino.Geometry Namespace