RhinoCommon API
RhinoList<T>.BinarySearch Method
Overload List
Name | Description
BinarySearch(T)
 Searches the entire sorted List for an element using the default comparer and returns the zero-based index of the element.
BinarySearch(T, IComparer<T>)
 Searches the entire sorted List for an element using the specified comparer and returns the zero-based index of the element.
BinarySearch(Int32, Int32, T, IComparer<T>)
 Searches the entire sorted List for an element using the specified comparer and returns the zero-based index of the element.
Top
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace