RhinoCommon API
StatusBar.ShowProgressMeter Method
Overload List
Name | Description
ShowProgressMeter(Int32, Int32, String, Boolean, Boolean)
 Starts, or shows, Rhino's status bar progress meter.
ShowProgressMeter(UInt32, Int32, Int32, String, Boolean, Boolean)
 Starts, or shows, Rhino's status bar progress meter.
Top
See Also
Reference
StatusBar Class
Rhino.UI Namespace