RhinoCommon API
DisplayModeDescription.ImportFromFile Method
Overload List
Name | Description
ImportFromFile(String)
 Imports a DisplayModeDescription from a Windows-style .ini file.
ImportFromFile(String, Boolean)
 Imports a DisplayModeDescription from a Windows-style .ini file.
Top
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace