RhinoCommon API
Circle.Rotate Method
Overload List
Name | Description
Rotate(Double, Vector3d)
 Rotates the circle through a given angle.
Rotate(Double, Vector3d, Point3d)
 Rotates the circle through a given angle.
Rotate(Double, Double, Vector3d)
 Rotates the circle around an axis that starts at the base plane origin.
Rotate(Double, Double, Vector3d, Point3d)
 Rotates the circle around an axis that starts at the provided point.
Top
See Also
Reference
Circle Structure
Rhino.Geometry Namespace