RhinoCommon API
Point3f Explicit Conversion Operators
Overload List
Name | Description
Explicit(Point3d to Point3f)
 Converts a double-precision point in a single-precision point. Needs explicit casting to help retain precision.
Explicit(Point3f to Vector3f)
 Converts a single-precision point in a single-precision vector. Needs explicit casting to help retain precision.
Top
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace