RhinoCommon API
Curve.MaxCurvaturePoints Method
Overload List
Name | Description
MaxCurvaturePoints()
 Returns a curve's maximum curvature points. The maximum curvature points identify where the curvature starts to decrease in both directions from the points.
MaxCurvaturePoints(Double[])
 Returns a curve's maximum curvature points. The maximum curvature points identify where the curvature starts to decrease in both directions from the points.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace