RhinoCommon API
Surface.TryGetCylinder Method
Overload List
Name | Description
TryGetCylinder(Cylinder)
Tests a surface to see if it is a portion of a cylinder within RhinoMath.ZeroTolerance and return the cylinder.
TryGetCylinder(Cylinder, Double)
Tests a surface to see if it is a portion of a cylinder and return the infinite cylinder.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace