RhinoCommon API
ViewportInfo.GetScreenPort Method
Overload List
Name | Description
GetScreenPort()
 Gets the location of viewport in pixels. See documentation for SetScreenPort.
GetScreenPort(Int32, Int32)
 Gets the location of viewport in pixels.
See value meanings in SetScreenPort.
Top
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace