RhinoCommon API
GumballDisplayConduit.SetBaseGumball Method
Overload List
Name | Description
SetBaseGumball(GumballObject)
 Contents of the gumball are copied to the base gumball of this class.
SetBaseGumball(GumballObject, GumballAppearanceSettings)
 Contents of the gumball are copied to the base gumball of this class.
Top
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace