RhinoCommon API
RhinoAccountsProxyException Constructor
Overload List
Name | Description
RhinoAccountsProxyException(Exception)
 Generates a new instance of the exception.
RhinoAccountsProxyException(String, Exception)
 Generates a new instance of the exception.
Top
See Also
Reference
RhinoAccountsProxyException Class
Rhino.Runtime.RhinoAccounts Namespace