RhinoCommon API
Intersection.MeshLine Method
Overload List
Name | Description
MeshLine(Mesh, Line)
 Finds the intersections of a mesh and a line.
MeshLine(Mesh, Line, Int32[])
 Finds the intersections of a mesh and a line. The points are not necessarily sorted.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace