RhinoCommon API
Rectangle3d Constructor
Overload List
Name | Description
Rectangle3d(Plane, Interval, Interval)
 Initializes a new rectangle from dimensions.
Rectangle3d(Plane, Point3d, Point3d)
 Initializes a new rectangle from a base plane and two corner points.
Rectangle3d(Plane, Double, Double)
 Initializes a new rectangle from width and height.
Top
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace