RhinoCommon API
PersistentSettings.TryGetStringDictionary Method
Overload List
Name | Description
TryGetStringDictionary(String, KeyValuePair<String, String>[])
TryGetStringDictionary(String, KeyValuePair<String, String>[], IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace