RhinoCommon API
SimpleArrayFloat Constructor
Overload List
Name | Description
SimpleArrayFloat()
 Initializes a new SimpleArrayFloat class.
SimpleArrayFloat(IEnumerable<Single>)
 Initializes a new SimpleArrayFloat class
SimpleArrayFloat(Int32)
 Initializes a new SimpleArrayFloat class. Initial size of the array - all values are set to zero.
SimpleArrayFloat(SimpleArrayFloat)
 Initializes a new SimpleArrayFloat with the contents of another SimpleArrayFloat.
Top
See Also
Reference
SimpleArrayFloat Class
Rhino.Runtime.InteropWrappers Namespace