RhinoCommon API
SubDComponentParameter.Equals Method
Overload List
Name | Description
Equals(Object)
Indicates whether this instance and a specified object are equal.
 (Overrides ValueType.Equals(Object).)
Equals(SubDComponentParameter)
Indicates whether the current object is equal to another object of the same type.
Top
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace