RhinoCommon API
MeshVertexColorList.SetColor Method
Overload List
Name | Description
SetColor(Int32, Color)
 Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
SetColor(MeshFace, Color)
 Sets a color at the three or four vertex indices of a specified face.
SetColor(Int32, Int32, Int32, Int32)
 Sets or adds a vertex color to the color List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
Top
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace