RhinoCommon API
File3dmObject.Equals Method
Overload List
Name | Description
Equals(File3dmObject)
 Verified that two File3dmObject items refer to the same object in a document.
Equals(Object)
 Verified that two objects refer to the same object in a document.
 (Overrides Object.Equals(Object).)
Top
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace