RhinoCommon API
TextureMapping.TryGetMappingCylinder Method
Overload List
Name | Description
TryGetMappingCylinder(Cylinder)
 Get a cylindrical projection parameters from this texture mapping.
TryGetMappingCylinder(Cylinder, Boolean)
 Get a cylindrical projection parameters from this texture mapping.
Top
See Also
Reference
TextureMapping Class
Rhino.Render Namespace