RhinoCommon API
DisplayPipeline.DrawZebraPreview Method
Overload List
Name | Description
DrawZebraPreview(Brep, Color)
 Draws a shaded Brep with Zebra stripe preview.
DrawZebraPreview(Mesh, Color)
 Draws a shaded Mesh with Zebra stripe preview.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace