RhinoCommon API
RenderMaterial.AssignTo Method
Overload List
Name | Description
AssignTo(ObjRef)
AssignTo(IEnumerable<ObjRef>, RenderMaterial.AssignToSubFaceChoices, RenderMaterial.AssignToBlockChoices, Boolean)
Top
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace