RhinoCommon API
Mesh.ShrinkWrap Method
Overload List
Name | Description
ShrinkWrap(ShrinkWrapParameters)
 Returns a ShrinkWrapped mesh or null when a mesh was not created or error.
ShrinkWrap(IEnumerable<Mesh>, ShrinkWrapParameters)
 Creates a unified ShrinkWrap mesh from a collection of input meshes. Returns null on error or failure.
ShrinkWrap(PointCloud, ShrinkWrapParameters)
 Creates a unified ShrinkWrap mesh from a point cloud returns null on error or failure
ShrinkWrap(ShrinkWrapParameters, CancellationToken)
 Returns a ShrinkWrapped mesh or null when a mesh was not created or error. Supports cancellation during volumetric calculations.
ShrinkWrap(IEnumerable<GeometryBase>, ShrinkWrapParameters, MeshingParameters)
 Creates a unified ShrinkWrap mesh from a collection of GeometryBase objects. returns null or error on failure
ShrinkWrap(IEnumerable<Mesh>, ShrinkWrapParameters, CancellationToken)
 Creates a unified ShrinkWrap mesh from a collection of input meshes. Returns null on error or failure. Supports cancellation during volumetric calculations.
ShrinkWrap(PointCloud, ShrinkWrapParameters, CancellationToken)
 Creates a unified ShrinkWrap mesh from a point cloud returns null on error or failure Supports cancellation during volumetric calculations.
ShrinkWrap(IEnumerable<GeometryBase>, ShrinkWrapParameters, MeshingParameters, CancellationToken)
 Creates a unified ShrinkWrap mesh from a collection of GeometryBase objects. returns null or error on failure Supports cancellation during volumetric calculations. geometryBase mesh creation is not cancellable
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace