RhinoCommon API
Point3dGrid Constructor
Overload List
Name | Description
Point3dGrid()
 Initializes a rectangular grid of points, with no points in it.
Point3dGrid(Int32, Int32)
 Initializes a rectangular grid of points with a given number of columns and rows.
Point3dGrid(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
See Also
Reference
Point3dGrid Class
Rhino.Geometry Namespace