RhinoCommon API
Surface.TryGetPlane Method
Overload List
Name | Description
TryGetPlane(Plane)
Tests a surface for planarity and return the plane.
TryGetPlane(Plane, Double)
Tests a surface for planarity and return the plane.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace