RhinoCommon API
GetBaseClass.AddOptionInteger Method
Overload List
Name | Description
AddOptionInteger(LocalizeStringPair, OptionInteger)
 Adds a command line option to get integers and automatically save the value.
AddOptionInteger(String, OptionInteger)
 Adds a command line option to get integers and automatically save the value.
AddOptionInteger(LocalizeStringPair, OptionInteger, String)
 Adds a command line option to get integers and automatically save the value.
AddOptionInteger(String, OptionInteger, String)
 Adds a command line option to get integers and automatically save the value.
Top
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace