RhinoCommon API
Point2f.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines whether the specified System.Object is a Point2f and has the same values as the present point.
 (Overrides ValueType.Equals(Object).)
Equals(Point2f)
 Determines whether the specified Point2f has the same values as the present point.
Top
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace