RhinoCommon API
DimStyleTable.Add Method
Overload List
Name | Description
Add(String)
 Adds a new AnnotationStyle to the document. The new AnnotationStyle will be initialized with the current default AnnotationStyle properties.
Add(DimensionStyle, Boolean)
 Adds a new DimensionStyle to the document.
Add(String, Boolean)
 Adds a new AnnotationStyle to the document. The new AnnotationStyle will be initialized with the current default AnnotationStyle properties.
Top
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace