RhinoCommon API
DisplayPipeline.DrawLines Method
Overload List
Name | Description
DrawLines(IEnumerable<Line>, Color)
 Draws a set of lines with a given color and thickness. If you want the fastest possible set of lines to be drawn, pass a Line[] for lines.
DrawLines(Line[], DisplayPen)
DrawLines(IEnumerable<Line>, Color, Int32)
 Draws a set of lines with a given color and thickness. If you want the fastest possible set of lines to be drawn, pass a Line[] for lines.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace