RhinoCommon API
Transform2d.Translation Method
Overload List
Name | Description
Translation(Vector2d)
 Constructs a new translation (move) transformation.
Translation(Double, Double)
 Constructs a new translation (move) transformation. Right column is (dx, dy).
Top
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace