RhinoCommon API
MaterialTable.Find Method
Overload List
Name | Description
Find(Guid, Boolean)
Finds a material with a matching id.
Find(Material, Boolean)
 Finds a material index.
Find(String, Boolean)
 Finds a material with a given name.
Top
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace