RhinoCommon API
SubD.ToBrep Method
Overload List
Name | Description
ToBrep()
 Create a Brep based on this SubD geometry, based on SubDToBrepOptions.Default options.
ToBrep(SubDToBrepOptions)
 Create a Brep based on this SubD geometry.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace