RhinoCommon API
Quaternion.Multiply Operator
Overload List
Name | Description
Multiply(Quaternion, Quaternion)
 Multiplies a quaternion with another one.
Quaternion multiplication (Hamilton product) is not commutative.
Multiply(Quaternion, Double)
 Multiplies (scales) all quaternion coefficients by a factor and returns a new quaternion with the result.
Multiply(Quaternion, Int32)
 Multiplies (scales) all quaternion coefficients by a factor and returns a new quaternion with the result.
Multiply(Quaternion, Single)
 Multiplies (scales) all quaternion coefficients by a factor and returns a new quaternion with the result.
Top
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace