RhinoCommon API
Mesh.CreateBooleanUnion Method
Overload List
Name | Description
CreateBooleanUnion(IEnumerable<Mesh>)
 Computes the solid union of a set of meshes. WARNING: Use the overload that takes a tolerance or options.
CreateBooleanUnion(IEnumerable<Mesh>, Double)
 Computes the solid union of a set of meshes.
CreateBooleanUnion(IEnumerable<Mesh>, MeshBooleanOptions, Result)
 Computes the solid union of a set of meshes.
CreateBooleanUnion(IEnumerable<Mesh>, MeshBooleanOptions, Result, Int32[][])
 Computes the solid union of a set of meshes and reports which inputs contributed to each output.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace