RhinoCommon API
NurbsSurface.CreateFromCorners Method
Overload List
Name | Description
CreateFromCorners(Point3d, Point3d, Point3d)
 Makes a surface from 3 corner points.
CreateFromCorners(Point3d, Point3d, Point3d, Point3d)
 Makes a surface from 4 corner points.
This is the same as calling CreateFromCorners(Point3d, Point3d, Point3d, Point3d, Double) with tolerance 0.
CreateFromCorners(Point3d, Point3d, Point3d, Point3d, Double)
 Makes a surface from 4 corner points.
Top
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace