RhinoCommon API
File3dmObjectTable.AddSphere Method
Overload List
Name | Description
AddSphere(Sphere)
 Adds a surface object to the document representing a sphere.
AddSphere(Sphere, ObjectAttributes)
 Adds a surface object to the document representing a sphere.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace