RhinoCommon API
Circle.ToNurbsCurve Method
Overload List
Name | Description
ToNurbsCurve()
 Constructs a nurbs curve representation of this circle. This amounts to the same as calling NurbsCurve.CreateFromCircle().
ToNurbsCurve(Int32, Int32)
 Create a uniform non-rational cubic NURBS approximation of a circle.
Top
See Also
Reference
Circle Structure
Rhino.Geometry Namespace