RhinoCommon API
MeshTopologyEdgeList.SplitEdge Method
Overload List
Name | Description
SplitEdge(Int32, Point3d)
 Divides a mesh edge to create two or more triangles
SplitEdge(Int32, Double)
 Divides a mesh edge to create two or more triangles
Top
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace