RhinoCommon API
WorksessionFileLayerValues Constructor
Overload List
Name | Description
WorksessionFileLayerValues()
Creates layer settings with the defaults: visible, unlocked and black.
WorksessionFileLayerValues(WorksessionFileLayerValues)
Creates a copy of other layer settings.
Top
See Also
Reference
WorksessionFileLayerValues Class
Rhino.FileIO Namespace