RhinoCommon API
TextureMapping.CreatePlaneMapping Method
Overload List
Name | Description
CreatePlaneMapping(Plane, Interval, Interval, Interval)
Create a planar UV projection texture mapping
CreatePlaneMapping(Plane, Interval, Interval, Interval, Boolean)
Create a planar projection texture mapping
Top
See Also
Reference
TextureMapping Class
Rhino.Render Namespace