RhinoCommon API
LicenseUtils.AskUserForLicense Method
Overload List
Name | Description
AskUserForLicense(Int32, Boolean, Object, String, ValidateProductKeyDelegate, OnLeaseChangedDelegate, String, String, Guid, Guid, LicenseCapabilities)
 This version of Rhino.PlugIns.LicenseUtils.AskUserForLicense is used by Rhino C++ plug-ins.
AskUserForLicense(Int32, Boolean, Object, String, ValidateProductKeyDelegate, OnLeaseChangedDelegate, VerifyLicenseKeyDelegate, VerifyPreviousVersionLicenseDelegate, String, String, Guid, Guid, LicenseCapabilities)
Top
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace