RhinoCommon API
DisplayPipeline.DrawTorus Method
Overload List
Name | Description
DrawTorus(Torus, Color)
 Draw a wireframe torus.
DrawTorus(Torus, Color, Int32)
 Draw a wireframe torus.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace