RhinoCommon API
UserInterfaceGrid.SetPadding Method
Overload List
Name | Description
SetPadding(Double)
 Space between the edges of the grid and its cells in logical pixels. The default is 6 on all four sides.
SetPadding(Double, Double, Double, Double)
Top
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace