RhinoCommon API
MeshFaceList.AddFace Method
Overload List
Name | Description
AddFace(MeshFace)
 Appends a new mesh face to the end of the mesh face list.
AddFace(Int32, Int32, Int32)
 Appends a new triangular face to the end of the mesh face list.
AddFace(Int32, Int32, Int32, Int32)
 Appends a new quadrangular face to the end of the mesh face list.
Top
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace