RhinoCommon API
ObjectPropertiesPage.RunScript Method
Overload List
Name | Description
RunScript(ObjectPropertiesPageEventArgs)
 This method is called when scripting the Rhino Properties command and choosing this page.
RunScript(RhinoDoc, RhinoObject[]) |  Obsolete.
 This method is called when scripting the Rhino Properties command and choosing this page.
Top
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace