RhinoCommon API
ObjectTable.FindClippingPlanesForViewport Method
Overload List
Name | Description
FindClippingPlanesForViewport(RhinoViewport)
 Finds all of the visible clipping plane objects that actively clip a viewport.
FindClippingPlanesForViewport(RhinoViewport, Boolean)
 Finds all of the clipping plane objects that actively clip a viewport.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace