RhinoCommon API
TextFields.Area Method
Overload List
Name | Description
Area(String)
 Returns the area value for a selected object id
Area(String, String)
 Returns the area value for a selected object id in a specified unit system
Top
See Also
Reference
TextFields Class
Rhino.Runtime Namespace