RhinoCommon API
Point2d.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines whether the specified System.Object is a Point2d and has the same values as the present point.
 (Overrides ValueType.Equals(Object).)
Equals(Point2d)
 Determines whether the specified Point2d has the same values as the present point.
Top
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace