RhinoCommon API
NamedConstructionPlaneTable.Add Method
Overload List
Name | Description
Add(ConstructionPlane)
 Adds named construction plane to document.
Add(String, Plane)
 Adds named construction plane to document.
Top
See Also
Reference
NamedConstructionPlaneTable Class
Rhino.DocObjects.Tables Namespace