RhinoCommon API
PointCloud.CreateContourCurves Method
Overload List
Name | Description
CreateContourCurves(Point3d, Point3d, Double, Double)
 Creates a planar curves by intersecting a plane with a point cloud.
CreateContourCurves(Point3d, Point3d, Double, Double, Double, Double, Boolean, Boolean, Boolean, Double)
 Creates a planar curves by intersecting a plane with a point cloud.
Top
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace