RhinoCommon API
Mesh.QuadRemeshAsync Method
Overload List
Name | Description
QuadRemeshAsync(QuadRemeshParameters, IProgress<Int32>, CancellationToken)
 Quad remesh this mesh asynchronously.
QuadRemeshAsync(QuadRemeshParameters, IEnumerable<Curve>, IProgress<Int32>, CancellationToken)
 Quad remesh this mesh asynchronously.
QuadRemeshAsync(IEnumerable<Int32>, QuadRemeshParameters, IEnumerable<Curve>, IProgress<Int32>, CancellationToken)
 Quad remesh this mesh asynchronously.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace