RhinoCommon API
Mesh.CreateBooleanDifference Method
Overload List
Name | Description
CreateBooleanDifference(IEnumerable<Mesh>, IEnumerable<Mesh>)
 Computes the solid difference of two sets of Meshes.
CreateBooleanDifference(IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result)
 Computes the solid difference of two sets of Meshes.
CreateBooleanDifference(IEnumerable<Mesh>, IEnumerable<Mesh>, MeshBooleanOptions, Result, Int32[][])
 Computes the solid difference of two sets of meshes and reports which inputs contributed to each output.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace