RhinoCommon API
MaterialRefs.Add Method
Overload List
Name | Description
Add(KeyValuePair<Guid, MaterialRef>)
 Adds an item to this dictionary.
Add(Guid, MaterialRef)
 Add or replace an element with the provided key and value to this dictionary.
Top
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace