RhinoCommon API
Surface.InterpolatedCurveOnSurfaceUV Method
Overload List
Name | Description
InterpolatedCurveOnSurfaceUV(IEnumerable<Point2d>, Double)
 Returns a curve that interpolates points on a surface. The interpolant lies on the surface.
InterpolatedCurveOnSurfaceUV(IEnumerable<Point2d>, Double, Boolean, Int32)
 Returns a curve that interpolates points on a surface. The interpolant lies on the surface.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace