RhinoCommon API
ColorXYZ Constructor
Overload List
Name | Description
ColorXYZ(Color)
 Constructs a new instance of ColorXYZ that is equivalent to an ARGB color.
ColorXYZ(Double, Double, Double)
 Constructs a new instance of ColorXYZ with custom channel values.
ColorXYZ(Double, Double, Double, Double)
 Constructs a new instance of ColorXYZ with custom channel values.
Top
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace