RhinoCommon API
RhinoMath.EpsilonEquals Method
Overload List
Name | Description
EpsilonEquals(Double, Double, Double)
 Compare two doubles for equality within some "epsilon" range
EpsilonEquals(Single, Single, Single)
 Compare to floats for equality within some "epsilon" range
Top
See Also
Reference
RhinoMath Class
Rhino Namespace