RhinoCommon API
SubD.Subdivide Method
Overload List
Name | Description
Subdivide()
 Apply the Catmull-Clark subdivision algorithm and save the results in this SubD.
Subdivide(IEnumerable<Int32>)
 Apply the Catmull-Clark subdivision algorithm and save the results in this SubD.
Subdivide(Int32)
 Apply the Catmull-Clark subdivision algorithm and save the results in this SubD.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace