RhinoCommon API
TextFields.GetInstanceAttributeFields Method
Overload List
Name | Description
GetInstanceAttributeFields(InstanceDefinition)
GetInstanceAttributeFields(String)
 Gets an array of block attribute definitions associated with a TextObject.
GetInstanceAttributeFields(TextObject)
 Gets an array of block attribute definitions associated with a TextObject.
Top
See Also
Reference
TextFields Class
Rhino.Runtime Namespace