RhinoCommon API
DisplayBitmap Constructor
Overload List
Name | Description
DisplayBitmap(Bitmap)
 Constructs a DisplayBitmap from an existing bitmap.
DisplayBitmap(String, Bitmap)
 Creates a DisplayBitmap either from a path, or a bitmap. If the path is null, a random tag name will be used. If the bitmap is null, the bitmap will be loaded from the path. If both are null, the object is invalid. if both are valid objects, the bitmap will be used and it will be added to Rhino's bitmap cache with the path supplied. In other words, this is a way to add a bitmap from memory directly into Rhino's memory cache.
Top
See Also
Reference
DisplayBitmap Class
Rhino.Display Namespace