RhinoCommon API
Decal.TextureRenderHash Method
Overload List
Name | Description
TextureRenderHash(CrcRenderHashFlags) |  Obsolete.
 Get the texture render hash for the referenced texture using the specified CrcRenderHashFlags.
TextureRenderHash(CrcRenderHashFlags, LinearWorkflow) |  Obsolete.
 Get the texture render hash for the referenced texture using the specified CrcRenderHashFlags and linear workflow.
Top
See Also
Reference
Decal Class
Rhino.Render Namespace