RhinoCommon API
NurbsCurve.GrevillePoints Method
Overload List
Name | Description
GrevillePoints()
 Gets all Greville points for this curve.
GrevillePoints(Boolean)
 Gets Greville points for this curve.
Top
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace