RhinoCommon API
Unroller.PerformUnroll Method
Overload List
Name | Description
PerformUnroll(List<Brep>)
 Executes unrolling operations.
PerformUnroll(Curve[], Point3d[], TextDot[])
 Executes unrolling operations.
Top
See Also
Reference
Unroller Class
Rhino.Geometry Namespace