RhinoCommon API
RenderContent.AddUserInterfaceSection Method
Overload List
Name | Description
AddUserInterfaceSection(ICollapsibleSection)
AddUserInterfaceSection(Type, String, Boolean, Boolean) |  Obsolete.
 Add a new .NET control to an content expandable tab section, the height of the createExpanded tabs client area will be the initial height of the specified control.
Top
See Also
Reference
RenderContent Class
Rhino.Render Namespace