RhinoCommon API
PageViewGroupTable.GetUnusedName Method
Overload List
Name | Description
GetUnusedName()
 Gets an unused page view group name.
GetUnusedName(String)
 Gets an unused page view group name.
Top
See Also
Reference
PageViewGroupTable Class
Rhino.DocObjects.Tables Namespace