RhinoCommon API
PersistentSettings.TryGetRectangle Method
Overload List
Name | Description
TryGetRectangle(String, Rectangle)
TryGetRectangle(String, Rectangle, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace