RhinoCommon API
File3dmObjectTable.AddSubD Method
Overload List
Name | Description
AddSubD(SubD)
 Adds a SubD to the document
AddSubD(SubD, ObjectAttributes)
 Adds a SubD to the document
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace