RhinoCommon API
EarthAnchorPoint.GetModelToEarthTransform Method
Overload List
Name | Description
GetModelToEarthTransform(LengthUnit)
 Gets a transformation from model coordinates to earth coordinates. This transformation assumes the model is small enough that the curvature of the earth can be ignored.
GetModelToEarthTransform(UnitSystem) |  Obsolete.
 Gets a transformation from model coordinates to earth coordinates. This transformation assumes the model is small enough that the curvature of the earth can be ignored.
Top
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace