RhinoCommon API
ObjectTable.AddBrep Method
Overload List
Name | Description
AddBrep(Brep)
Adds a brep object to Rhino.
AddBrep(Brep, ObjectAttributes)
Adds a brep object to Rhino.
AddBrep(Brep, ObjectAttributes, HistoryRecord, Boolean)
AddBrep(Brep, ObjectAttributes, HistoryRecord, Boolean, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace