RhinoCommon API
SurfaceFilletBase Constructor
Overload List
Name | Description
SurfaceFilletBase(BrepFace, Curve, BrepFace, Point2d, Double)
Initializes a new instance of the SurfaceFilletBase class
SurfaceFilletBase(BrepFace, Point2d, BrepFace, Point2d, Double, Double)
Initializes a new instance of the SurfaceFilletBase class
SurfaceFilletBase(BrepFace, Point2d, Curve, Double, Double, Double)
Initializes a new instance of the SurfaceFilletBase class
SurfaceFilletBase(BrepFace, Point2d, BrepFace, Point2d, Double, Boolean, Double)
Initializes a new instance of the SurfaceFilletBase class
SurfaceFilletBase(BrepFace, Point2d, BrepFace, Point2d, Double, Double, Boolean, Double)
Initializes a new instance of the SurfaceFilletBase class
Top
See Also
Reference
SurfaceFilletBase Class
Rhino.Geometry Namespace