RhinoCommon API
RhinoApp.WriteLine Method
Overload List
Name | Description
WriteLine()
Print a newline in the command window.
WriteLine(String)
Print text in the command window.
WriteLine(String, Object)
Print formatted text with a newline in the command window.
WriteLine(String, Object, Object)
Print formatted text with a newline in the command window.
WriteLine(String, Object, Object, Object)
Print formatted text with a newline in the command window.
Top
See Also
Reference
RhinoApp Class
Rhino Namespace