RhinoCommon API
GetPoint.Get Method
Overload List
Name | Description
Get()
 After setting up options and so on, call GetPoint::Get to get a 3d point. The point is retrieved when the mouse goes down.
Get(Boolean)
 After setting up options and so on, call this method to get a 3d point.
Get(Boolean, Boolean)
 After setting up options and so on, call this method to get a 2d or 3d point.
Top
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace