RhinoCommon API
OptionDouble Constructor
Overload List
Name | Description
OptionDouble(Double)
Initializes a new instance of the OptionDouble class
OptionDouble(Double, Boolean, Double)
 Initializes a new instance of the double option class.
OptionDouble(Double, Double, Double)
 Initializes a new instance of the OptionDouble class with lower and upper limits.
Top
See Also
Reference
OptionDouble Class
Rhino.Input.Custom Namespace