RhinoCommon API
PageViewGroupTable.Add Method
Overload List
Name | Description
Add()
 Adds a new page view group to the table. The new page view group will be given a unique name.
Add(IEnumerable<RhinoPageView>)
 Adds a new page view group to the table, and adds page views to the group. The new page view group will be given a unique name.
Add(PageViewGroup)
 Adds a new page view group to the table.
Add(PageViewGroup, IEnumerable<RhinoPageView>)
 Adds a new page view group to the table, and adds page views to the group.
Top
See Also
Reference
PageViewGroupTable Class
Rhino.DocObjects.Tables Namespace