RhinoCommon API
SweepTwoRail.PerformSweep Method
Overload List
Name | Description
PerformSweep(Curve, Curve, Curve)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweep(Curve, Curve, IEnumerable<Curve>)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweep(Curve, Curve, Curve, Double, Double)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweep(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
Top
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace