RhinoCommon API
PersistentSettings.GetStringList Method
Overload List
Name | Description
GetStringList(String)
GetStringList(String, String[])
GetStringList(String, String[], IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace