RhinoCommon API
InstanceDefinitionTable.Delete Method
Overload List
Name | Description
Delete(InstanceDefinition)
 Deletes the instance definition. This deletes all references too.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32, Boolean, Boolean)
 Deletes the instance definition.
Top
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace