RhinoCommon API
Line.Equals Method
Overload List
Name | Description
Equals(Line)
 Determines whether a line has the same value as this line.
Equals(Object)
 Determines whether an object is a line that has the same value as this line.
 (Overrides ValueType.Equals(Object).)
Top
See Also
Reference
Line Structure
Rhino.Geometry Namespace