RhinoCommon API
Arc Constructor
Overload List
Name | Description
Arc(Circle, Interval)
 Initializes a new instance of an arc from a base circle and an interval of angles.
Arc(Circle, Double)
 Initializes a new instance of an arc from a base circle and an angle.
Arc(Plane, Double, Double)
 Initializes a new arc from a base plane, a radius value and an angle.
Arc(Point3d, Point3d, Point3d)
 Initializes a new arc through three points. If the points are coincident or co-linear, this will result in an Invalid arc.
Arc(Point3d, Vector3d, Point3d)
 Initializes a new arc from end points and a tangent vector. If the tangent is parallel with the line segment between the two endpoints this will result in an Invalid arc.
Arc(Point3d, Double, Double)
 Initializes a new horizontal arc at the given center point, with a custom radius and angle.
Arc(Plane, Point3d, Double, Double)
 Initializes a new aligned arc at the given center point, with a custom radius and angle.
Top
See Also
Reference
Arc Structure
Rhino.Geometry Namespace