RhinoCommon API
File3dmObjectTable.AddInstanceObject Method
Overload List
Name | Description
AddInstanceObject(InstanceReferenceGeometry)
 Adds an instance reference geometry object to the table.
AddInstanceObject(InstanceReferenceGeometry, ObjectAttributes)
 Adds an instance reference geometry object to the table.
AddInstanceObject(Int32, Transform)
 Adds an instance reference geometry object to the table.
AddInstanceObject(Int32, Transform, ObjectAttributes)
 Adds an instance reference geometry object to the table.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace