RhinoCommon API
SubDEdgeSharpness Constructor
Overload List
Name | Description
SubDEdgeSharpness(Double)
 Creates a sharpness with the same value at both ends.
SubDEdgeSharpness(Interval)
 Creates a sharpness that varies from one end of the edge to the other.
SubDEdgeSharpness(Double, Double)
 Creates a sharpness that varies from one end of the edge to the other.
Top
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace