RhinoCommon API
RhinoCore.InvokeInHostContext Method
Overload List
Name | Description
InvokeInHostContext(Action)
 Invokes action in Host context
InvokeInHostContext<T>(Func<T>)
 Invokes function in Host context
Top
See Also
Reference
RhinoCore Class
Rhino.Runtime.InProcess Namespace