RhinoCommon API
Mesh.GetCachedTextureCoordinates Method
Overload List
Name | Description
GetCachedTextureCoordinates(Guid)
 Call this method to get cached texture coordinates for a texture mapping with the specified Id.
GetCachedTextureCoordinates(RhinoObject, Texture)
 Returns cached texture coordinate set based on the texture. Make sure to set up cached texture coordinates for all textures in the material first by calling SetCachedTextureCoordinatesFromMaterial(RhinoObject rhinoObject, Rhino.DocObjects.Material material) If this function returns null then there are no texture coordinates available.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace