RhinoCommon API
SweepTwoRail.PerformSweepRefit Method
Overload List
Name | Description
PerformSweepRefit(Curve, Curve, Curve, Double)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRefit(Curve, Curve, IEnumerable<Curve>, Double)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRefit(Curve, Curve, Curve, Double, Double, Double)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRefit(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>, Double)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
Top
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace