RhinoCommon API
File3dm.ReadWithLog Method
Overload List
Name | Description
ReadWithLog(String, String)
 Read a 3dm file from a specified location and log any archive reading errors.
ReadWithLog(String, File3dm.TableTypeFilter, File3dm.ObjectTypeFilter, String)
 Reads a 3dm file from a specified location.
Top
See Also
Reference
File3dm Class
Rhino.FileIO Namespace