RhinoCommon API
RenderContentKindList Constructor
Overload List
Name | Description
RenderContentKindList()
 Construct an empty kind list
RenderContentKindList(IntPtr)
 Construct from native pointer - internal use only.
RenderContentKindList(RenderContentKindList)
 Construct a kind list from another.
Top
See Also
Reference
RenderContentKindList Class
Rhino.Render Namespace