RhinoCommon API
OptionToggle.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the OptionToggle
Dispose(Boolean)
Releases the unmanaged resources used by the OptionToggle and optionally releases the managed resources
Top
See Also
Reference
OptionToggle Class
Rhino.Input.Custom Namespace