RhinoCommon API
InstanceDefinition.UseCount Method
Overload List
Name | Description
UseCount()
 Returns the number of references of this instance definition in the model. Both top-level references and nested instances are included in the count.
UseCount(Int32, Int32)
 Returns the number of references of this instance definition in the model. Both top-level references and nested instances are included in the count.
Top
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace