RhinoCommon API
Curve.TryGetArc Method
Overload List
Name | Description
TryGetArc(Arc)
 Try to convert this curve into an Arc using RhinoMath.ZeroTolerance.
TryGetArc(Arc, Double)
 Try to convert this curve into an Arc using a custom tolerance.
TryGetArc(Plane, Arc)
 Try to convert this curve into an Arc using RhinoMath.ZeroTolerance.
TryGetArc(Plane, Arc, Double)
 Try to convert this curve into an Arc using a custom tolerance.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace