RhinoCommon API
CurveList Constructor
Overload List
Name | Description
CurveList()
 Initializes a new empty list of curves.
CurveList(IEnumerable<Curve>)
 Initializes a new list that is filled with all items of the input enumerable.
Input items are not explicitly duplicated (this is a shallow copy).
CurveList(Int32)
 Initializes a new empty list of curves with a predefined capacity.
This is the amount of items the list will accept before resizing.
Top
See Also
Reference
CurveList Class
Rhino.Collections Namespace