RhinoCommon API
FileTypeList Constructor
Overload List
Name | Description
FileTypeList()
Initializes a new instance of the FileTypeList class
FileTypeList(String, String)
Initializes a new instance of the FileTypeList class
FileTypeList(String, String, Boolean)
Initializes a new instance of the FileTypeList class
Top
See Also
Reference
FileTypeList Class
Rhino.PlugIns Namespace