RhinoCommon API
Light.CreateSunLight Method
Overload List
Name | Description
CreateSunLight(Sun)
 Constructs a light which simulates a Sun.
CreateSunLight(Double, Double, Double)
 Constructs a light that represents the Sun.
CreateSunLight(Double, DateTime, Double, Double)
 Constructs a light which simulates the Sun based on a given time and location on Earth.
Top
See Also
Reference
Light Class
Rhino.Geometry Namespace