RhinoCommon API
HiddenLineDrawingParameters.AddGeometryAndPlanes Method
Overload List
Name | Description
AddGeometryAndPlanes(GeometryBase, Object, List<Plane>)
 Add geometry and its active clipping planes to be included in the calculation
AddGeometryAndPlanes(GeometryBase, Transform, Object, List<Plane>)
 Add geometry and its active clipping planes to be included in the calculation
AddGeometryAndPlanes(GeometryBase, Object, Boolean, List<Plane>)
 Add geometry and its active clipping planes to be included in the calculation
AddGeometryAndPlanes(GeometryBase, Transform, Object, Boolean, List<Plane>)
 Add geometry and its active clipping planes to be included in the calculation
Top
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace