RhinoCommon API
RenderTexture.SimulateTexture Method
Overload List
Name | Description
SimulateTexture(SimulatedTexture, Boolean) |  Obsolete.
SimulateTexture(SimulatedTexture, RenderTexture.TextureGeneration, Int32, RhinoObject)
Top
See Also
Reference
RenderTexture Class
Rhino.Render Namespace