RhinoCommon API
Brep.CreateFromTaperedExtrude Method
Overload List
Name | Description
CreateFromTaperedExtrude(Curve, Double, Vector3d, Point3d, Double, ExtrudeCornerType) |  Obsolete.
 Extrude a curve to a taper making a brep (potentially more than 1)
CreateFromTaperedExtrude(Curve, Double, Vector3d, Point3d, Double, ExtrudeCornerType, Double, Double)
 Extrude a curve to a taper making a brep (potentially more than 1)
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace