RhinoCommon API
DisplayPipeline.DrawMeshWires Method
Overload List
Name | Description
DrawMeshWires(Mesh, Color)
 Draws all the wires in a given mesh.
DrawMeshWires(Mesh, Color, Int32)
 Draws all the wires in a given mesh.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace