RhinoCommon API
ArchivableDictionary.GetPoint3f Method
Overload List
Name | Description
GetPoint3f(String)
 Get value as Point3f, will only succeed if value was created using Set(string key, Point3f value)
GetPoint3f(String, Point3f)
 Get value as Point3f, will return defaultValue unless value was created using Set(string key, Point3f value)
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace