RhinoCommon API
ComponentStatus.Equals Method
Overload List
Name | Description
Equals(ComponentStatus)
 Determines if another ComponentStatus and this are equal.
Equals(Object)
 Determines if an object and this are equal.
 (Overrides ValueType.Equals(Object).)
Top
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace