RhinoCommon API
ObjectTable.AddCircle Method
Overload List
Name | Description
AddCircle(Circle)
Adds a curve object to the document representing a circle.
AddCircle(Circle, ObjectAttributes)
Adds a curve object to the document representing a circle.
AddCircle(Circle, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace