RhinoCommon API
File3dm.WriteWithLog Method
Overload List
Name | Description
WriteWithLog(String, File3dmWriteOptions, String)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
WriteWithLog(String, Int32, String)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
Top
See Also
Reference
File3dm Class
Rhino.FileIO Namespace