RhinoCommon API
BinaryArchiveReader.Dump3dmChunk Method
Overload List
Name | Description
Dump3dmChunk(TextLog)
 Function for studying contents of a file. The primary use is as an aid to help dig through files that have been damaged (bad disks, transmission errors, etc.) If an error is found, a line that begins with the word "ERROR" is printed.
Dump3dmChunk(TextLog, Int32)
 Function for studying contents of a file. The primary use is as an aid to help dig through files that have been damaged (bad disks, transmission errors, etc.) If an error is found, a line that begins with the word "ERROR" is printed.
Top
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace