RhinoCommon API
BoundingBox.Union Method
Overload List
Name | Description
Union(BoundingBox)
 Updates this BoundingBox to represent the union of itself and another box.
Union(Point3d)
 Updates this BoundingBox to represent the union of itself and a point.
Union(BoundingBox, BoundingBox)
 Returns a new BoundingBox that represents the union of boxes a and b.
Union(BoundingBox, Point3d)
 Returns a new BoundingBox that represents the union of a bounding box and a point.
Top
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace