RhinoCommon API
ObjectTable.AddLinearDimension Method
Overload List
Name | Description
AddLinearDimension(LinearDimension)
 Adds a linear dimension object to the document.
AddLinearDimension(LinearDimension, ObjectAttributes)
 Adds a linear dimension object to the document.
AddLinearDimension(LinearDimension, ObjectAttributes, HistoryRecord, Boolean)
 Adds a linear dimension object to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace