RhinoCommon API
Curve.CreateTweenCurvesWithMatching Method
Overload List
Name | Description
CreateTweenCurvesWithMatching(Curve, Curve, Int32) |  Obsolete.
 Creates curves between two open or closed input curves. Make the structure of input curves compatible if needed. Refits the input curves to have the same structure. The resulting curves are usually more complex than input unless input curves are compatible and no refit is needed. There is no matching of curves direction. Caller must match input curves direction before calling the function.
CreateTweenCurvesWithMatching(Curve, Curve, Int32, Double)
 Creates curves between two open or closed input curves. Make the structure of input curves compatible if needed. Refits the input curves to have the same structure. The resulting curves are usually more complex than input unless input curves are compatible and no refit is needed. There is no matching of curves direction. Caller must match input curves direction before calling the function.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace