RhinoCommon API
NurbsCurve.CreateHSpline Method
Overload List
Name | Description
CreateHSpline(IEnumerable<Point3d>)
 Construct an H-spline from a sequence of interpolation points
CreateHSpline(IEnumerable<Point3d>, Vector3d, Vector3d)
 Construct an H-spline from a sequence of interpolation points and optional start and end derivative information
Top
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace