RhinoCommon API
Brep.CreateFilletSurface Method
Overload List
Name | Description
CreateFilletSurface(BrepFace, Point2d, BrepFace, Point2d, Brep.FilletSurfaceSettings, Brep.FilletSurfaceResults)
 Create a fillet (rational arcs or non-rational arc approxiation or chamfered surface
CreateFilletSurface(BrepFace, Point2d, BrepFace, Point2d, Double, Boolean, Double) |  Obsolete.
 Creates a constant-radius round surface between two surfaces.
CreateFilletSurface(BrepFace, Point2d, BrepFace, Point2d, Double, Boolean, Boolean, Double, Brep[], Brep[]) |  Obsolete.
 Creates a constant-radius round surface between two surfaces.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace