RhinoCommon API
OptionToggle Constructor
Overload List
Name | Description
OptionToggle(Boolean, LocalizeStringPair, LocalizeStringPair)
Initializes a new instance of the OptionToggle class
OptionToggle(Boolean, String, String)
Initializes a new instance of the OptionToggle class
Top
See Also
Reference
OptionToggle Class
Rhino.Input.Custom Namespace