RhinoCommon API
Intersection.MeshCurve Method
Overload List
Name | Description
MeshCurve(Mesh, Curve, Double)
 Intersects a curve and a mesh, returning certified hits sorted by curve parameter.
MeshCurve(Mesh, Curve, Double, Curve[])
 Simpler overload of MeshCurve(Mesh, Curve, Double): returns the Point-event hits (isolated crossings and the endpoints of every overlap span) as a flat Point3d array, and the overlap spans as sub-curves of curve via overlapCurves. Both arrays are ordered by curve parameter.
MeshCurve(Mesh, Curve, Double, Boolean)
 Same as MeshCurve(Mesh, Curve, Double) with a flag controlling the Overlap span events.
MeshCurve(Mesh, Curve, Double, Int32[], Curve[], Int32[])
 Simpler overload of MeshCurve(Mesh, Curve, Double) with mesh face indices. Mirrors MeshLine(Mesh, Line, Int32[]) and adds overlap output as sub-curves.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace