RhinoCommon API
RealtimeDisplayMode.GetRealtimeViewport Method
Overload List
Name | Description
GetRealtimeViewport(IntPtr)
 Retrieve RealtimeDisplayMode instance that the IntPtr refers to.
GetRealtimeViewport(IntPtr, Boolean)
Retrieve RealtimeDisplayMode instance. If create is set to true then a new instance is created if not found, null is returned for false.
Top
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace