RhinoCommon API
RhinoApp.SetFocusToMainWindow Method
Overload List
Name | Description
SetFocusToMainWindow()
 Sets the focus to the main window. This function attempts to use the ActiveDoc on Mac to figure out which window to set focus to.
SetFocusToMainWindow(RhinoDoc)
 Sets the focus to the main windows for a given document
Top
See Also
Reference
RhinoApp Class
Rhino Namespace