RhinoCommon API
DisplayModeDescription.UpdateDisplayMode Method
Overload List
Name | Description
UpdateDisplayMode(DisplayModeDescription)
 Updates an existing display mode and immediately saves it to disk. Call this after AddDisplayMode/CopyDisplayMode or changing DisplayAttributes to persist the change; otherwise an unrelated settings save elsewhere in Rhino can reload the display mode list from disk and silently discard the unsaved mode.
UpdateDisplayMode(DisplayModeDescription, Boolean)
 Updates an existing display mode.
Top
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace