RhinoCommon API
PlaneSurface Constructor
Overload List
Name | Description
PlaneSurface()
 Constructs a new plane surface.
PlaneSurface(Plane)
 Constructs a new plane surface.
PlaneSurface(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
PlaneSurface(Plane, Interval, Interval)
 Constructs a plane surface with x and y extents.
Top
See Also
Reference
PlaneSurface Class
Rhino.Geometry Namespace