RhinoCommon API
DisplayPipeline.Draw2dPolyline Method
Overload List
Name | Description
Draw2dPolyline(Point2f[], DisplayPen)
 Draws a polyline whose coordinates are viewport pixels rather than world units. The origin is the top left of the frame, with y increasing downwards - the same space Draw2dText and DrawBitmap work in.
Draw2dPolyline(Point2f[], DisplayPen, Boolean)
 Draws a polyline whose coordinates are viewport pixels rather than world units. The origin is the top left of the frame, with y increasing downwards - the same space Draw2dText and DrawBitmap work in.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace