RhinoCommon API
PageViewGroupTable.Modify Method
Overload List
Name | Description
Modify(PageViewGroup, Guid, Boolean)
 Modifies a page view group.
Modify(PageViewGroup, Int32, Boolean)
 Modifies a page view group.
Top
See Also
Reference
PageViewGroupTable Class
Rhino.DocObjects.Tables Namespace