RhinoCommon API
Brep.CreatePlanarBreps Method
Overload List
Name | Description
CreatePlanarBreps(Curve) |  Obsolete.
 Constructs a set of planar breps as outlines by the loops.
CreatePlanarBreps(CurveList) |  Obsolete.
 Constructs a set of planar Breps as outlines by the loops.
CreatePlanarBreps(IEnumerable<Curve>) |  Obsolete.
 Constructs a set of planar breps as outlines by the loops.
CreatePlanarBreps(Curve, Double)
 Constructs a set of planar breps as outlines by the loops.
CreatePlanarBreps(CurveList, Double)
 Constructs a set of planar Breps as outlines by the loops.
CreatePlanarBreps(IEnumerable<Curve>, Double)
 Constructs a set of planar breps as outlines by the loops.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace