RhinoCommon API
MeshTopologyEdgeList.GetConnectedFaces Method
Overload List
Name | Description
GetConnectedFaces(Int32)
 Gets indices of faces connected to an edge.
GetConnectedFaces(Int32, Boolean[])
 Gets indices of faces connected to an edge.
Top
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace