RhinoCommon API
Brep Constructor
Overload List
Name | Description
Brep()
Initializes a new empty brep
Brep(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace