RhinoCommon API
SubD.SetEdgeSharpness Method
Overload List
Name | Description
SetEdgeSharpness(IEnumerable<SubDEdge>, SubDEdgeSharpness, Boolean)
 Sets the sharpness of a list of edges.
SetEdgeSharpness(IEnumerable<SubDEdge>, IEnumerable<SubDEdgeSharpness>, Boolean)
 Sets the sharpness of a list of edges, one sharpness per edge.
 Use this with CreateEdgeChainSharpness(Interval, Int32) to give a chain of edges a sharpness that varies evenly along it.
SetEdgeSharpness(IEnumerable<Int32>, SubDEdgeSharpness, Boolean)
 Sets the sharpness of a list of edges, identified by their ids.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace