RhinoCommon API
RTree.Remove Method
Overload List
Name | Description
Remove(BoundingBox, Int32)
Removes an element from the tree.
Remove(BoundingBox, IntPtr)
Removes an element from the tree.
Remove(Point2d, Int32)
Removes an element from the tree.
Remove(Point3d, Int32)
Removes an element from the tree.
Remove(Point3d, IntPtr)
Removes an element from the tree.
Top
See Also
Reference
RTree Class
Rhino.Geometry Namespace