RhinoCommon API
RhinoGet.GetFileName Method
Overload List
Name | Description
GetFileName(GetFileNameMode, String, String, Object)
GetFileName(GetFileNameMode, String, String, Object, RhinoGet.BitmapFileTypes)
Top
See Also
Reference
RhinoGet Class
Rhino.Input Namespace