RhinoCommon API
Mesh.CreateFromSubD Method
Overload List
Name | Description
CreateFromSubD(SubD)
 Create a mesh from a SubD limit surface, using the default meshing density for SubDs.
CreateFromSubD(SubD, SubDDisplayParameters.Density)
 Create a mesh from a SubD limit surface
CreateFromSubD(SubD, Int32)
 Create a mesh from a SubD limit surface
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace