RhinoCommon API
Centermark Constructor
Overload List
Name | Description
Centermark()
 Constructs a new center mark dimension.
Centermark(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Centermark(Plane, Curve, Double)
 Constructs a new center mark dimension.
Centermark(Plane, Point3d, Double)
 Constructs a new center mark dimension.
Top
See Also
Reference
Centermark Class
Rhino.Geometry Namespace