RhinoCommon API
PersistentSettings.TryGetGuid Method
Overload List
Name | Description
TryGetGuid(String, Guid)
TryGetGuid(String, Guid, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace