RhinoCommon API
RenderContent.RenderHashExclude Method
Overload List
Name | Description
RenderHashExclude(CrcRenderHashFlags, String)
 As RenderHash, but allows you to specify flags and exclude specific parameters.
RenderHashExclude(TextureRenderHashFlags, String)
 This method is deprecated in favor of the one that takes CrcRenderHashFlags.
RenderHashExclude(CrcRenderHashFlags, String, LinearWorkflow)
 As RenderHash, but allows you to specify flags and exclude specific parameters. Use this version of the function to calculate a render hash when you have the linear workflow information and you are not running on the main thread. Access to LinearWorkflow data requires document access. CrcRenderHashFlags.ExcludeLinearWorkflow must be specified.
Top
See Also
Reference
RenderContent Class
Rhino.Render Namespace