RhinoCommon API
Brep.MergeCoplanarFaces Method
Overload List
Name | Description
MergeCoplanarFaces(Double)
 Merges adjacent coplanar faces into single faces.
MergeCoplanarFaces(Double, Double)
 Merges adjacent coplanar faces into single faces.
MergeCoplanarFaces(Int32, Double, Double)
 Merges coplanar faces adjacent to Brep face into a single face.
MergeCoplanarFaces(Int32, Int32, Double, Double)
 Merges two coplanar, adjacent Brep faces into a single face.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace