RhinoCommon API
Localization.LocalizeCommandName Method
Overload List
Name | Description
LocalizeCommandName(String)
 Commands that need to be localized should call this function.
LocalizeCommandName(String, Object)
Top
See Also
Reference
Localization Class
Rhino.UI Namespace