RhinoCommon API
DisplayPipeline.DrawPolyline Method
Overload List
Name | Description
DrawPolyline(IEnumerable<Point3d>, Color)
 Draws a single Polyline object.
DrawPolyline(IEnumerable<Point3d>, Color, Int32)
 Draws a single Polyline object.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace