RhinoCommon API
Mesh.CreateFromCone Method
Overload List
Name | Description
CreateFromCone(Cone, Int32, Int32)
Constructs a solid mesh cone.
CreateFromCone(Cone, Int32, Int32, Boolean)
Constructs a mesh cone.
CreateFromCone(Cone, Int32, Int32, Boolean, Boolean)
Constructs a mesh cone.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace