RhinoCommon API
Panels.ChangePanelIcon Method
Overload List
Name | Description
ChangePanelIcon(Type, Icon)
 Update the icon used for a panel tab.
ChangePanelIcon(Type, String)
 Update the icon used for a panel tab.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace