RhinoCommon API
Quaternion.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines whether an object is a quaternion and has the same value of this quaternion.
 (Overrides ValueType.Equals(Object).)
Equals(Quaternion)
 Determines whether this quaternion has the same value of another quaternion.
Top
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace