RhinoCommon API
RhinoObject.SetObjectFrame Method
Overload List
Name | Description
SetObjectFrame(Plane) |  Obsolete.
SetObjectFrame(Transform) |  Obsolete.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace