RhinoCommon API
PersistentSettings.GetString Method
Overload List
Name | Description
GetString(String)
GetString(String, String)
GetString(String, String, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace