RhinoCommon API
Extrusion.Create Method
Overload List
Name | Description
Create(Curve, Double, Boolean)
 Creates an extrusion of a 3d curve (which must be planar) and a height.
Create(Curve, Plane, Double, Boolean)
 Create an extrusion from a 3d curve, a plane and a height.
Top
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace