RhinoCommon API
ViewCaptureSettings.SetWindowRect Method
Overload List
Name | Description
SetWindowRect(Point2d, Point2d)
 Set the print area to a window selection based on two points in screen coordinates
SetWindowRect(Point3d, Point3d)
 Set the print area to a window selection based on two points in world coordinates
Top
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace