RhinoCommon API
Surface.GetNextDiscontinuity Method
Overload List
Name | Description
GetNextDiscontinuity(Int32, Continuity, Double, Double, Double)
 Searches for a derivative, tangent, or curvature discontinuity.
GetNextDiscontinuity(Int32, Continuity, Double, Double, Double, Double, Double)
 Searches for a derivative, tangent, or curvature discontinuity.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace