RhinoCommon API
NamedPositionTable.Save Method
Overload List
Name | Description
Save(String, IEnumerable<RhinoObject>)
Save a new Named Position.
Save(String, IEnumerable<Guid>)
Save a new Named Position.
Top
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace