RhinoCommon API
NamedViewTable.Add Method
Overload List
Name | Description
Add(ViewInfo)
Add(String, Guid)
 Adds named view to document which is based on an existing viewport.
Top
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace