RhinoCommon API
TextureEvaluator Constructor
Overload List
Name | Description
TextureEvaluator() |  Obsolete.
 Base class constructor
TextureEvaluator(RenderTexture.TextureEvaluatorFlags)
 Base class constructor
Top
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace