RhinoCommon API
ObjectTable.AddClippingPlane Method
Overload List
Name | Description
AddClippingPlane(Plane, Double, Double, IEnumerable<Guid>)
 Adds a clipping plane object to Rhino.
AddClippingPlane(Plane, Double, Double, Guid)
 Adds a clipping plane object to Rhino.
AddClippingPlane(Plane, Double, Double, IEnumerable<Guid>, ObjectAttributes)
 Adds a clipping plane object to Rhino.
AddClippingPlane(Plane, Double, Double, IEnumerable<Guid>, ObjectAttributes, HistoryRecord, Boolean)
AddClippingPlane(Plane, Double, Double, Guid, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace