RhinoCommon API
SubDEdge.GetSharpness Method
Overload List
Name | Description
GetSharpness()
 Gets the sharpness of this edge, reporting Crease for a crease edge.
GetSharpness(Boolean)
 Gets the sharpness of this edge.
Top
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace