RhinoCommon API
NurbsCurvePointList.GetPoint Method
Overload List
Name | Description
GetPoint(Int32, Point3d)
 Gets a world 3-D, or Euclidean, control point at the given index. The 4-D representation is (x, y, z, 1.0).
GetPoint(Int32, Point4d)
 Gets a homogeneous control point at the given index, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
Top
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace