RhinoCommon API
Intersection.BrepSurface Method
Overload List
Name | Description
BrepSurface(Brep, Surface, Double, Curve[], Point3d[])
 Intersects a Brep and a Surface.
BrepSurface(Brep, Surface, Double, Boolean, Curve[], Point3d[])
 Intersects a Brep and a Surface.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace