RhinoCommon API
LayerTable.ForceLayerVisible Method
Overload List
Name | Description
ForceLayerVisible(Guid)
 Makes a layer and all of its parent layers visible.
ForceLayerVisible(Int32)
 Makes a layer and all of its parent layers visible.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace