RhinoCommon API
Brep.CreateDevelopableLoft Method
Overload List
Name | Description
CreateDevelopableLoft(NurbsCurve, NurbsCurve, IEnumerable<Point2d>)
 Creates a single developable surface between two curves.
CreateDevelopableLoft(Curve, Curve, Boolean, Boolean, Int32)
 Creates a single developable surface between two curves.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace