RhinoCommon API
PolyCurve Constructor
Overload List
Name | Description
PolyCurve()
 Initializes a new, empty polycurve.
PolyCurve(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace