RhinoCommon API
RhinoApp.GetDataDirectory Method
Overload List
Name | Description
GetDataDirectory(Boolean, Boolean)
 Gets the data directory.
GetDataDirectory(Boolean, Boolean, String)
 Gets the data directory.
Top
See Also
Reference
RhinoApp Class
Rhino Namespace