RhinoCommon API
SubDEdgeChain Constructor
Overload List
Name | Description
SubDEdgeChain(SubD)
 Creates an empty chain in the given SubD.
SubDEdgeChain(SubD, SubDEdge)
 Creates a chain containing a single starting edge. Grow it with AddAllNeighbors(ChainDirection, SubDChainType) or AddOneNeighbor(ChainDirection, SubDChainType).
Top
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace