RhinoCommon API
Mesh.CreateFromBox Method
Overload List
Name | Description
CreateFromBox(BoundingBox, Int32, Int32, Int32)
 Constructs new mesh that matches a bounding box.
CreateFromBox(Box, Int32, Int32, Int32)
 Constructs new mesh that matches an aligned box.
CreateFromBox(IEnumerable<Point3d>, Int32, Int32, Int32)
 Constructs new mesh from 8 corner points.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace