RhinoCommon API
Point3dList Constructor
Overload List
Name | Description
Point3dList()
 Initializes a new empty list with default capacity.
Point3dList(IEnumerable<Point3d>)
 Initializes a new point list by copying the values from another set.
Point3dList(Int32)
 Initializes a new point list with a preallocated initial capacity.
Point3dList(Point3d[])
 Constructs a new point list from values in a point array.
Top
See Also
Reference
Point3dList Class
Rhino.Collections Namespace