RhinoCommon API
Brep.CutUpSurface Method
Overload List
Name | Description
CutUpSurface(Surface, IEnumerable<Curve>, Boolean, Double)
 Takes a surface and a set of all 3D curves that define a single trimmed surface, and splits the surface with the curves, keeping the piece that uses all of the curves.
CutUpSurface(Surface, IEnumerable<Curve>, Boolean, Double, Double)
 Splits, or cuts up, a surface. Designed to split the underlying surface of a Brep face with edge curves.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace