RhinoCommon API
DimStyleTable.Delete Method
Overload List
Name | Description
Delete(DimensionStyle)
 Removes an annotation style.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32, Boolean)
Top
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace