RhinoCommon API
RTree.SearchOverlaps Method
Overload List
Name | Description
SearchOverlaps(Double, EventHandler<RTreeEventArgs>, Object)
 Searches for pairs of bounding boxes that overlap.
SearchOverlaps(RTree, RTree, Double, EventHandler<RTreeEventArgs>)
 Searches two R-trees for all pairs elements whose bounding boxes overlap.
Top
See Also
Reference
RTree Class
Rhino.Geometry Namespace