RhinoCommon API
Curve.DivideByCount Method
Overload List
Name | Description
DivideByCount(Int32, Boolean)
 Divide the curve into a number of equal-length segments.
DivideByCount(Int32, Boolean, Point3d[])
 Divide the curve into a number of equal-length segments.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace