RhinoCommon API
FileCsvDocument.TryGetBool Method
Overload List
Name | Description
TryGetBool(Int32, Int32, Boolean)
 Retrieves the value of a cell as a boolean. Recognizes "true"/"false", "yes"/"no", and "1"/"0" (case-insensitive, surrounding whitespace ignored).
TryGetBool(String, Int32, Boolean)
 Retrieves the value of a cell as a boolean, addressing the column by header name.
Top
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace