RhinoCommon API
Curve.OffsetOnSurface Method
Overload List
Name | Description
OffsetOnSurface(BrepFace, Point2d, Double)
 Offset a curve on a brep face surface. This curve must lie on the surface.
This overload allows to specify a surface point at which the offset will pass.
OffsetOnSurface(BrepFace, Double, Double)
 Offset this curve on a brep face surface. This curve must lie on the surface.
OffsetOnSurface(Surface, Point2d, Double)
 Offset a curve on a surface. This curve must lie on the surface.
This overload allows to specify a surface point at which the offset will pass.
OffsetOnSurface(Surface, Double, Double)
 Offset a curve on a surface. This curve must lie on the surface.
OffsetOnSurface(BrepFace, Double[], Double[], Double)
 Offset a curve on a brep face surface. This curve must lie on the surface.
This overload allows to specify different offsets for different curve parameters.
OffsetOnSurface(Surface, Double[], Double[], Double)
 Offset this curve on a surface. This curve must lie on the surface.
This overload allows to specify different offsets for different curve parameters.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace