RhinoCommon API
NamedPositionTable.Update Method
Overload List
Name | Description
Update(Guid)
 Updates a Named Position, effectively storing the current positions of the objects which the Named Position is tracking.
Update(String)
 Updates a Named Position, effectively storing the current positions of the objects which the Named Position is tracking.
Top
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace