RhinoCommon API
RenderTexture.NewBitmapTexture Method
Overload List
Name | Description
NewBitmapTexture(SimulatedTexture) |  Obsolete.
 Constructs a new basic texture from a SimulatedTexture.
NewBitmapTexture(Bitmap, RhinoDoc)
 Constructs a new basic texture from a Bitmap.
NewBitmapTexture(SimulatedTexture, RhinoDoc)
 Constructs a new basic texture from a SimulatedTexture.
Top
See Also
Reference
RenderTexture Class
Rhino.Render Namespace