RhinoCommon API
RhinoAccountsInvalidStateException Constructor
Overload List
Name | Description
RhinoAccountsInvalidStateException(Exception)
 Generates a new instance of the exception.
RhinoAccountsInvalidStateException(String, Exception)
 Generates a new instance of the exception.
Top
See Also
Reference
RhinoAccountsInvalidStateException Class
Rhino.Runtime.RhinoAccounts Namespace