RhinoCommon API
Dialogs.ShowColorDialog Method
Overload List
Name | Description
ShowColorDialog(Color)
 Display Rhino's color selection dialog.
ShowColorDialog(Color4f, Boolean)
 Displays the standard modal color picker dialog for floating point colors.
ShowColorDialog(Color, Boolean, String)
 Display Rhino's color selection dialog.
ShowColorDialog(IWin32Window, Color4f, Boolean) |  Obsolete.
 Displays the standard modal color picker dialog for floating point colors.
ShowColorDialog(Object, Color4f, Boolean)
 Displays the standard modal color picker dialog for floating point colors.
ShowColorDialog(Color, Boolean, String, NamedColorList)
 Display Rhino's color selection dialog.
ShowColorDialog(Object, Color4f, Boolean, Dialogs.OnColorChangedEvent)
 Displays the standard modal color picker dialog for floating point colors.
ShowColorDialog(Object, Color4f, Boolean, NamedColorList, Dialogs.OnColorChangedEvent)
 Displays the standard modal color picker dialog for floating point colors.
Top
See Also
Reference
Dialogs Class
Rhino.UI Namespace