RhinoCommon API
Box.Inflate Method
Overload List
Name | Description
Inflate(Double)
 Inflates the box by a given offset in each direction. Inflating with negative amounts may result in decreasing boxes. InValid boxes cannot be inflated.
Inflate(Double, Double, Double)
 Inflates the box by a given offset in each direction. Inflating with negative amounts may result in decreasing boxes. InValid boxes cannot be inflated.
Top
See Also
Reference
Box Structure
Rhino.Geometry Namespace