RhinoCommon API
PlugIn.GetInstalledPlugIns Method
Overload List
Name | Description
GetInstalledPlugIns()
 Get a list of all registered plug-in's regardless of if they are loaded or not.
GetInstalledPlugIns(Boolean)
 Get a list of all registered plug-in's regardless of if they are loaded or not.
Top
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace