RhinoCommon API
DisplayPipeline.DrawPoint Method
Overload List
Name | Description
DrawPoint(Point3d)
 Draws a point using the current display attribute size, style and color
DrawPoint(Point3d, Color)
Draws a point with a given radius, style and color.
DrawPoint(Point3d, PointStyle, Int32, Color)
Draws a point with a given radius, style and color.
DrawPoint(Point3d, PointStyle, Single, Color)
Draws a point with a given radius, style and color.
DrawPoint(Point3d, PointStyle, Color, Color, Single, Single, Single, Single, Boolean, Boolean)
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace