RhinoCommon API
RhinoGet.GetRectangleWithCounts Method
Overload List
Name | Description
GetRectangleWithCounts(Int32, Int32, Int32, Int32, Point3d[])
 Gets a 3d rectangle with prompts for counts in X and Y directions.
GetRectangleWithCounts(Int32, Int32, Int32, Int32, Boolean, Point3d[])
 Gets a 3d rectangle with prompts for counts in X and Y directions, and a SubDCorners option.
Top
See Also
Reference
RhinoGet Class
Rhino.Input Namespace