RhinoCommon API
WorksessionFile.ToByteArray Method
Overload List
Name | Description
ToByteArray()
Writes the worksession as the contents of a version 5 .rws file.
ToByteArray(Int32)
Writes the worksession as the contents of a .rws file.
Top
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace