RhinoCommon API
SubDComponent.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines whether an object is a SubDComponent referring to the same component, with the same orientation, in the same SubD.
 (Overrides Object.Equals(Object).)
Equals(SubDComponent)
 Determines whether this component and another refer to the same component, with the same orientation, in the same SubD.
Top
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace