RhinoCommon API
RhinoPageView.SetActiveDetail Method
Overload List
Name | Description
SetActiveDetail(Guid)
 Sets the active detail.
SetActiveDetail(String, Boolean)
 Sets the active detail.
Top
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace