RhinoCommon API
TextFields.PageName Method
Overload List
Name | Description
PageName()
 Return the current layout page name
PageName(String)
 Return the page name for the specified View ID
Top
See Also
Reference
TextFields Class
Rhino.Runtime Namespace