RhinoCommon API
RhinoAccountsOperationInProgressException Constructor
Overload List
Name | Description
RhinoAccountsOperationInProgressException(Assembly, Exception)
 Generates a new instance of the exception.
RhinoAccountsOperationInProgressException(String, Exception)
 Generates a new instance of the exception.
Top
See Also
Reference
RhinoAccountsOperationInProgressException Class
Rhino.Runtime.RhinoAccounts Namespace