RhinoCommon API
TextFields.LayoutUserText Method
Overload List
Name | Description
LayoutUserText(String)
 Returns a value from the active layouts user text strings for the specified key.
LayoutUserText(String, String)
 Returns user text value from a layout id Key
Top
See Also
Reference
TextFields Class
Rhino.Runtime Namespace