RhinoCommon API
BoundingBox.IsDisjoint Method
Overload List
Name | Description
IsDisjoint(BoundingBox)
 Determines whether this bounding box and another bounding box are disjoint, that is, whether they do not intersect.
This is the same as calling IsDisjoint(box, 0.0).
IsDisjoint(BoundingBox, Double)
 Determines whether this bounding box and another bounding box are disjoint, that is, whether they do not intersect, allowing a tolerance for the comparison.
Top
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace