RhinoCommon API
HostUtils.CreateCommands Method
Overload List
Name | Description
CreateCommands(PlugIn)
 Parses a plugin and create all the commands defined therein.
CreateCommands(IntPtr, Assembly)
 Parses a plugin and create all the commands defined therein.
Top
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace