RhinoCommon API
CurveKinkDefinition Constructor
Overload List
Name | Description
CurveKinkDefinition()
 Construct a new instance with default values.
CurveKinkDefinition(Double, Double, Boolean, Boolean)
 Create a CurveKinkDefinition with specified settings.
Top
See Also
Reference
CurveKinkDefinition Class
Rhino.Geometry Namespace