RhinoCommon API
RhinoObject.TryGetRenderPrimitiveBoundingBox Method
Overload List
Name | Description
TryGetRenderPrimitiveBoundingBox(ViewportInfo, DisplayPipelineAttributes, BoundingBox) |  Obsolete.
 Get the bounding box for the custom render meshes associated with this object.
TryGetRenderPrimitiveBoundingBox(ViewportInfo, Boolean, BoundingBox) |  Obsolete.
 Get the bounding box for the custom render meshes associated with this object.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace