RhinoCommon API
LinetypeTable.Delete Method
Overload List
Name | Description
Delete(Linetype) |  (Overrides CommonComponentTable<T>.Delete(T).)
Delete(IEnumerable<Int32>, Boolean)
Deletes multiple linetypes.
Delete(Int32, Boolean)
Deletes linetype.
Top
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace