RhinoCommon API
IRhinoUiDialogService.ShowPropertyListBox Method
Overload List
Name | Description
ShowPropertyListBox(String, String, List<KeyValuePair<String, String>>)
ShowPropertyListBox(String, String, IList, IList<String>)
Top
See Also
Reference
IRhinoUiDialogService Interface
Rhino.UI Namespace