RhinoCommon API
Point3d.Subtraction Operator
Overload List
Name | Description
Subtraction(Point3d, Point3d)
 Subtracts a point from another point.
Subtraction(Point3d, Vector3d)
 Subtracts a vector from a point.
Top
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace