RhinoCommon API
Curve.CreatePeriodicCurve Method
Overload List
Name | Description
CreatePeriodicCurve(Curve)
 Removes kinks from a curve. Periodic curves deform smoothly without kinks.
CreatePeriodicCurve(Curve, Boolean)
 Removes kinks from a curve. Periodic curves deform smoothly without kinks.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace