RhinoCommon API
RhinoList<T>.Sort Method
Overload List
Name | Description
Sort()
 Sorts the elements in the entire List using the default comparer.
Sort(Comparison<T>)
 Sorts the elements in the entire list using the specified comparer.
Sort(Double[])
 Sort this list based on a list of numeric keys of equal length. The keys array will not be altered.
Sort(IComparer<T>)
 Sorts the elements in the entire list using the specified System.Comparison(T)
Sort(Int32[])
 Sort this list based on a list of numeric keys of equal length. The keys array will not be altered.
Sort(Int32, Int32, IComparer<T>)
 Sorts the elements in a range of elements in list using the specified comparer.
Top
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace