RhinoCommon API
MeshFaceNormalList.SetFaceNormal Method
Overload List
Name | Description
SetFaceNormal(Int32, Vector3d)
 Sets a face normal vector at an index using a single-precision vector.
SetFaceNormal(Int32, Vector3f)
 Sets a face normal vector at an index using a single-precision vector.
SetFaceNormal(Int32, Double, Double, Double)
 Sets a face normal vector at an index using three double-precision numbers.
SetFaceNormal(Int32, Single, Single, Single)
 Sets a face normal vector at an index using three single-precision numbers.
Top
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace