RhinoCommon API
Brep.CreateFromSweepSegmented Method
Overload List
Name | Description
CreateFromSweepSegmented(Curve, Curve, Boolean, Double)
 Sweep1 function that fits a surface through a profile curve that define the surface cross-sections and one curve that defines a surface edge. The Segmented version breaks the rail at curvature kinks and sweeps each piece separately, then put the results together into a Brep.
CreateFromSweepSegmented(Curve, IEnumerable<Curve>, Boolean, Double)
 Sweep1 function that fits a surface through a series of profile curves that define the surface cross-sections and one curve that defines a surface edge. The Segmented version breaks the rail at curvature kinks and sweeps each piece separately, then put the results together into a Brep.
CreateFromSweepSegmented(Curve, IEnumerable<Curve>, Point3d, Point3d, SweepFrame, Vector3d, Boolean, SweepBlend, SweepMiter, Double, SweepRebuild, Int32, Double)
 Sweep1 function that fits a surface through a series of profile curves that define the surface cross-sections and one curve that defines a surface edge. The Segmented version breaks the rail at curvature kinks and sweeps each piece separately, then put the results together into a Brep.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace