RhinoCommon API
CustomBrepObject Constructor
Overload List
Name | Description
CustomBrepObject()
Initializes a new instance of the CustomBrepObject class
CustomBrepObject(Brep)
Initializes a new instance of the CustomBrepObject class
Top
See Also
Reference
CustomBrepObject Class
Rhino.DocObjects.Custom Namespace