RhinoCommon API
NamedPositionTable.Delete Method
Overload List
Name | Description
Delete(Guid)
Delete a Named Position.
Delete(String)
Delete a Named Position.
Top
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace