RhinoCommon API
ObjectTable.Transform Method
Overload List
Name | Description
Transform(Guid, Transform, Boolean)
 Constructs a new object that is the transformation of the existing object and deletes the existing object if deleteOriginal is true.
Transform(ObjRef, Transform, Boolean)
 Constructs a new object that is the transformation of the existing object and deletes the existing object if deleteOriginal is true.
Transform(RhinoObject, Transform, Boolean)
 Constructs a new object that is the transformation of the existing object and deletes the existing object if deleteOriginal is true.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace