RhinoCommon API
InstanceDefinitionTable.ModifySourceArchive Method
Overload List
Name | Description
ModifySourceArchive(Int32, FileReference, InstanceDefinitionUpdateType, Boolean)
 If the instance definition is linked or embedded, use SetSource to specify the source archive.
ModifySourceArchive(Int32, FileReference, InstanceDefinitionUpdateType, InstanceDefinitionLayerStyle, Boolean)
 If the instance definition is linked or embedded, use SetSource to specify the source archive.
Top
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace