RhinoCommon API
MeshFaceNormalList.AddFaceNormal Method
Overload List
Name | Description
AddFaceNormal(Vector3d)
 Appends a face normal to the list of mesh face normals.
AddFaceNormal(Vector3f)
 Appends a face normal to the list of mesh face normals.
AddFaceNormal(Double, Double, Double)
 Appends a face normal to the list of mesh face normals.
AddFaceNormal(Single, Single, Single)
 Appends a face normal to the list of mesh face normals.
Top
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace