RhinoCommon API
BrepFaceList.SplitFacesAtTangents Method
Overload List
Name | Description
SplitFacesAtTangents()
 Splits all of the faces of a Brep at tangent locations. The face surfaces will be split at locations of curvature discontinuities with constant tangents.
SplitFacesAtTangents(Boolean)
 Splits all of the faces of a Brep at tangent locations.
Top
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace