RhinoCommon API
StringParserSettings.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the StringParserSettings
Dispose(Boolean)
Releases the unmanaged resources used by the StringParserSettings and optionally releases the managed resources
Top
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace