RhinoCommon API
PreviewSceneServer.Dispose Method
Overload List
Name | Description
Dispose()
 Dispose for PreviewSceneServer
Dispose(Boolean)
 Dispose for PreviewSceneServer
Top
See Also
Reference
PreviewSceneServer Class
Rhino.Render Namespace