RhinoCommon API
ObjectTable.AddRadialDimension Method
Overload List
Name | Description
AddRadialDimension(RadialDimension)
AddRadialDimension(RadialDimension, ObjectAttributes)
AddRadialDimension(RadialDimension, ObjectAttributes, HistoryRecord, Boolean)
 Adds a radial dimension object to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace