RhinoCommon API
NamedColorList Constructor
Overload List
Name | Description
NamedColorList(String)
 Initializes a new instance of the ColorList with the specified name.
NamedColorList(String, IEnumerable<NamedColor>)
 Initializes a new instance of the ColorList with the specified name and entries.
Top
See Also
Reference
NamedColorList Class
Rhino.UI Namespace