RhinoCommon API
Curve.IsEllipse Method
Overload List
Name | Description
IsEllipse()
 Test a curve to see if it can be represented by an ellipse within RhinoMath.ZeroTolerance.
IsEllipse(Double)
 Test a curve to see if it can be represented by an ellipse within a given tolerance.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace