RhinoCommon API
ClassArrayOnObjRef Constructor
Overload List
Name | Description
ClassArrayOnObjRef()
 Initializes a new ClassArrayOnObjRef instance.
ClassArrayOnObjRef(IEnumerable<ObjRef>)
 Initializes a new instances from a set of ObjRefs
Top
See Also
Reference
ClassArrayOnObjRef Class
Rhino.Runtime.InteropWrappers Namespace