RhinoCommon API
SimpleArrayPoint3d Constructor
Overload List
Name | Description
SimpleArrayPoint3d()
 Initializes a new empty SimpleArrayPoint3d instance.
SimpleArrayPoint3d(IEnumerable<Point3d>)
 Initializes a new SimpleArrayPoint3d instance from a set of points
Top
See Also
Reference
SimpleArrayPoint3d Class
Rhino.Runtime.InteropWrappers Namespace