RhinoCommon API
RenderContent.FromXml Method
Overload List
Name | Description
FromXml(String) |  Obsolete.
FromXml(String, RhinoDoc)
 Creates a new content from the XML data. The resulting content will not be attached to the document.
Top
See Also
Reference
RenderContent Class
Rhino.Render Namespace