RhinoCommon API
ObjectTable.SelectGrips Method
Overload List
Name | Description
SelectGrips(IEnumerable<GripObject>, Boolean)
 Selects or deselects a collection of grips in one pass, so a native CRhinoOnChangeObjectSelectState watcher sees one change rather than one per grip.
SelectGrips(IEnumerable<GripObject>, Boolean, Boolean, Boolean)
 Selects or deselects a collection of grips in one pass, so a native CRhinoOnChangeObjectSelectState watcher sees one change rather than one per grip.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace