RhinoCommon API
CurveList.Insert Method
Overload List
Name | Description
Insert(Int32, Arc)
 Inserts an arc at a given index of this list.
Insert(Int32, Circle)
 Inserts a line at a given index of this list.
Insert(Int32, Ellipse)
 Inserts an ellipse at a given index of this list.
Insert(Int32, Line)
 Inserts a line at a given index of this list.
Insert(Int32, IEnumerable<Point3d>)
 Inserts a polyline at a given index of this list.
Top
See Also
Reference
CurveList Class
Rhino.Collections Namespace