RhinoCommon API
Brep.CreateFromLoftRefit Method
Overload List
Name | Description
CreateFromLoftRefit(IEnumerable<Curve>, Point3d, Point3d, LoftType, Boolean, Double)
 Constructs one or more Breps by lofting through a set of curves. Input for the loft is simplified by refitting to a specified tolerance.
CreateFromLoftRefit(IEnumerable<Curve>, Point3d, Point3d, LoftType, Boolean, Double, Double)
 Constructs one or more Breps by lofting through a set of curves. Input for the loft is simplified by refitting to a specified tolerance.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace