RhinoCommon API
RenderMeshes Constructor
Overload List
Name | Description
RenderMeshes(RhinoDoc, Guid, Guid, UInt32) |  Obsolete.
 Create a new render primitives collection.
RenderMeshes(RhinoDoc, Guid, Guid, UInt32, UInt32)
 Create a new render primitives collection.
Top
See Also
Reference
RenderMeshes Class
Rhino.Render.CustomRenderMeshes Namespace