RhinoCommon API
RhinoApp.SetCommandPrompt Method
Overload List
Name | Description
SetCommandPrompt(String)
Set Rhino command prompt.
SetCommandPrompt(String, String)
Sets the command prompt in Rhino.
Top
See Also
Reference
RhinoApp Class
Rhino Namespace