RhinoCommon API
LightArray Constructor
Overload List
Name | Description
LightArray()
Initializes a new instance of the LightArray class
LightArray(IntPtr)
Initializes a new instance of the LightArray class
Top
See Also
Reference
LightArray Class
Rhino.Render Namespace