RhinoCommon API
DisplayBitmapDrawList.SetPoints Method
Overload List
Name | Description
SetPoints(IEnumerable<Point3d>)
SetPoints(IEnumerable<Point3d>, IEnumerable<Color>)
SetPoints(IEnumerable<Point3d>, Color)
Top
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace