RhinoCommon API
Plane.PointAt Method
Overload List
Name | Description
PointAt(Double, Double)
 Evaluate a point on the plane.
PointAt(Double, Double, Double)
 Evaluate a point on the plane.
Top
See Also
Reference
Plane Structure
Rhino.Geometry Namespace