RhinoCommon API
SceneServerData Constructor
Overload List
Name | Description
SceneServerData(PreviewAppearance, SceneServerDataUsage)
Initializes a new instance of the SceneServerData class
SceneServerData(PreviewGeometry, PreviewBackground, PreviewLighting, SceneServerDataUsage) |  Obsolete.
 Constructor for SceneServerData
Top
See Also
Reference
SceneServerData Class
Rhino.Render Namespace