RhinoCommon API
StringWrapper Constructor
Overload List
Name | Description
StringWrapper()
 Initializes a new empty unmanaged string (ON_wString*).
StringWrapper(String)
 Initializes a new unmanaged string with an initial value. The string s can be null.
Top
See Also
Reference
StringWrapper Class
Rhino.Runtime.InteropWrappers Namespace