RhinoCommon API
DrawingUtilities.IconFromResource Method
Overload List
Name | Description
IconFromResource(String, Assembly)
 Load a Icon from an embedded resource.
IconFromResource(String, Size, Assembly)
 Load a Icon from an embedded resource.
Top
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace