RhinoCommon API
CustomRenderMeshProvider2.BuildCustomMeshes Method
Overload List
Name | Description
BuildCustomMeshes(ViewportInfo, RenderPrimitiveList, Guid, Boolean) |  (Overrides CustomRenderMeshProvider.BuildCustomMeshes(ViewportInfo, RenderPrimitiveList, Guid, Boolean).)
BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, DisplayPipelineAttributes)
Top
See Also
Reference
CustomRenderMeshProvider2 Class
Rhino.Render Namespace