RhinoCommon API
Vector2f.Add Method
Overload List
Name | Description
Add(Point2f, Vector2f)
 Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Add(Vector2f, Vector2f)
 Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Top
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace