RhinoCommon API
SubDToBrepOptions Constructor
Overload List
Name | Description
SubDToBrepOptions()
 Create default options
SubDToBrepOptions(Boolean, SubDToBrepOptions.ExtraordinaryVertexProcessOption)
 Create options from the given packFaces and vertexProcess values.
Top
See Also
Reference
SubDToBrepOptions Class
Rhino.Geometry Namespace