RhinoCommon API
RenderContent.RegisterContent Method
Overload List
Name | Description
RegisterContent(PlugIn)
 Call RegisterContent in your plug-in's OnLoad function in order to register all of the custom RenderContent classes in your assembly.
RegisterContent(Assembly, Guid)
 Call RegisterContent in your plug-in's OnLoad function in order to register all of the custom RenderContent classes in your assembly.
Top
See Also
Reference
RenderContent Class
Rhino.Render Namespace