RhinoCommon API
Brep.CreateThickPipe Method
Overload List
Name | Description
CreateThickPipe(Curve, Double, Double, Boolean, PipeCapMode, Boolean, Double, Double)
 Creates a double-walled pipe.
CreateThickPipe(Curve, IEnumerable<Double>, IEnumerable<Double>, IEnumerable<Double>, Boolean, PipeCapMode, Boolean, Double, Double)
 Creates a double-walled pipe.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace