RhinoCommon API
SweepOneRail.PerformSweep Method
Overload List
Name | Description
PerformSweep(Curve, Curve)
PerformSweep(Curve, IEnumerable<Curve>)
PerformSweep(Curve, Curve, Double)
PerformSweep(Curve, IEnumerable<Curve>, IEnumerable<Double>)
Top
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace