RhinoCommon API
RhinoObject.GetTightBoundingBox Method
Overload List
Name | Description
GetTightBoundingBox(IEnumerable<RhinoObject>, BoundingBox)
 Gets a world XY-plane aligned tight bounding box from a collection of Rhino objects.
GetTightBoundingBox(BoundingBox, Boolean, Transform)
 Get tight bounding box of this Rhino object. The Rhino object is not modified.
GetTightBoundingBox(IEnumerable<RhinoObject>, Plane, BoundingBox)
 Gets a plane aligned tight bounding box from a collection of Rhino objects.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace