RhinoCommon API
Color4f Constructor
Overload List
Name | Description
Color4f(Color)
Initializes a new instance of the Color4f class
Color4f(Color4f)
Initializes a new instance of the Color4f class
Color4f(Int32)
Initializes a new instance of the Color4f class
Color4f(Single, Single, Single, Single)
Initializes a new instance of the Color4f class
Top
See Also
Reference
Color4f Structure
Rhino.Display Namespace