RhinoCommon API
RhinoViewport.GetDepth Method
Overload List
Name | Description
GetDepth(Point3d, Double)
Gets clipping distance of a point.
GetDepth(BoundingBox, Double, Double)
 Gets near and far clipping distances of a bounding box.
GetDepth(Sphere, Double, Double)
 Gets near and far clipping distances of a sphere.
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace