RhinoCommon API
Curve.Smooth Method
Overload List
Name | Description
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem)
 Smooths a curve by averaging the positions of control points in a specified region.
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths a curve by averaging the positions of control points in a specified region.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace