RhinoCommon API
DisplayPipeline.DrawBox Method
Overload List
Name | Description
DrawBox(BoundingBox, Color)
 Draws the edges of a BoundingBox.
DrawBox(Box, Color)
 Draws the edges of a Box object.
DrawBox(BoundingBox, Color, Int32)
 Draws the edges of a BoundingBox.
DrawBox(Box, Color, Int32)
 Draws the edges of a Box object.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace