RhinoCommon API
Curve.Offset Method
Overload List
Name | Description
Offset(Plane, Double, Double, CurveOffsetCornerStyle)
 Offsets this curve. If you have a nice offset, then there will be one entry in the array. If the original curve had kinks or the offset curve had self intersections, you will get multiple segments in the output array.
Offset(Point3d, Vector3d, Double, Double, CurveOffsetCornerStyle)
 Offsets this curve. If you have a nice offset, then there will be one entry in the array. If the original curve had kinks or the offset curve had self intersections, you will get multiple segments in the output array.
Offset(Point3d, Vector3d, Double, Double, Double, Boolean, CurveOffsetCornerStyle, CurveOffsetEndStyle)
 Offsets this curve. If you have a nice offset, then there will be one entry in the array. If the original curve had kinks or the offset curve had self intersections, you will get multiple segments in the output array.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace