RhinoCommon API
PostEffectExecutionControl.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the PostEffectExecutionControl
Dispose(Boolean)
Releases the unmanaged resources used by the PostEffectExecutionControl and optionally releases the managed resources
Top
See Also
Reference
PostEffectExecutionControl Class
Rhino.Render.PostEffects Namespace