RhinoCommon API
Material.SetEnvironmentTexture Method
Overload List
Name | Description
SetEnvironmentTexture(String)
SetEnvironmentTexture(Texture)
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace