RhinoCommon API
Polyline Constructor
Overload List
Name | Description
Polyline()
 Initializes a new empty polyline.
Polyline(IEnumerable<Point3d>)
 Initializes a new polyline from a collection of points.
Polyline(Int32)
 Initializes a new empty polyline with an initial capacity.
Top
See Also
Reference
Polyline Class
Rhino.Geometry Namespace