RhinoCommon API
SimpleArrayLine Constructor
Overload List
Name | Description
SimpleArrayLine()
 Initializes a new SimpleArrayLine instance.
SimpleArrayLine(IEnumerable<Line>)
 Initializes a new SimpleArrayLine instance from a set of lines
Top
See Also
Reference
SimpleArrayLine Class
Rhino.Runtime.InteropWrappers Namespace