RhinoCommon API
MeshingParameters Constructor
Overload List
Name | Description
MeshingParameters()
 Initializes a new instance with default values.
Initial values are same as Default.
MeshingParameters(Double)
 Initializes a new instance with simple values, similar to that of Rhino's meshing slider interface.
MeshingParameters(MeshingParameters)
 Initializes a new instance copying values from source.
Initial values are same as Default.
MeshingParameters(Double, Double)
 Initializes a new instance with simple values, similar to that of Rhino's meshing slider interface.
MeshingParameters(SerializationInfo, StreamingContext)
 Called by BinaryFormatter.Deserialize to create a new MeshParamaters object.
Top
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace