RhinoCommon API
NameHash Constructor
Overload List
Name | Description
NameHash(NameHash)
 Constructs a copy of a content hash.
NameHash(String)
 Creates a new NameHash, representing a piece of text.
NameHash(String, Guid)
 Creates a new NameHash, representing a piece of text.
NameHash(String, Guid, ModelComponentType)
 Creates a new NameHash, representing a piece of text.
NameHash(String, Guid, Boolean)
 Creates a new NameHash, representing a piece of text.
Top
See Also
Reference
NameHash Class
Rhino.FileIO Namespace