RhinoCommon API
CurveKinkDefinition.IsCurvatureKink Method
Overload List
Name | Description
IsCurvatureKink(Curve, Double)
 True if there is a curvature discontinuity at curve(t) that passes the curvature kink test.
IsCurvatureKink(Vector3d, Vector3d)
 True if the angle between curvature_from_below and curvature_from_above is > KinkAngleDegrees or the ratio min/max < CurvatureKinkRadiusRatio, where min and max are the minimum and maximum lengths of curvatureFromBelow and v. Both of these tests are scale independent. If an input curvature vector has length <= CurvatureKinkZeroTolerance, then that curvature is treated as zero. When is CurvatureKinkZeroTolerance > 0, the test is scale dependent. The default value is chosen to work reasonably well for most models at most scales.
Top
See Also
Reference
CurveKinkDefinition Class
Rhino.Geometry Namespace