RhinoCommon API
ObjectTable.AddOrderedPointCloud Method
Overload List
Name | Description
AddOrderedPointCloud(Int32, Int32, Int32, Point3d[], ObjectAttributes, HistoryRecord, Boolean)
Adds a point cloud object to the document.
AddOrderedPointCloud(Int32, Int32, Int32, Point3d, Point3d, ObjectAttributes, HistoryRecord, Boolean)
Adds a point cloud object to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace