RhinoCommon API
Mesh.SplitNon2Manifolds Method
Overload List
Name | Description
SplitNon2Manifolds()
 Split a mesh where at non-2 manifolds boundaries.
SplitNon2Manifolds(TextLog, CancellationToken, IProgress<Double>)
 Split a mesh where at non-2 manifolds boundaries.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace