RhinoCommon API
Intersection.BrepPlane Method
Overload List
Name | Description
BrepPlane(Brep, Plane, Double, Curve[], Point3d[])
 Intersects a Brep with an (infinite) plane.
BrepPlane(Brep, Plane, Double, Boolean, Curve[], Point3d[])
 Intersects a Brep with an (infinite) plane.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace