RhinoCommon API
Curve.IsClosable Method
Overload List
Name | Description
IsClosable(Double)
 Decide if it makes sense to close off this curve by moving the endpoint to the start based on start-end gap size and length of curve as approximated by chord defined by 6 points.
IsClosable(Double, Double, Double)
 Decide if it makes sense to close off this curve by moving the endpoint to the start based on start-end gap size and length of curve as approximated by chord defined by 6 points.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace