RhinoCommon API
Vector2d.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines whether the specified System.Object is a Vector2d and has the same value as the present vector.
 (Overrides ValueType.Equals(Object).)
Equals(Vector2d)
 Determines whether the specified vector has the same value as the present vector.
Top
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace