RhinoCommon API
DisplayPipelineAttributes.SetFill Method
Overload List
Name | Description
SetFill(Color)
 Set fill mode to solid color and set the fill color
SetFill(Color, Color)
 Set fill mode to two color and set the colors
SetFill(Color, Color, Color, Color)
 Set the fill mode to four color gradient and set the colors
Top
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace