RhinoCommon API
NamedViewTable.Delete Method
Overload List
Name | Description
Delete(Int32)
Remove named view from the document.
Delete(String)
Remove named view from the document.
Top
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace