RhinoCommon API
Matrix.RowReduce Method
Overload List
Name | Description
RowReduce(Double, Point3d[], Double)
 Row reduces a matrix as the first step in solving M*X=b where b is a column of 3d points.
RowReduce(Double, Double, Double)
Row reduces a matrix to calculate rank and determinant.
RowReduce(Double, Double[], Double)
 Row reduces a matrix as the first step in solving M*X=b where b is a column of values.
Top
See Also
Reference
Matrix Class
Rhino.Geometry Namespace