RhinoCommon API
Curve.IsInPlane Method
Overload List
Name | Description
IsInPlane(Plane)
Test a curve to see if it lies in a specific plane.
IsInPlane(Plane, Double)
Test a curve to see if it lies in a specific plane.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace