RhinoCommon API
MeshTextureCoordinateList.Add Method
Overload List
Name | Description
Add(Point2f)
 Adds a new texture coordinate to the end of the Texture list.
Add(Point3d)
 Adds a new texture coordinate to the end of the Texture list.
Add(Double, Double)
 Adds a new texture coordinate to the end of the Texture list.
Add(Single, Single)
 Adds a new texture coordinate to the end of the Texture list.
Top
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace