RhinoCommon API
ObjectPropertiesPageEventArgs.IncludesObjectsType Method
Overload List
Name | Description
IncludesObjectsType<T>()
 Return true if any of the selected objects match the given type
IncludesObjectsType<T>(Boolean)
 Return true if any of the selected objects match the given type
IncludesObjectsType(ObjectType)
IncludesObjectsType(ObjectType, Boolean)
Top
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace