RhinoCommon API
ObjectTable.AddMesh Method
Overload List
Name | Description
AddMesh(Mesh)
Adds a mesh object to Rhino.
AddMesh(Mesh, ObjectAttributes)
Adds a mesh object to Rhino.
AddMesh(Mesh, ObjectAttributes, HistoryRecord, Boolean)
AddMesh(Mesh, ObjectAttributes, HistoryRecord, Boolean, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace