RhinoCommon API
CustomObjectGrips.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the CustomObjectGrips
Dispose(Boolean)
Releases the unmanaged resources used by the CustomObjectGrips and optionally releases the managed resources
Top
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace