RhinoCommon API
ObjectTable.AddHatch Method
Overload List
Name | Description
AddHatch(Hatch)
AddHatch(Hatch, ObjectAttributes)
AddHatch(Hatch, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace