RhinoCommon API
VariationalPatchSettings Constructor
Overload List
Name | Description
Brep.VariationalPatchSettings()
 Constructor with defaults
Brep.VariationalPatchSettings(RhinoDoc)
 Constructor that sets defaults and takes the tolerance, internal tolerance and angle tolerance from the document
Top
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace