RhinoCommon API
RenderWindow.SaveRenderImageAs Method
Overload List
Name | Description
SaveRenderImageAs(String, Boolean)
 Like RenderWindow.SaveRenderImageAs(string,Guid,bool), but with Guid set to Guid.Empty.
SaveRenderImageAs(String, Guid, Boolean)
 Save current RenderWindow contents as an image file with the given name. The filetype will be determine. Pass in render engine Guid if an engine implements saving to a format that is not supported by Rhino. Guid.Empty if there is no need for that.
Top
See Also
Reference
RenderWindow Class
Rhino.Render Namespace