RhinoCommon API
Mesh.Split Method
Overload List
Name | Description
Split(IEnumerable<Mesh>)
 Split a mesh with a collection of meshes. Suggestion: upgrade to overload with tolerance. Does not split at coplanar intersections.
Split(Mesh)
 Split a mesh with another mesh. Suggestion: upgrade to overload with tolerance.
Split(Plane)
 Split a mesh by an infinite plane.
Split(IEnumerable<Mesh>, MeshSplitOptions)
 Split a mesh with a collection of meshes.
Split(IEnumerable<Mesh>, Double, Boolean, TextLog, CancellationToken, IProgress<Double>)
 Split a mesh with a collection of meshes.
Split(IEnumerable<Mesh>, Double, Boolean, Boolean, TextLog, CancellationToken, IProgress<Double>)
 Split a mesh with a collection of meshes.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace