RhinoCommon API
ObjectTable.AddAngularDimension Method
Overload List
Name | Description
AddAngularDimension(AngularDimension)
 Adds a angular dimension object to the document.
AddAngularDimension(AngularDimension, ObjectAttributes)
 Adds a angular dimension object to the document.
AddAngularDimension(AngularDimension, ObjectAttributes, HistoryRecord, Boolean)
 Adds an angular dimension object to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace