RhinoCommon API
DisplayPipeline.DrawExtrusionWires Method
Overload List
Name | Description
DrawExtrusionWires(Extrusion, Color)
 Draws all the wireframe curves of an extrusion object.
DrawExtrusionWires(Extrusion, Color, Int32)
 Draws all the wireframe curves of an extrusion object.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace