RhinoCommon API
FieldDictionary.Add Method
Overload List
Name | Description
Add(String, Color4f)
 Add a new Color4fField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Point2d)
 Add a new Point2dField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Point3d)
 Add a new Point3dField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Point4d)
 Add a new Point4dField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Transform)
 Add a new TransformField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Vector2d)
 Add a new Vector2dField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Vector3d)
 Add a new Vector3dField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Boolean)
 Add a new BoolField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Byte[])
 AddField a new ByteArrayField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, DateTime)
 Add a new DateTimeField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Double)
 AddField a new DoubleField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Color)
 Add a new Color4fField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Guid)
 Add a new GuidField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Int32)
 Add a new IntField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Single)
 Add a new FloatField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, String)
 Add a new StringField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Color4f, String)
 Add a new Color4fField to the dictionary.
Add(String, Point2d, String)
 Add a new Point2dField to the dictionary.
Add(String, Point3d, String)
 Add a new Point3dField to the dictionary.
Add(String, Point4d, String)
 Add a new Point4dField to the dictionary.
Add(String, Transform, String)
 Add a new TransformField to the dictionary.
Add(String, Vector2d, String)
 Add a new Vector2dField to the dictionary.
Add(String, Vector3d, String)
 Add a new Vector3dField to the dictionary.
Add(String, Boolean, String)
 Add a new BoolField to the dictionary.
Add(String, DateTime, String)
 Add a new DateTimeField to the dictionary.
Add(String, Double, String)
 Add a new DoubleField to the dictionary.
Add(String, Color, String)
 Add a new Color4fField to the dictionary.
Add(String, Guid, String)
 Add a new GuidField to the dictionary.
Add(String, Int32, String)
 Add a new IntField to the dictionary.
Add(String, Single, String)
 AddField a new FloatField to the dictionary.
Add(String, String, Int32)
 Add a new NullField to the dictionary.
Add(String, String, String)
 Add a new StringField to the dictionary.
Add(String, Color4f, String, Int32)
 Add a new Color4fField to the dictionary.
Add(String, Point2d, String, Int32)
 Add a new Point2dField to the dictionary.
Add(String, Point3d, String, Int32)
 Add a new Point3dField to the dictionary.
Add(String, Point4d, String, Int32)
 Add a new Point4dField to the dictionary.
Add(String, Transform, String, Int32)
 Add a new TransformField to the dictionary.
Add(String, Vector2d, String, Int32)
 Add a new Vector2dField to the dictionary.
Add(String, Vector3d, String, Int32)
 Add a new Vector3dField to the dictionary.
Add(String, Boolean, String, Int32)
 Add a new BoolField to the dictionary.
Add(String, DateTime, String, Int32)
 Add a new DateTimeField to the dictionary.
Add(String, Double, String, Int32)
 Add a new DoubleField to the dictionary.
Add(String, Guid, String, Int32)
 Add a new GuidField to the dictionary.
Add(String, Int32, String, Int32)
 Add a new IntField to the dictionary.
Add(String, Single, String, Int32)
 AddField a new FloatField to the dictionary.
Add(String, String, String, Int32)
 Add a new StringField to the dictionary.
Top
See Also
Reference
FieldDictionary Class
Rhino.Render.Fields Namespace