RhinoCommon API
RhinoList<T> Constructor
Overload List
Name | Description
RhinoList<T>()
 Initializes a new, empty list.
RhinoList<T>(IEnumerable<T>)
 Initializes this list as a shallow duplicate of another list, array or any other enumerable set of T.
RhinoList<T>(Int32)
 Initializes an empty list with a certain capacity.
RhinoList<T>(RhinoList<T>)
 Initializes an new list by shallow duplicating another list.
RhinoList<T>(Int32, T)
 Initializes a new list with a specified amount of values.
Top
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace