RhinoCommon API
Curve.CreateBooleanRegions Method
Overload List
Name | Description
CreateBooleanRegions(IEnumerable<Curve>, Plane, Boolean, Double)
 Calculates curve Boolean regions, which trims and splits curves based on their overlapping regions.
CreateBooleanRegions(IEnumerable<Curve>, Plane, IEnumerable<Point3d>, Boolean, Double)
 Curve Boolean method, which trims and splits curves based on their overlapping regions.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace