RhinoCommon API
StdVectorGuid Constructor
Overload List
Name | Description
StdVectorGuid()
 Initializes a new StdVectorGuid class.
StdVectorGuid(IEnumerable<Guid>)
 Initializes a new StdVectorGuid class
Top
See Also
Reference
StdVectorGuid Class
Rhino.Runtime.InteropWrappers Namespace