RhinoCommon API
GeometryBase.GetBoundingBox Method
Overload List
Name | Description
GetBoundingBox(Boolean)
 Bounding box solver. Gets the world axis aligned bounding box for the geometry.
GetBoundingBox(Plane)
 Aligned Bounding box solver. Gets the plane aligned bounding box.
GetBoundingBox(Transform)
 Aligned Bounding box solver. Gets the world axis aligned bounding box for the transformed geometry.
GetBoundingBox(Plane, Box)
 Aligned Bounding box solver. Gets the plane aligned bounding box.
Top
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace