RhinoCommon API
Surface Constructor
Overload List
Name | Description
Surface()
 Protected constructor for internal use.
Surface(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace