RhinoCommon API
Intersection.GeometryPlane Method
Overload List
Name | Description
GeometryPlane(GeometryBase, Plane, Double, Boolean, RhinoDoc, Curve[], Point3d[])
 Intersects geometry with an (infinite) plane.
GeometryPlane(GeometryBase, Plane, Double, Boolean, Boolean, Boolean, RhinoDoc, Transform, PlaneIntersectionCache, CancellationToken, Curve[], Point3d[])
 Intersects geometry with an (infinite) plane.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace