RhinoCommon API
RenderWindow.SetRGBAChannelColors Method
Overload List
Name | Description
SetRGBAChannelColors(Rectangle, Color4f[])
 Call this method to open the RenderWindow.StandardChannels.RGBA channel and set a block of color values
SetRGBAChannelColors(Size, Color4f[])
 Call this method to open the RenderWindow.StandardChannels.RGBA channel and set a block of color values
Top
See Also
Reference
RenderWindow Class
Rhino.Render Namespace