RhinoCommon API
Box.ClosestPoint Method
Overload List
Name | Description
ClosestPoint(Point3d)
 Finds the closest point on or in the Box. The box should be Valid for this to work.
ClosestPoint(Point3d, Boolean)
 Finds the closest point on or in the Box. The box should be Valid for this to work.
Top
See Also
Reference
Box Structure
Rhino.Geometry Namespace