RhinoCommon API
RenderTexture.SetEnvironmentMappingMode Method
Overload List
Name | Description
SetEnvironmentMappingMode(TextureEnvironmentMappingMode)
SetEnvironmentMappingMode(TextureEnvironmentMappingMode, RenderContent.ChangeContexts)
Top
See Also
Reference
RenderTexture Class
Rhino.Render Namespace