RhinoCommon API
Point3d.Subtract Method
Overload List
Name | Description
Subtract(Point3d, Point3d)
 Subtracts a point from another point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
Subtract(Point3d, Vector3d)
 Subtracts a vector from a point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
Top
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace