RhinoCommon API
InstanceObject.Explode Method
Overload List
Name | Description
Explode(Boolean, RhinoObject[], ObjectAttributes[], Transform[])
 Explodes the instance reference into pieces.
Explode(Boolean, Guid, Boolean, RhinoObject[], ObjectAttributes[], Transform[])
 Explodes the instance reference into pieces.
Top
See Also
Reference
InstanceObject Class
Rhino.DocObjects Namespace