RhinoCommon API
Mesh.RebuildMesh Method
Overload List
Name | Description
RebuildMesh(Mesh)
 Use this function to rebuild meshes that are not acting properly. Vertices and faces are kept. Face normals and vertex normals are recalculated. Texture coordinates, vertex colors, surface curvatures, and surfaces parameters are not replaced.
RebuildMesh(Mesh, Boolean, Boolean)
 Use this function to rebuild meshes that are not acting properly. Vertices and faces are kept. Face normals and vertex normals are recalculated. Surface curvatures, and surfaces parameters are not replaced.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace