RhinoCommon API
Brep.Split Method
Overload List
Name | Description
Split(Brep, Double)
 Splits a Brep into pieces using a Brep as a cutter.
Split(IEnumerable<Brep>, Double)
 Splits a Brep into pieces using Breps as cutters.
Split(IEnumerable<Curve>, Double)
 Splits a Brep into pieces using curves, at least partially on the Brep, as cutters.
Split(Brep, Double, Boolean)
 Splits a Brep into pieces using a Brep as a cutter.
Split(IEnumerable<GeometryBase>, Vector3d, Boolean, Double)
 Splits a Brep into pieces using a combination of curves, to be extruded, and Breps as cutters.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace