RhinoCommon API
File3dmInstanceDefinitionTable.Add Method
Overload List
Name | Description
Add(String, String, Point3d, IEnumerable<GeometryBase>)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, GeometryBase, ObjectAttributes)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Adds an instance definition to the instance definition table.
Add(String, String, String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Adds an instance definition to the instance definition table.
Top
See Also
Reference
File3dmInstanceDefinitionTable Class
Rhino.FileIO Namespace