RhinoCommon API
SubDEdgeSharpness.Sanitize Method
Overload List
Name | Description
Sanitize(Double)
 Verifies that sharpness is between 0.0 and MaximumValue, and snaps it to an integer when it is within Tolerance of one.
Sanitize(Double, Double)
 Verifies that sharpness is between 0.0 and MaximumValue, and snaps it to an integer when it is within Tolerance of one.
Top
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace