RhinoCommon API
RhinoViewport.Magnify Method
Overload List
Name | Description
Magnify(Double, Boolean)
 Zooms or dollies in order to scale the viewport projection of observed objects.
Magnify(Double, Boolean, Point)
 Zooms or dollies in order to scale the viewport projection of observed objects.
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace