RhinoCommon API
RhinoCore Constructor
Overload List
Name | Description
RhinoCore()
 Initializes a new instance of the RhinoCore class.
RhinoCore(String[])
 Initializes a new instance of the RhinoCore class.
RhinoCore(String[], WindowStyle)
 Initializes a new instance of the RhinoCore class.
RhinoCore(String[], WindowStyle, IntPtr)
 Initializes a new instance of the RhinoCore class.
Top
See Also
Reference
RhinoCore Class
Rhino.Runtime.InProcess Namespace