RhinoCommon API
Surface.CreatePeriodicSurface Method
Overload List
Name | Description
CreatePeriodicSurface(Surface, Int32)
 Constructs a periodic surface from a base surface and a direction.
CreatePeriodicSurface(Surface, Int32, Boolean)
 Constructs a periodic surface from a base surface and a direction.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace