RhinoCommon API
PersistentSettings.TryGetString Method
Overload List
Name | Description
TryGetString(String, String)
TryGetString(String, String, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace