RhinoCommon API
TextFields.DimValue Method
Overload List
Name | Description
DimValue(String)
 Returns the measured value of a dimension formatted with the dimension's own annotation style.
DimValue(String, String)
 Returns the measured value of a dimension formatted with the named annotation style.
Top
See Also
Reference
TextFields Class
Rhino.Runtime Namespace