RhinoCommon API
CustomRenderMeshProvider.AllObjectsChanged Method
Overload List
Name | Description
AllObjectsChanged() |  Obsolete.
 Call this method if your render meshes change.
AllObjectsChanged(RhinoDoc)
 Call this method if your render meshes change.
Top
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace