RhinoCommon API
File3dmObjectTable.AddLeader Method
Overload List
Name | Description
AddLeader(IEnumerable<Point3d>)
 Adds an annotation leader to the document. This overload is only provided in the Rhino SDK.
AddLeader(Plane, IEnumerable<Point2d>)
 Adds an annotation leader to the document.
AddLeader(String, IEnumerable<Point3d>)
 Adds an annotation leader to the document. This overload is only provided in the Rhino SDK.
AddLeader(Plane, IEnumerable<Point2d>, ObjectAttributes)
 Adds an annotation leader to the document.
AddLeader(String, Plane, IEnumerable<Point2d>)
 Adds an annotation leader to the document.
AddLeader(String, Plane, IEnumerable<Point2d>, ObjectAttributes)
 Adds an annotation leader to the document.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace