RhinoCommon API
RhinoDoc.PurgeObjectHistory Method
Overload List
Name | Description
PurgeObjectHistory()
 Purges the history records of every object in this document.
PurgeObjectHistory(IEnumerable<RhinoObject>)
 Purges the history records of a list of objects.
PurgeObjectHistory(Int32)
 Purges the history records of every object in this document.
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace