RhinoCommon API
AnnotationBase Constructor
Overload List
Name | Description
AnnotationBase()
 Protected constructor for internal use.
AnnotationBase(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace