RhinoCommon API
File3dmObjectTable.FindByLayer Method
Overload List
Name | Description
FindByLayer(Layer)
 Finds all File3dmObject that are in a given layer.
FindByLayer(String)
 Finds all File3dmObject that are in a given layer.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace