RhinoCommon API
Brep.CreateBooleanSplit Method
Overload List
Name | Description
CreateBooleanSplit(Brep, Brep, Double)
 Splits shared areas of Breps and creates separate Breps from the shared and unshared parts.
CreateBooleanSplit(IEnumerable<Brep>, IEnumerable<Brep>, Double)
 Splits shared areas of Breps and creates separate Breps from the shared and unshared parts.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace