RhinoCommon API
Point2d.Add Method
Overload List
Name | Description
Add(Point2d, Point2d)
 Adds a point with a point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Add(Point2d, Vector2d)
 Adds a point with a vector.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Add(Vector2d, Point2d)
 Adds a vector with a point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Top
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace