RhinoCommon API
DisplayPipeline.IsVisible Method
Overload List
Name | Description
IsVisible(BoundingBox)
 Test a given box for visibility inside the view frustum under the current viewport and model transformation settings.
IsVisible(Point3d)
 Test a given 3d world coordinate point for visibility inside the view frustum under the current viewport and model transformation settings.
IsVisible(RhinoObject)
 Test a given object for visibility inside the view frustum under the current viewport and model transformation settings. This function calls a virtual IsVisibleFinal function that sub-classed pipelines can add extra tests to. In the base class, this test only tests visibility based on the objects world coordinates location and does not pay attention to the object's attributes. NOTE: Use CRhinoDisplayPipeline::IsVisible() to perform "visibility" tests based on location (is some part of the object in the view frustum). Use CRhinoDisplayPipeline::IsActive() to perform "visibility" tests based on object type.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace