RhinoCommon API
RhinoObject.GetRenderMaterial Method
Overload List
Name | Description
GetRenderMaterial(Boolean)
 Gets the RenderMaterial that this object uses based on it's attributes and the document that the object is associated with. If there is no RenderMaterial associated with this object then null is returned. If null is returned you should call GetMaterial to get the material used to render this object.
GetRenderMaterial(ComponentIndex)
 Gets the RenderMaterial associated with this object if there is one. If there is no RenderMaterial associated with this object then null is returned. If null is returned you should call GetMaterial to get the material used to render this object.
GetRenderMaterial(ComponentIndex, Guid)
 Gets the RenderMaterial associated with this object if there is one. If there is no RenderMaterial associated with this object then null is returned. If null is returned you should call GetMaterial to get the material used to render this object.
GetRenderMaterial(ComponentIndex, Guid, ObjectAttributes)
 Gets the RenderMaterial associated with this object if there is one. If there is no RenderMaterial associated with this object then null is returned. If null is returned you should call GetMaterial to get the material used to render this object.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace