RhinoCommon API
BrepFaceList.SplitFaceAtTangents Method
Overload List
Name | Description
SplitFaceAtTangents(Int32)
 Splits the face of a Brep at tangent locations. The face surface will be split at locations of curvature discontinuities with constant tangents.
SplitFaceAtTangents(Int32, Boolean)
 Splits the face of a Brep at tangent locations. The face surface will be split at locations of curvature discontinuities with constant tangents.
Top
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace