RhinoCommon API
StdVectorByte Constructor
Overload List
Name | Description
StdVectorByte()
 Initializes a new SimpleArrayByte class.
StdVectorByte(IEnumerable<Byte>)
 Initializes a new StdVectorByte class
StdVectorByte(StdVectorByte)
 Initializes a new SimpleArrayByte with the contents of another SimpleArrayByte.
StdVectorByte(UInt64)
 Initializes a new SimpleArrayByte class. Initial size of the array - all values are set to zero.
Top
See Also
Reference
StdVectorByte Class
Rhino.Runtime.InteropWrappers Namespace