RhinoCommon API
RenderPrimitiveList.Add Method
Overload List
Name | Description
Add(Box, RenderMaterial)
 Add primitive box and material.
Add(IEnumerable<Mesh>, RenderMaterial)
Add(Mesh, RenderMaterial)
 Add mesh and material.
Add(PlaneSurface, RenderMaterial)
 Add primitive plane and material.
Add(Sphere, RenderMaterial)
 Add primitive sphere and material.
Add(Cone, Plane, RenderMaterial)
 Add primitive cone and material.
Add(Mesh, RenderMaterial, Transform)
 Add mesh and material.
Top
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace