RhinoCommon API
Intersection.CurveSurfaceValidate Method
Overload List
Name | Description
CurveSurfaceValidate(Curve, Surface, Double, Double, Int32[], TextLog)
 Intersects a curve and a surface.
CurveSurfaceValidate(Curve, Interval, Surface, Double, Double, Int32[], TextLog)
 Intersects a sub-curve and a surface.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace