RhinoCommon API
ArchivableDictionary.GetPoint3d Method
Overload List
Name | Description
GetPoint3d(String)
 Get value as Point3d, will only succeed if value was created using Set(string key, Point3d value)
GetPoint3d(String, Point3d)
 Get value as Point3d, will return defaultValue unless value was created using Set(string key, Point3d value)
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace