RhinoCommon API
BrepLoopList.Add Method
Overload List
Name | Description
Add(BrepLoopType)
 Create a new empty boundary loop. The new loop will not be part of a face and will not include any trim curves.
Add(BrepLoopType, BrepFace)
 Create a new boundary loop on a face. After you get this BrepLoop, you still need to create the vertices, edges, and trims that define the loop.
Top
See Also
Reference
BrepLoopList Class
Rhino.Geometry.Collections Namespace