RhinoCommon API
TextFields.FileName Method
Overload List
Name | Description
FileName()
 Return full path to the document
FileName(String)
 Return path to the document
Top
See Also
Reference
TextFields Class
Rhino.Runtime Namespace