RhinoCommon API
CommandLineTextWriter.Write Method
Overload List
Name | Description
Write(Char)
 Writes a char to the command line.
 (Overrides TextWriter.Write(Char).)
Write(String)
 Writes a string to the command line.
 (Overrides TextWriter.Write(String).)
Write(Char[], Int32, Int32)
 Writes a char buffer to the command line.
 (Overrides TextWriter.Write(Char[], Int32, Int32).)
Top
See Also
Reference
RhinoApp.CommandLineTextWriter Class
Rhino Namespace