RhinoCommon API
RenderPipeline Constructor
Overload List
Name | Description
RenderPipeline(RhinoDoc, RunMode, PlugIn, Size, String, RenderWindow.StandardChannels, Boolean, Boolean)
 Constructs a subclass of this object on the stack in your Rhino plug-in's Render() or RenderWindow() implementation.
RenderPipeline(RhinoDoc, RunMode, PlugIn, Size, String, RenderWindow.StandardChannels, Boolean, Boolean, AsyncRenderContext)
 Constructs a subclass of this object on the stack in your Rhino plug-in's Render() or RenderWindow() implementation. This constructor should be used when a non-blocking RenderWindow is required. Note that the asynchronous render context will not be used when mode is Scripted.
Top
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace