RhinoCommon API
Dialogs.ShowNumberBox Method
Overload List
Name | Description
ShowNumberBox(String, String, Double)
 Displays Rhino's number edit box.
ShowNumberBox(String, String, Double, Double, Double)
 Displays Rhino's number edit box.
Top
See Also
Reference
Dialogs Class
Rhino.UI Namespace