RhinoCommon API
AppearanceSettings.GetDefaultState Method
Overload List
Name | Description
GetDefaultState()
 Gets the factory settings of the application.
GetDefaultState(Boolean)
 Gets the factory settings of the application.
Top
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace