RhinoCommon API
NurbsCurveFitParameters Constructor
Overload List
Name | Description
NurbsCurveFitParameters()
 Initializes a new instance of the NurbsCurveFitParameters class.
NurbsCurveFitParameters(NurbsCurveFitParameters)
 Creates a new instance of the NurbsCurveFitParameters class as a copy of an existing instance.
Top
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace