RhinoCommon API
TextEntity.CreateSurfaces Method
Overload List
Name | Description
CreateSurfaces(DimensionStyle, Double, Double)
 Creates planar breps from the outline curves.
CreateSurfaces(DimensionStyle, Boolean, Double, Double)
 Creates planar breps from the outline curves.
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace