RhinoCommon API
Notification.ExecuteAssemblyProtectedCode Method
Overload List
Name | Description
ExecuteAssemblyProtectedCode(Action)
 If a Notification object is only allowed to be modified by certain assemblies, then any code that interacts with it must be wrapped around this method, or a InvalidOperationException will be thrown. For performance reasons, the code wrapped by this method should be kept as simple as possible.
ExecuteAssemblyProtectedCode<TResult>(Func<TResult>)
 If a Notification object is only allowed to be modified by certain assemblies, then any code that interacts with it must be wrapped around this method, or a InvalidOperationException will be thrown. For performance reasons, the code wrapped by this method should be kept as simple as possible.
Top
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace