RhinoCommon API
PlugIn.ObjectPropertiesPages Method
Overload List
Name | Description
ObjectPropertiesPages(List<ObjectPropertiesPage>) |  Obsolete.
 Override this function is you want to extend the object properties dialog
ObjectPropertiesPages(ObjectPropertiesPageCollection)
 Override this function is you want to extend the object properties dialog. This method will be called each time a new document is created for each instance of a object properties panel. On Windows there will be a single panel per document but on Mac there may be many properties panel per document.
Top
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace