RhinoCommon API
ObjectAttributes.ComputedPlotWeight Method
Overload List
Name | Description
ComputedPlotWeight(RhinoDoc)
ComputedPlotWeight(RhinoDoc, Guid)
Top
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace