RhinoCommon API
RhinoAccountsAuthTokenMismatchException Constructor
Overload List
Name | Description
RhinoAccountsAuthTokenMismatchException(Exception)
 Generates a new instance of the exception.
RhinoAccountsAuthTokenMismatchException(String, Exception)
 Generates a new instance of the exception.
RhinoAccountsAuthTokenMismatchException(String, String, Exception)
 Generates a new instance of the exception.
Top
See Also
Reference
RhinoAccountsAuthTokenMismatchException Class
Rhino.Runtime.RhinoAccounts Namespace