RhinoCommon API
Surface.TryGetTorus Method
Overload List
Name | Description
TryGetTorus(Torus)
Tests a surface to see if it is a portion of a torus within RhinoMath.ZeroTolerance and returns the torus.
TryGetTorus(Torus, Double)
Tests a surface to see if it is a portion of a torus and returns the torus.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace