RhinoCommon API
ObjectTable.AddLeader Method
Overload List
Name | Description
AddLeader(IEnumerable<Point3d>)
AddLeader(Leader)
 Adds a Leader object to the document.
AddLeader(Leader, ObjectAttributes)
 Adds Leader object to the document.
AddLeader(Plane, IEnumerable<Point2d>)
AddLeader(String, IEnumerable<Point3d>)
AddLeader(Plane, IEnumerable<Point2d>, ObjectAttributes)
AddLeader(String, Plane, IEnumerable<Point2d>)
AddLeader(Leader, ObjectAttributes, HistoryRecord, Boolean)
 Adds a Leader object to the document.
AddLeader(String, Plane, IEnumerable<Point2d>, ObjectAttributes)
AddLeader(String, Plane, IEnumerable<Point2d>, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace