RhinoCommon API
AreaMassProperties.Compute Method
Overload List
Name | Description
Compute(Brep)
 Computes an AreaMassProperties for a brep.
Compute(Curve)
 Computes an AreaMassProperties for a closed planar curve.
Compute(Hatch)
 Computes an AreaMassProperties for a hatch.
Compute(IEnumerable<GeometryBase>)
 Computes the Area properties for a collection of geometric objects. At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
Compute(Mesh)
 Computes an AreaMassProperties for a mesh.
Compute(Surface)
 Computes an AreaMassProperties for a surface.
Compute(Curve, Double)
 Computes an AreaMassProperties for a closed planar curve.
Compute(Brep, Boolean, Boolean, Boolean, Boolean)
 Compute the AreaMassProperties for a single Brep.
Compute(IEnumerable<GeometryBase>, Boolean, Boolean, Boolean, Boolean)
 Computes the AreaMassProperties for a collection of geometric objects. At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
Compute(Mesh, Boolean, Boolean, Boolean, Boolean)
 Compute the AreaMassProperties for a single Mesh.
Compute(Surface, Boolean, Boolean, Boolean, Boolean)
 Compute the AreaMassProperties for a single Surface.
Compute(Brep, Boolean, Boolean, Boolean, Boolean, Double, Double)
 Compute the AreaMassProperties for a single Brep.
Top
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace