RhinoCommon API
RhinoDoc.Export Method
Overload List
Name | Description
Export(String)
 Export the entire document to a file. All file formats that Rhino can export to are supported by this function.
Export(String, ArchivableDictionary)
 Export the entire document to a file. All file formats that Rhino can export to are supported by this function.
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace