RhinoCommon API
BezierCurve.CreateLoftedBezier Method
Overload List
Name | Description
CreateLoftedBezier(IEnumerable<Point2d>)
 Loft a bezier through a list of points
CreateLoftedBezier(IEnumerable<Point3d>)
 Loft a bezier through a list of points
Top
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace