RhinoCommon API
LicenseData.IsValid Method
Overload List
Name | Description
IsValid()
 Public validator.
IsValid(Boolean)
IsValid(LicenseData)
 Indicates whether a LicenseData object is not null and valid.
Top
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace