RhinoCommon API
StringTable.GetValue Method
Overload List
Name | Description
GetValue(Int32)
GetValue(String)
GetValue(String, String)
 Gets a user data string from the document.
Top
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace