RhinoCommon API
MeshNgonList.GetNgonCenter Method
Overload List
Name | Description
GetNgonCenter(Int32)
 Gets the center point of an ngon.
This the average of the corner points.
GetNgonCenter(MeshNgon)
 Gets the center point of an ngon.
This the average of the corner points.
Top
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace