RhinoCommon API
AppearanceSettings.GetPaintColor Method
Overload List
Name | Description
GetPaintColor(PaintColor)
 Gets the color that is currently associated with a paint color.
GetPaintColor(PaintColor, Boolean)
 Gat a paint color. This overload provides a compute option for cases where colors are computed when they are "unset" colors.
Top
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace