RhinoCommon API
ObjectTable.FindByLayer Method
Overload List
Name | Description
FindByLayer(Layer)
 Finds all RhinoObjects that are in a given layer.
FindByLayer(String)
 Finds all RhinoObjects that are in a given layer.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace