RhinoCommon API
Instance.Dispose Method
Overload List
Name | Description
Dispose()
 Dispose method
Dispose(Boolean)
 Dispose method.
Top
See Also
Reference
Instance Class
Rhino.Render.CustomRenderMeshes Namespace