RhinoCommon API
RhinoList<T>.LastIndexOf Method
Overload List
Name | Description
LastIndexOf(T)
 Searches for the specified object and returns the zero-based index of the last occurrence within the entire List.
LastIndexOf(T, Int32)
 Searches for the specified object and returns the zero-based index of the last occurrence within the range of elements in the List that extends from the first element to the specified index.
LastIndexOf(T, Int32, Int32)
 Searches for the specified object and returns the zero-based index of the last occurrence within the range of elements in the List that contains the specified number of elements and ends at the specified index.
Top
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace