RhinoCommon API
ObjectTable.FindByUserString Method
Overload List
Name | Description
FindByUserString(String, String, Boolean)
 Finds all objects whose UserString matches the search patterns.
FindByUserString(String, String, Boolean, Boolean, Boolean, ObjectEnumeratorSettings)
 Finds all objects whose UserString matches the search patterns.
FindByUserString(String, String, Boolean, Boolean, Boolean, ObjectType)
 Finds all objects whose UserString matches the search patterns.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace