RhinoCommon API
Curve.TryGetEllipse Method
Overload List
Name | Description
TryGetEllipse(Ellipse)
 Try to convert this curve into an Ellipse within RhinoMath.ZeroTolerance.
TryGetEllipse(Ellipse, Double)
 Try to convert this curve into an Ellipse using a custom tolerance.
TryGetEllipse(Plane, Ellipse)
 Try to convert this curve into an Ellipse within RhinoMath.ZeroTolerance.
TryGetEllipse(Plane, Ellipse, Double)
 Try to convert this curve into an Ellipse using a custom tolerance.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace