RhinoCommon API
Curve.GetLength Method
Overload List
Name | Description
GetLength()
 Gets the length of the curve with a fractional tolerance of 1.0e-8.
GetLength(Double)
Get the length of the curve.
GetLength(Interval)
Get the length of a sub-section of the curve with a fractional tolerance of 1e-8.
GetLength(Double, Interval)
Get the length of a sub-section of the curve.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace