RhinoCommon API
Transform.Mirror Method
Overload List
Name | Description
Mirror(Plane)
 Constructs a new Mirror transformation.
Mirror(Point3d, Vector3d)
 Create mirror transformation matrix The mirror transform maps a point Q to Q - (2*(Q-P)oN)*N, where P = pointOnMirrorPlane and N = normalToMirrorPlane.
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace