RhinoCommon API
Brep.CreateFromSweep Method
Overload List
Name | Description
CreateFromSweep(Curve, Curve, Boolean, Double)
 Sweep1 function that fits a surface through a profile curve that define the surface cross-sections and one curve that defines a surface edge.
CreateFromSweep(Curve, IEnumerable<Curve>, Boolean, Double)
 Sweep1 function that fits a surface through profile curves that define the surface cross-sections and one curve that defines a surface edge.
CreateFromSweep(Curve, Curve, Curve, Boolean, Double)
 General 2 rail sweep. If you are not producing the sweep results that you are after, then use the SweepTwoRail class with options to generate the swept geometry.
CreateFromSweep(Curve, Curve, IEnumerable<Curve>, Boolean, Double)
 General 2 rail sweep. If you are not producing the sweep results that you are after, then use the SweepTwoRail class with options to generate the swept geometry.
CreateFromSweep(Curve, Curve, IEnumerable<Curve>, Point3d, Point3d, Boolean, Double, SweepRebuild, Int32, Double, Boolean)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines the surface edges.
CreateFromSweep(Curve, Curve, IEnumerable<Curve>, Point3d, Point3d, Boolean, Double, SweepRebuild, Int32, Double, Boolean, Boolean)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines the surface edges.
CreateFromSweep(Curve, IEnumerable<Curve>, Point3d, Point3d, SweepFrame, Vector3d, Boolean, SweepBlend, SweepMiter, Double, SweepRebuild, Int32, Double)
 Sweep1 function that fits a surface through a series of profile curves that define the surface cross-sections and one curve that defines a surface edge.
CreateFromSweep(Curve, IEnumerable<Curve>, Point3d, Point3d, SweepFrame, Vector3d, Boolean, SweepBlend, SweepMiter, Double, SweepRebuild, Int32, Double, Boolean)
 Sweep1 function that fits a surface through a series of profile curves that define the surface cross-sections and one curve that defines a surface edge. Unlike other CreateFromSweep and CreateFromSweepSegmented overrides, this method: - Matches shape curve directions and (for closed shapes) seam points before sweeping, which prevents twisting. - Detects when the inputs qualify for a "simple sweep" and creates a simpler surface in this case. - Lets the caller pick between the refit - rail and segmented sweep paths. - Splits the resulting Breps at fully multiple knots.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace