RhinoCommon API
RTree.Insert Method
Overload List
Name | Description
Insert(BoundingBox, Int32)
Inserts an element into the tree.
Insert(BoundingBox, IntPtr)
Inserts an element into the tree.
Insert(Point2d, Int32)
Inserts an element into the tree.
Insert(Point2d, IntPtr)
Inserts an element into the tree.
Insert(Point3d, Int32)
Inserts an element into the tree.
Insert(Point3d, IntPtr)
Inserts an element into the tree.
Top
See Also
Reference
RTree Class
Rhino.Geometry Namespace