RhinoCommon API
InitFrameBufferEventArgs.SetFill Method
Overload List
Name | Description
SetFill(Color)
SetFill(Color, Color)
SetFill(Color, Color, Color, Color)
Top
See Also
Reference
InitFrameBufferEventArgs Class
Rhino.Display Namespace