RhinoCommon API
Point3f.Multiply Operator
Overload List
Name | Description
Multiply(Point3f, Single)
 Multiplies a point by a factor.
Multiply(Single, Point3f)
 Multiplies a point by a factor.
Top
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace