RhinoCommon API
Intersection.CurveBrep Method
Overload List
Name | Description
CurveBrep(Curve, Brep, Double, Curve[], Point3d[])
 Intersects a curve with a Brep. This function returns the 3D points of intersection and 3D overlap curves. If an error occurs while processing overlap curves, this function will return false, but it will still provide partial results.
CurveBrep(Curve, Brep, Double, Double, Double[])
 Intersect a curve with a Brep. This function returns the intersection parameters on the curve.
CurveBrep(Curve, Brep, Double, Curve[], Point3d[], Double[])
 Intersects a curve with a Brep. This function returns the 3D points of intersection, curve parameters at the intersection locations, and 3D overlap curves. If an error occurs while processing overlap curves, this function will return false, but it will still provide partial results.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace