RhinoCommon API
IRhinoAccountsManager.GetAuthTokensAsync Method
Overload List
Name | Description
GetAuthTokensAsync(String, String, SecretKey, CancellationToken)
 Asynchronously retrieves auth tokens with the given criteria from the Rhino Accounts server.
GetAuthTokensAsync(String, String, IEnumerable<String>, String, Nullable<Int32>, Boolean, IProgress<RhinoAccoountsProgressInfo>, SecretKey, CancellationToken)
 Asynchronously retrieves auth tokens with the given criteria from the Rhino Accounts server.
Top
See Also
Reference
IRhinoAccountsManager Interface
Rhino.Runtime.RhinoAccounts Namespace