RhinoCommon API
Interval.IncludesInterval Method
Overload List
Name | Description
IncludesInterval(Interval)
 Tests another interval for Interval inclusion.
IncludesInterval(Interval, Boolean)
 Tests another interval for Interval inclusion.
Top
See Also
Reference
Interval Structure
Rhino.Geometry Namespace