RhinoCommon API
RhinoGet.GetBox Method
Overload List
Name | Description
GetBox(Box)
 Asks the user to select a Box in the viewport.
GetBox(Box, GetBoxMode, Point3d, String, String, String)
 Asks the user to select a Box in the viewport.
Top
See Also
Reference
RhinoGet Class
Rhino.Input Namespace