RhinoCommon API
DisplayPipeline.SetupDisplayMaterial Method
Overload List
Name | Description
SetupDisplayMaterial(Color)
SetupDisplayMaterial(RhinoDoc, RhinoObject)
 Sets up a display material.
SetupDisplayMaterial(RhinoDoc, RhinoObject, ObjectAttributes)
 Sets up a display material.
SetupDisplayMaterial(RhinoDoc, RhinoObject, ObjectAttributes, Transform)
 Sets up a display material.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace