RhinoCommon API
Curve.Extend Method
Overload List
Name | Description
Extend(Interval)
 Where possible, analytically extends curve to include the given domain. This will not work on closed curves. The original curve will be identical to the restriction of the resulting curve to the original curve domain.
Extend(Double, Double)
 Where possible, analytically extends curve to include the given domain. This will not work on closed curves. The original curve will be identical to the restriction of the resulting curve to the original curve domain.
Extend(CurveEnd, CurveExtensionStyle, Point3d)
 Extends a curve to a point.
Extend(CurveEnd, CurveExtensionStyle, IEnumerable<GeometryBase>)
 Extends a curve until it intersects a collection of objects.
Extend(CurveEnd, Double, CurveExtensionStyle)
 Extends a curve by a specific length.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace