RhinoCommon API
FileCsvDocument Constructor
Overload List
Name | Description
FileCsvDocument(Int32)
 Constructs a new, empty document with a fixed number of columns. Every row written to the document has exactly this many fields. The document has no header row.
FileCsvDocument(String[])
 Constructs a new, empty document with a header row of column names. The number of columns is the number of names supplied, and the header is written ahead of the data rows by Save(String). Columns can then be addressed by name (see ColumnIndex(String) and the name-keyed TryGet overloads).
Top
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace