RhinoCommon API
PersistentSettings.GetPoint3d Method
Overload List
Name | Description
GetPoint3d(String)
GetPoint3d(String, Point3d)
GetPoint3d(String, Point3d, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace