RhinoCommon API
Line.ToString Method
Overload List
Name | Description
ToString()
 Constructs the string representation of this line, in the form "From,To".
 (Overrides ValueType.ToString().)
ToString(String, IFormatProvider)
Formats the value of the current instance using the specified format.
Top
See Also
Reference
Line Structure
Rhino.Geometry Namespace