RhinoCommon API
Brep.SetTolerancesBoxesAndFlags Method
Overload List
Name | Description
SetTolerancesBoxesAndFlags()
 Set tolerances and flags in a Brep.
SetTolerancesBoxesAndFlags(Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Set tolerances and flags in a Brep.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace