RhinoCommon API
Intersection.RayShoot Method
Overload List
Name | Description
RayShoot(IEnumerable<GeometryBase>, Ray3d, Int32)
 Computes point intersections that occur when shooting a ray to a collection of surfaces and Breps.
RayShoot(Ray3d, IEnumerable<GeometryBase>, Int32)
 Computes point intersections that occur when shooting a ray to a collection of surfaces and Breps.
RayShoot(IEnumerable<GeometryBase>, Ray3d, Int32, Boolean)
 Computes point intersections that occur when shooting a ray to a collection of surfaces and Breps.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace