RhinoCommon API
SafeFrame Constructor
Overload List
Name | Description
SafeFrame()
 Create a utility object not associated with any document
SafeFrame(RhinoDoc)
 Create the SafeFrame object which is associated with the document
SafeFrame(SafeFrame)
 Create a utility object not associated with any document from another object
Top
See Also
Reference
SafeFrame Class
Rhino.Render Namespace