RhinoCommon API
StringTable.Delete Method
Overload List
Name | Description
Delete(String)
Delete(String, String)
 Removes user data strings from the document.
Top
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace