RhinoCommon API
Intersection.MeshMeshPredicate Method
Overload List
Name | Description
MeshMeshPredicate(IEnumerable<Mesh>, Double, Int32[], TextLog)
 Determines which meshes intersect. No geometry is computed: each pair of meshes is tested only until its first crossing is found, with the fast intersector behind MeshMeshFast(Mesh, Mesh). Faces that cross or touch within tolerance count; coplanar overlap without a crossing does not.
The same as MeshMeshPredicate(IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Boolean, IntersectingMeshPair[], TextLog, CancellationToken) with fast = true.
MeshMeshPredicate(IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Boolean, TextLog, CancellationToken)
 Determines whether any of the meshes intersect. No geometry is computed, and the search stops at the first pair of meshes that intersect: this is the quickest answer when the intersecting pairs are not needed.
MeshMeshPredicate(IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Boolean, IntersectingMeshPair[], TextLog, CancellationToken)
 Determines which meshes intersect, and reports one intersecting face couple for each pair found. No geometry is computed: each pair of meshes is tested only until its first hit.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace