RhinoCommon API
Intersection.LineLine Method
Overload List
Name | Description
LineLine(Line, Line, Double, Double)
 Find the unique closest-points pair between two infinite lines, if it exists.
LineLine(Line, Line, Double, Double, Double, Boolean)
 Intersects two lines.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace