RhinoCommon API
Curve.ToPolyline Method
Overload List
Name | Description
ToPolyline(Double, Double, Double, Double)
 Gets a polyline approximation of a curve.
ToPolyline(Int32, Int32, Double, Double, Double, Double, Double, Double, Boolean)
 Gets a polyline approximation of a curve.
ToPolyline(Int32, Int32, Double, Double, Double, Double, Double, Double, Boolean, Interval)
 Gets a polyline approximation of a curve.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace