RhinoCommon API
Transform.DecomposeAffine Method
Overload List
Name | Description
DecomposeAffine(Transform, Vector3d)
 Decomposes an affine transformation. A transformation is affine if it is valid and its last row is [0, 0, 0, 1]. An affine transformation can be broken into a linear transformation and a translation. Note, a perspective transformation is not affine.
DecomposeAffine(Vector3d, Transform)
 Decomposes an affine transformation. A transformation is affine if it is valid and its last row is [0, 0, 0, 1]. An affine transformation can be broken into a linear transformation and a translation. Note, a perspective transformation is not affine.
DecomposeAffine(Vector3d, Transform, Transform, Vector3d)
 An affine transformation can be decomposed into a Symmetric, Rotation and Translation. Then the Symmetric component may be further decomposed as non-uniform scale in an orthonormal coordinate system.
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace