RhinoCommon API
CustomCurveObject Constructor
Overload List
Name | Description
CustomCurveObject()
Initializes a new instance of the CustomCurveObject class
CustomCurveObject(Curve)
Initializes a new instance of the CustomCurveObject class
Top
See Also
Reference
CustomCurveObject Class
Rhino.DocObjects.Custom Namespace