RhinoCommon API
Mesh.QuadRemeshBrepAsync Method
Overload List
Name | Description
QuadRemeshBrepAsync(Brep, QuadRemeshParameters, IProgress<Int32>, CancellationToken)
 Quad remesh this Brep asynchronously.
QuadRemeshBrepAsync(Brep, QuadRemeshParameters, IEnumerable<Curve>, IProgress<Int32>, CancellationToken)
 Quad remesh this Brep asynchronously.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace