RhinoCommon API
Transform2d Constructor
Overload List
Name | Description
Transform2d(Double)
 Initializes a new transform matrix with a specified value along the diagonal.
Transform2d(Transform2d)
 Initializes a new transform matrix from another transform matrix.
Transform2d(Double, Double, Double, Double, Double, Double)
 Initializes a new transform matrix from its six values.
Top
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace