RhinoCommon API
TextEntity.CreateCurvesGrouped Method
Overload List
Name | Description
CreateCurvesGrouped(DimensionStyle, Boolean, Double, Double)
 Creates planar curve from text outline curves. Curves are grouped such that each element in the list being returned represents a single character.
CreateCurvesGrouped(DimensionStyle, Boolean, Boolean, Double, Double)
 Creates planar curve from text outline curves. Curves are grouped such that each element in the list being returned represents a single character.
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace