RhinoCommon API
FileCsvDocument.Save Method
Overload List
Name | Description
Save(String)
 Writes the document to a file on disk, encoded as UTF-8 with a byte order mark. The mark lets spreadsheet applications (for example Excel on Windows and Mac) detect the encoding rather than falling back to the system code page, which garbles non-ASCII text such as Korean (RH-97173). Use Save(String, Encoding) with new UTF8Encoding(false) to write UTF-8 without a mark.
Save(TextWriter)
 Writes the document to a text writer. Records are separated by CRLF, per RFC 4180. If the document has a header, it is written ahead of the data rows.
Save(String, Encoding)
 Writes the document to a file on disk using the specified encoding.
Top
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace