RhinoCommon API
Curve.TrimInterval Method
Overload List
Name | Description
TrimInterval(Interval)
 Trims the curve in-place by removing portions of the curve outside the specified interval.
TrimInterval(Double, Double)
 Trims the curve in-place by removing portions of the curve outside the specified interval.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace