RhinoCommon API
RhinoObject.GetRenderMeshParameters Method
Overload List
Name | Description
GetRenderMeshParameters()
 Returns the meshing parameters that this object uses for generating render meshes. If this object does not have per-object meshing parameters, then the document's meshing parameters are returned.
GetRenderMeshParameters(Boolean)
 Returns the meshing parameters that this object uses for generating render meshes.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace