RhinoCommon API
File3dmStringTable.Delete Method
Overload List
Name | Description
Delete(String)
 Removes a document string from the 3dm file.
Delete(String, String)
 Removes document strings from the 3dm file.
Top
See Also
Reference
File3dmStringTable Class
Rhino.FileIO Namespace