RhinoCommon API
MeshTextureCoordinateList.SetTextureCoordinates Method
Overload List
Name | Description
SetTextureCoordinates(Point2f[])
 Sets all texture coordinates in one go.
SetTextureCoordinates(TextureMapping)
 Set all texture coordinates based on a texture mapping function
Top
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace