RhinoCommon API
TextureMapping.TryGetMappingPlane Method
Overload List
Name | Description
TryGetMappingPlane(Plane, Interval, Interval, Interval)
 Get plane mapping parameters from this texture mapping.
TryGetMappingPlane(Plane, Interval, Interval, Interval, Boolean)
 Get plane mapping parameters from this texture mapping, including capping information
Top
See Also
Reference
TextureMapping Class
Rhino.Render Namespace