RhinoCommon API
NurbsCurve.CreateFromArc Method
Overload List
Name | Description
CreateFromArc(Arc)
 Gets a rational degree 2 NURBS curve representation of the arc. Note that the parameterization of NURBS curve does not match arc's transcendental parameterization.
CreateFromArc(Arc, Int32, Int32)
 Create a uniform non-rational cubic NURBS approximation of an arc.
Top
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace