RhinoCommon API
SectionStyleTable.Delete Method
Overload List
Name | Description
Delete(SectionStyle)
 Deletes a section style.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(IEnumerable<Int32>, Boolean)
 Delete multiple section styles.
Delete(Int32, Boolean)
 Deletes a section style.
Delete(IEnumerable<Int32>, Boolean, Int32)
 Delete multiple section styles.
Top
See Also
Reference
SectionStyleTable Class
Rhino.DocObjects.Tables Namespace