RhinoCommon API
Hatch.Create Method
Overload List
Name | Description
Create(Curve, Int32, Double, Double) |  Obsolete.
 Constructs an array of hatches from one curve.
Create(IEnumerable<Curve>, Int32, Double, Double) |  Obsolete.
 Constructs an array of hatches from a set of curves.
Create(Curve, Int32, Double, Double, Double)
 Constructs an array of hatches from one curve.
Create(IEnumerable<Curve>, Int32, Double, Double, Double)
 Constructs an array of hatches from a set of curves.
Create(Plane, Curve, IEnumerable<Curve>, Int32, Double, Double)
 Create a hatch with a given set of outer and inner loops
Top
See Also
Reference
Hatch Class
Rhino.Geometry Namespace