RhinoCommon API
SubD.JoinSubDs Method
Overload List
Name | Description
JoinSubDs(IEnumerable<SubD>, Double, Boolean)
 Joins an enumeration of SubDs to form as few as possible resulting SubDs. There may be more than one SubD in the result array.
JoinSubDs(IEnumerable<SubD>, Double, Boolean, Boolean)
 Joins an enumeration of SubDs to form as few as possible resulting SubDs. There may be more than one SubD in the result array.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace