RhinoCommon API
RhinoGet.GetPolygon Method
Overload List
Name | Description
GetPolygon(Int32, Boolean, Polyline)
GetPolygon(Boolean, Int32, Boolean, Polyline)
Top
See Also
Reference
RhinoGet Class
Rhino.Input Namespace