RhinoCommon API
RhinoApp.Exit Method
Overload List
Name | Description
Exit()
Exits, or closes, Rhino.
Exit(Boolean)
 Exits, or forcefully closes Rhino. A prompt to allow saving will appear if necessary when forcefully exiting Works on Windows and MacOS true to allow the user to cancel exiting false to force exit
Top
See Also
Reference
RhinoApp Class
Rhino Namespace