RhinoCommon API
MeshFaceList.GetConnectedFaces Method
Overload List
Name | Description
GetConnectedFaces(Int32)
 Find all connected face indices
GetConnectedFaces(Int32, Double, Boolean)
 Find all connected face indices where adjacent face normals meet the criteria of angleRadians and greaterThanAngle
Top
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace