RhinoCommon API
ArchivableDictionary.GetBytes Method
Overload List
Name | Description
GetBytes(String)
 Get value as byte[], will only succeed if value was created using Set(string key, byte[] value)
GetBytes(String, Byte[])
 Get value as byte[], will return defaultValue unless value was created using Set(string key, byte[] value)
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace