RhinoCommon API
Curve.GetLocalTangentPoint Method
Overload List
Name | Description
GetLocalTangentPoint(Point3d, Double, Double)
 Search for a location on the curve, near seedParmameter, that is tangent to a test point.
GetLocalTangentPoint(Point3d, Double, Interval, Double)
 Search for a location on the curve, near seedParmameter, that is tangent to a test point.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace