RhinoCommon API
PersistentSettingsConverter.ToString Method
Overload List
Name | Description
ToString(Double)
 Converts a double value to a string.
ToString(KeyValuePair<String, String>[])
 Converts a key value string pair array to a properly formatted string dictionary XML string.
ToString(String[])
 Converts a string array to a properly formatted string list XML string.
Top
See Also
Reference
PersistentSettingsConverter Class
Rhino Namespace