RhinoCommon API
ArchivableDictionary.GetDictionary Method
Overload List
Name | Description
GetDictionary(String)
 Get value as ArchivableDictionary, will only succeed if value was created using Set(string key, ArchivableDictionary value)
GetDictionary(String, ArchivableDictionary)
 Get value as ArchivableDictionary, will return defaultValue unless value was created using Set(string key, ArchivableDictionary value)
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace