RhinoCommon API
SweepTwoRail.PerformSweepRebuild Method
Overload List
Name | Description
PerformSweepRebuild(Curve, Curve, Curve, Int32)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRebuild(Curve, Curve, IEnumerable<Curve>, Int32)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRebuild(Curve, Curve, Curve, Double, Double, Int32)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRebuild(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>, Int32)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
Top
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace