RhinoCommon API
IRhinoAccountsManager.TryGetAuthTokens Method
Overload List
Name | Description
TryGetAuthTokens(String, SecretKey)
 Attempts to return cached auth tokens that match the given criteria if any have been stored in cache.
TryGetAuthTokens(String, IEnumerable<String>, SecretKey)
 Attempts to return cached auth tokens that match the given criteria if any have been stored in cache.
Top
See Also
Reference
IRhinoAccountsManager Interface
Rhino.Runtime.RhinoAccounts Namespace