RhinoCommon API
PostEffect.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the PostEffect
Dispose(Boolean)
Releases the unmanaged resources used by the PostEffect and optionally releases the managed resources
Top
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace