RhinoCommon API
OptionString Constructor
Overload List
Name | Description
OptionString(String)
 Constructs the option object.
OptionString(String, Boolean)
 Constructs the option object.
Top
See Also
Reference
OptionString Class
Rhino.Input.Custom Namespace