RhinoCommon API
DisplayPipeline.DrawArrow Method
Overload List
Name | Description
DrawArrow(Line, Color)
 Draws a single arrow object. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
DrawArrow(Line, Double, Color, Single)
 Draw a Grasshopper 2 style vector arrow. This method is relatively slow as it requires the construction of a DisplayPen and a PolylineCurve. However it is more accurate than other arrow drawing methods in that the tip of the drawn arrow is very close to the actual end of the line, the tip is always sharp, and the arrow head is resized to never be too small or large. Also note this method already takes into account logical pixel scaling.
DrawArrow(Line, Color, Double, Double)
 Draws a single arrow object. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace