RhinoCommon API
Intersection.BrepBrep Method
Overload List
Name | Description
BrepBrep(Brep, Brep, Double, Curve[], Point3d[])
 Intersects two Breps.
BrepBrep(Brep, Brep, Double, Boolean, Curve[], Point3d[])
 Intersects two Breps.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace