RhinoCommon API
Mesh.CreateExtrusion Method
Overload List
Name | Description
CreateExtrusion(Curve, Vector3d)
 Constructs a mesh by extruding a curve along a vector.
CreateExtrusion(Curve, Vector3d, MeshingParameters)
 Constructs a mesh by extruding a curve along a vector.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace