RhinoCommon API
MeshNgon.Equals Method
Overload List
Name | Description
Equals(MeshNgon)
 Determines if this ngon and otherNgon are identical.
Equals(Object)
 Determines if otherObj is a MeshNgon and is identical to this ngon.
 (Overrides Object.Equals(Object).)
Top
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace