RhinoCommon API
ManifestTable.FindIndex Method
Overload List
Name | Description
FindIndex<T>(Int32)
 Uses the index to find a model component. The index is the value that is stored in the .Index property.
FindIndex(Int32, ModelComponentType)
 Uses the index to find a model component. The index is the value that is stored in the .Index property.
Top
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace