RhinoCommon API
RenderEnvironment.NewBasicEnvironment Method
Overload List
Name | Description
NewBasicEnvironment(SimulatedEnvironment)
 Constructs a new RenderEnvironment from a SimulatedEnvironment.
NewBasicEnvironment(SimulatedEnvironment, RhinoDoc)
Top
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace