RhinoCommon API
TextEntity.CreateCurves Method
Overload List
Name | Description
CreateCurves(DimensionStyle, Boolean, Double, Double)
 Returns the outline curves.
CreateCurves(DimensionStyle, Boolean, Boolean, Double, Double)
 Returns the outline curves.
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace