RhinoCommon API
RhinoGet.GetInterpolatedCurveOnSurface Method
Overload List
Name | Description
GetInterpolatedCurveOnSurface(Surface, Curve)
 Interactively picks the points of a curve interpolated through a surface. This is the getter behind the Rhino InterpCrvOnSrf command.
GetInterpolatedCurveOnSurface(Surface, Curve, ObjRef, Point2d[])
 Interactively picks the points of a curve interpolated through a surface. This is the getter behind the Rhino InterpCrvOnSrf command.
Top
See Also
Reference
RhinoGet Class
Rhino.Input Namespace