RhinoCommon API
GeometryBase.Dispose Method
Overload List
Name | Description
Dispose(Boolean)
 Overridden in order to destroy local display cache information
 (Overrides CommonObject.Dispose(Boolean).)
Top
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace