RhinoCommon API
Vector3d.IsPerpendicularTo Method
Overload List
Name | Description
IsPerpendicularTo(Vector3d)
 Test to see whether this vector is perpendicular to within one degree of another one.
IsPerpendicularTo(Vector3d, Double)
 Determines whether this vector is perpendicular to another vector, within a provided angle tolerance.
Top
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace