RhinoCommon API
Brep.RemoveHoles Method
Overload List
Name | Description
RemoveHoles(Double)
 Remove all inner loops, or holes, in a Brep.
RemoveHoles(IEnumerable<ComponentIndex>, Double)
 Removes inner loops, or holes, in a Brep.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace