RhinoCommon API
ObjectTable.AddPoint Method
Overload List
Name | Description
AddPoint(Point3d)
Adds a point object to the document.
AddPoint(Point3f)
Adds a point object to the document.
AddPoint(Point3d, ObjectAttributes)
Adds a point object to the document.
AddPoint(Point3f, ObjectAttributes)
Adds a point object to the document.
AddPoint(Double, Double, Double)
 Adds a point object to the document.
AddPoint(Point, ObjectAttributes, HistoryRecord, Boolean)
Adds a point object and its geometry-linked information to the document
AddPoint(Point3d, ObjectAttributes, HistoryRecord, Boolean)
Adds a point object to the document
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace