RhinoCommon API
SubD.SharpEdgeCount Method
Overload List
Name | Description
SharpEdgeCount()
 Gets the number of sharp edges in this SubD. See IsSharp for what makes an edge sharp.
SharpEdgeCount(SubDEdgeSharpness)
 Gets the number of sharp edges in this SubD, and the range of sharpness values used.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace