RhinoCommon API
Curve.CreateBooleanUnion Method
Overload List
Name | Description
CreateBooleanUnion(IEnumerable<Curve>) |  Obsolete.
 Calculates the boolean union of two or more closed, planar curves. Note, curves must be co-planar.
CreateBooleanUnion(IEnumerable<Curve>, Double)
 Calculates the boolean union of two or more closed, planar curves. Note, curves must be co-planar.
CreateBooleanUnion(IEnumerable<Curve>, Double, Int32[])
 Calculates the boolean union of two or more closed, planar curves, and reports which input curve ended up in which output curve. Note, curves must be co-planar.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace