RhinoCommon API
ObjectPropertiesPage.ShouldDisplay Method
Overload List
Name | Description
ShouldDisplay(ObjectPropertiesPageEventArgs)
 Called when the selected objects list changes, return true if the object list contains one or more object the page can modify.
ShouldDisplay(RhinoObject) |  Obsolete.
 Called when the selected objects list changes, return true if the object list contains one or more object the page can modify.
Top
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace