RhinoCommon API
Point3d Constructor
Overload List
Name | Description
Point3d(Point3d)
 Initializes a new point by copying coordinates from another point.
Point3d(Point3f)
 Initializes a new point by copying coordinates from a single-precision point.
Point3d(Point4d)
 Initializes a new point by copying coordinates from a four-dimensional point. The first three coordinates are divided by the last one. If the W (fourth) dimension of the input point is zero, then it will be just discarded.
Point3d(Vector3d)
 Initializes a new point by copying coordinates from the components of a vector.
Point3d(Double, Double, Double)
 Initializes a new point by defining the X, Y and Z coordinates.
Top
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace