RhinoCommon API
LightTable.Delete Method
Overload List
Name | Description
Delete(LightObject) |  (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32, Boolean)
Top
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace