RhinoCommon API
HiddenLineDrawingParameters.AddGeometry Method
Overload List
Name | Description
AddGeometry(GeometryBase, Object)
 Add geometry that should be included in the calculation
AddGeometry(GeometryBase, Transform, Object)
 Add geometry that should be included in the calculation
AddGeometry(GeometryBase, Object, Boolean)
 Add geometry that should be included in the calculation
AddGeometry(GeometryBase, Transform, Object, Boolean)
 Add geometry that should be included in the calculation
Top
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace