RhinoCommon API
LayerTable.Add Method
Overload List
Name | Description
Add()
 Adds a new layer with default definition to the layer table.
Add(Layer)
 Adds a new layer with specified definition to the layer table.
Add(String, Color)
 Adds a new layer with specified definition to the layer table.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace