RhinoCommon API
ViewportInfo.SetFrustumNearFar Method
Overload List
Name | Description
SetFrustumNearFar(BoundingBox)
 Sets the frustum near and far using a bounding box.
SetFrustumNearFar(Double, Double)
 Sets the frustum near and far distances using two values.
SetFrustumNearFar(Point3d, Double)
 Sets the frustum near and far using a center point and radius.
SetFrustumNearFar(Double, Double, Double, Double, Double)
 Sets near and far clipping distance subject to constraints.
Top
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace