RhinoCommon API
Curve.CreateTweenCurvesWithSampling Method
Overload List
Name | Description
CreateTweenCurvesWithSampling(Curve, Curve, Int32, Int32) |  Obsolete.
 Creates curves between two open or closed input curves. Use sample points method to make curves compatible. This is how the algorithm works: Divides the two curves into an equal number of points, finds the midpoint between the corresponding points on the curves and interpolates the tween curve through those points. There is no matching of curves direction. Caller must match input curves direction before calling the function.
CreateTweenCurvesWithSampling(Curve, Curve, Int32, Int32, Double)
 Creates curves between two open or closed input curves. Use sample points method to make curves compatible. This is how the algorithm works: Divides the two curves into an equal number of points, finds the midpoint between the corresponding points on the curves and interpolates the tween curve through those points. There is no matching of curves direction. Caller must match input curves direction before calling the function.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace