RhinoCommon API
Intersection.MeshRays Method
Overload List
Name | Description
MeshRays(Mesh, IEnumerable<Ray3d>)
 Finds the first intersection of each one of a set of rays with a mesh.
MeshRays(Mesh, IEnumerable<Ray3d>, Boolean)
 Finds the first intersection of each one of a set of rays with a mesh.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace