RhinoCommon API
DisplayPipeline.DrawEmapPreview Method
Overload List
Name | Description
DrawEmapPreview(Brep, Color)
 Draws a Brep in Environment Map preview.
DrawEmapPreview(Mesh, Color)
 Draws a Mesh in Environment Map preview.
DrawEmapPreview(Brep, Color, EmapAnalysisSettingsState)
 Draws a Brep in Environment Map preview with a texture of your own, instead of the one in EmapAnalysisSettings.
DrawEmapPreview(Mesh, Color, EmapAnalysisSettingsState)
 Draws a Mesh in Environment Map preview with a texture of your own, instead of the one in EmapAnalysisSettings.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace