RhinoCommon API
AppearanceSettings.SetPaintColor Method
Overload List
Name | Description
SetPaintColor(PaintColor, Color)
 Sets the logical paint color association to a specific .Net library color, without forced UI update.
SetPaintColor(PaintColor, Color, Boolean)
 Sets the logical paint color association to a specific .Net library color.
Top
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace