RhinoCommon API
AngularDimension Constructor
Overload List
Name | Description
AngularDimension()
 Constructs an angular dimension.
AngularDimension(Arc, Double)
 Constructs an angular dimension from a given arc.
AngularDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
AngularDimension(Line, Point3d, Line, Point3d, Point3d, Boolean)
 Constructs an angular dimension between the lines. If the lines intersect in a single point, that point is used as the center of the angular dimension arc.In this case, there are eight possible angles to dimension.The pointOnAngularDimensionArc and pointOnLine parameters are used to select the correct angle to dimension. If a pointOnLine parameter is not set, the corresponding line's midpoint is used. If the lines are colinear, the point on the line closest to pointOnAngularDimensionArc is the center of the angular dimension arc.
AngularDimension(Plane, Vector3d, Point3d, Point3d, Point3d, Point3d)
 Constructs an angular dimension with extension lines starting at plane origin (arc center).
AngularDimension(Plane, Vector3d, Point3d, Point3d, Point3d, Point3d, Point3d)
 Constructs an angular dimension from parameters.
Top
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace