RhinoCommon API
Plane.IsCoplanar Method
Overload List
Name | Description
IsCoplanar(Plane)
 Test if this plane is co-planar with a another plane.
IsCoplanar(Plane, Double)
 Test if this plane is co-planar with a another plane.
Top
See Also
Reference
Plane Structure
Rhino.Geometry Namespace