RhinoCommon API
VolumeMassProperties.Compute Method
Overload List
Name | Description
Compute(Brep)
 Compute the VolumeMassProperties for a single Brep.
Compute(IEnumerable<GeometryBase>)
 Computes the VolumeMassProperties for a collection of geometric objects. At present only Breps, Surfaces, and Meshes are supported.
Compute(Mesh)
 Compute the VolumeMassProperties for a single Mesh.
Compute(Surface)
 Compute the VolumeMassProperties for a single Surface.
Compute(Brep, Boolean, Boolean, Boolean, Boolean)
 Compute the VolumeMassProperties for a single Brep.
Compute(IEnumerable<GeometryBase>, Boolean, Boolean, Boolean, Boolean)
 Computes the VolumeMassProperties for a collection of geometric objects. At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
Compute(Mesh, Boolean, Boolean, Boolean, Boolean)
 Compute the VolumeMassProperties for a single Mesh.
Compute(Surface, Boolean, Boolean, Boolean, Boolean)
 Compute the VolumeMassProperties for a single Surface.
Compute(Brep, Boolean, Boolean, Boolean, Boolean, Double, Double)
 Compute the VolumeMassProperties for a single Brep.
Top
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace