RhinoCommon API
DrawingUtilities.BitmapFromIconResource Method
Overload List
Name | Description
BitmapFromIconResource(String, Assembly)
 Load a Icon from an embedded resource and convert it to a bitmap of the specified size. Will look for a icon image that is greater than or equal to the requested size, if all images are less than the requested size the largest image will be used.
BitmapFromIconResource(String, Size, Assembly)
 Load a Icon from an embedded resource and convert it to a bitmap of the specified size. Will look for a icon image that is greater than or equal to the requested size, if all images are less than the requested size the largest image will be used.
Top
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace