RhinoCommon API
Surface.TryGetCone Method
Overload List
Name | Description
TryGetCone(Cone)
Tests a surface to see if it is a portion of a cone within RhinoMath.ZeroTolerance and return the cone.
TryGetCone(Cone, Double)
Tests a surface to see if it is a portion of a cone and returns the cone.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace