RhinoCommon API
NurbsSurfacePointList.GetPoint Method
Overload List
Name | Description
GetPoint(Int32, Int32, Point3d)
 Gets a world 3-D, or Euclidean, control point at the given (u, v) index. The 4-D representation is (x, y, z, 1.0).
GetPoint(Int32, Int32, Point4d)
 Gets a homogeneous control point at the given (u, v) index, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
Top
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace