RhinoCommon API
TextureEvaluator.Dispose Method
Overload List
Name | Description
Dispose()
 For Dispose pattern
Dispose(Boolean)
 For Dispose pattern
Top
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace