RhinoCommon API
ColorHSV Constructor
Overload List
Name | Description
ColorHSV(Color)
 Constructs a new instance of ColorHSV that is equivalent to an ARGB color.
ColorHSV(Double, Double, Double)
 Constructs a new instance of ColorHSV with custom channel values.
ColorHSV(Double, Double, Double, Double)
 Constructs a new instance of ColorHSV with custom channel values.
Top
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace