RhinoCommon API
SubDEdgeList.Find Method
Overload List
Name | Description
Find(Int32)
 Find an edge in this SubD with a given id
Find(UInt32)
 Find an edge in this SubD with a given id
Top
See Also
Reference
SubDEdgeList Class
Rhino.Geometry.Collections Namespace