RhinoCommon API
VolumeMassProperties.Sum Method
Overload List
Name | Description
Sum(VolumeMassProperties)
 Sum mass properties together to get an aggregate mass.
Sum(IEnumerable<VolumeMassProperties>, Boolean)
 Sum mass properties together to get an aggregate mass.
Top
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace