RhinoCommon API
DrawingUtilities.PixelsFromSvg Method
Overload List
Name | Description
PixelsFromSvg(String, Int32, Int32, Boolean, Color)
 Get array of bytes that represent RGBA values for an image of a given size created from SVG
PixelsFromSvg(String, Int32, Int32, Boolean, Color, Boolean)
 Get array of bytes that represent RGBA values for an image of a given size created from SVG
Top
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace