RhinoCommon API
SubD.CreateFromMesh Method
Overload List
Name | Description
CreateFromMesh(Mesh)
 Create a new SubD from a mesh.
CreateFromMesh(Mesh, SubDCreationOptions)
 Create a new SubD from a mesh.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace