RhinoCommon API
ViewportInfo Constructor
Overload List
Name | Description
ViewportInfo()
 Initializes a new instance.
ViewportInfo(RhinoViewport)
 Copies all of the ViewportInfo data from an existing RhinoViewport.
ViewportInfo(ViewportInfo)
 Initializes a new instance by copying values from another instance.
Top
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace