RhinoCommon API
Font Constructor
Overload List
Name | Description
Font(String)
Initializes a new instance of the Font class
Font(String, Font.FontWeight, Font.FontStyle, Boolean, Boolean)
Initializes a new instance of the Font class
Font(String, Font.FontWeight, Font.FontStyle, Font.FontStretch, Boolean, Boolean)
Initializes a new instance of the Font class
Top
See Also
Reference
Font Class
Rhino.DocObjects Namespace