RhinoCommon API
Mesh.SelfSplit Method
Overload List
Name | Description
SelfSplit(Double)
 Split a mesh with itself.
SelfSplit(MeshSplitOptions)
 Split a mesh with itself.
SelfSplit(Double, Boolean, Boolean, TextLog, CancellationToken, IProgress<Double>)
 Split a mesh with itself.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace