RhinoCommon API
Surface.IsSphere Method
Overload List
Name | Description
IsSphere()
 Determines if the surface is a portion of a sphere within RhinoMath.ZeroTolerance.
IsSphere(Double)
 Determines if the surface is a portion of a sphere within a given tolerance.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace