RhinoCommon API
TransformObjectList.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the TransformObjectList
Dispose(Boolean)
Releases the unmanaged resources used by the TransformObjectList and optionally releases the managed resources
Top
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace