RhinoCommon API
Curve.NormalizedLengthParameters Method
Overload List
Name | Description
NormalizedLengthParameters(Double[], Double)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve. A fractional tolerance of 1e-8 is used in this version of the function.
NormalizedLengthParameters(Double[], Double, Interval)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve. A fractional tolerance of 1e-8 is used in this version of the function.
NormalizedLengthParameters(Double[], Double, Double)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
NormalizedLengthParameters(Double[], Double, Double, Interval)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace