RhinoCommon API
File3dmObjectTable.AddOrdinateDimension Method
Overload List
Name | Description
AddOrdinateDimension(OrdinateDimension)
 Adds an ordinate dimension object to the 3dm file object table.
AddOrdinateDimension(OrdinateDimension, ObjectAttributes)
 Adds an ordinate dimension object to the 3dm file object table.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace