RhinoCommon API
NurbsCurve Constructor
Overload List
Name | Description
NurbsCurve(NurbsCurve)
 Initializes a NURBS curve by copying its values from another NURBS curve.
NurbsCurve(Int32, Int32)
 Constructs a new NURBS curve with a specific degree and control point count.
NurbsCurve(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
NurbsCurve(Int32, Boolean, Int32, Int32)
 Constructs a new NURBS curve with knot and CV memory allocated.
Top
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace