RhinoCommon API
SimpleArrayGeometryPointer Constructor
Overload List
Name | Description
SimpleArrayGeometryPointer()
 Initializes a new SimpleArrayGeometryPointer instance.
SimpleArrayGeometryPointer(IEnumerable)
 Expects all of the items in the IEnumerable to be GeometryBase types
SimpleArrayGeometryPointer(IEnumerable<GeometryBase>)
 Create an ON_SimpleArray<ON_Geometry*> filled with items in geometry
Top
See Also
Reference
SimpleArrayGeometryPointer Class
Rhino.Runtime.InteropWrappers Namespace