RhinoCommon API
SurfaceCurvature.CreateFromSubD Method
Overload List
Name | Description
CreateFromSubD(SubD, SubDComponentParameter)
 Create a SurfaceCurvature by evaluating a SubD's surface (its limit surface) at a surface parameter.
CreateFromSubD(SubD, SubDComponentParameter, SubD.ExtraordinaryVertexCurvature)
 Create a SurfaceCurvature by evaluating a SubD's surface (its limit surface) at a surface parameter, choosing what to report exactly on an extraordinary vertex.
Top
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace