RhinoCommon API
ComponentIndex.Equals Method
Overload List
Name | Description
Equals(ComponentIndex)
 Determines whether the specified ComponentIndex is equal to the current ComponentIndex, comparing by value.
Equals(Object)
 Determines whether the specified Object is equal to the current ComponentIndex, comparing by value.
 (Overrides ValueType.Equals(Object).)
Top
See Also
Reference
ComponentIndex Structure
Rhino.Geometry Namespace