RhinoCommon API
Centermark.Create Method
Overload List
Name | Description
Create(DimensionStyle, Plane, Curve, Double)
Creates a new center mark dimension.
Create(DimensionStyle, Plane, Point3d, Double)
Creates a new center mark dimension.
Top
See Also
Reference
Centermark Class
Rhino.Geometry Namespace