RhinoCommon API
BoundingBox Constructor
Overload List
Name | Description
BoundingBox(IEnumerable<Point3d>)
 Constructs a bounding box from a collection of points.
BoundingBox(IEnumerable<Point3d>, Transform)
 Constructs a bounding box from a collection of points.
BoundingBox(Point3d, Point3d)
 Constructs a new bounding box from two corner points.
BoundingBox(Double, Double, Double, Double, Double, Double)
 Constructs a bounding box from numeric extremes.
Top
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace