RhinoCommon API
Leader Constructor
Overload List
Name | Description
Leader()
 Constructor
Leader(SerializationInfo, StreamingContext)
 Protected serialization constructor for internal use.
Top
See Also
Reference
Leader Class
Rhino.Geometry Namespace