RhinoCommon API
LengthMassProperties.Sum Method
Overload List
Name | Description
Sum(LengthMassProperties)
 Sum mass properties together to get an aggregate mass.
Sum(IEnumerable<LengthMassProperties>, Boolean)
 Sum mass properties together to get an aggregate mass.
Top
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace