RhinoCommon API
ArchivableDictionary.GetEnumValue Method
Overload List
Name | Description
GetEnumValue<T>()
 Get an enum value
GetEnumValue<T>(String)
 Get an enum value from the dictionary using a custom key.
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace