RhinoCommon API
LayerTable.FindName Method
Overload List
Name | Description
FindName(String)
 Finds the layer with a given name. If multiple layers exist that have the same name, the first match layer index will be returned.
Deleted layers have no name.
The default layer is NOT included in the search. If required, use the overload with startIndex input.
FindName(String, Int32)
 Finds the next layer that has an index equal or higher than the searched value.
Search in case-insensitive.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace