RhinoCommon API
OptionString.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the OptionString
Dispose(Boolean)
Releases the unmanaged resources used by the OptionString and optionally releases the managed resources
Top
See Also
Reference
OptionString Class
Rhino.Input.Custom Namespace