RhinoCommon API
ViewTable.AddPageView Method
Overload List
Name | Description
AddPageView(String)
 Constructs a new page view with a given title and, at the same time, adds it to the list. On Windows the new page view becomes the active view; on Mac the active view does not change. Use the overload with a setActive parameter for behavior that is consistent across platforms.
AddPageView(String, Boolean)
 Constructs a new page view with a given title and, at the same time, adds it to the list.
AddPageView(String, Double, Double)
 Constructs a new page view with a given title and size and, at the same time, adds it to the list. On Windows the new page view becomes the active view; on Mac the active view does not change. Use the overload with a setActive parameter for behavior that is consistent across platforms.
AddPageView(String, Double, Double, Boolean)
 Constructs a new page view with a given title and size and, at the same time, adds it to the list.
Top
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace