RhinoCommon API
RenderPrimitive.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the RenderPrimitive
Dispose(Boolean)
Releases the unmanaged resources used by the RenderPrimitive and optionally releases the managed resources
Top
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace