RhinoCommon API
PreviewAppearance.ToMetaData Method
Overload List
Name | Description
ToMetaData()
 Copy PreviewAppearance to MetaData
ToMetaData(MetaDataProxy)
 Copy PreviewAppearance to MetaData
Top
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace