RhinoCommon API
RhinoDoc.Import Method
Overload List
Name | Description
Import(String)
 Import geometry into a RhinoDoc from a file. This can be any file format that Rhino can import
Import(String, ArchivableDictionary)
 Import geometry into a RhinoDoc from a file. This can be any file format that Rhino can import
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace