RhinoCommon API
Brep.CreateTrimmedSurface Method
Overload List
Name | Description
CreateTrimmedSurface(BrepFace, Surface) |  Obsolete.
 Constructs a Brep using the trimming information of a brep face and a surface. Surface must be roughly the same shape and in the same location as the trimming brep face.
CreateTrimmedSurface(BrepFace, Surface, Double)
 Constructs a Brep using the trimming information of a brep face and a surface. Surface must be roughly the same shape and in the same location as the trimming brep face.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace