RhinoCommon API
AnnotationBase.GetBoundingBox Method
Overload List
Name | Description
GetBoundingBox(Transform)
 Aligned bounding box solver. Gets the world axis aligned bounding box for the transformed geometry.
 (Overrides GeometryBase.GetBoundingBox(Transform).)
Top
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace