RhinoCommon API
NotLicensedException Constructor
Overload List
Name | Description
NotLicensedException()
 Default constructor
NotLicensedException(String)
 Create a new instance with a custom message
NotLicensedException(String, Exception)
 Create a new instance with a custom message and an inner exception
Top
See Also
Reference
NotLicensedException Class
Rhino.Runtime Namespace