RhinoCommon API
Vector3d.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines whether the specified System.Object is a Vector3d and has the same values as the present vector.
 (Overrides ValueType.Equals(Object).)
Equals(Vector3d)
 Determines whether the specified vector has the same value as the present vector.
Top
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace