RhinoCommon API
TextLog.Print Method
Overload List
Name | Description
Print(String)
 Send text to the text log
Print(String, Object)
 Send formatted text to the text log
Print(String, Object, Object)
 Send formatted text to the text log
Top
See Also
Reference
TextLog Class
Rhino.FileIO Namespace