RhinoCommon API
DisplayPipeline.DrawInstanceDefinitionShaded Method
Overload List
Name | Description
DrawInstanceDefinitionShaded(InstanceDefinition, DisplayMaterial)
 Draws a shaded InstanceDefinition.
DrawInstanceDefinitionShaded(InstanceDefinition, DisplayMaterial, Transform)
 Draws a shaded InstanceDefinition.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace