RhinoCommon API
RhinoDoc.Purge Method
Overload List
Name | Description
Purge(PurgeFilter)
 Purges unused table objects from this document, the same way the Purge command does.
Purge(PurgeFilter, Boolean)
 Purges unused table objects from this document, the same way the Purge command does.
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace