RhinoCommon API
PersistentSettings.TryGetSize Method
Overload List
Name | Description
TryGetSize(String, Size)
TryGetSize(String, Size, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace