RhinoCommon API
FileCsvDocument.TryGetGuid Method
Overload List
Name | Description
TryGetGuid(Int32, Int32, Guid)
 Retrieves the value of a cell as a globally unique identifier. Accepts any of the formats understood by TryParse(String, Guid) (with or without hyphens or braces).
TryGetGuid(String, Int32, Guid)
 Retrieves the value of a cell as a globally unique identifier, addressing the column by header name.
Top
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace