RhinoCommon API
Interop.NativeNonConstPointer Method
Overload List
Name | Description
NativeNonConstPointer(DisplayPipeline)
 Get CRhinoDisplayPipeline* for a DisplayPipeline instance
NativeNonConstPointer(GetPoint)
 Get CRhinoGetPoint* from a GetPoint instance
NativeNonConstPointer(RhinoViewport)
 Get CRhinoViewport* from a RhinoViewport instance
NativeNonConstPointer(ViewCaptureSettings)
 Get a CRhinoPrintInfo* for a given ViewCaptureSettings class
NativeNonConstPointer(ViewportInfo)
 Get ON_Viewport* from a ViewportInfo instance
Top
See Also
Reference
Interop Class
Rhino.Runtime Namespace