RhinoCommon API
TextEntity Constructor
Overload List
Name | Description
TextEntity()
 Initializes a new instance of the TextEntity class.
TextEntity(SerializationInfo, StreamingContext)
 Protected constructor used in serialization
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace