RhinoCommon API
RenderTexture.CreateEvaluator Method
Overload List
Name | Description
CreateEvaluator() |  Obsolete.
 Constructs a texture evaluator. This is an independent lightweight object capable of evaluating texture color throughout uvw space. May be called from within a rendering shade pipeline.
CreateEvaluator(RenderTexture.TextureEvaluatorFlags)
 Constructs a texture evaluator. This is an independent lightweight object capable of evaluating texture color throughout uvw space. May be called from within a rendering shade pipeline.
Top
See Also
Reference
RenderTexture Class
Rhino.Render Namespace