RhinoCommon API
MeshFaceList.DeleteFaces Method
Overload List
Name | Description
DeleteFaces(IEnumerable<Int32>)
 Removes a collection of faces from the mesh without affecting the remaining geometry.
DeleteFaces(IEnumerable<Int32>, Boolean)
 Removes a collection of faces from the mesh without affecting the remaining geometry.
Top
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace