RhinoCommon API
Brep.CreateVariationalPatch Method
Overload List
Name | Description
CreateVariationalPatch(IEnumerable<Brep.CurveConstraint>, IEnumerable<Brep.CurveConstraint>, IEnumerable<Brep.PointConstraint>, Brep.VariationalPatchSettings, Boolean, CancellationToken, IProgress<Double>, Brep.VariationalPatchResult)
 Create a patch using variational approach
CreateVariationalPatch(RhinoDoc, IEnumerable<Brep.CurveConstraint>, IEnumerable<Brep.CurveConstraint>, IEnumerable<Brep.PointConstraint>, Brep.VariationalPatchSettings, Boolean, CancellationToken, IProgress<Double>, Brep.VariationalPatchResult)
 Create a patch using variational approach
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace