RhinoCommon API
Point3d.Multiply Method
Overload List
Name | Description
Multiply(Double, Point3d)
 Multiplies a Point3d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Point3d, Double)
 Multiplies a Point3d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Top
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace