RhinoCommon API
Curve.Split Method
Overload List
Name | Description
Split(Double)
 Splits (divides) the curve at the specified parameter. The parameter must be in the interior of the curve's domain.
Split(IEnumerable<Double>)
 Splits (divides) the curve at a series of specified parameters. The parameter must be in the interior of the curve domain.
Split(Brep, Double) |  Obsolete.
 Splits a curve into pieces using a polysurface.
Split(Surface, Double) |  Obsolete.
 Splits a curve into pieces using a surface.
Split(Brep, Double, Double)
 Splits a curve into pieces using a polysurface.
Split(Plane, Double, Double)
 Splits a curve into pieces using a cutting plane.
Split(Surface, Double, Double)
 Splits a curve into pieces using a surface.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace