RhinoCommon API
Layer.GetParentName Method
Overload List
Name | Description
GetParentName(Layer)
 Get a layer's "parent" path name
GetParentName(String)
 Get a layer's "parent" path name
Top
See Also
Reference
Layer Class
Rhino.DocObjects Namespace