RhinoCommon API
DisplayPipeline.DrawPoints Method
Overload List
Name | Description
DrawPoints(DisplayPointSet)
DrawPoints(DisplayPointSet, DisplayPointAttributes, DisplayPointAttributes)
DrawPoints(IEnumerable<Point3d>, PointStyle, Int32, Color)
Draw a set of points with a given radius, style and color.
DrawPoints(IEnumerable<Point3d>, PointStyle, Single, Color)
Draw a set of points with a given radius, style and color.
DrawPoints(IEnumerable<Point3d>, PointStyle, Color, Color, Single, Single, Single, Single, Boolean, Boolean)
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace