RhinoCommon API
Curve.CreateTweenCurves Method
Overload List
Name | Description
CreateTweenCurves(Curve, Curve, Int32) |  Obsolete.
 Creates curves between two open or closed input curves. Uses the control points of the curves for finding tween curves. That means the first control point of first curve is matched to first control point of the second curve and so on. There is no matching of curves direction. Caller must match input curves direction before calling the function.
CreateTweenCurves(Curve, Curve, Int32, Double)
 Creates curves between two open or closed input curves. Uses the control points of the curves for finding tween curves. That means the first control point of first curve is matched to first control point of the second curve and so on. There is no matching of curves direction. Caller must match input curves direction before calling the function.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace