RhinoCommon API
Surface.CreateRollingBallFillet Method
Overload List
Name | Description
CreateRollingBallFillet(Surface, Surface, Double, Double)
 Constructs a rolling ball fillet between two surfaces.
CreateRollingBallFillet(Surface, Point2d, Surface, Point2d, Double, Double)
 Constructs a rolling ball fillet between two surfaces.
CreateRollingBallFillet(Surface, Boolean, Surface, Boolean, Double, Double)
 Constructs a rolling ball fillet between two surfaces.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace