RhinoCommon API
SimpleArrayByte Constructor
Overload List
Name | Description
SimpleArrayByte()
 Initializes a new SimpleArrayByte class.
SimpleArrayByte(IEnumerable<Byte>)
 Initializes a new SimpleArrayByte class
SimpleArrayByte(Int32)
 Initializes a new SimpleArrayByte class. Initial size of the array - all values are set to zero.
SimpleArrayByte(SimpleArrayByte)
 Initializes a new SimpleArrayByte with the contents of another SimpleArrayByte.
Top
See Also
Reference
SimpleArrayByte Class
Rhino.Runtime.InteropWrappers Namespace