RhinoCommon API
Brep.SplitDisjointPieces Method
Overload List
Name | Description
SplitDisjointPieces(Brep)
 Separates, or splits, a disjoint Brep into separate Breps.
SplitDisjointPieces(Brep, List<Int32[]>)
 Separates, or splits, a disjoint Brep into separate Breps.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace