RhinoCommon API
TextFields.CurveLength Method
Overload List
Name | Description
CurveLength(String)
 Get length of a curve given a string id
CurveLength(String, String)
 Get length of a curve given a string id in a specified unit system. UnitSystem enumeration as string
Top
See Also
Reference
TextFields Class
Rhino.Runtime Namespace