RhinoCommon API
PointCloud Constructor
Overload List
Name | Description
PointCloud()
 Initializes a new instance of the PointCloud class that is empty.
PointCloud(IEnumerable<Point3d>)
 Initializes a new instance of the PointCloud class, copying the content from a set of points.
PointCloud(PointCloud)
 Initializes a new instance of the PointCloud class, copying (Merge) the content of another point cloud.
PointCloud(SerializationInfo, StreamingContext)
 Binds with the Rhino default serializer to support object persistence.
Top
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace