RhinoCommon API
Utilities.FindFile Method
Overload List
Name | Description
FindFile(RhinoDoc, String)
 Finds a file and also handles network shares.
Remarks
This is a replacement for CRhinoFileUtilities::FindFile().
FindFile(RhinoDoc, String, Boolean)
 Finds a file and also handles network shares.
Remarks
This is a replacement for CRhinoFileUtilities::FindFile().
Top
See Also
Reference
Utilities Class
Rhino.Render Namespace