RhinoCommon API
Intersection.MeshRay Method
Overload List
Name | Description
MeshRay(Mesh, Ray3d)
Finds the first intersection of a ray with a mesh.
MeshRay(Mesh, Ray3d, Int32[])
Finds the first intersection of a ray with a mesh.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace