RhinoCommon API
SimpleArray2dex Constructor
Overload List
Name | Description
SimpleArray2dex()
 Initializes a new SimpleArray2dex class.
SimpleArray2dex(IEnumerable<IndexPair>)
 Initializes a new SimpleArray2dex class
Top
See Also
Reference
SimpleArray2dex Class
Rhino.Runtime.InteropWrappers Namespace