RhinoCommon API
DimStyleTable.GetUnusedStyleName Method
Overload List
Name | Description
GetUnusedStyleName()
 Get a unique name for a style that does not already exist in the DimStyle table
GetUnusedStyleName(String)
 Get a unique name for a dimension style that does not already exist in the DimStyle table
Top
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace