RhinoCommon API
FileCsvDocument.TryGetDateTime Method
Overload List
Name | Description
TryGetDateTime(Int32, Int32, DateTime)
 Retrieves the value of a cell as a date and time, parsed with the invariant culture and RoundtripKind (so ISO 8601 values, including those written by Set(Int32, Int32, DateTime), round-trip).
TryGetDateTime(String, Int32, DateTime)
 Retrieves the value of a cell as a date and time, addressing the column by header name.
Top
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace