RhinoCommon API
HatchPattern.WriteToFile Method
Overload List
Name | Description
WriteToFile(String, HatchPattern)
 Writes a hatch pattern defintion to a file.
WriteToFile(String, IEnumerable<HatchPattern>)
 Writes one or more hatch pattern defintions to a file.
Top
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace