RhinoCommon API
RhinoView.CaptureToBitmap Method
Overload List
Name | Description
CaptureToBitmap()
 Capture View contents to a bitmap.
CaptureToBitmap(DisplayModeDescription)
 Capture View contents to a bitmap using a display mode description to define how drawing is performed.
CaptureToBitmap(DisplayPipelineAttributes)
 Captures view contents to a bitmap using display attributes to define how drawing is performed.
CaptureToBitmap(Size)
 Capture View contents to a bitmap.
CaptureToBitmap(Size, DisplayModeDescription)
 Capture View contents to a bitmap using a display mode description to define how drawing is performed.
CaptureToBitmap(Size, DisplayPipelineAttributes)
 Capture View contents to a bitmap using display attributes to define how drawing is performed.
CaptureToBitmap(Boolean, Boolean, Boolean)
 Captures the view contents to a bitmap allowing for visibility of grid and axes.
CaptureToBitmap(Size, Boolean, Boolean, Boolean)
 Captures a part of the view contents to a bitmap allowing for visibility of grid and axes.
Top
See Also
Reference
RhinoView Class
Rhino.Display Namespace