RhinoCommon API
CurveObject.GetLinetypeSegments Method
Overload List
Name | Description
GetLinetypeSegments()
 Converts the linetype pattern of the curve into curve segments and points based on the active Rhino viewport.
GetLinetypeSegments(RhinoViewport)
 Converts the linetype pattern of the curve into curve segments and points based on the specified Rhino viewport.
Top
See Also
Reference
CurveObject Class
Rhino.DocObjects Namespace