RhinoCommon API
MarkupTable.Delete Method
Overload List
Name | Description
Delete(Markup)
 Deletes a markup.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(IEnumerable<Int32>, Boolean)
 Delete multiple markups.
Delete(Int32, Boolean)
 Deletes a markup.
Delete(IEnumerable<Int32>, Boolean, Int32)
 Delete multiple markups.
Top
See Also
Reference
MarkupTable Class
Rhino.DocObjects.Tables Namespace