RhinoCommon API
ScaleValue.Create Method
Overload List
Name | Description
Create(String, StringParserSettings)
 Create from string
Create(LengthValue, LengthValue, ScaleValue.ScaleStringFormat)
 Create from 2 length values
Top
See Also
Reference
ScaleValue Class
Rhino Namespace