RhinoCommon API
BoundingBox.Contains Method
Overload List
Name | Description
Contains(BoundingBox)
 Determines whether this bounding box contains another bounding box.
This is the same as calling Contains(box,false).
Contains(Point3d)
 Tests a point for bounding box inclusion. This is the same as calling Contains(point, false)
Contains(BoundingBox, Boolean)
 Determines whether this bounding box contains another bounding box.
The user can choose how to treat bounding boxes with coincident surfaces.
Contains(Point3d, Boolean)
 Tests a point for BoundingBox inclusion.
Top
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace