RhinoCommon API
Mesh.PointAt Method
Overload List
Name | Description
PointAt(MeshPoint)
 Evaluate a mesh at a set of barycentric coordinates.
PointAt(Int32, Double, Double, Double, Double)
 Evaluates a mesh at a set of barycentric coordinates. Barycentric coordinates must be assigned in accordance with the rules as defined by MeshPoint.T.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace