RhinoCommon API
RhinoObject.SupportsRenderPrimitiveList Method
Overload List
Name | Description
SupportsRenderPrimitiveList(ViewportInfo, DisplayPipelineAttributes) |  Obsolete.
 Determines if custom render meshes will be built for a particular object.
SupportsRenderPrimitiveList(ViewportInfo, Boolean) |  Obsolete.
 Determines if custom render meshes will be built for a particular object.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace