RhinoCommon API
Brep.CreateBooleanDifference Method
Overload List
Name | Description
CreateBooleanDifference(Brep, Brep, Double)
 Compute the Solid Difference of two Breps.
CreateBooleanDifference(IEnumerable<Brep>, IEnumerable<Brep>, Double)
 Compute the Solid Difference of two sets of Breps.
CreateBooleanDifference(Brep, Brep, Double, Boolean)
 Compute the Solid Difference of two Breps.
CreateBooleanDifference(IEnumerable<Brep>, IEnumerable<Brep>, Double, Boolean)
 Compute the Solid Difference of two sets of Breps.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace