RhinoCommon API
PersistentSettings.TryGetBool Method
Overload List
Name | Description
TryGetBool(String, Boolean)
TryGetBool(String, Boolean, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace