RhinoCommon API
Surface.Reverse Method
Overload List
Name | Description
Reverse(Int32)
 Reverses parameterization Domain changes from [a,b] to [-b,-a]
Reverse(Int32, Boolean)
 Same as Reverse, but if inPlace is set to true this Surface is modified instead of a new copy being created.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace