RhinoCommon API
ArchivableDictionary.GetVector3d Method
Overload List
Name | Description
GetVector3d(String)
 Get value as Vector3d, will only succeed if value was created using Set(string key, Vector3d value)
GetVector3d(String, Vector3d)
 Get value as Vector3d, will return defaultValue unless value was created using Set(string key, Vector3d value)
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace