RhinoCommon API
SceneServerData.Dispose Method
Overload List
Name | Description
Dispose()
 Dispose for SceneServerData
Dispose(Boolean)
 Dispose for SceneServerData
Top
See Also
Reference
SceneServerData Class
Rhino.Render Namespace