RhinoCommon API
ControlPoint Constructor
Overload List
Name | Description
ControlPoint(Point3d)
 Constructs a new world 3-D, or Euclidean, control point. The 4-D representation of this is (x, y, z, 1.0).
ControlPoint(Point4d)
 Constructs a new homogeneous control point, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
ControlPoint(Point3d, Double)
 Constructs a control point from a world 3-D, or Euclidean, location and a weight. The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
ControlPoint(Double, Double, Double)
 Constructs a new world 3-D, or Euclidean, control point. The 4-D representation is (x, y, z, 1.0).
ControlPoint(Double, Double, Double, Double)
 Constructs a new homogeneous control point, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
Top
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace