RhinoCommon API
ObjectTable.TransformWithHistory Method
Overload List
Name | Description
TransformWithHistory(Guid, Transform)
 Constructs a new object that is the transformation of the existing object and records history of the transformation if history recording is turned on. If history recording is not enabled, this function will act the same as Transform(objectId, xform, false)
TransformWithHistory(ObjRef, Transform)
 Constructs a new object that is the transformation of the existing object and records history of the transformation if history recording is turned on. If history recording is not enabled, this function will act the same as Transform(objref, xform, false)
TransformWithHistory(RhinoObject, Transform)
 Constructs a new object that is the transformation of the existing object and records history of the transformation if history recording is turned on. If history recording is not enabled, this function will act the same as Transform(obj, xform, false)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace