RhinoCommon API
HostUtils.DebugString Method
Overload List
Name | Description
DebugString(String)
 Prints a debug message to the Rhino Command Line. The message will only appear if the SendDebugToCommandLine property is set to true.
DebugString(String, Object[])
 Prints a debug message to the Rhino Command Line. The message will only appear if the SendDebugToCommandLine property is set to true.
Top
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace