RhinoCommon API
RhinoObject.SetTextureMapping Method
Overload List
Name | Description
SetTextureMapping(Int32, TextureMapping)
SetTextureMapping(Int32, TextureMapping, Transform)
 Sets texture mapping and mapping object transform for a channel
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace