RhinoCommon API
DracoCompression.Compress Method
Overload List
Name | Description
Compress(Mesh)
 Compress a mesh using default compression options.
Compress(PointCloud)
 Compress a point cloud
Compress(Mesh, DracoCompressionOptions)
 Compress a mesh
Compress(PointCloud, DracoCompressionOptions)
 Compress a point cloud
Top
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace