RhinoCommon API
PersistentSettings.SetDefault Method
Overload List
Name | Description
SetDefault(String, Point3d)
SetDefault(String, Boolean)
SetDefault(String, Byte)
SetDefault(String, Char)
SetDefault(String, KeyValuePair<String, String>[])
SetDefault(String, DateTime)
SetDefault(String, Double)
SetDefault(String, Color)
SetDefault(String, Point)
SetDefault(String, Rectangle)
SetDefault(String, Size)
SetDefault(String, Guid)
SetDefault(String, Int32)
SetDefault(String, Nullable<Color>)
SetDefault(String, String)
SetDefault(String, String[])
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace