RhinoCommon API
ObjectAttributes.SetObjectFrame Method
Overload List
Name | Description
SetObjectFrame(Plane)
SetObjectFrame(Transform)
Top
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace