RhinoCommon API
SimpleArraySubDPointer.Dispose Method
Overload List
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
Releases the unmanaged resources used by the SimpleArraySubDPointer and optionally releases the managed resources
Top
See Also
Reference
SimpleArraySubDPointer Class
Rhino.Runtime.InteropWrappers Namespace