RhinoCommon API
File3dmObjectTable.AddClippingPlane Method
Overload List
Name | Description
AddClippingPlane(Plane, Double, Double, IEnumerable<Guid>)
 Adds a clipping plane object to Rhino.
AddClippingPlane(Plane, Double, Double, Guid)
 Adds a clipping plane object to Rhino.
AddClippingPlane(Plane, Double, Double, IEnumerable<Guid>, ObjectAttributes)
 Adds a clipping plane object to Rhino.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace