RhinoCommon API
RhinoObject.MeshObjects Method
Overload List
Name | Description
MeshObjects(IEnumerable<RhinoObject>, MeshingParameters, Mesh[], ObjectAttributes[])
Meshes Rhino objects.
MeshObjects(IEnumerable<RhinoObject>, MeshingParameters, Mesh[], ObjectAttributes[], Boolean)
Meshes Rhino objects.
MeshObjects(IEnumerable<RhinoObject>, MeshingParameters, Boolean, Mesh[], ObjectAttributes[])
Meshes Rhino objects.
MeshObjects(IEnumerable<RhinoObject>, MeshingParameters, Int32, Transform, Mesh[], ObjectAttributes[])
Meshes Rhino objects.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace