RhinoCommon API
TextFields.TryFormat Method
Overload List
Name | Description
TryFormat(String, RhinoDoc, String)
 Formats the contents of a text string with field expressions and returns the result.
 The text is evaluated with no object context, which suits fields that read only the document, such as Date or ModelUnits. Fields that read the object itself or the block instance enclosing it - user text, for example - cannot resolve this way and will come back empty; use the overload that takes the object and its parents for those.
TryFormat(String, RhinoDoc, RhinoObject, RhinoObject, InstanceObject, String)
 Formats the contents of a text string with field expressions and returns the result, evaluating it against a specific object and the block instances that enclose it.
Top
See Also
Reference
TextFields Class
Rhino.Runtime Namespace