RhinoCommon API
PointCloud.GetRandomSubsample Method
Overload List
Name | Description
GetRandomSubsample(UInt32)
 Returns a random subsample of a point cloud.
GetRandomSubsample(UInt32, CancellationToken, IProgress<Double>)
 Returns a random subsample of a point cloud.
Top
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace