RhinoCommon API
Brep.ClosestPoint Method
Overload List
Name | Description
ClosestPoint(Point3d)
 Finds a point on the brep that is closest to testPoint.
ClosestPoint(Point3d, Point3d, ComponentIndex, Double, Double, Double, Vector3d)
 Finds a point on the Brep that is closest to testPoint. The method searches all Brep faces looking for the one closest to testPoint. When found, if the closest point falls on the inactive region of the face, then the method finds the face's edge that is closest to testPoint.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace