RhinoCommon API
DimensionStyle.CreatePreviewBitmap Method
Overload List
Name | Description
CreatePreviewBitmap(Int32, Int32)
CreatePreviewBitmap(Int32, Int32, Boolean)
Top
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace