RhinoCommon API
DimStyleTable.Modify Method
Overload List
Name | Description
Modify(DimensionStyle, AnnotationBase)
Modify(DimensionStyle, Guid, Boolean)
Modifies dimension style settings.
Modify(DimensionStyle, Int32, Boolean)
Modifies dimension style settings.
Top
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace