RhinoCommon API
Transform2d.Rotation Method
Overload List
Name | Description
Rotation(Double)
 Constructs a new rotation transformation with the origin as the rotation center.
Rotation(Double, Point2d)
 Constructs a new rotation transformation with a specified rotation center.
Rotation(Double, Double, Point2d)
 Constructs a new rotation transformation from the sine and cosine of an angle and a specified rotation center.
Rotation(Vector2d, Vector2d, Point2d)
 Constructs the rotation that maps one direction onto another while fixing a rotation center.
Top
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace