RhinoCommon API
PageViewGroupTable.Delete Method
Overload List
Name | Description
Delete(PageViewGroup)
 Deletes a page view group.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Guid, Boolean)
 Deletes a page view group.
Delete(Int32, Boolean)
 Deletes a page view group.
Delete(PageViewGroup, Boolean)
 Deletes a page view group.
Top
See Also
Reference
PageViewGroupTable Class
Rhino.DocObjects.Tables Namespace