RhinoCommon API
TextureEvaluator.GetColor Method
Overload List
Name | Description
GetColor(Point3d, Vector3d, Vector3d)
 Get the color of the texture at a particular point in uvw space. May be called from within a rendering shade pipeline. note For ray differentials see Pharr Humphreys, "Physically Based Rendering", chapter 11.
GetColor(Point3d, Vector3d, Vector3d, Color4f)
 Optimized version of GetColor for callers. Much faster in the case of a native (C++) evaluator.
Top
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace