RhinoCommon API
PreviewJobSignature Constructor
Overload List
Name | Description
PreviewJobSignature()
 Preview Job Signature constructor
PreviewJobSignature(IntPtr)
 Preview Job Signature constructor
PreviewJobSignature(Int32, Int32, UInt32) |  Obsolete.
 Preview Job Signature constructor
PreviewJobSignature(Int32, Int32, UInt32, Guid)
Initializes a new instance of the PreviewJobSignature class
Top
See Also
Reference
PreviewJobSignature Class
Rhino.Render Namespace