RhinoCommon API
ViewCapture.CaptureToBitmap Method
Overload List
Name | Description
CaptureToBitmap(RhinoView)
CaptureToBitmap(ViewCaptureSettings)
Top
See Also
Reference
ViewCapture Class
Rhino.Display Namespace