RhinoCommon API
MeshVertexList.AddVertices Method
Overload List
Name | Description
AddVertices(IEnumerable<Point3d>)
 Adds a series of new vertices to the end of the vertex list.
This overload accepts double-precision points.
AddVertices(IEnumerable<Point3f>)
 Adds a series of new vertices to the end of the vertex list.
This overload accepts single-precision points.
Top
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace