RhinoCommon API
ObjectTable.AddBox Method
Overload List
Name | Description
AddBox(Box)
 Adds a box to the object table.
AddBox(Box, ObjectAttributes)
 Adds a box to the object table.
AddBox(Box, ObjectAttributes, HistoryRecord, Boolean)
 Adds a box to the object table, as an extrusion.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace