RhinoCommon API
HostUtils.ExceptionReport Method
Overload List
Name | Description
ExceptionReport(Exception)
 Informs RhinoCommon of an exception that has been handled but that the developer wants to screen.
ExceptionReport(String, Exception)
 Informs RhinoCommon of an exception that has been handled but that the developer wants to screen.
Top
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace