RhinoCommon API
Surface.IsPlanar Method
Overload List
Name | Description
IsPlanar()
 Tests a surface to see if it is planar to zero tolerance.
IsPlanar(Double)
 Tests a surface to see if it is planar to a given tolerance.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace