RhinoCommon API
RhinoGet.GetPointOnMesh Method
Overload List
Name | Description
GetPointOnMesh(Guid, String, Boolean, Point3d) |  Obsolete.
 Gets a point constrained to an existing mesh in the document.
GetPointOnMesh(MeshObject, String, Boolean, Point3d) |  Obsolete.
 Gets a point constrained to an existing mesh in the document.
GetPointOnMesh(RhinoDoc, MeshObject, String, Boolean, Point3d)
 Gets a point constrained to an existing mesh in the document.
GetPointOnMesh(RhinoDoc, Guid, String, Boolean, Point3d)
 Gets a point constrained to an existing mesh in the document.
Top
See Also
Reference
RhinoGet Class
Rhino.Input Namespace