RhinoCommon API
IntersectionEvent.CompareEquivalent Method
Overload List
Name | Description
CompareEquivalent(IntersectionEvent, IntersectionEvent, Double)
 Compare intersection events.
CompareEquivalent(IntersectionEvent, IntersectionEvent, Double, TextLog)
 Compare intersection events.
Top
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace