RhinoCommon API
PlaneSurface.CreateThroughBox Method
Overload List
Name | Description
CreateThroughBox(Plane, BoundingBox)
 Create a plane that contains the intersection of a bounding box.
CreateThroughBox(Line, Vector3d, BoundingBox)
 Create a plane that contains the intersection of a bounding box.
Top
See Also
Reference
PlaneSurface Class
Rhino.Geometry Namespace