RhinoCommon API
PersistentSettings.GetColor Method
Overload List
Name | Description
GetColor(String)
GetColor(String, Color)
GetColor(String, Nullable<Color>)
GetColor(String, Color, IEnumerable<String>)
GetColor(String, Nullable<Color>, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace