RhinoCommon API
RenderContentType.NewContentFromTypeId Method
Overload List
Name | Description
NewContentFromTypeId(Guid)
 Create a new content specified by the Guid. This function can be used to create temporary content, as it calls ::RhRdkContentFactories().NewContentFromType().
NewContentFromTypeId(Guid, RhinoDoc)
Top
See Also
Reference
RenderContentType Class
Rhino.Render Namespace