RhinoCommon API
Unroller.FollowingGeometryIndex Method
Overload List
Name | Description
FollowingGeometryIndex(Curve)
 Given an unrolled curve, returns the index of the source, or following curve.
FollowingGeometryIndex(TextDot)
 Given an unrolled text dot, returns the index of the source, or following text dot.
Top
See Also
Reference
Unroller Class
Rhino.Geometry Namespace