RhinoCommon API
ObjectTable.Unlock Method
Overload List
Name | Description
Unlock(Guid, Boolean)
 If Object().IsLocked() is true, then the object will be returned to normal (visible and selectable) mode.
Unlock(ObjRef, Boolean)
 If objref.Object().IsLocked() is true, then the object will be returned to normal (visible and selectable) mode.
Unlock(RhinoObject, Boolean)
 If obj.IsLocked() is true, then the object will be returned to normal (visible and selectable) mode.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace