RhinoCommon API
Decal.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the Decal
Dispose(Boolean)
Releases the unmanaged resources used by the Decal and optionally releases the managed resources
Top
See Also
Reference
Decal Class
Rhino.Render Namespace