RhinoCommon API
PersistentSettings.GetByte Method
Overload List
Name | Description
GetByte(String)
GetByte(String, Byte)
GetByte(String, Byte, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace