RhinoCommon API
HatchPatternTable.Delete Method
Overload List
Name | Description
Delete(HatchPattern)
 Deletes a hatch pattern from the table.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32)
 Deletes a hatch pattern from the table.
Delete(HatchPattern, Boolean)
 Deletes a hatch pattern from the table.
Delete(IEnumerable<Int32>, Boolean)
 Delete multiple hatch patterns.
Delete(Int32, Boolean)
 Deletes a hatch pattern from the table.
Top
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace