RhinoCommon API
ViewCaptureWriter.PushClipPath Method
Overload List
Name | Description
PushClipPath(ViewCaptureWriter.PathPoint[])
PushClipPath(RectangleF)
Top
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace