RhinoCommon API
PlugIn.GetInstalledPlugInNames Method
Overload List
Name | Description
GetInstalledPlugInNames()
 Returns the names of all installed Rhino plug-ins.
GetInstalledPlugInNames(PlugInType, Boolean, Boolean)
 Gets a list of installed plug-in names. The list can be restricted by some filters.
GetInstalledPlugInNames(PlugInType, Boolean, Boolean, Boolean)
 Gets a list of installed plug-in names. The list can be restricted by some filters.
Top
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace