RhinoCommon API
Vector3d.PerpendicularTo Method
Overload List
Name | Description
PerpendicularTo(Vector3d)
 Sets this vector to be perpendicular to another vector. Result is not unitized.
PerpendicularTo(Point3d, Point3d, Point3d)
 Set this vector to be perpendicular to a plane defined by 3 points.
Top
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace