RhinoCommon API
ManifestTable.FindName Method
Overload List
Name | Description
FindName<T>(String, Guid)
 Uses the name to find a model component. The name is the value that is stored in the .Name property. Deleted objects have no name.
FindName(String, ModelComponentType, Guid)
 Uses the name to find a model component. The name is the value that is stored in the .Name property. Deleted objects have no name.
Top
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace