RhinoCommon API
File3dmObjectTable.AddExtrusion Method
Overload List
Name | Description
AddExtrusion(Extrusion)
Adds an extrusion object to Rhino.
AddExtrusion(Extrusion, ObjectAttributes)
Adds an extrusion object to Rhino.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace