RhinoCommon API
ObjectTable.Duplicate Method
Overload List
Name | Description
Duplicate(Guid)
 Same as TransformObject(objref, ON_Xform.Identity, false)
Duplicate(ObjRef)
 Duplicates the object that is referenced by objref.
Same as Transform(objref, Transform.Identity, false)
Duplicate(RhinoObject)
 Duplicates the object that is referenced by obj.
Same as TransformObject(obj, Transform.Identityy, false)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace