RhinoCommon API
Mesh.ColorAt Method
Overload List
Name | Description
ColorAt(MeshPoint)
 Evaluate a mesh color at a set of barycentric coordinates.
ColorAt(Int32, Double, Double, Double, Double)
 Evaluate a mesh normal at a set of barycentric coordinates. Barycentric coordinates must be assigned in accordance with the rules as defined by MeshPoint.T.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace