RhinoCommon API
PolylineCurve.ToPolyline Method
Overload List
Name | Description
ToPolyline()
 Returns the underlying Polyline, or points.
Top
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace