RhinoCommon API
DisplayPipeline.DrawCone Method
Overload List
Name | Description
DrawCone(Cone, Color)
 Draw a wireframe cone.
DrawCone(Cone, Color, Int32)
 Draw a wireframe cone.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace