RhinoCommon API
SimulatedTexture.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the SimulatedTexture
Dispose(Boolean)
Releases the unmanaged resources used by the SimulatedTexture and optionally releases the managed resources
Top
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace