RhinoCommon API
RealtimeDisplayMode.RegisterDisplayModes Method
Overload List
Name | Description
RegisterDisplayModes(PlugIn)
 Find and register classes that derive from RealtimeDisplayMode from the given plug-in.
RegisterDisplayModes(Assembly, Guid)
 Find and register classes that derive from RealtimeDisplayMode from the given plug-in. The plug-in is found in the given assembly
Top
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace