RhinoCommon API
GroupTable.RemapObjects Method
Overload List
Name | Description
RemapObjects(IEnumerable<RhinoObject>)
 Remaps an enumeration of Rhino objects to new groups.
RemapObjects(IEnumerable<RhinoObject>, Dictionary<Int32, Int32>)
 Remaps an enumeration of Rhino objects to new groups.
Top
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace