RhinoCommon API
Point3f.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines whether the specified System.Object is a Point3f and has the same values as the present point.
 (Overrides ValueType.Equals(Object).)
Equals(Point3f)
 Determines whether the specified Point3f has the same values as the present point.
Top
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace