RhinoCommon API
Curve.Contains Method
Overload List
Name | Description
Contains(Point3d) |  Obsolete.
 Computes the relationship between a point and a closed curve region. This curve must be closed or the return value will be Unset. Both curve and point are projected to the World XY plane.
Contains(Point3d, Plane) |  Obsolete.
 Computes the relationship between a point and a closed curve region. This curve must be closed or the return value will be Unset.
Contains(Point3d, Plane, Double)
 Computes the relationship between a point and a closed curve region. This curve must be closed or the return value will be Unset.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace