RhinoCommon API
NurbsSurfacePointList.SetPoint Method
Overload List
Name | Description
SetPoint(Int32, Int32, Point3d)
 Sets a world 3-D, or Euclidean, control point at the given (u, v) index. The 4-D representation is (x, y, z, 1.0).
SetPoint(Int32, Int32, Point4d)
 Sets a homogeneous control point at the given (u, v) index, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
SetPoint(Int32, Int32, Point3d, Double)
 Sets a world 3-D, or Euclidean, control point and weight at a given index. The 4-D representation is (x*w, y*w, z*w, w).
SetPoint(Int32, Int32, Double, Double, Double)
 Sets a world 3-D, or Euclidean, control point at the given (u, v) index. The 4-D representation is (x, y, z, 1.0).
SetPoint(Int32, Int32, Double, Double, Double, Double)
 Sets a homogeneous control point at the given (u, v) index, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
Top
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace