RhinoCommon API
SimpleArrayUint Constructor
Overload List
Name | Description
SimpleArrayUint()
 Initializes a new SimpleArrayInt class.
SimpleArrayUint(IEnumerable<UInt32>)
 Initializes a new SimpleArrayInt class.
Top
See Also
Reference
SimpleArrayUint Class
Rhino.Runtime.InteropWrappers Namespace