RhinoCommon API
ObjectTable.AddLine Method
Overload List
Name | Description
AddLine(Line)
Adds a line object to Rhino.
AddLine(Line, ObjectAttributes)
Adds a line object to Rhino.
AddLine(Point3d, Point3d)
Adds a line object to Rhino.
AddLine(Point3d, Point3d, ObjectAttributes)
Adds a line object to Rhino.
AddLine(Point3d, Point3d, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace