RhinoCommon API
Brep.CreateContourCurves Method
Overload List
Name | Description
CreateContourCurves(Brep, Plane)
 Constructs the contour curves for a brep, using a slicing plane.
CreateContourCurves(Brep, Point3d, Point3d, Double)
 Constructs the contour curves for a brep at a specified interval.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace