RhinoCommon API
Layer.GetLeafName Method
Overload List
Name | Description
GetLeafName(Layer)
 Get a layer name's "leaf" level name
GetLeafName(String)
 Get a layer name's "leaf" level name
Top
See Also
Reference
Layer Class
Rhino.DocObjects Namespace