RhinoCommon API
Interpolator Constructor
Overload List
Name | Description
Interpolator()
 Constructs a new, empty Interpolator.
Interpolator(IEnumerable<Double>)
 Constructs an Interpolator from a collection of numbers.
Interpolator(Int32)
 Constructs an empty Interpolator with a certain capacity.
Interpolator(RhinoList<Double>)
 Copy all the numbers from an existing RhinoList.
Interpolator(Int32, Double)
 Constructs a new Interpolator with a specified amount of numbers.
Top
See Also
Reference
Interpolator Class
Rhino.Geometry Namespace