RhinoCommon API
Line.ExtendThroughBox Method
Overload List
Name | Description
ExtendThroughBox(BoundingBox)
 Ensure the line extends all the way through a box. Note, this does not result in the shortest possible line that overlaps the box.
ExtendThroughBox(Box)
 Ensure the line extends all the way through a box. Note, this does not result in the shortest possible line that overlaps the box.
ExtendThroughBox(BoundingBox, Double)
 Ensure the line extends all the way through a box. Note, this does not result in the shortest possible line that overlaps the box.
ExtendThroughBox(Box, Double)
 Ensure the line extends all the way through a box. Note, this does not result in the shortest possible line that overlaps the box.
Top
See Also
Reference
Line Structure
Rhino.Geometry Namespace