RhinoCommon API
CommonObject.FromJSON Method
Overload List
Name | Description
FromJSON(Dictionary<String, String>)
 Create a CommonObject instance from a JSON dictionary
FromJSON(String)
 Create a CommonObject instance from a JSON string
Top
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace