RhinoCommon API
LinearDimension.GetDistanceDisplayText Method
Overload List
Name | Description
GetDistanceDisplayText(LengthUnit, DimensionStyle)
GetDistanceDisplayText(UnitSystem, DimensionStyle) |  Obsolete.
Top
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace