RhinoCommon API
MeshClash.FindDetail Method
Overload List
Name | Description
FindDetail(RhinoObject, RhinoObject, Double)
 Finds all of the mesh faces on each of two Rhino objects that interfere within a clash distance. This function uses the object's mesh to calculate the interferences. Acceptable object types include: BrepObject, ExtrusionObject, MeshObject, and SubDObject.
FindDetail(RhinoObject, RhinoObject, Double, MeshType, MeshingParameters)
 Finds all of the mesh faces on each of two Rhino objects that interfere within a clash distance. This function uses the object's mesh to calculate the interferences. Acceptable object types include: BrepObject, ExtrusionObject, MeshObject, and SubDObject.
Top
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace