RhinoCommon API
PolyCurve.Append Method
Overload List
Name | Description
Append(Arc)
 Appends and matches the start of the arc to the end of polycurve. This function will fail if the polycurve is closed or if SegmentCount > 0 and the arc is closed.
Append(Curve)
 Appends and matches the start of the curve to the end of polycurve. This function will fail if the PolyCurve is closed or if SegmentCount > 0 and the new segment is closed.
Append(Line)
 Appends and matches the start of the line to the end of polycurve. This function will fail if the polycurve is closed.
Top
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace