RhinoCommon API
NurbsCurve.CreateSubDFriendly Method
Overload List
Name | Description
CreateSubDFriendly(Curve)
 Create a NURBS curve, that is suitable for calculations like lofting SubD objects, from an existing curve.
CreateSubDFriendly(Curve, Int32, Boolean)
 Create a NURBS curve, that is suitable for calculations like lofting SubD objects, from an existing curve.
CreateSubDFriendly(IEnumerable<Point3d>, Boolean, Boolean)
 Create a NURBS curve, that is suitable for calculations like lofting SubD objects, through a sequence of curves.
Top
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace