RhinoCommon API
InstanceDefinitionTable.GetUnusedInstanceDefinitionName Method
Overload List
Name | Description
GetUnusedInstanceDefinitionName()
 Gets unused instance definition name used as default when creating new instance definitions.
GetUnusedInstanceDefinitionName(String)
 Gets unused instance definition name used as default when creating new instance definitions.
GetUnusedInstanceDefinitionName(String, UInt32) |  Obsolete.
 Gets unused instance definition name used as default when creating new instance definitions.
Top
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace