RhinoCommon API
Vector2d.IsTiny Method
Overload List
Name | Description
IsTiny()
 Uses RhinoMath.ZeroTolerance for IsTiny calculation.
IsTiny(Double)
 Determines whether a vector is very short.
Top
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace