RhinoCommon API
RhinoList<T>.FindIndex Method
Overload List
Name | Description
FindIndex(Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the first occurrence within the entire List.
FindIndex(Int32, Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the first occurrence within the entire List.
FindIndex(Int32, Int32, Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the first occurrence within the range of elements in the List that extends from the specified index to the last element.
Top
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace