RhinoCommon API
OptionInteger.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the OptionInteger
Dispose(Boolean)
Releases the unmanaged resources used by the OptionInteger and optionally releases the managed resources
Top
See Also
Reference
OptionInteger Class
Rhino.Input.Custom Namespace