RhinoCommon API
File3dm.Write Method
Overload List
Name | Description
Write(String, File3dmWriteOptions)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
Write(String, Int32)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
Top
See Also
Reference
File3dm Class
Rhino.FileIO Namespace