RhinoCommon API
SubDEdgeSharpness.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines whether an object is a sharpness with the same end values as this one.
 (Overrides ValueType.Equals(Object).)
Equals(SubDEdgeSharpness)
 Determines whether this sharpness has the same end values as another one.
Top
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace