RhinoCommon API
Vector3f.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines whether the specified System.Object is a Vector3f and has the same values as the present vector.
 (Overrides ValueType.Equals(Object).)
Equals(Vector3f)
 Determines whether the specified vector has the same values as the present vector.
Top
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace