RhinoCommon API
Point4d.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines whether the specified System.Object is Point4d and has same coordinates as the present point.
 (Overrides ValueType.Equals(Object).)
Equals(Point4d)
 Determines whether the specified point has same value as the present point.
Top
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace