RhinoCommon API
Mesh.ComputeThickness Method
Overload List
Name | Description
ComputeThickness(IEnumerable<Mesh>, Double)
 Compute thickness metrics for this mesh.
ComputeThickness(IEnumerable<Mesh>, Double, CancellationToken)
 Compute thickness metrics for this mesh.
ComputeThickness(IEnumerable<Mesh>, Double, Double, CancellationToken)
 Compute thickness metrics for this mesh.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace