RhinoCommon API
HiddenLineDrawing.Compute Method
Overload List
Name | Description
Compute(HiddenLineDrawingParameters, Boolean)
 Perform the hidden line drawing calculation based on input parameters
Compute(HiddenLineDrawingParameters, Boolean, IProgress<Double>, CancellationToken)
 Perform the hidden line drawing calculation based on input parameters
Top
See Also
Reference
HiddenLineDrawing Class
Rhino.Geometry Namespace