RhinoCommon API
HatchLine Constructor
Overload List
Name | Description
HatchLine()
 Construts a new hatch line.
HatchLine(HatchLine)
 Construts a new hatch line.
Top
See Also
Reference
HatchLine Class
Rhino.DocObjects Namespace