RhinoCommon API
DisplayMaterial Constructor
Overload List
Name | Description
DisplayMaterial()
 Constructs a default material.
DisplayMaterial(Color)
 Constructs a default material with a specific diffuse color.
DisplayMaterial(DisplayMaterial)
 Duplicate another material.
DisplayMaterial(Material)
Initializes a new instance of the DisplayMaterial class
DisplayMaterial(Color, Double)
 Constructs a default material with a specific diffuse color and transparency.
DisplayMaterial(Color, Color, Color, Color, Double, Double)
 Constructs a material with custom properties.
Top
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace