RhinoCommon API
CurveKinkDefinition.IsCurvatureZero Method
Overload List
Name | Description
IsCurvatureZero(Double)
 Returns true if the curvature vector is considered to be zero given the CurvatureKinkZeroTolerance
IsCurvatureZero(Vector3d)
 Returns true if the curvature vector is considered to be zero given the CurvatureKinkZeroTolerance
Top
See Also
Reference
CurveKinkDefinition Class
Rhino.Geometry Namespace