RhinoCommon API
SimpleArrayCurvePointer Constructor
Overload List
Name | Description
SimpleArrayCurvePointer()
 Initializes a new SimpleArrayCurvePointer instance.
SimpleArrayCurvePointer(IEnumerable<Curve>)
 Initializes a new SimpleArrayCurvePointer instance, from a set of input curves.
Top
See Also
Reference
SimpleArrayCurvePointer Class
Rhino.Runtime.InteropWrappers Namespace