RhinoCommon API
Quaternion.SetRotation Method
Overload List
Name | Description
SetRotation(Double, Vector3d)
 Sets the quaternion to cos(angle/2), sin(angle/2)*x, sin(angle/2)*y, sin(angle/2)*z where (x,y,z) is the unit vector parallel to axis. This is the unit quaternion that represents the rotation of angle about axis.
SetRotation(Plane, Plane)
 Sets the quaternion to the unit quaternion which rotates plane0.xaxis to plane1.xaxis, plane0.yaxis to plane1.yaxis, and plane0.zaxis to plane1.zaxis.
Top
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace