RhinoCommon API
File3dmNamedConstructionPlanes.Add Method
Overload List
Name | Description
Add(ConstructionPlane)
 Adds a named construction plane to the table.
Add(String, Plane)
 Adds a named construction plane to the table.
Top
See Also
Reference
File3dmNamedConstructionPlanes Class
Rhino.FileIO Namespace