RhinoCommon API
DetailViewObject.ParentPageView Property
 Gets the page view that this detail view belongs to.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RhinoPageView ParentPageView { get; }
Public ReadOnly Property ParentPageView As RhinoPageView
	Get
Property Value
Type: RhinoPageView
Remarks
 Every detail view object belongs to one page view. Page views can be parent to multiple detail views.
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace