RhinoCommon API
Skylight.ShadowIntensity Property
 Get shadow intensity for skylight. This is unused at present.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ShadowIntensity { get; }
Public ReadOnly Property ShadowIntensity As Double
	Get
Property Value
Type: Double
See Also
Reference
Skylight Class
Rhino.Render.ChangeQueue Namespace