RhinoCommon API
DisplayPipelineAttributes.LockedColor Property
 Locked Object Color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public Color LockedColor { get; set; }
Public Property LockedColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace