RhinoCommon API
FileWriteOptions.WriteAsTemplate Property
 Write as template
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool WriteAsTemplate { get; }
Public ReadOnly Property WriteAsTemplate As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace