RhinoCommon API
DisplayPipelineAttributes.SubDCreaseInteriorThicknessUsage Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SubDCreaseInteriorThicknessUsage"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public DisplayPipelineAttributes.SubDThicknessUse SubDCreaseInteriorThicknessUsage { get; set; }
Public Property SubDCreaseInteriorThicknessUsage As DisplayPipelineAttributes.SubDThicknessUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.SubDThicknessUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace