RhinoCommon API
File3dm.AllNamedViews Property
 Named views in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public File3dmViewTable AllNamedViews { get; }
Public ReadOnly Property AllNamedViews As File3dmViewTable
	Get
Property Value
Type: File3dmViewTable
See Also
Reference
File3dm Class
Rhino.FileIO Namespace