RhinoCommon API
FileCsvWriteOptions.Perimeter Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.Perimeter"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Perimeter { get; set; }
Public Property Perimeter As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace