RhinoCommon API
BrepTrimList.Count Property
 Gets the number of brep trims.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepTrimList Class
Rhino.Geometry.Collections Namespace