RhinoCommon API
Extrusion.PathStart Property
 Gets the start point of the path.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d PathStart { get; }
Public ReadOnly Property PathStart As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace