RhinoCommon API
BrepTrim.IsoStatus Property
[Missing <summary> documentation for "P:Rhino.Geometry.BrepTrim.IsoStatus"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public IsoStatus IsoStatus { get; set; }
Public Property IsoStatus As IsoStatus
	Get
	Set
Property Value
Type: IsoStatus
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace