RhinoCommon API
FileSkpReadOptions.ImportCurves Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSkpReadOptions.ImportCurves"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportCurves { get; set; }
Public Property ImportCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSkpReadOptions Class
Rhino.FileIO Namespace