RhinoCommon API
NurbsCurveFitParameters.DefaultDegree Property
 The default degree of the fit
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int DefaultDegree { get; }
Public Shared ReadOnly Property DefaultDegree As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace