RhinoCommon API
ModelComponent.HasIndex Property
 Returns a value indicating whether the component has an Index.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool HasIndex { get; }
Public ReadOnly Property HasIndex As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace