RhinoCommon API
FileIgsWriteOptions.HideDependentObjects Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.HideDependentObjects"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool HideDependentObjects { get; set; }
Public Property HideDependentObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace