RhinoCommon API
DimensionStyle.TextOrientation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextOrientation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextOrientation TextOrientation { get; set; }
Public Property TextOrientation As TextOrientation
	Get
	Set
Property Value
Type: TextOrientation
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace