RhinoCommon API
PostEffectData.Id Property
 Returns the unique id of this post effect.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectData Class
Rhino.Render.PostEffects Namespace