RhinoCommon API
Mesh.HasPrincipalCurvatures Property
 HasPrincipalCurvatures
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool HasPrincipalCurvatures { get; }
Public ReadOnly Property HasPrincipalCurvatures As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Mesh Class
Rhino.Geometry Namespace