RhinoCommon API
File3dmSettings.PageAngleToleranceDegrees Property
Gets or sets the page space angle tolerance.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double PageAngleToleranceDegrees { get; set; }
Public Property PageAngleToleranceDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace