RhinoCommon API
GumballAppearanceSettings.PlanarTranslationGripCorner Property
in pixels.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int PlanarTranslationGripCorner { get; set; }
Public Property PlanarTranslationGripCorner As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace