RhinoCommon API
File3dm.Notes Property
 Gets or sets the model notes.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public File3dmNotes Notes { get; set; }
Public Property Notes As File3dmNotes
	Get
	Set
Property Value
Type: File3dmNotes
See Also
Reference
File3dm Class
Rhino.FileIO Namespace