RhinoCommon API
SurfaceCurvature.IsZero Property
 True if both kappa1 and kappa2 are zero.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsZero { get; }
Public ReadOnly Property IsZero As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace