RhinoCommon API
AppearanceSettings.CommandPromptBackgroundColor Property
 Gets or sets the color of the command prompt background.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color CommandPromptBackgroundColor { get; set; }
Public Shared Property CommandPromptBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace