RhinoCommon API
ObjectTable.HistoryRecordCount Property
 Returns the amount of history records in this document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int HistoryRecordCount { get; }
Public ReadOnly Property HistoryRecordCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace