RhinoCommon API
OrdinateDimension.Direction Property
 Gets or sets the measured direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public OrdinateDimension.MeasuredDirection Direction { get; set; }
Public Property Direction As OrdinateDimension.MeasuredDirection
	Get
	Set
Property Value
Type: OrdinateDimension.MeasuredDirection
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace