RhinoCommon API
File3dmPlugInDataTable.Item Property
 Gets the File3dmPlugInData object at the given index.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmPlugInData this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As File3dmPlugInData
	Get
Parameters
index
Type: System.Int32
Index of File3dmPlugInData to access.
Return Value
Type: File3dmPlugInData
The File3dmPlugInData at [index].
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace