RhinoCommon API
DisplayPipelineAttributes.MeshEdgeColorReduction Property
 The darken percentage of the color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int MeshEdgeColorReduction { get; set; }
Public Property MeshEdgeColorReduction As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace