RhinoCommon API
InstanceDefinitionTable.ActiveCount Property
 Number of items in the instance definitions table, excluding deleted definitions.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int ActiveCount { get; }
Public ReadOnly Property ActiveCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace