RhinoCommon API
GrasshopperDisplayMaterial.ShadeFalseColor Property
 Gets or sets whether a mesh's vertex colours are shaded. Has no effect on a mesh that has no vertex colours. Default: false.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ShadeFalseColor { get; set; }
Public Property ShadeFalseColor As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
 When a mesh carries vertex colours, those colours — its "false colours" — are always what gets drawn, in place of Diffuse. This property decides only how they are drawn: true lights and shades them like any other surface colour, while false draws them flat, with no lighting or shading applied at all. Striping, stippling and Desaturation still apply either way.
See Also
Reference
GrasshopperDisplayMaterial Class
Rhino.Display Namespace