RhinoCommon API
LinearWorkflow.PostProcessFrameBuffer Property
 Linear workflow post-process frame buffer enabled state.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool PostProcessFrameBuffer { get; set; }
Public Property PostProcessFrameBuffer As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace