RhinoCommon API
RhinoDoc.PageUnitSystem Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.PageUnitSystem"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public UnitSystem PageUnitSystem { get; set; }
Public Property PageUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
RhinoDoc Class
Rhino Namespace