RhinoCommon API
Analytics.AppName Property
 Name of Application. For example, "Ocelot". Do not include version numbers. Maps to Google Analytics parameter 'an'
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string AppName { get; set; }
Public Property AppName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Analytics Class
Rhino.Runtime Namespace