RhinoCommon API
RhinoModifyObjectAttributesEventArgs.NewAttributes Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoModifyObjectAttributesEventArgs.NewAttributes"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ObjectAttributes NewAttributes { get; }
Public ReadOnly Property NewAttributes As ObjectAttributes
	Get
Property Value
Type: ObjectAttributes
See Also
Reference
RhinoModifyObjectAttributesEventArgs Class
Rhino.DocObjects Namespace