RhinoCommon API
Dimension.AltLengthResolution Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AltLengthResolution"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int AltLengthResolution { get; set; }
Public Property AltLengthResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Dimension Class
Rhino.Geometry Namespace