RhinoCommon API
ConstructionPlane.ShowAxes Property
 Gets or sets whether the axes of the grid should be visible.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ShowAxes { get; set; }
Public Property ShowAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace