RhinoCommon API
ClippingPlaneSurface.PlaneDepthEnabled Property
 Determines if the PlaneDepth value should be used
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool PlaneDepthEnabled { get; set; }
Public Property PlaneDepthEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace