RhinoCommon API
SectionStyle.ComponentType Property
 Returns SectionStyle.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace