RhinoCommon API
PhysicallyBased.ClearcoatBump Property
[Missing <summary> documentation for "P:Rhino.Render.ChildSlotNames.PhysicallyBased.ClearcoatBump"]
 Namespace: Rhino.Render.ChildSlotNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string ClearcoatBump { get; }
Public Shared ReadOnly Property ClearcoatBump As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ChildSlotNames Namespace