RhinoCommon API
FileIgsWriteOptions.UseParentLabelOnSurfaces Property
copy parent label to dependent srfs
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool UseParentLabelOnSurfaces { get; set; }
Public Property UseParentLabelOnSurfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace