RhinoCommon API
DisplayPipelineAttributes.ShowAnnotations Property
Show annotations.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public bool ShowAnnotations { get; set; }
Public Property ShowAnnotations As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace