RhinoCommon API
DimensionStyle.DimTextAngleType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimTextAngleType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.LeaderContentAngleStyle DimTextAngleType { get; set; }
Public Property DimTextAngleType As DimensionStyle.LeaderContentAngleStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderContentAngleStyle
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace