RhinoCommon API
RhinoTransformObjectsEventArgs.ObjectCount Property
 The number of Rhino objects that will be transformed.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public int ObjectCount { get; }
Public ReadOnly Property ObjectCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace