RhinoCommon API
StringParserSettings.ParseLeadingWhiteSpace Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseLeadingWhiteSpace"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseLeadingWhiteSpace { get; set; }
Public Property ParseLeadingWhiteSpace As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace