RhinoCommon API
Layer.PerViewportIsVisibleInNewDetails Property
 Gets and sets the initial per viewport visibility of this layer in newly created detail views.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool PerViewportIsVisibleInNewDetails { get; set; }
Public Property PerViewportIsVisibleInNewDetails As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Layer Class
Rhino.DocObjects Namespace