RhinoCommon API
ClippingPlaneSurface.DimensionStyleId Property
 The id of the dimstyle used by this clipping plane surface. This is used to help determine how the clipping plane is drawn with respect to things like arrows and fonts
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Guid DimensionStyleId { get; set; }
Public Property DimensionStyleId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace