RhinoCommon API
AnimationProperties.TargetPathId Property
 Gets or sets the object ID of the target path.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public Guid TargetPathId { get; set; }
Public Property TargetPathId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace