RhinoCommon API
SoftTransformSettings.FalloffColor Property
 Controls the color used to shade meshes and edges when an object is affected by soft transform.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Color FalloffColor { get; set; }
Public Shared Property FalloffColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SoftTransformSettings Class
Rhino.ApplicationSettings Namespace