RhinoCommon API
Sun.Azimuth Property
 The sun's azimuth in degrees. The value increases Eastwards with North as zero. Setting this value will also set the sun to manual control mode. Note: This value is not affected by the direction of north.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Azimuth { get; set; }
Public Property Azimuth As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Sun Class
Rhino.Render Namespace