RhinoCommon API
UserInterfaceSlider.AllowValueAfterRangeEnd Property
 Set to true if you want to allow dragging of the slider grip after the end of the defined range.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool AllowValueAfterRangeEnd { get; set; }
Public Property AllowValueAfterRangeEnd As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
UserInterfaceSlider Class
Rhino.UI Namespace