RhinoCommon API
ViewCaptureWriter.PathPoint.PointType Property
[Missing <summary> documentation for "P:Rhino.Runtime.ViewCaptureWriter.PathPoint.PointType"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ViewCaptureWriter.PointType PointType {
	get;
 set; }
Public Property PointType As ViewCaptureWriter.PointType
		Get
	Set
Property Value
Type: ViewCaptureWriter.PointType
See Also
Reference
ViewCaptureWriter.PathPoint Structure
Rhino.Runtime Namespace