RhinoCommon API
SweepOneRail.IsRoadlikeTop Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.IsRoadlikeTop"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsRoadlikeTop { get; }
Public ReadOnly Property IsRoadlikeTop As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace