RhinoCommon API
FileObjWriteOptions.ObjectType Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileObjWriteOptions.ObjectType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public FileObjWriteOptions.GeometryType ObjectType { get; set; }
Public Property ObjectType As FileObjWriteOptions.GeometryType
	Get
	Set
Property Value
Type: FileObjWriteOptions.GeometryType
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace