RhinoCommon API
DisplayPipelineAttributes.ViewDisplayAttributes.HorizontalViewportScale Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes.HorizontalViewportScale"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double HorizontalViewportScale { get; set; }
Public Property HorizontalViewportScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace