RhinoCommon API
ObjectAttributes.File3dmMeshModifiers Property
 Get an object that provides access to mesh modifiers when the attributes is for a File3dmObject.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmMeshModifiers File3dmMeshModifiers { get; }
Public ReadOnly Property File3dmMeshModifiers As File3dmMeshModifiers
	Get
Property Value
Type: File3dmMeshModifiers
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace