RhinoCommon API
OpenGLSettings.AntialiasLevel Property
Gets or sets the anti-alias level used by OpenGL viewports
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public static AntialiasLevel AntialiasLevel { get; set; }
Public Shared Property AntialiasLevel As AntialiasLevel
	Get
	Set
Property Value
Type: AntialiasLevel
See Also
Reference
OpenGLSettings Class
Rhino.ApplicationSettings Namespace