RhinoCommon API
TextureMapping.TextureSpace Property
 See TextureSpace
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public TextureSpace TextureSpace { get; set; }
Public Property TextureSpace As TextureSpace
	Get
	Set
Property Value
Type: TextureSpace
See Also
Reference
TextureMapping Class
Rhino.Render Namespace