RhinoCommon API
Dimension.ForceArrowPosition Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ForceArrowPosition"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute]
public Dimension.ForceArrow ForceArrowPosition { get; set; }
<ObsoleteAttribute>
Public Property ForceArrowPosition As Dimension.ForceArrow
	Get
	Set
Property Value
Type: Dimension.ForceArrow
See Also
Reference
Dimension Class
Rhino.Geometry Namespace