RhinoCommon API
InstanceDefinitionGeometry.LayerStyle Property
 Specifies how model components (layers, materials, dimension styles, etc.) from linked instance definition files appear in the active model.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public InstanceDefinitionLayerStyle LayerStyle { get; }
Public ReadOnly Property LayerStyle As InstanceDefinitionLayerStyle
	Get
Property Value
Type: InstanceDefinitionLayerStyle
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace