RhinoCommon API
RenderSettings.ShadowmapLevel Property
 0=none, 1=normal, 2=best.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int ShadowmapLevel { get; set; }
Public Property ShadowmapLevel As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RenderSettings Class
Rhino.Render Namespace