RhinoCommon API
Brep.FilletSurfaceSettings.Trim Property
 If true, the input faces will be trimmed, if false, the input faces will be split.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Trim { get; }
Public ReadOnly Property Trim As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace