RhinoCommon API
Instance.Transform Property
 The transform for this instance. Transform the geometry by this to set its final location in world space.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Transform Transform { get; set; }
Public Property Transform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
Instance Class
Rhino.Render.CustomRenderMeshes Namespace