RhinoCommon API
DraftAngleAnalysisSettingsState.UpDirection Property
 The up direction.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Vector3d UpDirection { get; set; }
Public Property UpDirection As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
DraftAngleAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace