RhinoCommon API
FontQuartet.HasBoldFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.FontQuartet.HasBoldFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public bool HasBoldFont { get; }
Public ReadOnly Property HasBoldFont As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
FontQuartet Class
Rhino.DocObjects Namespace