RhinoCommon API
BrepEdge.Brep Property
 Gets the Brep that owns this edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace