RhinoCommon API
RhinoDoc.RenderMaterialAssignmentChangedEventArgs.OldRenderMaterial Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.OldRenderMaterial"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public Guid OldRenderMaterial { get; }
Public ReadOnly Property OldRenderMaterial As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoDoc.RenderMaterialAssignmentChangedEventArgs Class
Rhino Namespace