RhinoCommon API
AnnotationBase.DrawTextFrame Property
Note: This API is now obsolete.
 Gets or sets whether to draw a frame around a text mask
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[ObsoleteAttribute("Do not use setter as the MaskFrame is an enum. Use MaskFrame property instead")]
public bool DrawTextFrame { get; set; }
<ObsoleteAttribute("Do not use setter as the MaskFrame is an enum. Use MaskFrame property instead")>
Public Property DrawTextFrame As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace