RhinoCommon API
AppearanceSettings.ShowSelectionFilterBar Property
 Shows or hides the selection filter user interface.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
public static bool ShowSelectionFilterBar { get; set; }
Public Shared Property ShowSelectionFilterBar As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace