RhinoCommon API
Point2f.Y Property
 Gets or sets the Y (second) component of the vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public float Y { get; set; }
Public Property Y As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace