RhinoCommon API
RhinoApp.Name Property
Gets the application name.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string Name { get; }
Public Shared ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
RhinoApp Class
Rhino Namespace