RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.Emission Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Emission"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
[ObsoleteAttribute]
public static string Emission { get; }
<ObsoleteAttribute>
Public Shared ReadOnly Property Emission As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace