RhinoCommon API
InstanceDefinitionGeometry.SkipNestedLinkedDefinitions Property
 This property applies when an instance definition is linked. If true, when reading the file that defines the content of the linked instance definition, skip any linked instance definitions found in that file. If false, when reading the file that defines the content of the linked instance definition, recursively load linked instance definitions found in that file.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SkipNestedLinkedDefinitions { get; }
Public ReadOnly Property SkipNestedLinkedDefinitions As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace