RhinoCommon API
Transform.IsZero4x4 Property
 True if all values are 0
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public bool IsZero4x4 { get; }
Public ReadOnly Property IsZero4x4 As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Transform Structure
Rhino.Geometry Namespace