RhinoCommon API
FileCsvWriteOptions.LayerName Property
Layer information
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool LayerName { get; set; }
Public Property LayerName As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace