RhinoCommon API
HiddenLineDrawingObjectCurve.SilhouetteType Property
 The silhouette event type
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public SilhouetteType SilhouetteType { get; }
Public ReadOnly Property SilhouetteType As SilhouetteType
	Get
Property Value
Type: SilhouetteType
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace