RhinoCommon API
AnnotationBase.PlainTextWithFields Property
 Text stripped of RTF formatting information and with field expressions intact
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.19
Syntax
public string PlainTextWithFields { get; }
Public ReadOnly Property PlainTextWithFields As String
	Get
Property Value
Type: String
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace