RhinoCommon API
LightObject.Index Property
[Missing <summary> documentation for "P:Rhino.DocObjects.LightObject.Index"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public override int Index { get; set; }
Public Overrides Property Index As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
LightObject Class
Rhino.DocObjects Namespace