RhinoCommon API
RadialDimension.IsDiameterDimension Property
 Gets a value indicating whether the value refers to the diameter, rather than the radius.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsDiameterDimension { get; }
Public ReadOnly Property IsDiameterDimension As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace