RhinoCommon API
RhinoDoc.ViewUserInterface Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.ViewUserInterface"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public ViewUserInterfaceTable ViewUserInterface { get; }
Public ReadOnly Property ViewUserInterface As ViewUserInterfaceTable
	Get
Property Value
Type: ViewUserInterfaceTable
See Also
Reference
RhinoDoc Class
Rhino Namespace