RhinoCommon API
StringParserSettings.ParsePi Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParsePi"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParsePi { get; set; }
Public Property ParsePi As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace