RhinoCommon API
DisplayModeDescription.GhostedId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.GhostedId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid GhostedId { get; }
Public Shared ReadOnly Property GhostedId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace