RhinoCommon API
FileIgsWriteOptions.Author Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.Author"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string Author { get; set; }
Public Property Author As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace