RhinoCommon API
RhinoObject.IsSolid Property
 Returns true if object is a closed solid, otherwise false.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public bool IsSolid { get; }
Public ReadOnly Property IsSolid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace