RhinoCommon API
SubDEdge.RelativeFaceLeft Property
 The face on the left of this edge, with respect to the direction this edge is referenced with. Null for a boundary edge with no face on that side, and for a nonmanifold edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDFace RelativeFaceLeft { get; }
Public ReadOnly Property RelativeFaceLeft As SubDFace
	Get
Property Value
Type: SubDFace
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace