RhinoCommon API
RenderMaterial.SmellsLikeGlass Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeGlass"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SmellsLikeGlass { get; }
Public ReadOnly Property SmellsLikeGlass As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace