RhinoCommon API
ContentUuids.EmissionMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.EmissionMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Guid EmissionMaterialType { get; }
Public Shared ReadOnly Property EmissionMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace