RhinoCommon API
IOAuth2Token.RawToken Property
 The raw token that can be passed to various servers for authorization.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
string RawToken { get; }
ReadOnly Property RawToken As String
	Get
Property Value
Type: String
See Also
Reference
IOAuth2Token Interface
Rhino.Runtime.RhinoAccounts Namespace