RhinoCommon API
Quaternion.IsScalar Property
 true if b, c, and d are all zero.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsScalar { get; }
Public ReadOnly Property IsScalar As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace