RhinoCommon API
ModelAidSettings.DisplayControlPolygon Property
Gets or sets the enabled state of Rhino's display control polygon.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool DisplayControlPolygon { get; set; }
Public Shared Property DisplayControlPolygon As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace