RhinoCommon API
RenderContentEventArgs.Reason Property
 Not when used in CurrentEnvironmentChanged (defaults to None).
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderContentChangeReason Reason { get; }
Public ReadOnly Property Reason As RenderContentChangeReason
	Get
Property Value
Type: RenderContentChangeReason
See Also
Reference
RenderContentEventArgs Class
Rhino.Render Namespace