RhinoCommon API
MeshCurvatureStats.CurvatureStyle Property
 Gets the curvature style of the curvature statistics.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public CurvatureStyle CurvatureStyle { get; }
Public ReadOnly Property CurvatureStyle As CurvatureStyle
	Get
Property Value
Type: CurvatureStyle
See Also
Reference
MeshCurvatureStats Class
Rhino.Geometry Namespace