RhinoCommon API
DisplayPipelineAttributes.ShowRealtimeRenderProgressBar Property
 Get or set whether the display is used for preview rendering or not.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ShowRealtimeRenderProgressBar { get; set; }
Public Property ShowRealtimeRenderProgressBar As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace