RhinoCommon API
ReplayHistoryData.Document Property
The document this record belongs to
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace