RhinoCommon API
RenderContent.FilesToEmbed Property
 A string array of full paths to files used by the content that may be embedded in .3dm files and library files (.rmtl, .renv, .rtex). The default implementation returns an empty string list. Override this to return the file name or file names used by your content. This is typically used by textures that reference files containing the texture imagery.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.12
Syntax
public virtual IEnumerable<string> FilesToEmbed { get; }
Public Overridable ReadOnly Property FilesToEmbed As IEnumerable(Of String)
	Get
Property Value
Type: IEnumerable<String>
See Also
Reference
RenderContent Class
Rhino.Render Namespace