RhinoCommon API
Skin.Settings Property
 Gets access to the skin persistent settings.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PersistentSettings Settings { get; }
Public ReadOnly Property Settings As PersistentSettings
	Get
Property Value
Type: PersistentSettings
See Also
Reference
Skin Class
Rhino.Runtime Namespace