RhinoCommon API
BezierCurve.IsRational Property
 Gets a value indicating whether or not the curve is rational. Rational curves have control-points with custom weights.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsRational { get; }
Public ReadOnly Property IsRational As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace