RhinoCommon API
GetCone.ConeConstraint Property
 State of the cone/cylinder constraint option. When the cone/cylinder option is selected, the circle is being made as a base for a cone/cylinder. By default the vertical cone/cylinder option not available but is not selected. By default the "Vertical" option applies to VerticalCircle.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ConeConstraint ConeConstraint { get; set; }
Public Property ConeConstraint As ConeConstraint
	Get
	Set
Property Value
Type: ConeConstraint
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace