RhinoCommon API
ZebraAnalysisSettingsState.StripeColor Property
 Gets or sets the stripe color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public Color StripeColor { get; set; }
Public Property StripeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
ZebraAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace