RhinoCommon API
RhinoApp.Rhino7Id Property
Gets the ID of Rhino 7
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public static Guid Rhino7Id { get; }
Public Shared ReadOnly Property Rhino7Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoApp Class
Rhino Namespace