RhinoCommon API
Vector2d.SquareLength Property
 Returns the square of the length of the vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double SquareLength { get; }
Public ReadOnly Property SquareLength As Double
	Get
Property Value
Type: Double
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace