RhinoCommon API
CommonObject.UserData Property
 List of custom information that is attached to this class.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public UserDataList UserData { get; }
Public ReadOnly Property UserData As UserDataList
	Get
Property Value
Type: UserDataList
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace