RhinoCommon API
Skin.ActiveSkin Property
 Any time Rhino is running there is at most one skin being used (and possibly no skin). If a RhinoCommon based Skin class is being used, use ActiveSkin to get at the instance of this Skin class. May return null if no Skin is being used or if the skin is not a RhinoCommon based skin.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Skin ActiveSkin { get; }
Public Shared ReadOnly Property ActiveSkin As Skin
	Get
Property Value
Type: Skin
See Also
Reference
Skin Class
Rhino.Runtime Namespace