RhinoCommon API
FileStpReadOptions.LimitFaces Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileStpReadOptions.LimitFaces"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool LimitFaces { get; set; }
Public Property LimitFaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileStpReadOptions Class
Rhino.FileIO Namespace