RhinoCommon API
BrepVertex.Brep Property
 Gets the Brep that owns this vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace