RhinoCommon API
Brep.CurveConstraint.Curve Property
 The constraint curve
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Curve Curve { get; }
Public ReadOnly Property Curve As Curve
	Get
Property Value
Type: Curve
See Also
Reference
Brep.CurveConstraint Class
Rhino.Geometry Namespace