RhinoCommon API
Markup.Comments Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Markup.Comments"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Comments { get; set; }
Public Property Comments As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Markup Class
Rhino.DocObjects Namespace