RhinoCommon API
AppearanceSettings.ShowTitleBar Property
 Shows or hides title bar.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool ShowTitleBar { get; set; }
Public Shared Property ShowTitleBar As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace