RhinoCommon API
File3dm.NamedConstructionPlanes Property
 Named construction planes in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IList<ConstructionPlane> NamedConstructionPlanes { get; }
Public ReadOnly Property NamedConstructionPlanes As IList(Of ConstructionPlane)
	Get
Property Value
Type: IList<ConstructionPlane>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace