RhinoCommon API
FileFbxWriteOptions.SaveFileAs Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileFbxWriteOptions.SaveFileAs"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileFbxWriteOptions.FileType SaveFileAs { get; set; }
Public Property SaveFileAs As FileFbxWriteOptions.FileType
	Get
	Set
Property Value
Type: FileFbxWriteOptions.FileType
See Also
Reference
FileFbxWriteOptions Class
Rhino.FileIO Namespace