RhinoCommon API
SubDComponent.IsSelected Property
 Returns true if the SubD component is selected.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public bool IsSelected { get; }
Public ReadOnly Property IsSelected As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace