RhinoCommon API
SweepTwoRail.SweepTolerance Property
 Gets or sets the sweeping tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double SweepTolerance { get; set; }
Public Property SweepTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace