RhinoCommon API
HatchPatternTableEventArgs.NewState Property
 The new state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public HatchPattern NewState { get; }
Public ReadOnly Property NewState As HatchPattern
	Get
Property Value
Type: HatchPattern
See Also
Reference
HatchPatternTableEventArgs Class
Rhino.DocObjects.Tables Namespace