RhinoCommon API
HatchPattern.Defaults.Dash Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Defaults.Dash"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static HatchPattern Dash { get; }
Public Shared ReadOnly Property Dash As HatchPattern
	Get
Property Value
Type: HatchPattern
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace