RhinoCommon API
CustomRenderContentAttribute.IsPrivate Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.IsPrivate"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsPrivate { get; set; }
Public Property IsPrivate As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace