RhinoCommon API
MouseCallbackEventArgs.ViewportPoint Property
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.ViewportPoint"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point ViewportPoint { get; }
Public ReadOnly Property ViewportPoint As Point
	Get
Property Value
Type: Point
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace