RhinoCommon API
File3dmObject.Name Property
 Gets or sets the Name of the object. Equivalent to this.Attributes.Name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override string Name { get; set; }
Public Overrides Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace