RhinoCommon API
SelectionFilterSettingsState.OneShotGeometryFilter Property
 The one-shot geometry type filter controls which types of geometry will be filtered for one selection. Note, the filter can be a bitwise combination of multiple object types.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public ObjectType OneShotGeometryFilter { get; set; }
Public Property OneShotGeometryFilter As ObjectType
	Get
	Set
Property Value
Type: ObjectType
See Also
Reference
SelectionFilterSettingsState Class
Rhino.ApplicationSettings Namespace