RhinoCommon API
MeshCheckParameters.ExtremelyShortEdgeCount Property
 Gets the total number of extremely short edges for all meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int ExtremelyShortEdgeCount { get; }
Public ReadOnly Property ExtremelyShortEdgeCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace