RhinoCommon API
ContentUuids.GridTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.GridTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid GridTextureType { get; }
Public Shared ReadOnly Property GridTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace