RhinoCommon API
DisplayPipeline.ActiveObjectNestingLevel Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.ActiveObjectNestingLevel"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public int ActiveObjectNestingLevel { get; }
Public ReadOnly Property ActiveObjectNestingLevel As Integer
	Get
Property Value
Type: Int32
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace