RhinoCommon API
Material.RenderMaterialInstanceId Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.RenderMaterialInstanceId"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid RenderMaterialInstanceId { get; set; }
Public Property RenderMaterialInstanceId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Material Class
Rhino.DocObjects Namespace