RhinoCommon API
RebuildCurveOptions.CurrentOutputPointCountRange Property
 The range of point counts in the rebuilt curves calculated using the current properties. When multiple target curves are being rebuilt with variable point counts or kink splittings, the resulting rebuilt curves can have a range of point counts. CurrentOutputPointCountRange.I = minimum point count. CurrentOutputPointCountRange.J = maximum point count.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IndexPair CurrentOutputPointCountRange { get; }
Public ReadOnly Property CurrentOutputPointCountRange As IndexPair
	Get
Property Value
Type: IndexPair
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace