RhinoCommon API
DimensionStyle.DimensionLineExtension Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimensionLineExtension"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double DimensionLineExtension { get; set; }
Public Property DimensionLineExtension As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace