RhinoCommon API
File3dm.AllGroups Property
 Groups in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public File3dmGroupTable AllGroups { get; }
Public ReadOnly Property AllGroups As File3dmGroupTable
	Get
Property Value
Type: File3dmGroupTable
See Also
Reference
File3dm Class
Rhino.FileIO Namespace