RhinoCommon API
DirectionAnalysisSettings.Direction Property
 Gets or sets whether to display the direction.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool Direction { get; set; }
Public Shared Property Direction As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DirectionAnalysisSettings Class
Rhino.ApplicationSettings Namespace