RhinoCommon API
AnimationProperties.EndSeconds Property
 Gets or sets the end seconds for one day sun animation in the range 0 to 59.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public int EndSeconds { get; set; }
Public Property EndSeconds As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace