RhinoCommon API
Curve.Dimension Property
 Gets the dimension of the object.
The dimension is typically three. For parameter space trimming curves the dimension is two. In rare cases the dimension can be one or greater than three.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Dimension { get; }
Public ReadOnly Property Dimension As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Curve Class
Rhino.Geometry Namespace