RhinoCommon API
ShrinkWrapParameters.PolygonOptimization Property
 0 - 100 the percentage of optimization desired. Polygons will be reduced in areas of lower curvature Lower values result in better feature preservation at the cost of more polygons
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int PolygonOptimization { get; set; }
Public Property PolygonOptimization As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ShrinkWrapParameters Class
Rhino.Geometry Namespace