RhinoCommon API
BezierCurve.ControlVertexCount Property
 Number of control vertices in this curve
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int ControlVertexCount { get; }
Public ReadOnly Property ControlVertexCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace