RhinoCommon API
Ellipse.Radius2 Property
 Gets or sets the radius of the ellipse along the base plane Y semi-axis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Radius2 { get; set; }
Public Property Radius2 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace