RhinoCommon API
RhinoDoc.RenderMaterialAssignmentChangedEventArgs.ObjectId Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.ObjectId"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public Guid ObjectId { get; }
Public ReadOnly Property ObjectId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoDoc.RenderMaterialAssignmentChangedEventArgs Class
Rhino Namespace