RhinoCommon API
SubDToBrepOptions.ExtraordinaryVertexProcess Property
 Get or sets the extraordinary vertex process option.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDToBrepOptions.ExtraordinaryVertexProcessOption ExtraordinaryVertexProcess { get; set; }
Public Property ExtraordinaryVertexProcess As SubDToBrepOptions.ExtraordinaryVertexProcessOption
	Get
	Set
Property Value
Type: SubDToBrepOptions.ExtraordinaryVertexProcessOption
See Also
Reference
SubDToBrepOptions Class
Rhino.Geometry Namespace