RhinoCommon API
ChooseOneObjectSettings.ShowTitlebarAndBorder Property
ShowTitlebarAndBorder
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool ShowTitlebarAndBorder { get; set; }
Public Shared Property ShowTitlebarAndBorder As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace