RhinoCommon API
IsoDrawEffect.DrawMode Property
[Missing <summary> documentation for "P:Rhino.Display.IsoDrawEffect.DrawMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IsoDrawMode DrawMode { get; set; }
Public Property DrawMode As IsoDrawMode
	Get
	Set
Property Value
Type: IsoDrawMode
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace