RhinoCommon API
RhinoApp.IsRunningBatchMode Property
 Is Rhino currently being executed as a batch run, either started with the /batchmode command line switch or put into batch mode since by the BatchMode command. A batch run has a main window but no user: commands take their input from the command line rather than showing dialogs, and modal message boxes are written to the command line instead of being shown.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool IsRunningBatchMode { get; }
Public Shared ReadOnly Property IsRunningBatchMode As Boolean
	Get
Property Value
Type: Boolean
Remarks
 To decide whether it is safe to show blocking user interface, test IsRunningUnattended instead - it also covers headless.
See Also
Reference
RhinoApp Class
Rhino Namespace