RhinoCommon API
MeshCurveIntersection.FaceIndex Property
Index into Faces of the canonical face that produced this hit (the lowest face index among FaceIndices).
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int FaceIndex { get; }
Public ReadOnly Property FaceIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace