RhinoCommon API
CurvatureGraphSettings.SurfaceVHairColor Property
 Gets or sets the surface V hair color;
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Color SurfaceVHairColor { get; set; }
Public Shared Property SurfaceVHairColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
CurvatureGraphSettings Class
Rhino.ApplicationSettings Namespace