RhinoCommon API
FileVdaWriteOptions.DateEffective Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVdaWriteOptions.DateEffective"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string DateEffective { get; set; }
Public Property DateEffective As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileVdaWriteOptions Class
Rhino.FileIO Namespace