RhinoCommon API
LinearWorkflow.PostProcessGamma Property
 Linear workflow post-process gamma value.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public float PostProcessGamma { get; set; }
Public Property PostProcessGamma As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace