RhinoCommon API
ModelAidSettings.SnapToFiltered Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettings.SnapToFiltered"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool SnapToFiltered { get; set; }
Public Shared Property SnapToFiltered As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace