RhinoCommon API
LengthMassProperties.WorldCoordinatesMomentsOfInertia Property
 The moments of inertia about the world coordinate axes. X = integral of (y^2 + z^2) dm Y = integral of (z^2 + x^2) dm Z = integral of (z^2 + y^2) dm.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public Vector3d WorldCoordinatesMomentsOfInertia { get; }
Public ReadOnly Property WorldCoordinatesMomentsOfInertia As Vector3d
	Get
Property Value
Type: Vector3d
Remarks
 What is meant by "moments of inertia" varies widely in textbooks and papers. The values returned here are the integrals listed in the Summary section. Some applications may want the values from WorldCoordinatesSecondMoments instead of the values returned here.
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace