RhinoCommon API
PostEffect.Shown Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffect.Shown"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Shown { get; set; }
Public Property Shown As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace