RhinoCommon API
DisplayPipelineAttributes.CurveThicknessUsage Property
 Use a pixel thickness (CurveThickness) or a scale thickness (CurveThicknessScale)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public DisplayPipelineAttributes.CurveThicknessUse CurveThicknessUsage { get; set; }
Public Property CurveThicknessUsage As DisplayPipelineAttributes.CurveThicknessUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.CurveThicknessUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace