RhinoCommon API
ContentUuids.AddTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.AddTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Guid AddTextureType { get; }
Public Shared ReadOnly Property AddTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace