RhinoCommon API
BrepLoop.LoopType Property
 type of loop.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BrepLoopType LoopType { get; }
Public ReadOnly Property LoopType As BrepLoopType
	Get
Property Value
Type: BrepLoopType
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace