RhinoCommon API
RhinoList<T>.Item Property
 Gets or sets the element at the specified index.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public T this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As T
	Get
	Set
Parameters
index
Type: System.Int32
The zero-based index of the element to get or set.
Return Value
Type: T
The element at the specified index.
Implements
IList<T>.Item[Int32]
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace