RhinoCommon API
RhinoViewport.Id Property
Unique id for this viewport.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace