RhinoCommon API
PreviewAppearance.MetaData Property
 Previewappearance MetaData
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public MetaData MetaData { get; }
Public ReadOnly Property MetaData As MetaData
	Get
Property Value
Type: MetaData
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace