RhinoCommon API
DimensionStyle.SuppressExtension2 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.SuppressExtension2"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SuppressExtension2 { get; set; }
Public Property SuppressExtension2 As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace