RhinoCommon API
RenderPipeline.PlugIn Property
[Missing <summary> documentation for "P:Rhino.Render.RenderPipeline.PlugIn"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PlugIn PlugIn { get; }
Public ReadOnly Property PlugIn As PlugIn
	Get
Property Value
Type: PlugIn
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace