RhinoCommon API
DisplayPipelineAttributes.PreProcessGamma Property
 Linear workflow input gamma
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public float PreProcessGamma { get; set; }
Public Property PreProcessGamma As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace