RhinoCommon API
DisplayPipelineAttributes.SubDReflectionPlaneColorReduction Property
 SubD replection plane color reduction percentage
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public int SubDReflectionPlaneColorReduction { get; set; }
Public Property SubDReflectionPlaneColorReduction As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace