RhinoCommon API
PreviewGeometry.CppPointer Property
 CppPointer for PreviewGeometry
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
PreviewGeometry Class
Rhino.Render Namespace