RhinoCommon API
AnimationProperties.CurrentFrame Property
 Gets or sets the current frame during animation record.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public int CurrentFrame { get; set; }
Public Property CurrentFrame As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace