RhinoCommon API
IntersectingMeshPair.MeshIndexB Property
 The index of the second mesh, in meshesB, or in meshesA when meshesB is null.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int MeshIndexB { get; }
Public ReadOnly Property MeshIndexB As Integer
	Get
Property Value
Type: Int32
See Also
Reference
IntersectingMeshPair Structure
Rhino.Geometry.Intersect Namespace