RhinoCommon API
RealtimeDisplayMode.LinearWorkflow Property
 Returns the LinearWorkflow data for this realtime display mode.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LinearWorkflow LinearWorkflow { get; }
Public ReadOnly Property LinearWorkflow As LinearWorkflow
	Get
Property Value
Type: LinearWorkflow
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace