RhinoCommon API
RhinoPageView.ActiveDetailId Property
 Returns the id of the active detail. If no detail is active, or if the page is active, then Guid.Empty is returned.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Guid ActiveDetailId { get; }
Public ReadOnly Property ActiveDetailId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace