RhinoCommon API
Interval.Max Property
 Gets the larger of T0 and T1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Max { get; }
Public ReadOnly Property Max As Double
	Get
Property Value
Type: Double
See Also
Reference
Interval Structure
Rhino.Geometry Namespace