RhinoCommon API
SoftTransformSettings.Shape Property
 The shape of the falloff curve. 0 = Smooth 1 = Linear 2 = Round 3 = Sharp
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int Shape { get; set; }
Public Shared Property Shape As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SoftTransformSettings Class
Rhino.ApplicationSettings Namespace