RhinoCommon API
MappingChannelCollection.SingleMapping Property
[Missing <summary> documentation for "P:Rhino.Render.ChangeQueue.MappingChannelCollection.SingleMapping"]
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public MappingChannel SingleMapping { get; }
Public ReadOnly Property SingleMapping As MappingChannel
	Get
Property Value
Type: MappingChannel
See Also
Reference
MappingChannelCollection Class
Rhino.Render.ChangeQueue Namespace