RhinoCommon API
ModelComponent.ModelSerialNumber Property
 A value identifying the model that manages this component.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public virtual uint ModelSerialNumber { get; }
Public Overridable ReadOnly Property ModelSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Remarks
 If the component is being managed by a model, this value identifies the model. In Rhino, this value is the document runtime serial number. Typically this value is set and locked by the code that adds a component to a model. This value is not saved in .3dm archives.
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace