RhinoCommon API
PhysicallyBased.OpacityIor Property
[Missing <summary> documentation for "P:Rhino.Render.ChildSlotNames.PhysicallyBased.OpacityIor"]
 Namespace: Rhino.Render.ChildSlotNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string OpacityIor { get; }
Public Shared ReadOnly Property OpacityIor As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ChildSlotNames Namespace