RhinoCommon API
HostUtils.SendDebugToCommandLine Property
 Gets or sets whether debug messages are printed to the command line.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool SendDebugToCommandLine { get; set; }
Public Shared Property SendDebugToCommandLine As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace