RhinoCommon API
Dimension.AltLengthFactor Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AltLengthFactor"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double AltLengthFactor { get; set; }
Public Property AltLengthFactor As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace