RhinoCommon API
Vector3f.XAxis Property
 Gets the value of the vector with components 1,0,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector3f XAxis { get; }
Public Shared ReadOnly Property XAxis As Vector3f
	Get
Property Value
Type: Vector3f
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace