RhinoCommon API
GumballSettings.MenuBallColor Property
 Specifies the gumball menu ball color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Color MenuBallColor { get; set; }
Public Shared Property MenuBallColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace