RhinoCommon API
SubDComponent.IsDamaged Property
 Returns true if the SubD component is damaged.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public bool IsDamaged { get; }
Public ReadOnly Property IsDamaged As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace