RhinoCommon API
Worksession.ModelPaths Property
 Returns the paths to the models used by the worksession. If the active model has not been saved, then it will not be included in the output array.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string[] ModelPaths { get; }
Public ReadOnly Property ModelPaths As String()
	Get
Property Value
Type: String[]
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace