RhinoCommon API
RealtimeDisplayMode.HudMaxPassesChangedEventArgs.MaxPasses Property
[Missing <summary> documentation for "P:Rhino.Render.RealtimeDisplayMode.HudMaxPassesChangedEventArgs.MaxPasses"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int MaxPasses { get; }
Public ReadOnly Property MaxPasses As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RealtimeDisplayMode.HudMaxPassesChangedEventArgs Class
Rhino.Render Namespace