RhinoCommon API
ObjectEnumeratorSettings.ClassTypeFilter Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.ClassTypeFilter"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Type ClassTypeFilter { get; set; }
Public Property ClassTypeFilter As Type
	Get
	Set
Property Value
Type: Type
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace