RhinoCommon API
PointCloud.Count Property
 Gets the number of points in this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace