RhinoCommon API
DisplayPen.PatternOffset Property
 Offset to apply to pattern. If RhinoMath.UnsetSingle, then pattern is centered to keep even dash lengths at ends
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public float PatternOffset { get; set; }
Public Property PatternOffset As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPen Class
Rhino.Display Namespace