RhinoCommon API
Sun.ManualControl Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Render.Sun.ManualControl"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
[ObsoleteAttribute("Use ManualControlOn")]
public bool ManualControl { get; set; }
<ObsoleteAttribute("Use ManualControlOn")>
Public Property ManualControl As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Sun Class
Rhino.Render Namespace