RhinoCommon API
Layer.LinetypeIndex Property
 Gets or sets the line-type index for this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int LinetypeIndex { get; set; }
Public Property LinetypeIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Layer Class
Rhino.DocObjects Namespace