RhinoCommon API
ThumbData.PreviewAppearance Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.PreviewAppearance"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PreviewAppearance PreviewAppearance { get; set; }
Public Property PreviewAppearance As PreviewAppearance
	Get
	Set
Property Value
Type: PreviewAppearance
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace