RhinoCommon API
FileDwgReadOptions.IgnoreThickness Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgReadOptions.IgnoreThickness"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IgnoreThickness { get; set; }
Public Property IgnoreThickness As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgReadOptions Class
Rhino.FileIO Namespace