RhinoCommon API
RhinoApp.IsOnMainThread Property
 Is the current thread the main thread
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public static bool IsOnMainThread { get; }
Public Shared ReadOnly Property IsOnMainThread As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace