RhinoCommon API
RibbonOffsetParameters.AlignCrossSections Property
 When false: cross section slashes between input and output curve are located at the ends of ruled spans. When true: cross section slashes between input and output curve are located at the mid points of ruled spans and blends.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public bool AlignCrossSections { get; set; }
Public Property AlignCrossSections As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RibbonOffsetParameters Class
Rhino.Geometry Namespace