RhinoCommon API
SubDEdgeSharpness.IsNotValid Property
 Gets the opposite of IsValid. Crease and Nan are both true.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool IsNotValid { get; }
Public ReadOnly Property IsNotValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace