RhinoCommon API
ColorLAB.A Property
 Gets or sets the Base channel. The channel is limited to -1~+1.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double A { get; set; }
Public Property A As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace