RhinoCommon API
Brep.Curves2D Property
 Parameter space trimming curves (used by trims)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public BrepCurveList Curves2D { get; }
Public ReadOnly Property Curves2D As BrepCurveList
	Get
Property Value
Type: BrepCurveList
See Also
Reference
Brep Class
Rhino.Geometry Namespace