RhinoCommon API
RhinoApp.Version Property
 File version of the main Rhino process
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public static Version Version { get; }
Public Shared ReadOnly Property Version As Version
	Get
Property Value
Type: Version
See Also
Reference
RhinoApp Class
Rhino Namespace