RhinoCommon API
UserInterfaceGrid.BackgroundClaimsMouse Property
 Whether a click where the grid has no child control belongs to the grid or to whatever is behind it. The default is false, so clicks on the padding, on the gaps between cells and on empty cells go through to the viewport, which is what a heads up display over a model wants.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool BackgroundClaimsMouse { get; set; }
Public Property BackgroundClaimsMouse As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace