RhinoCommon API
SafeFrame.TitleFrameXScale Property
 Title Frame X-scale. This value should be in the range 0..1 but it is not clamped. It is displayed in the UI in the range 0..100.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public double TitleFrameXScale { get; set; }
Public Property TitleFrameXScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SafeFrame Class
Rhino.Render Namespace