RhinoCommon API
MaterialRefCreateParams.FrontFaceMaterialId Property
 The Id of the Material used to render the front of an object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public Guid FrontFaceMaterialId { get; set; }
Public Property FrontFaceMaterialId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace