RhinoCommon API
DecalCreateParams.StartLatitude Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.StartLatitude"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double StartLatitude { get; set; }
Public Property StartLatitude As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace