RhinoCommon API
ZooClientParameters.Capabilities Property
 LicenseCapabilities flags that set options for how licenses can be obtained for this product
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LicenseCapabilities Capabilities { get; set; }
Public Property Capabilities As LicenseCapabilities
	Get
	Set
Property Value
Type: LicenseCapabilities
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace