RhinoCommon API
MarkupTableEventArgs.OldState Property
The old or previous markup.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Markup OldState { get; }
Public ReadOnly Property OldState As Markup
	Get
Property Value
Type: Markup
See Also
Reference
MarkupTableEventArgs Class
Rhino.DocObjects.Tables Namespace