RhinoCommon API
NurbsCurveKnotList.Item Property
 Gets or sets the knot vector value at the given index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Double
	Get
	Set
Parameters
index
Type: System.Int32
Index of knot to access.
Return Value
Type: Double
The knot value at [index]
Implements
IList<T>.Item[Int32]
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace