RhinoCommon API
SimpleArrayIntPtr.Count Property
 Gets the number of elements in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SimpleArrayIntPtr Class
Rhino.Runtime.InteropWrappers Namespace