RhinoCommon API
File3dmDisplacement.BlackPoint Property
 Specifies the amount of displacement for the black color in the texture.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double BlackPoint { get; set; }
Public Property BlackPoint As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace