RhinoCommon API
AnnotationBase.MaskColor Property
 Color to use for drawing a text mask when it is enabled. If the mask is enabled and MaskColor is System.Drawing.Color.Transparent, then the viewport's color will be used for the MaskColor
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Color MaskColor { get; set; }
Public Property MaskColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace