RhinoCommon API
Decal.DecalMapping Property
Note: This API is now obsolete.
 Gets the decal's mapping.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
[ObsoleteAttribute("Use Mapping instead")]
public DecalMapping DecalMapping { get; }
<ObsoleteAttribute("Use Mapping instead")>
Public ReadOnly Property DecalMapping As DecalMapping
	Get
Property Value
Type: DecalMapping
See Also
Reference
Decal Class
Rhino.Render Namespace