RhinoCommon API
ContentUuids.StuccoTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.StuccoTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid StuccoTextureType { get; }
Public Shared ReadOnly Property StuccoTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace