RhinoCommon API
TextDotUserInterfaceObject.TextHeight Property
 Font height for text
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int TextHeight { get; set; }
Public Property TextHeight As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
TextDotUserInterfaceObject Class
Rhino.UI Namespace