RhinoCommon API
HatchPatternTable.ComponentType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.HatchPatternTable.ComponentType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace