RhinoCommon API
DisplayPipelineAttributes.FrontMaterialTransparency Property
 Get or set the front material transparency (0.0 opaque to 1.0 transparent). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public double FrontMaterialTransparency { get; set; }
Public Property FrontMaterialTransparency As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace