RhinoCommon API
GetObject.ObjectCount Property
 Gets the number of objects that were selected.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int ObjectCount { get; }
Public ReadOnly Property ObjectCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace