RhinoCommon API
File3dm.ApplicationName Property
 Gets or sets the name of the application that wrote this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string ApplicationName { get; set; }
Public Property ApplicationName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dm Class
Rhino.FileIO Namespace