RhinoCommon API
FileSettingsState.SaveViewChanges Property
true for users who consider view changes a document change.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SaveViewChanges { get; set; }
Public Property SaveViewChanges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace