RhinoCommon API
LicenseLease.UserId Property
 ID of Rhino Accounts user that was logged in when this lease was obtained
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string UserId { get; }
Public ReadOnly Property UserId As String
	Get
Property Value
Type: String
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace