RhinoCommon API
ContentUuids.ExposureTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.ExposureTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid ExposureTextureType { get; }
Public Shared ReadOnly Property ExposureTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace