RhinoCommon API
EndAnalysisSettingsState.OpenStarts Property
 Gets or sets whether to display the open curve start points.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool OpenStarts { get; set; }
Public Property OpenStarts As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
EndAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace