RhinoCommon API
File3dmRenderContent.Parent Property
The parent content or null if this is the top level object.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmRenderContent Parent { get; }
Public ReadOnly Property Parent As File3dmRenderContent
	Get
Property Value
Type: File3dmRenderContent
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace