RhinoCommon API
ObjectGripsIds.Default Property
 The object's own control points - what the PointsOn command turns on, and what differs from one object type to the next.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Default { get; }
Public Shared ReadOnly Property Default As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ObjectGripsIds Class
Rhino.DocObjects Namespace