RhinoCommon API
File3dmSettings.CurrentColor Property
The colour new objects are created with.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public Color CurrentColor { get; set; }
Public Property CurrentColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace