RhinoCommon API
LightObject.ComponentType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.LightObject.ComponentType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
LightObject Class
Rhino.DocObjects Namespace