RhinoCommon API
File3dmPlugInData.PlugInId Property
 Gets the id of the plug-in that is associated with this custom data.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid PlugInId { get; }
Public ReadOnly Property PlugInId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
File3dmPlugInData Class
Rhino.FileIO Namespace