RhinoCommon API
RenderContentSerializer.EnglishDescription Property
 English string describing this plug-in
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public abstract string EnglishDescription { get; }
Public MustOverride ReadOnly Property EnglishDescription As String
	Get
Property Value
Type: String
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace