RhinoCommon API
ColorRGBA.Red Property
[Missing <summary> documentation for "P:Rhino.Display.ColorRGBA.Red"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static ColorRGBA Red { get; }
Public Shared ReadOnly Property Red As ColorRGBA
	Get
Property Value
Type: ColorRGBA
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace