RhinoCommon API
ToolbarFile.Id Property
 Gets the id of the toolbar file.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace