RhinoCommon API
DisplayAttributeMaterial.FlatShaded Property
 Shades with no smoothing, so the individual render mesh faces are visible.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool FlatShaded { get; set; }
Public Property FlatShaded As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace