RhinoCommon API
DisplayPipelineAttributes.SurfaceNakedEdgeThickness Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeThickness"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public int SurfaceNakedEdgeThickness { get; set; }
Public Property SurfaceNakedEdgeThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace