RhinoCommon API
ObjRef.Document Property
 Gets the document that owns this object reference.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace