RhinoCommon API
SmartTrackSettingsState.LineColor Property
Gets or sets the smart track line color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color LineColor { get; set; }
Public Property LineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace