RhinoCommon API
ContentHash.HashTime Property
 Gets the hash time, rounded to seconds.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DateTime HashTime { get; }
Public ReadOnly Property HashTime As DateTime
	Get
Property Value
Type: DateTime
See Also
Reference
ContentHash Class
Rhino.FileIO Namespace