RhinoCommon API
Texture.UvwTransform Property
 Transform to be applied to each instance of this texture if ApplyUvw is true
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public Transform UvwTransform { get; set; }
Public Property UvwTransform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
Texture Class
Rhino.DocObjects Namespace