RhinoCommon API
AppearanceSettings.GridThickLineColor Property
 Gets or sets the color of the thick line of the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color GridThickLineColor { get; set; }
Public Shared Property GridThickLineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace