RhinoCommon API
ConstructionPlane.ShowZAxis Property
 Gets or sets whether the Z axis of the grid should be visible.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ShowZAxis { get; set; }
Public Property ShowZAxis As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace