RhinoCommon API
CurveBooleanRegions.PlanarCurveCount Property
 Returns number of planar curves that were calculated by Curve.CreateBooleanRegions.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int PlanarCurveCount { get; }
Public ReadOnly Property PlanarCurveCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
CurveBooleanRegions Class
Rhino.Geometry Namespace