RhinoCommon API
MouseState.View Property
 View that is being used mouse tests
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RhinoView View { get; }
Public ReadOnly Property View As RhinoView
	Get
Property Value
Type: RhinoView
See Also
Reference
MouseState Class
Rhino.UI Namespace