RhinoCommon API
DimensionStyle.LeaderArrowLength Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderArrowLength"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double LeaderArrowLength { get; set; }
Public Property LeaderArrowLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace