RhinoCommon API
CurvatureAnalysisSettings.GaussRange Property
 Gets or sets the Gaussian curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Interval GaussRange { get; set; }
Public Shared Property GaussRange As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace