RhinoCommon API
RhinoReplaceObjectEventArgs.DocumentSerialNumber Property
 The document runtime serial number.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public uint DocumentSerialNumber { get; }
Public ReadOnly Property DocumentSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RhinoReplaceObjectEventArgs Class
Rhino.DocObjects Namespace