RhinoCommon API
FileSlcWriteOptions.UseMeshes Property
 Use meshes to generate slices. The curves for each slice are generated by intersecting the object mesh with a plane. the Angle between polyline segments data is not used when this value is true
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool UseMeshes { get; set; }
Public Property UseMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSlcWriteOptions Class
Rhino.FileIO Namespace