RhinoCommon API
RenderMeshes.Document Property
 The document with which this IRenderMeshes object is associated.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RenderMeshes Class
Rhino.Render.CustomRenderMeshes Namespace