RhinoCommon API
ConstructionPlaneGridDefaults.GridSpacing Property
Distance between grid lines
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public double GridSpacing { get; set; }
Public Property GridSpacing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ConstructionPlaneGridDefaults Class
Rhino.DocObjects Namespace