RhinoCommon API
TwistSpaceMorph.TwistAxis Property
Axis to rotate about.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Line TwistAxis { get; set; }
Public Property TwistAxis As Line
	Get
	Set
Property Value
Type: Line
See Also
Reference
TwistSpaceMorph Class
Rhino.Geometry.Morphs Namespace