RhinoCommon API
FileStpReadOptions.JoinSurfaces Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileStpReadOptions.JoinSurfaces"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool JoinSurfaces { get; set; }
Public Property JoinSurfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileStpReadOptions Class
Rhino.FileIO Namespace