RhinoCommon API
MeshCheckParameters.ZeroLengthNormalCount Property
 Gets the total count of zero length normals for all meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int ZeroLengthNormalCount { get; }
Public ReadOnly Property ZeroLengthNormalCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace