RhinoCommon API
RhinoObjectEventArgs.TheObject Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoObjectEventArgs.TheObject"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoObject TheObject { get; }
Public ReadOnly Property TheObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
RhinoObjectEventArgs Class
Rhino.DocObjects Namespace