RhinoCommon API
RhinoViewport.IsValidFrustum Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.IsValidFrustum"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsValidFrustum { get; }
Public ReadOnly Property IsValidFrustum As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace