RhinoCommon API
FileCsvWriteOptions.ObjectsTexts Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.ObjectsTexts"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ObjectsTexts { get; set; }
Public Property ObjectsTexts As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace