RhinoCommon API
MeshCheckParameters.CheckForSelfIntersection Property
 If true, then look for self intersections.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool CheckForSelfIntersection { get; set; }
Public Property CheckForSelfIntersection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace