RhinoCommon API
SmartTrackSettings.LineColor Property
Gets or sets the smart track line color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color LineColor { get; set; }
Public Shared Property LineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace