RhinoCommon API
DisplayPipelineAttributes.GhostLockedObjects Property
 Set locked appearance
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool GhostLockedObjects { get; set; }
Public Property GhostLockedObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
true = Locked objects appear transparent
Property Value
Type: Boolean
false = Locked objects appear solid
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace