RhinoCommon API
MappingTag.MappingCRC Property
 Gets or sets the cyclic redundancy check on the mapping. See also CRC32(UInt32, Byte[]).
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public uint MappingCRC { get; set; }
Public Property MappingCRC As UInteger
	Get
	Set
Property Value
Type: UInt32
See Also
Reference
MappingTag Class
Rhino.Render Namespace