RhinoCommon API
SectionStyle.BoundaryColor Property
 Color to apply for the boundary curves. Default is Color.Empty which means get the color from the source where this section style came from (object attributes or layer)
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Color BoundaryColor { get; set; }
Public Property BoundaryColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace