RhinoCommon API
ArchivableDictionary.Count Property
 Gets the number of key/value pairs contained in the dictionary.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace