RhinoCommon API
ModelAidSettings.PointDisplay Property
Gets or sets the point display mode.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static PointDisplayMode PointDisplay { get; set; }
Public Shared Property PointDisplay As PointDisplayMode
	Get
	Set
Property Value
Type: PointDisplayMode
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace