RhinoCommon API
DisplayPipelineAttributes.PointStyle Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.PointStyle"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PointStyle PointStyle { get; set; }
Public Property PointStyle As PointStyle
	Get
	Set
Property Value
Type: PointStyle
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace