RhinoCommon API
DisplayPipelineAttributes.ShowClippingPlanes Property
Show clipping planes.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public bool ShowClippingPlanes { get; set; }
Public Property ShowClippingPlanes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace