RhinoCommon API
GroupTable.Item Property
 Conceptually, the group table is an array of groups. The operator[] can be used to get individual groups. A group is either active or deleted and this state is reported by Group.IsDeleted.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public Group this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As Group
	Get
Parameters
index
Type: System.Int32
zero based array index.
Return Value
Type: Group
 Reference to the group. If index is out of range, null is returned. Note that this reference may become invalid after Add() is called.
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace