RhinoCommon API
File3dmSettings.CurrentHatchPatternId Property
The id of the current hatch pattern.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public Guid CurrentHatchPatternId { get; set; }
Public Property CurrentHatchPatternId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace