RhinoCommon API
ViewportInfo.IsParallelProjection Property
 Get or set whether this projection is parallel.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsParallelProjection { get; set; }
Public Property IsParallelProjection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace