RhinoCommon API
GripObject.OriginalLocation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.GripObject.OriginalLocation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d OriginalLocation { get; }
Public ReadOnly Property OriginalLocation As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace