RhinoCommon API
AppearanceSettingsState.WorldCoordIconYAxisColor Property
Gets or sets the color of the world Y axis of the world coordinate icon, appearing usually bottom left in viewports.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color WorldCoordIconYAxisColor { get; set; }
Public Property WorldCoordIconYAxisColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace