RhinoCommon API
MeshDisplacementInfo.MappingTransform Property
 Texture mapping transform.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Transform MappingTransform { get; set; }
Public Property MappingTransform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace