RhinoCommon API
LicenseStatus.ProductIcon Property
The product's icon. Note, this can be null.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Icon ProductIcon { get; set; }
Public Property ProductIcon As Icon
	Get
	Set
Property Value
Type: Icon
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace