RhinoCommon API
DisplayPipelineAttributes.ControlPolygonShowSurface Property
 Shows the object while the control polygon is displayed.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ControlPolygonShowSurface { get; set; }
Public Property ControlPolygonShowSurface As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace