RhinoCommon API
RenderSettings.Dithering Property
 If this object is associated with a document, this gets the document dithering. If this object is associated with a File3dm, this gets the File3dm's dithering. Otherwise it gets a 'free-floating' dithering object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Dithering Dithering { get; }
Public ReadOnly Property Dithering As Dithering
	Get
Property Value
Type: Dithering
See Also
Reference
RenderSettings Class
Rhino.Render Namespace