RhinoCommon API
RhinoApp.IsClosing Property
 Returns true if Rhino is in the process of closing, false otherwise. This can be true even before the Closing event fires, such as when RhinoDoc.CloseDocument event is called.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.26
Syntax
public static bool IsClosing { get; }
Public Shared ReadOnly Property IsClosing As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace