RhinoCommon API
AppearanceSettings.CrosshairScreenLength Property
Gets or sets a value that determines the length, in pixels, of the cross hairs if they are visible.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static double CrosshairScreenLength { get; set; }
Public Shared Property CrosshairScreenLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace