RhinoCommon API
DimensionStyle.ToleranceZeroSuppress Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ToleranceZeroSuppress"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.ZeroSuppression ToleranceZeroSuppress { get; set; }
Public Property ToleranceZeroSuppress As DimensionStyle.ZeroSuppression
	Get
	Set
Property Value
Type: DimensionStyle.ZeroSuppression
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace