RhinoCommon API
FileSkpReadOptions.WeldAngle Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSkpReadOptions.WeldAngle"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double WeldAngle { get; set; }
Public Property WeldAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileSkpReadOptions Class
Rhino.FileIO Namespace