RhinoCommon API
DisplayPipelineAttributes.SubDCreaseInteriorEdgeThickness Property
 Edge thickness (pixels).
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public float SubDCreaseInteriorEdgeThickness { get; set; }
Public Property SubDCreaseInteriorEdgeThickness As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace