RhinoCommon API
ViewCapture.DrawGrid Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.DrawGrid"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DrawGrid { get; set; }
Public Property DrawGrid As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCapture Class
Rhino.Display Namespace