RhinoCommon API
ViewCaptureSettings.FooterText Property
 Text drawn at the bottom of the output
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public string FooterText { get; set; }
Public Property FooterText As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace