RhinoCommon API
MatchSrfSettings.OtherEnd Property
 Maintain the shape of the edge opposite the one being edited None: opposite edge is free to change C0_continuous: opposite edge position only G1_continuous: opposite edge position and tangency G2_continuous: opposite edge position, tangency and curvature
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public Continuity OtherEnd { get; }
Public ReadOnly Property OtherEnd As Continuity
	Get
Property Value
Type: Continuity
See Also
Reference
MatchSrfSettings Class
Rhino.Geometry Namespace