RhinoCommon API
UserInterfaceGrid.BorderColor Property
[Missing <summary> documentation for "P:Rhino.UI.UserInterfaceGrid.BorderColor"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color BorderColor { get; set; }
Public Property BorderColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace