RhinoCommon API
PostEffectUuids.WireframeAnnotationsRGBA Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.WireframeAnnotationsRGBA"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid WireframeAnnotationsRGBA { get; }
Public Shared ReadOnly Property WireframeAnnotationsRGBA As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace