RhinoCommon API
RenderMaterial.SmellsLikePaint Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikePaint"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SmellsLikePaint { get; }
Public ReadOnly Property SmellsLikePaint As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace