RhinoCommon API
DisplayPipelineAttributes.CurveThickness Property
Pixel thickness for curves
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public int CurveThickness { get; set; }
Public Property CurveThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace