RhinoCommon API
NurbsCurveFitParameters.VariablePointCount Property
[Missing <summary> documentation for "P:Rhino.Geometry.NurbsCurveFitParameters.VariablePointCount"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int VariablePointCount { get; }
Public ReadOnly Property VariablePointCount As Integer
	Get
Return Value
Type: Int32
 Returns true if the best fit in a range of point counts should be returned.
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace