RhinoCommon API
CurveIntersections.Count Property
 Gets the number of recorded intersection events.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
CurveIntersections Class
Rhino.Geometry.Intersect Namespace