RhinoCommon API
NamedConstructionPlaneTable.Document Property
Gets the document that owns this table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
NamedConstructionPlaneTable Class
Rhino.DocObjects.Tables Namespace