RhinoCommon API
CurvatureAnalysisSettingsState.MaxRadiusRange Property
 Gets or sets the Maximum Radius curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Interval MaxRadiusRange { get; set; }
Public Property MaxRadiusRange As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
CurvatureAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace