RhinoCommon API
Transform2d.IsZeroTransformation Property
 True if every value is 0. This transformation maps every point to (0,0).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsZeroTransformation { get; }
Public ReadOnly Property IsZeroTransformation As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace