RhinoCommon API
AppearanceSettingsState.TrackingColor Property
Gets or sets the tracking color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color TrackingColor { get; set; }
Public Property TrackingColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace