RhinoCommon API
Font.AscentOfCapital Property
 The font's typographic capital height, in the design units reported by UnitsPerEm. This is the metric a "text height" is measured against, so text of height h renders its capitals h tall. Zero when the font has no usable metrics.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int AscentOfCapital { get; }
Public ReadOnly Property AscentOfCapital As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Font Class
Rhino.DocObjects Namespace