RhinoCommon API
PhysicallyBasedMaterial.BaseColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.BaseColor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Color4f BaseColor { get; set; }
Public Property BaseColor As Color4f
	Get
	Set
Property Value
Type: Color4f
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace