RhinoCommon API
TextDotUserInterfaceObject.DotBorderColor Property
 Text dot border color
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color DotBorderColor { get; set; }
Public Property DotBorderColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
TextDotUserInterfaceObject Class
Rhino.UI Namespace