RhinoCommon API
AppearanceSettingsState.CrosshairColor Property
Gets or sets the crosshair color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color CrosshairColor { get; set; }
Public Property CrosshairColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace