RhinoCommon API
UserDataListEnumerator.Current Property
 Get current UserData on the enumerator.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public UserData Current { get; }
Public ReadOnly Property Current As UserData
	Get
Property Value
Type: UserData
Implements
IEnumerator<T>.Current
See Also
Reference
UserDataListEnumerator Class
Rhino.DocObjects.Custom Namespace