RhinoCommon API
FileCsvWriteOptions.AttributesKeys Property
User text
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool AttributesKeys { get; set; }
Public Property AttributesKeys As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace