RhinoCommon API
DisplayAttributeMaterial.Diffuse Property
 Diffuse color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color Diffuse { get; set; }
Public Property Diffuse As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace