RhinoCommon API
ObjectAttributes.LinetypePatternScale Property
 Per object linetype scale
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double LinetypePatternScale { get; set; }
Public Property LinetypePatternScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace