RhinoCommon API
DraftAngleAnalysisSettings.UpDirection Property
 The up direction.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Vector3d UpDirection { get; set; }
Public Shared Property UpDirection As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
DraftAngleAnalysisSettings Class
Rhino.ApplicationSettings Namespace