RhinoCommon API
DisplayPipelineAttributes.MeshNonmanifoldEdgeColor Property
 Sets the nonmanifold edge color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public Color MeshNonmanifoldEdgeColor { get; set; }
Public Property MeshNonmanifoldEdgeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace