RhinoCommon API
FileDwgWriteOptions.CurveUseChordHeight Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgWriteOptions.CurveUseChordHeight"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool CurveUseChordHeight { get; set; }
Public Property CurveUseChordHeight As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace