RhinoCommon API
Linetype.ShapeGap Property
 If shapes are present in this linetype, this is the gap around the shape.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double ShapeGap { get; set; }
Public Property ShapeGap As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace