RhinoCommon API
BrepFace.Id Property
 Gets or sets the persistent id of this Brep face. By default, the id is Guid.Zero. Note, Rhino does not set this id. Thus, the property is available for use as a way of tracking Brep faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace