RhinoCommon API
File3mfWriteOptions.LicenseTerms Property
[Missing <summary> documentation for "P:Rhino.FileIO.File3mfWriteOptions.LicenseTerms"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public string LicenseTerms { get; set; }
Public Property LicenseTerms As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3mfWriteOptions Class
Rhino.FileIO Namespace