RhinoCommon API
FileDwgWriteOptions.Version Property
 Version of DWG file to write
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileDwgWriteOptions.AutocadVersion Version { get; set; }
Public Property Version As FileDwgWriteOptions.AutocadVersion
	Get
	Set
Property Value
Type: FileDwgWriteOptions.AutocadVersion
Remarks
 Updated default acad version to 2018 in Rhino V9
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace