RhinoCommon API
NurbsCurve.Order Property
 Gets the order of the curve. Order = Degree + 1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Order { get; }
Public ReadOnly Property Order As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace