RhinoCommon API
CloudHostUtils.AppliesToThisInstance Property
 True only when this instance is subject to Marketplace entitlement gating (its EC2 identity document claims our product code). Decoupled from IsEntitled: an instance can apply yet be denied. False for non-EC2, classic EC2, other products, and on any error. Run-gate enforcement consults this to know whether the gate applies.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool AppliesToThisInstance { get; }
Public Shared ReadOnly Property AppliesToThisInstance As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CloudHostUtils Class
Rhino.Runtime Namespace