RhinoCommon API
RhinoDoc.ModelAngleToleranceDegrees Property
Model space angle tolerance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ModelAngleToleranceDegrees { get; set; }
Public Property ModelAngleToleranceDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RhinoDoc Class
Rhino Namespace