RhinoCommon API
FileVrmlWriteOptions.ExportTextureCoordinates Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVrmlWriteOptions.ExportTextureCoordinates"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ExportTextureCoordinates { get; set; }
Public Property ExportTextureCoordinates As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileVrmlWriteOptions Class
Rhino.FileIO Namespace