RhinoCommon API
GripObject.OwnerId Property
[Missing <summary> documentation for "P:Rhino.DocObjects.GripObject.OwnerId"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid OwnerId { get; }
Public ReadOnly Property OwnerId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace