RhinoCommon API
GetEllipsoid.IsModeFromFoci Property
 Indicates the ellipsoid was created from foci.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool IsModeFromFoci { get; }
Public ReadOnly Property IsModeFromFoci As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetEllipsoid Class
Rhino.Input.Custom Namespace