RhinoCommon API
HiddenLineDrawingSegment.IsSceneSilhouette Property
 Returns true if this curve is a scene silhouette.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsSceneSilhouette { get; }
Public ReadOnly Property IsSceneSilhouette As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HiddenLineDrawingSegment Class
Rhino.Geometry Namespace