RhinoCommon API
GetCircle.UseActiveLayerLinetypeForCurves Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCircle.UseActiveLayerLinetypeForCurves"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool UseActiveLayerLinetypeForCurves { get; set; }
Public Property UseActiveLayerLinetypeForCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetCircle Class
Rhino.Input.Custom Namespace