RhinoCommon API
Brep.VariationalPatchSettings.Stretching Property
 Stretching to apply (default 0, better not change)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Stretching { get; set; }
Public Property Stretching As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace