RhinoCommon API
DisplayPipelineAttributes.ControlPolygonStyle Property
 PointStyle for the control polygon. Supported values are ControlPoint, RoundControlPoint, VariableDot, and RoundDot
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public PointStyle ControlPolygonStyle { get; set; }
Public Property ControlPolygonStyle As PointStyle
	Get
	Set
Property Value
Type: PointStyle
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace