RhinoCommon API
Font.EnglishQuartetName Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.EnglishQuartetName"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public string EnglishQuartetName { get; }
Public ReadOnly Property EnglishQuartetName As String
	Get
Property Value
Type: String
See Also
Reference
Font Class
Rhino.DocObjects Namespace