RhinoCommon API
Mesh.VertexColors Property
 Gets access to the (optional) vertex color collection in this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public MeshVertexColorList VertexColors { get; }
Public ReadOnly Property VertexColors As MeshVertexColorList
	Get
Property Value
Type: MeshVertexColorList
See Also
Reference
Mesh Class
Rhino.Geometry Namespace