RhinoCommon API
DisplayPipelineAttributes.CustomGroundPlaneAltitude Property
 Height above the world XY plane in model units
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public double CustomGroundPlaneAltitude { get; set; }
Public Property CustomGroundPlaneAltitude As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace