RhinoCommon API
DisplayPipelineAttributes.SurfaceEdgeThickness Property
 Thickness for surface edges
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public int SurfaceEdgeThickness { get; set; }
Public Property SurfaceEdgeThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace