RhinoCommon API
File3dsReadOptions.ImportCameras Property
[Missing <summary> documentation for "P:Rhino.FileIO.File3dsReadOptions.ImportCameras"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportCameras { get; set; }
Public Property ImportCameras As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dsReadOptions Class
Rhino.FileIO Namespace