RhinoCommon API
ViewInfo.LockedProjection Property
Whether the view's projection is locked against changes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool LockedProjection { get; set; }
Public Property LockedProjection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace