RhinoCommon API
ICollapsibleSection.BackgroundColor Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.BackgroundColor"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
Color BackgroundColor { get; set; }
Property BackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace