RhinoCommon API
Dimension.AltToleranceResolution Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AltToleranceResolution"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int AltToleranceResolution { get; set; }
Public Property AltToleranceResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Dimension Class
Rhino.Geometry Namespace