RhinoCommon API
Font.IsSymbolFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.IsSymbolFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public bool IsSymbolFont { get; }
Public ReadOnly Property IsSymbolFont As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Font Class
Rhino.DocObjects Namespace