RhinoCommon API
PostEffectUuids.ToneMapper_Logarithmic Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.ToneMapper_Logarithmic"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid ToneMapper_Logarithmic { get; }
Public Shared ReadOnly Property ToneMapper_Logarithmic As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace