RhinoCommon API
File3dm.EmbeddedFiles Property
 The embedded files in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmEmbeddedFiles EmbeddedFiles { get; }
Public ReadOnly Property EmbeddedFiles As File3dmEmbeddedFiles
	Get
Property Value
Type: File3dmEmbeddedFiles
See Also
Reference
File3dm Class
Rhino.FileIO Namespace