RhinoCommon API
DisplayPipelineAttributes.SurfaceNakedEdgeColor Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public Color SurfaceNakedEdgeColor { get; set; }
Public Property SurfaceNakedEdgeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace