RhinoCommon API
Box.Area Property
 Gets the total surface area of this box, or UnsetValue for an invalid box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
Property Value
Type: Double
See Also
Reference
Box Structure
Rhino.Geometry Namespace