RhinoCommon API
RhinoDoc.Lights Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.Lights"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public LightTable Lights { get; }
Public ReadOnly Property Lights As LightTable
	Get
Property Value
Type: LightTable
See Also
Reference
RhinoDoc Class
Rhino Namespace