RhinoCommon API
PointCloudItem.PointValue Property
 Gets or set the extra value of this point cloud item. The extra value can be used to store a user-defined value, such as intensity. If this point cloud item does not have an extra value, RhinoMath.UnsetValue is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public double PointValue { get; set; }
Public Property PointValue As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace