RhinoCommon API
TextureMapping.Projection Property
 See Projection
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public Projection Projection { get; set; }
Public Property Projection As Projection
	Get
	Set
Property Value
Type: Projection
See Also
Reference
TextureMapping Class
Rhino.Render Namespace