RhinoCommon API
Field.TextureAmountMin Property
 Set Min value for Texture amount
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double TextureAmountMin { get; set; }
Public Property TextureAmountMin As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Field Class
Rhino.Render.Fields Namespace