RhinoCommon API
Dimension.SuppressDimensionLine2 Property
 Suppresses the dimension line and arrowhead between the second extension line and the dimension text.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SuppressDimensionLine2 { get; set; }
Public Property SuppressDimensionLine2 As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dimension Class
Rhino.Geometry Namespace