RhinoCommon API
WorksessionFileLayerOverride.LayerId Property
Gets or sets the id of the layer in the reference model file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Guid LayerId { get; set; }
Public Property LayerId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
WorksessionFileLayerOverride Class
Rhino.FileIO Namespace