RhinoCommon API
ContentUuids.FBmTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.FBmTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid FBmTextureType { get; }
Public Shared ReadOnly Property FBmTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace