RhinoCommon API
IsoDrawEffect.Frequency Property
[Missing <summary> documentation for "P:Rhino.Display.IsoDrawEffect.Frequency"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Frequency { get; set; }
Public Property Frequency As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace