RhinoCommon API
CommandEventArgs.CommandId Property
 Gets the ID of the command that raised this event.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid CommandId { get; }
Public ReadOnly Property CommandId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace