RhinoCommon API
SnapShotsClient.CppPointer Property
[Missing <summary> documentation for "P:Rhino.DocObjects.SnapShots.SnapShotsClient.CppPointer"]
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace