RhinoCommon API
SubDComponentParameter.EdgeParameter Property
 Gets a value between 0 and 1 identifying a point on the edge, or NaN if IsEdgeParameter is false.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double EdgeParameter { get; }
Public ReadOnly Property EdgeParameter As Double
	Get
Property Value
Type: Double
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace