RhinoCommon API
Vector2f.XAxis Property
 Gets the value of the vector with components 1,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector2f XAxis { get; }
Public Shared ReadOnly Property XAxis As Vector2f
	Get
Property Value
Type: Vector2f
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace