RhinoCommon API
EarthAnchorPoint.KMLOrientationRollAngleRadians Property
 Gets Keyhole Markup Language (KML) orientation roll angle in degrees.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public double KMLOrientationRollAngleRadians { get; }
Public ReadOnly Property KMLOrientationRollAngleRadians As Double
	Get
Property Value
Type: Double
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace