RhinoCommon API
FilePdf.LayersAsOptionalContentGroups Property
 Add layers as "optional content groups" to the PDF. This is the visible layer tree available in PDF viewers
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool LayersAsOptionalContentGroups { get; set; }
Public Property LayersAsOptionalContentGroups As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace