RhinoCommon API
CloudHostUtils.IsEntitled Property
True when the running instance is entitled by its cloud provider. See ICloudHost remarks for tri-state semantics.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.33
Syntax
public static bool IsEntitled { get; }
Public Shared ReadOnly Property IsEntitled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CloudHostUtils Class
Rhino.Runtime Namespace