RhinoCommon API
RenderContent.ModelUnits Property
 Units used by this instance on length fields.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public LengthUnit ModelUnits { get; }
Public ReadOnly Property ModelUnits As LengthUnit
	Get
Property Value
Type: LengthUnit
See Also
Reference
RenderContent Class
Rhino.Render Namespace