RhinoCommon API
DisplayPen.HaloColor Property
 Halos are blended colors drawn around a curve for purposes like selection
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Color HaloColor { get; set; }
Public Property HaloColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPen Class
Rhino.Display Namespace