RhinoCommon API
ModelAidSettings.ProjectSnapToCPlane Property
Gets or sets the enabled state of Rhino's Project modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool ProjectSnapToCPlane { get; set; }
Public Shared Property ProjectSnapToCPlane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace