RhinoCommon API
LengthValue.ContextAngleUnitSystem Property
 Returns the context AngleUnitSystem from this LengthValue's ParseSettings
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public AngleUnitSystem ContextAngleUnitSystem { get; }
Public ReadOnly Property ContextAngleUnitSystem As AngleUnitSystem
	Get
Property Value
Type: AngleUnitSystem
See Also
Reference
LengthValue Class
Rhino Namespace