RhinoCommon API
GetCurve.KnotSpacing Property
 Knot spacing used when interpolating. Default is Chord. Only Uniform, Chord and ChordSquareRoot are accepted. Closing the curve selects the periodic form of the value set here, so passing a periodic value would take the knot style out of range. Ignored when SubDFriendly is true.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public CurveKnotStyle KnotSpacing { get; set; }
Public Property KnotSpacing As CurveKnotStyle
	Get
	Set
Property Value
Type: CurveKnotStyle
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the value is not Uniform, Chord or ChordSquareRoot.
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace