RhinoCommon API
ObjectGripsIds.CurveEditPoints Property
A grip at every Greville point of a curve. EditPtOn turns these on.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid CurveEditPoints { get; }
Public Shared ReadOnly Property CurveEditPoints As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ObjectGripsIds Class
Rhino.DocObjects Namespace