RhinoCommon API
Brep.FilletSurfaceSettings.Tolerance Property
 The tolerance. When in doubt, use the document's model absolute tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Tolerance { get; }
Public ReadOnly Property Tolerance As Double
	Get
Property Value
Type: Double
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace