RhinoCommon API
PageViewGroupTableEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.PageViewGroupTableEventArgs.Document"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
PageViewGroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace