RhinoCommon API
Decal.Height Property
 Gets the height of the decal. Only used when mapping is cylindrical.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Decal Class
Rhino.Render Namespace