RhinoCommon API
SurfaceCurvature.Gaussian Property
 The Gaussian curvature is kappa1*kappa2.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Gaussian { get; }
Public ReadOnly Property Gaussian As Double
	Get
Property Value
Type: Double
Remarks
 If this is set, the Gausian curvature is returned. Otherwise, the quiet NaN is returned.
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace