RhinoCommon API
RhinoDoc.Markups Property
 Collection of markups in this document
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public MarkupTable Markups { get; }
Public ReadOnly Property Markups As MarkupTable
	Get
Property Value
Type: MarkupTable
See Also
Reference
RhinoDoc Class
Rhino Namespace