RhinoCommon API
FileObjWriteOptions.WrapLongLines Property
 Setting to enable/disable line wrapping with "\"s
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool WrapLongLines { get; set; }
Public Property WrapLongLines As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace