RhinoCommon API
Mesh.Object Property
 Get a copy of the original RhinoObject this Mesh is created from. Possible only after return true from ChangeQueue.ProvideOriginalObject(). Access this only with a using(var o = mesh.Object) {} construct. Note that the object is free floating, i.e. not part of a document.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public RhinoObject Object { get; }
Public ReadOnly Property Object As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace