RhinoCommon API
DimensionStyle.TextVerticalAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextVerticalAlignment"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextVerticalAlignment TextVerticalAlignment { get; set; }
Public Property TextVerticalAlignment As TextVerticalAlignment
	Get
	Set
Property Value
Type: TextVerticalAlignment
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace