RhinoCommon API
DisplayModeChangedEventArgs.RhinoDoc Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeChangedEventArgs.RhinoDoc"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public RhinoDoc RhinoDoc { get; }
Public ReadOnly Property RhinoDoc As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
DisplayModeChangedEventArgs Class
Rhino.Display Namespace