RhinoCommon API
DisplayPipelineAttributes.ClippingShadeColorUsage Property
 Specifies how to shade the clipping plane
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public DisplayPipelineAttributes.ClippingShadeColorUse ClippingShadeColorUsage { get; set; }
Public Property ClippingShadeColorUsage As DisplayPipelineAttributes.ClippingShadeColorUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.ClippingShadeColorUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace