RhinoCommon API
RhinoDoc.WorksessionFileChangedEventArgs.FilePath Property
Full path of the .3dm file being attached or detached.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string FilePath { get; }
Public ReadOnly Property FilePath As String
	Get
Property Value
Type: String
See Also
Reference
RhinoDoc.WorksessionFileChangedEventArgs Class
Rhino Namespace