RhinoCommon API
SmartTrackSettings.TanPerpLineColor Property
Gets or sets the tangent and perpendicular line color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color TanPerpLineColor { get; set; }
Public Shared Property TanPerpLineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace