RhinoCommon API
NurbsCurveFitParameters.MinimumClampedPointCount Property
 The minimum clamped point count
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int MinimumClampedPointCount { get; }
Public Shared ReadOnly Property MinimumClampedPointCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace