RhinoCommon API
Environment.BackgroundColor Property
Return Value
Type: Color
The background color.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Color BackgroundColor { get; }
Public ReadOnly Property BackgroundColor As Color
	Get
Property Value
Type: Color
See Also
Reference
Environment Class
Rhino.DocObjects Namespace