RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.ClearcoatBump Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.ClearcoatBump"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.16
Syntax
[ObsoleteAttribute]
public static string ClearcoatBump { get; }
<ObsoleteAttribute>
Public Shared ReadOnly Property ClearcoatBump As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace