RhinoCommon API
ObjectPropertiesPage.Icon Property
Note: This API is now obsolete.
 (OBSOLETE - Override PageIcon instead) Icon to display in the object properties tab control
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Override PageIcon instead")]
public virtual Icon Icon { get; }
<ObsoleteAttribute("Override PageIcon instead")>
Public Overridable ReadOnly Property Icon As Icon
	Get
Property Value
Type: Icon
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace