RhinoCommon API
Plane.OriginZ Property
 Gets or sets the Z coordinate of the origin of this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double OriginZ { get; set; }
Public Property OriginZ As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Plane Structure
Rhino.Geometry Namespace