RhinoCommon API
File3dmDisplacement.MappingChannel Property
 Specifies which texture mapping channel is used for the displacement texture.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int MappingChannel { get; set; }
Public Property MappingChannel As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace