RhinoCommon API
Color4f.R Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.R"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public float R { get; }
Public ReadOnly Property R As Single
	Get
Property Value
Type: Single
See Also
Reference
Color4f Structure
Rhino.Display Namespace