RhinoCommon API
DisplayModeDescription.Id Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.Id"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace