RhinoCommon API
Utilities.DefaultRenderPlugInId Property
 Get the plug-in Id for the default render plug-in
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public static Guid DefaultRenderPlugInId { get; }
Public Shared ReadOnly Property DefaultRenderPlugInId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
Utilities Class
Rhino.Render Namespace