RhinoCommon API
HatchLine.Offset Property
 Get and sets this line's 2d offset for line repetitions. Offset.X is shift parallel to line. Offset.Y is spacing perpendicular to line.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Vector2d Offset { get; set; }
Public Property Offset As Vector2d
	Get
	Set
Property Value
Type: Vector2d
See Also
Reference
HatchLine Class
Rhino.DocObjects Namespace