RhinoCommon API
GroundPlane.ShadowOnly Property
 Determines whether the ground plane shows the material assigned, or whether it is transparent, but captures shadows.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ShadowOnly { get; set; }
Public Property ShadowOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GroundPlane Class
Rhino.Render Namespace