RhinoCommon API
RebuildCurveOptions.MaximumDegreeLimit Property
 The maximum value a user interface may specify as a degree value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int MaximumDegreeLimit { get; }
Public ReadOnly Property MaximumDegreeLimit As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace