RhinoCommon API
DisplayPipelineAttributes.SubDReflectionAxisLineThickness Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SubDReflectionAxisLineThickness"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public float SubDReflectionAxisLineThickness { get; set; }
Public Property SubDReflectionAxisLineThickness As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace