RhinoCommon API
DisplayPipelineAttributes.BackMaterial Property
 The material used to shade the back faces of an object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public DisplayAttributeMaterial BackMaterial { get; }
Public ReadOnly Property BackMaterial As DisplayAttributeMaterial
	Get
Property Value
Type: DisplayAttributeMaterial
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace