RhinoCommon API
AnimationProperties.HtmlFullPath Property
 Return HTML file path consisting of FolderName and HtmlFileName. To change this set FolderName and HtmlFileName.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public string HtmlFullPath { get; }
Public ReadOnly Property HtmlFullPath As String
	Get
Property Value
Type: String
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace