RhinoCommon API
DisplayPipelineAttributes.LocalName Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.LocalName"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string LocalName { get; }
Public ReadOnly Property LocalName As String
	Get
Property Value
Type: String
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace