RhinoCommon API
DimensionStyle.AlternateToleranceResolution Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateToleranceResolution"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int AlternateToleranceResolution { get; set; }
Public Property AlternateToleranceResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace