RhinoCommon API
NurbsCurveFitParameters.MaximumPointCount Property
 Gets the maximum number of points supported for NURBS curve fitting operations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int MaximumPointCount { get; }
Public Shared ReadOnly Property MaximumPointCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace