RhinoCommon API
RhinoDoc.RenderMaterialAssignmentChangedEventArgs.IsLayer Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.IsLayer"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public bool IsLayer { get; }
Public ReadOnly Property IsLayer As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc.RenderMaterialAssignmentChangedEventArgs Class
Rhino Namespace