RhinoCommon API
CursorTooltipSettingsState.OsnapPane Property
 Displays the current object snap selection.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool OsnapPane { get; set; }
Public Property OsnapPane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace