RhinoCommon API
Vector3f.Unset Property
 Gets the value of the vector with each component set to RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector3f Unset { get; }
Public Shared ReadOnly Property Unset As Vector3f
	Get
Property Value
Type: Vector3f
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace