RhinoCommon API
PlugInInfo.CommandNames Property
 Returns a plug-in's English command names.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string[] CommandNames { get; }
Public ReadOnly Property CommandNames As String()
	Get
Property Value
Type: String[]
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace