RhinoCommon API
PostEffectUuids.Fog Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.Fog"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid Fog { get; }
Public Shared ReadOnly Property Fog As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace