RhinoCommon API
NurbsCurveFitParameters.DefaultSampleCount Property
 Default number of points to sample from input curves and pass to the fitter that creates the output NURBS curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int DefaultSampleCount { get; }
Public Shared ReadOnly Property DefaultSampleCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace