RhinoCommon API
GripsDrawEventArgs.GripStatusCount Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripsDrawEventArgs.GripStatusCount"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int GripStatusCount { get; }
Public ReadOnly Property GripStatusCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace