RhinoCommon API
ModelAidSettings.OsnapCursorMode Property
Gets or sets the OSnap cursor mode.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static CursorMode OsnapCursorMode { get; set; }
Public Shared Property OsnapCursorMode As CursorMode
	Get
	Set
Property Value
Type: CursorMode
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace