RhinoCommon API
FileStpWriteOptions.ExportBlack Property
 Let importing application set color for black objects. If a Rhino object has color black, no color is assigned to the object in the step file.This will cause the importing application to give the object its default color.This is desirable because black objects look like ink blots in some applications.This option is grayed out if the schema option is AP203ControConfigDesign since that schema does not include color entities.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool ExportBlack { get; set; }
Public Property ExportBlack As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileStpWriteOptions Class
Rhino.FileIO Namespace