RhinoCommon API
RhinoApp.CommandLineOut Property
 Provides a TextWriter that can write to the command line.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static RhinoApp.CommandLineTextWriter CommandLineOut { get; }
Public Shared ReadOnly Property CommandLineOut As RhinoApp.CommandLineTextWriter
	Get
Property Value
Type: RhinoApp.CommandLineTextWriter
See Also
Reference
RhinoApp Class
Rhino Namespace