RhinoCommon API
RibbonOffsetParameters.OffsetDistance Property
 Offset curve distance from input curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public double OffsetDistance { get; set; }
Public Property OffsetDistance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RibbonOffsetParameters Class
Rhino.Geometry Namespace