RhinoCommon API
AppearanceSettings.EchoPromptsToHistoryWindow Property
Gets or sets a value that determines if prompt messages are written to the history window.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool EchoPromptsToHistoryWindow { get; set; }
Public Shared Property EchoPromptsToHistoryWindow As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace