RhinoCommon API
LicenseStatus.BuildType Property
 The build contentType of the product, where: 100 = A release build, either commercial, education, NFR, etc. 200 = A evaluation build 300 = A beta build, such as a WIP.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public LicenseBuildType BuildType { get; set; }
Public Property BuildType As LicenseBuildType
	Get
	Set
Property Value
Type: LicenseBuildType
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace