RhinoCommon API
HiddenLineDrawingObject.Transform Property
 Returns the transformation passed into the Add... function when setting up the hidden line drawing parameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Transform Transform { get; }
Public ReadOnly Property Transform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
HiddenLineDrawingObject Class
Rhino.Geometry Namespace