RhinoCommon API
Vector3d.Unset Property
 Gets the value of the vector with each component set to RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector3d Unset { get; }
Public Shared ReadOnly Property Unset As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace