RhinoCommon API
MarkupTableEventArgs.EventType Property
The event type.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public MarkupTableEventType EventType { get; }
Public ReadOnly Property EventType As MarkupTableEventType
	Get
Property Value
Type: MarkupTableEventType
See Also
Reference
MarkupTableEventArgs Class
Rhino.DocObjects.Tables Namespace