RhinoCommon API
RhinoDoc.PageDistanceDisplayPrecision Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.PageDistanceDisplayPrecision"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public int PageDistanceDisplayPrecision { get; set; }
Public Property PageDistanceDisplayPrecision As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RhinoDoc Class
Rhino Namespace