RhinoCommon API
IntersectionEvent.PointA Property
 Gets the point on Curve A where the intersection occurred. If the intersection type is overlap, then this will return the start of the overlap region.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d PointA { get; }
Public ReadOnly Property PointA As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace