RhinoCommon API
ObjectAttributes.HatchBackgroundFillColor Property
 Fill color for hatches (default is Color.Empty)
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Color HatchBackgroundFillColor { get; set; }
Public Property HatchBackgroundFillColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace