RhinoCommon API
OptionDouble.InitialValue Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.OptionDouble.InitialValue"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double InitialValue { get; }
Public ReadOnly Property InitialValue As Double
	Get
Property Value
Type: Double
See Also
Reference
OptionDouble Class
Rhino.Input.Custom Namespace