RhinoCommon API
UserInterfaceControl.HorizontalAlignment Property
[Missing <summary> documentation for "P:Rhino.UI.UserInterfaceControl.HorizontalAlignment"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public ControlHorizontalAlignment HorizontalAlignment { get; set; }
Public Property HorizontalAlignment As ControlHorizontalAlignment
	Get
	Set
Property Value
Type: ControlHorizontalAlignment
See Also
Reference
UserInterfaceControl Class
Rhino.UI Namespace