RhinoCommon API
DisplayPipelineAttributes.SubDNonManifoldEdgeColorUsage Property
 Edge color usage
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public DisplayPipelineAttributes.SubDEdgeColorUse SubDNonManifoldEdgeColorUsage { get; set; }
Public Property SubDNonManifoldEdgeColorUsage As DisplayPipelineAttributes.SubDEdgeColorUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.SubDEdgeColorUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace