RhinoCommon API
Dimension.AltUnitsDisplay Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AltUnitsDisplay"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AltUnitsDisplay { get; set; }
Public Property AltUnitsDisplay As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dimension Class
Rhino.Geometry Namespace