RhinoCommon API
FileObjWriteOptions.UseRenderMeshes Property
 Use existing or generate render meshes instead of calling RhinoObject.MeshObjects.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool UseRenderMeshes { get; set; }
Public Property UseRenderMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace