RhinoCommon API
DisplayPipeline.IsOpenGL Property
 Gets a value indicating whether or not this pipeline is drawing into an OpenGL context.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsOpenGL { get; }
Public ReadOnly Property IsOpenGL As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace