RhinoCommon API
RhinoDoc.PostEffects Property
Note: This API is now obsolete.
 Access to the post effects
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[ObsoleteAttribute("Please use Rhino.Render.RenderSettings methods")]
public IPostEffects PostEffects { get; }
<ObsoleteAttribute("Please use Rhino.Render.RenderSettings methods")>
Public ReadOnly Property PostEffects As IPostEffects
	Get
Property Value
Type: IPostEffects
See Also
Reference
RhinoDoc Class
Rhino Namespace