RhinoCommon API
SafeFrame.ActionFrameLinked Property
 Action Frame Linked, On = Use the same scale for X and Y. Off = use different scales for X and Y.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public bool ActionFrameLinked { get; set; }
Public Property ActionFrameLinked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SafeFrame Class
Rhino.Render Namespace