RhinoCommon API
UserInterfaceControl.VerticalAlignment Property
[Missing <summary> documentation for "P:Rhino.UI.UserInterfaceControl.VerticalAlignment"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public ControlVerticalAlignment VerticalAlignment { get; set; }
Public Property VerticalAlignment As ControlVerticalAlignment
	Get
	Set
Property Value
Type: ControlVerticalAlignment
See Also
Reference
UserInterfaceControl Class
Rhino.UI Namespace