RhinoCommon API
FileAiWriteOptions.UseCMYK Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileAiWriteOptions.UseCMYK"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool UseCMYK { get; set; }
Public Property UseCMYK As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileAiWriteOptions Class
Rhino.FileIO Namespace