RhinoCommon API
Dimension.AltSuffix Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AltSuffix"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string AltSuffix { get; set; }
Public Property AltSuffix As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Dimension Class
Rhino.Geometry Namespace