RhinoCommon API
SoftTransformSettings.Enabled Property
 When enabled other unselected components on an object will be moved during a transformation within the specified radius according to the falloff shape.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool Enabled { get; set; }
Public Shared Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SoftTransformSettings Class
Rhino.ApplicationSettings Namespace