RhinoCommon API
ViewInfo.ViewType Property
 Whether this view is a model view, a layout page, a nested (detail) view, or one of the special editor views. A page view must be an orthographic top view; see PageSettings for its paper size.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public ViewType ViewType { get; set; }
Public Property ViewType As ViewType
	Get
	Set
Property Value
Type: ViewType
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace