RhinoCommon API
SurfaceCurvature.MinimumPrincipalCurvature Property
 If set, the minimum of kappa1 and kappa2 returned. Otherwise, the quiet NaN is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double MinimumPrincipalCurvature { get; }
Public ReadOnly Property MinimumPrincipalCurvature As Double
	Get
Property Value
Type: Double
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace