RhinoCommon API
GumballAppearanceSettings.MenuEnabled Property
 When MenuEnabled is true, the menu "button" is drawn on the gumball. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool MenuEnabled { get; set; }
Public Property MenuEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace