RhinoCommon API
DocumentOpenEventArgs.FileName Property
 Name of file being opened.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string FileName { get; }
Public ReadOnly Property FileName As String
	Get
Property Value
Type: String
See Also
Reference
DocumentOpenEventArgs Class
Rhino Namespace