RhinoCommon API
RhinoApp.CommandWindowCaptureEnabled Property
 Enable or disable capturing of the strings sent to the CommandWindow through Write and WriteLine calls
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool CommandWindowCaptureEnabled { get; set; }
Public Shared Property CommandWindowCaptureEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace