RhinoCommon API
CommandLineOption.CurrentToggleValue Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.CommandLineOption.CurrentToggleValue"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool? CurrentToggleValue { get; }
Public ReadOnly Property CurrentToggleValue As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace