RhinoCommon API
NurbsCurveFitParameters.UniformityIntensity Property
 Uniformity penalty used to make the distance between control points more equal. Use UniformityCoefficient() to convert this enum to the the value passed to the optimizer.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public NurbsCurveFitParameters.Intensity UniformityIntensity { get; set; }
Public Property UniformityIntensity As NurbsCurveFitParameters.Intensity
	Get
	Set
Property Value
Type: NurbsCurveFitParameters.Intensity
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace