RhinoCommon API
PlugIn.Assembly Property
Source assembly for this plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Assembly Assembly { get; }
Public ReadOnly Property Assembly As Assembly
	Get
Property Value
Type: Assembly
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace