RhinoCommon API
AnnotationBase.TextHeight Property
 AnnotationBase.TextHeight Gets the parent dimstyle for the annotation and gets or sets the text height in the dimstyle
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double TextHeight { get; set; }
Public Property TextHeight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace