RhinoCommon API
RibbonOffsetParameters.OffsetTolerance Property
 Used to determine self-intersections of offset curve, not offset error.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public double OffsetTolerance { get; set; }
Public Property OffsetTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RibbonOffsetParameters Class
Rhino.Geometry Namespace