RhinoCommon API
HatchPattern.Index Property
 Index in the hatch pattern table for this pattern. -1 if not in the table.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override int Index { get; set; }
Public Overrides Property Index As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace