RhinoCommon API
ModelAidSettingsState.AltPlusArrow Property
true mean Alt+arrow is used for nudging.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool AltPlusArrow { get; set; }
Public Property AltPlusArrow As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace