RhinoCommon API
Brep.VariationalPatchSettings.InitialSurface Property
 The initial surface to use (default: null). The initial surface may not be rational.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Surface InitialSurface { get; set; }
Public Property InitialSurface As Surface
	Get
	Set
Property Value
Type: Surface
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace