RhinoCommon API
SubDEdgeSharpness.Average Property
 Gets the average of the two end sharpness values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public double Average { get; }
Public ReadOnly Property Average As Double
	Get
Property Value
Type: Double
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace