RhinoCommon API
ProviderIds.NewContentControlAssignBy Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.NewContentControlAssignBy"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid NewContentControlAssignBy { get; }
Public Shared ReadOnly Property NewContentControlAssignBy As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace