RhinoCommon API
Point3dList.XAccess.Item Property
 Gets or sets the x-coordinate of the specified point.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Double
	Get
	Set
Parameters
index
Type: System.Int32
Index of point.
Property Value
Type: Double
See Also
Reference
Point3dList.XAccess Class
Rhino.Collections Namespace