RhinoCommon API
RenderMaterial.GemMaterialGuid Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.GemMaterialGuid"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid GemMaterialGuid { get; }
Public Shared ReadOnly Property GemMaterialGuid As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace