RhinoCommon API
FileGltfWriteOptions.UseDracoCompression Property
 Enable/disable the use of Draco mesh compression in the glTF file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public bool UseDracoCompression { get; set; }
Public Property UseDracoCompression As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace