RhinoCommon API
Mesh.TextureCoordinates Property
 Gets access to the vertex texture coordinate collection in this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public MeshTextureCoordinateList TextureCoordinates { get; }
Public ReadOnly Property TextureCoordinates As MeshTextureCoordinateList
	Get
Property Value
Type: MeshTextureCoordinateList
See Also
Reference
Mesh Class
Rhino.Geometry Namespace