RhinoCommon API
RhinoViewport.WallpaperVisible Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.WallpaperVisible"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool WallpaperVisible { get; }
Public ReadOnly Property WallpaperVisible As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace