RhinoCommon API
GumballSettings.AutoGumballAlignment Property
 Specifies the plane the gumball aligns itself to.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static GumballAlignment AutoGumballAlignment { get; set; }
Public Shared Property AutoGumballAlignment As GumballAlignment
	Get
	Set
Property Value
Type: GumballAlignment
Remarks
 Setting this does not re-align a gumball that is already on screen; the new alignment is picked up the next time the gumball is built, for example when the selection changes. Run the GumballAlignment command instead if you need the visible gumball updated.
 This setting is deliberately not part of GumballSettingsState, so it is left alone by RestoreDefaults(). This matches the RestoreDefaults behavior of the -GumballSettings command, which does not reset the alignment either.
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace