RhinoCommon API
Symbols.DegreeSymbol Property
 Degree symbol used for angles
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static char DegreeSymbol { get; }
Public Shared ReadOnly Property DegreeSymbol As Char
	Get
Property Value
Type: Char
See Also
Reference
Symbols Class
Rhino Namespace