RhinoCommon API
PanelIds.Notes Property
 Rhino Notes panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public static Guid Notes { get; }
Public Shared ReadOnly Property Notes As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace