RhinoCommon API
DisplayPipelineAttributes.ShowCurves Property
Draw curves
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public bool ShowCurves { get; set; }
Public Property ShowCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace