RhinoCommon API
OptionString.CurrentValue Property
 Gets and sets the current value of the option.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string CurrentValue { get; set; }
Public Property CurrentValue As String
	Get
	Set
Property Value
Type: String
See Also
Reference
OptionString Class
Rhino.Input.Custom Namespace