RhinoCommon API
FileXamlWriteOptions.AddRotationAnimation Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileXamlWriteOptions.AddRotationAnimation"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool AddRotationAnimation { get; set; }
Public Property AddRotationAnimation As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileXamlWriteOptions Class
Rhino.FileIO Namespace