RhinoCommon API
Brep.Curves3D Property
 Pointers to 3d curves (used by edges)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public BrepCurveList Curves3D { get; }
Public ReadOnly Property Curves3D As BrepCurveList
	Get
Property Value
Type: BrepCurveList
See Also
Reference
Brep Class
Rhino.Geometry Namespace