RhinoCommon API
DirectionAnalysisSettingsState.Direction Property
 Gets or sets whether to display the direction.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Direction { get; set; }
Public Property Direction As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DirectionAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace