RhinoCommon API
QuadRemeshParameters.TargetEdgeLength Property
 When TargetEdgeLength is greater than 0 TargetQuadCount will be re-computed with the target goal of an approximated edge length based on the area of the input mesh e.g TargetQuadCount = Input mesh Area * sqr(TargetEdgeLength) AdaptiveSize as well as AdaptiveQuadCount will also be ignored;
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public double TargetEdgeLength { get; set; }
Public Property TargetEdgeLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
QuadRemeshParameters Class
Rhino.Geometry Namespace