RhinoCommon API
File3dm.RenderTextures Property
 The render textures in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmRenderTextures RenderTextures { get; }
Public ReadOnly Property RenderTextures As File3dmRenderTextures
	Get
Property Value
Type: File3dmRenderTextures
See Also
Reference
File3dm Class
Rhino.FileIO Namespace