RhinoCommon API
Light.Ambient Property
 Gets or sets the ambient color.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color Ambient { get; set; }
Public Property Ambient As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Light Class
Rhino.Geometry Namespace