RhinoCommon API
GetPolyline.FourthPointPrompt Property
Prompt when getting fourth point
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string FourthPointPrompt { get; set; }
Public Property FourthPointPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace