RhinoCommon API
UndoRedoEventArgs.IsBeforeEndRecording Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsBeforeEndRecording"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsBeforeEndRecording { get; }
Public ReadOnly Property IsBeforeEndRecording As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace