RhinoCommon API
AppearanceSettings.CrosshairsAlignedToScreen Property
 Gets or sets a value that determines if the cross hairs are drawn horizontally and vertically on the screen (as if fixed to the camera) instead of running along the construction plane's x and y axes. When enabled, the cross hairs stay vertical and horizontal as the view is rotated, for example in a perspective viewport.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool CrosshairsAlignedToScreen { get; set; }
Public Shared Property CrosshairsAlignedToScreen As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace