RhinoCommon API
DisplayPipelineAttributes.SubDSmoothInteriorEdgeColor Property
 Edge color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public Color SubDSmoothInteriorEdgeColor { get; set; }
Public Property SubDSmoothInteriorEdgeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace