RhinoCommon API
AppearanceSettings.GridYAxisLineColor Property
 Gets or sets the color of the Y axis of the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color GridYAxisLineColor { get; set; }
Public Shared Property GridYAxisLineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace