RhinoCommon API
PreviewAppearance.Scale Property
 Size - used in the UI. Always meters.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double Scale { get; set; }
Public Property Scale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace