RhinoCommon API
AppearanceSettings.EchoCommandsToHistoryWindow Property
Gets or sets a value that determines if command names are written to the history window.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool EchoCommandsToHistoryWindow { get; set; }
Public Shared Property EchoCommandsToHistoryWindow As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace