RhinoCommon API
FileWriteOptions.OptionsDictionary Property
 Additional read options.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public ArchivableDictionary OptionsDictionary { get; }
Public ReadOnly Property OptionsDictionary As ArchivableDictionary
	Get
Property Value
Type: ArchivableDictionary
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace