RhinoCommon API
ManifestTable.ComponentType Property
 Returns Mixed.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ModelComponentType ComponentType { get; }
Public ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace