RhinoCommon API
Point3f.Z Property
 Gets or sets the Z (third) component of the vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public float Z { get; set; }
Public Property Z As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace