RhinoCommon API
LinearDimension.AnnotationType Property
[Missing <summary> documentation for "P:Rhino.Geometry.LinearDimension.AnnotationType"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public AnnotationType AnnotationType { get; set; }
Public Property AnnotationType As AnnotationType
	Get
	Set
Property Value
Type: AnnotationType
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace