RhinoCommon API
DisplayPipelineAttributes.CustomGroundPlaneShadowOnly Property
 Makes the ground plane transparent, but allows shadows to still be cast on it.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public bool CustomGroundPlaneShadowOnly { get; set; }
Public Property CustomGroundPlaneShadowOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace