RhinoCommon API
RenderWindowClonedEventArgs.NewSessionId Property
[Missing <summary> documentation for "P:Rhino.Render.RenderWindowClonedEventArgs.NewSessionId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public Guid NewSessionId { get; }
Public ReadOnly Property NewSessionId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderWindowClonedEventArgs Class
Rhino.Render Namespace