RhinoCommon API
UserInterfaceTextBox.MaximumLength Property
 Most characters the text will hold. 0, the default, means no limit.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int MaximumLength { get; set; }
Public Property MaximumLength As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace