RhinoCommon API
Notification.ShowEventId Property
 A field used by Rhino for displaying notifications. Not intended for public use.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid? ShowEventId { get; }
Public ReadOnly Property ShowEventId As Guid?
	Get
Property Value
Type: Nullable<Guid>
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace