RhinoCommon API
Brep.VariationalPatchSettings.Bending Property
 Bending to apply (default 0.3)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Bending { get; set; }
Public Property Bending As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace