RhinoCommon API
FileAiWriteOptions.ExportViewBoundary Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileAiWriteOptions.ExportViewBoundary"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ExportViewBoundary { get; set; }
Public Property ExportViewBoundary As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileAiWriteOptions Class
Rhino.FileIO Namespace