RhinoCommon API
DimensionStyle.TextMoveLeader Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextMoveLeader"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int TextMoveLeader { get; set; }
Public Property TextMoveLeader As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace