RhinoCommon API
ColorLCH.C Property
 Gets or sets the Chroma channel. Chroma is defined from -1.0 to +1.0.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double C { get; set; }
Public Property C As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace