RhinoCommon API
PhysicallyBased.Sheen Property
[Missing <summary> documentation for "P:Rhino.Render.ParameterNames.PhysicallyBased.Sheen"]
 Namespace: Rhino.Render.ParameterNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Sheen { get; }
Public Shared ReadOnly Property Sheen As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ParameterNames Namespace