RhinoCommon API
File3dmRenderContent.Notes Property
The content's notes.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string Notes { get; }
Public ReadOnly Property Notes As String
	Get
Property Value
Type: String
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace