RhinoCommon API
Texture.TextureType Property
 Controls how the pixels in the bitmap are interpreted
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public TextureType TextureType { get; set; }
Public Property TextureType As TextureType
	Get
	Set
Property Value
Type: TextureType
See Also
Reference
Texture Class
Rhino.DocObjects Namespace