RhinoCommon API
ToolbarGroup.Visible Property
 Gets and sets a toolbar group's visibility.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Visible { get; set; }
Public Property Visible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ToolbarGroup Class
Rhino.UI Namespace