RhinoCommon API
ViewSettings.ZoomExtentsParallelViewBorder Property
 Border amount to apply to parallel viewport during zoom extents
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static double ZoomExtentsParallelViewBorder { get; set; }
Public Shared Property ZoomExtentsParallelViewBorder As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace