RhinoCommon API
NamedLayerStateTable.Count Property
 Returns the number of named layers states in the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NamedLayerStateTable Class
Rhino.DocObjects.Tables Namespace