RhinoCommon API
PostEffect.RequiredChannels Property
 The RDK calls this method to determine which channels a post effect requires. If a required channel is not available, the RDK will hide the post effect's UI and display explanatory text instead. Note: As a convenience, the default implementation adds IRhRdkRenderWindow::chanRGBA to the output array. Most post effects should be able to use this default with no need to override the method.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public virtual Guid[] RequiredChannels { get; }
Public Overridable ReadOnly Property RequiredChannels As Guid()
	Get
Return Value
Type: Guid[]
The channel Ids.The post effect should return all channels used by its implementation to this array.
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace