RhinoCommon API
RhinoList<T>.NullCount Property
 Gets the number of null references (Nothing in Visual Basic) in this list. If T is a ValueType, this property always return zero.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int NullCount { get; }
Public ReadOnly Property NullCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace