RhinoCommon API
ViewCaptureWriter.Pen.Pattern Property
[Missing <summary> documentation for "P:Rhino.Runtime.ViewCaptureWriter.Pen.Pattern"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public float[] Pattern { get; }
Public ReadOnly Property Pattern As Single()
	Get
Property Value
Type: Single[]
See Also
Reference
ViewCaptureWriter.Pen Class
Rhino.Runtime Namespace