RhinoCommon API
RealtimeDisplayModeClassInfo.DontRegisterAttributesOnStart Property
 Override and return true when you don't want your class info to cause display attributes to be registered with the system.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool DontRegisterAttributesOnStart { get; }
Public Overridable ReadOnly Property DontRegisterAttributesOnStart As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace