RhinoCommon API
ObjectAttributes.SectionAttributesSource Property
 Where section attributes are read from
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public ObjectSectionAttributesSource SectionAttributesSource { get; set; }
Public Property SectionAttributesSource As ObjectSectionAttributesSource
	Get
	Set
Property Value
Type: ObjectSectionAttributesSource
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace