RhinoCommon API
DimensionStyle.DrawTextMask Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DrawTextMask"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DrawTextMask { get; set; }
Public Property DrawTextMask As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace