RhinoCommon API
ControlPoint.Weight Property
 Gets or sets the weight of this control point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Weight { get; set; }
Public Property Weight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace