RhinoCommon API
UserInterfaceRadioButton.Group Property
 Which set of radio buttons this one belongs to. The default is 0. Two sets of radio buttons in the same container need different group numbers or they will turn each other off.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Group { get; set; }
Public Property Group As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
UserInterfaceRadioButton Class
Rhino.UI Namespace