RhinoCommon API
AppearanceSettingsState.DefaultLayerColor Property
 Gets or sets the default layer color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color DefaultLayerColor { get; set; }
Public Property DefaultLayerColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace