RhinoCommon API
PhysicallyBasedMaterial.Roughness Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.Roughness"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double Roughness { get; set; }
Public Property Roughness As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace