RhinoCommon API
RhinoApp.IsEvaluation Property
 Returns true if Rhino is licensed as an Evaluation product false otherwise
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.29
Syntax
public static bool IsEvaluation { get; }
Public Shared ReadOnly Property IsEvaluation As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace