RhinoCommon API
RhinoObject.EditPointGripsOn Property
 true when the grips this object has on are edit points, of either kind.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EditPointGripsOn { get; }
Public ReadOnly Property EditPointGripsOn As Boolean
	Get
Property Value
Type: Boolean
Remarks
 The read-side companion of EnableEditPointGrips(). EnabledGripsId answers the same question for a plug-in's own kind, by comparing the id it registered.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace