RhinoCommon API
GetCancel.ProgressMessage Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCancel.ProgressMessage"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string ProgressMessage { get; set; }
Public Property ProgressMessage As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace