RhinoCommon API
FileCsvWriteOptions.Area Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.Area"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Area { get; set; }
Public Property Area As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace