RhinoCommon API
File3dmRenderContent.ComponentType Property
 Returns RenderContent.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace