RhinoCommon API
FileObjWriteOptions.NgonMode Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileObjWriteOptions.NgonMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public FileObjWriteOptions.NGons NgonMode { get; set; }
Public Property NgonMode As FileObjWriteOptions.NGons
	Get
	Set
Property Value
Type: FileObjWriteOptions.NGons
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace