RhinoCommon API
DisplayPipeline.FrameBuffer Property
 Gets the contents of the frame buffer that this pipeline is drawing to.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Bitmap FrameBuffer { get; }
Public ReadOnly Property FrameBuffer As Bitmap
	Get
Property Value
Type: Bitmap
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace