RhinoCommon API
IndexPair.I Property
 Gets or sets the first, I index.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int I { get; set; }
Public Property I As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
IndexPair Structure
Rhino Namespace