RhinoCommon API
ComponentStatus.IsSelectedPersistent Property
 Returns true if selected persistent. False otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsSelectedPersistent { get; }
Public ReadOnly Property IsSelectedPersistent As Boolean
	Get
Return Value
Type: Boolean
The component status for selected.
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace