RhinoCommon API
Brep.FilletSurfaceSettings.SecondRadius Property
 The second radius of the fillets (only for chamfered surfaces)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double SecondRadius { get; }
Public ReadOnly Property SecondRadius As Double
	Get
Property Value
Type: Double
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace