RhinoCommon API
Plane.OriginX Property
 Gets or sets the X coordinate of the origin of this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double OriginX { get; set; }
Public Property OriginX As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Plane Structure
Rhino.Geometry Namespace