RhinoCommon API
ModelAidSettingsState.OsnapModes Property
 Returns or sets Rhino's current object snap mode.
The mode is a bitwise value based on the OsnapModes enumeration.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public OsnapModes OsnapModes { get; set; }
Public Property OsnapModes As OsnapModes
	Get
	Set
Property Value
Type: OsnapModes
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace