RhinoCommon API
ObjectPropertiesPageEventArgs.ObjectTypes Property
[Missing <summary> documentation for "P:Rhino.UI.ObjectPropertiesPageEventArgs.ObjectTypes"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint ObjectTypes { get; }
Public ReadOnly Property ObjectTypes As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace