RhinoCommon API
DirectionAnalysisSettings.U Property
 Gets or sets whether to display the U dir.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool U { get; set; }
Public Shared Property U As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DirectionAnalysisSettings Class
Rhino.ApplicationSettings Namespace