RhinoCommon API
Light.Data Property
 Get the actual light data
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Light Data { get; }
Public ReadOnly Property Data As Light
	Get
Property Value
Type: Light
See Also
Reference
Light Class
Rhino.Render.ChangeQueue Namespace