RhinoCommon API
Plane.Normal Property
 Gets the normal of this plane. This is essentially the ZAxis of the plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d Normal { get; }
Public ReadOnly Property Normal As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Plane Structure
Rhino.Geometry Namespace