RhinoCommon API
DisplayPipelineAttributes.PostProcessFrameBuffer Property
 Linear workflow Adjust output image
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public bool PostProcessFrameBuffer { get; set; }
Public Property PostProcessFrameBuffer As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace