RhinoCommon API
ZooClientParameters.ProductPath Property
 Path to the application calling ZooClient
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string ProductPath { get; }
Public ReadOnly Property ProductPath As String
	Get
Property Value
Type: String
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace