RhinoCommon API
CommonObject.PerformCorruptionTesting Property
 Used to test ON_Object* pointers to see if they are a brep or mesh that is corrupt enough to crash Rhino.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public static bool PerformCorruptionTesting { get; set; }
Public Shared Property PerformCorruptionTesting As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace