RhinoCommon API
DimensionStyle.DecimalSeparator Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DecimalSeparator"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public char DecimalSeparator { get; set; }
Public Property DecimalSeparator As Char
	Get
	Set
Property Value
Type: Char
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace