RhinoCommon API
NurbsCurveFitParameters.PointCountRangeTolerance Property
 When a range of point counts is permitted and PointCountRangeTolerance greater than 0, then searching for the NURBS curve fit terminates if the separation is less than or equal to PointCountRangeTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double PointCountRangeTolerance { get; }
Public ReadOnly Property PointCountRangeTolerance As Double
	Get
Return Value
Type: Double
 The desired or target separation value used when a ranged of point counts is permitted.
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace