RhinoCommon API
MeshExtruder.EdgeBasedUVN Property
 Edge based UVN defines UVN directions according to boundary edge directions
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public bool EdgeBasedUVN { get; set; }
Public Property EdgeBasedUVN As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace