RhinoCommon API
ModelAidSettings.MousePickboxRadius Property
radius of mouse pick box in pixels.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int MousePickboxRadius { get; set; }
Public Shared Property MousePickboxRadius As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace