RhinoCommon API
FileCsvWriteOptions.Volume Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.Volume"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Volume { get; set; }
Public Property Volume As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace