RhinoCommon API
DimensionStyle.CentermarkSize Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.CentermarkSize"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double CentermarkSize { get; set; }
Public Property CentermarkSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace