RhinoCommon API
CursorTooltipSettings.OsnapPane Property
 Displays the current object snap selection.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool OsnapPane { get; set; }
Public Shared Property OsnapPane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace