RhinoCommon API
GripUserInterfaceObject.GripFillColor Property
[Missing <summary> documentation for "P:Rhino.UI.GripUserInterfaceObject.GripFillColor"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color GripFillColor { get; set; }
Public Property GripFillColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GripUserInterfaceObject Class
Rhino.UI Namespace