RhinoCommon API
HiddenLineDrawingParameters.OccludingSectionOption Property
 Enable occluding section option (default is false)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool OccludingSectionOption { get; set; }
Public Property OccludingSectionOption As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace