RhinoCommon API
HostUtils.RunningInRhino Property
 Tests if RhinoCommon is currently executing inside of the Rhino.exe process. There are other cases where RhinoCommon could be running; specifically inside of Visual Studio when something like a windows form is being worked on in the resource editor or running stand-alone when compiled to be used as a version of OpenNURBS.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool RunningInRhino { get; }
Public Shared ReadOnly Property RunningInRhino As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace