RhinoCommon API
ViewSettings.AlwaysPanParallelViews Property
Gets or sets the 'always pan parallel views' value.
If the view is not looking straight at the construction plane, then sets parallel viewports so they will not rotate.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool AlwaysPanParallelViews { get; set; }
Public Shared Property AlwaysPanParallelViews As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace