RhinoCommon API
HostUtils.RunningInWindowsContainer Property
 Tests if this process is currently executing inside a Windows Container.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public static bool RunningInWindowsContainer { get; }
Public Shared ReadOnly Property RunningInWindowsContainer As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace