RhinoCommon API
HatchPatternTableEventArgs.Document Property
 The document in which the event occurred.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
HatchPatternTableEventArgs Class
Rhino.DocObjects.Tables Namespace