RhinoCommon API
ClassArrayObjRef.Count Property
 Gets the number of CRhinoObjRef instances in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ClassArrayObjRef Class
Rhino.Runtime.InteropWrappers Namespace