RhinoCommon API
LinetypeTableEventArgs.OldState Property
 The old state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Linetype OldState { get; }
Public ReadOnly Property OldState As Linetype
	Get
Property Value
Type: Linetype
See Also
Reference
LinetypeTableEventArgs Class
Rhino.DocObjects.Tables Namespace