RhinoCommon API
DimensionStyle.AngleResolution Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AngleResolution"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int AngleResolution { get; set; }
Public Property AngleResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace