RhinoCommon API
DimensionStyle.MaskFrameType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.MaskFrameType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public DimensionStyle.MaskFrame MaskFrameType { get; set; }
Public Property MaskFrameType As DimensionStyle.MaskFrame
	Get
	Set
Property Value
Type: DimensionStyle.MaskFrame
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace