RhinoCommon API
Font.IsSimulated Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.IsSimulated"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public bool IsSimulated { get; }
Public ReadOnly Property IsSimulated As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Font Class
Rhino.DocObjects Namespace