RhinoCommon API
Vector3d.IsUnitVector Property
 Gets a value indicating whether or not this is a unit vector. A unit vector has length 1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsUnitVector { get; }
Public ReadOnly Property IsUnitVector As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace