RhinoCommon API
IOpenIDConnectToken.UpdatedAt Property
 The last time the token was updated.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
DateTime? UpdatedAt { get; }
ReadOnly Property UpdatedAt As DateTime?
	Get
Property Value
Type: Nullable<DateTime>
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace