RhinoCommon API
DisplayPen.PatternBySegment Property
 Restart patterns at corners in a curve
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool PatternBySegment { get; set; }
Public Property PatternBySegment As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPen Class
Rhino.Display Namespace