RhinoCommon API
Notification.DateUpdated Property
 The date the notification was last modified.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DateTime DateUpdated { get; }
Public ReadOnly Property DateUpdated As DateTime
	Get
Property Value
Type: DateTime
Remarks
Only visible elements of the notification will cause this property to change. Changes in metadata or other non-visible members will have no effect on this property.
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace