RhinoCommon API
Notification.MetadataCopy Property
 A copy of all the metadata for this class.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IDictionary<string, string> MetadataCopy { get; }
Public ReadOnly Property MetadataCopy As IDictionary(Of String, String)
	Get
Property Value
Type: IDictionary<String, String>
Remarks
Modifying the returned dictionary will have no effect on the metadata for this notification.
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace