RhinoCommon API
MeshClash.MeshA Property
 Gets the first mesh.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Mesh MeshA { get; }
Public ReadOnly Property MeshA As Mesh
	Get
Property Value
Type: Mesh
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace