RhinoCommon API
IOAuth2Token.Scope Property
 The scope of the token.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
IReadOnlyCollection<string> Scope { get; }
ReadOnly Property Scope As IReadOnlyCollection(Of String)
	Get
Property Value
Type: IReadOnlyCollection<String>
See Also
Reference
IOAuth2Token Interface
Rhino.Runtime.RhinoAccounts Namespace