RhinoCommon API
SubDCreationOptions.MinimumConcaveCornerEdgeCount Property
 If ConcaveCornerTest == ConcaveCornerOption.AtMeshCorner, then an input mesh boundary vertex becomes a SubD corner when the number of edges that end at the vertex is >= MinimumConcaveCornerEdgeCount edges and the corner angle is >= MinimumConcaveCornerAngleRadians.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public uint MinimumConcaveCornerEdgeCount { get; set; }
Public Property MinimumConcaveCornerEdgeCount As UInteger
	Get
	Set
Property Value
Type: UInt32
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace