RhinoCommon API
ModelComponent.IsComponentStatusLocked Property
 The component status itself can be locked. This returns an indication.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsComponentStatusLocked { get; }
Public ReadOnly Property IsComponentStatusLocked As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace