RhinoCommon API
NurbsSurfacePointList.CountV Property
 Gets the number of control points in the V direction of this surface.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int CountV { get; }
Public ReadOnly Property CountV As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace