RhinoCommon API
MouseCallbackEventArgs.ShiftKeyDown Property
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.ShiftKeyDown"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ShiftKeyDown { get; }
Public ReadOnly Property ShiftKeyDown As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace