RhinoCommon API
DisplayPipelineAttributes.ShadowsIgnoreUserDefinedClippingPlanes Property
 If true, shadows ignore user-defined clipping planes
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ShadowsIgnoreUserDefinedClippingPlanes { get; set; }
Public Property ShadowsIgnoreUserDefinedClippingPlanes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace