RhinoCommon API
FileStpWriteOptions.AnalyticCurves Property
 Write straight edges as STEP line entities and let circular edges reference their circle directly, instead of writing degree 1 splines and trimmed curve wrappers. Some importers, sheet metal and CAM software in particular, require these analytic curves.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool AnalyticCurves { get; set; }
Public Property AnalyticCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileStpWriteOptions Class
Rhino.FileIO Namespace