RhinoCommon API
RebuildCurveOptions.TangentMatching Property
 When TangentMatchPermitted is true, TangentMatch is the active tangent mathing option. When TangentMatchPermitted is false, the user interface should not offer tangent matching.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RebuildCurveTangentMatching TangentMatching { get; set; }
Public Property TangentMatching As RebuildCurveTangentMatching
	Get
	Set
Property Value
Type: RebuildCurveTangentMatching
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace