RhinoCommon API
FileSettingsState.PrefillExportFileName Property
 Gets or sets a value indicating whether the Export command fills in the file name.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool PrefillExportFileName { get; set; }
Public Property PrefillExportFileName As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace