RhinoCommon API
PostEffectData.LocalName Property
 Returns the localized name of this post effect.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string LocalName { get; }
Public ReadOnly Property LocalName As String
	Get
Property Value
Type: String
See Also
Reference
PostEffectData Class
Rhino.Render.PostEffects Namespace