RhinoCommon API
GripObject.CurrentLocation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.GripObject.CurrentLocation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d CurrentLocation { get; set; }
Public Property CurrentLocation As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace