RhinoCommon API
PanelEventArgs.PanelId Property
 Class Id for panel being shown or hidden
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid PanelId { get; }
Public ReadOnly Property PanelId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelEventArgs Class
Rhino.UI Namespace