RhinoCommon API
FileSettings.AutoSaveEnabled Property
Enables or disables Rhino's automatic file saving mechanism.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool AutoSaveEnabled { get; set; }
Public Shared Property AutoSaveEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace