RhinoCommon API
ProviderIds.RdkRenderingPostEffects Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.RdkRenderingPostEffects"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public static Guid RdkRenderingPostEffects { get; }
Public Shared ReadOnly Property RdkRenderingPostEffects As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace