RhinoCommon API
ChooseOneObjectSettings.AutomaticResize Property
AutomaticResize
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool AutomaticResize { get; set; }
Public Shared Property AutomaticResize As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace