RhinoCommon API
EarthAnchorPoint.KMLOrientationHeadingAngleRadians Property
 Gets Keyhole Markup Language (KML) orientation heading angle in radians.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public double KMLOrientationHeadingAngleRadians { get; }
Public ReadOnly Property KMLOrientationHeadingAngleRadians As Double
	Get
Property Value
Type: Double
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace