RhinoCommon API
RevSurface.Interval Property
 Interval specifies the parameterization for the angular parameter. Interval must be an increasing interval. The parameter Interval[0] corresponds to Angle[0] and the parameter Interval[1] corresponds to Angle[1].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public Interval Interval { get; }
Public ReadOnly Property Interval As Interval
	Get
Property Value
Type: Interval
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace