RhinoCommon API
ModelAidSettings.NudgeMode Property
0 = world, 1 = cplane, 2 = view, 3 = UVN, -1 = not set.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int NudgeMode { get; set; }
Public Shared Property NudgeMode As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace