RhinoCommon API
ChooseOneObjectSettingsState.AutomaticResize Property
AutomaticResize
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool AutomaticResize { get; set; }
Public Property AutomaticResize As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace