RhinoCommon API
FileDwgWriteOptions.FullLayerPath Property
write layernames as Parent$Child or Child
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool FullLayerPath { get; set; }
Public Property FullLayerPath As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace