RhinoCommon API
MeshingParameters.MinimumEdgeLength Property
 Gets or sets the minimum allowed mesh edge length.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double MinimumEdgeLength { get; set; }
Public Property MinimumEdgeLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace