RhinoCommon API
MeshingParameters.QualityRenderMesh Property
 Gets mesh creation parameters to create the a render mesh when mesh quality is preferred over meshing speed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static MeshingParameters QualityRenderMesh { get; }
Public Shared ReadOnly Property QualityRenderMesh As MeshingParameters
	Get
Property Value
Type: MeshingParameters
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace