RhinoCommon API
FileDwgReadOptions.ImportUnreferencedBlocks Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgReadOptions.ImportUnreferencedBlocks"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportUnreferencedBlocks { get; set; }
Public Property ImportUnreferencedBlocks As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgReadOptions Class
Rhino.FileIO Namespace