RhinoCommon API
SubDVertex.FaceCount Property
 Number of faces for this vertex
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int FaceCount { get; }
Public ReadOnly Property FaceCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace