RhinoCommon API
SubDCreationOptions.TextureCoordinateTest Property
 Gets or sets the texture coordinate test option.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.28
Syntax
public SubDCreationOptions.TextureCoordinateOption TextureCoordinateTest { get; set; }
Public Property TextureCoordinateTest As SubDCreationOptions.TextureCoordinateOption
	Get
	Set
Property Value
Type: SubDCreationOptions.TextureCoordinateOption
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace