RhinoCommon API
FileVrmlWriteOptions.Version Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVrmlWriteOptions.Version"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int Version { get; set; }
Public Property Version As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
FileVrmlWriteOptions Class
Rhino.FileIO Namespace