RhinoCommon API
ArcCurve.Arc Property
 Gets the arc that is contained within this ArcCurve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Arc Arc { get; }
Public ReadOnly Property Arc As Arc
	Get
Property Value
Type: Arc
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace