RhinoCommon API
GroundPlane.IsShadowOnly Property
 Get true if ground plane should be shadow-only
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsShadowOnly { get; }
Public ReadOnly Property IsShadowOnly As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace