RhinoCommon API
MeshCurveIntersection.BarycentricB Property
Barycentric coordinates of PointB.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Vector3d BarycentricB { get; }
Public ReadOnly Property BarycentricB As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace