RhinoCommon API
DisplayPipelineAttributes.MeshEdgeThickness Property
 Mesh edge width in pixels
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int MeshEdgeThickness { get; set; }
Public Property MeshEdgeThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace