RhinoCommon API
EmapAnalysisSettings.BlendWithObjectColor Property
 Gets or sets whether to blend the image with the object's color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool BlendWithObjectColor { get; set; }
Public Shared Property BlendWithObjectColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
EmapAnalysisSettings Class
Rhino.ApplicationSettings Namespace