RhinoCommon API
PersistentSettings.Keys Property
 Gets a collection containing the keys in the settings dictionary.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ICollection<string> Keys { get; }
Public ReadOnly Property Keys As ICollection(Of String)
	Get
Property Value
Type: ICollection<String>
See Also
Reference
PersistentSettings Class
Rhino Namespace