RhinoCommon API
ModelAidSettingsState.GumballExtrudeMergeFaces Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettingsState.GumballExtrudeMergeFaces"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool GumballExtrudeMergeFaces { get; set; }
Public Property GumballExtrudeMergeFaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace