RhinoCommon API
File3dmRenderContent.Kind Property
the kind of render content as a string.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string Kind { get; }
Public ReadOnly Property Kind As String
	Get
Property Value
Type: String
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace