RhinoCommon API
File3dmDisplacement.TextureId Property
 Specifies which texture is used for computing the displacement amount.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid TextureId { get; set; }
Public Property TextureId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace