RhinoCommon API
GripUserInterfaceObject.ObjectSnapPermitted Property
[Missing <summary> documentation for "P:Rhino.UI.GripUserInterfaceObject.ObjectSnapPermitted"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ObjectSnapPermitted { get; set; }
Public Property ObjectSnapPermitted As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GripUserInterfaceObject Class
Rhino.UI Namespace