RhinoCommon API
FileStlWriteOptions.BinaryFile Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileStlWriteOptions.BinaryFile"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool BinaryFile { get; set; }
Public Property BinaryFile As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileStlWriteOptions Class
Rhino.FileIO Namespace