RhinoCommon API
SubDComponentParameter.IsVertexParameter Property
 Gets true if this parameter identifies the surface point at a SubD vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsVertexParameter { get; }
Public ReadOnly Property IsVertexParameter As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace