RhinoCommon API
GeneralSettings.MouseSelectMode Property
 Gets or sets the current selection mode.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static MouseSelectMode MouseSelectMode { get; set; }
Public Shared Property MouseSelectMode As MouseSelectMode
	Get
	Set
Property Value
Type: MouseSelectMode
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace