RhinoCommon API
Transform.Unset Property
 Gets an XForm filled with RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Transform Unset { get; }
Public Shared ReadOnly Property Unset As Transform
	Get
Property Value
Type: Transform
See Also
Reference
Transform Structure
Rhino.Geometry Namespace