RhinoCommon API
GripUserInterfaceObject.ObjectSnapCursorsEnabled Property
[Missing <summary> documentation for "P:Rhino.UI.GripUserInterfaceObject.ObjectSnapCursorsEnabled"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ObjectSnapCursorsEnabled { get; set; }
Public Property ObjectSnapCursorsEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GripUserInterfaceObject Class
Rhino.UI Namespace