RhinoCommon API
AnimationProperties.EndDay Property
 Gets or sets the end day for seasonal day sun animation in the range 1 to 31.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public int EndDay { get; set; }
Public Property EndDay As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace