RhinoCommon API
MeshInstance.OcsTransform Property
Note: This API is now obsolete.
 OCS Transform for the MeshInstance - this is the Object Coordinate System texture mapping transformation set in the texture mapping properties dialog. (identity means no OCS, potentially just simple WCS/WCS Box)
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[ObsoleteAttribute("Always returns identity")]
public Transform OcsTransform { get; }
<ObsoleteAttribute("Always returns identity")>
Public ReadOnly Property OcsTransform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace