RhinoCommon API
ModelAidSettings.OrientAutoCPlaneToView Property
 Gets or sets whether the auto cplane will rotate towards the view after aligning to the selection
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public static bool OrientAutoCPlaneToView { get; set; }
Public Shared Property OrientAutoCPlaneToView As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace