RhinoCommon API
RenderMeshProvider.Name Property
 The localized name of the provider for UI display.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public abstract string Name { get; }
Public MustOverride ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace