RhinoCommon API
HiddenLineDrawing.WorldToHiddenLine Property
 Returns the world-coordinate system to HLD-coordinate system transformation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Transform WorldToHiddenLine { get; }
Public ReadOnly Property WorldToHiddenLine As Transform
	Get
Property Value
Type: Transform
See Also
Reference
HiddenLineDrawing Class
Rhino.Geometry Namespace