RhinoCommon API
Field.Tag Property
 Gets or sets an object that contains data to associate with the field.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Object Tag { get; set; }
Public Property Tag As Object
	Get
	Set
Return Value
Type: Object
 An object that contains information that is associated with the field.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace