RhinoCommon API
FileSettings.BackupFileFolder Property
Returns or sets the location of Rhino's backup files.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static string BackupFileFolder { get; set; }
Public Shared Property BackupFileFolder As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace