RhinoCommon API
Brep.PointConstraint.Point Property
 Location of the constraint
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Point3d Point { get; }
Public ReadOnly Property Point As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Brep.PointConstraint Class
Rhino.Geometry Namespace