RhinoCommon API
File3dmRenderContent.RenderEngineId Property
The content's render-engine id.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid RenderEngineId { get; }
Public ReadOnly Property RenderEngineId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace