RhinoCommon API
ThumbData.Image Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.Image"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Bitmap Image { get; set; }
Public Property Image As Bitmap
	Get
	Set
Property Value
Type: Bitmap
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace