RhinoCommon API
File3dmCurvePiping.Accuracy Property
 Specifies the accuracy of the pipe in the range 0 to 100.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int Accuracy { get; set; }
Public Property Accuracy As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
File3dmCurvePiping Class
Rhino.FileIO Namespace