RhinoCommon API
EventInfoArgs.DataType Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.EventInfoArgs.DataType"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid DataType { get; }
Public ReadOnly Property DataType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
EventInfoArgs Class
Rhino.UI.Controls.DataSource Namespace