RhinoCommon API
Notification.SeverityLevel Property
 The severity of the notification. Changing the severity of the notification may change the way Rhino chooses to display the Notifications panel.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Notification.Severity SeverityLevel { get; set; }
Public Property SeverityLevel As Notification.Severity
	Get
	Set
Property Value
Type: Notification.Severity
Exceptions
Exception | Condition
InvalidOperationException | Thrown if the calling assembly cannot modify this instance
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace