RhinoCommon API
ContentUuids.DotBumpTexture Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.DotBumpTexture"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid DotBumpTexture { get; }
Public Shared ReadOnly Property DotBumpTexture As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace