RhinoCommon API
GripStatus.Culled Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripStatus.Culled"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Culled { get; set; }
Public Property Culled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GripStatus Class
Rhino.DocObjects.Custom Namespace