RhinoCommon API
ViewCaptureSettings.HeaderText Property
 Text drawn at the top of the output
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public string HeaderText { get; set; }
Public Property HeaderText As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace