RhinoCommon API
SnapshotTable.Document Property
Document that owns this table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
SnapshotTable Class
Rhino.DocObjects.Tables Namespace