RhinoCommon API
NurbsSurfaceKnotList.Count Property
Gets the total number of knots in this curve.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace