RhinoCommon API
FileSettings.CreateBackupFiles Property
Gets or sets a value that controls the creation of backup files.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool CreateBackupFiles { get; set; }
Public Shared Property CreateBackupFiles As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace