RhinoCommon API
GetCone.AllowInputAngle Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCone.AllowInputAngle"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AllowInputAngle { get; set; }
Public Property AllowInputAngle As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace