RhinoCommon API
CurvatureGraphSettings.SampleDensity Property
 Gets or sets the sampling density;
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static int SampleDensity { get; set; }
Public Shared Property SampleDensity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
CurvatureGraphSettings Class
Rhino.ApplicationSettings Namespace