RhinoCommon API
RhinoApp.CurrentRhinoId Property
Gets the current ID of Rhino.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid CurrentRhinoId { get; }
Public Shared ReadOnly Property CurrentRhinoId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoApp Class
Rhino Namespace