RhinoCommon API
UserInterfaceControl.Location Property
[Missing <summary> documentation for "P:Rhino.UI.UserInterfaceControl.Location"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PointF Location { get; set; }
Public Property Location As PointF
	Get
	Set
Property Value
Type: PointF
See Also
Reference
UserInterfaceControl Class
Rhino.UI Namespace