RhinoCommon API
MouseCallbackEventArgs.View Property
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.View"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoView View { get; }
Public ReadOnly Property View As RhinoView
	Get
Property Value
Type: RhinoView
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace