RhinoCommon API
PixelBuffer.Buffer Property
[Missing <summary> documentation for "P:Rhino.Render.PixelBuffer.Buffer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IntPtr Buffer { get; }
Public ReadOnly Property Buffer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
PixelBuffer Class
Rhino.Render Namespace