RhinoCommon API
RebuildCurveOptions.InputDegreeRange Property
 The range of degrees in the input curves. InputDegreeRange.I = minimum input curve degree. InputDegreeRange.J = maximum input curve degree.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IndexPair InputDegreeRange { get; }
Public ReadOnly Property InputDegreeRange As IndexPair
	Get
Property Value
Type: IndexPair
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace