RhinoCommon API
PlugInInfo.RegistryPath Property
 Returns the plug-in's Windows Registry path.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string RegistryPath { get; }
Public ReadOnly Property RegistryPath As String
	Get
Property Value
Type: String
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace