RhinoCommon API
FileGltfWriteOptions.ExportOpenMeshes Property
 Enable/disable the exporting of open meshes
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public bool ExportOpenMeshes { get; set; }
Public Property ExportOpenMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace