RhinoCommon API
Dimension.ArrowheadType1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ArrowheadType1"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.ArrowType ArrowheadType1 { get; set; }
Public Property ArrowheadType1 As DimensionStyle.ArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ArrowType
See Also
Reference
Dimension Class
Rhino.Geometry Namespace