RhinoCommon API
FileSettings.AutoSaveMeshes Property
save render and display meshes in autosave file.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool AutoSaveMeshes { get; set; }
Public Shared Property AutoSaveMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace