RhinoCommon API
EndAnalysisSettingsState.OpenEnds Property
 Gets or sets whether to display the open curve end points.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool OpenEnds { get; set; }
Public Property OpenEnds As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
EndAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace