RhinoCommon API
MappingTag.MappingType Property
 Gets or sets a texture mapping type: linear, cylinder, etc...
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public TextureMappingType MappingType { get; set; }
Public Property MappingType As TextureMappingType
	Get
	Set
Property Value
Type: TextureMappingType
See Also
Reference
MappingTag Class
Rhino.Render Namespace