RhinoCommon API
RenderTextureTable.Item Property
[Missing <summary> documentation for "P:Rhino.Render.RenderTextureTable.Item(System.Int32)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderTexture this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As RenderTexture
	Get
Parameters
index
Type: System.Int32
Property Value
Type: RenderTexture
See Also
Reference
RenderTextureTable Class
Rhino.Render Namespace