RhinoCommon API
RebuildCurveOptions.KinkSplittingPermitted Property
 True if the user interface is permitted to show the kink splitting options
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool KinkSplittingPermitted { get; set; }
Public Property KinkSplittingPermitted As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace