RhinoCommon API
IWindow.Caption Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IWindow.Caption"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
LocalizeStringPair Caption { get; }
ReadOnly Property Caption As LocalizeStringPair
	Get
Property Value
Type: LocalizeStringPair
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace