RhinoCommon API
CollapsibleSectionImpl.ViewModel Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.CollapsibleSectionImpl.ViewModel"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IRdkViewModel ViewModel { get; set; }
Public Property ViewModel As IRdkViewModel
	Get
	Set
Property Value
Type: IRdkViewModel
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace