RhinoCommon API
RebuildCurveOptions.MinimumDegreeLimit Property
 The mimimum value a user interface may specify as a degree value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int MinimumDegreeLimit { get; }
Public ReadOnly Property MinimumDegreeLimit As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace