RhinoCommon API
GetCurve.EndTangent Property
 End tangent of an interpolated curve. Only used when UseEndTangent is true.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Vector3d EndTangent { get; set; }
Public Property EndTangent As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace