RhinoCommon API
GumballSettings.MenuBallLocation Property
 Specifies the distance of the menu ball from the gumball origin in pixels.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int MenuBallLocation { get; set; }
Public Shared Property MenuBallLocation As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace