RhinoCommon API
CommandEventArgs.DocumentRuntimeSerialNumber Property
[Missing <summary> documentation for "P:Rhino.Commands.CommandEventArgs.DocumentRuntimeSerialNumber"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint DocumentRuntimeSerialNumber { get; }
Public ReadOnly Property DocumentRuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace