RhinoCommon API
AppearanceSettingsState.ShowStatusBar Property
 Get/Set status bar visibility
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ShowStatusBar { get; set; }
Public Property ShowStatusBar As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace