RhinoCommon API
AppearanceSettingsState.WorldCoordIconZAxisColor Property
Gets or sets the color of the world Z axis of the world coordinate icon, appearing usually bottom left in viewports.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color WorldCoordIconZAxisColor { get; set; }
Public Property WorldCoordIconZAxisColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace