RhinoCommon API
UserInterfaceSlider.AllowValueBeforeRangeStart Property
 Set to true if you want to allow dragging of the slider grip before the start of the defined range.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool AllowValueBeforeRangeStart { get; set; }
Public Property AllowValueBeforeRangeStart As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
UserInterfaceSlider Class
Rhino.UI Namespace