RhinoCommon API
HiddenLineDrawingParameters.AbsoluteTolerance Property
 Absolute tolerance is used to decide if curves overlap or intersect. A suggested value is to use RhinoDoc.AbsoluteTolerance
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double AbsoluteTolerance { get; set; }
Public Property AbsoluteTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace