RhinoCommon API
File3dmSettings.CurrentLayerId Property
The id of the layer new objects are created on.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public Guid CurrentLayerId { get; set; }
Public Property CurrentLayerId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace