RhinoCommon API
AppearanceSettings.DefaultLayerColor Property
 Gets or sets the default layer color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color DefaultLayerColor { get; set; }
Public Shared Property DefaultLayerColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace