RhinoCommon API
MeshThicknessMeasurement.Point Property
 Gets the location of the thickness measurement.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point3d Point { get; }
Public ReadOnly Property Point As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
MeshThicknessMeasurement Structure
Rhino.Geometry Namespace