RhinoCommon API
MeshProviderIds.Thickening Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderMeshes.MeshProviderIds.Thickening"]
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Guid Thickening { get; }
Public Shared ReadOnly Property Thickening As Guid
	Get
Property Value
Type: Guid
See Also
Reference
MeshProviderIds Class
Rhino.Render.CustomRenderMeshes Namespace