RhinoCommon API
SerializationOptions.WriteRenderMeshes Property
 Gets or sets a value indicating whether to write render meshes
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public bool WriteRenderMeshes { get; set; }
Public Property WriteRenderMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace