RhinoCommon API
ViewportInfo.CameraY Property
 Gets the unit "up" vector.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d CameraY { get; }
Public ReadOnly Property CameraY As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace