RhinoCommon API
ViewCaptureSettings.DrawLights Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawLights"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DrawLights { get; set; }
Public Property DrawLights As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace