RhinoCommon API
InstanceDefinition.SkipNestedLinkedDefinitions Property
 This property applies when an instance definition is linked. If true, when reading the file that defines the content of the linked instance definition, skip any linked instance definitions found in that file. If false, when reading the file that defines the content of the linked instance definition, recursively load linked instance definitions found in that file.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public bool SkipNestedLinkedDefinitions { get; set; }
Public Property SkipNestedLinkedDefinitions As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace