RhinoCommon API
ChooseOneObjectSettingsState.HighlightColor Property
HighlightColor
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Color HighlightColor { get; set; }
Public Property HighlightColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace