RhinoCommon API
Light.LightStyle Property
 Gets or sets a light style on this camera.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public LightStyle LightStyle { get; set; }
Public Property LightStyle As LightStyle
	Get
	Set
Property Value
Type: LightStyle
See Also
Reference
Light Class
Rhino.Geometry Namespace