RhinoCommon API
InstanceReferenceGeometry.ParentIdefId Property
 The unique id for the parent instance definition of this instance reference.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public Guid ParentIdefId { get; }
Public ReadOnly Property ParentIdefId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
InstanceReferenceGeometry Class
Rhino.Geometry Namespace