RhinoCommon API
ViewCaptureWriter.Pen.Cap Property
[Missing <summary> documentation for "P:Rhino.Runtime.ViewCaptureWriter.Pen.Cap"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public LineCapStyle Cap { get; }
Public ReadOnly Property Cap As LineCapStyle
	Get
Property Value
Type: LineCapStyle
See Also
Reference
ViewCaptureWriter.Pen Class
Rhino.Runtime Namespace