RhinoCommon API
File3dmObject.ComponentType Property
 Returns ModelGeometry.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace