RhinoCommon API
SmartTrackSettings.SmartPointAtCPlaneOrigin Property
The active viewport construction plane origin is automatically tagged as a smart point, making it possible to snap to it, and snap to ortho lines radiating from it.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool SmartPointAtCPlaneOrigin { get; set; }
Public Shared Property SmartPointAtCPlaneOrigin As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace