RhinoCommon API
RenderPlugInInfo.Name Property
[Missing <summary> documentation for "P:Rhino.Render.RenderPlugInInfo.Name"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RenderPlugInInfo Class
Rhino.Render Namespace