RhinoCommon API
MeshVertexStatusList.Item Property
 Gets or sets the hidden value at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Boolean
	Get
	Set
Parameters
index
Type: System.Int32
Index of hidden flag to access.
Return Value
Type: Boolean
The hidden flag at [index].
Implements
IList<T>.Item[Int32]
IReadOnlyList<T>.Item[Int32]
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when the index is invalid.
See Also
Reference
MeshVertexStatusList Class
Rhino.Geometry.Collections Namespace