RhinoCommon API
CursorTooltipSettings.BackgroundColor Property
Tooltip background color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color BackgroundColor { get; set; }
Public Shared Property BackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace