RhinoCommon API
PageSettings.RightMarginMillimeters Property
Right margin in millimeters.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public double RightMarginMillimeters { get; set; }
Public Property RightMarginMillimeters As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PageSettings Class
Rhino.DocObjects Namespace