RhinoCommon API
ContentUuids.WoodTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.WoodTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid WoodTextureType { get; }
Public Shared ReadOnly Property WoodTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace