RhinoCommon API
CustomPostEffectAttribute.PostEffectType Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.CustomPostEffectAttribute.PostEffectType"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PostEffectType PostEffectType { get; set; }
Public Property PostEffectType As PostEffectType
	Get
	Set
Property Value
Type: PostEffectType
See Also
Reference
CustomPostEffectAttribute Class
Rhino.Render.PostEffects Namespace