RhinoCommon API
DisplayPipelineAttributes.ShowClippingEdges Property
 Shows the edges between the clipping plane and clipped objects.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ShowClippingEdges { get; set; }
Public Property ShowClippingEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace