RhinoCommon API
UserInterfaceRadioButton.Checked Property
 Is this the button that is on in its group? Turning a button on turns off every other button in its group. Setting this does not raise CheckedChanged; that is only for a state the user changed.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Checked { get; set; }
Public Property Checked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
UserInterfaceRadioButton Class
Rhino.UI Namespace