RhinoCommon API
Skin.HasBootSplash Property
 True when the platform's native boot splash is compiled in and shown at startup.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
protected static bool HasBootSplash { get; }
Protected Shared ReadOnly Property HasBootSplash As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Skin Class
Rhino.Runtime Namespace