RhinoCommon API
LinetypeTableEventArgs.Document Property
 The document in which the event occurred.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
LinetypeTableEventArgs Class
Rhino.DocObjects.Tables Namespace