RhinoCommon API
Cylinder.Unset Property
 Gets an invalid Cylinder.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Cylinder Unset { get; }
Public Shared ReadOnly Property Unset As Cylinder
	Get
Property Value
Type: Cylinder
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace