RhinoCommon API
CachedTextureCoordinates.Count Property
 Number of cached coordinates.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace