RhinoCommon API
ObjectAttributes.Url Property
 Objects may have an URL. There are no restrictions on what value this URL may have. As an example, if the object came from a commercial part library, the URL might point to the definition of that part.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public string Url { get; set; }
Public Property Url As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace