RhinoCommon API
RhinoApp.ToolbarFiles Property
 Collection of currently open toolbar files in the application
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static ToolbarFileCollection ToolbarFiles { get; }
Public Shared ReadOnly Property ToolbarFiles As ToolbarFileCollection
	Get
Property Value
Type: ToolbarFileCollection
See Also
Reference
RhinoApp Class
Rhino Namespace