RhinoCommon API
ObjectPropertiesPage.SupportsSubObjects Property
 If your object properties page supports sub-object selection, you should override this method and return true. This is ignored for view pages. The default implementation returns false.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool SupportsSubObjects { get; }
Public Overridable ReadOnly Property SupportsSubObjects As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace