RhinoCommon API
IOpenIDConnectToken.OwnerGroups Property
 Returns all the groups the user is an owner of.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
IReadOnlyDictionary<string, RhinoAccountsGroup> OwnerGroups { get; }
ReadOnly Property OwnerGroups As IReadOnlyDictionary(Of String, RhinoAccountsGroup)
	Get
Property Value
Type: IReadOnlyDictionary<String, RhinoAccountsGroup>
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace