RhinoCommon API
GeneralSettings.AutoUpdateCommandHelp Property
 Command help dialog auto-update feature.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool AutoUpdateCommandHelp { get; set; }
Public Shared Property AutoUpdateCommandHelp As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace