RhinoCommon API
FileCsvWriteOptions.AreaCentroid Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.AreaCentroid"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool AreaCentroid { get; set; }
Public Property AreaCentroid As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace