RhinoCommon API
FileTxtWriteOptions.DelimiterCharacter Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileTxtWriteOptions.DelimiterCharacter"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public char DelimiterCharacter { get; set; }
Public Property DelimiterCharacter As Char
	Get
	Set
Property Value
Type: Char
See Also
Reference
FileTxtWriteOptions Class
Rhino.FileIO Namespace