RhinoCommon API
FileXamlWriteOptions.UseOriginForRotationCenter Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileXamlWriteOptions.UseOriginForRotationCenter"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool UseOriginForRotationCenter { get; set; }
Public Property UseOriginForRotationCenter As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileXamlWriteOptions Class
Rhino.FileIO Namespace