RhinoCommon API
DisplayPipelineAttributes.CustomGroundPlaneAutomaticAltitude Property
 Turns on auto-elevation that moves Ground Plane to the lowest point of the objects in the model.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public bool CustomGroundPlaneAutomaticAltitude { get; set; }
Public Property CustomGroundPlaneAutomaticAltitude As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace