RhinoCommon API
MeshCurveIntersection.BarycentricA Property
Barycentric coordinates of PointA wrt the face's triangle.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Vector3d BarycentricA { get; }
Public ReadOnly Property BarycentricA As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace