RhinoCommon API
RhinoApp.IsParentDesktop Property
 Returns true if Rhino's parent window is the desktop, false otherwise.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public static bool IsParentDesktop { get; }
Public Shared ReadOnly Property IsParentDesktop As Boolean
	Get
Property Value
Type: Boolean
Remarks
 The parent of a top-level window is the desktop window. Some applications like to re-parent Rhino's main window to a window they provide. Use this property to determine if Rhino is in such a condition. Note, this property is only valid on Windows.
See Also
Reference
RhinoApp Class
Rhino Namespace