RhinoCommon API
DimensionStyle.Font Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.Font"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Font Font { get; set; }
Public Property Font As Font
	Get
	Set
Property Value
Type: Font
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace