RhinoCommon API
PlugIn.Version Property
 Returns the version of the plug-in, as found in the plug-in's assembly attributes.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Version { get; }
Public ReadOnly Property Version As String
	Get
Property Value
Type: String
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace