RhinoCommon API
ConstructionPlaneGridDefaults.GridLineCount Property
Number of grid lines in each direction
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public int GridLineCount { get; set; }
Public Property GridLineCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ConstructionPlaneGridDefaults Class
Rhino.DocObjects Namespace