RhinoCommon API
ViewCaptureSettings.RasterMode Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.RasterMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.17
Syntax
public bool RasterMode { get; set; }
Public Property RasterMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace