RhinoCommon API
FilePdfEventArgs.Pdf Property
 The document that is about to be written
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public FilePdf Pdf { get; }
Public ReadOnly Property Pdf As FilePdf
	Get
Property Value
Type: FilePdf
See Also
Reference
FilePdfEventArgs Class
Rhino.FileIO Namespace