RhinoCommon API
Dimension.DimensionLineExtension Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.DimensionLineExtension"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double DimensionLineExtension { get; set; }
Public Property DimensionLineExtension As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace