RhinoCommon API
Sun.Hash Property
 Get a hash of the sun state.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public uint Hash { get; }
Public ReadOnly Property Hash As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
Sun Class
Rhino.Render Namespace