RhinoCommon API
AnimationProperties.AnimationName Property
 Gets or sets the name of the animation sequence.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public string AnimationName { get; set; }
Public Property AnimationName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace