RhinoCommon API
FileX3dvWriteOptions.ExportVertexNormals Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileX3dvWriteOptions.ExportVertexNormals"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ExportVertexNormals { get; set; }
Public Property ExportVertexNormals As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileX3dvWriteOptions Class
Rhino.FileIO Namespace