RhinoCommon API
Panels.ScaledIconSize Property
 Gets the panel icon size in pixels with DPI scaling applied.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public static Size ScaledIconSize { get; }
Public Shared ReadOnly Property ScaledIconSize As Size
	Get
Property Value
Type: Size
IconSize times DPI scale
See Also
Reference
Panels Class
Rhino.UI Namespace