RhinoCommon API
Fonts.SmallFont Property
 Returns a font use for small text in dialog boxes. 0.8x the size of NormalFont.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Font SmallFont { get; }
Public Shared ReadOnly Property SmallFont As Font
	Get
Property Value
Type: Font
See Also
Reference
Fonts Class
Rhino.UI Namespace