RhinoCommon API
RTreeEventArgs.IdPtr Property
 Gets the identifier pointer of the found item.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IntPtr IdPtr { get; }
Public ReadOnly Property IdPtr As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace