RhinoCommon API
Ellipse.IsValid Property
 Returns an indication of the validity of this ellipse.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace