RhinoCommon API
ColorHSV.S Property
 Gets or sets the saturation channel value. Saturation channels are limited to a 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double S { get; set; }
Public Property S As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace