RhinoCommon API
BrepTrim.Loop Property
 Loop that this trim belongs to
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public BrepLoop Loop { get; }
Public ReadOnly Property Loop As BrepLoop
	Get
Property Value
Type: BrepLoop
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace