RhinoCommon API
BrepTrim.Face Property
 Brep face this trim belongs to
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public BrepFace Face { get; }
Public ReadOnly Property Face As BrepFace
	Get
Property Value
Type: BrepFace
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace