RhinoCommon API
ContentUuids.BitmapTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.BitmapTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid BitmapTextureType { get; }
Public Shared ReadOnly Property BitmapTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace