RhinoCommon API
DisplayPipelineAttributes.StereoContext Property
 Get or set the stereo render context.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public StereoContext StereoContext { get; set; }
Public Property StereoContext As StereoContext
	Get
	Set
Property Value
Type: StereoContext
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace