RhinoCommon API
TwoColorRenderTexture.Color1 Property
[Missing <summary> documentation for "P:Rhino.Render.TwoColorRenderTexture.Color1"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Color4f Color1 { get; set; }
Public Property Color1 As Color4f
	Get
	Set
Property Value
Type: Color4f
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace