RhinoCommon API
File3dmSettings.CurrentDimensionStyleId Property
 The id of the dimension style new annotation uses. When this is nil Rhino falls back to the obsolete V5 index, which selects the first style in the table - so a template that leaves it nil can open with the wrong annotation style current.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public Guid CurrentDimensionStyleId { get; set; }
Public Property CurrentDimensionStyleId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace