RhinoCommon API
PageSettings.WidthMillimeters Property
Paper width in millimeters.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public double WidthMillimeters { get; set; }
Public Property WidthMillimeters As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PageSettings Class
Rhino.DocObjects Namespace