RhinoCommon API
DimensionStyle.AlternateSuffix Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateSuffix"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string AlternateSuffix { get; set; }
Public Property AlternateSuffix As String
	Get
	Set
Property Value
Type: String
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace