RhinoCommon API
Dimension.DetailMeasured Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.DetailMeasured"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid DetailMeasured { get; set; }
Public Property DetailMeasured As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Dimension Class
Rhino.Geometry Namespace