RhinoCommon API
LicenseData.IsUpgradeFromPreviousVersion Property
 Set to true if this license requires a previous version license to be entered. Caller must also pass VerifyPreviousVersionLicenseDelegate to GetLicense/AskUserForLicense.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsUpgradeFromPreviousVersion { get; set; }
Public Property IsUpgradeFromPreviousVersion As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace