RhinoCommon API
RhinoDoc.RenderMaterialAssignmentChangedEventArgs.IsObject Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.IsObject"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public bool IsObject { get; }
Public ReadOnly Property IsObject As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc.RenderMaterialAssignmentChangedEventArgs Class
Rhino Namespace