RhinoCommon API
QuadRemeshParameters.SymmetryAxis Property
 Symmetry axis to use for symmetric re-meshing
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public QuadRemeshSymmetryAxis SymmetryAxis { get; set; }
Public Property SymmetryAxis As QuadRemeshSymmetryAxis
	Get
	Set
Property Value
Type: QuadRemeshSymmetryAxis
See Also
Reference
QuadRemeshParameters Class
Rhino.Geometry Namespace