RhinoCommon API
FileSettings.LocalProfileDataFolder Property
 Get full path to a Rhino specific sub-folder under the per-user Local (non-roaming) Profile folder. This is the folder where user-specific data is stored. On Windows 7, 8, usually someplace like: "C:\Users\[USERNAME]\AppData\Local\McNeel\Rhinoceros\[VERSION_NUMBER]\"
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public static string LocalProfileDataFolder { get; }
Public Shared ReadOnly Property LocalProfileDataFolder As String
	Get
Property Value
Type: String
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace