RhinoCommon API
CurveKinkDefinition.KinkAtTangentChange Property
 Returns true if tangent discontinuities should be tested when finding kinks. The angle used for testing is KinkAngleDegrees().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool KinkAtTangentChange { get; set; }
Public Property KinkAtTangentChange As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CurveKinkDefinition Class
Rhino.Geometry Namespace