RhinoCommon API
Vector2f.SquareLength Property
 Returns the square of the length of this vector. This method does not check for the validity of its inputs.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public float SquareLength { get; }
Public ReadOnly Property SquareLength As Single
	Get
Property Value
Type: Single
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace