RhinoCommon API
DisplayAttributeMaterial.ShineIntensity Property
 Shine intensity.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int ShineIntensity { get; set; }
Public Property ShineIntensity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace