RhinoCommon API
ICollapsibleSectionHolder.RightMargin Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSectionHolder.RightMargin"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
int RightMargin { get; set; }
Property RightMargin As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace