RhinoCommon API
CommandLineOption.EnglishName Property
 The English command option name
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string EnglishName { get; }
Public ReadOnly Property EnglishName As String
	Get
Property Value
Type: String
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace