RhinoCommon API
Ellipse.FocalDistance Property
 Gets the distance from the center to a focus.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.16
Syntax
public double FocalDistance { get; }
Public ReadOnly Property FocalDistance As Double
	Get
Property Value
Type: Double
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace