RhinoCommon API
Decal.Origin Property
 Gets the origin of the decal in world space.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public Point3d Origin { get; set; }
Public Property Origin As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Decal Class
Rhino.Render Namespace