RhinoCommon API
DisplayPipelineAttributes.BackMaterialShine Property
 Get or set the back material shine (0 to Rhino.DocObjects.Material.MaxShine). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public double BackMaterialShine { get; set; }
Public Property BackMaterialShine As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace