RhinoCommon API
SubDComponent.ComponentDirection Property
 True when this component is referenced with the reverse of its natural orientation. This is always false for vertices, and for edges and faces obtained directly from the parent SubD; it is only set on components reached through an oriented reference, such as the face on a given side of an oriented edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool ComponentDirection { get; set; }
Public Property ComponentDirection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace