RhinoCommon API
PointCloudItem.Y Property
 Gets or sets the Y component of this point cloud item location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Y { get; set; }
Public Property Y As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace