RhinoCommon API
WorksessionModel.UpdateAvailable Property
 True if the file on disk has changed since it was attached, so Update(UInt32) has something to do.
 This is only filled in when the snapshot was taken with the file check enabled. Models enables it; pass false to GetModels(Boolean) to skip it, and this is then always false.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UpdateAvailable { get; }
Public ReadOnly Property UpdateAvailable As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
WorksessionModel Class
Rhino.DocObjects Namespace