RhinoCommon API
OptionString.InitialValue Property
 Gets the initial value of the option.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string InitialValue { get; }
Public ReadOnly Property InitialValue As String
	Get
Property Value
Type: String
See Also
Reference
OptionString Class
Rhino.Input.Custom Namespace