RhinoCommon API
Text3d.Bold Property
 Gets or sets whether this Text3d object will be drawn in Bold.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Bold { get; set; }
Public Property Bold As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Text3d Class
Rhino.Display Namespace