RhinoCommon API
DisplayPipelineAttributes.SurfaceIsoUVColor Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceIsoUVColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public Color SurfaceIsoUVColor { get; set; }
Public Property SurfaceIsoUVColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace