RhinoCommon API
DisplayPipelineAttributes.SurfaceNakedAdgeColorReduction Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceNakedAdgeColorReduction"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public int SurfaceNakedAdgeColorReduction { get; set; }
Public Property SurfaceNakedAdgeColorReduction As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace