RhinoCommon API
FileVdaWriteOptions.CompanyName Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVdaWriteOptions.CompanyName"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string CompanyName { get; set; }
Public Property CompanyName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileVdaWriteOptions Class
Rhino.FileIO Namespace