RhinoCommon API
BrepEdgeFilletDistance.FilletDistance Property
 Distance to fillet
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public double FilletDistance { get; }
Public ReadOnly Property FilletDistance As Double
	Get
Property Value
Type: Double
See Also
Reference
BrepEdgeFilletDistance Class
Rhino.Geometry Namespace