RhinoCommon API
ViewSettings.ThreePointPerspectiveLensLength Property
 Gets the three point perspective lens length. The default is 50mm.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.20
Syntax
public static double ThreePointPerspectiveLensLength { get; }
Public Shared ReadOnly Property ThreePointPerspectiveLensLength As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace