RhinoCommon API
AppearanceSettings.WorldCoordIconZAxisColor Property
 Gets or sets the color of the world coordinate Z axis.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color WorldCoordIconZAxisColor { get; set; }
Public Shared Property WorldCoordIconZAxisColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace