RhinoCommon API
ObjectAttributes.EnableCustomMeshingParameters Property
En/disables the custom meshing parameters enabled state.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool EnableCustomMeshingParameters { get; set; }
Public Property EnableCustomMeshingParameters As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace