RhinoCommon API
DracoCompressionOptions.PositionQuantizationBits Property
 Sets the quantization compression options for position values. The values will be quantized in a box defined by the maximum extent of the values. I.e., the actual precision of this option depends on the scale of the attribute values.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int PositionQuantizationBits { get; set; }
Public Property PositionQuantizationBits As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DracoCompressionOptions Class
Rhino.FileIO Namespace