RhinoCommon API
Dimension.LengthResolution Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.LengthResolution"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int LengthResolution { get; set; }
Public Property LengthResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Dimension Class
Rhino.Geometry Namespace