RhinoCommon API
ProviderIds.ContentSelectionForSetParams Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.ContentSelectionForSetParams"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
public static Guid ContentSelectionForSetParams { get; }
Public Shared ReadOnly Property ContentSelectionForSetParams As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace