RhinoCommon API
CursorTooltipSettings.TooltipsEnabled Property
 Turns on/off cursor tooltips.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool TooltipsEnabled { get; set; }
Public Shared Property TooltipsEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace