RhinoCommon API
FilePlyWriteOptions.MeshingParameters Property
[Missing <summary> documentation for "P:Rhino.FileIO.FilePlyWriteOptions.MeshingParameters"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public MeshingParameters MeshingParameters { get; set; }
Public Property MeshingParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace