RhinoCommon API
SporphSpaceMorph.ConstrainNormal Property
 Specifies how the normal direction of the base surface is mapped onto the target surface. To use the target surface normal, set to Unset.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public Vector3d ConstrainNormal { get; set; }
Public Property ConstrainNormal As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
SporphSpaceMorph Class
Rhino.Geometry.Morphs Namespace