RhinoCommon API
RealtimeDisplayMode.DrawMiddlegroundEventArgs.Pipeline Property
[Missing <summary> documentation for "P:Rhino.Render.RealtimeDisplayMode.DrawMiddlegroundEventArgs.Pipeline"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DisplayPipeline Pipeline { get; }
Public ReadOnly Property Pipeline As DisplayPipeline
	Get
Property Value
Type: DisplayPipeline
See Also
Reference
RealtimeDisplayMode.DrawMiddlegroundEventArgs Class
Rhino.Render Namespace