RhinoCommon API
FileSkpWriteOptions.Version Property
 Set the version of the skp file being written.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileSkpWriteOptions.SketchUpVersion Version { get; set; }
Public Property Version As FileSkpWriteOptions.SketchUpVersion
	Get
	Set
Property Value
Type: FileSkpWriteOptions.SketchUpVersion
See Also
Reference
FileSkpWriteOptions Class
Rhino.FileIO Namespace