RhinoCommon API
Arc.MidPoint Property
 Gets the mid-point of the arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d MidPoint { get; }
Public ReadOnly Property MidPoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Arc Structure
Rhino.Geometry Namespace