RhinoCommon API
MeshFaceList.Item Property
 Returns the mesh face at the given index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshFace this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As MeshFace
	Get
	Set
Parameters
index
Type: System.Int32
Index of face to get. Must be larger than or equal to zero and smaller than the Face Count of the mesh.
Property Value
Type: MeshFace
Implements
IList<T>.Item[Int32]
IReadOnlyList<T>.Item[Int32]
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace