RhinoCommon API
BoundingBox.Empty Property
 Gets an [Empty] bounding box. An Empty box is an invalid structure that has negative width.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static BoundingBox Empty { get; }
Public Shared ReadOnly Property Empty As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace