RhinoCommon API
ViewInfo.RenderingSize Property
The pixel size this view renders at.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public Size RenderingSize { get; set; }
Public Property RenderingSize As Size
	Get
	Set
Property Value
Type: Size
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace