RhinoCommon API
StringParserSettings.PreferedLocaleId Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.PreferedLocaleId"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint PreferedLocaleId { get; set; }
Public Property PreferedLocaleId As UInteger
	Get
	Set
Property Value
Type: UInt32
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace