RhinoCommon API
SoftTransformSettingsState.ShowConstraintWidgets Property
 Enables or disables constraint widgets on the edges of surfaces when points are on.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ShowConstraintWidgets { get; set; }
Public Property ShowConstraintWidgets As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SoftTransformSettingsState Class
Rhino.ApplicationSettings Namespace