RhinoCommon API
EndAnalysisSettingsState.ClosedSeams Property
 Gets or sets whether to display the closed curve seam points.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ClosedSeams { get; set; }
Public Property ClosedSeams As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
EndAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace