RhinoCommon API
ViewCaptureSettings.DrawClippingPlanes Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawClippingPlanes"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DrawClippingPlanes { get; set; }
Public Property DrawClippingPlanes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace