RhinoCommon API
File3dmCurvePiping.On Property
 Specifies whether curve piping is enabled or not.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool On { get; set; }
Public Property On As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmCurvePiping Class
Rhino.FileIO Namespace