RhinoCommon API
RadialDimension.LeaderCurveStyle Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.LeaderCurveStyle"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.LeaderCurveStyle LeaderCurveStyle { get; set; }
Public Property LeaderCurveStyle As DimensionStyle.LeaderCurveStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderCurveStyle
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace