RhinoCommon API
PlugIn.LicenseId Property
[Missing <summary> documentation for "P:Rhino.PlugIns.PlugIn.LicenseId"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid LicenseId { get; }
Public ReadOnly Property LicenseId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace