RhinoCommon API
ProviderIds.RdkRenderingPostEffectBloom Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.RdkRenderingPostEffectBloom"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Guid RdkRenderingPostEffectBloom { get; }
Public Shared ReadOnly Property RdkRenderingPostEffectBloom As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace