RhinoCommon API
NamedColorList.Name Property
 The name of the color list, which may be displayed to the user.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
NamedColorList Class
Rhino.UI Namespace