RhinoCommon API
LengthMassProperties.CentroidCoordinatesProductMoments Property
 Product moments with respect to centroid coordinate system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public Vector3d CentroidCoordinatesProductMoments { get; }
Public ReadOnly Property CentroidCoordinatesProductMoments As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace