RhinoCommon API
MeshBooleanOptions.Tolerance Property
 Gets or sets a tolerance value for intersections and overlaps.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double Tolerance { get; set; }
Public Property Tolerance As Double
	Get
	Set
Property Value
Type: Double
The default value is ZeroTolerance*10. However, this is only a reference value for testing and geometry developers should generally use the document tolerance, multiplied by MeshIntersectionsTolerancesCoefficient.
See Also
Reference
MeshBooleanOptions Class
Rhino.Geometry Namespace
Intersection.MeshIntersectionsTolerancesCoefficient