RhinoCommon API
ModelAidSettingsState.SnapToLocked Property
Gets or sets the locked state of the snap modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SnapToLocked { get; set; }
Public Property SnapToLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace