RhinoCommon API
RenderMaterial.PaintMaterialGuid Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PaintMaterialGuid"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid PaintMaterialGuid { get; }
Public Shared ReadOnly Property PaintMaterialGuid As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace