RhinoCommon API
IsoDrawEffect.RotationRadians Property
[Missing <summary> documentation for "P:Rhino.Display.IsoDrawEffect.RotationRadians"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double RotationRadians { get; set; }
Public Property RotationRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace