RhinoCommon API
DisplayPipelineAttributes.ShadingEnabled Property
Draw shaded meshes and surfaces
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public bool ShadingEnabled { get; set; }
Public Property ShadingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace