RhinoCommon API
FileSettings.FileLockingEnabled Property
Ensure that only one person at a time can have a file open for saving.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool FileLockingEnabled { get; set; }
Public Shared Property FileLockingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace