RhinoCommon API
HiddenLineDrawingPoint.PointVisibility Property
 Returns the point's visibility
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public HiddenLineDrawingPoint.Visibility PointVisibility { get; }
Public ReadOnly Property PointVisibility As HiddenLineDrawingPoint.Visibility
	Get
Property Value
Type: HiddenLineDrawingPoint.Visibility
See Also
Reference
HiddenLineDrawingPoint Class
Rhino.Geometry Namespace