RhinoCommon API
ConstructionPlaneGridDefaults.ShowWorldAxes Property
Show the world axes icon in the corner
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public bool ShowWorldAxes { get; set; }
Public Property ShowWorldAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ConstructionPlaneGridDefaults Class
Rhino.DocObjects Namespace