RhinoCommon API
IntersectionEvent.IsPoint Property
 All curve intersection events are either a single point or an overlap.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsPoint { get; }
Public ReadOnly Property IsPoint As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace