RhinoCommon API
Linetype.ShapeBounds Property
 The bounding box of the shapes in this linetype definition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public BoundingBox ShapeBounds { get; }
Public ReadOnly Property ShapeBounds As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace