RhinoCommon API
WorksessionModel.SerialNumber Property
 The reference model's serial number, which identifies this model in calls like Detach(UInt32). Zero means this is the worksession's active model.
 Reference model serial numbers are unique across the application, not just within one document, so a serial number from another document's worksession will simply not be found rather than matching the wrong model.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public uint SerialNumber { get; }
Public ReadOnly Property SerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
WorksessionModel Class
Rhino.DocObjects Namespace