RhinoCommon API
CreatePreviewEventArgs.ContentKind Property
 Description of content that preview is being generated for.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderContentKind ContentKind { get; }
Public ReadOnly Property ContentKind As RenderContentKind
	Get
Property Value
Type: RenderContentKind
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace