RhinoCommon API
RhinoDoc.DateCreated Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.DateCreated"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DateTime DateCreated { get; }
Public ReadOnly Property DateCreated As DateTime
	Get
Property Value
Type: DateTime
See Also
Reference
RhinoDoc Class
Rhino Namespace