RhinoCommon API
ModelAidSettingsState.Osnap Property
Gets or sets the enabled state of Rhino's object snap modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Osnap { get; set; }
Public Property Osnap As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace