RhinoCommon API
RhinoDoc.TextureMappingEventArgs.NewMapping Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.TextureMappingEventArgs.NewMapping"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public TextureMapping NewMapping { get; }
Public ReadOnly Property NewMapping As TextureMapping
	Get
Property Value
Type: TextureMapping
See Also
Reference
RhinoDoc.TextureMappingEventArgs Class
Rhino Namespace