RhinoCommon API
MeshDisplacementInfo.MemoryLimit Property
 Specifies how much memory can be allocated for use by the displacement mesh. Value in megabytes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int MemoryLimit { get; set; }
Public Property MemoryLimit As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace