RhinoCommon API
GetEllipse.MarkFoci Property
 Indicates the user wants the ellipse foci marked with point objects.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool MarkFoci { get; set; }
Public Property MarkFoci As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetEllipse Class
Rhino.Input.Custom Namespace