RhinoCommon API
MouseState.Button Property
 Which button or buttons are currently pressed
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public MouseButton Button { get; }
Public ReadOnly Property Button As MouseButton
	Get
Property Value
Type: MouseButton
See Also
Reference
MouseState Class
Rhino.UI Namespace