RhinoCommon API
ViewCaptureWriter.Pen.Width Property
[Missing <summary> documentation for "P:Rhino.Runtime.ViewCaptureWriter.Pen.Width"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public float Width { get; }
Public ReadOnly Property Width As Single
	Get
Property Value
Type: Single
See Also
Reference
ViewCaptureWriter.Pen Class
Rhino.Runtime Namespace