RhinoCommon API
BezierSurface.Dimension Property
Dimension of Bezier
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public int Dimension { get; }
Public ReadOnly Property Dimension As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace