RhinoCommon API
SweepOneRail.IsRoadlineRight Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.IsRoadlineRight"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsRoadlineRight { get; }
Public ReadOnly Property IsRoadlineRight As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace