RhinoCommon API
NurbsCurveFitParameters.ApplyTangentMatchingAtKinks Property
 If true, the TangentMatching setting is applied at kinks. Otherwise, TangentMatching applies only to the ends of curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ApplyTangentMatchingAtKinks { get; set; }
Public Property ApplyTangentMatchingAtKinks As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace