RhinoCommon API
RenderContent.ChildSlotDisplayName Property
 Returns the localized display name of the child slot name
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string ChildSlotDisplayName { get; }
Public ReadOnly Property ChildSlotDisplayName As String
	Get
Property Value
Type: String
See Also
Reference
RenderContent Class
Rhino.Render Namespace