RhinoCommon API
RenderSettings.PostEffects Property
 If this object is associated with a document, this gets the document post effect data collection. If this object is associated with a File3dm, this gets the File3dm's post effect data collection. Otherwise it gets a 'free-floating' post effect data collection object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public PostEffectCollection PostEffects { get; }
Public ReadOnly Property PostEffects As PostEffectCollection
	Get
Property Value
Type: PostEffectCollection
See Also
Reference
RenderSettings Class
Rhino.Render Namespace