RhinoCommon API
MeshFace.A Property
 Gets or sets the first corner index of the mesh face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int A { get; set; }
Public Property A As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace