RhinoCommon API
AreaMassProperties.CentroidCoordinatesMomentsOfInertiaError Property
 Uncertainty in centroid coordinates moments of inertia calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d CentroidCoordinatesMomentsOfInertiaError { get; }
Public ReadOnly Property CentroidCoordinatesMomentsOfInertiaError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace