RhinoCommon API
FileAiWriteOptions.AIScale Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileAiWriteOptions.AIScale"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double AIScale { get; set; }
Public Property AIScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileAiWriteOptions Class
Rhino.FileIO Namespace