RhinoCommon API
TimeZone.Name Property
 Gets name of a time zone.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
TimeZone Class
Rhino.Render Namespace