RhinoCommon API
AnnotationBase.RichText Property
 Text including additional RTF formatting information
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string RichText { get; set; }
Public Property RichText As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace