RhinoCommon API
Sphere.Diameter Property
 Gets or sets the diameter for this sphere.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Diameter { get; set; }
Public Property Diameter As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace