RhinoCommon API
ModelComponent.IsDeleted Property
 true if the component is deleted. Deleted components are kept by the document for undo purposes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public virtual bool IsDeleted { get; }
Public Overridable ReadOnly Property IsDeleted As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace