RhinoCommon API
Dimension.ToleranceHeightScale Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ToleranceHeightScale"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ToleranceHeightScale { get; set; }
Public Property ToleranceHeightScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace