RhinoCommon API
ImageFileEventArgs.EllapsedTime Property
[Missing <summary> documentation for "P:Rhino.Render.ImageFileEventArgs.EllapsedTime"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public int EllapsedTime { get; }
Public ReadOnly Property EllapsedTime As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ImageFileEventArgs Class
Rhino.Render Namespace