RhinoCommon API
DisplayPipelineAttributes.MeshNonmanifoldEdgeColorReduction Property
 The darken percentage of the color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int MeshNonmanifoldEdgeColorReduction { get; set; }
Public Property MeshNonmanifoldEdgeColorReduction As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace