RhinoCommon API
FileGltfWriteOptions.ExportVertexColors Property
 Enable/disable the export of vertex colors
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public bool ExportVertexColors { get; set; }
Public Property ExportVertexColors As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace