RhinoCommon API
Quaternion.J Property
 Returns the (0,0,1,0) quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Quaternion J { get; }
Public Shared ReadOnly Property J As Quaternion
	Get
Property Value
Type: Quaternion
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace