RhinoCommon API
DisplayBitmapDrawList.BoundingBox Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayBitmapDrawList.BoundingBox"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace