RhinoCommon API
CommonObject.HasUserData Property
 Gets true if this class has any custom information attached to it through UserData.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool HasUserData { get; }
Public ReadOnly Property HasUserData As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace