RhinoCommon API
PhysicallyBased.AnisotropicRotation Property
[Missing <summary> documentation for "P:Rhino.Render.ParameterNames.PhysicallyBased.AnisotropicRotation"]
 Namespace: Rhino.Render.ParameterNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string AnisotropicRotation { get; }
Public Shared ReadOnly Property AnisotropicRotation As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ParameterNames Namespace