RhinoCommon API
FilePdfReadOptions.LoadText Property
[Missing <summary> documentation for "P:Rhino.FileIO.FilePdfReadOptions.LoadText"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool LoadText { get; set; }
Public Property LoadText As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FilePdfReadOptions Class
Rhino.FileIO Namespace