RhinoCommon API
GrasshopperDisplayMaterial.Desaturation Property
 Gets or sets how far the shaded colour is blended towards greyscale, as a fraction from 0 to 1: 0 leaves the colour untouched, 1 is fully greyscale, and values in between blend linearly. Default: 0.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Desaturation { get; set; }
Public Property Desaturation As Double
	Get
	Set
Property Value
Type: Double
Remarks
 The blend is applied uniformly to the final colour of the whole surface, including flat (unshaded) vertex colours — see ShadeFalseColor. It holds luminosity constant, so the colour drains towards grey without the surface appearing to get lighter or darker.
See Also
Reference
GrasshopperDisplayMaterial Class
Rhino.Display Namespace