RhinoCommon API
IsoDrawEffect.GapColor Property
[Missing <summary> documentation for "P:Rhino.Display.IsoDrawEffect.GapColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color GapColor { get; set; }
Public Property GapColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace