RhinoCommon API
ModelAidSettings.OrthoAngle Property
Gets or sets the base orthogonal angle.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static double OrthoAngle { get; set; }
Public Shared Property OrthoAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace