RhinoCommon API
Worksession.Models Property
 The models in this worksession, including the active model.
UpdateAvailable is filled in, so this reports the same state the Worksessions panel shows. Use GetModels(Boolean) with false to skip that check.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public WorksessionModel[] Models { get; }
Public ReadOnly Property Models As WorksessionModel()
	Get
Property Value
Type: WorksessionModel[]
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace