RhinoCommon API
CommandPromptChangedEventArgs.PromptDefault Property
Default command line prompt text
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string PromptDefault { get; }
Public ReadOnly Property PromptDefault As String
	Get
Property Value
Type: String
See Also
Reference
CommandPromptChangedEventArgs Class
Rhino.UI Namespace