RhinoCommon API
MeshObject.IsCustomObject Property
[Missing <summary> documentation for "P:Rhino.DocObjects.MeshObject.IsCustomObject"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsCustomObject { get; }
Public ReadOnly Property IsCustomObject As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MeshObject Class
Rhino.DocObjects Namespace