RhinoCommon API
ColorRGBA.White Property
[Missing <summary> documentation for "P:Rhino.Display.ColorRGBA.White"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static ColorRGBA White { get; }
Public Shared ReadOnly Property White As ColorRGBA
	Get
Property Value
Type: ColorRGBA
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace