RhinoCommon API
TextDotUserInterfaceObject.TextColor Property
 Text color used for dot text
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color TextColor { get; set; }
Public Property TextColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
TextDotUserInterfaceObject Class
Rhino.UI Namespace