RhinoCommon API
GetTorus.AroundDirectionCount Property
 The number of faces in the around direction.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int AroundDirectionCount { get; set; }
Public Property AroundDirectionCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GetTorus Class
Rhino.Input.Custom Namespace