RhinoCommon API
SquishParameters.InteriorStretchConstant Property
 Spring constant for stretched boundary edges times the rest length
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public double InteriorStretchConstant { get; set; }
Public Property InteriorStretchConstant As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SquishParameters Class
Rhino.Geometry Namespace