RhinoCommon API
FilePlyReadOptions.PLYModelUnits Property
[Missing <summary> documentation for "P:Rhino.FileIO.FilePlyReadOptions.PLYModelUnits"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public UnitSystem PLYModelUnits { get; set; }
Public Property PLYModelUnits As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
FilePlyReadOptions Class
Rhino.FileIO Namespace