RhinoCommon API
CalculateBoundingBoxEventArgs.BoundingBox Property
 Gets the current bounding box.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
CalculateBoundingBoxEventArgs Class
Rhino.Display Namespace