RhinoCommon API
FileFbxReadOptions.ImportCameras Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileFbxReadOptions.ImportCameras"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportCameras { get; set; }
Public Property ImportCameras As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileFbxReadOptions Class
Rhino.FileIO Namespace