RhinoCommon API
GetTransform.HaveTransform Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetTransform.HaveTransform"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool HaveTransform { get; set; }
Public Property HaveTransform As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace