RhinoCommon API
UserInterfaceControl.TextVerticalAlignment Property
 Where the text sits inside the control's rectangle. This is not the same as VerticalAlignment, which is where the control sits inside its parent.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public ControlVerticalAlignment TextVerticalAlignment { get; set; }
Public Property TextVerticalAlignment As ControlVerticalAlignment
	Get
	Set
Property Value
Type: ControlVerticalAlignment
See Also
Reference
UserInterfaceControl Class
Rhino.UI Namespace