RhinoCommon API
FileAiWriteOptions.PreserveModelScale Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileAiWriteOptions.PreserveModelScale"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool PreserveModelScale { get; set; }
Public Property PreserveModelScale As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileAiWriteOptions Class
Rhino.FileIO Namespace