RhinoCommon API
DisplayPipelineAttributes.GridPlaneVisibility Property
 Set when to show the grid plane
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public DisplayPipelineAttributes.GridPlaneVisibilityMode GridPlaneVisibility { get; set; }
Public Property GridPlaneVisibility As DisplayPipelineAttributes.GridPlaneVisibilityMode
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.GridPlaneVisibilityMode
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace