RhinoCommon API
ThumbData.Intensity Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.Intensity"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Intensity { get; set; }
Public Property Intensity As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace