RhinoCommon API
ViewCaptureSettings.HorizontalScale Property
 Horizontal stretch to be applied to output. Useful for calibrating printers
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public double HorizontalScale { get; set; }
Public Property HorizontalScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace