RhinoCommon API
Dimension.AltZeroSuppression Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AltZeroSuppression"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.ZeroSuppression AltZeroSuppression { get; set; }
Public Property AltZeroSuppression As DimensionStyle.ZeroSuppression
	Get
	Set
Property Value
Type: DimensionStyle.ZeroSuppression
See Also
Reference
Dimension Class
Rhino.Geometry Namespace