RhinoCommon API
SubDToBrepOptions.DefaultPacked Property
 Default ON_SubDToBrepParameters settings for creating a packed brep. Locally-G1 smoothing of extraordinary vertices, packed faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static SubDToBrepOptions DefaultPacked { get; }
Public Shared ReadOnly Property DefaultPacked As SubDToBrepOptions
	Get
Property Value
Type: SubDToBrepOptions
See Also
Reference
SubDToBrepOptions Class
Rhino.Geometry Namespace