RhinoCommon API
MouseState.DpiScale Property
 Device pixels per logical pixel for the surface this event came from. 1.0 when that is not known.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public float DpiScale { get; }
Public ReadOnly Property DpiScale As Single
	Get
Property Value
Type: Single
See Also
Reference
MouseState Class
Rhino.UI Namespace