RhinoCommon API
FileSkpWriteOptions.MaxAngle Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSkpWriteOptions.MaxAngle"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double MaxAngle { get; set; }
Public Property MaxAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileSkpWriteOptions Class
Rhino.FileIO Namespace