RhinoCommon API
FileIgsWriteOptions.Receiver Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.Receiver"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string Receiver { get; set; }
Public Property Receiver As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace