RhinoCommon API
ComponentFunctionInfo.Namespace Property
 The function namespace.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Namespace { get; }
Public ReadOnly Property Namespace As String
	Get
Property Value
Type: String
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace