RhinoCommon API
RTreeEventArgs.Cancel Property
 Gets or sets a value that determines if the search should be conducted farther.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Cancel { get; set; }
Public Property Cancel As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace