RhinoCommon API
LicenseLease.ProductEdition Property
 Edition of product that this lease is issued to. For example, "Commercial" or "Beta"
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string ProductEdition { get; }
Public ReadOnly Property ProductEdition As String
	Get
Property Value
Type: String
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace