RhinoCommon API
Polyline.IsClosed Property
 Test a polyline to see if it is closed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsClosed { get; }
Public ReadOnly Property IsClosed As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Polyline Class
Rhino.Geometry Namespace