RhinoCommon API
ModelAidSettingsState.UseHorizontalDialog Property
Gets or sets the enabled state of Rhino's use horizontal dialog modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool UseHorizontalDialog { get; set; }
Public Property UseHorizontalDialog As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace