RhinoCommon API
Worksession.RuntimeSerialNumber Property
 Unique serial number for the worksession while the application is running. This is not a persistent value.
 Since Rhino 9 worksessions are per-document and no longer have serial numbers of their own, so this returns Document's RuntimeSerialNumber. Prefer that property in new code.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public uint RuntimeSerialNumber { get; }
Public ReadOnly Property RuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace