RhinoCommon API
DisplayPen.Color Property
 Color applied to stroke
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Color Color { get; set; }
Public Property Color As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPen Class
Rhino.Display Namespace