RhinoCommon API
DisplayModeChangedEventArgs.Viewport Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeChangedEventArgs.Viewport"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
See Also
Reference
DisplayModeChangedEventArgs Class
Rhino.Display Namespace