RhinoCommon API
ModelAidSettings.CtrlNudgeKeyStep Property
Gets or sets the Ctrl-key based nudge step amount.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static double CtrlNudgeKeyStep { get; set; }
Public Shared Property CtrlNudgeKeyStep As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace