RhinoCommon API
ViewInfo.WallpaperFilename Property
 Get filename for wallpaper set to this view, if any.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string WallpaperFilename { get; }
Public ReadOnly Property WallpaperFilename As String
	Get
Property Value
Type: String
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace