RhinoCommon API
GumballAppearanceSettings.ColorX Property
Default is Red.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color ColorX { get; set; }
Public Property ColorX As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace