RhinoCommon API
Brep.VariationalPatchSettings.CurvatureRelativeTolerance Property
 Relative curvature (G2) tolerance between curvature values that are both not smaller than CurvatureZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double CurvatureRelativeTolerance { get; set; }
Public Property CurvatureRelativeTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace