RhinoCommon API
HiddenLineDrawingObjectCurve.Index Property
 Index of this object in HiddenLineDrawing.FullCurves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace