RhinoCommon API
Cylinder.Height1 Property
 Gets or sets the start height of the cylinder. The center of bottom cap is: BasePlane.Origin + Height1 * BasePlane.ZAxis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Height1 { get; set; }
Public Property Height1 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace