RhinoCommon API
DimensionStyle.FixedExtensionOn Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.FixedExtensionOn"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool FixedExtensionOn { get; set; }
Public Property FixedExtensionOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace