RhinoCommon API
ObjectAttributes.HatchBoundaryColor Property
 Hatch boundary color override. Default is unset color which means use the standard attributes and layer colors to determine the boundary color
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color HatchBoundaryColor { get; set; }
Public Property HatchBoundaryColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace