RhinoCommon API
ModelAidSettingsState.OrientAutoCPlaneToView Property
 Gets or sets whether the auto cplane will rotate towards the view after aligning to the selection
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public bool OrientAutoCPlaneToView { get; set; }
Public Property OrientAutoCPlaneToView As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace