RhinoCommon API
ChooseOneObjectSettings.YOffset Property
YOffset
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static int YOffset { get; set; }
Public Shared Property YOffset As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace