RhinoCommon API
WorksessionFile.Version Property
 Gets or sets the file version. Reading sets it to the version of the file that was read. Writing does not use it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Version { get; set; }
Public Property Version As Integer
	Get
	Set
Property Value
Type: Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If the value is negative.
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace