RhinoCommon API
DimensionStyle.DimTextOrientation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimTextOrientation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextOrientation DimTextOrientation { get; set; }
Public Property DimTextOrientation As TextOrientation
	Get
	Set
Property Value
Type: TextOrientation
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace