RhinoCommon API
Field.UseTextureAmount Property
 True if 'texture amount' is in use, otherwise false. The 'texture amount' is represented as a numeric stepper in the UI. If true, then the stepper is shown. If false, then the stepper is hidden.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public bool UseTextureAmount { get; set; }
Public Property UseTextureAmount As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Field Class
Rhino.Render.Fields Namespace