RhinoCommon API
ShutLiningCurveInfo.CurveIntervals Property
 The parts of the curve to use as profiles.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ReadOnlyCollection<Interval> CurveIntervals { get; }
Public ReadOnly Property CurveIntervals As ReadOnlyCollection(Of Interval)
	Get
Property Value
Type: ReadOnlyCollection<Interval>
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace