RhinoCommon API
ChangeQueue.DisplayPipelineAttributes Property
 Get the DisplayPipelineAttributes if available, null otherwise
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DisplayPipelineAttributes DisplayPipelineAttributes { get; }
Public ReadOnly Property DisplayPipelineAttributes As DisplayPipelineAttributes
	Get
Property Value
Type: DisplayPipelineAttributes
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace