RhinoCommon API
MeshInstance.MaterialId Property
 The Material CRC / RenderHash
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint MaterialId { get; }
Public ReadOnly Property MaterialId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace