RhinoCommon API
ViewCaptureSettings.Document Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.Document"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public RhinoDoc Document { get; set; }
Public Property Document As RhinoDoc
	Get
	Set
Property Value
Type: RhinoDoc
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace