RhinoCommon API
LengthMassProperties.WorldCoordinatesMomentsOfInertiaError Property
 Uncertainty in world coordinates moments of inertia calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public Vector3d WorldCoordinatesMomentsOfInertiaError { get; }
Public ReadOnly Property WorldCoordinatesMomentsOfInertiaError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace