RhinoCommon API
UnitsChangedWithScalingEventArgs.DocumentSerialNumber Property
 Gets the uniques document serial number for this event.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.20
Syntax
public uint DocumentSerialNumber { get; }
Public ReadOnly Property DocumentSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
UnitsChangedWithScalingEventArgs Class
Rhino Namespace