RhinoCommon API
ProviderIds.RdkEdit Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.RdkEdit"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public static Guid RdkEdit { get; }
Public Shared ReadOnly Property RdkEdit As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace