RhinoCommon API
Dimension.ToleranceUpperValue Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ToleranceUpperValue"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ToleranceUpperValue { get; set; }
Public Property ToleranceUpperValue As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace