RhinoCommon API
Decal.MapToInside Property
 Used only when mapping is cylindrical or spherical.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public bool MapToInside { get; set; }
Public Property MapToInside As Boolean
	Get
	Set
Property Value
Type: Boolean
true if texture is mapped to inside of sphere or cylinder, else \e false.
See Also
Reference
Decal Class
Rhino.Render Namespace