RhinoCommon API
ModelAidSettings.DigitizerOsnapPickboxRadius Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettings.DigitizerOsnapPickboxRadius"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static double DigitizerOsnapPickboxRadius { get; set; }
Public Shared Property DigitizerOsnapPickboxRadius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace