RhinoCommon API
DisplayPipelineAttributes.FrontMaterial Property
 The material used to shade the front faces of an object. The Front* properties on this class are shortcuts into it.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public DisplayAttributeMaterial FrontMaterial { get; }
Public ReadOnly Property FrontMaterial As DisplayAttributeMaterial
	Get
Property Value
Type: DisplayAttributeMaterial
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace