RhinoCommon API
MeshExtruder.PreviewLines Property
 Gets Line objects to preview extruded mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public Line[] PreviewLines { get; }
Public ReadOnly Property PreviewLines As Line()
	Get
Property Value
Type: Line[]
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace