RhinoCommon API
GetPoint.DynamicDrawColor Property
 Color used by CRhinoGetPoint::DynamicDraw to draw the current point and the line from the base point to the current point.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color DynamicDrawColor { get; set; }
Public Property DynamicDrawColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace