RhinoCommon API
DisplayModeDescription.XRayId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.XRayId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid XRayId { get; }
Public Shared ReadOnly Property XRayId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace