RhinoCommon API
SectionStyle.HatchScale Property
 Scale to apply to the hatch pattern
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double HatchScale { get; set; }
Public Property HatchScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace