RhinoCommon API
SimpleArrayPoint2d.Count Property
 Gets the amount of points in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SimpleArrayPoint2d Class
Rhino.Runtime.InteropWrappers Namespace