RhinoCommon API
FileWriteOptions.UseCompression Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.UseCompression"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UseCompression { get; set; }
Public Property UseCompression As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace