RhinoCommon API
RenderContentType.Id Property
 Returns the type identifier associated with this type.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderContentType Class
Rhino.Render Namespace