RhinoCommon API
TextFields.InstanceAttributeField.DefaultValue Property
 Default value used when inserting a block
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string DefaultValue { get; }
Public ReadOnly Property DefaultValue As String
	Get
Property Value
Type: String
See Also
Reference
TextFields.InstanceAttributeField Class
Rhino.Runtime Namespace