RhinoCommon API
CloudHostUtils.DenyReason Property
Human-readable reason the entitlement was actively denied. Null both when entitled AND when the gate doesn't apply to this instance.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.33
Syntax
public static string DenyReason { get; }
Public Shared ReadOnly Property DenyReason As String
	Get
Property Value
Type: String
See Also
Reference
CloudHostUtils Class
Rhino.Runtime Namespace