RhinoCommon API
DisplayPipelineAttributes.LockedObjectsDrawBehindOthers Property
Locked object are drawn behind other objects
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public bool LockedObjectsDrawBehindOthers { get; set; }
Public Property LockedObjectsDrawBehindOthers As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace