RhinoCommon API
File3dmSettings.PageUnitSystem Property
 Gets or sets the page unit system, using UnitSystem enumeration.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public UnitSystem PageUnitSystem { get; set; }
Public Property PageUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace