RhinoCommon API
BrepTrim.EndVertex Property
 BrepVertex at end of trim
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public BrepVertex EndVertex { get; }
Public ReadOnly Property EndVertex As BrepVertex
	Get
Property Value
Type: BrepVertex
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace