RhinoCommon API
Triangle3d.Circumcircle Property
 Gets the circumcircle of this triangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Circle Circumcircle { get; }
Public ReadOnly Property Circumcircle As Circle
	Get
Property Value
Type: Circle
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace