RhinoCommon API
MeshCheckParameters.CheckForNakedEdges Property
 If true, then look for topological edges in the mesh topology where the face count is 1. Note, this check is also made if CheckForDuplicateFaces is true but the output is not shown if CheckForNakedEdges is false.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool CheckForNakedEdges { get; set; }
Public Property CheckForNakedEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace