RhinoCommon API
Mesh.ComponentStates Property
 Gets access to the vertex hidden/visibility collection in this mesh. This is a runtime property and it is not saved in the 3dm file.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public MeshVertexStatusList ComponentStates { get; }
Public ReadOnly Property ComponentStates As MeshVertexStatusList
	Get
Property Value
Type: MeshVertexStatusList
See Also
Reference
Mesh Class
Rhino.Geometry Namespace