RhinoCommon API
RenderTexture.RenderHashWithoutLocalMappingOrLinearWorkflow Property
 Render hash for texture excluding local mapping and linear workflow.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public uint RenderHashWithoutLocalMappingOrLinearWorkflow { get; }
Public ReadOnly Property RenderHashWithoutLocalMappingOrLinearWorkflow As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RenderTexture Class
Rhino.Render Namespace