RhinoCommon API
ChooseOneObjectSettings.FollowCursor Property
FollowCursor
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool FollowCursor { get; set; }
Public Shared Property FollowCursor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace