RhinoCommon API
FileReadOptions.LinkedInstanceDefinitionSerialNumber Property
 If a file is being read to create an instance definition, then this value will be the serial number of the instance definition being created. Otherwise, this value will be 0;
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public uint LinkedInstanceDefinitionSerialNumber { get; }
Public ReadOnly Property LinkedInstanceDefinitionSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace