RhinoCommon API
BrepFace.Brep Property
 Gets the Brep that owns this face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.9
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace