RhinoCommon API
MeshUnwrapper.SymmetryPlane Property
 Symmetry plane. Unwrapper tries to keep unwrap result symmetric to this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public Plane SymmetryPlane { set; }
Public WriteOnly Property SymmetryPlane As Plane
	Set
Property Value
Type: Plane
See Also
Reference
MeshUnwrapper Class
Rhino.Geometry Namespace