RhinoCommon API
Sphere.BoundingBox Property
 Gets the world aligned bounding box for this Sphere. If the Sphere is Invalid, an empty box is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace