RhinoCommon API
ModelAidSettings.AltPlusArrow Property
true means Alt+arrow is used for nudging.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool AltPlusArrow { get; set; }
Public Shared Property AltPlusArrow As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace