RhinoCommon API
DisplayPipelineAttributes.ViewDisplayAttributes.WorldAxisColorX Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes.WorldAxisColorX"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color WorldAxisColorX { get; set; }
Public Property WorldAxisColorX As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace