RhinoCommon API
SubDCreationOptions.ConcaveCornerTest Property
 Get or sets the concave corner test option.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDCreationOptions.ConcaveCornerOption ConcaveCornerTest { get; set; }
Public Property ConcaveCornerTest As SubDCreationOptions.ConcaveCornerOption
	Get
	Set
Property Value
Type: SubDCreationOptions.ConcaveCornerOption
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace