RhinoCommon API
ConstructionPlaneGridDefaults.ShowGridAxes Property
Show the grid axes
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public bool ShowGridAxes { get; set; }
Public Property ShowGridAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ConstructionPlaneGridDefaults Class
Rhino.DocObjects Namespace