RhinoCommon API
DisplayPipelineAttributes.BackMaterialTransparency Property
 Get or set the back material transparency (0.0 opaque to 1.0 transparent). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public double BackMaterialTransparency { get; set; }
Public Property BackMaterialTransparency As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace