RhinoCommon API
RhinoObject.WorksessionReferenceSerialNumber Property
 Obsolete - use ReferenceModelSerialNumber
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public uint WorksessionReferenceSerialNumber { get; }
Public ReadOnly Property WorksessionReferenceSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace