RhinoCommon API
FileDgnReadOptions.ImportUnreferencedLineStyles Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDgnReadOptions.ImportUnreferencedLineStyles"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportUnreferencedLineStyles { get; set; }
Public Property ImportUnreferencedLineStyles As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDgnReadOptions Class
Rhino.FileIO Namespace