RhinoCommon API
RhinoDoc.LinkedInstanceDefinitionUpdate Property
 Controls if, when, and how linked and linked and embedded instance definitions are updated when the source archive that was used to create the instance definition has changed.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.29
Syntax
public LinkedInstanceDefinitionUpdateStyle LinkedInstanceDefinitionUpdate { get; set; }
Public Property LinkedInstanceDefinitionUpdate As LinkedInstanceDefinitionUpdateStyle
	Get
	Set
Property Value
Type: LinkedInstanceDefinitionUpdateStyle
See Also
Reference
RhinoDoc Class
Rhino Namespace