RhinoCommon API
PointCloudItem.Location Property
 Gets or sets the location of this point cloud item.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d Location { get; set; }
Public Property Location As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace