RhinoCommon API
MeshingParameters.RefineAngleInDegrees Property
 Gets or sets the mesh parameter refine angle in degrees.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double RefineAngleInDegrees { get; set; }
Public Property RefineAngleInDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace