RhinoCommon API
Brep.FilletSurfaceResults.OutBreps0 Property
 If the first input face was trimmed, the trimmed results are returned here
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IList<Brep> OutBreps0 { get; }
Public ReadOnly Property OutBreps0 As IList(Of Brep)
	Get
Property Value
Type: IList<Brep>
See Also
Reference
Brep.FilletSurfaceResults Class
Rhino.Geometry Namespace