RhinoCommon API
Brep.FilletSurfaceSettings.Extend Property
 If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Extend { get; }
Public ReadOnly Property Extend As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace