RhinoCommon API
GetTorus.FixInnerRadius Property
 Second radius option. The first radius chosen sets the inner dimension of the torus and the second radius is constrained to be outside of the first radius.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool FixInnerRadius { get; set; }
Public Property FixInnerRadius As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetTorus Class
Rhino.Input.Custom Namespace