RhinoCommon API
ViewCapture.DrawAxes Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.DrawAxes"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DrawAxes { get; set; }
Public Property DrawAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCapture Class
Rhino.Display Namespace