RhinoCommon API
ViewportInfo.DefaultCameraDirection Property
 Default z=up perspective camera direction
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Vector3d DefaultCameraDirection { get; }
Public Shared ReadOnly Property DefaultCameraDirection As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace