RhinoCommon API
FileObjWriteOptions.CullUnnecessaryVertexesInNgons Property
 Setting to determine whether interior collinear vertexes are part of the ngon.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool CullUnnecessaryVertexesInNgons { get; set; }
Public Property CullUnnecessaryVertexesInNgons As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
 Imagine a plane that has been split and then rejoined. If IncludeUnweldedEdgesInNgons is set to true then you would get an ngon with 6 vertexes, the corners and one on each edge that was split. Setting this to true would remove those 2 vertexes from the interior of the edge. TODO This is not hooked up yet, Dale hasn't made this available yet. See RH-30673.
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace