RhinoCommon API
ContentUuids.BlendTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.BlendTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid BlendTextureType { get; }
Public Shared ReadOnly Property BlendTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace