RhinoCommon API
FileWriteOptions.FileTypeIs3dm Property
 True if the file time is some version of a Rhino 3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool FileTypeIs3dm { get; }
Public ReadOnly Property FileTypeIs3dm As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace