RhinoCommon API
Quaternion.Scalar Property
 The real (scalar) part of the quaternion
This is A.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Scalar { get; }
Public ReadOnly Property Scalar As Double
	Get
Property Value
Type: Double
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace