RhinoCommon API
IOpenIDConnectToken.IsExpired Property
 true if the token is expired; false otherwise.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
bool IsExpired { get; }
ReadOnly Property IsExpired As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace