RhinoCommon API
ArcCurve.AngleDegrees Property
 Gets the angles of this arc in degrees.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double AngleDegrees { get; }
Public ReadOnly Property AngleDegrees As Double
	Get
Property Value
Type: Double
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace