RhinoCommon API
LinearWorkflow.Hash Property
 Linear workflow hash.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint Hash { get; }
Public ReadOnly Property Hash As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace