RhinoCommon API
Localization.RunningAsEnglish Property
[Missing <summary> documentation for "P:Rhino.UI.Localization.RunningAsEnglish"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool RunningAsEnglish { get; }
Public Shared ReadOnly Property RunningAsEnglish As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Localization Class
Rhino.UI Namespace