RhinoCommon API
HiddenLineDrawingObjectCurve.SourceObject Property
 Return the source object that this curve came from
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public HiddenLineDrawingObject SourceObject { get; }
Public ReadOnly Property SourceObject As HiddenLineDrawingObject
	Get
Property Value
Type: HiddenLineDrawingObject
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace