RhinoCommon API
SurfaceCurvature.MaximumRadius Property
 If a principal curvature value is zero or the principal curvatures have opposite signs, then the maximum radius of curvature is infinite RhinoMath.InfiniteRadius is returned. Otherwise the maximum radius of curvature is 1/min(fabs(kappa1),fabs(kappa2)).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double MaximumRadius { get; }
Public ReadOnly Property MaximumRadius As Double
	Get
Property Value
Type: Double
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace