RhinoCommon API
GetCurve.StartTangent Property
 Start tangent of an interpolated curve. Only used when UseStartTangent is true.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Vector3d StartTangent { get; set; }
Public Property StartTangent As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace