RhinoCommon API
PhysicallyBasedMaterial.ClearcoatRoughness Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.ClearcoatRoughness"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double ClearcoatRoughness { get; set; }
Public Property ClearcoatRoughness As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace