RhinoCommon API
AppearanceSettings.GridThinLineColor Property
 Gets or sets the color of the thin line of the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color GridThinLineColor { get; set; }
Public Shared Property GridThinLineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace