RhinoCommon API
RenderPlugIn.InitialChannelToDisplay Property
[Missing <summary> documentation for "P:Rhino.PlugIns.RenderPlugIn.InitialChannelToDisplay"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual Guid InitialChannelToDisplay { get; }
Protected Overridable ReadOnly Property InitialChannelToDisplay As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace