RhinoCommon API
AnimationProperties.CaptureType Property
 Gets or sets the capture type of the animation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public AnimationProperties.CaptureTypes CaptureType { get; set; }
Public Property CaptureType As AnimationProperties.CaptureTypes
	Get
	Set
Property Value
Type: AnimationProperties.CaptureTypes
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace