RhinoCommon API
ObjectEnumeratorSettings.HiddenObjects Property
 When true, hidden objects or objects on hidden layers are returned.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool HiddenObjects { get; set; }
Public Property HiddenObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace