RhinoCommon API
Analytics.UserId Property
 Returns a GUID that allows events to be aggregated by user. There is no way to determine who the end user is based on this GUID, unless the user tells you their ID. On Windows, this uses the registry to store the ID. On Mac, the Hardware UUID is used as the ID.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid UserId { get; }
Public Shared ReadOnly Property UserId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
Analytics Class
Rhino.Runtime Namespace