RhinoCommon API
IOpenIDConnectToken.Nonce Property
 String value used to associate a Client session with an ID Token, and to mitigate replay attacks
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
string Nonce { get; }
ReadOnly Property Nonce As String
	Get
Property Value
Type: String
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace