RhinoCommon API
Material.MeshInstanceId Property
 Get the material InstanceAncestry
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint MeshInstanceId { get; }
Public ReadOnly Property MeshInstanceId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
Material Class
Rhino.Render.ChangeQueue Namespace