RhinoCommon API
RenderContent.ProxyType Property
 Gets the proxy type of the render content
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ProxyTypes ProxyType { get; }
Public ReadOnly Property ProxyType As ProxyTypes
	Get
Property Value
Type: ProxyTypes
See Also
Reference
RenderContent Class
Rhino.Render Namespace