RhinoCommon API
FileWriteOptions.WriteSelectedObjectsOnly Property
 If true, this command should export only the objects currently selected in the Rhino model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool WriteSelectedObjectsOnly { get; set; }
Public Property WriteSelectedObjectsOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace