RhinoCommon API
ObjectAttributes.ObjectDecoration Property
 Used to indicate an object has a decoration (like an arrowhead on a curve)
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ObjectDecoration ObjectDecoration { get; set; }
Public Property ObjectDecoration As ObjectDecoration
	Get
	Set
Property Value
Type: ObjectDecoration
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace