RhinoCommon API
RhinoApp.CommandLineTextWriter.Encoding Property
 Returns Encoding Unicode.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override Encoding Encoding { get; }
Public Overrides ReadOnly Property Encoding As Encoding
	Get
Property Value
Type: Encoding
See Also
Reference
RhinoApp.CommandLineTextWriter Class
Rhino Namespace