RhinoCommon API
FileWriteOptions.SuppressAllInput Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.SuppressAllInput"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool SuppressAllInput { get; set; }
Public Property SuppressAllInput As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace