RhinoCommon API
ParticleSystem.BoundingBox Property
[Missing <summary> documentation for "P:Rhino.Geometry.ParticleSystem.BoundingBox"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace