RhinoCommon API
NamedViewWidgetObject.AssociatedNamedView Property
[Missing <summary> documentation for "P:Rhino.DocObjects.NamedViewWidgetObject.AssociatedNamedView"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public string AssociatedNamedView { get; }
Public ReadOnly Property AssociatedNamedView As String
	Get
Property Value
Type: String
See Also
Reference
NamedViewWidgetObject Class
Rhino.DocObjects Namespace