RhinoCommon API
GumballSettingsState.RotateViewAroundGumball Property
 Sets the view rotation center to the gumball origin.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool RotateViewAroundGumball { get; set; }
Public Property RotateViewAroundGumball As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace