RhinoCommon API
FileDwgWriteOptions.ExportPolylinesAs Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgWriteOptions.ExportPolylinesAs"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileDwgWriteOptions.ExportPolylineMode ExportPolylinesAs { get; set; }
Public Property ExportPolylinesAs As FileDwgWriteOptions.ExportPolylineMode
	Get
	Set
Property Value
Type: FileDwgWriteOptions.ExportPolylineMode
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace