RhinoCommon API
GumballSettings.AxisThickness Property
 Specifies the thickness of the axis arrows in pixels. Set axis thickness to zero to turn of move handles.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int AxisThickness { get; set; }
Public Shared Property AxisThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace