RhinoCommon API
AnimationProperties.TargetPoints Property
 Gets or sets points of the target path.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public Point3d[] TargetPoints { get; set; }
Public Property TargetPoints As Point3d()
	Get
	Set
Property Value
Type: Point3d[]
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace