RhinoCommon API
DimensionStyle.ZeroSuppress Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ZeroSuppress"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.ZeroSuppression ZeroSuppress { get; set; }
Public Property ZeroSuppress As DimensionStyle.ZeroSuppression
	Get
	Set
Property Value
Type: DimensionStyle.ZeroSuppression
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace