RhinoCommon API
LengthMassProperties.Centroid Property
 Gets the length centroid in the world coordinate system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public Point3d Centroid { get; }
Public ReadOnly Property Centroid As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace