RhinoCommon API
File3dmEmbeddedFile.CompressedLength Property
 The number of bytes this file occupies in the archive. Returns zero when the embedded file was not loaded from an archive (e.g. when it was loaded from a local file or buffer).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public ulong CompressedLength { get; }
Public ReadOnly Property CompressedLength As ULong
	Get
Property Value
Type: UInt64
See Also
Reference
File3dmEmbeddedFile Class
Rhino.FileIO Namespace