RhinoCommon API
NurbsCurveFitParameters.UniformityCoefficient Property
 When UniformityIntensity == NurbsCurveFitParameters.Intensity::Custom, this value is used as the uniformity parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double UniformityCoefficient { get; set; }
Public Property UniformityCoefficient As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace