RhinoCommon API
VisualAnalysisMode.RhinoDirectionAnalysisModeId Property
 Id for Rhino's built-in direction analysis mode.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Guid RhinoDirectionAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoDirectionAnalysisModeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace