RhinoCommon API
SubDFaceList.Count Property
 Gets the number of SubD faces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDFaceList Class
Rhino.Geometry.Collections Namespace