RhinoCommon API
LicenseLease.ProductId Property
 The ID of the product that this lease is issued to
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string ProductId { get; }
Public ReadOnly Property ProductId As String
	Get
Property Value
Type: String
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace