RhinoCommon API
FileVdaWriteOptions.SendingCompany Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVdaWriteOptions.SendingCompany"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string SendingCompany { get; set; }
Public Property SendingCompany As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileVdaWriteOptions Class
Rhino.FileIO Namespace