RhinoCommon API
ThumbData.TopLevel Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.TopLevel"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TopLevel { get; }
Public ReadOnly Property TopLevel As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace