RhinoCommon API
DimensionStyle.LeaderArrowBlockId Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderArrowBlockId"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid LeaderArrowBlockId { get; set; }
Public Property LeaderArrowBlockId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace