RhinoCommon API
QuadRemeshParameters.TargetQuadCount Property
 The number of quads to try to achieve in the final re-meshed object Note: This value is overridden if TargetEdgeLength > 0
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int TargetQuadCount { get; set; }
Public Property TargetQuadCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
QuadRemeshParameters Class
Rhino.Geometry Namespace