RhinoCommon API
DisplayPipelineAttributes.SubDNonManifoldEdgeColor Property
 Edge color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public Color SubDNonManifoldEdgeColor { get; set; }
Public Property SubDNonManifoldEdgeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace