RhinoCommon API
Sun.Light Property
 Get a Light which represents the sun. If manual control is in effect, no sun calculation is performed; the function uses the last known values of azimuth and altitude. If manual control is not in effect, the observer's position, date, time, time zone and daylight saving values are used to calculate the position of the sun.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Light Light { get; }
Public ReadOnly Property Light As Light
	Get
Property Value
Type: Light
See Also
Reference
Sun Class
Rhino.Render Namespace