RhinoCommon API
OpenGLSettingsState.AntialiasLevel Property
 AA level used in OpenGL viewports
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public AntialiasLevel AntialiasLevel { get; set; }
Public Property AntialiasLevel As AntialiasLevel
	Get
	Set
Property Value
Type: AntialiasLevel
See Also
Reference
OpenGLSettingsState Class
Rhino.ApplicationSettings Namespace