RhinoCommon API
RenderContentCollection.CppPointer Property
 Internal function to get native pointer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace