RhinoCommon API
ViewportInfo.CameraUp Property
 Gets the camera up vector.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d CameraUp { get; }
Public ReadOnly Property CameraUp As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace