RhinoCommon API
GetCylinder.BothSidesOption Property
 Determine if the "both sides" option is enabled
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool BothSidesOption { get; set; }
Public Property BothSidesOption As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace