RhinoCommon API
MeshPart.StartFaceIndex Property
Start of subinterval of parent mesh face array
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public int StartFaceIndex { get; }
Public ReadOnly Property StartFaceIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace