RhinoCommon API
OpenFileDialog.MultiSelect Property
 Gets or sets a value indicating whether the dialog box allows multiple files to be selected
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool MultiSelect { get; set; }
Public Property MultiSelect As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace