RhinoCommon API
DisplayPipelineAttributes.ShadowSoftEdgeQuality Property
 Soft edge quality, from 0 (none/faster) to 12 (softer/slower)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int ShadowSoftEdgeQuality { get; set; }
Public Property ShadowSoftEdgeQuality As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace