RhinoCommon API
DisplayPipelineAttributes.ShowLighting Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ShowLighting"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ShowLighting { get; set; }
Public Property ShowLighting As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace