RhinoCommon API
SubDComponentParameter.FaceCornerIndex Property
 Gets the index of the face corner the face parameters are measured in, or -1 if IsFaceParameter is false.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int FaceCornerIndex { get; }
Public ReadOnly Property FaceCornerIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace