RhinoCommon API
CurveKinkDefinition.KinkAtCurvatureChange Property
 Returns true if curvature discontinuities should be tested when finding kinks. The angle used vector curvature direction discontinuities is KinkAngleDegrees(). The ratio used for radius of curvature discontinuities is CurvatureKinkRadiusRatio().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool KinkAtCurvatureChange { get; set; }
Public Property KinkAtCurvatureChange As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CurveKinkDefinition Class
Rhino.Geometry Namespace