RhinoCommon API
DisplayPipelineAttributes.ShowMeshNakedEdges Property
 Display mesh naked edges on/off
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ShowMeshNakedEdges { get; set; }
Public Property ShowMeshNakedEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace