RhinoCommon API
SmartTrackSettingsState.SmartOrtho Property
Gets or sets a value indicating if the 'Smart Ortho' feature is active.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SmartOrtho { get; set; }
Public Property SmartOrtho As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace