RhinoCommon API
ModelAidSettingsState.AutoAlignCPlane Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettingsState.AutoAlignCPlane"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool AutoAlignCPlane { get; set; }
Public Property AutoAlignCPlane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace