RhinoCommon API
Notification.CancelButtonTitle Property
 The localized title of the Cancel button.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string CancelButtonTitle { get; set; }
Public Property CancelButtonTitle As String
	Get
	Set
Property Value
Type: String
Exceptions
Exception | Condition
InvalidOperationException | Thrown if the calling assembly cannot modify this instance
Remarks
Notifications can 1 to 3 buttons for user input. Each button can have a localized title. With the exception of the Cancel button, setting a button title to null (the default) will prevent that button from appearing in the interface. Note that in order for buttons other than the Cancel button to be displayed, you must set a ButtonClicked Action.
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace