RhinoCommon API
UserInterfaceGrid.RowCount Property
 Number of rows the current children occupy, computed from the child count, the column count and any column spans.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int RowCount { get; }
Public ReadOnly Property RowCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace