RhinoCommon API
LengthMassProperties.CentroidCoordinatesMomentsOfInertia Property
 Moments of inertia with respect to centroid coordinate system. X = integral of ((y-y0)^2 + (z-z0)^2) dm Y = integral of ((z-z0)^2 + (x-x0)^2) dm Z = integral of ((z-z0)^2 + (y-y0)^2) dm where (x0,y0,z0) = centroid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public Vector3d CentroidCoordinatesMomentsOfInertia { get; }
Public ReadOnly Property CentroidCoordinatesMomentsOfInertia As Vector3d
	Get
Property Value
Type: Vector3d
Remarks
 What is meant by "moments of inertia" varies widely in textbooks and papers. The values returned here are the integrals listed in the Summary section. Some applications may want the values from WorldCoordinatesSecondMoments instead of the values returned here.
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace