RhinoCommon API
PanelIds.Texture Property
 Rhino Texture panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public static Guid Texture { get; }
Public Shared ReadOnly Property Texture As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace