RhinoCommon API
ViewCaptureSettings.MatchLinetypePatternDefinition Property
 Default is true. Linetype scales are normally generated right before printing/view capture in order to get linetypes to print to the same lengths as defined. If false, the linetypes are not scaled and the current pattern lengths as seen on the screen as used.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public bool MatchLinetypePatternDefinition { get; set; }
Public Property MatchLinetypePatternDefinition As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace