RhinoCommon API
PlugIn.AddToHelpMenu Property
 Called by Rhino to determine if the plug-in name should be added to the Rhino Help/Plug-ins menu.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public virtual bool AddToHelpMenu { get; }
Public Overridable ReadOnly Property AddToHelpMenu As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace