RhinoCommon API
FileDwgReadOptions.ConvertRegionsToCurves Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgReadOptions.ConvertRegionsToCurves"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ConvertRegionsToCurves { get; set; }
Public Property ConvertRegionsToCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgReadOptions Class
Rhino.FileIO Namespace