RhinoCommon API
ProviderIds.ContentDatabase Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.ContentDatabase"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid ContentDatabase { get; }
Public Shared ReadOnly Property ContentDatabase As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace