RhinoCommon API
Extrusion.IsCappedAtBottom Property
 Gets a value indicating whether the surface that fills the bottom profile is existing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsCappedAtBottom { get; }
Public ReadOnly Property IsCappedAtBottom As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace