RhinoCommon API
RhinoDoc.Layers Property
 Layers in the document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public LayerTable Layers { get; }
Public ReadOnly Property Layers As LayerTable
	Get
Property Value
Type: LayerTable
See Also
Reference
RhinoDoc Class
Rhino Namespace