RhinoCommon API
SerializationOptions.MaxRhinoVersion Property
 Gets the most recent serialization version available.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.19
Syntax
public static int MaxRhinoVersion { get; }
Public Shared ReadOnly Property MaxRhinoVersion As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace