RhinoCommon API
PageViewGroupTable.ActiveCount Property
 Returns number of page view groups in the table, excluding deleted page view groups.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int ActiveCount { get; }
Public ReadOnly Property ActiveCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PageViewGroupTable Class
Rhino.DocObjects.Tables Namespace