RhinoCommon API
DisplayPipelineAttributes.UseSingleCurveColor Property
 Use a single color for drawing curves
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public bool UseSingleCurveColor { get; set; }
Public Property UseSingleCurveColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace