RhinoCommon API
Arc.EndAngleDegrees Property
 Gets or sets the end angle (in Degrees) for this arc segment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double EndAngleDegrees { get; set; }
Public Property EndAngleDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Arc Structure
Rhino.Geometry Namespace