RhinoCommon API
FileIgsWriteOptions.SurfaceType Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.SurfaceType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileIgsWriteOptions.SurfacesMode SurfaceType { get; set; }
Public Property SurfaceType As FileIgsWriteOptions.SurfacesMode
	Get
	Set
Property Value
Type: FileIgsWriteOptions.SurfacesMode
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace