RhinoCommon API
Triangle3d.BoundingBox Property
 Gets the bounding box of this triangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace