RhinoCommon API
SimpleArrayUint.UnsignedCount Property
 Gets the number of elements in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint UnsignedCount { get; }
Public ReadOnly Property UnsignedCount As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
SimpleArrayUint Class
Rhino.Runtime.InteropWrappers Namespace