RhinoCommon API
AnnotationBase.Font Property
 The base Font for the text of the annotation. The text string is rich text and therefore a different font that the base font can be associated with sub strings of the text
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Font Font { get; set; }
Public Property Font As Font
	Get
	Set
Property Value
Type: Font
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace