RhinoCommon API
FileObjReadOptions.UseObjGroupsAs Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileObjReadOptions.UseObjGroupsAs"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public FileObjReadOptions.UseObjGsAs UseObjGroupsAs { get; set; }
Public Property UseObjGroupsAs As FileObjReadOptions.UseObjGsAs
	Get
	Set
Property Value
Type: FileObjReadOptions.UseObjGsAs
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace