RhinoCommon API
GeneralSettingsState.MiddleMousePopupToolbar Property
 Gets or sets the toolbar to popup when the middle mouse is clicked on a view, this value is only used when MiddleMouseMode is set to PopupToolbar.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string MiddleMousePopupToolbar { get; set; }
Public Property MiddleMousePopupToolbar As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace