RhinoCommon API
FileWriteOptions.UpdateDocumentPath Property
 If a complete, current version, 3dm file is successfully saved, then the name of the file will be used to update the document's default file path and title and document will be marked as not modified.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public bool UpdateDocumentPath { get; set; }
Public Property UpdateDocumentPath As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace