RhinoCommon API
Field.Key Property
Note: This API is now obsolete.
 Field name value string passed to the constructor
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
[ObsoleteAttribute("The Rhino.Render.Fields.Field.Key property is obsolete, use Name instead.")]
public string Key { get; }
<ObsoleteAttribute("The Rhino.Render.Fields.Field.Key property is obsolete, use Name instead.")>
Public ReadOnly Property Key As String
	Get
Property Value
Type: String
See Also
Reference
Field Class
Rhino.Render.Fields Namespace