RhinoCommon API
GumballDisplayConduit.TotalTransform Property
 The total transformation is GumballTransform * PreTransform.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Transform TotalTransform { get; }
Public ReadOnly Property TotalTransform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace