RhinoCommon API
MeshCheckParameters.CheckForInvalidNgons Property
 If true, then look for ngons that have invalid information.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool CheckForInvalidNgons { get; set; }
Public Property CheckForInvalidNgons As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace