RhinoCommon API
FileLwoWriteOptions.WriteVersion6 Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileLwoWriteOptions.WriteVersion6"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool WriteVersion6 { get; set; }
Public Property WriteVersion6 As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileLwoWriteOptions Class
Rhino.FileIO Namespace