RhinoCommon API
PhysicallyBased.BaseColor Property
[Missing <summary> documentation for "P:Rhino.Render.ChildSlotNames.PhysicallyBased.BaseColor"]
 Namespace: Rhino.Render.ChildSlotNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string BaseColor { get; }
Public Shared ReadOnly Property BaseColor As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ChildSlotNames Namespace