RhinoCommon API
ObjectEnumeratorSettings.SpaceFilter Property
 The viewport filter property can be used to limit the iteration to objects that reside on specific space.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public ActiveSpace SpaceFilter { get; set; }
Public Property SpaceFilter As ActiveSpace
	Get
	Set
Property Value
Type: ActiveSpace
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace