RhinoCommon API
CustomRenderContentAttribute.IsElevated Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.IsElevated"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsElevated { get; set; }
Public Property IsElevated As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace