RhinoCommon API
ModelComponent.NameIsLocked Property
 Returns a value indicating whether the component Name is already locked.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool NameIsLocked { get; }
Public ReadOnly Property NameIsLocked As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace