RhinoCommon API
DisplayPipelineAttributes.SurfaceNakedEdgeThicknessScale Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeThicknessScale"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public float SurfaceNakedEdgeThicknessScale { get; set; }
Public Property SurfaceNakedEdgeThicknessScale As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace