RhinoCommon API
ViewSettings.RotateReverseKeyboard Property
 Gets or sets the rotation direction.
If true, then Rhino rotates the camera around the scene, otherwise, rotates the scene itself.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool RotateReverseKeyboard { get; set; }
Public Shared Property RotateReverseKeyboard As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace