RhinoCommon API
Vector2d.Unset Property
 Gets the value of the vector with components set as RhinoMath.UnsetValue,RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector2d Unset { get; }
Public Shared ReadOnly Property Unset As Vector2d
	Get
Property Value
Type: Vector2d
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace