RhinoCommon API
Vector3d.Length Property
 Computes the length (or magnitude, or size) of this vector. This is an application of Pythagoras' theorem. If this vector is invalid, its length is considered 0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace