RhinoCommon API
RhinoObjectAnalysisModeChangedEventArgs.AnalysisMode Property
 The visual analysis mode.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public VisualAnalysisMode AnalysisMode { get; }
Public ReadOnly Property AnalysisMode As VisualAnalysisMode
	Get
Property Value
Type: VisualAnalysisMode
See Also
Reference
RhinoObjectAnalysisModeChangedEventArgs Class
Rhino.DocObjects Namespace