RhinoCommon API
FileSettings.ClipboardCopyToPreviousRhinoVersion Property
 Gets or sets a value that decides if copies to the clipboard are performed in both the current and previous Rhino clipboard formats. This means you will double the size of what is saved in the clipboard but will be able to copy from the current to the previous version using the clipboard.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool ClipboardCopyToPreviousRhinoVersion { get; set; }
Public Shared Property ClipboardCopyToPreviousRhinoVersion As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace