RhinoCommon API
DisplayPipelineAttributes.WeightedPointStyle Property
 Style used to draw control points whose weight is not 1. Defaults to RoundControlPoint, matching the default control point style, so weighted control points are not called out until this is changed.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PointStyle WeightedPointStyle { get; set; }
Public Property WeightedPointStyle As PointStyle
	Get
	Set
Property Value
Type: PointStyle
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace