RhinoCommon API
PlugInInfo.PlugInLoadTime Property
 Returns the plug-in's load time.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PlugInLoadTime PlugInLoadTime { get; }
Public ReadOnly Property PlugInLoadTime As PlugInLoadTime
	Get
Property Value
Type: PlugInLoadTime
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace