RhinoCommon API
TransformObjectList.GripCount Property
 Number of elements in grip list
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int GripCount { get; }
Public ReadOnly Property GripCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace