RhinoCommon API
RhinoDoc.NotesLocked Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.NotesLocked"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public bool NotesLocked { get; set; }
Public Property NotesLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace