RhinoCommon API
GetObject.BottomObjectPreference Property
 By default, if a call to Input is permitted to select different parts of the same object, like a polysurface, a surface and an edge, then the top-most object is preferred. (polysurface beats face beats edge). If you want the bottom most object to be preferred, then call EnableBottomObjectPreference = true before calling GetObjects().
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool BottomObjectPreference { get; set; }
Public Property BottomObjectPreference As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace