RhinoCommon API
FileObjWriteOptions.SortObjGroups Property
 Setting to enable/disable sorting of OBJ groups
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SortObjGroups { get; set; }
Public Property SortObjGroups As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
 This is mainly for the sake of making an obj file more human readable, however, it is important that it happens when a user has opted to write Rhino groups as OBJ "g"s since it is not necessary for every object in Rhino to be part of a group.
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace