RhinoCommon API
NotificationButtonClickedArgs.Notification Property
 The notification whose button was clicked.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Notification Notification { get; }
Public ReadOnly Property Notification As Notification
	Get
Property Value
Type: Notification
See Also
Reference
NotificationButtonClickedArgs Class
Rhino.Runtime.Notifications Namespace