RhinoCommon API
CommonObject.UserDictionary Property
 Dictionary of custom information attached to this class. The dictionary is actually user data provided as an easy to use shareable set of information.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ArchivableDictionary UserDictionary { get; }
Public ReadOnly Property UserDictionary As ArchivableDictionary
	Get
Property Value
Type: ArchivableDictionary
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace