RhinoCommon API
DisplayPipeline.Viewport Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.Viewport"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace