RhinoCommon API
ContentUuids.RealtimeDisplayMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.RealtimeDisplayMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid RealtimeDisplayMaterialType { get; }
Public Shared ReadOnly Property RealtimeDisplayMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace