RhinoCommon API
RhinoObject.Geometry Property
 Gets the underlying geometry for this object.
All rhino objects are composed of geometry and attributes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual GeometryBase Geometry { get; }
Public Overridable ReadOnly Property Geometry As GeometryBase
	Get
Property Value
Type: GeometryBase
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace