RhinoCommon API
RhinoApp.IsLicenseValidated Property
 Returns true if the license is validated false otherwise
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public static bool IsLicenseValidated { get; }
Public Shared ReadOnly Property IsLicenseValidated As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace