RhinoCommon API
RhinoDoc.IsClosing Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.IsClosing"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsClosing { get; }
Public ReadOnly Property IsClosing As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace