RhinoCommon API
PythonScript.SearchPaths Property
 Get/Set additional search paths used by the python interpreter
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public static string[] SearchPaths { get; set; }
Public Shared Property SearchPaths As String()
	Get
	Set
Property Value
Type: String[]
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace