RhinoCommon API
ProviderIds.ContentEditorSettings Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.ContentEditorSettings"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid ContentEditorSettings { get; }
Public Shared ReadOnly Property ContentEditorSettings As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace