RhinoCommon API
DisplayBitmapDrawList.SortAngleTolerance Property
 Angle in radians used to determine if an index list is "parallel enough" to a viewports camera angle. Default is 0.0873 radians (5 degrees)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double SortAngleTolerance { get; set; }
Public Property SortAngleTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace