RhinoCommon API
FileIgsWriteOptions.CatiaTolsize Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.CatiaTolsize"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double CatiaTolsize { get; set; }
Public Property CatiaTolsize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace