RhinoCommon API
Triangle3d.Orthocenter Property
 Gets the triangle orthocenter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Point3d Orthocenter { get; }
Public ReadOnly Property Orthocenter As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace