RhinoCommon API
CurveSegment.SubDomain Property
 The sub-domain of the curve used by this boundary element.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Interval SubDomain { get; }
Public ReadOnly Property SubDomain As Interval
	Get
Property Value
Type: Interval
See Also
Reference
CurveSegment Structure
Rhino.Runtime.InteropWrappers Namespace