RhinoCommon API
FileSettings.AutoSaveFile Property
the file name used by Rhino's automatic file saving mechanism.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string AutoSaveFile { get; set; }
Public Shared Property AutoSaveFile As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace