RhinoCommon API
MeshCurvatureStats.Infinity Property
 Curvature values greater than or equal to this are considered infinite and not used to compute the average of "finite" values or the average deviation of "finite" values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Infinity { get; }
Public ReadOnly Property Infinity As Double
	Get
Property Value
Type: Double
See Also
Reference
MeshCurvatureStats Class
Rhino.Geometry Namespace