RhinoCommon API
PanelIds.ObjectProperties Property
 Rhino Object Properties panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid ObjectProperties { get; }
Public Shared ReadOnly Property ObjectProperties As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace