RhinoCommon API
Rectangle3d.Unset Property
 Gets a rectangle with Unset components.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Rectangle3d Unset { get; }
Public Shared ReadOnly Property Unset As Rectangle3d
	Get
Property Value
Type: Rectangle3d
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace