RhinoCommon API
LicenseStatus.PluginId Property
 The ID of the plug-in that owns this license information
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid PluginId { get; set; }
Public Property PluginId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace