RhinoCommon API
Texture.ApplyUvwTransform Property
 If true then the UVW transform is applied to the texture otherwise the UVW transform is ignored.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public bool ApplyUvwTransform { get; set; }
Public Property ApplyUvwTransform As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Texture Class
Rhino.DocObjects Namespace