RhinoCommon API
Circle.BoundingBox Property
 Gets the circle's 3d axis aligned bounding box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Return Value
Type: BoundingBox
3d bounding box.
See Also
Reference
Circle Structure
Rhino.Geometry Namespace