RhinoCommon API
CachedTextureCoordinates.MappingId Property
 The texture mapping Id.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public Guid MappingId { get; }
Public ReadOnly Property MappingId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace