RhinoCommon API
CullObjectEventArgs.RhinoObject Property
[Missing <summary> documentation for "P:Rhino.Display.CullObjectEventArgs.RhinoObject"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public RhinoObject RhinoObject { get; }
Public ReadOnly Property RhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
CullObjectEventArgs Class
Rhino.Display Namespace