RhinoCommon API
AppearanceSettings.UsePaintColors Property
Note: This API is now obsolete.
 Gets or sets a value indicating if logical paint colors should be used.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("custom colors are always used")]
public static bool UsePaintColors { get; }
<ObsoleteAttribute("custom colors are always used")>
Public Shared ReadOnly Property UsePaintColors As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace