RhinoCommon API
RenderPrimitive.BoundingBox Property
 The bounding box for this primitive.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace