RhinoCommon API
ContentUuids.WoodBumpTexture Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.WoodBumpTexture"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid WoodBumpTexture { get; }
Public Shared ReadOnly Property WoodBumpTexture As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace