RhinoCommon API
Linetype.InUse Property
 Returns true if the linetype is in use by a Rhino object, a layer, an instance definition, or a section style.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public bool InUse { get; }
Public ReadOnly Property InUse As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace