RhinoCommon API
MeshDisplacementInfo.InstanceTransform Property
 Instance transformation of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Transform InstanceTransform { get; set; }
Public Property InstanceTransform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace