RhinoCommon API
File3dmSettings.CurrentTextStyleId Property
The id of the current text style.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public Guid CurrentTextStyleId { get; set; }
Public Property CurrentTextStyleId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace