RhinoCommon API
RhinoDoc.ModelDistanceDisplayMode Property
Gets/Sets the distance display mode for model space.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public DistanceDisplayMode ModelDistanceDisplayMode { get; set; }
Public Property ModelDistanceDisplayMode As DistanceDisplayMode
	Get
	Set
Property Value
Type: DistanceDisplayMode
See Also
Reference
RhinoDoc Class
Rhino Namespace