RhinoCommon API
MatchSrfSettings.ReverseMatchDirection Property
 Reverse the direction of the edge to match.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public bool ReverseMatchDirection { get; set; }
Public Property ReverseMatchDirection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MatchSrfSettings Class
Rhino.Geometry Namespace