RhinoCommon API
RibbonOffsetParameters.RefitTolerance Property
 Refit the offset curve to a specified tolerance 0 for disabled
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public double RefitTolerance { get; set; }
Public Property RefitTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RibbonOffsetParameters Class
Rhino.Geometry Namespace