RhinoCommon API
UserInterfaceTextBox.Text Property
 What the box holds. Unlike the other controls, this is something the user changes, so reading it asks the box itself what is in it.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public override string Text { get; set; }
Public Overrides Property Text As String
	Get
	Set
Property Value
Type: String
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace