RhinoCommon API
GeneralSettings.MinimumUndoSteps Property
 Gets or sets the minimum undo steps.
Undo records will be purged if there are more than MinimumUndoSteps and they use more than MaximumUndoMemoryMb.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int MinimumUndoSteps { get; set; }
Public Shared Property MinimumUndoSteps As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace