RhinoCommon API
Brep.VariationalPatchSettings.CurvatureZeroTolerance Property
 Curvature value considered to be zero.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double CurvatureZeroTolerance { get; set; }
Public Property CurvatureZeroTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace