RhinoCommon API
OrdinateDimension.KinkPoint2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.OrdinateDimension.KinkPoint2"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point2d KinkPoint2 { get; }
Public ReadOnly Property KinkPoint2 As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace