RhinoCommon API
NamedColorList.Default Property
 Get the Rhino applications named color list.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static NamedColorList Default { get; }
Public Shared ReadOnly Property Default As NamedColorList
	Get
Property Value
Type: NamedColorList
See Also
Reference
NamedColorList Class
Rhino.UI Namespace