RhinoCommon API
ThumbData.Children Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.Children"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public List<ThumbData> Children { get; set; }
Public Property Children As List(Of ThumbData)
	Get
	Set
Property Value
Type: List<ThumbData>
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace