RhinoCommon API
Extrusion.IsCappedAtTop Property
 Gets a value indicating whether the surface that fills the top profile is existing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsCappedAtTop { get; }
Public ReadOnly Property IsCappedAtTop As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace