RhinoCommon API
ICurrentEnvironment_Get.ForLighting Property
 Get the RenderEnvironment used as custom skylighting environment. Null will be returned if the custom skylighting environment override is disabled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
RenderEnvironment ForLighting { get; }
ReadOnly Property ForLighting As RenderEnvironment
	Get
Property Value
Type: RenderEnvironment
See Also
Reference
ICurrentEnvironment_Get Interface
Rhino.Render Namespace