RhinoCommon API
RhinoApp.SdkServiceRelease Property
 Rhino SDK 9 digit SDK service release number in the form YYYYMMDDn Service release of the Rhino SDK supported by this executable. Rhino will only load plug-ins that require a service release of <= this release number. For example, SR1 will load all plug-ins made with any SDK released up through and including the SR1 SDK. But, SR1 will not load a plug-in built using the SR2 SDK. If an "old" Rhino tries to load a "new" plug-in, the user is told that they have to get a free Rhino.exe update in order for the plug-in to load. Rhino.exe updates are available from http://www.rhino3d.com.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int SdkServiceRelease { get; }
Public Shared ReadOnly Property SdkServiceRelease As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoApp Class
Rhino Namespace