RhinoCommon API
FileSettingsState.AutoSaveInterval Property
How often the document will be saved when Rhino's automatic file saving mechanism is enabled.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public TimeSpan AutoSaveInterval { get; set; }
Public Property AutoSaveInterval As TimeSpan
	Get
	Set
Property Value
Type: TimeSpan
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace