RhinoCommon API
FileIgsWriteOptions.DoublesUseE Property
Use "E" instead of the correct "D" for double scientific notation to get around IGES bug in FastShip.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool DoublesUseE { get; set; }
Public Property DoublesUseE As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace