RhinoCommon API
MeshCurvatureStats.AverageDeviation Property
 Get the average deviation of "finite" values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double AverageDeviation { get; }
Public ReadOnly Property AverageDeviation As Double
	Get
Property Value
Type: Double
See Also
Reference
MeshCurvatureStats Class
Rhino.Geometry Namespace