RhinoCommon API
RebuildCurveOptions.SmoothingPermitted Property
 True if the user interface is permitted to show the smoothing intensity option
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SmoothingPermitted { get; }
Public ReadOnly Property SmoothingPermitted As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace