RhinoCommon API
DocumentSaveEventArgs.ExportSelected Property
 true if only selected objects are being written to a file.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ExportSelected { get; }
Public ReadOnly Property ExportSelected As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DocumentSaveEventArgs Class
Rhino Namespace