RhinoCommon API
FileSkpReadOptions.UseGroupLayers Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSkpReadOptions.UseGroupLayers"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool UseGroupLayers { get; set; }
Public Property UseGroupLayers As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSkpReadOptions Class
Rhino.FileIO Namespace