RhinoCommon API
AppearanceSettingsState.ShowTitleBar Property
 Shows or hides title bar.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ShowTitleBar { get; set; }
Public Property ShowTitleBar As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace