RhinoCommon API
Symbols.DiameterSymbol Property
 Diameter symbol
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static char DiameterSymbol { get; }
Public Shared ReadOnly Property DiameterSymbol As Char
	Get
Property Value
Type: Char
See Also
Reference
Symbols Class
Rhino Namespace