RhinoCommon API
GumballSettingsState.ExtrudeBallSize Property
 Specifies the size of the extrude dots in pixels.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int ExtrudeBallSize { get; set; }
Public Property ExtrudeBallSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace