RhinoCommon API
GumballSettingsState.MenuBallSize Property
 Specifies the size of the menu dots in pixels.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int MenuBallSize { get; set; }
Public Property MenuBallSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace