RhinoCommon API
SectionStyle.BoundaryPlotWeightMillimeters Property
 Plot width of the boundary curves. values less than -1 (-10 is default): plot weight is determined by the object's attributes -1: do not plot 0: use default weight defined by the print dialog positive values are thicknesses in millimeters to print to NOTE: if a linetype is assigned to this section style that has a physical width (not pixels), then this value is ignored and the linetype value is used
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double BoundaryPlotWeightMillimeters { get; set; }
Public Property BoundaryPlotWeightMillimeters As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace