RhinoCommon API
RenderContentSerializer.ContentType Property
Note: This API is now obsolete.
 Kind of content created when importing or exporting this file type. Obsolete - use ContentKind
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
[ObsoleteAttribute("Use ContentKind")]
public RenderContentKind ContentType { get; }
<ObsoleteAttribute("Use ContentKind")>
Public ReadOnly Property ContentType As RenderContentKind
	Get
Property Value
Type: RenderContentKind
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace