RhinoCommon API
Dimension.SuppressExtension2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.SuppressExtension2"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SuppressExtension2 { get; set; }
Public Property SuppressExtension2 As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dimension Class
Rhino.Geometry Namespace