RhinoCommon API
Transform2d.IsTranslation Property
 True if this transform is a pure translation, that is the linear part is the 2x2 identity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsTranslation { get; }
Public ReadOnly Property IsTranslation As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace