RhinoCommon API
GetArc.UseActiveLayerLinetypeForCurves Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetArc.UseActiveLayerLinetypeForCurves"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool UseActiveLayerLinetypeForCurves { get; set; }
Public Property UseActiveLayerLinetypeForCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetArc Class
Rhino.Input.Custom Namespace