RhinoCommon API
CurvatureAnalysisSettings.MaxRadiusRange Property
 Gets or sets the Maximum Radius curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Interval MaxRadiusRange { get; set; }
Public Shared Property MaxRadiusRange As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace