RhinoCommon API
AppearanceSettings.DefaultObjectColor Property
 Gets or sets the default color for new objects.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color DefaultObjectColor { get; set; }
Public Shared Property DefaultObjectColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace