RhinoCommon API
ObjectPropertiesPageCollection.DocumentRuntimeSerialNumber Property
 Document associated with the Rhino properties panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public uint DocumentRuntimeSerialNumber { get; }
Public ReadOnly Property DocumentRuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
ObjectPropertiesPageCollection Class
Rhino.UI Namespace