RhinoCommon API
RenderMaterial.DefaultPreviewGeometryType Property
 Set or get the default geometry that appears in preview panes
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public RenderMaterial.PreviewGeometryType DefaultPreviewGeometryType { get; set; }
Public Property DefaultPreviewGeometryType As RenderMaterial.PreviewGeometryType
	Get
	Set
Property Value
Type: RenderMaterial.PreviewGeometryType
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace