RhinoCommon API
FileUsdWriteOptions.BlockHandling Property
 Including blocks inside the file will result in a larger file size and data duplication
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public USDExportBlockHandling BlockHandling { get; set; }
Public Property BlockHandling As USDExportBlockHandling
	Get
	Set
Property Value
Type: USDExportBlockHandling
See Also
Reference
FileUsdWriteOptions Class
Rhino.FileIO Namespace