RhinoCommon API
File3dmEdgeSoftening.ForceSoftening Property
 Specifies whether to soften edges despite too large a radius.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ForceSoftening { get; set; }
Public Property ForceSoftening As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmEdgeSoftening Class
Rhino.FileIO Namespace