RhinoCommon API
FileFbxReadOptions.ImportLights Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileFbxReadOptions.ImportLights"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportLights { get; set; }
Public Property ImportLights As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileFbxReadOptions Class
Rhino.FileIO Namespace