RhinoCommon API
RhinoDoc.Notes Property
Returns or sets the document's notes.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Notes { get; set; }
Public Property Notes As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RhinoDoc Class
Rhino Namespace