RhinoCommon API
SoftTransformSettingsState.Radius Property
 The radius of effect for soft transform. Other components on the object this distance and closer to selected components will be transformed.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SoftTransformSettingsState Class
Rhino.ApplicationSettings Namespace