RhinoCommon API
ViewCaptureSettings.DrawBackgroundBitmap Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawBackgroundBitmap"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public bool DrawBackgroundBitmap { get; set; }
Public Property DrawBackgroundBitmap As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace