RhinoCommon API
StackedDialogPage.ShowApplyButton Property
Called when this page is activated
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual bool ShowApplyButton { get; }
Public Overridable ReadOnly Property ShowApplyButton As Boolean
	Get
Return Value
Type: Boolean
 true : if the page wants the "Apply" button to appear. false : if the page does not want the "Apply" button to appear. Default returns false Note: If true is returned OnApply will get called when the button is clicked.
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace