RhinoCommon API
AnimationProperties.FolderName Property
 Gets or sets the location for the saved frames.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public string FolderName { get; set; }
Public Property FolderName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace