RhinoCommon API
Sun.Accuracy Property
Accuracy.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Sun.Accuracies Accuracy { get; set; }
Public Property Accuracy As Sun.Accuracies
	Get
	Set
Property Value
Type: Sun.Accuracies
See Also
Reference
Sun Class
Rhino.Render Namespace