RhinoCommon API
CurvatureAnalysisSettings.Style Property
 Gets or sets the curvature analysis style.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static CurvatureAnalysisSettings.CurvatureStyle Style { get; set; }
Public Shared Property Style As CurvatureAnalysisSettings.CurvatureStyle
	Get
	Set
Property Value
Type: CurvatureAnalysisSettings.CurvatureStyle
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace