RhinoCommon API
RadialDimension.LeaderArrowBlockId Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.LeaderArrowBlockId"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid LeaderArrowBlockId { get; set; }
Public Property LeaderArrowBlockId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace