RhinoCommon API
ModelAidSettingsState.HighlightControlPolygon Property
Gets or sets the enabled state of Rhino's highlight dialog modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool HighlightControlPolygon { get; set; }
Public Property HighlightControlPolygon As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace