RhinoCommon API
ThumbData.Parent Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.Parent"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ThumbData Parent { get; set; }
Public Property Parent As ThumbData
	Get
	Set
Property Value
Type: ThumbData
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace