RhinoCommon API
ViewSettings.RotateViewAroundAutogumball Property
 Gets or sets the 'Rotate view around auto gumball' value.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.19
Syntax
public static bool RotateViewAroundAutogumball { get; set; }
Public Shared Property RotateViewAroundAutogumball As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace