RhinoCommon API
FileObjWriteOptions.ExportObjectNames Property
 Setting to determine what object names in Rhino will become in the OBJ output file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public FileObjWriteOptions.ObjObjectNames ExportObjectNames { get; set; }
Public Property ExportObjectNames As FileObjWriteOptions.ObjObjectNames
	Get
	Set
Property Value
Type: FileObjWriteOptions.ObjObjectNames
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace