RhinoCommon API
ViewCaptureSettings.DefaultPrintWidthMillimeters Property
 Line thickness, in millimeters, used to print objects with no defined thickness.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public double DefaultPrintWidthMillimeters { get; set; }
Public Property DefaultPrintWidthMillimeters As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace