RhinoCommon API
PlugIn.SettingsDirectoryAllUsers Property
 Get the plug-in's "all users" settings directory. This directory will be located in the system's program data folder. Note, this does not verify the directory exists.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string SettingsDirectoryAllUsers { get; }
Public ReadOnly Property SettingsDirectoryAllUsers As String
	Get
Property Value
Type: String
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace