RhinoCommon API
MeshDisplacementInfo.Black Property
 Value considered lowest point in the displacement.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Black { get; set; }
Public Property Black As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace