RhinoCommon API
AssemblyResolver.CurrentDomainAssemblyResolve Property
 Standard resolver function used by Rhino in execution context. This is added to the Current AssemblyResolve.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public static ResolveEventHandler CurrentDomainAssemblyResolve { get; }
Public Shared ReadOnly Property CurrentDomainAssemblyResolve As ResolveEventHandler
	Get
Property Value
Type: ResolveEventHandler
See Also
Reference
AssemblyResolver Class
Rhino.Runtime Namespace