RhinoCommon API
DimensionStyle.SuppressExtension1 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.SuppressExtension1"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SuppressExtension1 { get; set; }
Public Property SuppressExtension1 As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace