RhinoCommon API
BoundingBox.Volume Property
 Gets the volume of this BoundingBox.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Volume { get; }
Public ReadOnly Property Volume As Double
	Get
Property Value
Type: Double
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace