RhinoCommon API
ICollapsibleSection.Height Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.Height"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
int Height { get; }
ReadOnly Property Height As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace