RhinoCommon API
LinearWorkflow.PostProcessGammaReciprocal Property
 Reciprocal of linear workflow post-process gamma value.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public float PostProcessGammaReciprocal { get; }
Public ReadOnly Property PostProcessGammaReciprocal As Single
	Get
Property Value
Type: Single
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace