RhinoCommon API
HostUtils.DeviceId Property
 The DeviceId is a unique, stable ID that anonymously identifies the device that Rhino is running on. It is computed based on hardware information that should not change when the OS is upgraded, or if commonly modified hardware are added or removed from the computer. The machine-specific information is hashed using a cryptographic hash to make it anonymous.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid DeviceId { get; }
Public Shared ReadOnly Property DeviceId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace