RhinoCommon API
IsoDrawEffect.Direction Property
[Missing <summary> documentation for "P:Rhino.Display.IsoDrawEffect.Direction"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Vector3d Direction { get; set; }
Public Property Direction As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace