RhinoCommon API
MeshThicknessMeasurement.VertexIndex Property
 Gets the index of the vertex associated with this thickness measurement.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int VertexIndex { get; }
Public ReadOnly Property VertexIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshThicknessMeasurement Structure
Rhino.Geometry Namespace