RhinoCommon API
RhinoDoc.WorksessionFileChangedEventArgs.WorksessionModelRuntimeSerialNumber Property
 Runtime serial number of the worksession reference model being attached or detached. Not persistent across sessions.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public uint WorksessionModelRuntimeSerialNumber { get; }
Public ReadOnly Property WorksessionModelRuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RhinoDoc.WorksessionFileChangedEventArgs Class
Rhino Namespace