RhinoCommon API
Brep.Surfaces Property
 Parametric surfaces used by faces
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public BrepSurfaceList Surfaces { get; }
Public ReadOnly Property Surfaces As BrepSurfaceList
	Get
Property Value
Type: BrepSurfaceList
See Also
Reference
Brep Class
Rhino.Geometry Namespace