RhinoCommon API
Brep.FilletSurfaceSettings.NonRational Property
 Create a non-rational approximation to the arc. This requires Degree to be set to 3, 4, or 5 and TanSlider and InnerSlider to a value between -0.95 and 0.95.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool NonRational { get; }
Public ReadOnly Property NonRational As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace