RhinoCommon API
RhinoList<T>.Last Property
 Gets or sets the last item in the list. This is synonymous to calling List[Count-1].
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public T Last { get; set; }
Public Property Last As T
	Get
	Set
Property Value
Type: T
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace