RhinoCommon API
HiddenLineDrawingSegment.Index Property
 Index of this curve in HiddenLineDrawing.Curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
HiddenLineDrawingSegment Class
Rhino.Geometry Namespace