RhinoCommon API
GumballSettingsState.MergeFacesAfterExtrude Property
 Merges faces after extruding.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool MergeFacesAfterExtrude { get; set; }
Public Property MergeFacesAfterExtrude As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace