RhinoCommon API
PhysicallyBasedMaterial.OpacityIOR Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.OpacityIOR"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double OpacityIOR { get; set; }
Public Property OpacityIOR As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace