RhinoCommon API
FileSettingsState.CreateBackupFiles Property
 Gets or sets a value indicating whether to create backup files.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool CreateBackupFiles { get; set; }
Public Property CreateBackupFiles As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace