RhinoCommon API
Extrusion.CapCount Property
 Gets the amount of capping surfaces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int CapCount { get; }
Public ReadOnly Property CapCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace