RhinoCommon API
RhinoViewport.UserStringCount Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.UserStringCount"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public int UserStringCount { get; }
Public ReadOnly Property UserStringCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace