RhinoCommon API
UserInterfaceSlider.Range Property
 The range of acceptable values for the slider
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Interval Range { get; set; }
Public Property Range As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
UserInterfaceSlider Class
Rhino.UI Namespace