RhinoCommon API
Layer.PlotWeight Property
 Gets or sets the weight of the plotting pen in millimeters. A weight of 0.0 indicates the "default" pen weight should be used. A weight of -1.0 indicates the layer should not be printed.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double PlotWeight { get; set; }
Public Property PlotWeight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Layer Class
Rhino.DocObjects Namespace