RhinoCommon API
DisplayAttributeMaterial.Luminosity Property
 Luminosity.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Luminosity { get; set; }
Public Property Luminosity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace