RhinoCommon API
Color4f.L Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.L"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public float L { get; }
Public ReadOnly Property L As Single
	Get
Property Value
Type: Single
See Also
Reference
Color4f Structure
Rhino.Display Namespace