RhinoCommon API
ChooseOneObjectSettings.ShowObjectName Property
ShowObjectName
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool ShowObjectName { get; set; }
Public Shared Property ShowObjectName As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace