RhinoCommon API
PanelIds.LightManager Property
 Rhino Lights panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid LightManager { get; }
Public Shared ReadOnly Property LightManager As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace