RhinoCommon API
PolylineCurve.PointCount Property
 Gets the number of points in this polyline.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int PointCount { get; }
Public ReadOnly Property PointCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace