RhinoCommon API
Particle.Size Property
[Missing <summary> documentation for "P:Rhino.Geometry.Particle.Size"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public float Size { get; set; }
Public Property Size As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
Particle Class
Rhino.Geometry Namespace