RhinoCommon API
File3dmMeshModifiers.ShutLining Property
 Returns an object that provides access to shut-lining information. If no shutlining information is present, the method returns null.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmShutLining ShutLining { get; }
Public ReadOnly Property ShutLining As File3dmShutLining
	Get
Property Value
Type: File3dmShutLining
See Also
Reference
File3dmMeshModifiers Class
Rhino.FileIO Namespace