RhinoCommon API
Brep.FilletSurfaceResults.Fillets Property
 The fillet surfaces created between the first and second face
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IList<Brep> Fillets { get; }
Public ReadOnly Property Fillets As IList(Of Brep)
	Get
Property Value
Type: IList<Brep>
See Also
Reference
Brep.FilletSurfaceResults Class
Rhino.Geometry Namespace