RhinoCommon API
ImageFileEventArgs.Event Property
[Missing <summary> documentation for "P:Rhino.Render.ImageFileEventArgs.Event"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public ImageFileEvent Event { get; }
Public ReadOnly Property Event As ImageFileEvent
	Get
Property Value
Type: ImageFileEvent
See Also
Reference
ImageFileEventArgs Class
Rhino.Render Namespace