RhinoCommon API
RotationGripUserInterfaceObject.GripPointVisible Property
 Is the grip point itself drawn
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool GripPointVisible { get; set; }
Public Property GripPointVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RotationGripUserInterfaceObject Class
Rhino.UI Namespace