RhinoCommon API
EndAnalysisSettings.OpenStarts Property
 Gets or sets whether to display the open curve start points.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool OpenStarts { get; set; }
Public Shared Property OpenStarts As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
EndAnalysisSettings Class
Rhino.ApplicationSettings Namespace