RhinoCommon API
Triangle3d.CA Property
 Gets the triangle edge connecting the C and A corners.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Line CA { get; }
Public ReadOnly Property CA As Line
	Get
Property Value
Type: Line
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace