RhinoCommon API
DirectionGripUserInterfaceObject.DirectionLineLength Property
 Length of direction line in pixel units
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public float DirectionLineLength { get; set; }
Public Property DirectionLineLength As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DirectionGripUserInterfaceObject Class
Rhino.UI Namespace