RhinoCommon API
Brep.HasRegionTopology Property
 Returns true if the Brep has region topology information, false otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.13
Syntax
public bool HasRegionTopology { get; }
Public ReadOnly Property HasRegionTopology As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Brep Class
Rhino.Geometry Namespace