RhinoCommon API
ContentUuids.SpeckleBumpTexture Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.SpeckleBumpTexture"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid SpeckleBumpTexture { get; }
Public Shared ReadOnly Property SpeckleBumpTexture As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace