RhinoCommon API
FileWriteOptions.IncludeRenderMeshes Property
 The file written should include the render meshes if your File Writing Plug-in supports it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IncludeRenderMeshes { get; set; }
Public Property IncludeRenderMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace