RhinoCommon API
ComponentStatus.Highlighted Property
 The highlight selection flag is checked.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ComponentStatus Highlighted { get; }
Public Shared ReadOnly Property Highlighted As ComponentStatus
	Get
Property Value
Type: ComponentStatus
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace