RhinoCommon API
GetEllipse.SecondPoint Property
 Returns the second point. If in "from foci" mode, then this is the second foci point.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Point3d SecondPoint { get; }
Public ReadOnly Property SecondPoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
GetEllipse Class
Rhino.Input.Custom Namespace