RhinoCommon API
HiddenLineDrawingParameters.IncludeHiddenCurves Property
 Include hidden curves in hidden line drawing (default is true)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IncludeHiddenCurves { get; set; }
Public Property IncludeHiddenCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace