RhinoCommon API
HostUtils.OperatingSystemBuildNumber Property
 Returns Operating System Build Number "11763" | "7601" | ... | "Unknown"
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public static string OperatingSystemBuildNumber { get; }
Public Shared ReadOnly Property OperatingSystemBuildNumber As String
	Get
Property Value
Type: String
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace