RhinoCommon API
File3dm.AllMaterials Property
 Materials in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public File3dmMaterialTable AllMaterials { get; }
Public ReadOnly Property AllMaterials As File3dmMaterialTable
	Get
Property Value
Type: File3dmMaterialTable
See Also
Reference
File3dm Class
Rhino.FileIO Namespace