RhinoCommon API
SubDComponent.ParentSubD Property
 SubD that this component belongs to
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubD ParentSubD { get; }
Public ReadOnly Property ParentSubD As SubD
	Get
Property Value
Type: SubD
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace