RhinoCommon API
SmartTrackSettingsState.SmartBasePoint Property
See Implied from. When a single Smart point is active, you will see the cursor tooltip with a distance.You can either type a distance or enter relative coordinates (e.g. @10,5) to place a point relative to the active smart point.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SmartBasePoint { get; set; }
Public Property SmartBasePoint As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace