RhinoCommon API
TaperSpaceMorph.IsValid Property
 Returns true if the space morph definition is valid, false otherwise.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
TaperSpaceMorph Class
Rhino.Geometry.Morphs Namespace