RhinoCommon API
ObjectPropertiesPage.LocalPageTitle Property
 Localized page description string, returns the EnglishPageTitle by default.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual string LocalPageTitle { get; }
Public Overridable ReadOnly Property LocalPageTitle As String
	Get
Property Value
Type: String
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace