RhinoCommon API
PlugInInfo.Version Property
 Returns the plug-in's version.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Version { get; }
Public ReadOnly Property Version As String
	Get
Property Value
Type: String
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace