RhinoCommon API
Vector2f.Zero Property
 Gets the value of the vector with components 0,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector2f Zero { get; }
Public Shared ReadOnly Property Zero As Vector2f
	Get
Property Value
Type: Vector2f
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace