RhinoCommon API
Box.Volume Property
 Gets the total volume of this box, or UnsetValue for an invalid box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Volume { get; }
Public ReadOnly Property Volume As Double
	Get
Property Value
Type: Double
See Also
Reference
Box Structure
Rhino.Geometry Namespace