RhinoCommon API
CachedTextureCoordinates.Dim Property
 Coordinate dimension: 2 = UV, 3 = UVW
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public int Dim { get; }
Public ReadOnly Property Dim As Integer
	Get
Property Value
Type: Int32
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace