RhinoCommon API
Material.IsPhysicallyBased Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.IsPhysicallyBased"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool IsPhysicallyBased { get; }
Public ReadOnly Property IsPhysicallyBased As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Material Class
Rhino.DocObjects Namespace