RhinoCommon API
FileIgsWriteOptions.RenderColorAsIgesColor Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.RenderColorAsIgesColor"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool RenderColorAsIgesColor { get; set; }
Public Property RenderColorAsIgesColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace