RhinoCommon API
Ellipse.Center Property
 Gets or sets the center of the ellipse.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.16
Syntax
public Point3d Center { get; set; }
Public Property Center As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace