RhinoCommon API
FileSkpWriteOptions.GroupObjects Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSkpWriteOptions.GroupObjects"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool GroupObjects { get; set; }
Public Property GroupObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSkpWriteOptions Class
Rhino.FileIO Namespace