RhinoCommon API
GrasshopperDisplayMaterial.Stippling Property
 Gets or sets whether an 8x8 Bayer stipple (dither) mask is applied. Default: false.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Stippling { get; set; }
Public Property Stippling As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GrasshopperDisplayMaterial Class
Rhino.Display Namespace