RhinoCommon API
RenderWindow.Channel.Width Property
 Return the channel width.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int Width { get; }
Public ReadOnly Property Width As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace