RhinoCommon API
FileObjWriteOptions.UseDisplayColorForMaterial Property
 Setting to display color as material when material index for object is -1.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool UseDisplayColorForMaterial { get; set; }
Public Property UseDisplayColorForMaterial As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace