RhinoCommon API
RhinoDoc.ModelSpaceTextScale Property
 The scale factor for text in model space when Annotation Scaling is enabled
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public double ModelSpaceTextScale { get; set; }
Public Property ModelSpaceTextScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RhinoDoc Class
Rhino Namespace