RhinoCommon API
PostEffect.LocalName Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffect.LocalName"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string LocalName { get; }
Public ReadOnly Property LocalName As String
	Get
Property Value
Type: String
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace