RhinoCommon API
PostEffectData.Type Property
 Returns the type of this post effect.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public PostEffectType Type { get; }
Public ReadOnly Property Type As PostEffectType
	Get
Property Value
Type: PostEffectType
See Also
Reference
PostEffectData Class
Rhino.Render.PostEffects Namespace