RhinoCommon API
SimpleArrayVector3d.Count Property
 Gets the amount of vectors in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SimpleArrayVector3d Class
Rhino.Runtime.InteropWrappers Namespace