RhinoCommon API
DimensionStyle.UseKerning Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.UseKerning"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UseKerning { get; set; }
Public Property UseKerning As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace