RhinoCommon API
File3dmRenderContent.Reference Property
True if the content is a reference content.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Reference { get; }
Public ReadOnly Property Reference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace