RhinoCommon API
MouseCallbackEventArgs.CtrlKeyDown Property
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.CtrlKeyDown"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool CtrlKeyDown { get; }
Public ReadOnly Property CtrlKeyDown As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace