RhinoCommon API
MostRecentCommandDescription.Macro Property
[Missing <summary> documentation for "P:Rhino.Commands.MostRecentCommandDescription.Macro"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Macro { get; set; }
Public Property Macro As String
	Get
	Set
Property Value
Type: String
See Also
Reference
MostRecentCommandDescription Class
Rhino.Commands Namespace