RhinoCommon API
RenderMaterial.PlasticMaterialGuid Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PlasticMaterialGuid"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid PlasticMaterialGuid { get; }
Public Shared ReadOnly Property PlasticMaterialGuid As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace