RhinoCommon API
SubDDisplayParameters.DisplayDensityIsAdaptive Property
 True if the SubD display density setting is adaptive and approximate display mesh quad count is capped at SubDDisplayParameters::AdaptiveDisplayMeshQuadMaximum.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public bool DisplayDensityIsAdaptive { get; }
Public ReadOnly Property DisplayDensityIsAdaptive As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace