RhinoCommon API
ComponentStatus.IsSelected Property
 Returns true if selected or selected persistent. False otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsSelected { get; }
Public ReadOnly Property IsSelected As Boolean
	Get
Return Value
Type: Boolean
The component status for selected.
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace