RhinoCommon API
ImageFileEventArgs.RenderEngineId Property
[Missing <summary> documentation for "P:Rhino.Render.ImageFileEventArgs.RenderEngineId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public Guid RenderEngineId { get; }
Public ReadOnly Property RenderEngineId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ImageFileEventArgs Class
Rhino.Render Namespace