RhinoCommon API
RhinoDoc.IsInitializing Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.IsInitializing"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsInitializing { get; }
Public ReadOnly Property IsInitializing As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace