RhinoCommon API
BrepRegionFaceSide.Region Property
 The region this side belongs to.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BrepRegion Region { get; }
Public ReadOnly Property Region As BrepRegion
	Get
Property Value
Type: BrepRegion
See Also
Reference
BrepRegionFaceSide Class
Rhino.Geometry Namespace