RhinoCommon API
DigitizerPlugIn.PointTolerance Property
 The point tolerance is the distance the digitizer must move (in digitizer coordinates) for a new point to be considered real rather than noise. Small desktop digitizer arms have values like 0.001 inches and 0.01 millimeters. This value should never be smaller than the accuracy of the digitizing device.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract double PointTolerance { get; }
Protected MustOverride ReadOnly Property PointTolerance As Double
	Get
Property Value
Type: Double
See Also
Reference
DigitizerPlugIn Class
Rhino.PlugIns Namespace