RhinoCommon API
ObjectAttributes.CastsShadows Property
 Gets or sets an object's casts shadows property, or whether or not an object casts shadows on other objects and a ground plane.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool CastsShadows { get; set; }
Public Property CastsShadows As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace