RhinoCommon API
GetCurve.Degree Property
 Degree of the resulting curve. Default is 3. Setting any value other than 3 clears SubDFriendly.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Degree { get; set; }
Public Property Degree As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace