RhinoCommon API
AnimationProperties.NorthAngle Property
 Gets or sets the world angle corresponding to North in degrees. This angle is zero along the x-axis and increases anticlockwise.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public double NorthAngle { get; set; }
Public Property NorthAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace