RhinoCommon API
ContentUuids.TextureAdjustmentTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.TextureAdjustmentTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid TextureAdjustmentTextureType { get; }
Public Shared ReadOnly Property TextureAdjustmentTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace