RhinoCommon API
DimensionStyle.LeaderTextRotationRadians Property
 Angle of leader text for Rotated style
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double LeaderTextRotationRadians { get; set; }
Public Property LeaderTextRotationRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace