RhinoCommon API
ConstructionPlane.ShowGrid Property
 Gets or sets whether the grid itself should be visible.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ShowGrid { get; set; }
Public Property ShowGrid As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace