RhinoCommon API
MeshDisplacementInfo.Mapping Property
 The texture mapping of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextureMapping Mapping { get; }
Public ReadOnly Property Mapping As TextureMapping
	Get
Property Value
Type: TextureMapping
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace