RhinoCommon API
CustomGripObject.Index Property
 The grip's index. CustomObjectGrips.AddGrip already assigns this the grip's position in the grips list, and Rhino passes it back as the gripIndex argument of NeighborGrip and as the key of the grip direction cache. Setting it to anything else makes those arguments disagree with CustomObjectGrips.Grip(int), which is indexed by list position.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Index { get; set; }
Public Property Index As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace