RhinoCommon API
MeshBooleanOptions.ProgressReporter Property
 Gets or sets the object that is responsible to keep track of calculation progression.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IProgress<double> ProgressReporter { get; set; }
Public Property ProgressReporter As IProgress(Of Double)
	Get
	Set
Property Value
Type: IProgress<Double>
See Also
Reference
MeshBooleanOptions Class
Rhino.Geometry Namespace