RhinoCommon API
Point3dList.Z Property
 Returns an indexer with all Z coordinates in this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3dList.ZAccess Z { get; }
Public ReadOnly Property Z As Point3dList.ZAccess
	Get
Property Value
Type: Point3dList.ZAccess
See Also
Reference
Point3dList Class
Rhino.Collections Namespace