RhinoCommon API
PhysicallyBasedMaterial.SubsurfaceScatteringColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.SubsurfaceScatteringColor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Color4f SubsurfaceScatteringColor { get; set; }
Public Property SubsurfaceScatteringColor As Color4f
	Get
	Set
Property Value
Type: Color4f
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace