RhinoCommon API
SubDCreationOptions.InteriorCreaseTest Property
 Get or sets the interior crease test option.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDCreationOptions.InteriorCreaseOption InteriorCreaseTest { get; set; }
Public Property InteriorCreaseTest As SubDCreationOptions.InteriorCreaseOption
	Get
	Set
Property Value
Type: SubDCreationOptions.InteriorCreaseOption
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace