RhinoCommon API
File3dmSettings.ModelDistanceDisplayMode Property
 Gets or sets the model space distance display mode (decimal, feet, or feet and inches).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public DistanceDisplayMode ModelDistanceDisplayMode { get; set; }
Public Property ModelDistanceDisplayMode As DistanceDisplayMode
	Get
	Set
Property Value
Type: DistanceDisplayMode
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace