RhinoCommon API
MeshInstance.ReceiveShadows Property
Note: This API is now obsolete.
 Return true if mesh instance should receive shadows
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use ObjectAttributes")]
public bool ReceiveShadows { get; }
<ObsoleteAttribute("Use ObjectAttributes")>
Public ReadOnly Property ReceiveShadows As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace