RhinoCommon API
RenderMaterial.SmellsLikeMetal Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeMetal"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SmellsLikeMetal { get; }
Public ReadOnly Property SmellsLikeMetal As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace