RhinoCommon API
HatchPattern.PatternUnitSystem Property
 Hatchpattern patterns are typically defined as distances on the printed output when printing. In this case PatternUnitSystem is UnitSystem.None (default). When set to any other unit system, the hatch pattern will be scaled acordingly.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UnitSystem PatternUnitSystem { get; set; }
Public Property PatternUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace