RhinoCommon API
Material.PhysicallyBased Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.PhysicallyBased"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PhysicallyBasedMaterial PhysicallyBased { get; }
Public ReadOnly Property PhysicallyBased As PhysicallyBasedMaterial
	Get
Property Value
Type: PhysicallyBasedMaterial
See Also
Reference
Material Class
Rhino.DocObjects Namespace