RhinoCommon API
DisplayPipelineAttributes.MeshNakedEdgeColor Property
 Sets the naked edge color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public Color MeshNakedEdgeColor { get; set; }
Public Property MeshNakedEdgeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace