RhinoCommon API
Point4d.Y Property
 Gets or sets the Y (second) coordinate of this point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Y { get; set; }
Public Property Y As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace