RhinoCommon API
DimStyleTableEventArgs.EventType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTableEventArgs.EventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimStyleTableEventType EventType { get; }
Public ReadOnly Property EventType As DimStyleTableEventType
	Get
Property Value
Type: DimStyleTableEventType
See Also
Reference
DimStyleTableEventArgs Class
Rhino.DocObjects.Tables Namespace