RhinoCommon API
RebuildCurveOptions.DeleteInputCurves Property
 True if input target curves should be deleted when possible.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool DeleteInputCurves { get; set; }
Public Property DeleteInputCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace