RhinoCommon API
TextEntity.TextVerticalAlignment Property
[Missing <summary> documentation for "P:Rhino.Geometry.TextEntity.TextVerticalAlignment"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextVerticalAlignment TextVerticalAlignment { get; set; }
Public Property TextVerticalAlignment As TextVerticalAlignment
	Get
	Set
Property Value
Type: TextVerticalAlignment
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace