RhinoCommon API
FileSlcWriteOptions.StartPoint Property
 Start of the slicing normal
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Point3d StartPoint { get; set; }
Public Property StartPoint As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
FileSlcWriteOptions Class
Rhino.FileIO Namespace