RhinoCommon API
Light.SpotLightShadowIntensity Property
Note: This API is now obsolete.
 Gets or sets the spot light shadow intensity.
(ignored for non-spot lights.)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use ShadowIntensity")]
public double SpotLightShadowIntensity { get; set; }
<ObsoleteAttribute("Use ShadowIntensity")>
Public Property SpotLightShadowIntensity As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Light Class
Rhino.Geometry Namespace