RhinoCommon API
RenderContentChangedEventArgs.OldContent Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentChangedEventArgs.OldContent"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderContent OldContent { get; }
Public ReadOnly Property OldContent As RenderContent
	Get
Property Value
Type: RenderContent
See Also
Reference
RenderContentChangedEventArgs Class
Rhino.Render Namespace