RhinoCommon API
ColorRGBA.B Property
 Gets or sets the blue channel value. Blue channels are limited to a 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double B { get; set; }
Public Property B As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace