RhinoCommon API
MeshingParameters.TextureRange Property
 Gets or sets how and if textures will be packed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public MeshingParameterTextureRange TextureRange { get; set; }
Public Property TextureRange As MeshingParameterTextureRange
	Get
	Set
Property Value
Type: MeshingParameterTextureRange
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace