RhinoCommon API
Material.IsReference Property
 Rhino allows multiple files to be viewed simultaneously. Materials in the document are "normal" or "reference". Reference materials are not saved.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override bool IsReference { get; }
Public Overrides ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Material Class
Rhino.DocObjects Namespace