RhinoCommon API
ShutLiningCurveInfo.Pull Property
 True if the curve should be pulled.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Pull { get; }
Public ReadOnly Property Pull As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace