RhinoCommon API
Plane.YAxis Property
 Gets or sets the Y axis vector of this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d YAxis { get; set; }
Public Property YAxis As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
Plane Structure
Rhino.Geometry Namespace