RhinoCommon API
LightManagerSupportClient.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.LightManagerSupportClient.CppPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace