RhinoCommon API
File3dm.ApplicationUrl Property
 Gets or sets a URL for the application that wrote this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string ApplicationUrl { get; set; }
Public Property ApplicationUrl As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dm Class
Rhino.FileIO Namespace