RhinoCommon API
Leader.LeaderHasLanding Property
 Returns true if the leader has a landing line
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool LeaderHasLanding { get; set; }
Public Property LeaderHasLanding As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Leader Class
Rhino.Geometry Namespace