RhinoCommon API
ViewInfo.Maximized Property
 Gets or sets whether the view window is maximized in the frame window. Together with the window position (see GetWindowPosition(Double, Double, Double, Double)) this is stored in the 3dm file and controls the viewport layout when the file is opened.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Maximized { get; set; }
Public Property Maximized As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace