RhinoCommon API
DisplayPipelineAttributes.SurfaceIsoThicknessVScale Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThicknessVScale"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public float SurfaceIsoThicknessVScale { get; set; }
Public Property SurfaceIsoThicknessVScale As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace