RhinoCommon API
StringParserSettings.ParseDivision Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseDivision"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseDivision { get; set; }
Public Property ParseDivision As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace