RhinoCommon API
VisualAnalysisMode.RhinoThicknessAnalysisModeId Property
 Id for Rhino's built-in thickness analysis mode.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid RhinoThicknessAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoThicknessAnalysisModeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace