RhinoCommon API
RhinoObject.Attributes Property
 Gets or sets the object attributes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual ObjectAttributes Attributes { get; set; }
Public Overridable Property Attributes As ObjectAttributes
	Get
	Set
Property Value
Type: ObjectAttributes
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace