RhinoCommon API
GetCone.ApexAngleDegrees Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCone.ApexAngleDegrees"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ApexAngleDegrees { get; set; }
Public Property ApexAngleDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace