RhinoCommon API
MeshVertexList.Count Property
 Gets or sets the number of mesh vertices.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; set; }
Public Property Count As Integer
	Get
	Set
Property Value
Type: Int32
Implements
IResizableList<T>.Count
ICollection<T>.Count
IReadOnlyCollection<T>.Count
ICollection.Count
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace