RhinoCommon API
File3dm.AllDimStyles Property
 Dimension Styles in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public File3dmDimStyleTable AllDimStyles { get; }
Public ReadOnly Property AllDimStyles As File3dmDimStyleTable
	Get
Property Value
Type: File3dmDimStyleTable
See Also
Reference
File3dm Class
Rhino.FileIO Namespace