RhinoCommon API
FileCsvWriteOptions.ObjectMaterial Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.ObjectMaterial"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ObjectMaterial { get; set; }
Public Property ObjectMaterial As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace