RhinoCommon API
EarthAnchorPoint.EarthBasepointElevationZero Property
 Gets or sets a value indicating the zero level convention relating to a location on Earth.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BasepointZero EarthBasepointElevationZero { get; set; }
Public Property EarthBasepointElevationZero As BasepointZero
	Get
	Set
Property Value
Type: BasepointZero
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace