RhinoCommon API
AnnotationBase.LineSpaceScale Property
 Scale applied to line spacing
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double LineSpaceScale { get; set; }
Public Property LineSpaceScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace