RhinoCommon API
GeometryBase.ObjectType Property
 Useful for switch statements that need to differentiate between basic object types like points, curves, surfaces, and so on.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ObjectType ObjectType { get; }
Public ReadOnly Property ObjectType As ObjectType
	Get
Property Value
Type: ObjectType
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace