RhinoCommon API
FileGltfWriteOptions.ExportTextureCoordinates Property
 Enable/disable the exporting of texture coordinates
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public bool ExportTextureCoordinates { get; set; }
Public Property ExportTextureCoordinates As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace