RhinoCommon API
LinetypeTable.ByParentLinetypeName Property
 Returns the text name of the by-parent linetype.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string ByParentLinetypeName { get; }
Public ReadOnly Property ByParentLinetypeName As String
	Get
Property Value
Type: String
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace