RhinoCommon API
TextureMapping.PrimitiveTransform Property
 For primitive based mappings, these transformations are used to map the world coordinate (x,y,z) point P and surface normal N before it is projected to the normalized mapping primitive. The surface normal transformation, m_Nxyz, is always calculated from m_Pxyz. It is a runtime setting that is not saved in 3dm files. If m_type is srfp_mapping, then m_Pxyz and m_Nxyz are ignored.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public Transform PrimitiveTransform { get; set; }
Public Property PrimitiveTransform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
TextureMapping Class
Rhino.Render Namespace