RhinoCommon API
Font.LogfontName Property
 Returns Windows LOGFONT Face name
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public string LogfontName { get; }
Public ReadOnly Property LogfontName As String
	Get
Property Value
Type: String
See Also
Reference
Font Class
Rhino.DocObjects Namespace