RhinoCommon API
MeshVertexNormalList.Capacity Property
 Gets or sets the amount of vertex normals that the list can hold without resizing.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Capacity { get; set; }
Public Property Capacity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace