RhinoCommon API
RenderContent.Category Property
 Category for this content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public string Category { get; }
Public ReadOnly Property Category As String
	Get
Property Value
Type: String
See Also
Reference
RenderContent Class
Rhino.Render Namespace