RhinoCommon API
CursorTooltipSettingsState.TooltipsEnabled Property
Turns on/off cursor tooltips.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TooltipsEnabled { get; set; }
Public Property TooltipsEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace