RhinoCommon API
DimensionStyle.ClippingArrowType1 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ClippingArrowType1"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public DimensionStyle.ClippingArrowType ClippingArrowType1 { get; set; }
Public Property ClippingArrowType1 As DimensionStyle.ClippingArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ClippingArrowType
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace