RhinoCommon API
RhinoDoc.IsCreating Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.IsCreating"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsCreating { get; }
Public ReadOnly Property IsCreating As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace