RhinoCommon API
HiddenLineDrawingPoint.Index Property
 Index of this object in HiddenLineDrawing.Points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
HiddenLineDrawingPoint Class
Rhino.Geometry Namespace