RhinoCommon API
MeshFace.IsQuad Property
 Gets a value indicating whether or not this mesh face is a quad. A mesh face is considered to be a triangle when C does not equal D, thus it is possible for an Invalid mesh face to also be a quad.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsQuad { get; }
Public ReadOnly Property IsQuad As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace