RhinoCommon API
RenderTexture.RenderHashWithoutLocalMapping Property
 Render hash for texture excluding local mapping.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint RenderHashWithoutLocalMapping { get; }
Public ReadOnly Property RenderHashWithoutLocalMapping As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RenderTexture Class
Rhino.Render Namespace