RhinoCommon API
CommandPromptChangedEventArgs.Options Property
Active command line options
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public CommandLineOption[] Options { get; }
Public ReadOnly Property Options As CommandLineOption()
	Get
Property Value
Type: CommandLineOption[]
See Also
Reference
CommandPromptChangedEventArgs Class
Rhino.UI Namespace