RhinoCommon API
AnnotationBase.TextIsWrapped Property
 Is text wrapping on
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TextIsWrapped { get; set; }
Public Property TextIsWrapped As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace