RhinoCommon API
SimpleArrayDouble.Count Property
 Gets the amount of elements in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SimpleArrayDouble Class
Rhino.Runtime.InteropWrappers Namespace