RhinoCommon API
PickContext.GetObjectUsed Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.PickContext.GetObjectUsed"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GetObject GetObjectUsed { get; }
Public ReadOnly Property GetObjectUsed As GetObject
	Get
Property Value
Type: GetObject
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace