RhinoCommon API
File3dmCurvePiping.Radius Property
 Specifies the radius of the pipe (minimum value 0.0001).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmCurvePiping Class
Rhino.FileIO Namespace