RhinoCommon API
BrepLoop.LoopIndex Property
 Gets the index of this loop in the Brep.Loops collection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int LoopIndex { get; }
Public ReadOnly Property LoopIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace