RhinoCommon API
MeshPoint.Mesh Property
 The mesh that is related to this point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Mesh Mesh { get; }
Public ReadOnly Property Mesh As Mesh
	Get
Property Value
Type: Mesh
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace