RhinoCommon API
FileSettings.FileLockingOpenWarning Property
Gets or sets whether to display the information dialog which identifies computer files.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool FileLockingOpenWarning { get; set; }
Public Shared Property FileLockingOpenWarning As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace