RhinoCommon API
PreviewRenderedEventArgs.PreviewJobSignature Property
 The Preview Job Signature associated with the rendered preview
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public PreviewJobSignature PreviewJobSignature { get; set; }
Public Property PreviewJobSignature As PreviewJobSignature
	Get
	Set
Property Value
Type: PreviewJobSignature
See Also
Reference
PreviewRenderedEventArgs Class
Rhino.Render Namespace