RhinoCommon API
GroundPlane.ShowUnderside Property
 True if ground plane underside should be shown.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public bool ShowUnderside { get; }
Public ReadOnly Property ShowUnderside As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace