RhinoCommon API
MeshPrincipalCurvatureList.Item Property
 Gets or sets the principal curvature at the given index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SurfaceCurvature this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As SurfaceCurvature
	Get
	Set
Parameters
index
Type: System.Int32
Return Value
Type: SurfaceCurvature
The principal curvature at [index].
Implements
IList<T>.Item[Int32]
IReadOnlyList<T>.Item[Int32]
See Also
Reference
MeshPrincipalCurvatureList Class
Rhino.Geometry.Collections Namespace