RhinoCommon API
PreviewSceneServer.CppPointer Property
 The CppPointer of PreviewSceneServer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
PreviewSceneServer Class
Rhino.Render Namespace