RhinoCommon API
ContentUuids.PerturbingTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.PerturbingTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid PerturbingTextureType { get; }
Public Shared ReadOnly Property PerturbingTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace