RhinoCommon API
FileExportPlugIn.ShouldDisplayOptionsDialog Property
[Missing <summary> documentation for "P:Rhino.PlugIns.FileExportPlugIn.ShouldDisplayOptionsDialog"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool ShouldDisplayOptionsDialog { get; }
Protected Overridable ReadOnly Property ShouldDisplayOptionsDialog As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
FileExportPlugIn Class
Rhino.PlugIns Namespace