RhinoCommon API
FileIgsWriteOptions.FlagDependentCurvesAs03 Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.FlagDependentCurvesAs03"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool FlagDependentCurvesAs03 { get; set; }
Public Property FlagDependentCurvesAs03 As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace