RhinoCommon API
PanelIds.GroundPlane Property
 Rhino Ground Plane panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid GroundPlane { get; }
Public Shared ReadOnly Property GroundPlane As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace