RhinoCommon API
ObjectPropertiesPageEventArgs.Page Property
 The page sending these arguments
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ObjectPropertiesPage Page { get; }
Public ReadOnly Property Page As ObjectPropertiesPage
	Get
Property Value
Type: ObjectPropertiesPage
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace