RhinoCommon API
NurbsCurveFitParameters.KinkAngleRadians Property
 The angle, in radians, used to determine if when an abrupt change in tangent or curvature vector direction is a kink.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double KinkAngleRadians { get; set; }
Public Property KinkAngleRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace