RhinoCommon API
RhinoDoc.ActiveCommandId Property
 Get the ID of the active command.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid ActiveCommandId { get; }
Public ReadOnly Property ActiveCommandId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoDoc Class
Rhino Namespace