RhinoCommon API
File3mfWriteOptions.Rating Property
[Missing <summary> documentation for "P:Rhino.FileIO.File3mfWriteOptions.Rating"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public string Rating { get; set; }
Public Property Rating As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3mfWriteOptions Class
Rhino.FileIO Namespace