RhinoCommon API
MatchSrfSettings.RefinePositionalTolerance Property
 Absolute distance tolerance for refinement
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public double RefinePositionalTolerance { get; }
Public ReadOnly Property RefinePositionalTolerance As Double
	Get
Property Value
Type: Double
See Also
Reference
MatchSrfSettings Class
Rhino.Geometry Namespace