RhinoCommon API
ComponentFunctionInfo.InputTypeNames Property
 The function input type names.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IReadOnlyList<string> InputTypeNames { get; }
Public ReadOnly Property InputTypeNames As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace