RhinoCommon API
FileEpsReadOptions.PreserveModelScale Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileEpsReadOptions.PreserveModelScale"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool PreserveModelScale { get; set; }
Public Property PreserveModelScale As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileEpsReadOptions Class
Rhino.FileIO Namespace