RhinoCommon API
IsoDrawEffect.Falloff Property
[Missing <summary> documentation for "P:Rhino.Display.IsoDrawEffect.Falloff"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Falloff { get; set; }
Public Property Falloff As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace