RhinoCommon API
LinearDimension.Arrowhead2End Property
 Gets the arrow head end of the second extension line.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point2d Arrowhead2End { get; }
Public ReadOnly Property Arrowhead2End As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace