RhinoCommon API
CustomObjectGrips.OwnerObject Property
Owner of the grips.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoObject OwnerObject { get; }
Public ReadOnly Property OwnerObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace