RhinoCommon API
File3dmSettings.PageUnits Property
 Gets or sets the page length units, using LengthUnit value.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public LengthUnit PageUnits { get; set; }
Public Property PageUnits As LengthUnit
	Get
	Set
Property Value
Type: LengthUnit
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace