RhinoCommon API
File3dm.NamedViews Property
 Named views in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IList<ViewInfo> NamedViews { get; }
Public ReadOnly Property NamedViews As IList(Of ViewInfo)
	Get
Property Value
Type: IList<ViewInfo>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace