RhinoCommon API
ObjectEnumeratorSettings.IdefObjects Property
 When true, objects in instance definitions (not the instance references) are returned.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IdefObjects { get; set; }
Public Property IdefObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace