RhinoCommon API
PostEffectUuids.Bloom Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.Bloom"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid Bloom { get; }
Public Shared ReadOnly Property Bloom As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace