RhinoCommon API
CurveKinkDefinition.CurvatureKinkRadiusRatio Property
 If the ratio (minimum radius of curvature)/(maximum radius of curvature) at a curvature discontinuity is < CurvatureKinkRadiusRatio, then that curvature discontinuity is treated as a kink. In particular, if CurvatureKinkRadiusRatio = 0, then curvature radius discontinuity checks are disabled.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double CurvatureKinkRadiusRatio { get; set; }
Public Property CurvatureKinkRadiusRatio As Double
	Get
	Set
Return Value
Type: Double
 The ratio used to test for curvature vector kinks.
See Also
Reference
CurveKinkDefinition Class
Rhino.Geometry Namespace