RhinoCommon API
EarthAnchorPoint.ModelEast Property
Earth directions in model coordinates.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d ModelEast { get; set; }
Public Property ModelEast As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace