RhinoCommon API
HistorySettings.RecordingEnabled Property
 When history recording is enabled, new objects keep a record of how they were constructed so that they can be updated if an input object changes.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool RecordingEnabled { get; set; }
Public Shared Property RecordingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
HistorySettings Class
Rhino.ApplicationSettings Namespace