RhinoCommon API
GetArc.DefaultRadius Property
 Default radius used for start and end radius
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double DefaultRadius { get; set; }
Public Property DefaultRadius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GetArc Class
Rhino.Input.Custom Namespace