RhinoCommon API
DimensionStyle.FixedExtensionLength Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.FixedExtensionLength"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double FixedExtensionLength { get; set; }
Public Property FixedExtensionLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace