RhinoCommon API
Point2d.X Property
 Gets or sets the X (first) coordinate of the point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace