RhinoCommon API
RTreeEventArgs.IdBPtr Property
 If search is using two r-trees, IdB is the element b pointer in the search.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IntPtr IdBPtr { get; }
Public ReadOnly Property IdBPtr As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace