RhinoCommon API
ChooseOneObjectSettingsState.XOffset Property
XOffset
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int XOffset { get; set; }
Public Property XOffset As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace