RhinoCommon API
Transform2d.Identity Property
 Gets a new identity transform matrix. An identity matrix defines no transformation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d Identity { get; }
Public Shared ReadOnly Property Identity As Transform2d
	Get
Property Value
Type: Transform2d
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace