RhinoCommon API
BinaryArchiveReader.ReadErrorOccured Property
 Gets or sets whether en error occurred during reading.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ReadErrorOccured { get; set; }
Public Property ReadErrorOccured As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace