RhinoCommon API
DisplayAttributeMaterial.OverrideObjectTransparency Property
 Objects acquire transparency from render materials.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool OverrideObjectTransparency { get; set; }
Public Property OverrideObjectTransparency As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace