RhinoCommon API
CurvatureGraphSettings.SrfVHair Property
 Gets or sets the surface V hairs are on;
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool SrfVHair { get; set; }
Public Shared Property SrfVHair As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CurvatureGraphSettings Class
Rhino.ApplicationSettings Namespace