RhinoCommon API
DisplayPipelineAttributes.FrontDiffuse Property
 Shades the current viewport with no smoothing so the individual render mesh faces are visible.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public Color FrontDiffuse { get; set; }
Public Property FrontDiffuse As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace