RhinoCommon API
MeshingParameters.FastRenderMesh Property
 Gets mesh creation parameters to create the a render mesh when meshing speed is preferred over mesh quality.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static MeshingParameters FastRenderMesh { get; }
Public Shared ReadOnly Property FastRenderMesh As MeshingParameters
	Get
Property Value
Type: MeshingParameters
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace