RhinoCommon API
Font.Style Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Style"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Font.FontStyle Style { get; }
Public ReadOnly Property Style As Font.FontStyle
	Get
Property Value
Type: Font.FontStyle
See Also
Reference
Font Class
Rhino.DocObjects Namespace