RhinoCommon API
FileStlWriteOptions.ExportOpenObjects Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileStlWriteOptions.ExportOpenObjects"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ExportOpenObjects { get; set; }
Public Property ExportOpenObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileStlWriteOptions Class
Rhino.FileIO Namespace