RhinoCommon API
FileReadOptions.WorkSessionReferenceModelSerialNumber Property
 If a worksession reference model is being read, then a value >= 1000 will be returned. Otherwise, this value will be 0;
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public uint WorkSessionReferenceModelSerialNumber { get; }
Public ReadOnly Property WorkSessionReferenceModelSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace