RhinoCommon API
FileObjReadOptions.DisplayColorFromObjMaterial Property
 Determines whether textures are read from the .mtl file, if it exists.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public bool DisplayColorFromObjMaterial { get; set; }
Public Property DisplayColorFromObjMaterial As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace