RhinoCommon API
SubDEdge.Sharpness Property
 Gets or sets the sharpness of this edge.
 The getter reports Crease for a crease edge; use GetSharpness(false) to get Smooth for creases instead.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDEdgeSharpness Sharpness { get; set; }
Public Property Sharpness As SubDEdgeSharpness
	Get
	Set
Property Value
Type: SubDEdgeSharpness
Remarks
 Setting this goes through the parent SubD so that the neighboring edges and vertices are updated too. Assign Smooth to make the edge smooth again.
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace