RhinoCommon API
NurbsCurveFitParameters.SmoothingCoefficient Property
 When SmoothingIntensity == NurbsCurveFitParameters.Intensity::Custom, this value is used as the smoothing parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double SmoothingCoefficient { get; set; }
Public Property SmoothingCoefficient As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace