RhinoCommon API
RhinoDoc.UndoActive Property
 Returns true if Undo is currently active.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool UndoActive { get; }
Public ReadOnly Property UndoActive As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace