RhinoCommon API
DecalCreateParams.TextureInstanceId Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.TextureInstanceId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid TextureInstanceId { get; set; }
Public Property TextureInstanceId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace