RhinoCommon API
AppearanceSettings.ShowOsnapBar Property
 Shows or hides the object snap user interface.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool ShowOsnapBar { get; set; }
Public Shared Property ShowOsnapBar As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace