RhinoCommon API
GumballObject.Frame Property
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballObject.Frame"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GumballFrame Frame { get; set; }
Public Property Frame As GumballFrame
	Get
	Set
Property Value
Type: GumballFrame
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace