RhinoCommon API
RhinoApp.IsRunningHeadless Property
Is Rhino currently being executed in headless mode
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public static bool IsRunningHeadless { get; }
Public Shared ReadOnly Property IsRunningHeadless As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace