RhinoCommon API
ComponentFunctionInfo.FullName Property
 Returns the name of the component prefixed by, if existing, the namespace.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string FullName { get; }
Public ReadOnly Property FullName As String
	Get
Property Value
Type: String
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace