RhinoCommon API
ModelAidSettingsState.GridSnap Property
Gets or sets the enabled state of Rhino's grid snap modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool GridSnap { get; set; }
Public Property GridSnap As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace