RhinoCommon API
RebuildCurveOptions.MaximumPointCountLimit Property
 The maximum value a user interface may specify as a point count value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int MaximumPointCountLimit { get; }
Public ReadOnly Property MaximumPointCountLimit As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace