RhinoCommon API
ModelAidSettings.EnableOsnapHighlight Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettings.EnableOsnapHighlight"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool EnableOsnapHighlight { get; set; }
Public Shared Property EnableOsnapHighlight As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace