RhinoCommon API
RhinoTransformObjectsEventArgs.TransformEventId Property
 The transformation event id.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public uint TransformEventId { get; }
Public ReadOnly Property TransformEventId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace