RhinoCommon API
MappingChannel.Mapping Property
 Return TexturMapping for this MappingChannel
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextureMapping Mapping { get; }
Public ReadOnly Property Mapping As TextureMapping
	Get
Property Value
Type: TextureMapping
See Also
Reference
MappingChannel Class
Rhino.Render.ChangeQueue Namespace