RhinoCommon API
Decal.Mapping Property
 Gets the decal's mapping.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public DecalMapping Mapping { get; set; }
Public Property Mapping As DecalMapping
	Get
	Set
Property Value
Type: DecalMapping
See Also
Reference
Decal Class
Rhino.Render Namespace