RhinoCommon API
FileUsdWriteOptions.ModelName Property
 A given model name will add a prim between the root prim and the start of the models data. Leaving this empty will not insert a Prim
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string ModelName { get; set; }
Public Property ModelName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileUsdWriteOptions Class
Rhino.FileIO Namespace