RhinoCommon API
Dimension.TextFit Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.TextFit"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.20
Syntax
public DimensionStyle.TextFit TextFit { get; set; }
Public Property TextFit As DimensionStyle.TextFit
	Get
	Set
Property Value
Type: DimensionStyle.TextFit
See Also
Reference
Dimension Class
Rhino.Geometry Namespace