RhinoCommon API
DisplayPipelineAttributes.ShowTangentSeams Property
Show tangent seams.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public bool ShowTangentSeams { get; set; }
Public Property ShowTangentSeams As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace