RhinoCommon API
FileEpsReadOptions.EpsScale Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileEpsReadOptions.EpsScale"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double EpsScale { get; set; }
Public Property EpsScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileEpsReadOptions Class
Rhino.FileIO Namespace