RhinoCommon API
SubDDisplayParameters.AdaptiveDisplayMeshQuadMaximum Property
 When the SubD display density is adaptive (default), AdaptiveMeshQuadMaximum specifies the approximate number of display mesh quads to permit before reducing the SubD display mesh density.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static uint AdaptiveDisplayMeshQuadMaximum { get; }
Public Shared ReadOnly Property AdaptiveDisplayMeshQuadMaximum As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace