RhinoCommon API
Linetype.UserStringCount Property
 Gets the amount of user strings.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public int UserStringCount { get; }
Public ReadOnly Property UserStringCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace