RhinoCommon API
DimensionStyle.Suffix Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.Suffix"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Suffix { get; set; }
Public Property Suffix As String
	Get
	Set
Property Value
Type: String
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace