RhinoCommon API
AnnotationBase.TextRotationRadians Property
 Rotation of text in radians
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double TextRotationRadians { get; set; }
Public Property TextRotationRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace