RhinoCommon API
Brep.Edges Property
 Gets the brep edges list accessor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BrepEdgeList Edges { get; }
Public ReadOnly Property Edges As BrepEdgeList
	Get
Property Value
Type: BrepEdgeList
See Also
Reference
Brep Class
Rhino.Geometry Namespace