RhinoCommon API
DisplayPipelineAttributes.FillMode Property
 Get or set the frame buffer fill mode.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DisplayPipelineAttributes.FrameBufferFillMode FillMode { get; set; }
Public Property FillMode As DisplayPipelineAttributes.FrameBufferFillMode
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.FrameBufferFillMode
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace