RhinoCommon API
UndoRedoEventArgs.UndoSerialNumber Property
 The undo record serial number.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public uint UndoSerialNumber { get; }
Public ReadOnly Property UndoSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace