RhinoCommon API
File3dm.AllHatchPatterns Property
 Hatch patterns in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public File3dmHatchPatternTable AllHatchPatterns { get; }
Public ReadOnly Property AllHatchPatterns As File3dmHatchPatternTable
	Get
Property Value
Type: File3dmHatchPatternTable
See Also
Reference
File3dm Class
Rhino.FileIO Namespace