RhinoCommon API
ViewCaptureSettings.ApplyDisplayModeThicknessScales Property
 Should curves and edges have their thicknesses scaled based the on the display mode settings for a view being captured (default is false)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public bool ApplyDisplayModeThicknessScales { get; set; }
Public Property ApplyDisplayModeThicknessScales As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace