RhinoCommon API
UserInterfaceGrid.BackgroundColor Property
 Color the grid fills its rectangle with. Color.Empty, the default, means draw no background at all.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color BackgroundColor { get; set; }
Public Property BackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace