RhinoCommon API
NurbsCurvePointList.Item Property
 Gets or sets the control point location at the given index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ControlPoint this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As ControlPoint
	Get
	Set
Parameters
index
Type: System.Int32
Index of control vertex to access.
Return Value
Type: ControlPoint
The control vertex at [index]
Implements
IList<T>.Item[Int32]
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace