RhinoCommon API
FileSwReadOptions.ImportConstructionGeometry Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSwReadOptions.ImportConstructionGeometry"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportConstructionGeometry { get; set; }
Public Property ImportConstructionGeometry As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSwReadOptions Class
Rhino.FileIO Namespace