RhinoCommon API
GumballSettingsState.PlaneSize Property
 Specifies the size of the plane indicators in pixels. Set plane size to zero to turn off the plane indicators.
Since: 9.0
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int PlaneSize { get; set; }
Public Property PlaneSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace