RhinoCommon API
Skylight.CustomEnvironment Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Render.Skylight.CustomEnvironment"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use RenderSettings methods")]
public Guid CustomEnvironment { get; set; }
<ObsoleteAttribute("Use RenderSettings methods")>
Public Property CustomEnvironment As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Skylight Class
Rhino.Render Namespace