RhinoCommon API
ViewCapture.DrawGridAxes Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.DrawGridAxes"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DrawGridAxes { get; set; }
Public Property DrawGridAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCapture Class
Rhino.Display Namespace