RhinoCommon API
Dimension.ForceTextPosition Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ForceTextPosition"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute]
public Dimension.ForceText ForceTextPosition { get; set; }
<ObsoleteAttribute>
Public Property ForceTextPosition As Dimension.ForceText
	Get
	Set
Property Value
Type: Dimension.ForceText
See Also
Reference
Dimension Class
Rhino.Geometry Namespace