RhinoCommon API
CursorTooltipSettingsState.PointPane Property
 Displays the current construction plane coordinates.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool PointPane { get; set; }
Public Property PointPane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace