RhinoCommon API
MeshCheckParameters.DisjointMeshCount Property
 Gets the total count of disjoint pieces for all meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int DisjointMeshCount { get; }
Public ReadOnly Property DisjointMeshCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace