RhinoCommon API
PlugIn.Settings Property
 Persistent plug-in settings.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PersistentSettings Settings { get; }
Public ReadOnly Property Settings As PersistentSettings
	Get
Property Value
Type: PersistentSettings
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace