RhinoCommon API
ViewportInfo.FrustumNear Property
 Gets the frustum near-cutting value.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double FrustumNear { get; }
Public ReadOnly Property FrustumNear As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace