RhinoCommon API
Interval.ZeroToOne Property
 Gets an Interval whose limits are 0.0 and 1.0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static Interval ZeroToOne { get; }
Public Shared ReadOnly Property ZeroToOne As Interval
	Get
Property Value
Type: Interval
See Also
Reference
Interval Structure
Rhino.Geometry Namespace