RhinoCommon API
AnimationProperties.StartDay Property
 Gets or sets the start day for seasonal/one day sun animation in the range 1 to 31.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public int StartDay { get; set; }
Public Property StartDay As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace