RhinoCommon API
ModelAidSettingsState.ControlPolygonDisplayDensity Property
Gets or sets the control polygon display density.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int ControlPolygonDisplayDensity { get; set; }
Public Property ControlPolygonDisplayDensity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace