RhinoCommon API
FileSettings.InstallFolder Property
Returns Rhino's installation folder.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static DirectoryInfo InstallFolder { get; }
Public Shared ReadOnly Property InstallFolder As DirectoryInfo
	Get
Property Value
Type: DirectoryInfo
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace