RhinoCommon API
Light.PowerLumens Property
 Gets or sets the light power in lumens (lm).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double PowerLumens { get; set; }
Public Property PowerLumens As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Light Class
Rhino.Geometry Namespace