RhinoCommon API
RenderMaterial.SmellsLikeTexturedPlaster Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeTexturedPlaster"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SmellsLikeTexturedPlaster { get; }
Public ReadOnly Property SmellsLikeTexturedPlaster As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace