RhinoCommon API
FileIgsWriteOptions.ClampCurveEndKnots Property
TRUE means all periodic NURBS will have their end knots clamped.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ClampCurveEndKnots { get; set; }
Public Property ClampCurveEndKnots As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace