RhinoCommon API
HatchLine.IsValid Property
 Verifies a hatch line is valid.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HatchLine Class
Rhino.DocObjects Namespace