RhinoCommon API
PageSettings.PageNumber Property
The page number of this layout.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public int PageNumber { get; set; }
Public Property PageNumber As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
PageSettings Class
Rhino.DocObjects Namespace