RhinoCommon API
MeshBooleanOptions.CancellationToken Property
 A token that allows to request the cancellation of the operation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public CancellationToken CancellationToken { get; set; }
Public Property CancellationToken As CancellationToken
	Get
	Set
Property Value
Type: CancellationToken
See Also
Reference
MeshBooleanOptions Class
Rhino.Geometry Namespace