RhinoCommon API
RhinoDoc.UserStringChangedArgs.Key Property
 Key for the string being changed
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
public string Key { get; }
Public ReadOnly Property Key As String
	Get
Property Value
Type: String
See Also
Reference
RhinoDoc.UserStringChangedArgs Class
Rhino Namespace