RhinoCommon API
BrepVertex.Tolerance Property
 Accuracy of vertex point, either >=0.0 or UnsetValue. A value of UnsetValue indicates that the tolerance should be computed. A value of 0.0 indicates that the distance from the vertex to any applicable edge or trim end is <= ZeroTolerance. If an edge begins or ends at this vertex, then the distance from the vertex's 3d point to the appropriate end of the edge's 3d curve must be <= this tolerance. If a trim begins or ends at this vertex, then the distance from the vertex's 3d point to the 3d point on the surface obtained by evaluating the surface at the appropriate end of the trimming curve must be <= this tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.26
Syntax
public double Tolerance { get; }
Public ReadOnly Property Tolerance As Double
	Get
Property Value
Type: Double
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace