RhinoCommon API
ToolbarFile.Path Property
 Gets the full path to the toolbar file.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Path { get; }
Public ReadOnly Property Path As String
	Get
Property Value
Type: String
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace