RhinoCommon API
FileVrmlWriteOptions.ExportVertexNormals Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVrmlWriteOptions.ExportVertexNormals"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ExportVertexNormals { get; set; }
Public Property ExportVertexNormals As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileVrmlWriteOptions Class
Rhino.FileIO Namespace