RhinoCommon API
RhinoDeselectAllObjectsEventArgs.ObjectCount Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoDeselectAllObjectsEventArgs.ObjectCount"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int ObjectCount { get; }
Public ReadOnly Property ObjectCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoDeselectAllObjectsEventArgs Class
Rhino.DocObjects Namespace