RhinoCommon API
AngularDimension.AngleZeroSuppression Property
[Missing <summary> documentation for "P:Rhino.Geometry.AngularDimension.AngleZeroSuppression"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.ZeroSuppression AngleZeroSuppression { get; set; }
Public Property AngleZeroSuppression As DimensionStyle.ZeroSuppression
	Get
	Set
Property Value
Type: DimensionStyle.ZeroSuppression
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace