RhinoCommon API
RhinoApp.SdkVersion Property
 Rhino SDK 9 digit SDK version number in the form YYYYMMDDn Rhino will only load plug-ins that were build with exactly the same version of the SDK.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int SdkVersion { get; }
Public Shared ReadOnly Property SdkVersion As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoApp Class
Rhino Namespace