RhinoCommon API
SubDFace.PerFaceColor Property
 If per-face color is "Empty", then this face does not have a custom color
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Color PerFaceColor { get; set; }
Public Property PerFaceColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace