RhinoCommon API
HatchPatternTableEventArgs.HatchPatternIndex Property
 Index of the hatchpattern.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public int HatchPatternIndex { get; }
Public ReadOnly Property HatchPatternIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
HatchPatternTableEventArgs Class
Rhino.DocObjects.Tables Namespace