RhinoCommon API
DisplayPoint.Location Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPoint.Location"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Point3d Location { get; }
Public ReadOnly Property Location As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
DisplayPoint Class
Rhino.Display Namespace