RhinoCommon API
MaterialTableEventArgs.OldSettings Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.MaterialTableEventArgs.OldSettings"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Material OldSettings { get; }
Public ReadOnly Property OldSettings As Material
	Get
Property Value
Type: Material
See Also
Reference
MaterialTableEventArgs Class
Rhino.DocObjects.Tables Namespace