RhinoCommon API
FileCsvDocument.Header Property
 The column names, or null if the document has no header. RowCount counts only the data rows; the header is not one of them.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string[] Header { get; }
Public ReadOnly Property Header As String()
	Get
Property Value
Type: String[]
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace