RhinoCommon API
FileStpReadOptions.MaxFaceCount Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileStpReadOptions.MaxFaceCount"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int MaxFaceCount { get; set; }
Public Property MaxFaceCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
FileStpReadOptions Class
Rhino.FileIO Namespace