RhinoCommon API
CurvatureGraphSettingsState.HairScale Property
 Gets or sets the hair scale.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int HairScale { get; set; }
Public Property HairScale As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
CurvatureGraphSettingsState Class
Rhino.ApplicationSettings Namespace