RhinoCommon API
ColorRGBA.Black Property
[Missing <summary> documentation for "P:Rhino.Display.ColorRGBA.Black"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static ColorRGBA Black { get; }
Public Shared ReadOnly Property Black As ColorRGBA
	Get
Property Value
Type: ColorRGBA
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace