RhinoCommon API
SubDDisplayParameters.MeshLocation Property
 The MeshLocation property determines if the mesh is on the SubD's control net or the SubD's surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public SubDComponentLocation MeshLocation { get; set; }
Public Property MeshLocation As SubDComponentLocation
	Get
	Set
Property Value
Type: SubDComponentLocation
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace