RhinoCommon API
GeneralSettings.NewObjectIsoparmCount Property
 Gets or sets the number of isoparm curves to show on new objects.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int NewObjectIsoparmCount { get; set; }
Public Shared Property NewObjectIsoparmCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace