RhinoCommon API
PhysicallyBased.Metallic Property
[Missing <summary> documentation for "P:Rhino.Render.ChildSlotNames.PhysicallyBased.Metallic"]
 Namespace: Rhino.Render.ChildSlotNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Metallic { get; }
Public Shared ReadOnly Property Metallic As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ChildSlotNames Namespace