RhinoCommon API
Transform2d.M02 Property
Gets or sets this[0,2], the X translation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double M02 { get; set; }
Public Property M02 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace