RhinoCommon API
Brep.VariationalPatchResult.Error Property
 Errors generated during patch generation. If no result is obtained, this error can give more information about what went wrong.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Error { get; }
Public ReadOnly Property Error As String
	Get
Property Value
Type: String
See Also
Reference
Brep.VariationalPatchResult Class
Rhino.Geometry Namespace