RhinoCommon API
DecalCreateParams.MaxV Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.MaxV"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double MaxV { get; set; }
Public Property MaxV As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace