RhinoCommon API
FileType.Extension Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileType.Extension"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Extension { get; }
Public ReadOnly Property Extension As String
	Get
Property Value
Type: String
See Also
Reference
FileType Class
Rhino.FileIO Namespace