RhinoCommon API
MeshClash.ClashPoint Property
 If valid, then the sphere centered at ClashPoint of ClashRadius distance intersects the clashing meshes.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d ClashPoint { get; }
Public ReadOnly Property ClashPoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace