RhinoCommon API
ChooseOneObjectSettings.ShowObjectType Property
ShowObjectType
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool ShowObjectType { get; set; }
Public Shared Property ShowObjectType As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace