RhinoCommon API
IndexPair.Item Property
 Gets or sets a particular index of this structure.
Remarks
Only 0 and 1 are valid indices.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Integer
	Get
	Set
Parameters
index
Type: System.Int32
Either 0 for I, or 1 for J.
Return Value
Type: Int32
The value at the index.
Implements
IList<T>.Item[Int32]
IReadOnlyList<T>.Item[Int32]
See Also
Reference
IndexPair Structure
Rhino Namespace