RhinoCommon API
File3dmWriteOptions.SaveAnalysisMeshes Property
Note: This API is now obsolete.
 Include analysis meshes in the file. Default is true
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
[ObsoleteAttribute("Specify analysis meshes for object types individually. Use EnableAnalysisMeshes()")]
public bool SaveAnalysisMeshes { get; set; }
<ObsoleteAttribute("Specify analysis meshes for object types individually. Use EnableAnalysisMeshes()")>
Public Property SaveAnalysisMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace