RhinoCommon API
GetLine.MidPointPrompt Property
Prompt when getting midpoint
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public string MidPointPrompt { get; set; }
Public Property MidPointPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace