RhinoCommon API
SurfaceCurvature.UVPoint Property
 Gets the u,v parameter where the surface curvature was evaluated.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point2d UVPoint { get; }
Public ReadOnly Property UVPoint As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace