RhinoCommon API
Brep.VariationalPatchSettings.UVRotation Property
 The rotation angle of the UV domain
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double UVRotation { get; set; }
Public Property UVRotation As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace