RhinoCommon API
RhinoPageView.Description Property
 Gets and sets a brief description of the page view.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace