RhinoCommon API
RhinoDoc.MarkupMode Property
 The markup mode this document is currently in: creating, viewing or editing a markup, or None when not in markup mode. MarkupViewChanged reports changes to this value.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public MarkupMode MarkupMode { get; }
Public ReadOnly Property MarkupMode As MarkupMode
	Get
Property Value
Type: MarkupMode
See Also
Reference
RhinoDoc Class
Rhino Namespace