RhinoCommon API
HiddenLineDrawingParameters.IncludeTangentEdges Property
 Include tangent edges in hidden line drawing (default is true)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IncludeTangentEdges { get; set; }
Public Property IncludeTangentEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace