RhinoCommon API
TwoColorRenderTexture.SuperSample Property
[Missing <summary> documentation for "P:Rhino.Render.TwoColorRenderTexture.SuperSample"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public bool SuperSample { get; set; }
Public Property SuperSample As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace