RhinoCommon API
RhinoViewport.CameraAngle Property
 Gets or sets the 1/2 of smallest subtended view angle.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double CameraAngle { get; set; }
Public Property CameraAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace