RhinoCommon API
AnimationProperties.Dates Property
 Gets or sets the dates that are calculated for seasonal/one day sun animations.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public string[] Dates { get; set; }
Public Property Dates As String()
	Get
	Set
Property Value
Type: String[]
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace