RhinoCommon API
Brep.VariationalPatchSettings.RocBending Property
 Rate-of-change in bending to apply (default 0.7)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double RocBending { get; set; }
Public Property RocBending As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace