RhinoCommon API
MeshingParameters.MinimumTolerance Property
 Gets or sets the minimum tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double MinimumTolerance { get; set; }
Public Property MinimumTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace