RhinoCommon API
DisplayPipeline.IsOpen Property
 Is true of the pipeline is open, false otherwise.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool IsOpen { get; }
Public ReadOnly Property IsOpen As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace