RhinoCommon API
RhinoDoc.WorksessionFileChangedEventArgs.ChangeKind Property
Whether the model was attached or detached.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RhinoDoc.WorksessionFileChangeKind ChangeKind { get; }
Public ReadOnly Property ChangeKind As RhinoDoc.WorksessionFileChangeKind
	Get
Property Value
Type: RhinoDoc.WorksessionFileChangeKind
See Also
Reference
RhinoDoc.WorksessionFileChangedEventArgs Class
Rhino Namespace