RhinoCommon API
DisplayModeChangedEventArgs.OldDisplayModeId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeChangedEventArgs.OldDisplayModeId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.18
Syntax
public Guid OldDisplayModeId { get; }
Public ReadOnly Property OldDisplayModeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayModeChangedEventArgs Class
Rhino.Display Namespace