RhinoCommon API
UserInterfaceSlider.Value Property
 Current value that the slider represents
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Value { get; set; }
Public Property Value As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
UserInterfaceSlider Class
Rhino.UI Namespace