RhinoCommon API
AngularDimension.DimlinePoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.AngularDimension.DimlinePoint"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point2d DimlinePoint { get; set; }
Public Property DimlinePoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace