RhinoCommon API
AnnotationBase.FirstCharFont Property
 Returns the font used by the first run of text in an annotation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public Font FirstCharFont { get; }
Public ReadOnly Property FirstCharFont As Font
	Get
Return Value
Type: Font
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace