RhinoCommon API
RenderSettings.Skylight Property
 If this object is associated with a document, this gets the document skylight. If this object is associated with a File3dm, this gets the File3dm's skylight. Otherwise it gets a 'free-floating' skylight object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Skylight Skylight { get; }
Public ReadOnly Property Skylight As Skylight
	Get
Property Value
Type: Skylight
See Also
Reference
RenderSettings Class
Rhino.Render Namespace