RhinoCommon API
DimensionStyle.LeaderTextRotationDegrees Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderTextRotationDegrees"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double LeaderTextRotationDegrees { get; set; }
Public Property LeaderTextRotationDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace