RhinoCommon API
LengthUnit.Name Property
Non localized lower case plural unit name.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
LengthUnit Structure
Rhino Namespace