RhinoCommon API
ContentFactory.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.DataSources.ContentFactory.CppPointer"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
ContentFactory Class
Rhino.Render.DataSources Namespace