RhinoCommon API
FileIgsWriteOptions.SplitBiPolarSurfaces Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.SplitBiPolarSurfaces"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SplitBiPolarSurfaces { get; set; }
Public Property SplitBiPolarSurfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace