RhinoCommon API
Quaternion.Identity Property
 Returns the (1,0,0,0) quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Quaternion Identity { get; }
Public Shared ReadOnly Property Identity As Quaternion
	Get
Property Value
Type: Quaternion
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace