RhinoCommon API
RhinoApp.VersionControlRevision Property
 McNeel version control revision identifier at the time this version of Rhino was built.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string VersionControlRevision { get; }
Public Shared ReadOnly Property VersionControlRevision As String
	Get
Property Value
Type: String
See Also
Reference
RhinoApp Class
Rhino Namespace