RhinoCommon API
DecalCreateParams.Origin Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.Origin"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point3d Origin { get; set; }
Public Property Origin As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace