RhinoCommon API
File3dmDisplacement.FinalMaxFacesOn Property
 Specifies whether to perform a mesh reduction as a post process to simplify the result of displacement.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool FinalMaxFacesOn { get; set; }
Public Property FinalMaxFacesOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace