RhinoCommon API
ViewCaptureSettings.DrawSelectedObjectsOnly Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawSelectedObjectsOnly"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DrawSelectedObjectsOnly { get; set; }
Public Property DrawSelectedObjectsOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace