RhinoCommon API
StringParserSettings.ParseDAsExponentInScientificENotation Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseDAsExponentInScientificENotation"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseDAsExponentInScientificENotation { get; set; }
Public Property ParseDAsExponentInScientificENotation As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace