RhinoCommon API
DisplayPipelineAttributes.SubDSmoothInteriorThicknessUsage Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SubDSmoothInteriorThicknessUsage"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public DisplayPipelineAttributes.SubDThicknessUse SubDSmoothInteriorThicknessUsage { get; set; }
Public Property SubDSmoothInteriorThicknessUsage As DisplayPipelineAttributes.SubDThicknessUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.SubDThicknessUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace