RhinoCommon API
RenderContent.DisplayName Property
 Display name for this content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public string DisplayName { get; }
Public ReadOnly Property DisplayName As String
	Get
Property Value
Type: String
See Also
Reference
RenderContent Class
Rhino.Render Namespace