RhinoCommon API
GumballAppearanceSettings.ColorZ Property
Default is Blue.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color ColorZ { get; set; }
Public Property ColorZ As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace