RhinoCommon API
DimensionStyle.IsDeleted Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.IsDeleted"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override bool IsDeleted { get; }
Public Overrides ReadOnly Property IsDeleted As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace