RhinoCommon API
Layer.Id Property
 Gets or sets the ID of this layer object. You typically do not need to assign a custom ID.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override Guid Id { get; set; }
Public Overrides Property Id As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Layer Class
Rhino.DocObjects Namespace