RhinoCommon API
FontQuartet.HasRegularFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.FontQuartet.HasRegularFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public bool HasRegularFont { get; }
Public ReadOnly Property HasRegularFont As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
FontQuartet Class
Rhino.DocObjects Namespace