RhinoCommon API
GpuDeviceInfo.Name Property
 Name of the device
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
GpuDeviceInfo Class
Rhino Namespace