RhinoCommon API
ViewSettings.ZoomScale Property
 Gets or sets the step size for zooming with a wheeled mouse or the Page Up and Page Down keys.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static double ZoomScale { get; set; }
Public Shared Property ZoomScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace