RhinoCommon API
HiddenLineDrawingObjectCurve.Parameters Property
 Increasing, partition of curve.Domain.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double[] Parameters { get; }
Public ReadOnly Property Parameters As Double()
	Get
Property Value
Type: Double[]
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace