RhinoCommon API
MeshingParameters.GridMinCount Property
 Gets or sets the minimum number of grid quads in the initial sampling grid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int GridMinCount { get; set; }
Public Property GridMinCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace