RhinoCommon API
ObjectEnumeratorSettings.ObjectTypeFilter Property
 The object type filter property can be used to limit the iteration to specific types of geometry. The default is to iterate all objects types.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ObjectType ObjectTypeFilter { get; set; }
Public Property ObjectTypeFilter As ObjectType
	Get
	Set
Property Value
Type: ObjectType
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace