RhinoCommon API
RhinoDoc.TextureMappingEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.TextureMappingEventArgs.Document"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoDoc.TextureMappingEventArgs Class
Rhino Namespace