RhinoCommon API
EventInfoArgs.EventInfoPtr Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.EventInfoArgs.EventInfoPtr"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IntPtr EventInfoPtr { get; }
Public ReadOnly Property EventInfoPtr As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
EventInfoArgs Class
Rhino.UI.Controls.DataSource Namespace