RhinoCommon API
SubDEdgeSharpness.IsIncreasing Property
 Gets true if EndSharpness(0) is less than EndSharpness(1).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool IsIncreasing { get; }
Public ReadOnly Property IsIncreasing As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace