RhinoCommon API
RenderContent.FirstChild Property
 Return First child of this content or null if none.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderContent FirstChild { get; }
Public ReadOnly Property FirstChild As RenderContent
	Get
Property Value
Type: RenderContent
See Also
Reference
RenderContent Class
Rhino.Render Namespace