RhinoCommon API
RhinoDoc.DateLastEdited Property
 Returns the date the document was created in Coordinated Universal Time (UTC). Use DateTime.ToLocalTime to convert to local time.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DateTime DateLastEdited { get; }
Public ReadOnly Property DateLastEdited As DateTime
	Get
Property Value
Type: DateTime
See Also
Reference
RhinoDoc Class
Rhino Namespace