RhinoCommon API
UserInterfaceGrid.ColumnSpacing Property
 Space between columns in logical pixels. The default is 6.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double ColumnSpacing { get; set; }
Public Property ColumnSpacing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace