RhinoCommon API
ClassArrayString.Count Property
 Gets the number of strings in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ClassArrayString Class
Rhino.Runtime.InteropWrappers Namespace