RhinoCommon API
ShrinkWrapParameters.FillHolesInInputObjects Property
 Any input meshes will have "Fill Holes" applied to them before volume creation This value is ignored when input objects are Point Clouds
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool FillHolesInInputObjects { get; set; }
Public Property FillHolesInInputObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ShrinkWrapParameters Class
Rhino.Geometry Namespace