RhinoCommon API
Material.RDKMaterialID Property
 Gets the RDK material ID.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public Guid RDKMaterialID { get; }
Public ReadOnly Property RDKMaterialID As Guid
	Get
Property Value
Type: Guid
Remarks
 Multiple Rhino materials ( with unique component IDs) can have the same RDK material ID.
See Also
Reference
Material Class
Rhino.DocObjects Namespace