RhinoCommon API
ClippingPlane.Id Property
 Get Guid for this clipping plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ClippingPlane Class
Rhino.Render.ChangeQueue Namespace