RhinoCommon API
FileXamlWriteOptions.UseExistingRenderMeshes Property
 If render meshes exist they will be used. Otherwise they are created on the fly using the current render settings of the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool UseExistingRenderMeshes { get; set; }
Public Property UseExistingRenderMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileXamlWriteOptions Class
Rhino.FileIO Namespace