RhinoCommon API
FileSettings.ClipboardOnExit Property
 Gets or sets a value that determines what to do with clipboard data on exit.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static ClipboardState ClipboardOnExit { get; set; }
Public Shared Property ClipboardOnExit As ClipboardState
	Get
	Set
Property Value
Type: ClipboardState
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace