RhinoCommon API
DisplayModeDescription.MonochromeId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.MonochromeId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public static Guid MonochromeId { get; }
Public Shared ReadOnly Property MonochromeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace