RhinoCommon API
CustomPostEffectAttribute.Name Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.CustomPostEffectAttribute.Name"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
CustomPostEffectAttribute Class
Rhino.Render.PostEffects Namespace