RhinoCommon API
CorruptGeometryException.CommonObject Property
 Corrupt geometry .NET class
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public CommonObject CommonObject { get; }
Public ReadOnly Property CommonObject As CommonObject
	Get
Property Value
Type: CommonObject
See Also
Reference
CorruptGeometryException Class
Rhino.Runtime Namespace