RhinoCommon API
CustomRenderMeshProviderAttribute.NonObjectIdsOnly Property
 If set to true, this will quickly return false for HasCustomRenderMeshes if the objectId is in the document.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public bool NonObjectIdsOnly { get; set; }
Public Property NonObjectIdsOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CustomRenderMeshProviderAttribute Class
Rhino.Render.CustomRenderMeshes Namespace