RhinoCommon API
AppearanceSettingsState.CrosshairScreenLength Property
Gets or sets a value that determines the length, in pixels, of the cross hairs if they are visible.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double CrosshairScreenLength { get; set; }
Public Property CrosshairScreenLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace