RhinoCommon API
Worksession.FileName Property
 Returns the path to the open worksession, or .rws, file. If there is no worksession file open, or the active worksession has not yet been saved, then null is returned.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string FileName { get; }
Public ReadOnly Property FileName As String
	Get
Property Value
Type: String
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace