RhinoCommon API
NurbsCurveFitParameters.SubDFriendly Property
 Gets or sets the SubDFriendly property. When true, the resulting curve will be more likely to have good subdivision surface properties, such as fewer kinks and more even parameterization. This is accomplished by using a more aggressive kink splitting strategy and by using the SmoothingCoefficient to bias the fit towards smoother curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SubDFriendly { get; set; }
Public Property SubDFriendly As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace