RhinoCommon API
MeshSplitOptions.TextLog Property
 Gets or sets a text log to write computed operations into.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public TextLog TextLog { get; set; }
Public Property TextLog As TextLog
	Get
	Set
Property Value
Type: TextLog
See Also
Reference
MeshSplitOptions Class
Rhino.Geometry Namespace