RhinoCommon API
ICollapsibleSection.SettingsTag Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.SettingsTag"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
string SettingsTag { get; }
ReadOnly Property SettingsTag As String
	Get
Property Value
Type: String
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace