RhinoCommon API
Mesh.SingleMapping Property
Note: This API is now obsolete.
 Get texture mapping info as single mapping
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute]
public MappingChannel SingleMapping { get; }
<ObsoleteAttribute>
Public ReadOnly Property SingleMapping As MappingChannel
	Get
Property Value
Type: MappingChannel
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace