RhinoCommon API
DisplayPipelineAttributes.LinearWorkflowUsage Property
 Turn on or off custom linear workflow settings
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public DisplayPipelineAttributes.LinearWorkflowUsages LinearWorkflowUsage { get; set; }
Public Property LinearWorkflowUsage As DisplayPipelineAttributes.LinearWorkflowUsages
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.LinearWorkflowUsages
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace