RhinoCommon API
MarkupTable.ActiveCount Property
 Returns number of markups in the table, excluding deleted markups.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int ActiveCount { get; }
Public ReadOnly Property ActiveCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MarkupTable Class
Rhino.DocObjects.Tables Namespace