RhinoCommon API
DisplayPipelineAttributes.SurfaceIsoThicknessWScale Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThicknessWScale"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public float SurfaceIsoThicknessWScale { get; set; }
Public Property SurfaceIsoThicknessWScale As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace