RhinoCommon API
MouseState.Location Property
 Where the mouse is, in logical pixels of the surface this event came from. This is the coordinate system on screen controls are laid out in, so it is the one to hit test against.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PointF Location { get; }
Public ReadOnly Property Location As PointF
	Get
Property Value
Type: PointF
See Also
Reference
MouseState Class
Rhino.UI Namespace