RhinoCommon API
CollapsibleSectionViewModel.CppPointer Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.CollapsibleSectionViewModel.CppPointer"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Implements
IHasCppImplementation.CppPointer
See Also
Reference
CollapsibleSectionViewModel Class
Rhino.UI.Controls Namespace