RhinoCommon API
AnnotationBase.FormatWidth Property
 Text format width (Wrapping rectangle)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double FormatWidth { get; set; }
Public Property FormatWidth As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace