RhinoCommon API
GetColorEventArgs.IncludeButtonColors Property
[Missing <summary> documentation for "P:Rhino.UI.GetColorEventArgs.IncludeButtonColors"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IncludeButtonColors { get; }
Public ReadOnly Property IncludeButtonColors As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetColorEventArgs Class
Rhino.UI Namespace