RhinoCommon API
ComponentFunctionInfo.Description Property
 The function description.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace