RhinoCommon API
CursorTooltipSettingsState.AutoSuppress Property
 Attempts to display only the most useful tooltip.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool AutoSuppress { get; set; }
Public Property AutoSuppress As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace