RhinoCommon API
RhinoViewport.ConstructionGridVisible Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.ConstructionGridVisible"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ConstructionGridVisible { get; set; }
Public Property ConstructionGridVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace