RhinoCommon API
Sun.DaylightSavingMinutes Property
Daylight saving time in minutes
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int DaylightSavingMinutes { get; set; }
Public Property DaylightSavingMinutes As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Sun Class
Rhino.Render Namespace