RhinoCommon API
File3dsReadOptions.UnweldAngle Property
[Missing <summary> documentation for "P:Rhino.FileIO.File3dsReadOptions.UnweldAngle"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double UnweldAngle { get; set; }
Public Property UnweldAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dsReadOptions Class
Rhino.FileIO Namespace