RhinoCommon API
SubDEdgeSharpness.Smooth Property
 A sharpness of 0.0 at both ends, which is what a smooth edge has. This is also the default value of a SubDEdgeSharpness.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static SubDEdgeSharpness Smooth { get; }
Public Shared ReadOnly Property Smooth As SubDEdgeSharpness
	Get
Property Value
Type: SubDEdgeSharpness
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace