RhinoCommon API
Brep.VariationalPatchSettings.InternalTolerance Property
 Tolerance for positional (G0int) constraints on internal curves
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double InternalTolerance { get; set; }
Public Property InternalTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace