RhinoCommon API
RhinoApp.CommandHistoryWindowText Property
 Text in Rhino's command history window.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string CommandHistoryWindowText { get; }
Public Shared ReadOnly Property CommandHistoryWindowText As String
	Get
Property Value
Type: String
See Also
Reference
RhinoApp Class
Rhino Namespace