RhinoCommon API
UnitsChangedWithScalingEventArgs.Document Property
 Gets the document for this event. This field might be null.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.20
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
UnitsChangedWithScalingEventArgs Class
Rhino Namespace