RhinoCommon API
RealtimeDisplayModeClassInfo.GUID Property
 Get the RealtimeDisplayMode implementation GUID
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract Guid GUID { get; }
Public MustOverride ReadOnly Property GUID As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace