RhinoCommon API
CommandAlias.Alias Property
 String that represents an alias
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Alias { get; set; }
Public Property Alias As String
	Get
	Set
Property Value
Type: String
See Also
Reference
CommandAlias Class
Rhino.ApplicationSettings Namespace