RhinoCommon API
CurvatureGraphSettings.CurveHairColor Property
 Gets or sets the curve hair color;
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Color CurveHairColor { get; set; }
Public Shared Property CurveHairColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
CurvatureGraphSettings Class
Rhino.ApplicationSettings Namespace