RhinoCommon API
RenderContent.TypeId Property
 Type identifier for this content
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid TypeId { get; }
Public ReadOnly Property TypeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderContent Class
Rhino.Render Namespace