RhinoCommon API
AppearanceSettingsState.EchoCommandsToHistoryWindow Property
Gets or sets a value that determines if command names are written to the history window.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool EchoCommandsToHistoryWindow { get; set; }
Public Property EchoCommandsToHistoryWindow As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace