RhinoCommon API
FileDwgWriteOptions.ExportLinesAs Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgWriteOptions.ExportLinesAs"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileDwgWriteOptions.ExportLineMode ExportLinesAs { get; set; }
Public Property ExportLinesAs As FileDwgWriteOptions.ExportLineMode
	Get
	Set
Property Value
Type: FileDwgWriteOptions.ExportLineMode
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace