RhinoCommon API
RenderContent.Xml Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContent.Xml"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Xml { get; }
Public ReadOnly Property Xml As String
	Get
Property Value
Type: String
See Also
Reference
RenderContent Class
Rhino.Render Namespace