RhinoCommon API
ComponentStatus.IsHidden Property
 Returns true if hidden. False otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsHidden { get; }
Public ReadOnly Property IsHidden As Boolean
	Get
Return Value
Type: Boolean
The component status for hidden.
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace