RhinoCommon API
RhinoDoc.PageAngleToleranceDegrees Property
Page space angle tolerance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double PageAngleToleranceDegrees { get; set; }
Public Property PageAngleToleranceDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RhinoDoc Class
Rhino Namespace