RhinoCommon API
AppearanceSettings.EditCandidateColor Property
 Gets or sets the color of objects that are eligible to be edited.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Color EditCandidateColor { get; set; }
Public Shared Property EditCandidateColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace