RhinoCommon API
CurvatureAnalysisSettingsState.GaussRange Property
 Gets or sets the Gaussian curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Interval GaussRange { get; set; }
Public Property GaussRange As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
CurvatureAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace