RhinoCommon API
MeshExtruder.KeepOriginalFaces Property
 Whether or not to keep original faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public bool KeepOriginalFaces { get; set; }
Public Property KeepOriginalFaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace