RhinoCommon API
RenderSettings.BackgroundStyle Property
 How the viewport's background should be filled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BackgroundStyle BackgroundStyle { get; set; }
Public Property BackgroundStyle As BackgroundStyle
	Get
	Set
Property Value
Type: BackgroundStyle
See Also
Reference
RenderSettings Class
Rhino.Render Namespace