RhinoCommon API
DisplayPipelineAttributes.UseCustomObjectMaterial Property
 Gets or sets whether objects ought to be drawn using a custom material.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool UseCustomObjectMaterial { get; set; }
Public Property UseCustomObjectMaterial As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace