RhinoCommon API
PhysicallyBasedMaterial.Metallic Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.Metallic"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double Metallic { get; set; }
Public Property Metallic As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace