RhinoCommon API
HatchPatternTableEventArgs.EventType Property
 The event type.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public HatchPatternTableEventType EventType { get; }
Public ReadOnly Property EventType As HatchPatternTableEventType
	Get
Property Value
Type: HatchPatternTableEventType
See Also
Reference
HatchPatternTableEventArgs Class
Rhino.DocObjects.Tables Namespace