RhinoCommon API
ContentUuids.MultiplyTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.MultiplyTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Guid MultiplyTextureType { get; }
Public Shared ReadOnly Property MultiplyTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace