RhinoCommon API
ClippingPlane.Attributes Property
 Get the ClippingPlaneObject for this clipping plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ObjectAttributes Attributes { get; }
Public ReadOnly Property Attributes As ObjectAttributes
	Get
Property Value
Type: ObjectAttributes
See Also
Reference
ClippingPlane Class
Rhino.Render.ChangeQueue Namespace