RhinoCommon API
HiddenLineDrawingPoint.SourceObjectComponentIndex Property
 Component of source object part that generated this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public ComponentIndex SourceObjectComponentIndex { get; }
Public ReadOnly Property SourceObjectComponentIndex As ComponentIndex
	Get
Property Value
Type: ComponentIndex
See Also
Reference
HiddenLineDrawingPoint Class
Rhino.Geometry Namespace