RhinoCommon API
File3dmSettings.ModelAngleToleranceRadians Property
Gets or sets the model space angle tolerance.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ModelAngleToleranceRadians { get; set; }
Public Property ModelAngleToleranceRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace