RhinoCommon API
LicenseStatus.ExpirationDate Property
 The date and time the license will expire. This value can be null if: 1.) The license contentType is "Standalone" and the license does not expire. 2.) The license contentType is "Network". 3.) The license contentType is "NetworkCheckedOut" and the checkout does not expire Note, date and time is in local time coordinates.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DateTime? ExpirationDate { get; set; }
Public Property ExpirationDate As DateTime?
	Get
	Set
Property Value
Type: Nullable<DateTime>
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace