RhinoCommon API
GeneralSettingsState.AutoUpdateCommandHelp Property
 Gets or sets the command help dialog auto-update feature.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool AutoUpdateCommandHelp { get; set; }
Public Property AutoUpdateCommandHelp As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace