RhinoCommon API
NurbsCurveFitParameters.Degree Property
 The degree of the resulting curve
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Degree { get; set; }
Public Property Degree As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace