RhinoCommon API
Linetype.HasShapes Property
 Does this linetype have shapes
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool HasShapes { get; }
Public ReadOnly Property HasShapes As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace