RhinoCommon API
File3dmSettings.CurrentRenderMaterialId Property
The id of the current render material.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public Guid CurrentRenderMaterialId { get; set; }
Public Property CurrentRenderMaterialId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace