RhinoCommon API
RenderSettings.AntialiasLevel Property
 Gets or sets anti-alias level, used for render quality
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public AntialiasLevel AntialiasLevel { get; set; }
Public Property AntialiasLevel As AntialiasLevel
	Get
	Set
Property Value
Type: AntialiasLevel
See Also
Reference
RenderSettings Class
Rhino.Render Namespace