RhinoCommon API
FileWriteOptions.WriteGeometryOnly Property
 If true, the file written should include only geometry File Writing Plug-in supports it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool WriteGeometryOnly { get; set; }
Public Property WriteGeometryOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace