RhinoCommon API
ProviderIds.NullGuid Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.NullGuid"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid NullGuid { get; }
Public Shared ReadOnly Property NullGuid As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace