RhinoCommon API
ViewSettingsState.TwoPointPerspectiveLensLength Property
 Gets the two point perspective lens length. The default is 20mm.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.20
Syntax
public double TwoPointPerspectiveLensLength { get; }
Public ReadOnly Property TwoPointPerspectiveLensLength As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace