RhinoCommon API
WorksessionFileModel.IsActive Property
 Gets or sets whether this is the model that was active when the worksession was saved. Every other model is a reference model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsActive { get; set; }
Public Property IsActive As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace