RhinoCommon API
PageSettings.LeftMarginMillimeters Property
Left margin in millimeters.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public double LeftMarginMillimeters { get; set; }
Public Property LeftMarginMillimeters As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PageSettings Class
Rhino.DocObjects Namespace