RhinoCommon API
AnnotationBase.TextModelWidth Property
 Width of text in the model
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double TextModelWidth { get; }
Public ReadOnly Property TextModelWidth As Double
	Get
Property Value
Type: Double
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace