RhinoCommon API
GpuDeviceInfo.Vendor Property
 Vendor of the device
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public string Vendor { get; }
Public ReadOnly Property Vendor As String
	Get
Property Value
Type: String
See Also
Reference
GpuDeviceInfo Class
Rhino Namespace