RhinoCommon API
DisplayMaterial.BackEmission Property
 Gets or sets the Emissive color of the back side of the Material. The alpha component of the color will be ignored.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color BackEmission { get; set; }
Public Property BackEmission As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace