RhinoCommon API
StringParserSettings.ParseUnaryMinus Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseUnaryMinus"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseUnaryMinus { get; set; }
Public Property ParseUnaryMinus As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace