RhinoCommon API
CurvatureGraphSettingsState.CurveHairColor Property
 Gets or sets the curve hair color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Color CurveHairColor { get; set; }
Public Property CurveHairColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
CurvatureGraphSettingsState Class
Rhino.ApplicationSettings Namespace