RhinoCommon API
File3dmRenderContent.AutoDelete Property
True if the content is automatically deleted when not in use.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool AutoDelete { get; }
Public ReadOnly Property AutoDelete As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace