RhinoCommon API
FileDwgWriteOptions.MinPointDistance Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgWriteOptions.MinPointDistance"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double MinPointDistance { get; set; }
Public Property MinPointDistance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace