RhinoCommon API
GumballSettingsState.GumballRadius Property
 Specifies the radius of the gumball widget in pixels.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int GumballRadius { get; set; }
Public Property GumballRadius As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace