RhinoCommon API
ComponentStatus.SelectedPersistent Property
 The persistent selection flag is checked.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ComponentStatus SelectedPersistent { get; }
Public Shared ReadOnly Property SelectedPersistent As ComponentStatus
	Get
Property Value
Type: ComponentStatus
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace