RhinoCommon API
AnimationProperties.EndMonth Property
 Gets or sets the end month for seasonal day sun animation in the range 1 to 12.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public int EndMonth { get; set; }
Public Property EndMonth As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace