RhinoCommon API
MeshThicknessMeasurement.Thickness Property
 Gets the local thickness of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Thickness { get; }
Public ReadOnly Property Thickness As Double
	Get
Property Value
Type: Double
See Also
Reference
MeshThicknessMeasurement Structure
Rhino.Geometry Namespace