RhinoCommon API
MatchSrfSettings.Average Property
 If true, change both surfaces
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public bool Average { get; set; }
Public Property Average As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MatchSrfSettings Class
Rhino.Geometry Namespace