RhinoCommon API
Triangle3d.AngleC Property
 Gets the angle at the C corner.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public double AngleC { get; }
Public ReadOnly Property AngleC As Double
	Get
Property Value
Type: Double
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace