RhinoCommon API
DecalCreateParams.MaxU Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.MaxU"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double MaxU { get; set; }
Public Property MaxU As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace