RhinoCommon API
Curve.IsSubDFriendly Property
 Returns true if the curve is a cubic, non-rational, uniform NURBS curve that is either periodic or has natural end conditions. Otherwise, false is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool IsSubDFriendly { get; }
Public ReadOnly Property IsSubDFriendly As Boolean
	Get
Property Value
Type: Boolean
Remarks
 A "natural" spline has zero 2nd derivatives (and hence zero curvature) at the start and end. A "periodic" spline has unclampled periodic knots and periodic control points.
See Also
Reference
Curve Class
Rhino.Geometry Namespace