RhinoCommon API
Markup.Name Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Markup.Name"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public override string Name { get; set; }
Public Overrides Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Markup Class
Rhino.DocObjects Namespace