RhinoCommon API
HatchPattern.InUse Property
 Returns true if the hatch pattern is in use by a Rhino object, a layer, an instance definition, or a section style.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public bool InUse { get; }
Public ReadOnly Property InUse As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace