RhinoCommon API
SafeFrame.TitleFrameOn Property
 Show a user specified title area frame in orange.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public bool TitleFrameOn { get; set; }
Public Property TitleFrameOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SafeFrame Class
Rhino.Render Namespace