RhinoCommon API
GripStatus.Visible Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripStatus.Visible"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Visible { get; }
Public ReadOnly Property Visible As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GripStatus Class
Rhino.DocObjects.Custom Namespace