RhinoCommon API
OrdinateDimension.DefPoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.OrdinateDimension.DefPoint"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point2d DefPoint { get; set; }
Public Property DefPoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace