RhinoCommon API
MatchSrfSettings.ReverseAverageTargetDirection Property
 Reverse the direction of the target for the averaged edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public bool ReverseAverageTargetDirection { get; set; }
Public Property ReverseAverageTargetDirection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MatchSrfSettings Class
Rhino.Geometry Namespace