RhinoCommon API
ModelAidSettings.CenterSnapToApproximations Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettings.CenterSnapToApproximations"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool CenterSnapToApproximations { get; set; }
Public Shared Property CenterSnapToApproximations As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace