RhinoCommon API
DisplayPipelineAttributes.CustomGroundPlaneOn Property
 Turn the custom ground plane on or off
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public bool CustomGroundPlaneOn { get; set; }
Public Property CustomGroundPlaneOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace