RhinoCommon API
FileSkpReadOptions.ImportFacesAsMeshes Property
Set to false for trimmed planes.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportFacesAsMeshes { get; set; }
Public Property ImportFacesAsMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSkpReadOptions Class
Rhino.FileIO Namespace