RhinoCommon API
FileCsvWriteOptions.ObjectID Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.ObjectID"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ObjectID { get; set; }
Public Property ObjectID As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace