RhinoCommon API
BrepEdge.TrimCount Property
 Gets the number of trim-curves that use this edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int TrimCount { get; }
Public ReadOnly Property TrimCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace