RhinoCommon API
FileStpWriteOptions.SplitClosedSurfaces Property
 Splits closed surfaces, for example, the interior surfaces of drilled holes.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool SplitClosedSurfaces { get; set; }
Public Property SplitClosedSurfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileStpWriteOptions Class
Rhino.FileIO Namespace