RhinoCommon API
LocalizeStringPair.Local Property
[Missing <summary> documentation for "P:Rhino.UI.LocalizeStringPair.Local"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Local { get; }
Public ReadOnly Property Local As String
	Get
Property Value
Type: String
See Also
Reference
LocalizeStringPair Class
Rhino.UI Namespace