RhinoCommon API
MeshPart.VertexCount Property
EndVertexIndex - StartVertexIndex
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public int VertexCount { get; }
Public ReadOnly Property VertexCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace