RhinoCommon API
FileSettings.DefaultRuiFile Property
 Gets the path to the default RUI file.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string DefaultRuiFile { get; }
Public Shared ReadOnly Property DefaultRuiFile As String
	Get
Property Value
Type: String
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace