RhinoCommon API
ViewInfo.ShowConstructionZAxis Property
Whether the construction plane z axis is drawn in this view.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool ShowConstructionZAxis { get; set; }
Public Property ShowConstructionZAxis As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace