RhinoCommon API
DisplayPipelineAttributes.SubDSmoothInteriorEdgeColorUsage Property
 Edge color usage
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public DisplayPipelineAttributes.SubDEdgeColorUse SubDSmoothInteriorEdgeColorUsage { get; set; }
Public Property SubDSmoothInteriorEdgeColorUsage As DisplayPipelineAttributes.SubDEdgeColorUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.SubDEdgeColorUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace