RhinoCommon API
MarkupTableEventArgs.NewState Property
The markup
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Markup NewState { get; }
Public ReadOnly Property NewState As Markup
	Get
Property Value
Type: Markup
See Also
Reference
MarkupTableEventArgs Class
Rhino.DocObjects.Tables Namespace