RhinoCommon API
FileWriteOptions.Xform Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.Xform"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Transform Xform { get; set; }
Public Property Xform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace