RhinoCommon API
Texture.WcsBoxProjected Property
 Is true if this texture uses world coordinate system (WCS) box projection for texture mapping. Notice: If this texture is used by an object that has an object coordinate system (OCS) frame defined on a mapping channel then that OCS frame is used instead of the WCS.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public bool WcsBoxProjected { get; }
Public ReadOnly Property WcsBoxProjected As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Texture Class
Rhino.DocObjects Namespace