RhinoCommon API
Decal.VectorAcross Property
 Gets the vector across. For cylindrical and spherical mapping, the vector is unitized.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public Vector3d VectorAcross { get; set; }
Public Property VectorAcross As Vector3d
	Get
	Set
Property Value
Type: Vector3d
The 'across' vector of the decal. For planar mapping the length of the vector is relevant.
See Also
Reference
Decal Class
Rhino.Render Namespace