RhinoCommon API
Circle.Unset Property
 Gets a circle with Unset components.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Circle Unset { get; }
Public Shared ReadOnly Property Unset As Circle
	Get
Property Value
Type: Circle
See Also
Reference
Circle Structure
Rhino.Geometry Namespace