RhinoCommon API
VisualAnalysisMode.RhinoEmapAnalysisModeId Property
 Id for Rhino's built-in emap analysis mode. An environment map is shown on surfaces and meshes.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid RhinoEmapAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoEmapAnalysisModeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace