RhinoCommon API
DisplayPipelineAttributes.SubDBoundaryThicknessUsage Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SubDBoundaryThicknessUsage"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public DisplayPipelineAttributes.SubDThicknessUse SubDBoundaryThicknessUsage { get; set; }
Public Property SubDBoundaryThicknessUsage As DisplayPipelineAttributes.SubDThicknessUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.SubDThicknessUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace