RhinoCommon API
Dimension.ArrowBlockId1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ArrowBlockId1"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid ArrowBlockId1 { get; set; }
Public Property ArrowBlockId1 As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Dimension Class
Rhino.Geometry Namespace