RhinoCommon API
CustomObjectGrips.GripsType Property
What these grips control. Set at construction.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public ObjectGripsType GripsType { get; }
Public ReadOnly Property GripsType As ObjectGripsType
	Get
Property Value
Type: ObjectGripsType
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace