RhinoCommon API
SubDVertexList.First Property
 First vertex in this linked list of vertices
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDVertex First { get; }
Public ReadOnly Property First As SubDVertex
	Get
Property Value
Type: SubDVertex
See Also
Reference
SubDVertexList Class
Rhino.Geometry.Collections Namespace