RhinoCommon API
FileGltfWriteOptions.DracoQuantizationBitsTextureCoordinate Property
 The number of bits used when quantizing mesh texture coordinates in the range of 8 to 32 inclusive
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public int DracoQuantizationBitsTextureCoordinate { get; set; }
Public Property DracoQuantizationBitsTextureCoordinate As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace