RhinoCommon API
MaterialRefCreateParams.BackFaceMaterialId Property
 The Id of the Material used to render the back of an object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public Guid BackFaceMaterialId { get; set; }
Public Property BackFaceMaterialId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace