RhinoCommon API
CurvatureAnalysisSettings.MinRadiusRange Property
 Gets or sets the Minimum Radius curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Interval MinRadiusRange { get; set; }
Public Shared Property MinRadiusRange As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace