RhinoCommon API
DracoCompression.VertexColorAttributePosition Property
 The attribute position for vertex colors when compressed
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
public int VertexColorAttributePosition { get; }
Public ReadOnly Property VertexColorAttributePosition As Integer
	Get
Property Value
Type: Int32
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace