RhinoCommon API
DisplayPipelineAttributes.SurfaceIsoThicknessUScale Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThicknessUScale"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public float SurfaceIsoThicknessUScale { get; set; }
Public Property SurfaceIsoThicknessUScale As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace