RhinoCommon API
ControlPoint.Location Property
 Gets or sets world 3-D, or Euclidean location of the control point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d Location { get; set; }
Public Property Location As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace