RhinoCommon API
MatchSrfSettings.RefineCurvatureTolerance Property
 Percentage radius of curvature difference during refinement
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public double RefineCurvatureTolerance { get; }
Public ReadOnly Property RefineCurvatureTolerance As Double
	Get
Property Value
Type: Double
See Also
Reference
MatchSrfSettings Class
Rhino.Geometry Namespace