RhinoCommon API
DisplayAttributeMaterial.OverrideObjectReflectivity Property
 Objects acquire reflectivity from render materials.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool OverrideObjectReflectivity { get; set; }
Public Property OverrideObjectReflectivity As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace