RhinoCommon API
ChooseOneObjectSettingsState.YOffset Property
YOffset
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int YOffset { get; set; }
Public Property YOffset As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace