RhinoCommon API
FileIgsWriteOptions.SolidType Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.SolidType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileIgsWriteOptions.SolidsMode SolidType { get; set; }
Public Property SolidType As FileIgsWriteOptions.SolidsMode
	Get
	Set
Property Value
Type: FileIgsWriteOptions.SolidsMode
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace