RhinoCommon API
DisplayPipelineAttributes.ShadowClippingRadius Property
 Camera-based shadow clipping radius
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public float ShadowClippingRadius { get; set; }
Public Property ShadowClippingRadius As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace