RhinoCommon API
ObjectAttributes.MaterialIndex Property
 Gets or sets the material index.
If you want something simple and fast, set the index of the rendering material.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int MaterialIndex { get; set; }
Public Property MaterialIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace
ObjectAttributes.RenderMaterial