RhinoCommon API
ChooseOneObjectSettings.XOffset Property
XOffset
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static int XOffset { get; set; }
Public Shared Property XOffset As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace