RhinoCommon API
DisplayPointAttributes.RotationRadians Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPointAttributes.RotationRadians"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public float? RotationRadians { get; set; }
Public Property RotationRadians As Single?
	Get
	Set
Property Value
Type: Nullable<Single>
See Also
Reference
DisplayPointAttributes Class
Rhino.Display Namespace