RhinoCommon API
Point2f.Unset Property
 Gets the standard unset point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Point2f Unset { get; }
Public Shared ReadOnly Property Unset As Point2f
	Get
Property Value
Type: Point2f
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace