RhinoCommon API
UserInterfaceSection.Window Property
 The user control associated with this user interface object.
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Object Window { get; }
Public ReadOnly Property Window As Object
	Get
Property Value
Type: Object
See Also
Reference
UserInterfaceSection Class
Rhino.Render.UI Namespace