RhinoCommon API
StringParserSettings.ParseExplicitFormulaExpression Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseExplicitFormulaExpression"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseExplicitFormulaExpression { get; set; }
Public Property ParseExplicitFormulaExpression As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace