RhinoCommon API
Centermark.Radius Property
 Gets or sets the center mark's radius.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Centermark Class
Rhino.Geometry Namespace