RhinoCommon API
DisplayPipelineAttributes.ShadeVertexColors Property
Shade using vertex colors.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public bool ShadeVertexColors { get; set; }
Public Property ShadeVertexColors As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace