RhinoCommon API
RhinoReplaceObjectEventArgs.NewRhinoObject Property
 The new replacement object, or the object about to be added. At the time is called, this object has not been added to the document. Thus, this object's id will be .
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoObject NewRhinoObject { get; }
Public ReadOnly Property NewRhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
RhinoReplaceObjectEventArgs Class
Rhino.DocObjects Namespace
RhinoDoc.ReplaceRhinoObject
Guid.Empty