RhinoCommon API
Light.PerpendicularDirection Property
 Gets a perpendicular vector to the camera direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d PerpendicularDirection { get; }
Public ReadOnly Property PerpendicularDirection As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Light Class
Rhino.Geometry Namespace