RhinoCommon API
ModelAidSettingsState.CenterSnapToApproximations Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettingsState.CenterSnapToApproximations"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool CenterSnapToApproximations { get; set; }
Public Property CenterSnapToApproximations As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace