RhinoCommon API
File3dmDisplacement.WhitePoint Property
 Specifies the amount of displacement for the white color in the texture.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double WhitePoint { get; set; }
Public Property WhitePoint As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace