RhinoCommon API
LocalizeStringPair.English Property
[Missing <summary> documentation for "P:Rhino.UI.LocalizeStringPair.English"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string English { get; }
Public ReadOnly Property English As String
	Get
Property Value
Type: String
See Also
Reference
LocalizeStringPair Class
Rhino.UI Namespace