RhinoCommon API
ObjectAttributes.PlotWeightSource Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectAttributes.PlotWeightSource"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ObjectPlotWeightSource PlotWeightSource { get; set; }
Public Property PlotWeightSource As ObjectPlotWeightSource
	Get
	Set
Property Value
Type: ObjectPlotWeightSource
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace