RhinoCommon API
Symbols.RadiusSymbol Property
 Radius symbol
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static char RadiusSymbol { get; }
Public Shared ReadOnly Property RadiusSymbol As Char
	Get
Property Value
Type: Char
See Also
Reference
Symbols Class
Rhino Namespace