RhinoCommon API
AssemblyResolver.CurrentDomainReflectionOnlyAssemblyResolve Property
 Standard resolver function used by Rhino in reflection-only context. This is added to the Current ReflectionOnlyAssemblyResolve.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public static ResolveEventHandler CurrentDomainReflectionOnlyAssemblyResolve { get; }
Public Shared ReadOnly Property CurrentDomainReflectionOnlyAssemblyResolve As ResolveEventHandler
	Get
Property Value
Type: ResolveEventHandler
See Also
Reference
AssemblyResolver Class
Rhino.Runtime Namespace