RhinoCommon API
SubDEdgeSharpness.IsVariable Property
 Gets true if this is valid and the two ends differ. Crease and Nan are both false.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool IsVariable { get; }
Public ReadOnly Property IsVariable As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace