RhinoCommon API
FontQuartet.HasItalicFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.FontQuartet.HasItalicFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public bool HasItalicFont { get; }
Public ReadOnly Property HasItalicFont As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
FontQuartet Class
Rhino.DocObjects Namespace