RhinoCommon API
RenderMaterial.SmellsLikeTexturedMetal Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeTexturedMetal"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SmellsLikeTexturedMetal { get; }
Public ReadOnly Property SmellsLikeTexturedMetal As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace