RhinoCommon API
LengthMassProperties.WorldCoordinatesFirstMomentsError Property
 Uncertainty in world coordinates first moments calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public Vector3d WorldCoordinatesFirstMomentsError { get; }
Public ReadOnly Property WorldCoordinatesFirstMomentsError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace