RhinoCommon API
StringTable.DocumentUserTextCount Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.StringTable.DocumentUserTextCount"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int DocumentUserTextCount { get; }
Public ReadOnly Property DocumentUserTextCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace