RhinoCommon API
ChooseOneObjectSettingsState.ShowObjectColor Property
ShowObjectColor
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ShowObjectColor { get; set; }
Public Property ShowObjectColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace