RhinoCommon API
GetCurve.Sharp Property
 When true, closing the curve produces a sharp corner at the seam instead of a periodic curve. Default is false.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Sharp { get; set; }
Public Property Sharp As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace