RhinoCommon API
SubDSurfaceInterpolator.MaximumRecommendedInterpolatedVertexCount Property
 Interpolation requires building a solver. We estimate that this solver will work in reasonnable time if the number of interplolated vertices is smaller than MaximumInterpolatedVertexCount. However, given sufficient time, memory, and CPU resources, the code will work with any value. In version 8.0, this value is 1000.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static uint MaximumRecommendedInterpolatedVertexCount { get; }
Public Shared ReadOnly Property MaximumRecommendedInterpolatedVertexCount As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
SubDSurfaceInterpolator Class
Rhino.Geometry Namespace