RhinoCommon API
StackedDialogPage.NavigationTextIsBold Property
 Currently only used by Windows Rhino. If this is set to true then the tree control item text will be bold.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool NavigationTextIsBold { get; set; }
Public Property NavigationTextIsBold As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace