RhinoCommon API
CursorTooltipSettingsState.BackgroundColor Property
Tooltip background color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color BackgroundColor { get; set; }
Public Property BackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace