RhinoCommon API
CustomUndoEventArgs.CreatedByRedo Property
[Missing <summary> documentation for "P:Rhino.Commands.CustomUndoEventArgs.CreatedByRedo"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool CreatedByRedo { get; }
Public ReadOnly Property CreatedByRedo As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace