RhinoCommon API
ViewSettings.PanScreenFraction Property
Gets or sets the faction used as multiplier to pan the screen.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static double PanScreenFraction { get; set; }
Public Shared Property PanScreenFraction As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace