RhinoCommon API
ScaleValue.LeftToRightScale Property
 LeftLengthValue / RightLengthValue
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double LeftToRightScale { get; }
Public ReadOnly Property LeftToRightScale As Double
	Get
Property Value
Type: Double
See Also
Reference
ScaleValue Class
Rhino Namespace