RhinoCommon API
FileX_TWriteOptions.Type Property
 Get and set the type of the x_t file being written.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileX_TWriteOptions.X_T_Types Type { get; set; }
Public Property Type As FileX_TWriteOptions.X_T_Types
	Get
	Set
Property Value
Type: FileX_TWriteOptions.X_T_Types
See Also
Reference
FileX_TWriteOptions Class
Rhino.FileIO Namespace