RhinoCommon API
PostEffectUuids.Multiplier Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.Multiplier"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid Multiplier { get; }
Public Shared ReadOnly Property Multiplier As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace