RhinoCommon API
SubDEdgeSharpness.MinimumEndSharpness Property
 Gets the smaller of the two end sharpness values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public double MinimumEndSharpness { get; }
Public ReadOnly Property MinimumEndSharpness As Double
	Get
Property Value
Type: Double
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace