RhinoCommon API
FileNwdWriteOptions.MeshingParameters Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileNwdWriteOptions.MeshingParameters"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public MeshingParameters MeshingParameters { get; set; }
Public Property MeshingParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
See Also
Reference
FileNwdWriteOptions Class
Rhino.FileIO Namespace