RhinoCommon API
HostUtils.RunningOnLinux Property
 Tests if this process is currently executing on the Linux platform.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool RunningOnLinux { get; }
Public Shared ReadOnly Property RunningOnLinux As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace