RhinoCommon API
ContentUuids.DisplayAttributeMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.DisplayAttributeMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public static Guid DisplayAttributeMaterialType { get; }
Public Shared ReadOnly Property DisplayAttributeMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace