RhinoCommon API
AppearanceSettings.PreviousLanguageIdentifier Property
 Gets or sets the previous language identifier.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int PreviousLanguageIdentifier { get; set; }
Public Shared Property PreviousLanguageIdentifier As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace