RhinoCommon API
ContentUuids.PlasterMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.PlasterMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid PlasterMaterialType { get; }
Public Shared ReadOnly Property PlasterMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace