RhinoCommon API
Decal.DecalProjection Property
Note: This API is now obsolete.
 Gets the decal's projection. Used only when mapping is planar.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
[ObsoleteAttribute("Use Projection instead")]
public DecalProjection DecalProjection { get; }
<ObsoleteAttribute("Use Projection instead")>
Public ReadOnly Property DecalProjection As DecalProjection
	Get
Property Value
Type: DecalProjection
See Also
Reference
Decal Class
Rhino.Render Namespace