RhinoCommon API
Markup.IsUnset Property
Returns true if the markup is unset.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsUnset { get; }
Public ReadOnly Property IsUnset As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Markup Class
Rhino.DocObjects Namespace