RhinoCommon API
DisplayPipelineAttributes.MeshDisplayAttributes.MeshWireThickness Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes.MeshWireThickness"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int MeshWireThickness { get; set; }
Public Property MeshWireThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes.MeshDisplayAttributes Class
Rhino.Display Namespace