RhinoCommon API
MeshingParameters.DoublePrecision Property
 Gets or sets a value indicating whether or not the mesh should have double precision vertices in addition to the floats.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool DoublePrecision { get; set; }
Public Property DoublePrecision As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace