RhinoCommon API
UserInterfaceObjectBase.Visible Property
 Is the user interface object visible? Objects that are not visible will not be drawn and will not receive mouse events
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Visible { get; set; }
Public Property Visible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace