RhinoCommon API
FileSkpReadOptions.DisplayColorBy Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSkpReadOptions.DisplayColorBy"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int DisplayColorBy { get; set; }
Public Property DisplayColorBy As Integer
	Get
	Set
Property Value
Type: Int32
Remarks
 0 == material, 1 == layer
See Also
Reference
FileSkpReadOptions Class
Rhino.FileIO Namespace