RhinoCommon API
QuadRemeshParameters.DetectHardEdges Property
 When enabled the hard edges in models will be retained.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool DetectHardEdges { get; set; }
Public Property DetectHardEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
QuadRemeshParameters Class
Rhino.Geometry Namespace