RhinoCommon API
ScaleValue.RightToLeftScale Property
 RightLengthValue / LeftLengthValue
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double RightToLeftScale { get; }
Public ReadOnly Property RightToLeftScale As Double
	Get
Property Value
Type: Double
See Also
Reference
ScaleValue Class
Rhino Namespace