RhinoCommon API
PostEffectData.Collection Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectData.Collection"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public PostEffectCollection Collection { get; }
Public ReadOnly Property Collection As PostEffectCollection
	Get
Property Value
Type: PostEffectCollection
See Also
Reference
PostEffectData Class
Rhino.Render.PostEffects Namespace