RhinoCommon API
FileIgsWriteOptions.MaxSurfaceDegree Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.MaxSurfaceDegree"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileIgsWriteOptions.MaxDegreeMode MaxSurfaceDegree { get; set; }
Public Property MaxSurfaceDegree As FileIgsWriteOptions.MaxDegreeMode
	Get
	Set
Property Value
Type: FileIgsWriteOptions.MaxDegreeMode
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace