RhinoCommon API
PostProcessFrameBufferEventArgs.FrameBufferSize Property
 Width and height in pixels of the frame this handler can read. A layout runs this channel once per detail, so this is not always the size of the view.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Size FrameBufferSize { get; }
Public ReadOnly Property FrameBufferSize As Size
	Get
Property Value
Type: Size
See Also
Reference
PostProcessFrameBufferEventArgs Class
Rhino.Display Namespace