RhinoCommon API
OptionColor.InitialValue Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.OptionColor.InitialValue"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color InitialValue { get; }
Public ReadOnly Property InitialValue As Color
	Get
Property Value
Type: Color
See Also
Reference
OptionColor Class
Rhino.Input.Custom Namespace