RhinoCommon API
AnnotationBase.MaskEnabled Property
 Determines whether or not to draw a Text Mask
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool MaskEnabled { get; set; }
Public Property MaskEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace