RhinoCommon API
DisplayPipelineAttributes.FrontMaterialShine Property
 Get or set the front material shine (0 to Rhino.DocObjects.Material.MaxShine). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public double FrontMaterialShine { get; set; }
Public Property FrontMaterialShine As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace