RhinoCommon API
FilePdfReadOptions.PDFScale Property
[Missing <summary> documentation for "P:Rhino.FileIO.FilePdfReadOptions.PDFScale"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double PDFScale { get; set; }
Public Property PDFScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FilePdfReadOptions Class
Rhino.FileIO Namespace