RhinoCommon API
FileSettings.WorkingFolder Property
 Returns or sets Rhino's working directory, or folder. The working folder is the default folder for all file operations.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string WorkingFolder { get; set; }
Public Shared Property WorkingFolder As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace