RhinoCommon API
SubDCreationOptions.ConvexAndConcaveCornersAndInteriorCreases Property
 Look for convex corners at sub-D vertices with 2 edges or fewer that have an included angle ≤ 120 degrees. Look for concave corners at sub-D vertices with 3 edges or more that have an included angle ≥ 240 degrees.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static SubDCreationOptions ConvexAndConcaveCornersAndInteriorCreases { get; }
Public Shared ReadOnly Property ConvexAndConcaveCornersAndInteriorCreases As SubDCreationOptions
	Get
Property Value
Type: SubDCreationOptions
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace