RhinoCommon API
GeometryBase.IsDocumentControlled Property
 If true this object may not be modified. Any properties or functions that attempt to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override sealed bool IsDocumentControlled { get; }
Public Overrides NotOverridable ReadOnly Property IsDocumentControlled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace