RhinoCommon API
GetCurve.SecondPointPrompt Property
Prompt used when getting the second point. The default is the localized "Next point".
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string SecondPointPrompt { get; set; }
Public Property SecondPointPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace