RhinoCommon API
ConstructionPlane.Name Property
 Gets or sets the name of the construction plane.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace