RhinoCommon API
DisplayPipelineAttributes.ShadowTransparencyTolerance Property
 Transparency tolerance from 0 (never cast shadows) to 100 (always case shadows)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int ShadowTransparencyTolerance { get; set; }
Public Property ShadowTransparencyTolerance As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace