RhinoCommon API
ViewCapture.TransparentBackground Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.TransparentBackground"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TransparentBackground { get; set; }
Public Property TransparentBackground As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCapture Class
Rhino.Display Namespace