RhinoCommon API
RenderContent.DocumentRegistered Property
Note: This API is now obsolete.
 Obsolete. Do not use. You should use DocumentOwner instead.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use DocumentOwner")]
public RhinoDoc DocumentRegistered { get; }
<ObsoleteAttribute("Use DocumentOwner")>
Public ReadOnly Property DocumentRegistered As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RenderContent Class
Rhino.Render Namespace