RhinoCommon API
ObjectGripsIds.SubDEditPoints Property
A grip at every surface point of a SubD. EditPtOn turns these on.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid SubDEditPoints { get; }
Public Shared ReadOnly Property SubDEditPoints As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ObjectGripsIds Class
Rhino.DocObjects Namespace