RhinoCommon API
ControlPoint.Z Property
 Gets or sets the Z coordinate of the control point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Z { get; set; }
Public Property Z As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace