RhinoCommon API
ModelAidSettingsState.UniversalConstructionPlaneMode Property
Gets or sets the locked state of the snap modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool UniversalConstructionPlaneMode { get; set; }
Public Property UniversalConstructionPlaneMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace