RhinoCommon API
AppearanceSettingsState.CommandPromptFontSize Property
Size of the font used in the command prompt (in points)
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int CommandPromptFontSize { get; set; }
Public Property CommandPromptFontSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace