RhinoCommon API
LengthValue.ContextLocaleId Property
 returns the context LocaleId from this LengthValue
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint ContextLocaleId { get; }
Public ReadOnly Property ContextLocaleId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
LengthValue Class
Rhino Namespace