RhinoCommon API
DisplayPipelineAttributes.ClippingEdgeColor Property
 Clipping edge color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public Color ClippingEdgeColor { get; set; }
Public Property ClippingEdgeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace