RhinoCommon API
RhinoViewport.ScreenPortAspect Property
 screen port's width/height.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ScreenPortAspect { get; }
Public ReadOnly Property ScreenPortAspect As Double
	Get
Property Value
Type: Double
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace