RhinoCommon API
DisplayPipelineAttributes.ClippingFillColor Property
 Clipping plane fill color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public Color ClippingFillColor { get; set; }
Public Property ClippingFillColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace