RhinoCommon API
RhinoObject.Name Property
 Rhino objects have optional text names. More than one object in a model can have the same name and some objects may have no name.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override string Name { get; set; }
Public Overrides Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace