RhinoCommon API
DisplayPipelineAttributes.IgnoreHighlights Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.IgnoreHighlights"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IgnoreHighlights { get; set; }
Public Property IgnoreHighlights As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace