RhinoCommon API
Dimension.TextPosition Property
 Gets and sets the position of text on the plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point2d TextPosition { get; set; }
Public Property TextPosition As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
Dimension Class
Rhino.Geometry Namespace