RhinoCommon API
GetCurve.FirstPointPrompt Property
Prompt used when getting the first point. The default is the localized "Start of curve".
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string FirstPointPrompt { get; set; }
Public Property FirstPointPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace