RhinoCommon API
MeshCheckParameters.NakedEdgeCount Property
 Gets the total number of naked edges for all meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int NakedEdgeCount { get; }
Public ReadOnly Property NakedEdgeCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace