RhinoCommon API
ColorStop.Color Property
[Missing <summary> documentation for "P:Rhino.Display.ColorStop.Color"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Color Color {
	get;
 set; }
Public Property Color As Color
		Get
	Set
Property Value
Type: Color
See Also
Reference
ColorStop Structure
Rhino.Display Namespace