RhinoCommon API
RhinoDoc.RenderContentTableEventArgs.Document Property
 Document the table belongs to
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoDoc.RenderContentTableEventArgs Class
Rhino Namespace