RhinoCommon API
FileDgnReadOptions.ImportViews Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDgnReadOptions.ImportViews"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportViews { get; set; }
Public Property ImportViews As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDgnReadOptions Class
Rhino.FileIO Namespace