RhinoCommon API
InstanceDefinition.SourceArchive Property
 Gets the full file path for linked instance definitions.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string SourceArchive { get; }
Public ReadOnly Property SourceArchive As String
	Get
Property Value
Type: String
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace