RhinoCommon API
Dimension.ExtensionLineExtension Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ExtensionLineExtension"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ExtensionLineExtension { get; set; }
Public Property ExtensionLineExtension As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace