RhinoCommon API
LengthMassProperties.LengthError Property
 Gets the uncertainty in the length calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public double LengthError { get; }
Public ReadOnly Property LengthError As Double
	Get
Property Value
Type: Double
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace