RhinoCommon API
RhinoPageView.PageViewGroupCount Property
 Gets the number of page view groups this page view belongs to.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PageViewGroupCount { get; }
Public ReadOnly Property PageViewGroupCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace