RhinoCommon API
GetCone.Height Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCone.Height"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace