RhinoCommon API
ConstructionPlane.GridSpacing Property
 Gets or sets the distance between grid lines.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double GridSpacing { get; set; }
Public Property GridSpacing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace