RhinoCommon API
SubDComponentParameter.IsEdgeParameter Property
 Gets true if this parameter identifies a surface point on a SubD edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsEdgeParameter { get; }
Public ReadOnly Property IsEdgeParameter As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace