RhinoCommon API
ViewSettingsState.LinkedViewports Property
 Gets or sets the 'linked views' activated setting.
true enables real-time view synchronization. When a standard view is manipulated, the camera lens length of all parallel projection viewports are set to match the current viewport.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool LinkedViewports { get; set; }
Public Property LinkedViewports As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace