RhinoCommon API
SectionStyle.BoundaryWidthScale Property
 Scale applied to the boundary wire thickness
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double BoundaryWidthScale { get; set; }
Public Property BoundaryWidthScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace