RhinoCommon API
FileIgsWriteOptions.ForceBezierKnotsOnCurves Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.ForceBezierKnotsOnCurves"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ForceBezierKnotsOnCurves { get; set; }
Public Property ForceBezierKnotsOnCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace