RhinoCommon API
HiddenLineDrawingParameters.Flatten Property
 Flatten the computed geometry
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Flatten { get; set; }
Public Property Flatten As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace