RhinoCommon API
ContentUuids.Texture3DCheckerTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.Texture3DCheckerTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid Texture3DCheckerTextureType { get; }
Public Shared ReadOnly Property Texture3DCheckerTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace