RhinoCommon API
ObjectAttributes.SectionStyleIndex Property
 Gets or sets the section style index.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int SectionStyleIndex { get; set; }
Public Property SectionStyleIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace