RhinoCommon API
GumballSettings.PlaneLocation Property
 Specifies the distance of the plane indicators from the gumball origin in pixels.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int PlaneLocation { get; set; }
Public Shared Property PlaneLocation As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace