RhinoCommon API
ModelAidSettings.UniversalConstructionPlaneMode Property
Gets or sets the locked state of the snap modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool UniversalConstructionPlaneMode { get; set; }
Public Shared Property UniversalConstructionPlaneMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace