RhinoCommon API
Line.From Property
 Start point of line segment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d From { get; set; }
Public Property From As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Line Structure
Rhino.Geometry Namespace