RhinoCommon API
PreviewRenderedEventArgs.Quality Property
 The Bitmap of the rendered preview
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public Utilities.PreviewQuality Quality { get; set; }
Public Property Quality As Utilities.PreviewQuality
	Get
	Set
Property Value
Type: Utilities.PreviewQuality
See Also
Reference
PreviewRenderedEventArgs Class
Rhino.Render Namespace