RhinoCommon API
ChooseOneObjectSettingsState.UseCustomColor Property
UseCustomColor
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool UseCustomColor { get; set; }
Public Property UseCustomColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace