RhinoCommon API
Vector3d.XAxis Property
 Gets the value of the vector with components 1,0,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector3d XAxis { get; }
Public Shared ReadOnly Property XAxis As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace