RhinoCommon API
AnimationProperties.CameraPoints Property
 Gets or sets points of the camera path.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public Point3d[] CameraPoints { get; set; }
Public Property CameraPoints As Point3d()
	Get
	Set
Property Value
Type: Point3d[]
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace