RhinoCommon API
AppearanceSettings.WorldCoordIconXAxisColor Property
 Gets or sets the color of the world coordinate X axis.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color WorldCoordIconXAxisColor { get; set; }
Public Shared Property WorldCoordIconXAxisColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace