RhinoCommon API
LinearWorkflow.PreProcessTextures Property
 Linear workflow pre-process textures enabled state.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool PreProcessTextures { get; set; }
Public Property PreProcessTextures As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace