RhinoCommon API
ObjectEnumeratorSettings.DeletedObjects Property
 When true, deleted objects are returned.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool DeletedObjects { get; set; }
Public Property DeletedObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace