RhinoCommon API
IOAuth2Token.Exp Property
 The expiration of the token. Expired tokens will be considered invalid by the Rhino Accounts server.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
DateTime? Exp { get; }
ReadOnly Property Exp As DateTime?
	Get
Property Value
Type: Nullable<DateTime>
Remarks
An OAuth2 Token can be invalidated at any time even if it has not expired.
See Also
Reference
IOAuth2Token Interface
Rhino.Runtime.RhinoAccounts Namespace