RhinoCommon API
SubDEdge.RelativeFaceRight Property
 The face on the right of this edge, with respect to the direction this edge is referenced with.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDFace RelativeFaceRight { get; }
Public ReadOnly Property RelativeFaceRight As SubDFace
	Get
Property Value
Type: SubDFace
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace