RhinoCommon API
SimulatedTexture.MappingChannel Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.MappingChannel"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public int MappingChannel { get; set; }
Public Property MappingChannel As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace