RhinoCommon API
MeshCurveIntersection.IsOnTriangleBoundary Property
True if this hit lies on a mesh-level boundary (Incidence is Edge or Vertex).
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsOnTriangleBoundary { get; }
Public ReadOnly Property IsOnTriangleBoundary As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace