RhinoCommon API
UserInterfaceControl.TextHorizontalAlignment Property
 Where the text sits inside the control's rectangle. This is not the same as HorizontalAlignment, which is where the control sits inside its parent.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public ControlHorizontalAlignment TextHorizontalAlignment { get; set; }
Public Property TextHorizontalAlignment As ControlHorizontalAlignment
	Get
	Set
Property Value
Type: ControlHorizontalAlignment
See Also
Reference
UserInterfaceControl Class
Rhino.UI Namespace