RhinoCommon API
FileObjWriteOptions.SignificantDigits Property
 Number of significant digits to write out for floating point numbers
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int SignificantDigits { get; set; }
Public Property SignificantDigits As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace