RhinoCommon API
Font.UnitsPerEm Property
 The number of design units per em in this font's normalized metrics. Together with AscentOfCapital this converts between an em size - the "font size" used by CSS, SVG, PDF and most page layout - and the height of a capital letter, which is what Rhino means by a text height. Zero when the font has no usable metrics.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int UnitsPerEm { get; }
Public ReadOnly Property UnitsPerEm As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Font Class
Rhino.DocObjects Namespace