RhinoCommon API
Leader.LeaderTextVerticalAlignment Property
 Gets or sets the vertical alignment of the leader's text
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextVerticalAlignment LeaderTextVerticalAlignment { get; set; }
Public Property LeaderTextVerticalAlignment As TextVerticalAlignment
	Get
	Set
Property Value
Type: TextVerticalAlignment
See Also
Reference
Leader Class
Rhino.Geometry Namespace