RhinoCommon API
File3dsWriteOptions.SaveViews Property
[Missing <summary> documentation for "P:Rhino.FileIO.File3dsWriteOptions.SaveViews"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SaveViews { get; set; }
Public Property SaveViews As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dsWriteOptions Class
Rhino.FileIO Namespace