RhinoCommon API
LightTableEventArgs.NewState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTableEventArgs.NewState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public LightObject NewState { get; }
Public ReadOnly Property NewState As LightObject
	Get
Property Value
Type: LightObject
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace