RhinoCommon API
NurbsCurve.HasBezierSpans Property
 Returns true if the NURBS curve has Bezier spans (all distinct knots have multiplicity = degree)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool HasBezierSpans { get; }
Public ReadOnly Property HasBezierSpans As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace