RhinoCommon API
SubDEdge.VertexTo Property
 End vertex for this edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDVertex VertexTo { get; }
Public ReadOnly Property VertexTo As SubDVertex
	Get
Property Value
Type: SubDVertex
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace