RhinoCommon API
HostUtils.RunningInNetFramework Property
 Tests if this process is currently executing under the .NET Framework runtime.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool RunningInNetFramework { get; }
Public Shared ReadOnly Property RunningInNetFramework As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace