RhinoCommon API
Instance.Material Property
 The material for this instance.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RenderMaterial Material { get; set; }
Public Property Material As RenderMaterial
	Get
	Set
Property Value
Type: RenderMaterial
See Also
Reference
Instance Class
Rhino.Render.CustomRenderMeshes Namespace