RhinoCommon API
ObjectPropertiesPageEventArgs.DocRuntimeSerialNumber Property
 Document containing the objects and views
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint DocRuntimeSerialNumber { get; }
Public ReadOnly Property DocRuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace