RhinoCommon API
CursorTooltipSettingsState.TextColor Property
Tooltip text color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color TextColor { get; set; }
Public Property TextColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace