RhinoCommon API
MappingChannel.Local Property
 Local transform for the mapping
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Transform Local { get; }
Public ReadOnly Property Local As Transform
	Get
Property Value
Type: Transform
See Also
Reference
MappingChannel Class
Rhino.Render.ChangeQueue Namespace