RhinoCommon API
OrdinateDimension.LeaderPoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.OrdinateDimension.LeaderPoint"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point2d LeaderPoint { get; set; }
Public Property LeaderPoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace