RhinoCommon API
NurbsCurveFitParameters.SmoothingIntensity Property
 Smoothing penalty used to make triples of consecutive control polygon points colinear. Use SmoothingCoefficient() to convert this enum to the the value passed to the optimizer.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public NurbsCurveFitParameters.Intensity SmoothingIntensity { get; set; }
Public Property SmoothingIntensity As NurbsCurveFitParameters.Intensity
	Get
	Set
Property Value
Type: NurbsCurveFitParameters.Intensity
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace