RhinoCommon API
Mesh.SingleMesh Property
 Get the single mesh.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Mesh SingleMesh { get; }
Public ReadOnly Property SingleMesh As Mesh
	Get
Property Value
Type: Mesh
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace