RhinoCommon API
DisplayPipelineAttributes.ShowMeshNonmanifoldEdges Property
 Display mesh manifold edges on/off
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ShowMeshNonmanifoldEdges { get; set; }
Public Property ShowMeshNonmanifoldEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace