RhinoCommon API
StringWrapper.NonConstPointer Property
 Gets the non-constant pointer (ON_wString*).
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IntPtr NonConstPointer { get; }
Public ReadOnly Property NonConstPointer As IntPtr
	Get
Return Value
Type: IntPtr
The non-constant pointer.
See Also
Reference
StringWrapper Class
Rhino.Runtime.InteropWrappers Namespace