RhinoCommon API
ToolbarFileCollection.Item Property
 Gets an open toolbar file by index.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ToolbarFile this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As ToolbarFile
	Get
Parameters
index
Type: System.Int32
The index of the toolar file.
Return Value
Type: ToolbarFile
The toolbar if successful, null otherwise.
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace