RhinoCommon API
DimensionStyle.Roundoff Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.Roundoff"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Roundoff { get; set; }
Public Property Roundoff As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace