RhinoCommon API
FileGltfWriteOptions.DracoCompressionLevel Property
 The level of compression used by draco in the range of 1 to 10 inclusive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public int DracoCompressionLevel { get; set; }
Public Property DracoCompressionLevel As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace