RhinoCommon API
ViewEnableDrawingEventArgs.DrawingEnabled Property
 True if drawing is enabled, false otherwise.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public bool DrawingEnabled { get; }
Public ReadOnly Property DrawingEnabled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ViewEnableDrawingEventArgs Class
Rhino.Display Namespace