RhinoCommon API
Brep.VariationalPatchResult.G1 Property
 This value will be not-null if any tangential (G1) constraints were used. It will be true if those constraints were met within the angle tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool? G1 { get; }
Public ReadOnly Property G1 As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
See Also
Reference
Brep.VariationalPatchResult Class
Rhino.Geometry Namespace