RhinoCommon API
ModelAidSettings.OnlySnapToSelected Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettings.OnlySnapToSelected"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool OnlySnapToSelected { get; set; }
Public Shared Property OnlySnapToSelected As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace