RhinoCommon API
Text3d.HorizontalAlignment Property
 Horizontal alignment that this Text3d is drawn with
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public TextHorizontalAlignment HorizontalAlignment { get; set; }
Public Property HorizontalAlignment As TextHorizontalAlignment
	Get
	Set
Property Value
Type: TextHorizontalAlignment
See Also
Reference
Text3d Class
Rhino.Display Namespace