RhinoCommon API
FileDwgWriteOptions.ColorMethod Property
pallette index: clrACI, RGB: clrRGB
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileDwgWriteOptions.ColorMethodType ColorMethod { get; set; }
Public Property ColorMethod As FileDwgWriteOptions.ColorMethodType
	Get
	Set
Property Value
Type: FileDwgWriteOptions.ColorMethodType
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace