RhinoCommon API
RenderContent.IsLocked Property
 Set this property to true prior to adding content to the document to lock the content browser editing UI methods. Setting this to true will keep the browser from allowing things like deleting, renaming or changing content. This is useful for custom child content that you want to be editable but persistent. Setting this after adding content to the document will cause an exception to be thrown.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.12
Syntax
public bool IsLocked { get; set; }
Public Property IsLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
Exceptions
Exception | Condition
Exception |  IsLocked must be called prior to adding content to the document
See Also
Reference
RenderContent Class
Rhino.Render Namespace