RhinoCommon API
DisplayPipelineAttributes.ShowSubDCreases Property
 Set visibility of SubD creased edges.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public bool ShowSubDCreases { get; set; }
Public Property ShowSubDCreases As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace