RhinoCommon API
RhinoObjectAnalysisModeChangedEventArgs.Enabled Property
 True if the visual analysis mode was enabled, false otherwise.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Enabled { get; }
Public ReadOnly Property Enabled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoObjectAnalysisModeChangedEventArgs Class
Rhino.DocObjects Namespace