RhinoCommon API
PhysicallyBasedMaterial.Specular Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.Specular"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double Specular { get; set; }
Public Property Specular As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace