RhinoCommon API
SubD.TextureCoordinateType Property
 Gets the texture cordinate type.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.28
Syntax
public SubDTextureCoordinateType TextureCoordinateType { get; }
Public ReadOnly Property TextureCoordinateType As SubDTextureCoordinateType
	Get
Property Value
Type: SubDTextureCoordinateType
See Also
Reference
SubD Class
Rhino.Geometry Namespace