RhinoCommon API
DocumentEventArgs.DocumentSerialNumber Property
 Gets the unique document serial number for this event
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint DocumentSerialNumber { get; }
Public ReadOnly Property DocumentSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
DocumentEventArgs Class
Rhino Namespace