RhinoCommon API
NullField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public bool Value { get; set; }
Public Property Value As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
NullField Class
Rhino.Render.Fields Namespace