RhinoCommon API
MeshInstance.AncestryRecord.ReferenceId Property
 The ModelObjectId of the InstanceObject
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
public Guid ReferenceId { get; }
Public ReadOnly Property ReferenceId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
MeshInstance.AncestryRecord Class
Rhino.Render.ChangeQueue Namespace