RhinoCommon API
FileEpsReadOptions.RhinoScale Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileEpsReadOptions.RhinoScale"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double RhinoScale { get; set; }
Public Property RhinoScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileEpsReadOptions Class
Rhino.FileIO Namespace