RhinoCommon API
SafeFrame.FieldsOn Property
 Show the 4 by 3 field grid in the safe-frame.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public bool FieldsOn { get; set; }
Public Property FieldsOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SafeFrame Class
Rhino.Render Namespace