RhinoCommon API
CursorTooltipSettingsState.DistancePane Property
 Displays the distance from the last picked point.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool DistancePane { get; set; }
Public Property DistancePane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace