RhinoCommon API
FileSettings.PrefillExportFileName Property
 Gets or sets a value that controls whether the Export command fills in the file name. When enabled, the file dialog starts out with the model's name in the last used export folder, made unique with a number suffix if that file already exists. When disabled, the file name starts out empty.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool PrefillExportFileName { get; set; }
Public Shared Property PrefillExportFileName As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace