RhinoCommon API
CommandEventArgs.CommandIsHiddenFromUser Property
 Returns true if the command that raised this event is hidden from the user; that is it doesn't autocomplete on the command line.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool CommandIsHiddenFromUser { get; }
Public ReadOnly Property CommandIsHiddenFromUser As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace