RhinoCommon API
DisplayPipelineAttributes.ShowGrips Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ShowGrips"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ShowGrips { get; set; }
Public Property ShowGrips As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace