RhinoCommon API
CursorTooltipSettings.CommandPromptPane Property
 Displays the current command prompt.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool CommandPromptPane { get; set; }
Public Shared Property CommandPromptPane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace