RhinoCommon API
GripObject.Owner Property
 The object these grips belong to.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject Owner { get; }
Public ReadOnly Property Owner As RhinoObject
	Get
Property Value
Type: RhinoObject
Remarks
 Reaches the owner without the document lookup OwnerId would need, so EnabledGripsId and EditPointGripsOn are one hop from a grip.
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace