RhinoCommon API
AppearanceSettingsState.ViewportTabsVisibleAtStart Property
 Display viewport tabs at start
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ViewportTabsVisibleAtStart { get; set; }
Public Property ViewportTabsVisibleAtStart As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace