RhinoCommon API
TransformObjectList.DisplayFeedbackEnabled Property
[Missing <summary> documentation for "P:Rhino.Collections.TransformObjectList.DisplayFeedbackEnabled"]
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool DisplayFeedbackEnabled { get; set; }
Public Property DisplayFeedbackEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace