RhinoCommon API
MeshCurveIntersection.CurveParameterTolerance Property
Certified half-width on each curve parameter slot.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double CurveParameterTolerance { get; }
Public ReadOnly Property CurveParameterTolerance As Double
	Get
Property Value
Type: Double
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace