RhinoCommon API
DisplayPipelineAttributes.ShowClipIntersectionEdges Property
Show edges and hatches where clipping planes clip objects
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ShowClipIntersectionEdges { get; set; }
Public Property ShowClipIntersectionEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace