RhinoCommon API
GrasshopperDisplayMaterial.StripeContrast Property
 Gets or sets the stripe contrast (used only when Striping is true). The effective range is 0..0.9; higher values are clamped, and 0 means no visible striping. Default: 1.0.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double StripeContrast { get; set; }
Public Property StripeContrast As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GrasshopperDisplayMaterial Class
Rhino.Display Namespace