RhinoCommon API
MeshDisplacementInfo.PostWeldAngle Property
 Specifies the maximum angle between face normals of adjacent faces that will get welded together.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double PostWeldAngle { get; set; }
Public Property PostWeldAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace