RhinoCommon API
FileIgsWriteOptions.IgesStringType Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.IgesStringType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileIgsWriteOptions.IgesStringTypeMode IgesStringType { get; set; }
Public Property IgesStringType As FileIgsWriteOptions.IgesStringTypeMode
	Get
	Set
Property Value
Type: FileIgsWriteOptions.IgesStringTypeMode
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace