RhinoCommon API
RhinoList<T>.Capacity Property
 Gets or sets the total number of elements the internal data structure can hold without resizing.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Capacity { get; set; }
Public Property Capacity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace