RhinoCommon API
ModelAidSettings.AutoGumballEnabled Property
 When AutoGumball is on, a gumball automatically appears when objects are pre-picked.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool AutoGumballEnabled { get; set; }
Public Shared Property AutoGumballEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace