RhinoCommon API
OptionsDialogPage.OptionsPageType Property
 17 March 2021 John Morse For internal use in determining the page type. RhinoMac uses this to ensure pages are sized properly when hosting them.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public OptionsDialogPage.PageType OptionsPageType { get; }
Public ReadOnly Property OptionsPageType As OptionsDialogPage.PageType
	Get
Property Value
Type: OptionsDialogPage.PageType
See Also
Reference
OptionsDialogPage Class
Rhino.UI Namespace