RhinoCommon API
FileReadOptions.BatchMode Property
 true means you cannot ask questions during reading. (no dialogs, no "getters", etc.)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool BatchMode { get; set; }
Public Property BatchMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace