RhinoCommon API
PlaneSurface.Plane Property
 Gets or sets the plane surface's plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
PlaneSurface Class
Rhino.Geometry Namespace