RhinoCommon API
DisplayPipelineAttributes.LightingScheme Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.LightingScheme"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public DisplayPipelineAttributes.LightingSchema LightingScheme { get; set; }
Public Property LightingScheme As DisplayPipelineAttributes.LightingSchema
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.LightingSchema
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace