RhinoCommon API
SubDEdge.RelativeVertexFrom Property
 The vertex this edge starts at, taking ComponentDirection into account. This is VertexFrom for an edge in its natural orientation and VertexTo for a reversed one.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDVertex RelativeVertexFrom { get; }
Public ReadOnly Property RelativeVertexFrom As SubDVertex
	Get
Property Value
Type: SubDVertex
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace