RhinoCommon API
MeshCurveIntersection.IsPoint Property
True if this event is an isolated crossing.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsPoint { get; }
Public ReadOnly Property IsPoint As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace