RhinoCommon API
NurbsSurfaceKnotList.KnotStyle Property
 Gets the style of the knot vector.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public KnotStyle KnotStyle { get; }
Public ReadOnly Property KnotStyle As KnotStyle
	Get
Property Value
Type: KnotStyle
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace