RhinoCommon API
ICollapsibleSection.ViewModelId Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.ViewModelId"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
Guid ViewModelId { get; }
ReadOnly Property ViewModelId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace