RhinoCommon API
CommonObject.IsValid Property
Tests an object to see if it is valid.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual bool IsValid { get; }
Public Overridable ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace