RhinoCommon API
DimensionStyle.AlternatePrefix Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternatePrefix"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string AlternatePrefix { get; set; }
Public Property AlternatePrefix As String
	Get
	Set
Property Value
Type: String
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace