RhinoCommon API
DimensionStyle.LeaderCurveType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderCurveType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.LeaderCurveStyle LeaderCurveType { get; set; }
Public Property LeaderCurveType As DimensionStyle.LeaderCurveStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderCurveStyle
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace