RhinoCommon API
File3dmRenderContent.Tags Property
The content's tags.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string Tags { get; }
Public ReadOnly Property Tags As String
	Get
Property Value
Type: String
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace