RhinoCommon API
HatchPattern.FillType Property
 Gets the pattern's fill type.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public HatchPatternFillType FillType { get; set; }
Public Property FillType As HatchPatternFillType
	Get
	Set
Property Value
Type: HatchPatternFillType
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace