RhinoCommon API
Unroller.ExplodeOutput Property
 Gets or sets a value determining whether geometry should be exploded.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ExplodeOutput { get; set; }
Public Property ExplodeOutput As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Unroller Class
Rhino.Geometry Namespace