RhinoCommon API
FileIgsWriteOptions.EolType Property
IGES files are ASCII files. You need to specify the flavor of the ASCII end of line marker.Possibilities are: TL_LF: line feed (unix) TL_CRLF: carriage return, line feed (Microsoft) TL_CR: carriage return (Apple)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileIgsWriteOptions.EolMode EolType { get; set; }
Public Property EolType As FileIgsWriteOptions.EolMode
	Get
	Set
Property Value
Type: FileIgsWriteOptions.EolMode
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace