RhinoCommon API
NurbsCurveFitParameters.PeriodicControlPointCount Property
 Number of total control points if the NURBS curve will be periodic. This number is >= PointCount() and includes periodic duplicates.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PeriodicControlPointCount { get; }
Public ReadOnly Property PeriodicControlPointCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace