RhinoCommon API
DisplayPipelineAttributes.ControlPolygonShowPoints Property
 Shows the control points while the control polygon is displayed.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ControlPolygonShowPoints { get; set; }
Public Property ControlPolygonShowPoints As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace