RhinoCommon API
ClippingPlane.ViewIds Property
 Get list of Viewport IDs this clipping plane is supposed to clip.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public List<Guid> ViewIds { get; }
Public ReadOnly Property ViewIds As List(Of Guid)
	Get
Property Value
Type: List<Guid>
See Also
Reference
ClippingPlane Class
Rhino.Render.ChangeQueue Namespace