RhinoCommon API
DisplayPipelineAttributes.DisableTransparency Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.DisableTransparency"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool DisableTransparency { get; set; }
Public Property DisableTransparency As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace