RhinoCommon API
DisplayPen.ThicknessSpace Property
 Coordinate system for the pen's thickness
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public CoordinateSystem ThicknessSpace { get; set; }
Public Property ThicknessSpace As CoordinateSystem
	Get
	Set
Property Value
Type: CoordinateSystem
See Also
Reference
DisplayPen Class
Rhino.Display Namespace