RhinoCommon API
MatchSrfSettings.Continuity Property
 Match the shape of the edge being edited to the target edge C0_continuous: edge position only G1_continuous: edge position and tangency G2_continuous: edge position, tangency and curvature
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public Continuity Continuity { get; }
Public ReadOnly Property Continuity As Continuity
	Get
Property Value
Type: Continuity
See Also
Reference
MatchSrfSettings Class
Rhino.Geometry Namespace