RhinoCommon API
NurbsCurveFitParameters.KinkAngleDegrees Property
 The angle, in degrees, used to determine if when an abrupt change in tangent or curvature vector direction is a kink.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double KinkAngleDegrees { get; set; }
Public Property KinkAngleDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace