RhinoCommon API
Mesh.OcsTransform Property
 OCS Transform for the MeshInstance - this is the Object Coordinate System texture mapping transformation set in the texture mapping properties dialog. (identity means no OCS, potentially just simple WCS/WCS Box)
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Transform OcsTransform { get; }
Public ReadOnly Property OcsTransform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace