RhinoCommon API
PlugIn.Name Property
 Returns the name of the plug-in, as found in the plug-in's assembly attributes.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace