RhinoCommon API
Sun.Intensity Property
 Sun intensity.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double Intensity { get; set; }
Public Property Intensity As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Sun Class
Rhino.Render Namespace