RhinoCommon API
GetTorus.VerticalDirectionCount Property
 The number of faces in the vertical direction.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int VerticalDirectionCount { get; set; }
Public Property VerticalDirectionCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GetTorus Class
Rhino.Input.Custom Namespace