RhinoCommon API
BezierCurve.Dimension Property
 Dimension of Bezier
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public int Dimension { get; }
Public ReadOnly Property Dimension As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace