RhinoCommon API
File3dmHatchPatternTable.ComponentType Property
 Returns HatchPattern.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
See Also
Reference
File3dmHatchPatternTable Class
Rhino.FileIO Namespace