RhinoCommon API
Arc.Unset Property
 Gets an Arc with Unset components.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Arc Unset { get; }
Public Shared ReadOnly Property Unset As Arc
	Get
Property Value
Type: Arc
See Also
Reference
Arc Structure
Rhino.Geometry Namespace