RhinoCommon API
ContentUuids.DefaultMaterialInstance Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.DefaultMaterialInstance"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid DefaultMaterialInstance { get; }
Public Shared ReadOnly Property DefaultMaterialInstance As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace