RhinoCommon API
FileSettingsState.FileLockingEnabled Property
Ensures that only one person at a time can have a file open for saving.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool FileLockingEnabled { get; set; }
Public Property FileLockingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace