RhinoCommon API
Dimension.ToleranceResolution Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ToleranceResolution"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int ToleranceResolution { get; set; }
Public Property ToleranceResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Dimension Class
Rhino.Geometry Namespace