RhinoCommon API
AnnotationBase.DimensionScale Property
 Gets or sets the dimension scale
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double DimensionScale { get; set; }
Public Property DimensionScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace