RhinoCommon API
PlugInInfo.Description Property
 Returns the plug-in's description.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace