RhinoCommon API
RenderContent.RenderHash Property
 Render hash for the content hierarchy. It iterates over children and includes a caching mechanism which means the hash value can be retrieved quickly if it hasn't changed. The cache is invalidated when Changed() is called. You can override the CalculateRenderHash(UInt64) method to provide a custom hash value.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint RenderHash { get; }
Public ReadOnly Property RenderHash As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RenderContent Class
Rhino.Render Namespace