RhinoCommon API
GetTransform.Transform Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetTransform.Transform"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Transform Transform { get; set; }
Public Property Transform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace