RhinoCommon API
Point3d.Unset Property
 Gets the value of a point at location RhinoMath.UnsetValue,RhinoMath.UnsetValue,RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Point3d Unset { get; }
Public Shared ReadOnly Property Unset As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace