RhinoCommon API
RhinoView.ClientRectangle Property
 Gets the rectangle that represents the client area of the view.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Rectangle ClientRectangle { get; }
Public ReadOnly Property ClientRectangle As Rectangle
	Get
Property Value
Type: Rectangle
See Also
Reference
RhinoView Class
Rhino.Display Namespace