RhinoCommon API
SubDEdge.Tag Property
 identifies the type of subdivision edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDEdgeTag Tag { get; set; }
Public Property Tag As SubDEdgeTag
	Get
	Set
Property Value
Type: SubDEdgeTag
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace