RhinoCommon API
FileFbxWriteOptions.SaveLights Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileFbxWriteOptions.SaveLights"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SaveLights { get; set; }
Public Property SaveLights As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileFbxWriteOptions Class
Rhino.FileIO Namespace