RhinoCommon API
Light.Length Property
 Gets or sets the height in linear and rectangular lights.
(ignored for non-linear/rectangular lights.)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d Length { get; set; }
Public Property Length As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
Light Class
Rhino.Geometry Namespace