RhinoCommon API
Transform.RigidType Property
 Gets a value indicating whether or not the Transform is rigid. A rigid transformation can be broken into a proper rotation and a translation, while an isometry transformation could also include a reflection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public TransformRigidType RigidType { get; }
Public ReadOnly Property RigidType As TransformRigidType
	Get
Property Value
Type: TransformRigidType
See Also
Reference
Transform Structure
Rhino.Geometry Namespace