RhinoCommon API
MarkupTable.Count Property
 Returns number of markups in the table, including deleted markups.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
MarkupTable Class
Rhino.DocObjects.Tables Namespace