RhinoCommon API
InstanceDefinitionGeometry.SourceArchiveRelativePath Property
 Gets the source archive path for linked instance definitions relative to the file that contains this definition. Empty if the definition is not linked or no relative path is stored.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string SourceArchiveRelativePath { get; }
Public ReadOnly Property SourceArchiveRelativePath As String
	Get
Property Value
Type: String
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace