RhinoCommon API
Font.PointSize Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.PointSize"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double PointSize { get; }
Public ReadOnly Property PointSize As Double
	Get
Property Value
Type: Double
See Also
Reference
Font Class
Rhino.DocObjects Namespace