RhinoCommon API
RenderSettings.UseViewportSize Property
 Gets or sets a value indicating whether to use the resolution of the viewport being rendered or ImageSize when rendering
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool UseViewportSize { get; set; }
Public Property UseViewportSize As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderSettings Class
Rhino.Render Namespace