RhinoCommon API
GumballSettingsState.XAxisColor Property
 Specifies the gumball x axis color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color XAxisColor { get; set; }
Public Property XAxisColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace