RhinoCommon API
FileWriteOptions.Rhino3dmVersion Property
 Returns the version of the saved Rhino file 0: The file type is non-3dm file identified by FileTypeId() and FileTypeIndex(). >= 2: The file type is a 3dm file and the number specifies the earliest version of Rhino that will be able to read the 3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Rhino3dmVersion { get; }
Public ReadOnly Property Rhino3dmVersion As Integer
	Get
Property Value
Type: Int32
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace