RhinoCommon API
File3dmSettings.AnalysisMeshingParameters Property
The meshing parameters used for analysis meshes (curvature, draft angle, ...).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public MeshingParameters AnalysisMeshingParameters { get; set; }
Public Property AnalysisMeshingParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace