RhinoCommon API
ContentUuids.GemMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.GemMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid GemMaterialType { get; }
Public Shared ReadOnly Property GemMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace