RhinoCommon API
SoftTransformSettingsState.CvCountU Property
 Controls the number of control vertices affected by soft transform for surfaces in the U direction.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int CvCountU { get; set; }
Public Property CvCountU As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SoftTransformSettingsState Class
Rhino.ApplicationSettings Namespace