RhinoCommon API
CursorTooltipSettings.EnableGumballToolTips Property
 Turns on/off gumball tooltips
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool EnableGumballToolTips { get; set; }
Public Shared Property EnableGumballToolTips As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace