RhinoCommon API
AppearanceSettings.CommandPromptTextColor Property
 Gets or sets the color of the command prompt text.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color CommandPromptTextColor { get; set; }
Public Shared Property CommandPromptTextColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace