RhinoCommon API
PhysicallyBasedMaterial.SheenTint Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.SheenTint"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double SheenTint { get; set; }
Public Property SheenTint As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace