RhinoCommon API
VisualAnalysisMode.RhinoEndAnalysisModeId Property
 Id for Rhino's built-in End analysis mode.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Guid RhinoEndAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoEndAnalysisModeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace