RhinoCommon API
SubDEdgeSharpness.IsConstant Property
 Gets true if both ends have the same valid sharpness value. Crease and Nan are both false; see IsConstantOrCrease.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool IsConstant { get; }
Public ReadOnly Property IsConstant As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace