RhinoCommon API
CursorTooltipSettings.DistancePane Property
 Displays the distance from the last picked point.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool DistancePane { get; set; }
Public Shared Property DistancePane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace