RhinoCommon API
MeshCurveIntersection.CurveParameter Property
Curve parameter range of the hit.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Interval CurveParameter { get; }
Public ReadOnly Property CurveParameter As Interval
	Get
Property Value
Type: Interval
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace