RhinoCommon API
ToolbarGroup.IsDocked Property
 Returns true if the toolbar group is docked.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsDocked { get; }
Public ReadOnly Property IsDocked As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ToolbarGroup Class
Rhino.UI Namespace