RhinoCommon API
FileGltfWriteOptions.ExportVertexNormals Property
 Enable/disable the exporting of vertex normals
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public bool ExportVertexNormals { get; set; }
Public Property ExportVertexNormals As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace