RhinoCommon API
FileDwgWriteOptions.ExportSurfacesAs Property
Rhino surcaces as meshes(0) or curves(1) or acis(2)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileDwgWriteOptions.ExportSurfaceMode ExportSurfacesAs { get; set; }
Public Property ExportSurfacesAs As FileDwgWriteOptions.ExportSurfaceMode
	Get
	Set
Property Value
Type: FileDwgWriteOptions.ExportSurfaceMode
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace