RhinoCommon API
CurvatureGraphSettings.HairDensity Property
 Gets or sets the hair density;
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static int HairDensity { get; set; }
Public Shared Property HairDensity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
CurvatureGraphSettings Class
Rhino.ApplicationSettings Namespace