RhinoCommon API
CullObjectEventArgs.CullObject Property
[Missing <summary> documentation for "P:Rhino.Display.CullObjectEventArgs.CullObject"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public bool CullObject { get; set; }
Public Property CullObject As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CullObjectEventArgs Class
Rhino.Display Namespace