RhinoCommon API
ManifestTable.Count Property
 Total number of items in the manifest, including deleted items.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
IReadOnlyCollection<T>.Count
ICollection<T>.Count
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace