RhinoCommon API
CustomRenderContentAttribute.Category Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.Category"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Category { get; set; }
Public Property Category As String
	Get
	Set
Property Value
Type: String
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace