RhinoCommon API
ClippingPlane.IsEnabled Property
 True if clipping plane is enabled
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsEnabled { get; }
Public ReadOnly Property IsEnabled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ClippingPlane Class
Rhino.Render.ChangeQueue Namespace