RhinoCommon API
ChooseOneObjectSettings.ShowObjectColor Property
ShowObjectColor
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool ShowObjectColor { get; set; }
Public Shared Property ShowObjectColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace