RhinoCommon API
RuiUpdateUi.Enabled Property
Set to true to enable menu item or false to disable menu item
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace