RhinoCommon API
ViewCaptureSettings.Resolution Property
Capture "density" in dots per inch.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Resolution { get; set; }
Public Property Resolution As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace