RhinoCommon API
ThumbData.InUse Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.InUse"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool InUse { get; set; }
Public Property InUse As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace