RhinoCommon API
MeshFace.D Property
 Gets or sets the fourth corner index of the mesh face. If D equals C, the mesh face is considered to be a triangle rather than a quad.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int D { get; set; }
Public Property D As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace