RhinoCommon API
ViewCapture.Width Property
 Width of capture in Pixels
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Width { get; set; }
Public Property Width As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ViewCapture Class
Rhino.Display Namespace