RhinoCommon API
BrepEdge.ProxyBrepSubDEdgeId Property
 If this edge is part of a brep created by SubD.ProxyBrep(), then the subd component id of the corresponding SubD edge is returned. Otherwise 0 is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.19
Syntax
public uint ProxyBrepSubDEdgeId { get; }
Public ReadOnly Property ProxyBrepSubDEdgeId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace