RhinoCommon API
SurfaceCurvature.IsUnset Property
 True if either of kappa1 or kappa2 is not a valid finite value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsUnset { get; }
Public ReadOnly Property IsUnset As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace