RhinoCommon API
FileDwgWriteOptions.UseColor Property
Set AutoCAD display color with Rhino print or display color
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public FileDwgWriteOptions.UseColorType UseColor { get; set; }
Public Property UseColor As FileDwgWriteOptions.UseColorType
	Get
	Set
Property Value
Type: FileDwgWriteOptions.UseColorType
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace