RhinoCommon API
HatchPattern.IsReference Property
 Rhino allows multiple files to be viewed simultaneously. Hatch patterns in the document are "normal" or "reference". Reference hatch patterns are not saved.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override bool IsReference { get; }
Public Overrides ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace