RhinoCommon API
Decal.Projection Property
 Gets the decal's projection. Used only when mapping is planar.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public DecalProjection Projection { get; set; }
Public Property Projection As DecalProjection
	Get
	Set
Property Value
Type: DecalProjection
See Also
Reference
Decal Class
Rhino.Render Namespace