RhinoCommon API
DisplayPipelineAttributes.GridPlaneColor Property
 The color of the grid plane
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public Color GridPlaneColor { get; set; }
Public Property GridPlaneColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace