RhinoCommon API
HatchPattern.Defaults.Hatch1 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Defaults.Hatch1"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static HatchPattern Hatch1 { get; }
Public Shared ReadOnly Property Hatch1 As HatchPattern
	Get
Property Value
Type: HatchPattern
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace