RhinoCommon API
FileObjWriteOptions.ExportNormals Property
 Enable/disable export of vertex normals, if they exist.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ExportNormals { get; set; }
Public Property ExportNormals As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace