RhinoCommon API
Texture.WrapU Property
 Texture wrapping mode in the U direction
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public TextureUvwWrapping WrapU { get; set; }
Public Property WrapU As TextureUvwWrapping
	Get
	Set
Property Value
Type: TextureUvwWrapping
See Also
Reference
Texture Class
Rhino.DocObjects Namespace