RhinoCommon API
GetCone.BaseAngleDegrees Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCone.BaseAngleDegrees"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double BaseAngleDegrees { get; set; }
Public Property BaseAngleDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace