RhinoCommon API
CommandAlias.Macro Property
 Macro to run when an alias is input
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Macro { get; set; }
Public Property Macro As String
	Get
	Set
Property Value
Type: String
See Also
Reference
CommandAlias Class
Rhino.ApplicationSettings Namespace