RhinoCommon API
ChooseOneObjectSettingsState.ShowObjectName Property
ShowObjectName
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ShowObjectName { get; set; }
Public Property ShowObjectName As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace