RhinoCommon API
SubDEdgeSharpness.IsCreaseOrSharp Property
 Gets (IsCrease || IsSharp).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool IsCreaseOrSharp { get; }
Public ReadOnly Property IsCreaseOrSharp As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace