RhinoCommon API
UndoRedoEventArgs.IsBeforeBeginRecording Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsBeforeBeginRecording"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsBeforeBeginRecording { get; }
Public ReadOnly Property IsBeforeBeginRecording As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace