RhinoCommon API
Material.IndexOfRefraction Property
 Gets or sets the index of refraction of the material, generally >= 1.0 (speed of light in vacuum)/(speed of light in material)
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public double IndexOfRefraction { get; set; }
Public Property IndexOfRefraction As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Material Class
Rhino.DocObjects Namespace