RhinoCommon API
PageViewSpaceChangeEventArgs.PageView Property
 The page view on which a different detail object was set active.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoPageView PageView { get; }
Public ReadOnly Property PageView As RhinoPageView
	Get
Property Value
Type: RhinoPageView
See Also
Reference
PageViewSpaceChangeEventArgs Class
Rhino.Display Namespace