RhinoCommon API
RhinoApp.Rhino5Id Property
Gets the ID of Rhino 5
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid Rhino5Id { get; }
Public Shared ReadOnly Property Rhino5Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoApp Class
Rhino Namespace