RhinoCommon API
ViewCaptureSettings.ModelScaleType Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.ModelScaleType"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.21
Syntax
public int ModelScaleType { get; set; }
Public Property ModelScaleType As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace