RhinoCommon API
RhinoDoc.Path Property
Returns the path of the currently loaded Rhino document (3DM file).
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Path { get; }
Public ReadOnly Property Path As String
	Get
Property Value
Type: String
See Also
Reference
RhinoDoc Class
Rhino Namespace