RhinoCommon API
File3dmDisplacement.Fairing Property
 Specifies the number of steps for the fairing process. Fairing straightens rough feature edges.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int Fairing { get; set; }
Public Property Fairing As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace