RhinoCommon API
DisplayRenderSettings.SceneLightingOn Property
 True if scene lighting is enabled
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SceneLightingOn { get; }
Public ReadOnly Property SceneLightingOn As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayRenderSettings Class
Rhino.Render.ChangeQueue Namespace