RhinoCommon API
StringParserSettings.ParseFullStopAsDigitSeparator Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseFullStopAsDigitSeparator"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseFullStopAsDigitSeparator { get; set; }
Public Property ParseFullStopAsDigitSeparator As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace