RhinoCommon API
SubDComponent.Id Property
 Unique id within the parent SubD for this item
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public uint Id { get; }
Public ReadOnly Property Id As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace