RhinoCommon API
FileIgsWriteOptions.Tolerance Property
In model space units specified above
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double Tolerance { get; set; }
Public Property Tolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace