RhinoCommon API
AreaMassProperties.Centroid Property
 Gets the area centroid in the world coordinate system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d Centroid { get; }
Public ReadOnly Property Centroid As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace