RhinoCommon API
ConstructionPlaneGridDefaults.ShowGrid Property
Show the grid
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public bool ShowGrid { get; set; }
Public Property ShowGrid As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ConstructionPlaneGridDefaults Class
Rhino.DocObjects Namespace