RhinoCommon API
Font.Weight Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Weight"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Font.FontWeight Weight { get; }
Public ReadOnly Property Weight As Font.FontWeight
	Get
Property Value
Type: Font.FontWeight
See Also
Reference
Font Class
Rhino.DocObjects Namespace