RhinoCommon API
NamedColor.Name Property
 Gets the name of this color to show to the user.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
NamedColor Class
Rhino.UI Namespace