RhinoCommon API
VisualAnalysisMode.RhinoDraftAngleAnalysisModeId Property
 Id for Rhino's built-in draft angle analysis mode. Draft angle is displayed using false colors.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid RhinoDraftAngleAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoDraftAngleAnalysisModeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace