RhinoCommon API
DimStyleTableEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTableEventArgs.Document"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
DimStyleTableEventArgs Class
Rhino.DocObjects.Tables Namespace