RhinoCommon API
ViewSettingsState.ThreePointPerspectiveLensLength Property
 Gets the three point perspective lens length. The default is 50mm.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.20
Syntax
public double ThreePointPerspectiveLensLength { get; }
Public ReadOnly Property ThreePointPerspectiveLensLength As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace