RhinoCommon API
MeshDisplacementInfo.WhiteMove Property
 The amount of displacement for the white color in the texture.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double WhiteMove { get; set; }
Public Property WhiteMove As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace