RhinoCommon API
Matrix.RowCount Property
 Gets the amount of rows.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int RowCount { get; }
Public ReadOnly Property RowCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Matrix Class
Rhino.Geometry Namespace