RhinoCommon API
LinearWorkflow.PreProcessColors Property
 Linear workflow pre-process colors enabled state.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool PreProcessColors { get; set; }
Public Property PreProcessColors As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace