RhinoCommon API
LengthValue.LengthStringFormat Property
 Returns the StringFormat from this LengthValue
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LengthValue.StringFormat LengthStringFormat { get; }
Public ReadOnly Property LengthStringFormat As LengthValue.StringFormat
	Get
Property Value
Type: LengthValue.StringFormat
See Also
Reference
LengthValue Class
Rhino Namespace