RhinoCommon API
Light.CoordinateSystem Property
 Gets a value, determined by LightStyle, that explains whether the camera directions are relative to World or Camera spaces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public CoordinateSystem CoordinateSystem { get; }
Public ReadOnly Property CoordinateSystem As CoordinateSystem
	Get
Property Value
Type: CoordinateSystem
See Also
Reference
Light Class
Rhino.Geometry Namespace