RhinoCommon API
WorksessionFileModel.LayerOverrideCount Property
 Gets the number of layer overrides. Rhino does not save or use layer overrides for the active model. Version 4 files do not have them.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int LayerOverrideCount { get; }
Public ReadOnly Property LayerOverrideCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace