RhinoCommon API
MeshCurvatureStats.Mode Property
 Get the mode of "finite" values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Mode { get; }
Public ReadOnly Property Mode As Double
	Get
Property Value
Type: Double
See Also
Reference
MeshCurvatureStats Class
Rhino.Geometry Namespace