RhinoCommon API
ThicknessAnalysisSettingsState.DistanceRange Property
 The distance range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Interval DistanceRange { get; set; }
Public Property DistanceRange As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
ThicknessAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace