RhinoCommon API
MeshCurveIntersection.PointA Property
3D point on the curve at the start of the event.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Point3d PointA { get; }
Public ReadOnly Property PointA As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace