RhinoCommon API
BrepEdgeFilletDistance.EdgeParameter Property
 The parameter along the BrepEdge where to apply a fillet distance (radius)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public double EdgeParameter { get; }
Public ReadOnly Property EdgeParameter As Double
	Get
Property Value
Type: Double
See Also
Reference
BrepEdgeFilletDistance Class
Rhino.Geometry Namespace