RhinoCommon API
SubDFace.EdgeCount Property
 Number of edges for this face. Note that EdgeCount is always the same as VertexCount. Two properties are provided simply for clarity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int EdgeCount { get; }
Public ReadOnly Property EdgeCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace