RhinoCommon API
File3dm.ArchiveVersion Property
 Gets the 3dm file archive version.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public int ArchiveVersion { get; }
Public ReadOnly Property ArchiveVersion As Integer
	Get
Property Value
Type: Int32
See Also
Reference
File3dm Class
Rhino.FileIO Namespace