RhinoCommon API
DocumentSaveEventArgs.FileName Property
 Name of file being written.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string FileName { get; }
Public ReadOnly Property FileName As String
	Get
Property Value
Type: String
See Also
Reference
DocumentSaveEventArgs Class
Rhino Namespace