RhinoCommon API
PlugInDescriptionAttribute.DescriptionType Property
[Missing <summary> documentation for "P:Rhino.PlugIns.PlugInDescriptionAttribute.DescriptionType"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DescriptionType DescriptionType { get; }
Public ReadOnly Property DescriptionType As DescriptionType
	Get
Property Value
Type: DescriptionType
See Also
Reference
PlugInDescriptionAttribute Class
Rhino.PlugIns Namespace