RhinoCommon API
DisplayPipelineAttributes.ViewDisplayAttributes.DrawTransparentGridPlane Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes.DrawTransparentGridPlane"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool DrawTransparentGridPlane { get; set; }
Public Property DrawTransparentGridPlane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace