RhinoCommon API
FileDwgWriteOptions.SplitSplines Property
Split splines at FMKs before exporting
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SplitSplines { get; set; }
Public Property SplitSplines As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace