RhinoCommon API
DisplayPipelineAttributes.ControlPolygonHighlight Property
 Highlights the segments of the control polygon on either side of the control points.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ControlPolygonHighlight { get; set; }
Public Property ControlPolygonHighlight As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace