RhinoCommon API
DisplayPipelineAttributes.ShadowsOn Property
 Enable shadows
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ShadowsOn { get; set; }
Public Property ShadowsOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace