RhinoCommon API
ViewSettings.ZoomExtentsPerspectiveViewBorder Property
 Border amount to apply to perspective viewport during zoom extents
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public static double ZoomExtentsPerspectiveViewBorder { get; set; }
Public Shared Property ZoomExtentsPerspectiveViewBorder As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace