RhinoCommon API
ModelAidSettingsState.DigitizerOsnapPickboxRadius Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettingsState.DigitizerOsnapPickboxRadius"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double DigitizerOsnapPickboxRadius { get; set; }
Public Property DigitizerOsnapPickboxRadius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace