RhinoCommon API
ClassIdAttribute.Id Property
 Gets the associated style.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ClassIdAttribute Class
Rhino.DocObjects.Custom Namespace