RhinoCommon API
StringTable.DocumentDataCount Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.StringTable.DocumentDataCount"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int DocumentDataCount { get; }
Public ReadOnly Property DocumentDataCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace