RhinoCommon API
SimulatedEnvironment.BackgroundColor Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedEnvironment.BackgroundColor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Color BackgroundColor { get; set; }
Public Property BackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace