RhinoCommon API
RenderContent.Notes Property
 Notes for this content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public string Notes { get; set; }
Public Property Notes As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RenderContent Class
Rhino.Render Namespace