RhinoCommon API
PlugInInfo.Id Property
 Returns the plug-in's Id.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace