RhinoCommon API
RenderSettings.TransparentBackground Property
 Gets or sets whether rendering should be done with transparent background.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TransparentBackground { get; set; }
Public Property TransparentBackground As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderSettings Class
Rhino.Render Namespace