RhinoCommon API
File3dmRenderContent.Children Property
[Missing <summary> documentation for "P:Rhino.FileIO.File3dmRenderContent.Children"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IEnumerable<File3dmRenderContent> Children { get; }
Public ReadOnly Property Children As IEnumerable(Of File3dmRenderContent)
	Get
Property Value
Type: IEnumerable<File3dmRenderContent>
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace