RhinoCommon API
AngularDimension.ArrowPoint1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.AngularDimension.ArrowPoint1"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point2d ArrowPoint1 { get; }
Public ReadOnly Property ArrowPoint1 As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace