RhinoCommon API
ObjectPropertiesPage.PageControl Property
 The control that represents this page. Rhino Windows supports classes that implement the IWin32Windows interface, are derived from System.Windows.FrameworkElement or Eto.Forms.Control. Mac Rhino supports controls that are derived from NSview or Eto.Forms.Control.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual Object PageControl { get; }
Public Overridable ReadOnly Property PageControl As Object
	Get
Property Value
Type: Object
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace