RhinoCommon API
ViewInfo.NamedViewId Property
 Returns a unique id if this is a named view otherwise an empty Guid.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.28
Syntax
public Guid NamedViewId { get; set; }
Public Property NamedViewId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace