RhinoCommon API
DimensionStyle.TextHorizontalAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextHorizontalAlignment"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextHorizontalAlignment TextHorizontalAlignment { get; set; }
Public Property TextHorizontalAlignment As TextHorizontalAlignment
	Get
	Set
Property Value
Type: TextHorizontalAlignment
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace