RhinoCommon API
Triangle3d.MedianA Property
 Gets the median line starting at corner A.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Line MedianA { get; }
Public ReadOnly Property MedianA As Line
	Get
Property Value
Type: Line
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace