RhinoCommon API
LengthValue.ParseSettings Property
 Parse settings
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public StringParserSettings ParseSettings { get; }
Public ReadOnly Property ParseSettings As StringParserSettings
	Get
Property Value
Type: StringParserSettings
See Also
Reference
LengthValue Class
Rhino Namespace