RhinoCommon API
GumballPickResult.Mode Property
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballPickResult.Mode"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GumballMode Mode { get; }
Public ReadOnly Property Mode As GumballMode
	Get
Property Value
Type: GumballMode
See Also
Reference
GumballPickResult Class
Rhino.UI.Gumball Namespace