RhinoCommon API
IsoDrawEffect.GapSize Property
[Missing <summary> documentation for "P:Rhino.Display.IsoDrawEffect.GapSize"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double GapSize { get; set; }
Public Property GapSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace