RhinoCommon API
FileObjWriteOptions.UnderbarMaterialNames Property
 Enable/disable replacing white space with under-bars in material names.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool UnderbarMaterialNames { get; set; }
Public Property UnderbarMaterialNames As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace