RhinoCommon API
RhinoDoc.PageViewGroups Property
 Collection of markups in this document
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PageViewGroupTable PageViewGroups { get; }
Public ReadOnly Property PageViewGroups As PageViewGroupTable
	Get
Property Value
Type: PageViewGroupTable
See Also
Reference
RhinoDoc Class
Rhino Namespace