RhinoCommon API
ICurrentEnvironment.ForAnyUsage Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment.ForAnyUsage"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("To set all, just set each one individually")]
RenderEnvironment ForAnyUsage { set; }
<ObsoleteAttribute("To set all, just set each one individually")>
WriteOnly Property ForAnyUsage As RenderEnvironment
	Set
Property Value
Type: RenderEnvironment
See Also
Reference
ICurrentEnvironment Interface
Rhino.Render Namespace