RhinoCommon API
IOpenIDConnectToken.Iss Property
 The id of the entity that issued the token.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
string Iss { get; }
ReadOnly Property Iss As String
	Get
Property Value
Type: String
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace