RhinoCommon API
SubDComponent.IsLocked Property
 Returns true if the SubD component is locked.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public bool IsLocked { get; }
Public ReadOnly Property IsLocked As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace