RhinoCommon API
ShrinkWrapParameters.SmoothingIterations Property
 Number of times to apply smoothing
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int SmoothingIterations { get; set; }
Public Property SmoothingIterations As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ShrinkWrapParameters Class
Rhino.Geometry Namespace