RhinoCommon API
GroundPlane.TextureRotation Property
 Get texture rotation on the ground plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double TextureRotation { get; }
Public ReadOnly Property TextureRotation As Double
	Get
Property Value
Type: Double
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace