RhinoCommon API
FileIgsWriteOptions.WriteNonPlanarUnitNormal Property
true means the UnitNormal will be written regardless, even if the curve is non planar
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool WriteNonPlanarUnitNormal { get; set; }
Public Property WriteNonPlanarUnitNormal As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace