RhinoCommon API
LinetypeTableEventArgs.EventType Property
 The event type.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public LinetypeTableEventType EventType { get; }
Public ReadOnly Property EventType As LinetypeTableEventType
	Get
Property Value
Type: LinetypeTableEventType
See Also
Reference
LinetypeTableEventArgs Class
Rhino.DocObjects.Tables Namespace