RhinoCommon API
DisplayPipelineAttributes.DynamicDisplayUsage Property
 Sets the appearance of objects in the display
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public DisplayPipelineAttributes.DynamicDisplayUse DynamicDisplayUsage { get; set; }
Public Property DynamicDisplayUsage As DisplayPipelineAttributes.DynamicDisplayUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.DynamicDisplayUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace