RhinoCommon API
AnnotationBase.DrawForward Property
 Gets or sets whether the text is oriented towards the reader when viewed from behind
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DrawForward { get; set; }
Public Property DrawForward As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace