RhinoCommon API
ShrinkWrapParameters.TargetEdgeLength Property
 The desired target edge length in document units Smaller values equal more mesh resolution at the expense of larger mesh sizes
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double TargetEdgeLength { get; set; }
Public Property TargetEdgeLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ShrinkWrapParameters Class
Rhino.Geometry Namespace