RhinoCommon API
PlugIn.UnknownUserDataEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.PlugIns.PlugIn.UnknownUserDataEventArgs.Document"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.17
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
PlugIn.UnknownUserDataEventArgs Class
Rhino.PlugIns Namespace