RhinoCommon API
StringParserSettings.ParseSignificandIntegerPart Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseSignificandIntegerPart"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseSignificandIntegerPart { get; set; }
Public Property ParseSignificandIntegerPart As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace