RhinoCommon API
File3dmRenderContent.File3dmParent Property
The parent File3dm of the entire hierarchy.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dm File3dmParent { get; }
Public ReadOnly Property File3dmParent As File3dm
	Get
Property Value
Type: File3dm
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace