RhinoCommon API
AnnotationBase.ParentDimensionStyle Property
 The parent dimension style associated with this annotation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle ParentDimensionStyle { get; set; }
Public Property ParentDimensionStyle As DimensionStyle
	Get
	Set
Property Value
Type: DimensionStyle
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace