RhinoCommon API
Interval.T1 Property
 Gets or sets the upper bound of the Interval.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double T1 { get; set; }
Public Property T1 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Interval Structure
Rhino.Geometry Namespace