RhinoCommon API
File3dm.HatchPatterns Property
Note: This API is now obsolete.
 Hatch patterns in this file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use the new AllHatchPatterns property")]
public IList<HatchPattern> HatchPatterns { get; }
<ObsoleteAttribute("Use the new AllHatchPatterns property")>
Public ReadOnly Property HatchPatterns As IList(Of HatchPattern)
	Get
Property Value
Type: IList<HatchPattern>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace