RhinoCommon API
FileIgsWriteOptions.ClampSurfaceEndKnots Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.ClampSurfaceEndKnots"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ClampSurfaceEndKnots { get; set; }
Public Property ClampSurfaceEndKnots As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace