RhinoCommon API
ComponentFunctionInfo.InputDescriptions Property
 The function input parameter descriptions.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IReadOnlyList<string> InputDescriptions { get; }
Public ReadOnly Property InputDescriptions As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace