RhinoCommon API
DisplayPipelineAttributes.SurfaceIsoShowForFlatFaces Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceIsoShowForFlatFaces"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public bool SurfaceIsoShowForFlatFaces { get; set; }
Public Property SurfaceIsoShowForFlatFaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace