RhinoCommon API
ManifestTable.LongCount Property
 Total number of items in the manifest, including deleted items.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public long LongCount { get; }
Public ReadOnly Property LongCount As Long
	Get
Property Value
Type: Int64
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace