RhinoCommon API
RhinoObject.IsPictureFrame Property
 Returns true if the object is a picture frame. A picture frame object is an object that displays a texture map in all views.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public bool IsPictureFrame { get; }
Public ReadOnly Property IsPictureFrame As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace