RhinoCommon API
ColorStop.Position Property
 Parameter that Color is defined at
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double Position {
	get;
 set; }
Public Property Position As Double
		Get
	Set
Property Value
Type: Double
See Also
Reference
ColorStop Structure
Rhino.Display Namespace