RhinoCommon API
NamedPositionTable.Names Property
Array of Named Position names.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string[] Names { get; }
Public ReadOnly Property Names As String()
	Get
Return Value
Type: String[]
 A string array with the names all Named Positions in the document.
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace