RhinoCommon API
UserInterfaceTextBox.CaretPosition Property
 Where the insertion point sits, as a count of characters from the start of the text. Setting it clamps to the length of the text.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int CaretPosition { get; set; }
Public Property CaretPosition As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace