RhinoCommon API
HostUtils.ComputerSerialNumber Property
 Gets the serial number of the computer running Rhino.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string ComputerSerialNumber { get; }
Public Shared ReadOnly Property ComputerSerialNumber As String
	Get
Property Value
Type: String
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace