RhinoCommon API
StackedDialogPage.EnglishPageTitle Property
 English string used when scripting this page and a user prefixes a command option with "_"
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string EnglishPageTitle { get; }
Public ReadOnly Property EnglishPageTitle As String
	Get
Property Value
Type: String
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace