RhinoCommon API
RhinoDoc.NamedConstructionPlanes Property
 Collection of named construction planes.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public NamedConstructionPlaneTable NamedConstructionPlanes { get; }
Public ReadOnly Property NamedConstructionPlanes As NamedConstructionPlaneTable
	Get
Property Value
Type: NamedConstructionPlaneTable
See Also
Reference
RhinoDoc Class
Rhino Namespace