RhinoCommon API
RhinoList<T>.Count Property
 Gets the number of elements actually contained in the List.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
ICollection.Count
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace