RhinoCommon API
RenderPlugInInfo.PlugInId Property
[Missing <summary> documentation for "P:Rhino.Render.RenderPlugInInfo.PlugInId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid PlugInId { get; set; }
Public Property PlugInId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
RenderPlugInInfo Class
Rhino.Render Namespace