RhinoCommon API
SmartTrackSettings.SmartTangents Property
Gets or sets a value indicating if the 'Smart Tangents' feature is active.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool SmartTangents { get; set; }
Public Shared Property SmartTangents As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace