RhinoCommon API
FileVdaWriteOptions.PointDeviationHairsAsMDI Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVdaWriteOptions.PointDeviationHairsAsMDI"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool PointDeviationHairsAsMDI { get; set; }
Public Property PointDeviationHairsAsMDI As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileVdaWriteOptions Class
Rhino.FileIO Namespace