RhinoCommon API
UserInterfaceTextBox.BackgroundColor Property
 Color the box is filled with. Color.Empty, the default, means use the standard color for the theme that is in use.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color BackgroundColor { get; set; }
Public Property BackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace