RhinoCommon API
RibbonOffsetParameters.RebuildPointCount Property
 Rebuild offset curve with defined number of control points 0 for disabled
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public int RebuildPointCount { get; set; }
Public Property RebuildPointCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RibbonOffsetParameters Class
Rhino.Geometry Namespace