RhinoCommon API
AppearanceSettingsState.ShowLayoutDropShadow Property
 Display the drop shadow of layouts
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ShowLayoutDropShadow { get; set; }
Public Property ShowLayoutDropShadow As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace