RhinoCommon API
CurvatureGraphSettingsState.SurfaceVHairColor Property
 Gets or sets the surface V hair color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Color SurfaceVHairColor { get; set; }
Public Property SurfaceVHairColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
CurvatureGraphSettingsState Class
Rhino.ApplicationSettings Namespace