RhinoCommon API
FileVdaWriteOptions.TelephoneNumber Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVdaWriteOptions.TelephoneNumber"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string TelephoneNumber { get; set; }
Public Property TelephoneNumber As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileVdaWriteOptions Class
Rhino.FileIO Namespace