RhinoCommon API
CustomObjectGrips.GripsMoved Property
 If GripsMoved is true if some of the grips have ever been moved GripObject.NewLocation() sets GripsMoved=true.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool GripsMoved { get; }
Public ReadOnly Property GripsMoved As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace