RhinoCommon API
MeshVertexList.UseDoublePrecisionVertices Property
 Set to true if the vertices should be stored in double precision
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public bool UseDoublePrecisionVertices { get; set; }
Public Property UseDoublePrecisionVertices As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace