RhinoCommon API
PhysicallyBased.Anisotropic Property
[Missing <summary> documentation for "P:Rhino.Render.ParameterNames.PhysicallyBased.Anisotropic"]
 Namespace: Rhino.Render.ParameterNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Anisotropic { get; }
Public Shared ReadOnly Property Anisotropic As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ParameterNames Namespace