RhinoCommon API
DisplayPipelineAttributes.LayersFollowLockUsage Property
 Applies the settings for locked objects to locked layers.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool LayersFollowLockUsage { get; set; }
Public Property LayersFollowLockUsage As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace