RhinoCommon API
HermiteSurface.VCount Property
 Gets the number of parameters in the "v" direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int VCount { get; }
Public ReadOnly Property VCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace