RhinoCommon API
Skylight.Enabled Property
 Return true if skylight is enabled
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Enabled { get; }
Public ReadOnly Property Enabled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Skylight Class
Rhino.Render.ChangeQueue Namespace