RhinoCommon API
SimulatedEnvironment.BackgroundImage Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedEnvironment.BackgroundImage"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public SimulatedTexture BackgroundImage { get; set; }
Public Property BackgroundImage As SimulatedTexture
	Get
	Set
Property Value
Type: SimulatedTexture
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace