RhinoCommon API
RenderContentFieldChangedEventArgs.FieldName Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentFieldChangedEventArgs.FieldName"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public string FieldName { get; }
Public ReadOnly Property FieldName As String
	Get
Property Value
Type: String
See Also
Reference
RenderContentFieldChangedEventArgs Class
Rhino.Render Namespace