RhinoCommon API
Skin.SettingsDirectory Property
 Get the skin's settings directory. This is the directory where the skin's persistent settings files are saved, matching the location used by Settings. Note, this does not verify the directory exists.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string SettingsDirectory { get; }
Public ReadOnly Property SettingsDirectory As String
	Get
Property Value
Type: String
See Also
Reference
Skin Class
Rhino.Runtime Namespace