RhinoCommon API
GeneralSettingsState.ContextMenuDelay Property
 Gets or sets the time to wait before permitting context menu display.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public TimeSpan ContextMenuDelay { get; set; }
Public Property ContextMenuDelay As TimeSpan
	Get
	Set
Property Value
Type: TimeSpan
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace