RhinoCommon API
TextDot.Text Property
 Gets or sets the primary text of the text dot.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
Property Value
Type: String
See Also
Reference
TextDot Class
Rhino.Geometry Namespace