RhinoCommon API
ChooseOneObjectSettings.ShowObjectLayer Property
ShowObjectLayer
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool ShowObjectLayer { get; set; }
Public Shared Property ShowObjectLayer As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace