RhinoCommon API
ModelAidSettings.Planar Property
Gets or sets the enabled state of Rhino's Planar modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool Planar { get; set; }
Public Shared Property Planar As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace