RhinoCommon API
RhinoView.Handle Property
 Gets the window handle that this view is bound to.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IntPtr Handle { get; }
Public ReadOnly Property Handle As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RhinoView Class
Rhino.Display Namespace