RhinoCommon API
RenderContent.Id Property
 Instance identifier for this content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
RenderContent Class
Rhino.Render Namespace