RhinoCommon API
PageSettings.BottomMarginMillimeters Property
Bottom margin in millimeters.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public double BottomMarginMillimeters { get; set; }
Public Property BottomMarginMillimeters As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PageSettings Class
Rhino.DocObjects Namespace