RhinoCommon API
AnnotationBase.DimensionLengthDisplay Property
 Length display units and format
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.LengthDisplay DimensionLengthDisplay { get; set; }
Public Property DimensionLengthDisplay As DimensionStyle.LengthDisplay
	Get
	Set
Property Value
Type: DimensionStyle.LengthDisplay
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace