RhinoCommon API
Triangle3d.PerpendicularAB Property
 Gets the perpendicular bisector for edge AB.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Line PerpendicularAB { get; }
Public ReadOnly Property PerpendicularAB As Line
	Get
Property Value
Type: Line
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace