RhinoCommon API
Triangle3d.AngleA Property
 Gets the angle at the A corner.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public double AngleA { get; }
Public ReadOnly Property AngleA As Double
	Get
Property Value
Type: Double
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace