RhinoCommon API
SmartTrackSettings.PointColor Property
Gets or sets the point color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color PointColor { get; set; }
Public Shared Property PointColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace