RhinoCommon API
LicenseStateChangedEventArgs.CallingRhinoCommonAllowed Property
 true if RhinoCommon calls will never raise Rhino.Runtime.NotLicensedException. false otherwise
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool CallingRhinoCommonAllowed { get; }
Public ReadOnly Property CallingRhinoCommonAllowed As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
LicenseStateChangedEventArgs Class
Rhino.Runtime Namespace