RhinoCommon API
FontQuartet.HasBoldItalicFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.FontQuartet.HasBoldItalicFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public bool HasBoldItalicFont { get; }
Public ReadOnly Property HasBoldItalicFont As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
FontQuartet Class
Rhino.DocObjects Namespace