RhinoCommon API
FileSvgReadOptions.GroupMultiCurvePaths Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSvgReadOptions.GroupMultiCurvePaths"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool GroupMultiCurvePaths { get; set; }
Public Property GroupMultiCurvePaths As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSvgReadOptions Class
Rhino.FileIO Namespace