RhinoCommon API
PanelIds.BoxEdit Property
 Rhino BoxEdit panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.20
Syntax
public static Guid BoxEdit { get; }
Public Shared ReadOnly Property BoxEdit As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace