RhinoCommon API
RenderPrimitiveList.RhinoObject Property
 The Rhino object associated with this list
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public RhinoObject RhinoObject { get; }
Public ReadOnly Property RhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace