RhinoCommon API
GroundPlane.Crc Property
 Get the checksum of this groundplane object
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint Crc { get; }
Public ReadOnly Property Crc As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace