RhinoCommon API
AppearanceSettingsState.GridThinLineColor Property
Gets or sets the color of the thin line in the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color GridThinLineColor { get; set; }
Public Property GridThinLineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace