RhinoCommon API
Brep.FilletSurfaceResults.Face1 Property
 The second face used as input for the fillet surface generation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public BrepFace Face1 { get; }
Public ReadOnly Property Face1 As BrepFace
	Get
Property Value
Type: BrepFace
See Also
Reference
Brep.FilletSurfaceResults Class
Rhino.Geometry Namespace