RhinoCommon API
DecalCreateParams.EndLatitude Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.EndLatitude"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double EndLatitude { get; set; }
Public Property EndLatitude As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace