RhinoCommon API
File3mfWriteOptions.MoveOutputToPositiveXYZOctant Property
[Missing <summary> documentation for "P:Rhino.FileIO.File3mfWriteOptions.MoveOutputToPositiveXYZOctant"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public bool MoveOutputToPositiveXYZOctant { get; set; }
Public Property MoveOutputToPositiveXYZOctant As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3mfWriteOptions Class
Rhino.FileIO Namespace