RhinoCommon API
FileDwgReadOptions.ImportUnreferencedLinetypes Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgReadOptions.ImportUnreferencedLinetypes"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportUnreferencedLinetypes { get; set; }
Public Property ImportUnreferencedLinetypes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgReadOptions Class
Rhino.FileIO Namespace