RhinoCommon API
File3dm.EarthAnchorPoint Property
 If set, this is the model's location on the earth. This information is used when the model is used with GIS information.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public EarthAnchorPoint EarthAnchorPoint { get; set; }
Public Property EarthAnchorPoint As EarthAnchorPoint
	Get
	Set
Property Value
Type: EarthAnchorPoint
See Also
Reference
File3dm Class
Rhino.FileIO Namespace