RhinoCommon API
RhinoDoc.AnimationProperties Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.AnimationProperties"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public AnimationProperties AnimationProperties { get; set; }
Public Property AnimationProperties As AnimationProperties
	Get
	Set
Property Value
Type: AnimationProperties
See Also
Reference
RhinoDoc Class
Rhino Namespace