RhinoCommon API
Transform.M03 Property
Gets or sets this[0,3].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double M03 { get; set; }
Public Property M03 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Transform Structure
Rhino.Geometry Namespace