RhinoCommon API
Brep.FilletSurfaceSettings.Radius Property
 The radius of the fillets
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Radius { get; }
Public ReadOnly Property Radius As Double
	Get
Property Value
Type: Double
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace