RhinoCommon API
IWindow.Created Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IWindow.Created"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool Created { get; }
ReadOnly Property Created As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace