RhinoCommon API
Layer.IsExpanded Property
 Gets or sets a value indicating whether this layer is expanded in the Rhino Layer dialog.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsExpanded { get; set; }
Public Property IsExpanded As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Layer Class
Rhino.DocObjects Namespace