RhinoCommon API
SubDEdgeChain.IsClosedLoop Property
 True when the chain closes back on itself.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool IsClosedLoop { get; }
Public ReadOnly Property IsClosedLoop As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace