RhinoCommon API
LengthMassProperties.WorldCoordinatesSecondMoments Property
 Returns the world coordinate second moments if they were able to be calculated. X is integral of "xx dm" over the length Y is integral of "yy dm" over the length Z is integral of "zz dm" over the length.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public Vector3d WorldCoordinatesSecondMoments { get; }
Public ReadOnly Property WorldCoordinatesSecondMoments As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace