RhinoCommon API
GetEllipse.IsModeFromFoci Property
 Indicates the ellipse was created from foci.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsModeFromFoci { get; }
Public ReadOnly Property IsModeFromFoci As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetEllipse Class
Rhino.Input.Custom Namespace