RhinoCommon API
File3dmSettings.SaveTextureBitmapsInFile Property
Whether texture bitmaps are embedded in the model when it is saved.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool SaveTextureBitmapsInFile { get; set; }
Public Property SaveTextureBitmapsInFile As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace