RhinoCommon API
RhinoDoc.Name Property
Returns the name of the currently loaded Rhino document (3DM file).
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
RhinoDoc Class
Rhino Namespace