RhinoCommon API
EndAnalysisSettings.PolycurveJoints Property
 Gets or sets whether to display the polycurve joint points.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool PolycurveJoints { get; set; }
Public Shared Property PolycurveJoints As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
EndAnalysisSettings Class
Rhino.ApplicationSettings Namespace