RhinoCommon API
Vector3f.Length Property
 Computes the length (or magnitude, or size) of this vector. This is an application of Pythagoras' theorem. If this vector is invalid, its length is considered 0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public float Length { get; }
Public ReadOnly Property Length As Single
	Get
Property Value
Type: Single
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace