RhinoCommon API
UserInterfaceGrid.RowHeight Property
 Height of every row in logical pixels. The default is 0, which means each row is as tall as the tallest control in it.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double RowHeight { get; set; }
Public Property RowHeight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace