RhinoCommon API
SubDVertex.ControlNetPoint Property
 Location of the "control net" point that this SubDVertex represents
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Point3d ControlNetPoint { get; set; }
Public Property ControlNetPoint As Point3d
	Get
	Set
Property Value
Type: Point3d
Remarks
 The setter of this property will refresh the neighborhood cache around the vertex everytime it is called. This is not efficient if you have multiple vertices to modify. In that case, call vertex.SetControlNetPoint(position, false) for all the vertices you want to modify, then call subd.ClearEvaluationCache()
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace