RhinoCommon API
DisplayPipelineAttributes.SubDCreaseInteriorEdgeColorUsage Property
 Edge color usage
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public DisplayPipelineAttributes.SubDEdgeColorUse SubDCreaseInteriorEdgeColorUsage { get; set; }
Public Property SubDCreaseInteriorEdgeColorUsage As DisplayPipelineAttributes.SubDEdgeColorUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.SubDEdgeColorUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace