RhinoCommon API
GetPointMouseEventArgs.ControlKeyDown Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.ControlKeyDown"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ControlKeyDown { get; }
Public ReadOnly Property ControlKeyDown As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace