RhinoCommon API
PickContext.SubObjectSelectionEnabled Property
 True if the user had activated sub-object selection
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SubObjectSelectionEnabled { get; set; }
Public Property SubObjectSelectionEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace