RhinoCommon API
InstanceDefinitionGeometry.Url Property
 Gets or sets the URL or hyperlink of the definition.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string Url { get; set; }
Public Property Url As String
	Get
	Set
Property Value
Type: String
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace