RhinoCommon API
SubDEdgeList.Count Property
 Gets the number of SubD edges.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDEdgeList Class
Rhino.Geometry.Collections Namespace