RhinoCommon API
Font.IsInstalled Property
Is this font installed on the system
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public bool IsInstalled { get; }
Public ReadOnly Property IsInstalled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Font Class
Rhino.DocObjects Namespace