RhinoCommon API
DisplayAttributeMaterial.Reflectivity Property
 Reflectivity, 0.0 to 1.0.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Reflectivity { get; set; }
Public Property Reflectivity As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace