RhinoCommon API
LinearWorkflow.PostProcessGammaOn Property
 Linear workflow post-process gamma enabled state.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool PostProcessGammaOn { get; set; }
Public Property PostProcessGammaOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace