RhinoCommon API
WorksessionFile.ActiveModelIndex Property
 Gets the index of the first active model, or -1 if there is no active model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int ActiveModelIndex { get; }
Public ReadOnly Property ActiveModelIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace