RhinoCommon API
DirectionAnalysisSettings.Color Property
Gets or sets a color used to show curve or surface direction.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Color Color { get; set; }
Public Shared Property Color As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DirectionAnalysisSettings Class
Rhino.ApplicationSettings Namespace