RhinoCommon API
File3dmSettings.ModelUrl Property
 Gets or sets a Uniform Resource Locator (URL) direction for the model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string ModelUrl { get; set; }
Public Property ModelUrl As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace