RhinoCommon API
AnnotationBase.PlainText Property
 Text stripped of RTF formatting information
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string PlainText { get; set; }
Public Property PlainText As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace