RhinoCommon API
Linetype.IsPatternLocked Property
 Returns true if the pattern is locked and cannot be modified.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsPatternLocked { get; }
Public ReadOnly Property IsPatternLocked As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace