RhinoCommon API
Light.Radius Property
 Gets or sets the emitter radius (of the emitting sphere, in model units) for point and spot lights.
Ignored for other light types; linear light radius is derived from Width.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Light Class
Rhino.Geometry Namespace