RhinoCommon API
FileObjWriteOptions.UseRelativeIndexing Property
 Determines whether to use relative indexing. TRUE = use relative (negative) indexing FALSE = use absolute (positive) indexing
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool UseRelativeIndexing { get; set; }
Public Property UseRelativeIndexing As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
 This only has an impact on non-mesh output. There is also no interface in the OBJ export plug-in so code executed when set to true has not been thoroughly tested. It has been there forever and migrated with each successive revision of OBJ export code.
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace