RhinoCommon API
AppearanceSettings.ShowLayoutDropShadow Property
 Display the drop shadow of layouts
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool ShowLayoutDropShadow { get; set; }
Public Shared Property ShowLayoutDropShadow As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace