RhinoCommon API
SubDEdgeSharpness.Crease Property
 A sharpness of CreaseValue at both ends, used to indicate that an edge is a crease rather than a sharp edge. IsValid is false for this value; see IsValidOrCrease.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static SubDEdgeSharpness Crease { get; }
Public Shared ReadOnly Property Crease As SubDEdgeSharpness
	Get
Property Value
Type: SubDEdgeSharpness
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace