RhinoCommon API
ColorHSL.A Property
 Gets or sets the alpha channel value. Alpha channels are limited to a 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double A { get; set; }
Public Property A As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace