RhinoCommon API
FileReference.FullPath Property
 Gets the absolute path of this file reference.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string FullPath { get; }
Public ReadOnly Property FullPath As String
	Get
Property Value
Type: String
See Also
Reference
FileReference Class
Rhino.FileIO Namespace