RhinoCommon API
ModelAidSettingsState.AutoGumballEnabled Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettingsState.AutoGumballEnabled"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool AutoGumballEnabled { get; set; }
Public Property AutoGumballEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace