RhinoCommon API
GpuDeviceInfo.DriverDateAsString Property
 The driver date as string formatted year-month-day
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
public string DriverDateAsString { get; }
Public ReadOnly Property DriverDateAsString As String
	Get
Property Value
Type: String
See Also
Reference
GpuDeviceInfo Class
Rhino Namespace