RhinoCommon API
FileDwgWriteOptions.SplitPolycurves Property
Explode polycurves before exporting
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SplitPolycurves { get; set; }
Public Property SplitPolycurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace