RhinoCommon API
TimeZone.Longitude Property
 Returns the Longitude of a major city nearby
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public double Longitude { get; }
Public ReadOnly Property Longitude As Double
	Get
Return Value
Type: Double
Longitude
See Also
Reference
TimeZone Class
Rhino.Render Namespace