RhinoCommon API
DraftAngleAnalysisSettings.AngleRange Property
 The angle range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Interval AngleRange { get; set; }
Public Shared Property AngleRange As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
DraftAngleAnalysisSettings Class
Rhino.ApplicationSettings Namespace