RhinoCommon API
GetObject.LockedObjectSelect Property
 By default, locked objects cannot be selected. If you do want to be able to select locked objects, then call LockedObjectSelect=true.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool LockedObjectSelect { get; set; }
Public Property LockedObjectSelect As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace