RhinoCommon API
GroupTableEventArgs.GroupIndex Property
 The index of the Group that has changed.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public int GroupIndex { get; }
Public ReadOnly Property GroupIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
GroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace