RhinoCommon API
MeshCheckParameters.VertexFaceNormalsDifferCount Property
 Gets the total count of vertex normals that differ greatly from face normals for all meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int VertexFaceNormalsDifferCount { get; }
Public ReadOnly Property VertexFaceNormalsDifferCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace