RhinoCommon API
SimulatedTexture.BitmapSize Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.BitmapSize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public static int BitmapSize { get; set; }
Public Shared Property BitmapSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace