RhinoCommon API
AppearanceSettingsState.FrameBackgroundColor Property
Gets or sets the frame background color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color FrameBackgroundColor { get; set; }
Public Property FrameBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace