RhinoCommon API
PostEffectUuids.WireframeCurvesRGBA Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.WireframeCurvesRGBA"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid WireframeCurvesRGBA { get; }
Public Shared ReadOnly Property WireframeCurvesRGBA As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace