RhinoCommon API
FileSkpReadOptions.AddObjectsToGroups Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSkpReadOptions.AddObjectsToGroups"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool AddObjectsToGroups { get; set; }
Public Property AddObjectsToGroups As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSkpReadOptions Class
Rhino.FileIO Namespace