RhinoCommon API
Brep.FilletSurfaceSettings.G2Blend Property
 If true, a G2-continuous blend will be created
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool G2Blend { get; }
Public ReadOnly Property G2Blend As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace