RhinoCommon API
MeshSplitOptions.CompleteOpenCuts Property
Gets or sets whether cuts that stop inside the mesh are completed.
An intersection curve that stops inside the mesh does not separate one side from the other, so the mesh is returned whole. When this is enabled, each such open end is joined to the nearest border of the mesh, or to another cut, following edges the mesh already has.
This yields a best-effort cut where the intersection alone leaves the answer undetermined: the added stretch follows existing edges rather than the cutter, so it is not an intersection result. No vertex is moved and no face is added. Cuts that already close, or that already run from border to border, are unaffected.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool CompleteOpenCuts { get; set; }
Public Property CompleteOpenCuts As Boolean
	Get
	Set
Property Value
Type: Boolean
The default value is false.
See Also
Reference
MeshSplitOptions Class
Rhino.Geometry Namespace