RhinoCommon API
AppearanceSettings.FeedbackColor Property
 Gets or sets the feedback color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color FeedbackColor { get; set; }
Public Shared Property FeedbackColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace