RhinoCommon API
GetEllipsoid.Plane Property
 The plane the ellipsoid was created in.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.29
Syntax
public Plane Plane { get; }
Public ReadOnly Property Plane As Plane
	Get
Property Value
Type: Plane
See Also
Reference
GetEllipsoid Class
Rhino.Input.Custom Namespace