RhinoCommon API
ViewSettings.PanPlanParallelViewsWithControlShiftRMB Property
 Gets or sets the 'Pan plan parallel views with Control+Shift+RMB' value.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.19
Syntax
public static bool PanPlanParallelViewsWithControlShiftRMB { get; set; }
Public Shared Property PanPlanParallelViewsWithControlShiftRMB As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace