RhinoCommon API
RenderMeshProvider.NonObjectIds Property
 A provider may optionally return a collection of non-object Ids that it will provide custom render primitives for. An example of this is Grasshopper, which which will typically return a collection of the Ids of each CustomPreview component.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public virtual List<Guid> NonObjectIds { get; }
Public Overridable ReadOnly Property NonObjectIds As List(Of Guid)
	Get
Property Value
Type: List<Guid>
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace