RhinoCommon API
File3dmRenderContent.TypeName Property
The internal name of the content type.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string TypeName { get; }
Public ReadOnly Property TypeName As String
	Get
Property Value
Type: String
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace