RhinoCommon API
ViewInfo.ShowConstructionAxes Property
Whether the construction plane x and y axes are drawn in this view.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool ShowConstructionAxes { get; set; }
Public Property ShowConstructionAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace