RhinoCommon API
LicenseStatus.CloudZooLeaseIsValid Property
 Returns true if the Cloud Zoo Lease represented by this instance is actively being managed by the Cloud Zoo Manager; else returns false.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool CloudZooLeaseIsValid { get; set; }
Public Property CloudZooLeaseIsValid As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace