RhinoCommon API
DimStyleTable.CurrentDimensionStyle Property
Note: This API is now obsolete.
 Do not use. Use the Current property.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use the Current property.")]
public DimensionStyle CurrentDimensionStyle { get; }
<ObsoleteAttribute("Use the Current property.")>
Public ReadOnly Property CurrentDimensionStyle As DimensionStyle
	Get
Property Value
Type: DimensionStyle
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace