RhinoCommon API
ViewInfo.ShowWorldAxes Property
Whether the world axes icon is drawn in the corner of this view.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool ShowWorldAxes { get; set; }
Public Property ShowWorldAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace