RhinoCommon API
ContentUuids.CubeMapTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.CubeMapTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid CubeMapTextureType { get; }
Public Shared ReadOnly Property CubeMapTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace