RhinoCommon API
RhinoApp.LicenseUserOrganization Property
Gets the name of the organization of the user that owns the license or lease.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string LicenseUserOrganization { get; }
Public Shared ReadOnly Property LicenseUserOrganization As String
	Get
Property Value
Type: String
See Also
Reference
RhinoApp Class
Rhino Namespace