RhinoCommon API
RhinoDoc.CustomRenderSizes Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.CustomRenderSizes"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public List<Size> CustomRenderSizes { get; }
Public ReadOnly Property CustomRenderSizes As List(Of Size)
	Get
Property Value
Type: List<Size>
See Also
Reference
RhinoDoc Class
Rhino Namespace