RhinoCommon API
ObjectPropertiesPageCollection.Document Property
 Document associated with the Rhino properties panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
ObjectPropertiesPageCollection Class
Rhino.UI Namespace