RhinoCommon API
ObjectEnumeratorSettings.NormalObjects Property
 When true, normal objects (e.g. not locked and not hidden) are returned.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool NormalObjects { get; set; }
Public Property NormalObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace