RhinoCommon API
LayerTable.ActiveCount Property
 Returns number of layers in the layer table, excluding deleted layers.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int ActiveCount { get; }
Public ReadOnly Property ActiveCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace