RhinoCommon API
File3dmSettings.ModelBasepoint Property
 Gets or sets the model base point that is used when the file is read as an instance definition.
This point is mapped to the origin in the instance definition.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d ModelBasepoint { get; set; }
Public Property ModelBasepoint As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace