RhinoCommon API
CreatePreviewEventArgs.Cancel Property
 Get set by Rhino if the preview generation should be canceled for this
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public bool Cancel { get; }
Public ReadOnly Property Cancel As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace