RhinoCommon API
DisplayPipelineAttributes.ShowSilhouttes Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ShowSilhouttes"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ShowSilhouttes { get; set; }
Public Property ShowSilhouttes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace