RhinoCommon API
PhysicallyBasedMaterial.Clearcoat Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.Clearcoat"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double Clearcoat { get; set; }
Public Property Clearcoat As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace