RhinoCommon API
FileIgsWriteOptions.CurveMaxDegree Property
d >= 3 means all NURBS curves with degree > d be fit with degree d non-rational cubics.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileIgsWriteOptions.MaxDegreeMode CurveMaxDegree { get; set; }
Public Property CurveMaxDegree As FileIgsWriteOptions.MaxDegreeMode
	Get
	Set
Property Value
Type: FileIgsWriteOptions.MaxDegreeMode
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace