RhinoCommon API
FileDwgWriteOptions.ExportArcsAs Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgWriteOptions.ExportArcsAs"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileDwgWriteOptions.ExportArcMode ExportArcsAs { get; set; }
Public Property ExportArcsAs As FileDwgWriteOptions.ExportArcMode
	Get
	Set
Property Value
Type: FileDwgWriteOptions.ExportArcMode
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace