RhinoCommon API
PostEffectUuids.Dithering Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.Dithering"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid Dithering { get; }
Public Shared ReadOnly Property Dithering As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace