RhinoCommon API
GroundPlane.MaterialId Property
 The CRC / RenderHash of the material on this ground plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint MaterialId { get; }
Public ReadOnly Property MaterialId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace