RhinoCommon API
DimensionStyle.TextRotation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextRotation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double TextRotation { get; set; }
Public Property TextRotation As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace