RhinoCommon API
SectionStyle.HatchPatternPlotWeightMillimeters Property
 Plot width of the hatch pattern curves. values less than -1 (-10 is default): plot weight is determined by the object's attributes -1: do not plot 0: use default weight defined by the print dialog positive values are thicknesses in millimeters to print to
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double HatchPatternPlotWeightMillimeters { get; set; }
Public Property HatchPatternPlotWeightMillimeters As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace