RhinoCommon API
Dimension.TextRotation Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.TextRotation"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double TextRotation { get; set; }
Public Property TextRotation As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace