RhinoCommon API
ViewSettingsState.PanReverseKeyboardAction Property
Gets or sets if panning with the keyboard is reversed.
false, then Rhino pans the camera in the direction of the arrow key you press. true, then Rhino pans the scene instead.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool PanReverseKeyboardAction { get; set; }
Public Property PanReverseKeyboardAction As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace