RhinoCommon API
SectionStyle.BoundaryLinetypeIndex Property
[Missing <summary> documentation for "P:Rhino.DocObjects.SectionStyle.BoundaryLinetypeIndex"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int BoundaryLinetypeIndex { get; set; }
Public Property BoundaryLinetypeIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace