RhinoCommon API
SmartTrackSettingsState.TanPerpLineColor Property
Gets or sets the tangent and perpendicular line color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color TanPerpLineColor { get; set; }
Public Property TanPerpLineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace