RhinoCommon API
ShrinkWrapParameters.InflateVerticesAndPoints Property
 Inflate mesh vertices, points and point clouds Mesh vertices will be inflated as though the mesh were a point cloud
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public bool InflateVerticesAndPoints { get; set; }
Public Property InflateVerticesAndPoints As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ShrinkWrapParameters Class
Rhino.Geometry Namespace