RhinoCommon API
ModelAidSettings.AutoAlignCPlane Property
 Gets or sets whether the cplane will automatically align to the selection
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool AutoAlignCPlane { get; set; }
Public Shared Property AutoAlignCPlane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace