RhinoCommon API
PageViewGroup.Name Property
Gets or sets the name of this page view group.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public override string Name { get; set; }
Public Overrides Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
PageViewGroup Class
Rhino.DocObjects Namespace