RhinoCommon API
PostEffectUuids.DepthOfField Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.DepthOfField"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid DepthOfField { get; }
Public Shared ReadOnly Property DepthOfField As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace