RhinoCommon API
GumballAppearanceSettings.ScaleYEnabled Property
 When ScaleYEnabled is true, the Y scale control is available. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ScaleYEnabled { get; set; }
Public Property ScaleYEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace