RhinoCommon API
AreaMassProperties.CentroidCoordinatesProductMomentsError Property
 Uncertainty in product moments with respect to centroid coordinate system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.26
Syntax
public Vector3d CentroidCoordinatesProductMomentsError { get; }
Public ReadOnly Property CentroidCoordinatesProductMomentsError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace