RhinoCommon API
PlugIn.Id Property
 Returns the Guid, or unique Id, of the plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace