RhinoCommon API
UndoRecordEntry.Description Property
 The name of the command that created the undoable events, or a description of what created them when they did not happen in a command.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
See Also
Reference
UndoRecordEntry Class
Rhino Namespace