RhinoCommon API
RhinoDoc.ActiveDoc Property
 WARNING!! Do not use the ActiveDoc if you don't have to. Under Mac Rhino the ActiveDoc can change while a command is running. Use the doc that is passed to you in your RunCommand function or continue to use the same doc after the first call to ActiveDoc.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static RhinoDoc ActiveDoc { get; set; }
Public Shared Property ActiveDoc As RhinoDoc
	Get
	Set
Property Value
Type: RhinoDoc
See Also
Reference
RhinoDoc Class
Rhino Namespace