RhinoCommon API
Interval.IsIncreasing Property
 Returns true if T0 < T1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsIncreasing { get; }
Public ReadOnly Property IsIncreasing As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Interval Structure
Rhino.Geometry Namespace