RhinoCommon API
Extrusion.ProfileCount Property
 Gets the amount of profile curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int ProfileCount { get; }
Public ReadOnly Property ProfileCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace