RhinoCommon API
Brep.VariationalPatchResult.G0 Property
 This value will be not-null if any positional (G0) constraints were used. It will be true if those constraints were met within the positional tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool? G0 { get; }
Public ReadOnly Property G0 As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
See Also
Reference
Brep.VariationalPatchResult Class
Rhino.Geometry Namespace