RhinoCommon API
RhinoTransformObjectsEventArgs.GripOwnerCount Property
 The number of Rhino object grip owners that will be changed when the grips are transformed.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int GripOwnerCount { get; }
Public ReadOnly Property GripOwnerCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace