RhinoCommon API
BrepRegion.IsFinite Property
 Gets a value indicating whether this region is finite.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsFinite { get; }
Public ReadOnly Property IsFinite As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace