RhinoCommon API
HostUtils.RunningOnWindows Property
 Tests if this process is currently executing on the Windows platform.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool RunningOnWindows { get; }
Public Shared ReadOnly Property RunningOnWindows As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace