RhinoCommon API
FileDwgWriteOptions.NoDxfHeader Property
write an entities only dxf file ( R12 only)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool NoDxfHeader { get; set; }
Public Property NoDxfHeader As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace