RhinoCommon API
FilePdfReadOptions.ImportFillsAsHatches Property
[Missing <summary> documentation for "P:Rhino.FileIO.FilePdfReadOptions.ImportFillsAsHatches"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportFillsAsHatches { get; set; }
Public Property ImportFillsAsHatches As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FilePdfReadOptions Class
Rhino.FileIO Namespace