RhinoCommon API
RhinoApp.Rhino4Id Property
Gets the ID of Rhino 4.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid Rhino4Id { get; }
Public Shared ReadOnly Property Rhino4Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoApp Class
Rhino Namespace