RhinoCommon API
RenderContentEventArgs.EnvironmentUsageEx Property
 Meaningful for CurrentEnvironmentChanged event. Will be one of Background, Reflection or Skylighting.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RenderSettings.EnvironmentUsage EnvironmentUsageEx { get; }
Public ReadOnly Property EnvironmentUsageEx As RenderSettings.EnvironmentUsage
	Get
Property Value
Type: RenderSettings.EnvironmentUsage
See Also
Reference
RenderContentEventArgs Class
Rhino.Render Namespace