RhinoCommon API
FileEpsReadOptions.EpsUnits Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileEpsReadOptions.EpsUnits"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileEpsReadOptions.Units EpsUnits { get; set; }
Public Property EpsUnits As FileEpsReadOptions.Units
	Get
	Set
Property Value
Type: FileEpsReadOptions.Units
See Also
Reference
FileEpsReadOptions Class
Rhino.FileIO Namespace