RhinoCommon API
FileCsvWriteOptions.LayerHierarchy Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.LayerHierarchy"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool LayerHierarchy { get; set; }
Public Property LayerHierarchy As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace