RhinoCommon API
HiddenLineDrawingPoint.ClippingPlaneIndex Property
 Index into HiddenLineDrawing.ClippingPlanes when SilhouetteType == SilhouetteType.SectionCut.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public int ClippingPlaneIndex { get; }
Public ReadOnly Property ClippingPlaneIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
HiddenLineDrawingPoint Class
Rhino.Geometry Namespace