RhinoCommon API
Matrix.IsColumnOrthogonal Property
 Gets a value indicating whether the matrix is column orthogonal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsColumnOrthogonal { get; }
Public ReadOnly Property IsColumnOrthogonal As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Matrix Class
Rhino.Geometry Namespace