RhinoCommon API
SweepTwoRail.AutoAdjust Property
 Set to true to have shape curves adjusted, sorted, and matched automatically. This will produce results comparable to Rhino's Sweep2 command. Set to false to not have shape curves adjusted, sorted, and matched automatically.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.19
Syntax
public bool AutoAdjust { get; set; }
Public Property AutoAdjust As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace