RhinoCommon API
DisplayPipeline.DefaultCurveThickness Property
 Gets the curve thickness as defined by the current display mode. Note: this only applies to curve objects, Brep and Mesh wires may have different settings.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int DefaultCurveThickness { get; }
Public ReadOnly Property DefaultCurveThickness As Integer
	Get
Property Value
Type: Int32
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace