RhinoCommon API
PostEffectPipeline.IsRendering Property
 IsRendering
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool IsRendering { get; }
Public ReadOnly Property IsRendering As Boolean
	Get
Return Value
Type: Boolean
Return true if rendering is active, else false.
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace