RhinoCommon API
IHasCppImplementation.CppPointer Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IHasCppImplementation.CppPointer"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
IntPtr CppPointer { get; }
ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
IHasCppImplementation Interface
Rhino.UI.Controls Namespace