RhinoCommon API
BrepVertex.ProxyBrepSubDVertexId Property
 If this vertex is part of a brep created by SubD.ProxyBrep(), then the subd component id of the corresponding SubD vertex is returned. Otherwise 0 is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.19
Syntax
public uint ProxyBrepSubDVertexId { get; }
Public ReadOnly Property ProxyBrepSubDVertexId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace