RhinoCommon API
ObjectPropertiesPageEventArgs.Viewport Property
 Active viewport
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace