RhinoCommon API
GetColorEventArgs.InputColor Property
[Missing <summary> documentation for "P:Rhino.UI.GetColorEventArgs.InputColor"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color InputColor { get; }
Public ReadOnly Property InputColor As Color
	Get
Property Value
Type: Color
See Also
Reference
GetColorEventArgs Class
Rhino.UI Namespace