RhinoCommon API
GrasshopperDisplayMaterial.StripeWidth Property
 Gets or sets the width of one stripe band in screen-space pixels (used only when Striping is true). Stripes run along the screen diagonal and the light/dark pattern repeats every 2 × StripeWidth pixels; values below 1 are treated as 1. This is a pixel-space overlay — it does not scale with zoom or model units. Default: 0.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double StripeWidth { get; set; }
Public Property StripeWidth As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GrasshopperDisplayMaterial Class
Rhino.Display Namespace