RhinoCommon API
Brep.VariationalPatchSettings.PreserveEdges Property
 When an initial surface has been set, use PreserveEdges to fix the surface boundary.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool PreserveEdges { get; set; }
Public Property PreserveEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace