RhinoCommon API
FileDwgReadOptions.LayoutUnits Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgReadOptions.LayoutUnits"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public UnitSystem LayoutUnits { get; set; }
Public Property LayoutUnits As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
FileDwgReadOptions Class
Rhino.FileIO Namespace