RhinoCommon API
GripObject.Moved Property
 true if the grip has moved from OriginalLocation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Moved { get; }
Public ReadOnly Property Moved As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace