RhinoCommon API
RealtimeDisplayMode.MaxPasses Property
[Missing <summary> documentation for "P:Rhino.Render.RealtimeDisplayMode.MaxPasses"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.6
Syntax
public int MaxPasses { get; set; }
Public Property MaxPasses As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace