RhinoCommon API
AppearanceSettings.BlackWhiteSwitching Property
 Mode where white objects are drawn black when on a light background and black objects are drawn white when on a dark background
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool BlackWhiteSwitching { get; set; }
Public Shared Property BlackWhiteSwitching As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace