RhinoCommon API
GumballAppearanceSettings.TranslateXYEnabled Property
 When TranslateXY is true, the XY plane translation control is available in appropriate views. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TranslateXYEnabled { get; set; }
Public Property TranslateXYEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace