RhinoCommon API
PanelIds.Rendering Property
 Rhino Rendering Properties panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid Rendering { get; }
Public Shared ReadOnly Property Rendering As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace