RhinoCommon API
SurfaceCurvature.Normal Property
 Gets the normal direction of the surface at the u,v parameter where the surface curvature was evaluated.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d Normal { get; }
Public ReadOnly Property Normal As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace