RhinoCommon API
File3dmSettings.ModelUnitSystem Property
 Gets or sets the model unit system, using UnitSystem enumeration.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public UnitSystem ModelUnitSystem { get; set; }
Public Property ModelUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace