RhinoCommon API
GetArc.AllowDeformable Property
 Allow for deformable options
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AllowDeformable { get; set; }
Public Property AllowDeformable As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetArc Class
Rhino.Input.Custom Namespace