RhinoCommon API
Sun.DaylightSavingOn Property
Daylight saving time 'on' state
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public bool DaylightSavingOn { get; set; }
Public Property DaylightSavingOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Sun Class
Rhino.Render Namespace