RhinoCommon API
Field.IsHiddenInAutoUI Property
 When fields are used by the automatic UI, they can be hidden from it by calling this method.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.2
Syntax
public bool IsHiddenInAutoUI { get; set; }
Public Property IsHiddenInAutoUI As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Field Class
Rhino.Render.Fields Namespace