RhinoCommon API
ComponentFunctionInfo.Name Property
 The function name.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace