RhinoCommon API
RhinoApp.CanSave Property
 Returns true when Rhino is allowed to save, false otherwise Conditions where Rhino is not allowed to save are: when evaluation licenses are expired; when a Cloud Zoo lease is expired; when a license is shared by a single user on multiple computers, and the current computer is not active.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool CanSave { get; }
Public Shared ReadOnly Property CanSave As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace