RhinoCommon API
ModelAidSettingsState.DragStartsWindowSelection Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettingsState.DragStartsWindowSelection"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool DragStartsWindowSelection { get; set; }
Public Property DragStartsWindowSelection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace