RhinoCommon API
ReplayHistoryResult.ExistingObject Property
 The previously existing object.
Do not attempt to edit this object. It might have been already deleted by, for example, dragging.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoObject ExistingObject { get; }
Public ReadOnly Property ExistingObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace