RhinoCommon API
Linetype.ShapeLocalOffset Property
 Local offset applied to shapes
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Vector2d ShapeLocalOffset { get; set; }
Public Property ShapeLocalOffset As Vector2d
	Get
	Set
Property Value
Type: Vector2d
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace