RhinoCommon API
SmartTrackSettings.SmartSuppress Property
 TODO - Figure out what this does.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool SmartSuppress { get; set; }
Public Shared Property SmartSuppress As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace