RhinoCommon API
PlugInInfo.Country Property
 Returns the country of the organization or company that created the plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Country { get; }
Public ReadOnly Property Country As String
	Get
Property Value
Type: String
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace