RhinoCommon API
SectionStyle.HatchIndex Property
 Hatch pattern to use when drawing a fill pattern
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int HatchIndex { get; set; }
Public Property HatchIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace