RhinoCommon API
DisplayPipelineAttributes.CastShadows Property
Cast shadows.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public bool CastShadows { get; set; }
Public Property CastShadows As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace