RhinoCommon API
RenderMaterial.SmellsLikeTexturedPaint Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeTexturedPaint"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SmellsLikeTexturedPaint { get; }
Public ReadOnly Property SmellsLikeTexturedPaint As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace