RhinoCommon API
RenderContentSerializer.CanRead Property
 If true then the file type can be imported and will be included in the file open box when importing the specified render content kind.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool CanRead { get; }
Public ReadOnly Property CanRead As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace