RhinoCommon API
SubDEdge.ControlNetLine Property
 Line representing the control net end points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Line ControlNetLine { get; }
Public ReadOnly Property ControlNetLine As Line
	Get
Property Value
Type: Line
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace