RhinoCommon API
Plane.WorldXY Property
 plane coincident with the World XY plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Plane WorldXY { get; }
Public Shared ReadOnly Property WorldXY As Plane
	Get
Property Value
Type: Plane
See Also
Reference
Plane Structure
Rhino.Geometry Namespace