RhinoCommon API
DisplayPipelineAttributes.MeshDisplayAttributes.AllMeshWiresColor Property
 Color.Empty means that we are NOT using a single color for all mesh wires.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color AllMeshWiresColor { get; set; }
Public Property AllMeshWiresColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes.MeshDisplayAttributes Class
Rhino.Display Namespace