RhinoCommon API
Arc.Angle Property
 Gets or sets the sweep -or subtended- angle (in Radians) for this arc segment. Setting this property only alters the EndAngle property such that Angle = EndAngle - StartAngle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Angle { get; set; }
Public Property Angle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Arc Structure
Rhino.Geometry Namespace