RhinoCommon API
Linetype.LineJoinStyle Property
 Defines how the corners of curves should be drawn
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public LineJoinStyle LineJoinStyle { get; set; }
Public Property LineJoinStyle As LineJoinStyle
	Get
	Set
Property Value
Type: LineJoinStyle
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace