RhinoCommon API
ContentUuids.BasicEnvironmentType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.BasicEnvironmentType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid BasicEnvironmentType { get; }
Public Shared ReadOnly Property BasicEnvironmentType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace