RhinoCommon API
GeneralSettings.EnableContextMenu Property
 true if right mouse down + delay will pop up context menu on a mouse up if no move happens.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool EnableContextMenu { get; set; }
Public Shared Property EnableContextMenu As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace