RhinoCommon API
SmartTrackSettings.GuideColor Property
Gets or sets the active guide color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public static Color GuideColor { get; set; }
Public Shared Property GuideColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace