RhinoCommon API
DisplayPipelineAttributes.FrontFlatShaded Property
 Shades the current viewport with no smoothing so the individual render mesh faces are visible.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public bool FrontFlatShaded { get; set; }
Public Property FrontFlatShaded As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace