RhinoCommon API
FileObjWriteOptions.ActualFilePathOnMac Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileObjWriteOptions.ActualFilePathOnMac"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public string ActualFilePathOnMac { get; set; }
Public Property ActualFilePathOnMac As String
	Get
	Set
Property Value
Type: String
Remarks
 The path passed to FileExportPlugIn::WriteFile on the Mac is a temporary path. The calling function takes care of moving the temp (.obj) file to it's appropriate location. We can't use that to write that path to construct the .mat file because the calling function doesn't know anything about it. ActualFilePathOnMac is the path of the obj file's ultimate destination. It's only meaningful on the Mac platform.
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace