RhinoCommon API
Arc.Plane Property
 Gets or sets the plane in which this arc lies.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Arc Structure
Rhino.Geometry Namespace