RhinoCommon API
GripObject.SubDComponentId Property
 Id of the SubD component this grip is on, or 0 when the grip names no SubD component.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint SubDComponentId { get; }
Public ReadOnly Property SubDComponentId As UInteger
	Get
Property Value
Type: UInt32
Remarks
 Unlike Index, which is a position in the owner's grip list, this still names the same component after the SubD has been edited. Recording it is what lets a selection of SubD grips be restored against a changed object.
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace