RhinoCommon API
FileIgsWriteOptions.CompositeCurvesAsSingleBsplines Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.CompositeCurvesAsSingleBsplines"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool CompositeCurvesAsSingleBsplines { get; set; }
Public Property CompositeCurvesAsSingleBsplines As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace