RhinoCommon API
File3dm.AllLayers Property
 Layers in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public File3dmLayerTable AllLayers { get; }
Public ReadOnly Property AllLayers As File3dmLayerTable
	Get
Property Value
Type: File3dmLayerTable
See Also
Reference
File3dm Class
Rhino.FileIO Namespace