RhinoCommon API
SweepTwoRail.MaintainHeight Property
 Removes the association between the height scaling from the width scaling.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool MaintainHeight { get; set; }
Public Property MaintainHeight As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace