RhinoCommon API
ProviderIds.ContentDisplayCollection Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.ContentDisplayCollection"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid ContentDisplayCollection { get; }
Public Shared ReadOnly Property ContentDisplayCollection As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace