RhinoCommon API
SubDEdge.RelativeVertexTo Property
 The vertex this edge ends at, taking ComponentDirection into account.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDVertex RelativeVertexTo { get; }
Public ReadOnly Property RelativeVertexTo As SubDVertex
	Get
Property Value
Type: SubDVertex
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace