RhinoCommon API
RevSurface.IsTransposed Property
 If false, the "u" parameter is the angle parameter and the "v" parameter is the curve parameter. If true, the "u" parameter is the curve parameter and the "v" parameter is the angle parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public bool IsTransposed { get; }
Public ReadOnly Property IsTransposed As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace