RhinoCommon API
UndoRedoEventArgs.CommandId Property
 The id of the Rhino command. This can be Guid.Empty.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid CommandId { get; }
Public ReadOnly Property CommandId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace