RhinoCommon API
AppearanceSettingsState.DirectionArrowIconHeadSize Property
 Set the arrow icon head size.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int DirectionArrowIconHeadSize { get; set; }
Public Property DirectionArrowIconHeadSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace