RhinoCommon API
InstanceDefinitionGeometry.UpdateType Property
 Gets the relationship between this instance definition's geometry and the source archive that contains the original definition.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public InstanceDefinitionUpdateType UpdateType { get; }
Public ReadOnly Property UpdateType As InstanceDefinitionUpdateType
	Get
Property Value
Type: InstanceDefinitionUpdateType
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace