RhinoCommon API
File3dmEdgeSoftening.Chamfer Property
 Specifies whether to chamfer the edges.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Chamfer { get; set; }
Public Property Chamfer As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmEdgeSoftening Class
Rhino.FileIO Namespace