RhinoCommon API
ModelAidSettingsState.NudgeKeyStep Property
Gets or sets the nudge step amount.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double NudgeKeyStep { get; set; }
Public Property NudgeKeyStep As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace