RhinoCommon API
Brep.VariationalPatchResult.G2 Property
 This value will be not-null if any curvature (G2) constraints were used. It will be true if those constraints were met within the curvature relative and zero tolerances.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool? G2 { get; }
Public ReadOnly Property G2 As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
See Also
Reference
Brep.VariationalPatchResult Class
Rhino.Geometry Namespace