RhinoCommon API
RenderSettings.SafeFrame Property
 If this object is associated with a document, this gets the document safe-frame. If this object is associated with a File3dm, this gets the File3dm's safe-frame. Otherwise it gets a 'free-floating' safe-frame object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public SafeFrame SafeFrame { get; }
Public ReadOnly Property SafeFrame As SafeFrame
	Get
Property Value
Type: SafeFrame
See Also
Reference
RenderSettings Class
Rhino.Render Namespace