RhinoCommon API
SectionStyle.SectionFillRule Property
 Rule to determine when to generate a hatch pattern and fill
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public ObjectSectionFillRule SectionFillRule { get; set; }
Public Property SectionFillRule As ObjectSectionFillRule
	Get
	Set
Property Value
Type: ObjectSectionFillRule
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace