RhinoCommon API
EndAnalysisSettingsState.PolycurveJoints Property
 Gets or sets whether to display the polycurve joint points.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool PolycurveJoints { get; set; }
Public Property PolycurveJoints As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
EndAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace