RhinoCommon API
MouseState.FrustumLine Property
 Line in frustum that the active mouse position covers
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Line FrustumLine { get; }
Public ReadOnly Property FrustumLine As Line
	Get
Property Value
Type: Line
See Also
Reference
MouseState Class
Rhino.UI Namespace