RhinoCommon API
Fonts.BoldHeadingFont Property
 Returns a font that is 1.2x NormalFont and Bold
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Font BoldHeadingFont { get; }
Public Shared ReadOnly Property BoldHeadingFont As Font
	Get
Property Value
Type: Font
See Also
Reference
Fonts Class
Rhino.UI Namespace