RhinoCommon API
BinaryArchiveFile.Writer Property
[Missing <summary> documentation for "P:Rhino.FileIO.BinaryArchiveFile.Writer"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public BinaryArchiveWriter Writer { get; }
Public ReadOnly Property Writer As BinaryArchiveWriter
	Get
Property Value
Type: BinaryArchiveWriter
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace