RhinoCommon API
ViewCaptureSettings.DrawLockedObjects Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawLockedObjects"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DrawLockedObjects { get; set; }
Public Property DrawLockedObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace