RhinoCommon API
FileCdWriteOptions.MeshingParameters Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCdWriteOptions.MeshingParameters"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public MeshingParameters MeshingParameters { get; set; }
Public Property MeshingParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
See Also
Reference
FileCdWriteOptions Class
Rhino.FileIO Namespace