RhinoCommon API
ProviderIds.ImageFileInfo_V8 Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.ImageFileInfo_V8"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Guid ImageFileInfo_V8 { get; }
Public Shared ReadOnly Property ImageFileInfo_V8 As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace