RhinoCommon API
DimensionStyle.ArrowType2 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ArrowType2"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.ArrowType ArrowType2 { get; set; }
Public Property ArrowType2 As DimensionStyle.ArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ArrowType
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace