RhinoCommon API
AnnotationBase.Text Property
Note: This API is now obsolete.
 Text including additional RTF formatting information
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use RichText or PlainText")]
public string Text { get; set; }
<ObsoleteAttribute("Use RichText or PlainText")>
Public Property Text As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace