RhinoCommon API
File3dmMeshModifiers.CurvePiping Property
 Returns an object that provides access to curve piping information. If no curve piping information is present, the method returns null.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmCurvePiping CurvePiping { get; }
Public ReadOnly Property CurvePiping As File3dmCurvePiping
	Get
Property Value
Type: File3dmCurvePiping
See Also
Reference
File3dmMeshModifiers Class
Rhino.FileIO Namespace