RhinoCommon API
Triangle3d.PerpendicularBC Property
 Gets the perpendicular bisector for edge BC.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Line PerpendicularBC { get; }
Public ReadOnly Property PerpendicularBC As Line
	Get
Property Value
Type: Line
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace