RhinoCommon API
BrepFace.MaterialChannelIndex Property
 This face's rendering material channel index.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.26
Syntax
public int MaterialChannelIndex { get; set; }
Public Property MaterialChannelIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace