RhinoCommon API
SurfaceDirectionIndicators.IsValid Property
 Returns true if this instance is valid. The geometry that was used to create may not have been garbage collected.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SurfaceDirectionIndicators Class
Rhino.Geometry Namespace