RhinoCommon API
Markup.Modified Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Markup.Modified"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public DateTime Modified { get; }
Public ReadOnly Property Modified As DateTime
	Get
Property Value
Type: DateTime
See Also
Reference
Markup Class
Rhino.DocObjects Namespace