RhinoCommon API
SubDComponentParameter.FaceEdgeCount Property
 Gets the number of edges of the face, or 0 if IsFaceParameter is false.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int FaceEdgeCount { get; }
Public ReadOnly Property FaceEdgeCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace