RhinoCommon API
Skylight.Enabled Property
[Missing <summary> documentation for "P:Rhino.Render.Skylight.Enabled"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Skylight Class
Rhino.Render Namespace