RhinoCommon API
SurfaceCurvature.IsSet Property
 True if kappa1 and kappa2 are both valid finite values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsSet { get; }
Public ReadOnly Property IsSet As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace