RhinoCommon API
Material.MaxShine Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.MaxShine"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static double MaxShine { get; }
Public Shared ReadOnly Property MaxShine As Double
	Get
Property Value
Type: Double
See Also
Reference
Material Class
Rhino.DocObjects Namespace