RhinoCommon API
SweepOneRail.AngleToleranceRadians Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.AngleToleranceRadians"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double AngleToleranceRadians { get; set; }
Public Property AngleToleranceRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace