RhinoCommon API
MeshInstance.ParentId Property
 Get the Guid of the object that is at the parent of the MeshInstance ancestry, or Guid.Empty if there is no parent.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Guid ParentId { get; }
Public ReadOnly Property ParentId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace