RhinoCommon API
FileSatWriteOptions.Type Property
 Get and set the type of the sat file being written.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileSatWriteOptions.SatTypes Type { get; set; }
Public Property Type As FileSatWriteOptions.SatTypes
	Get
	Set
Property Value
Type: FileSatWriteOptions.SatTypes
See Also
Reference
FileSatWriteOptions Class
Rhino.FileIO Namespace