RhinoCommon API
FileFbxWriteOptions.SaveObjectsAs Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileFbxWriteOptions.SaveObjectsAs"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileFbxWriteOptions.ObjectType SaveObjectsAs { get; set; }
Public Property SaveObjectsAs As FileFbxWriteOptions.ObjectType
	Get
	Set
Property Value
Type: FileFbxWriteOptions.ObjectType
See Also
Reference
FileFbxWriteOptions Class
Rhino.FileIO Namespace