RhinoCommon API
DisplayPipelineAttributes.SurfaceIsoSingleColor Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceIsoSingleColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public bool SurfaceIsoSingleColor { get; set; }
Public Property SurfaceIsoSingleColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace