RhinoCommon API
MeshCheckParameters.CheckForExtremelyShortEdges Property
 If true, then look for topological edges where the distance between the endpoints is less than ExtremelyShortEdgeDistance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool CheckForExtremelyShortEdges { get; set; }
Public Property CheckForExtremelyShortEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace