RhinoCommon API
ViewCaptureSettings.DrawWallpaper Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawWallpaper"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public bool DrawWallpaper { get; set; }
Public Property DrawWallpaper As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace