RhinoCommon API
ViewportInfo.FrustumWidth Property
 Gets the frustum width. This is FrustumRight - FrustumLeft.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double FrustumWidth { get; }
Public ReadOnly Property FrustumWidth As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace