RhinoCommon API
LicenseStatus.RegisteredOrganization Property
The registered organization of the product (e.g. "Robert McNeel and Associates")
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string RegisteredOrganization { get; set; }
Public Property RegisteredOrganization As String
	Get
	Set
Property Value
Type: String
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace