RhinoCommon API
ModelAidSettingsState.DisplayControlPolygon Property
Gets or sets the enabled state of Rhino's display control polygon.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool DisplayControlPolygon { get; set; }
Public Property DisplayControlPolygon As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace