RhinoCommon API
CreateTexture2dPreviewEventArgs.PreviewImageSize Property
 Pixel size of the image that is being requested for the preview scene
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Size PreviewImageSize { get; }
Public ReadOnly Property PreviewImageSize As Size
	Get
Property Value
Type: Size
See Also
Reference
CreateTexture2dPreviewEventArgs Class
Rhino.Render Namespace