RhinoCommon API
Triangle3d.Circumcenter Property
 Gets the triangle circumcenter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Point3d Circumcenter { get; }
Public ReadOnly Property Circumcenter As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace