RhinoCommon API
RefinementSettings.Level Property
 The level of subdivision to achieve.
 Namespace: Rhino.Geometry.MeshRefinements
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Level { get; set; }
Public Property Level As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RefinementSettings Class
Rhino.Geometry.MeshRefinements Namespace