RhinoCommon API
GumballAppearanceSettings.MenuDistance Property
Distance of menu ball from center.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int MenuDistance { get; set; }
Public Property MenuDistance As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace