RhinoCommon API
SurfaceCurvature.Mean Property
 The mean curvature is (kappa1+kappa2)/2.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Mean { get; }
Public ReadOnly Property Mean As Double
	Get
Property Value
Type: Double
Remarks
 If this is set, the signed mean curvature is returned. Otherwise, the quiet NaN is returned.
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace