RhinoCommon API
NurbsSurfaceKnotList.ClampedAtStart Property
Determines if a knot vector is clamped.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ClampedAtStart { get; }
Public ReadOnly Property ClampedAtStart As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace