RhinoCommon API
FileTxtWriteOptions.SurroundWithDoubleQuotes Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileTxtWriteOptions.SurroundWithDoubleQuotes"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SurroundWithDoubleQuotes { get; set; }
Public Property SurroundWithDoubleQuotes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileTxtWriteOptions Class
Rhino.FileIO Namespace