RhinoCommon API
DisplayPipeline.Technology Property
 Get the GPU technology that this pipeline is actively using
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.35
Syntax
public DisplayTechnology Technology { get; }
Public ReadOnly Property Technology As DisplayTechnology
	Get
Property Value
Type: DisplayTechnology
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace