RhinoCommon API
SubDVertex.EdgeCount Property
 Number of edges for this vertex
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int EdgeCount { get; }
Public ReadOnly Property EdgeCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace