RhinoCommon API
DisplayPen.PatternScale Property
 Scale applied to the pattern, use 0.0 to let Rhino apply global scale.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public float PatternScale { get; set; }
Public Property PatternScale As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPen Class
Rhino.Display Namespace