RhinoCommon API
ComponentFunctionInfo.OutputTypeNames Property
 Grasshopper returns several items in general. This property returns the output type names.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IReadOnlyList<string> OutputTypeNames { get; }
Public ReadOnly Property OutputTypeNames As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace