RhinoCommon API
DisplayPipelineAttributes.SubDCreaseInteriorColorReduction Property
 Color reduction percentage
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public int SubDCreaseInteriorColorReduction { get; set; }
Public Property SubDCreaseInteriorColorReduction As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace