RhinoCommon API
ModelAidSettingsState.CtrlNudgeKeyStep Property
Gets or sets the Ctrl-key based nudge step amount.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double CtrlNudgeKeyStep { get; set; }
Public Property CtrlNudgeKeyStep As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace