RhinoCommon API
DisplayPipelineAttributes.ShowMeshEdges Property
 Display mesh edges on/off
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ShowMeshEdges { get; set; }
Public Property ShowMeshEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace