RhinoCommon API
MaterialRefCreateParams.FrontFaceMaterialIndex Property
 The index of the material used to render the front of an object
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public int FrontFaceMaterialIndex { get; set; }
Public Property FrontFaceMaterialIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace