RhinoCommon API
AppearanceSettings.ShowSideBar Property
 Shows or hides the side bar user interface.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool ShowSideBar { get; set; }
Public Shared Property ShowSideBar As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace