RhinoCommon API
FontQuartet.QuartetName Property
[Missing <summary> documentation for "P:Rhino.DocObjects.FontQuartet.QuartetName"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public string QuartetName { get; }
Public ReadOnly Property QuartetName As String
	Get
Property Value
Type: String
See Also
Reference
FontQuartet Class
Rhino.DocObjects Namespace