RhinoCommon API
RebuildCurveOptions.UniformityPermitted Property
 True if the user interface is permitted to show the uniformity intensity option
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UniformityPermitted { get; }
Public ReadOnly Property UniformityPermitted As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace