RhinoCommon API
ContentUuids.HDRTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.HDRTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid HDRTextureType { get; }
Public Shared ReadOnly Property HDRTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace