RhinoCommon API
QuadRemeshParameters.AdaptiveSize Property
 Larger values results in for quad sizes that adjust to match input curvature. Smaller values results in more uniform quad sizes at the risk of less feature preservation. Range [0 - 100] Note: this value is ignored when TargetEdgeLength > 0
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double AdaptiveSize { get; set; }
Public Property AdaptiveSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
QuadRemeshParameters Class
Rhino.Geometry Namespace