RhinoCommon API
TextObject.TextGeometry Property
 Get the text geometry for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public TextEntity TextGeometry { get; }
Public ReadOnly Property TextGeometry As TextEntity
	Get
Property Value
Type: TextEntity
See Also
Reference
TextObject Class
Rhino.DocObjects Namespace