RhinoCommon API
FileWriteOptions.FileTypeIsComplete3dm Property
 True if the the file type is the current 3dm file version and everything in the document will be saved.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool FileTypeIsComplete3dm { get; }
Public ReadOnly Property FileTypeIsComplete3dm As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace