RhinoCommon API
MeshFaceList.QuadCount Property
 Gets the number of faces that are valid quads (4 corners).
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int QuadCount { get; }
Public ReadOnly Property QuadCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace