RhinoCommon API
PhysicallyBasedMaterial.SubsurfaceScatteringRadius Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.SubsurfaceScatteringRadius"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double SubsurfaceScatteringRadius { get; set; }
Public Property SubsurfaceScatteringRadius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace