RhinoCommon API
GumballSettingsState.PlaneVisibilityAngle Property
 Sets the angle of view for the plane to be visible. The range is from 0 to 90 degrees. 0 degrees means the plane only shows if the gumball is perfectly aligned to the view, 90 means the plane always shows. The default is 50 degrees.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double PlaneVisibilityAngle { get; set; }
Public Property PlaneVisibilityAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace