RhinoCommon API
QuadRemeshParameters.PreserveMeshArrayEdgesMode Property
 0=off, 1=On(Smart), 2=On(Strict) : Mesh array's created from Breps will have their brep face edge boundaries retained. Smart - Small or insignificant input faces are ignored. Strict - All input faces are factored in re-meshed result.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int PreserveMeshArrayEdgesMode { get; set; }
Public Property PreserveMeshArrayEdgesMode As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
QuadRemeshParameters Class
Rhino.Geometry Namespace