RhinoCommon API
FilePdfReadOptions.RhinoScale Property
[Missing <summary> documentation for "P:Rhino.FileIO.FilePdfReadOptions.RhinoScale"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double RhinoScale { get; set; }
Public Property RhinoScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FilePdfReadOptions Class
Rhino.FileIO Namespace