RhinoCommon API
MeshCurvatureStats.Range Property
 Gets the minumum and maximum curvature based on the value of CurvatureStyle: If CurvatureStyle.GaussianCurvature, the min Gaussian curvature and the max Gaussian curvature. If CurvatureStyle.MeanCurvature, the min unsigned mean curvature and the max unsigned mean curvature. If CurvatureStyle.MinimumCurvature, the min maximum unsigned radius of curvature and the max maximum unsigned radius of curvature. If CurvatureStyle.MaximumCurvature, the min minimum unsigned radius of curvature and the the max minimum unsigned radius of curvature.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Interval Range { get; }
Public ReadOnly Property Range As Interval
	Get
Property Value
Type: Interval
See Also
Reference
MeshCurvatureStats Class
Rhino.Geometry Namespace