RhinoCommon API
DisplayAttributeMaterial.DisableLighting Property
 When true the material is drawn at full diffuse color, ignoring the scene lights.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool DisableLighting { get; set; }
Public Property DisableLighting As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace