RhinoCommon API
LicenseLease.Expiration Property
 The date when this lease will expire
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DateTime Expiration { get; }
Public ReadOnly Property Expiration As DateTime
	Get
Property Value
Type: DateTime
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace