RhinoCommon API
FileObjWriteOptions.PolylineType Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileObjWriteOptions.PolylineType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileObjWriteOptions.PolylineExportType PolylineType { get; set; }
Public Property PolylineType As FileObjWriteOptions.PolylineExportType
	Get
	Set
Property Value
Type: FileObjWriteOptions.PolylineExportType
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace