RhinoCommon API
Point3dList.X Property
 Returns an indexer with all X coordinates in this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3dList.XAccess X { get; }
Public ReadOnly Property X As Point3dList.XAccess
	Get
Property Value
Type: Point3dList.XAccess
See Also
Reference
Point3dList Class
Rhino.Collections Namespace