RhinoCommon API
PostEffectUuids.Watermark Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.Watermark"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid Watermark { get; }
Public Shared ReadOnly Property Watermark As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace