RhinoCommon API
SmartTrackSettingsState.StrongOrtho Property
 TODO - Figure out what this does.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool StrongOrtho { get; set; }
Public Property StrongOrtho As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace