RhinoCommon API
RhinoDoc.IsHeadless Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.IsHeadless"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool IsHeadless { get; }
Public ReadOnly Property IsHeadless As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace