RhinoCommon API
CreateTexture2dPreviewEventArgs.PreviewImage Property
 Initially null. If this image is set, then this image will be used for the preview. If never set, the default internal simulation preview will be used.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Bitmap PreviewImage { get; set; }
Public Property PreviewImage As Bitmap
	Get
	Set
Property Value
Type: Bitmap
See Also
Reference
CreateTexture2dPreviewEventArgs Class
Rhino.Render Namespace