RhinoCommon API
PostEffectPipeline.RenderingId Property
 Return a UUID that uniquely identifies the rendering being processed.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Guid RenderingId { get; }
Public ReadOnly Property RenderingId As Guid
	Get
Return Value
Type: Guid
Return a UUID that uniquely identifies the rendering being processed.
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace