RhinoCommon API
RhinoTransformObjectsEventArgs.GripCount Property
 The number of Rhino object grips that will be transformed.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int GripCount { get; }
Public ReadOnly Property GripCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace