RhinoCommon API
SerializationOptions.WriteAnalysisMeshes Property
 Gets or sets a value indicating whether to write analysis meshes
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public bool WriteAnalysisMeshes { get; set; }
Public Property WriteAnalysisMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace