RhinoCommon API
File3dmDisplacement.PostWeldAngle Property
 Specifies the maximum angle between face normals of adjacent faces that will get welded together.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double PostWeldAngle { get; set; }
Public Property PostWeldAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace