RhinoCommon API
Brep.VariationalPatchSettings.DegreeV Property
 Surface degree in V-direction
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int DegreeV { get; set; }
Public Property DegreeV As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace