RhinoCommon API
PhysicallyBased.OpacityRoughness Property
[Missing <summary> documentation for "P:Rhino.Render.ParameterNames.PhysicallyBased.OpacityRoughness"]
 Namespace: Rhino.Render.ParameterNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string OpacityRoughness { get; }
Public Shared ReadOnly Property OpacityRoughness As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ParameterNames Namespace