RhinoCommon API
MatchSrfSettings.RefineAngleToleranceRadians Property
 Angle between surface normals during refinement
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public double RefineAngleToleranceRadians { get; }
Public ReadOnly Property RefineAngleToleranceRadians As Double
	Get
Property Value
Type: Double
See Also
Reference
MatchSrfSettings Class
Rhino.Geometry Namespace