RhinoCommon API
TaskCompleteEventArgs.Redraw Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.TaskCompleteEventArgs.Redraw"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Redraw { get; set; }
Public Property Redraw As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TaskCompleteEventArgs Class
Rhino.Input.Custom Namespace