RhinoCommon API
SubDComponentParameter.Unset Property
 The unset parameter. It does not identify a point on any SubD.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static SubDComponentParameter Unset { get; }
Public Shared ReadOnly Property Unset As SubDComponentParameter
	Get
Property Value
Type: SubDComponentParameter
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace