RhinoCommon API
RhinoView.InDynamicViewChange Property
 true if the view is being dynamically changed by mouse moves, arrow keys, trackballs, etc.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.1
Syntax
public bool InDynamicViewChange { get; }
Public ReadOnly Property InDynamicViewChange As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoView Class
Rhino.Display Namespace