RhinoCommon API
Vector3f.X Property
 Gets or sets the X (first) component of this vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public float X { get; set; }
Public Property X As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace