RhinoCommon API
DrawObjectEventArgs.DrawObject Property
[Missing <summary> documentation for "P:Rhino.Display.DrawObjectEventArgs.DrawObject"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool DrawObject { get; set; }
Public Property DrawObject As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DrawObjectEventArgs Class
Rhino.Display Namespace