RhinoCommon API
Layer.IsVisibleInUserInterface Property
 Return true if the layer is visible in user interfaces that display layers. Returns false if the layer not visible in user interfaces. This is a runtime property that does not persist in .3dm files. This property is also used by the Layers panel to filter layers.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public bool IsVisibleInUserInterface { get; set; }
Public Property IsVisibleInUserInterface As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Layer Class
Rhino.DocObjects Namespace