RhinoCommon API
AnnotationBase.DimensionStyle Property
 If there are no overrides then the parent style is returned otherwise the dimension style saved with the annotation is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle DimensionStyle { get; }
Public ReadOnly Property DimensionStyle As DimensionStyle
	Get
Property Value
Type: DimensionStyle
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace