RhinoCommon API
ObjectEnumeratorSettings.ViewportFilter Property
 The viewport filter property can be used to limit the iteration to objects that are active in a specific viewport.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public RhinoViewport ViewportFilter { get; set; }
Public Property ViewportFilter As RhinoViewport
	Get
	Set
Property Value
Type: RhinoViewport
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace