RhinoCommon API
Layer.IsCurrent Property
 Returns true if the layer is the current layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsCurrent { get; }
Public ReadOnly Property IsCurrent As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Layer Class
Rhino.DocObjects Namespace