RhinoCommon API
TimeZone.Latitude Property
 Returns the latitude of a major city nearby
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public double Latitude { get; }
Public ReadOnly Property Latitude As Double
	Get
Return Value
Type: Double
Latitude
See Also
Reference
TimeZone Class
Rhino.Render Namespace