RhinoCommon API
Font.Description Property
 Returns a long description that includes family, face, weight, stretch and style information. Generally not useful for finding matching fonts.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
See Also
Reference
Font Class
Rhino.DocObjects Namespace