RhinoCommon API
SurfaceCurvature.Point Property
 Gets the point at the u,v parameter where the surface curvature was evaluated.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d Point { get; }
Public ReadOnly Property Point As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace