RhinoCommon API
FileIgsWriteOptions.CatiaVersion Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.CatiaVersion"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int CatiaVersion { get; set; }
Public Property CatiaVersion As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace