RhinoCommon API
GeneralSettingsState.MaximumUndoMemoryMb Property
 Gets or sets the minimum undo memory Mb.
Undo records will be purged if there are more than MinimumUndoSteps and they use more than MaximumUndoMemoryMb.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int MaximumUndoMemoryMb { get; set; }
Public Property MaximumUndoMemoryMb As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace