RhinoCommon API
AppearanceSettings.MenuVisible Property
Gets or sets a value that determines if the File menu is visible.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool MenuVisible { get; set; }
Public Shared Property MenuVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace