RhinoCommon API
RebuildCurveOptions.InputCurveCount Property
 The number of input curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int InputCurveCount { get; }
Public ReadOnly Property InputCurveCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace