RhinoCommon API
DisplayPipelineAttributes.SubDNonManifoldThicknessUsage Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SubDNonManifoldThicknessUsage"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public DisplayPipelineAttributes.SubDThicknessUse SubDNonManifoldThicknessUsage { get; set; }
Public Property SubDNonManifoldThicknessUsage As DisplayPipelineAttributes.SubDThicknessUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.SubDThicknessUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace