RhinoCommon API
SubDEdgeSharpness.Delta Property
 Gets EndSharpness(1) - EndSharpness(0), or NaN if this is neither valid nor a crease.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public double Delta { get; }
Public ReadOnly Property Delta As Double
	Get
Property Value
Type: Double
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace