RhinoCommon API
ContentUuids.HatchBumpTexture Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.HatchBumpTexture"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid HatchBumpTexture { get; }
Public Shared ReadOnly Property HatchBumpTexture As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace