RhinoCommon API
DisplayPipelineAttributes.SubDThicknessUsage Property
 Thickness usage, pixel thickness or a scale thickness
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public DisplayPipelineAttributes.SubDThicknessUse SubDThicknessUsage { get; set; }
Public Property SubDThicknessUsage As DisplayPipelineAttributes.SubDThicknessUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.SubDThicknessUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace