RhinoCommon API
HermiteSurface.UCount Property
 Gets the number of parameters in the "u" direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int UCount { get; }
Public ReadOnly Property UCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace