RhinoCommon API
ContentUuids.V8BlendMaterialType Property
 Rhino V8 Blend material type Guid
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Guid V8BlendMaterialType { get; }
Public Shared ReadOnly Property V8BlendMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace