RhinoCommon API
Polyline.Length Property
 Gets the total length of the polyline.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
See Also
Reference
Polyline Class
Rhino.Geometry Namespace