RhinoCommon API
HatchPattern.Defaults.Solid Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Defaults.Solid"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static HatchPattern Solid { get; }
Public Shared ReadOnly Property Solid As HatchPattern
	Get
Property Value
Type: HatchPattern
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace