RhinoCommon API
Transform2d.IsIdentity Property
Return true if this Transform2d is the identity transform.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsIdentity { get; }
Public ReadOnly Property IsIdentity As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace