RhinoCommon API
HostUtils.IsPreRelease Property
 Returns true when Rhino build is Beta or WIP, false otherwise
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.22
Syntax
public static bool IsPreRelease { get; }
Public Shared ReadOnly Property IsPreRelease As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace