RhinoCommon API
BinaryArchiveWriter.WriteErrorOccured Property
 Gets or sets whether an error occurred.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool WriteErrorOccured { get; set; }
Public Property WriteErrorOccured As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace