RhinoCommon API
RhinoObjectAnalysisModeChangedEventArgs.ObjectId Property
 The id of the Rhino object whose visual analysis mode changed.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Guid ObjectId { get; }
Public ReadOnly Property ObjectId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoObjectAnalysisModeChangedEventArgs Class
Rhino.DocObjects Namespace