RhinoCommon API
Cone.Axis Property
Unit vector axis of cone.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d Axis { get; }
Public ReadOnly Property Axis As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Cone Structure
Rhino.Geometry Namespace