RhinoCommon API
ViewportInfo.FrustumMinimumDiameter Property
 Gets the frustum minimum diameter, or the minimum between FrustumWidth and FrustumHeight.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double FrustumMinimumDiameter { get; }
Public ReadOnly Property FrustumMinimumDiameter As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace