RhinoCommon API
BrepRegionFaceSide.SurfaceNormalPointsIntoRegion Property
 Gets true if BrepFace's surface normal points into region; false otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SurfaceNormalPointsIntoRegion { get; }
Public ReadOnly Property SurfaceNormalPointsIntoRegion As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BrepRegionFaceSide Class
Rhino.Geometry Namespace