RhinoCommon API
RhinoPageView.PrinterName Property
 Gets and sets the name of the layout's destination printer.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public string PrinterName { get; set; }
Public Property PrinterName As String
	Get
	Set
Property Value
Type: String
Remarks
 The name is not validated against the printers installed on this system. On Windows, setting it can change what PaperName returns, because that name is looked up in the destination printer's list of forms. Other platforms do not consult the printer, so PaperName is unaffected there.
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace