RhinoCommon API
RhinoDeselectAllObjectsEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoDeselectAllObjectsEventArgs.Document"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoDeselectAllObjectsEventArgs Class
Rhino.DocObjects Namespace