RhinoCommon API
GumballAppearanceSettings.TranslateZXEnabled Property
 When TranslateZX is true, the ZX plane translation control is available in appropriate views. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TranslateZXEnabled { get; set; }
Public Property TranslateZXEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace