RhinoCommon API
PhysicallyBased.Roughness Property
[Missing <summary> documentation for "P:Rhino.Render.ChildSlotNames.PhysicallyBased.Roughness"]
 Namespace: Rhino.Render.ChildSlotNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Roughness { get; }
Public Shared ReadOnly Property Roughness As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ChildSlotNames Namespace