RhinoCommon API
BrepObject.BrepGeometry Property
 Gets the Brep geometry linked with this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep BrepGeometry { get; }
Public ReadOnly Property BrepGeometry As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepObject Class
Rhino.DocObjects Namespace