RhinoCommon API
ModelAidSettingsState.StickyAutoCPlane Property
 Gets or set whether the auto cplane will stay even after deselection
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool StickyAutoCPlane { get; set; }
Public Property StickyAutoCPlane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace