RhinoCommon API
Dimension.TextLocation Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.TextLocation"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual DimensionStyle.TextLocation TextLocation { get; set; }
Public Overridable Property TextLocation As DimensionStyle.TextLocation
	Get
	Set
Property Value
Type: DimensionStyle.TextLocation
See Also
Reference
Dimension Class
Rhino.Geometry Namespace