RhinoCommon API
File3dmPlugInDetails.Filename Property
The plug-in's binary filename
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Filename { get; set; }
Public Property Filename As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dmPlugInDetails Class
Rhino.FileIO Namespace