RhinoCommon API
FileFbxReadOptions.MapFbxYtoRhinoZ Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileFbxReadOptions.MapFbxYtoRhinoZ"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool MapFbxYtoRhinoZ { get; set; }
Public Property MapFbxYtoRhinoZ As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileFbxReadOptions Class
Rhino.FileIO Namespace