RhinoCommon API
WorksessionFileModel.RelativePath Property
 Gets or sets the path of the model file relative to the .rws file, as saved. Rhino uses it when the file is no longer at FullPath. It can be empty. Version 4 files do not have it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string RelativePath { get; set; }
Public Property RelativePath As String
	Get
	Set
Property Value
Type: String
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace