RhinoCommon API
ModelAidSettingsState.PointDisplay Property
Gets or sets the point display mode.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PointDisplayMode PointDisplay { get; set; }
Public Property PointDisplay As PointDisplayMode
	Get
	Set
Property Value
Type: PointDisplayMode
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace