RhinoCommon API
RhinoDoc.RenderEnvironments Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderEnvironments"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public RenderEnvironmentTable RenderEnvironments { get; }
Public ReadOnly Property RenderEnvironments As RenderEnvironmentTable
	Get
Property Value
Type: RenderEnvironmentTable
See Also
Reference
RhinoDoc Class
Rhino Namespace