RhinoCommon API
MeshInstance.InstanceId Property
 Get the instance identifier for this mesh instance.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint InstanceId { get; }
Public ReadOnly Property InstanceId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace