RhinoCommon API
AppearanceSettingsState.DirectionArrowIconShaftSize Property
 Set the arrow icon shaft size.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int DirectionArrowIconShaftSize { get; set; }
Public Property DirectionArrowIconShaftSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace