RhinoCommon API
Instance.IsViewDependent Property
 If this instance will change depending on the view direction.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsViewDependent { get; set; }
Public Property IsViewDependent As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Instance Class
Rhino.Render.CustomRenderMeshes Namespace