RhinoCommon API
RhinoObject.GripsOn Property
Gets or sets the activation state of object default editing grips.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool GripsOn { get; set; }
Public Property GripsOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace