RhinoCommon API
CommonComponentTable<T>.Count Property
 Returns the count of all items, including deleted ones.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual int Count { get; }
Public Overridable ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
IReadOnlyCollection<T>.Count
ICollection<T>.Count
See Also
Reference
CommonComponentTable<T> Class
Rhino.FileIO Namespace