RhinoCommon API
ChooseOneObjectSettingsState.FollowCursor Property
FollowCursor
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool FollowCursor { get; set; }
Public Property FollowCursor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace