RhinoCommon API
GetPointMouseEventArgs.RightButtonDown Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.RightButtonDown"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool RightButtonDown { get; }
Public ReadOnly Property RightButtonDown As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace