RhinoCommon API
ViewInfo.FocalBlurAperture Property
 Gets or sets the Focal blur aperture of the active viewport
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double FocalBlurAperture { get; set; }
Public Property FocalBlurAperture As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace