RhinoCommon API
CustomPostEffectAttribute.Styles Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.CustomPostEffectAttribute.Styles"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PostEffectStyles Styles { get; set; }
Public Property Styles As PostEffectStyles
	Get
	Set
Property Value
Type: PostEffectStyles
See Also
Reference
CustomPostEffectAttribute Class
Rhino.Render.PostEffects Namespace