RhinoCommon API
Sphere.EquatorialPlane Property
 Gets or sets the Equatorial plane for this sphere.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Plane EquatorialPlane { get; set; }
Public Property EquatorialPlane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace