RhinoCommon API
Box.BoundingBox Property
 Gets the world axis aligned Bounding box for this oriented box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
Box Structure
Rhino.Geometry Namespace