RhinoCommon API
MeshPoint.Point Property
 Gets the location (position) of this point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d Point { get; }
Public ReadOnly Property Point As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace