RhinoCommon API
GroundPlane.TextureRotation Property
 Texture mapping rotation around world origin + offset in degrees.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double TextureRotation { get; set; }
Public Property TextureRotation As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GroundPlane Class
Rhino.Render Namespace