RhinoCommon API
Vector3d.MinimumCoordinate Property
 Gets the smallest (both positive and negative) component value in this vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double MinimumCoordinate { get; }
Public ReadOnly Property MinimumCoordinate As Double
	Get
Property Value
Type: Double
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace