RhinoCommon API
ViewportInfo.FrustumBottomPlane Property
 Gets the frustum bottom plane that separates visible from off-screen.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Plane FrustumBottomPlane { get; }
Public ReadOnly Property FrustumBottomPlane As Plane
	Get
Property Value
Type: Plane
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace