RhinoCommon API
ObjectEnumeratorSettings.ActiveObjects Property
 When true, objects that are part of current model and saved in file are returned.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ActiveObjects { get; set; }
Public Property ActiveObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace