RhinoCommon API
Layer.PersistentVisibility Property
 Gets or sets the global persistent visibility setting for this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool PersistentVisibility { get; set; }
Public Property PersistentVisibility As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Layer Class
Rhino.DocObjects Namespace