RhinoCommon API
File3dmSettings.PageDistanceDisplayPrecision Property
 Gets or sets the page space distance display precision. In decimal mode this is the number of decimal places; in fractional modes the denominator is (1/2)^precision. Valid values are >= 0 and <= 7.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PageDistanceDisplayPrecision { get; set; }
Public Property PageDistanceDisplayPrecision As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace