RhinoCommon API
RhinoApp.Rhino2Id Property
Gets the ID of Rhino 2.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid Rhino2Id { get; }
Public Shared ReadOnly Property Rhino2Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoApp Class
Rhino Namespace