RhinoCommon API
DimensionStyle.DimRadialTextLocation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimRadialTextLocation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.TextLocation DimRadialTextLocation { get; set; }
Public Property DimRadialTextLocation As DimensionStyle.TextLocation
	Get
	Set
Property Value
Type: DimensionStyle.TextLocation
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace