RhinoCommon API
Brep.VariationalPatchSettings.SpanCountU Property
 Number of spans in U-direction
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int SpanCountU { get; set; }
Public Property SpanCountU As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace