RhinoCommon API
CustomRenderMeshProvider.Name Property
 The name of the provider for UI display.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public abstract string Name { get; }
Public MustOverride ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace