RhinoCommon API
Interval.T0 Property
 Gets or sets the lower bound of the Interval.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double T0 { get; set; }
Public Property T0 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Interval Structure
Rhino.Geometry Namespace