RhinoCommon API
ContentUuids.DefaultEnvironmentInstance Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.DefaultEnvironmentInstance"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid DefaultEnvironmentInstance { get; }
Public Shared ReadOnly Property DefaultEnvironmentInstance As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace