RhinoCommon API
ViewSettingsState.ZoomExtentsParallelViewBorder Property
 Border amount to apply to parallel viewport during zoom extents
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public double ZoomExtentsParallelViewBorder { get; set; }
Public Property ZoomExtentsParallelViewBorder As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace