RhinoCommon API
PlugIn.LoadAtStartup Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.PlugIns.PlugIn.LoadAtStartup"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use LoadTime virtual property instead")]
public virtual bool LoadAtStartup { get; }
<ObsoleteAttribute("Use LoadTime virtual property instead")>
Public Overridable ReadOnly Property LoadAtStartup As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace