RhinoCommon API
VisualAnalysisMode.Style Property
 Gets the visual analysis mode style.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public abstract VisualAnalysisMode.AnalysisStyle Style { get; }
Public MustOverride ReadOnly Property Style As VisualAnalysisMode.AnalysisStyle
	Get
Property Value
Type: VisualAnalysisMode.AnalysisStyle
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace