RhinoCommon API
MeshNgonList.UnsignedCount Property
 Gets or sets the number of mesh ngons.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint UnsignedCount { get; set; }
Public Property UnsignedCount As UInteger
	Get
	Set
Property Value
Type: UInt32
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace