RhinoCommon API
FileObjReadOptions.UseObjObjectsAs Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileObjReadOptions.UseObjObjectsAs"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileObjReadOptions.UseObjOsAs UseObjObjectsAs { get; set; }
Public Property UseObjObjectsAs As FileObjReadOptions.UseObjOsAs
	Get
	Set
Property Value
Type: FileObjReadOptions.UseObjOsAs
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace