RhinoCommon API
DisplayPipelineAttributes.PostProcessGamma Property
 Linear workflow Output image gamma
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public float PostProcessGamma { get; set; }
Public Property PostProcessGamma As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace