RhinoCommon API
RenderWindowClonedEventArgs.OldSessionId Property
[Missing <summary> documentation for "P:Rhino.Render.RenderWindowClonedEventArgs.OldSessionId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public Guid OldSessionId { get; }
Public ReadOnly Property OldSessionId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderWindowClonedEventArgs Class
Rhino.Render Namespace