RhinoCommon API
FileCsvDocument.Item Property
 Gets the value of a cell, addressed by column and row. Use TryGetString(Int32, Int32, String) for access that does not throw when the cell does not exist.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string this[
	int column,
	int row
] { get; }
Public ReadOnly Default Property Item (
	column As Integer,
	row As Integer
) As String
	Get
Parameters
column
Type: System.Int32
The zero-based column index (x).
row
Type: System.Int32
The zero-based row index (y).
Return Value
Type: String
The value of the cell.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when column or row is out of range.
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace