RhinoCommon API
FileCsvWriteOptions.AttributesTexts Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.AttributesTexts"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool AttributesTexts { get; set; }
Public Property AttributesTexts As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace