RhinoCommon API
RadialDimension.TextAngleType Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.TextAngleType"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override DimensionStyle.LeaderContentAngleStyle TextAngleType { get; set; }
Public Overrides Property TextAngleType As DimensionStyle.LeaderContentAngleStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderContentAngleStyle
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace