RhinoCommon API
MeshCheckParameters.CheckForDuplicateFaces Property
 If true, then look for faces that have vertices (not necessarily vertex indexes) that are identical.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool CheckForDuplicateFaces { get; set; }
Public Property CheckForDuplicateFaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace