RhinoCommon API
GripUserInterfaceObject.GripRadius Property
[Missing <summary> documentation for "P:Rhino.UI.GripUserInterfaceObject.GripRadius"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public float GripRadius { get; set; }
Public Property GripRadius As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
GripUserInterfaceObject Class
Rhino.UI Namespace