RhinoCommon API
ComponentStatus.IsLocked Property
 Returns true if locked. False otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsLocked { get; }
Public ReadOnly Property IsLocked As Boolean
	Get
Return Value
Type: Boolean
The component status for locked.
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace