RhinoCommon API
Linetype.LineCapStyle Property
 Defines how the ends of open curves should be drawn
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public LineCapStyle LineCapStyle { get; set; }
Public Property LineCapStyle As LineCapStyle
	Get
	Set
Property Value
Type: LineCapStyle
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace