RhinoCommon API
ViewEnableDrawingEventArgs.DocumentSerialNumber Property
 The serial number of the Rhino document.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public uint DocumentSerialNumber { get; }
Public ReadOnly Property DocumentSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
ViewEnableDrawingEventArgs Class
Rhino.Display Namespace