RhinoCommon API
FileReference.ContentHash Property
 Gets the content hash.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ContentHash ContentHash { get; }
Public ReadOnly Property ContentHash As ContentHash
	Get
Property Value
Type: ContentHash
See Also
Reference
FileReference Class
Rhino.FileIO Namespace