RhinoCommon API
PhysicallyBasedMaterial.OpacityRoughness Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.OpacityRoughness"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double OpacityRoughness { get; set; }
Public Property OpacityRoughness As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace