RhinoCommon API
Ray3d.Position Property
 Gets the starting position of this ray.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d Position { get; }
Public ReadOnly Property Position As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace