RhinoCommon API
PostEffectUuids.Glare Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.Glare"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid Glare { get; }
Public Shared ReadOnly Property Glare As Guid
	Get
Property Value
Type: Guid
Remarks
Obsolete; the Glare post effect was removed in Rhino 7.
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace