RhinoCommon API
HatchPatternTableEventArgs.OldState Property
 The old state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public HatchPattern OldState { get; }
Public ReadOnly Property OldState As HatchPattern
	Get
Property Value
Type: HatchPattern
See Also
Reference
HatchPatternTableEventArgs Class
Rhino.DocObjects.Tables Namespace