RhinoCommon API
DisplayPipelineAttributes.ShowClippingFills Property
 When a clipping plane intersects a 3-D object and the section is closed, the section is filled.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ShowClippingFills { get; set; }
Public Property ShowClippingFills As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace