RhinoCommon API
PhysicallyBasedMaterial.Alpha Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.Alpha"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public double Alpha { get; set; }
Public Property Alpha As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace