RhinoCommon API
FileSettingsState.AutoSaveEnabled Property
Enables or disables Rhino's automatic file saving mechanism.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool AutoSaveEnabled { get; set; }
Public Property AutoSaveEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace