RhinoCommon API
CurveKinkDefinition.CurvatureKinkZeroTolerance Property
 If the curvature <= CurvatureKinkZeroTolerance, then it is treated as zero curvature. Put another way, if (radius of curvature) * CurvatureKinkZeroTolerance >= 1, then the radius is treated as infinite. If CurvatureKinkZeroTolerance > 0, then the curvature kink test is scale dependent. If CurvatureKinkZeroTolerance = 0, then the curvature kink test is indpendent of scale.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double CurvatureKinkZeroTolerance { get; set; }
Public Property CurvatureKinkZeroTolerance As Double
	Get
	Set
Return Value
Type: Double
See Also
Reference
CurveKinkDefinition Class
Rhino.Geometry Namespace