RhinoCommon API
GripUserInterfaceObject.GripShape Property
[Missing <summary> documentation for "P:Rhino.UI.GripUserInterfaceObject.GripShape"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public GripUserInterfaceObjectShape GripShape { get; set; }
Public Property GripShape As GripUserInterfaceObjectShape
	Get
	Set
Property Value
Type: GripUserInterfaceObjectShape
See Also
Reference
GripUserInterfaceObject Class
Rhino.UI Namespace