RhinoCommon API
AppearanceSettingsState.ShowCrosshairs Property
Gets or sets a value that determines if cross hairs are visible.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ShowCrosshairs { get; set; }
Public Property ShowCrosshairs As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace