RhinoCommon API
SelectionFilterSettings.GlobalGeometryFilter Property
 The global geometry type filter controls which types of geometry will be filtered. Note, the filter can be a bitwise combination of multiple object types.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static ObjectType GlobalGeometryFilter { get; set; }
Public Shared Property GlobalGeometryFilter As ObjectType
	Get
	Set
Property Value
Type: ObjectType
See Also
Reference
SelectionFilterSettings Class
Rhino.ApplicationSettings Namespace