RhinoCommon API
StringParserSettings.ParseCommaAsDecimalPoint Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseCommaAsDecimalPoint"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseCommaAsDecimalPoint { get; set; }
Public Property ParseCommaAsDecimalPoint As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace