RhinoCommon API
DisplayPipelineAttributes.SubDNonManifoldEdgeThickness Property
 Edge thickness (pixels).
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public float SubDNonManifoldEdgeThickness { get; set; }
Public Property SubDNonManifoldEdgeThickness As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace