RhinoCommon API
Vector3f.YAxis Property
 Gets the value of the vector with components 0,1,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector3f YAxis { get; }
Public Shared ReadOnly Property YAxis As Vector3f
	Get
Property Value
Type: Vector3f
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace