RhinoCommon API
PostEffect.On Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffect.On"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool On { get; set; }
Public Property On As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace