RhinoCommon API
Font.PostScriptName Property
 Returns the Font PostScriptName - "Apple font name"
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public string PostScriptName { get; }
Public ReadOnly Property PostScriptName As String
	Get
Property Value
Type: String
See Also
Reference
Font Class
Rhino.DocObjects Namespace