RhinoCommon API
ObjectAttributes.ClippingPlaneLabelStyle Property
 Defines how a label for a clipping plane object should be shown
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public SectionLabelStyle ClippingPlaneLabelStyle { get; set; }
Public Property ClippingPlaneLabelStyle As SectionLabelStyle
	Get
	Set
Property Value
Type: SectionLabelStyle
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace