RhinoCommon API
ViewCaptureWriter.Pen.Dashed Property
[Missing <summary> documentation for "P:Rhino.Runtime.ViewCaptureWriter.Pen.Dashed"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.13
Syntax
public bool Dashed { get; }
Public ReadOnly Property Dashed As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ViewCaptureWriter.Pen Class
Rhino.Runtime Namespace