RhinoCommon API
RhinoDoc.RuntimeSerialNumber Property
 Unique serialNumber for the document while the application is running. This is not a persistent value.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint RuntimeSerialNumber { get; }
Public ReadOnly Property RuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RhinoDoc Class
Rhino Namespace