RhinoCommon API
RhinoApp.IsRunningUnattended Property
 Is Rhino running with no user available to answer a question. True when either IsRunningHeadless or IsRunningBatchMode is true.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool IsRunningUnattended { get; }
Public Shared ReadOnly Property IsRunningUnattended As Boolean
	Get
Property Value
Type: Boolean
Remarks
 Test this before showing any modal dialog. When it is true there is nobody to dismiss the dialog, so it will block until the process is killed. Write to the command line instead.
IsRunningAutomated is deliberately excluded. COM automation clients have driven a fully interactive Rhino since V4 and keep that behaviour unchanged; a caller that wants the unattended behaviour starts Rhino with /batchmode.
See Also
Reference
RhinoApp Class
Rhino Namespace