RhinoCommon API
PlugInInfo.IsDotNet Property
 Returns true if the plug-in is based on .NET, false otherwise.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsDotNet { get; }
Public ReadOnly Property IsDotNet As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace