RhinoCommon API
StackedDialogPage.Children Property
 List of child (sub) pages of this page
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public List<StackedDialogPage> Children { get; }
Public ReadOnly Property Children As List(Of StackedDialogPage)
	Get
Property Value
Type: List<StackedDialogPage>
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace