RhinoCommon API
DisplayPipelineAttributes.GroundPlaneUsage Property
 Turn on or off custom Ground plane settungs
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public DisplayPipelineAttributes.GroundPlaneUsages GroundPlaneUsage { get; set; }
Public Property GroundPlaneUsage As DisplayPipelineAttributes.GroundPlaneUsages
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.GroundPlaneUsages
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace