RhinoCommon API
DisplayPipelineAttributes.PlaneUsesGridColor Property
 If true, use the grid thin line color in App settings
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool PlaneUsesGridColor { get; set; }
Public Property PlaneUsesGridColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace