RhinoCommon API
ObjectAttributes.HatchBoundaryColorSource Property
 Source for the hatch boundary display color. Determines whether the boundary color is read from the layer, from the object's main attribute color, inherited from the parent, or read from the custom override color set by HatchBoundaryColor (ColorCustom).
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public ItemColorSource HatchBoundaryColorSource { get; set; }
Public Property HatchBoundaryColorSource As ItemColorSource
	Get
	Set
Property Value
Type: ItemColorSource
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace