RhinoCommon API
DisplayModeDescription.TechId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.TechId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid TechId { get; }
Public Shared ReadOnly Property TechId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace