RhinoCommon API
DimStyleTableEventArgs.NewState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTableEventArgs.NewState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle NewState { get; }
Public ReadOnly Property NewState As DimensionStyle
	Get
Property Value
Type: DimensionStyle
See Also
Reference
DimStyleTableEventArgs Class
Rhino.DocObjects.Tables Namespace