RhinoCommon API
SelectionFilterSettingsState.Enabled Property
 Enables or disables the global object selection filter.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SelectionFilterSettingsState Class
Rhino.ApplicationSettings Namespace