RhinoCommon API
AppearanceSettingsState.FeedbackColor Property
Gets or sets the feedback color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color FeedbackColor { get; set; }
Public Property FeedbackColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace