RhinoCommon API
RenderMaterial.MetalMaterialGuid Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.MetalMaterialGuid"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid MetalMaterialGuid { get; }
Public Shared ReadOnly Property MetalMaterialGuid As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace