RhinoCommon API
Transform2d.ZeroTransformation Property
 Gets a transform matrix in which every value is zero. This transformation maps every point to (0,0).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d ZeroTransformation { get; }
Public Shared ReadOnly Property ZeroTransformation As Transform2d
	Get
Property Value
Type: Transform2d
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace