RhinoCommon API
DisplayPipelineAttributes.UseLightColor Property
 Draw lights using light color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool UseLightColor { get; set; }
Public Property UseLightColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace