RhinoCommon API
DisplayConduit.GeometryFilter Property
 The geometry filter will ensure that your conduit's per-object functions will only be called for objects that are of certain geometry type
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public ObjectType GeometryFilter { get; set; }
Public Property GeometryFilter As ObjectType
	Get
	Set
Property Value
Type: ObjectType
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace