RhinoCommon API
DimensionStyle.StackHeightScale Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.StackHeightScale"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double StackHeightScale { get; set; }
Public Property StackHeightScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace