RhinoCommon API
AnnotationBase.AlternateDimensionLengthDisplay Property
 Alternate length display units and format
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.LengthDisplay AlternateDimensionLengthDisplay { get; set; }
Public Property AlternateDimensionLengthDisplay As DimensionStyle.LengthDisplay
	Get
	Set
Property Value
Type: DimensionStyle.LengthDisplay
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace