RhinoCommon API
AppearanceSettings.DirectionArrowIconHeadSize Property
 length of direction arrowhead icon in pixels.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static int DirectionArrowIconHeadSize { get; set; }
Public Shared Property DirectionArrowIconHeadSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace