RhinoCommon API
DisplayPipelineAttributes.ControlPolygonUseFixedSingleColor Property
 Specifies a color for the control polygon.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ControlPolygonUseFixedSingleColor { get; set; }
Public Property ControlPolygonUseFixedSingleColor As Boolean
	Get
	Set
Property Value
Type: Boolean
true = Use a specified color for all control polygons.
Property Value
Type: Boolean
false = Use the color specified in the object's Properties.
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace