RhinoCommon API
FileFbxWriteOptions.MapRhinoZtoFbxY Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileFbxWriteOptions.MapRhinoZtoFbxY"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool MapRhinoZtoFbxY { get; set; }
Public Property MapRhinoZtoFbxY As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileFbxWriteOptions Class
Rhino.FileIO Namespace