RhinoCommon API
DisplayPipelineAttributes.SubDCreaseInteriorEdgeColor Property
 Edge color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public Color SubDCreaseInteriorEdgeColor { get; set; }
Public Property SubDCreaseInteriorEdgeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace