RhinoCommon API
ObjectPropertiesPageEventArgs.Document Property
 Document containing the objects and views
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace