RhinoCommon API
DisplayPipelineAttributes.ShowSubDEdges Property
 Set visibility of SubD smooth edges.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public bool ShowSubDEdges { get; set; }
Public Property ShowSubDEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace