RhinoCommon API
ObjectAttributes.RenderMaterial Property
 Sets the render material for the object - higher level function for setting MaterialSource and MaterialIndex
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public RenderMaterial RenderMaterial { set; }
Public WriteOnly Property RenderMaterial As RenderMaterial
	Set
Property Value
Type: RenderMaterial
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace