RhinoCommon API
SelectionFilterSettingsState.SubObjectSelect Property
 Enables or disabled sub-object selection.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool SubObjectSelect { get; set; }
Public Property SubObjectSelect As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SelectionFilterSettingsState Class
Rhino.ApplicationSettings Namespace