RhinoCommon API
IOpenIDConnectToken.AllGroups Property
 Returns all the groups the user is a member of.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
IReadOnlyDictionary<string, RhinoAccountsGroup> AllGroups { get; }
ReadOnly Property AllGroups As IReadOnlyDictionary(Of String, RhinoAccountsGroup)
	Get
Property Value
Type: IReadOnlyDictionary<String, RhinoAccountsGroup>
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace