RhinoCommon API
RhinoReplaceObjectEventArgs.ObjectId Property
 The id of the existing object, or the object about to be deleted. At the time is called, this object has not been deleted.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid ObjectId { get; }
Public ReadOnly Property ObjectId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoReplaceObjectEventArgs Class
Rhino.DocObjects Namespace
RhinoDoc.ReplaceRhinoObject