RhinoCommon API
CustomDisplay.ClippingBox Property
 Gets the clipping box of this CustomDisplay.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox ClippingBox { get; }
Public ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace