RhinoCommon API
DisplayPipelineAttributes.GridTransparency Property
 Transparency of the grid, percentage (0-100)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int GridTransparency { get; set; }
Public Property GridTransparency As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace