RhinoCommon API
File3dmSettings.CurrentWireDensity Property
 The surface isocurve density new objects are created with. -1 draws no isocurves, 0 draws the surface edges only, and n > 0 draws n isocurves per span.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public int CurrentWireDensity { get; set; }
Public Property CurrentWireDensity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace