RhinoCommon API
SoftTransformSettings.MeasureDistanceAlong Property
 When true the distance for components affected by soft transform is calculated along the object. Otherwise world distance is used.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool MeasureDistanceAlong { get; set; }
Public Shared Property MeasureDistanceAlong As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SoftTransformSettings Class
Rhino.ApplicationSettings Namespace