RhinoCommon API
LicenseLeaseChangedEventArgs.Lease Property
 The lease returned by Rhino Accounts server
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LicenseLease Lease { get; }
Public ReadOnly Property Lease As LicenseLease
	Get
Property Value
Type: LicenseLease
See Also
Reference
LicenseLeaseChangedEventArgs Class
Rhino.PlugIns Namespace