RhinoCommon API
ThumbData.Tags Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.Tags"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public List<string> Tags { get; set; }
Public Property Tags As List(Of String)
	Get
	Set
Property Value
Type: List<String>
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace