RhinoCommon API
RdkSelectionNavigator.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.DataSources.RdkSelectionNavigator.CppPointer"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace