RhinoCommon API
FileReference.RelativePath Property
 Gets the relative path of this file reference.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string RelativePath { get; }
Public ReadOnly Property RelativePath As String
	Get
Property Value
Type: String
See Also
Reference
FileReference Class
Rhino.FileIO Namespace