RhinoCommon API
LightTable.DefaultLight Property
 Gets the default light that Rhino uses when no other lights illuminate the scene.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public LightObject DefaultLight { get; }
Public ReadOnly Property DefaultLight As LightObject
	Get
Property Value
Type: LightObject
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace