RhinoCommon API
RadialDimension.LeaderArrowType Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.LeaderArrowType"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.ArrowType LeaderArrowType { get; set; }
Public Property LeaderArrowType As DimensionStyle.ArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ArrowType
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace