RhinoCommon API
SerializationOptions.RhinoVersion Property
 Gets or sets a value indicating the Rhino version.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int RhinoVersion { get; set; }
Public Property RhinoVersion As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace