RhinoCommon API
File3dmSettings.LinetypeDisplayScale Property
The document-wide linetype pattern display scale.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public double LinetypeDisplayScale { get; set; }
Public Property LinetypeDisplayScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace