RhinoCommon API
DisplayPipeline.ZBiasMode Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.ZBiasMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ZBiasMode ZBiasMode { get; set; }
Public Property ZBiasMode As ZBiasMode
	Get
	Set
Property Value
Type: ZBiasMode
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace