RhinoCommon API
ContentUuids.BasicEnvironmentCCI Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.BasicEnvironmentCCI"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid BasicEnvironmentCCI { get; }
Public Shared ReadOnly Property BasicEnvironmentCCI As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace