RhinoCommon API
RenderContentEventArgs.Content Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentEventArgs.Content"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public RenderContent Content { get; }
Public ReadOnly Property Content As RenderContent
	Get
Property Value
Type: RenderContent
See Also
Reference
RenderContentEventArgs Class
Rhino.Render Namespace