RhinoCommon API
PostEffectUuids.HueSatLum Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.HueSatLum"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid HueSatLum { get; }
Public Shared ReadOnly Property HueSatLum As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace