RhinoCommon API
File3dmViewTable.Item Property
 Gets the view info at an index. The set method always throws NotSupportedException.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewInfo this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As ViewInfo
	Get
Parameters
index
Type: System.Int32
The index of the item to search for.
Return Value
Type: ViewInfo
A non-null instance, or an exception is thrown.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If index is invalid.
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace