RhinoCommon API
RhinoObject.IsDeletable Property
 Some objects cannot be deleted, like grips on lights and annotation objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsDeletable { get; protected set; }
Public Property IsDeletable As Boolean
	Get
	Protected Set
Property Value
Type: Boolean
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace