RhinoCommon API
RenderContentType.InternalName Property
 Returns the internal name identifier associated with this type.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string InternalName { get; }
Public ReadOnly Property InternalName As String
	Get
Property Value
Type: String
See Also
Reference
RenderContentType Class
Rhino.Render Namespace