RhinoCommon API
GumballSettingsState.EnableGumball Property
 Turns the gumball widget on any time objects are selected.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool EnableGumball { get; set; }
Public Property EnableGumball As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace