RhinoCommon API
RadialDimension.CenterPoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.CenterPoint"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point2d CenterPoint { get; set; }
Public Property CenterPoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace