RhinoCommon API
Sun.TimeZone Property
 The observer's time zone measured in hours relative to UTC.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public double TimeZone { get; set; }
Public Property TimeZone As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Sun Class
Rhino.Render Namespace