RhinoCommon API
MeshCheckParameters.RandomFaceNormalCount Property
 Gets the total count of random face normals for all meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int RandomFaceNormalCount { get; }
Public ReadOnly Property RandomFaceNormalCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace