RhinoCommon API
ICurrentEnvironment_Get.ForBackground_CheckMode Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment_Get.ForBackground_CheckMode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Same as ForBackground. Please use ForBackground")]
RenderEnvironment ForBackground_CheckMode { get; }
<ObsoleteAttribute("Same as ForBackground. Please use ForBackground")>
ReadOnly Property ForBackground_CheckMode As RenderEnvironment
	Get
Property Value
Type: RenderEnvironment
See Also
Reference
ICurrentEnvironment_Get Interface
Rhino.Render Namespace