RhinoCommon API
HatchPattern.Description Property
 Gets and sets a short description of the pattern.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace