RhinoCommon API
Hatch.Plane Property
 Gets or sets the hatch plane
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Hatch Class
Rhino.Geometry Namespace