RhinoCommon API
LicenseIdAttribute.Value Property
[Missing <summary> documentation for "P:Rhino.PlugIns.LicenseIdAttribute.Value"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Value { get; }
Public ReadOnly Property Value As String
	Get
Property Value
Type: String
See Also
Reference
LicenseIdAttribute Class
Rhino.PlugIns Namespace