RhinoCommon API
ToolbarGroup.Name Property
 Gets the name of the toolbar group.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
ToolbarGroup Class
Rhino.UI Namespace