RhinoCommon API
SmartTrackSettingsState.SemiPermanentPoints Property
 Toggles the retaining of captured points for the duration of a command as opposed to discarding them after each mouse click. For example, when you use the Copy command, clicking the mouse to place an object does not clear the existing smart points.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SemiPermanentPoints { get; set; }
Public Property SemiPermanentPoints As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace