RhinoCommon API
LinetypeTableEventArgs.NewState Property
 The new state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Linetype NewState { get; }
Public ReadOnly Property NewState As Linetype
	Get
Property Value
Type: Linetype
See Also
Reference
LinetypeTableEventArgs Class
Rhino.DocObjects.Tables Namespace