RhinoCommon API
ModelAidSettingsState.NudgeMode Property
0 = world, 1 = cplane, 2 = view, 3 = UVN, -1 = not set.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int NudgeMode { get; set; }
Public Property NudgeMode As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace