RhinoCommon API
GumballSettingsState.SnappyGumball Property
 If true, snaps to object snap locations. if false, ignores object snap locations.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SnappyGumball { get; set; }
Public Property SnappyGumball As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace