RhinoCommon API
CustomPostEffectAttribute.CanDisplayHelp Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.CustomPostEffectAttribute.CanDisplayHelp"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool CanDisplayHelp { get; set; }
Public Property CanDisplayHelp As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CustomPostEffectAttribute Class
Rhino.Render.PostEffects Namespace