RhinoCommon API
RhinoDoc.ModelAngleToleranceRadians Property
Model space angle tolerance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ModelAngleToleranceRadians { get; set; }
Public Property ModelAngleToleranceRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RhinoDoc Class
Rhino Namespace