RhinoCommon API
SimpleArrayGuid.Capacity Property
 The capacity for the array
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public int Capacity { get; set; }
Public Property Capacity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SimpleArrayGuid Class
Rhino.Runtime.InteropWrappers Namespace