RhinoCommon API
RhinoApp.Rhino6Id Property
Gets the ID of Rhino 6
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Guid Rhino6Id { get; }
Public Shared ReadOnly Property Rhino6Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoApp Class
Rhino Namespace