RhinoCommon API
HostUtils.RunningOnOSX Property
 Tests if this process is currently executing on the Mac OSX platform.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool RunningOnOSX { get; }
Public Shared ReadOnly Property RunningOnOSX As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace