RhinoCommon API
GetCurve.SubDFriendly Property
 When true, the result is a cubic, uniform, non-rational curve that is either periodic or has zero second derivatives at both ends. Default is false. Setting this to true sets Degree to 3, because a SubD friendly curve is always cubic. While this is true, KnotSpacing, StartTangent and EndTangent are ignored.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SubDFriendly { get; set; }
Public Property SubDFriendly As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace