RhinoCommon API
RenderContent.Parent Property
 Returns the top content in this parent/child chain.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public RenderContent Parent { get; }
Public ReadOnly Property Parent As RenderContent
	Get
Property Value
Type: RenderContent
See Also
Reference
RenderContent Class
Rhino.Render Namespace