RhinoCommon API
RhinoApp.BuildDate Property
 Gets the build date.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static DateTime BuildDate { get; }
Public Shared ReadOnly Property BuildDate As DateTime
	Get
Property Value
Type: DateTime
See Also
Reference
RhinoApp Class
Rhino Namespace