RhinoCommon API
PostEffectData.Shown Property
 The 'shown' state of this post effect.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Shown { get; set; }
Public Property Shown As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PostEffectData Class
Rhino.Render.PostEffects Namespace