RhinoCommon API
InstanceDefinitionGeometry.SourceArchive Property
 Gets the full file path for linked instance definitions.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string SourceArchive { get; }
Public ReadOnly Property SourceArchive As String
	Get
Property Value
Type: String
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace