RhinoCommon API
StackedDialogPage.LocalPageTitle Property
 Localized page title that will appear on a tab or other page navigation control. This is also uses as a command line option when scripting this page.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual string LocalPageTitle { get; }
Public Overridable ReadOnly Property LocalPageTitle As String
	Get
Property Value
Type: String
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace