RhinoCommon API
File3dmRenderContent.GroupId Property
The content's group id.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid GroupId { get; }
Public ReadOnly Property GroupId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace