RhinoCommon API
AppearanceSettings.CommandPromptHypertextColor Property
 Gets or sets the color of the command prompt hypertext.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color CommandPromptHypertextColor { get; set; }
Public Shared Property CommandPromptHypertextColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace