RhinoCommon API
CursorTooltipSettings.AutoSuppress Property
 Attempts to display only the most useful tooltip.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool AutoSuppress { get; set; }
Public Shared Property AutoSuppress As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace