RhinoCommon API
SurfaceCurvature.MinimumRadius Property
 The minimum radius of curvature is 1/max(fabs(kappa1),fabs(kappa2)). Infinite radius values are returned as RhinoMath.InfiniteRadius.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double MinimumRadius { get; }
Public ReadOnly Property MinimumRadius As Double
	Get
Property Value
Type: Double
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace