RhinoCommon API
RealtimeDisplayMode.PostEffectsOn Property
[Missing <summary> documentation for "P:Rhino.Render.RealtimeDisplayMode.PostEffectsOn"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool PostEffectsOn { get; set; }
Public Property PostEffectsOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace