RhinoCommon API
WorksessionFileModel.FullPath Property
 Gets or sets the full path of the model file, as saved. Nothing checks that it exists.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string FullPath { get; set; }
Public Property FullPath As String
	Get
	Set
Property Value
Type: String
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace