RhinoCommon API
GumballSettings.ExtrudeBallSize Property
 Specifies the size of the extrude dots in pixels.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int ExtrudeBallSize { get; set; }
Public Shared Property ExtrudeBallSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace