RhinoCommon API
City.Longitude Property
 Gets longitude of city.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Longitude { get; }
Public ReadOnly Property Longitude As Double
	Get
Property Value
Type: Double
See Also
Reference
City Class
Rhino.Render Namespace