RhinoCommon API
MarkupTableEventArgs.Index Property
The index of the markup.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MarkupTableEventArgs Class
Rhino.DocObjects.Tables Namespace