RhinoCommon API
ProviderIds.ContentChildSlot Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.ContentChildSlot"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public static Guid ContentChildSlot { get; }
Public Shared ReadOnly Property ContentChildSlot As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace