RhinoCommon API
Texture.Repeat Property
 Helper for access to the repeat value encoded in UvwTransform
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Vector2d Repeat { get; set; }
Public Property Repeat As Vector2d
	Get
	Set
Property Value
Type: Vector2d
See Also
Reference
Texture Class
Rhino.DocObjects Namespace