RhinoCommon API
File3dmThickening.Solid Property
 Specifies whether to make open meshes solid by adding walls when thickening.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Solid { get; set; }
Public Property Solid As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmThickening Class
Rhino.FileIO Namespace