RhinoCommon API
Layer.LayerIndex Property
Note: This API is now obsolete.
 Gets or sets the index of this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use the Index property.")]
public int LayerIndex { get; set; }
<ObsoleteAttribute("Use the Index property.")>
Public Property LayerIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Layer Class
Rhino.DocObjects Namespace