RhinoCommon API
RhinoObjectSelectionEventArgs.Selected Property
 Returns true if objects are being selected. Returns false if objects are being deselected.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Selected { get; }
Public ReadOnly Property Selected As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoObjectSelectionEventArgs Class
Rhino.DocObjects Namespace