RhinoCommon API
CommandLineOption.LocalName Property
 The localized command option name
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.24
Syntax
public string LocalName { get; }
Public ReadOnly Property LocalName As String
	Get
Property Value
Type: String
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace