RhinoCommon API
LengthUnit.DisplayName Property
Upper case plural localized unit name.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string DisplayName { get; }
Public ReadOnly Property DisplayName As String
	Get
Property Value
Type: String
See Also
Reference
LengthUnit Structure
Rhino Namespace