RhinoCommon API
Triangle3d.BC Property
 Gets the triangle edge connecting the B and C corners.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Line BC { get; }
Public ReadOnly Property BC As Line
	Get
Property Value
Type: Line
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace