RhinoCommon API
RuiUpdateUi.RadioChecked Property
Set to true to enable menu item or false to check menu item
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public bool RadioChecked { get; set; }
Public Property RadioChecked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace