RhinoCommon API
PhysicallyBased.AmbientOcclusion Property
[Missing <summary> documentation for "P:Rhino.Render.ParameterNames.PhysicallyBased.AmbientOcclusion"]
 Namespace: Rhino.Render.ParameterNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string AmbientOcclusion { get; }
Public Shared ReadOnly Property AmbientOcclusion As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ParameterNames Namespace