RhinoCommon API
SubDCreationOptions.ConvexCornersAndInteriorCreases Property
 Look for convex corners at sub-D vertices with 2 edges or fewer that have an included angle ≤ 120 degrees.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static SubDCreationOptions ConvexCornersAndInteriorCreases { get; }
Public Shared ReadOnly Property ConvexCornersAndInteriorCreases As SubDCreationOptions
	Get
Property Value
Type: SubDCreationOptions
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace