RhinoCommon API
CommandLineOption.OptionType Property
 The type of this command line option
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public CommandLineOptionType OptionType { get; }
Public ReadOnly Property OptionType As CommandLineOptionType
	Get
Property Value
Type: CommandLineOptionType
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace