RhinoCommon API
AppearanceSettingsState.GridZAxisLineColor Property
Gets or sets the color of Z axis line in the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color GridZAxisLineColor { get; set; }
Public Property GridZAxisLineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace