RhinoCommon API
ObjectAttributes.HatchBoundaryPlotColor Property
 Hatch boundary plot color override. Default is unset color which means use the standard attributes and layer colors to determine the boundary color
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color HatchBoundaryPlotColor { get; set; }
Public Property HatchBoundaryPlotColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace