RhinoCommon API
FileSettingsState.TemplateFileDir Property
 Gets or sets the directory used for template files.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string TemplateFileDir { get; set; }
Public Property TemplateFileDir As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace