RhinoCommon API
Light.Specular Property
 Gets or sets the specular color.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color Specular { get; set; }
Public Property Specular As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Light Class
Rhino.Geometry Namespace