RhinoCommon API
RhinoDoc.ModelUnitSystem Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.ModelUnitSystem"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public UnitSystem ModelUnitSystem { get; set; }
Public Property ModelUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
RhinoDoc Class
Rhino Namespace