RhinoCommon API
SelectionFilterSettings.SubObjectSelect Property
 Enables or disabled sub-object selection.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool SubObjectSelect { get; set; }
Public Shared Property SubObjectSelect As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SelectionFilterSettings Class
Rhino.ApplicationSettings Namespace