RhinoCommon API
DisplayPipelineAttributes.RealtimeDisplayId Property
 Get the ID of the real-time display engine attached to the view. This will be Guid.Empty if no real-time display engine is in use. This can be the case for instance when starting a _Render session for a real-time viewport integration. That still would cause this ID to be Guid.Empty.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid RealtimeDisplayId { get; }
Public ReadOnly Property RealtimeDisplayId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace