RhinoCommon API
MeshPrincipalCurvatureList.Capacity Property
 Gets or sets the total number of principal curvatures the internal data structure can hold without resizing.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Capacity { get; set; }
Public Property Capacity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshPrincipalCurvatureList Class
Rhino.Geometry.Collections Namespace