RhinoCommon API
MeshCheckParameters.CheckForDisjointMeshes Property
 If true, then look for faces in the mesh that are totally isolated from other faces in the mesh. (i.e. an island of faces, or many islands, that have a boundary of naked edges)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool CheckForDisjointMeshes { get; set; }
Public Property CheckForDisjointMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace