RhinoCommon API
SweepTwoRail.UseLegacySweeper Property
 Set to true if you want to use the legacy, low-level sweeper found in earlier versions of Rhino.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public bool UseLegacySweeper { get; set; }
Public Property UseLegacySweeper As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace