RhinoCommon API
DisplayPipelineAttributes.GridPlaneTransparency Property
 Transparency of the grid plane, percentage (0-100)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int GridPlaneTransparency { get; set; }
Public Property GridPlaneTransparency As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace