RhinoCommon API
MeshingParameters.GridMaxCount Property
 Gets or sets the maximum number of grid quads in the initial sampling grid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int GridMaxCount { get; set; }
Public Property GridMaxCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace