RhinoCommon API
RealtimeDisplayMode.Locked Property
[Missing <summary> documentation for "P:Rhino.Render.RealtimeDisplayMode.Locked"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.6
Syntax
public bool Locked { get; set; }
Public Property Locked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace