RhinoCommon API
CreatePreviewEventArgs.ContentTypeId Property
 The class Id of content that preview is being generated for.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid ContentTypeId { get; }
Public ReadOnly Property ContentTypeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace