RhinoCommon API
RuiUpdateUi.FileId Property
Id of the RUI file that owns this menu item
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public Guid FileId { get; }
Public ReadOnly Property FileId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace