RhinoCommon API
RhinoDoc.ModelUnits Property
Length unit used on model space.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public LengthUnit ModelUnits { get; set; }
Public Property ModelUnits As LengthUnit
	Get
	Set
Property Value
Type: LengthUnit
See Also
Reference
RhinoDoc Class
Rhino Namespace