RhinoCommon API
File3dmEmbeddedFile.ComponentType Property
 Returns EmbeddedFile.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
File3dmEmbeddedFile Class
Rhino.FileIO Namespace