RhinoCommon API
RTreeEventArgs.SearchBoundingBox Property
 Bounding box bounds used during a search. You may modify the box in a search callback to help reduce the bounds to search.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox SearchBoundingBox { get; set; }
Public Property SearchBoundingBox As BoundingBox
	Get
	Set
Property Value
Type: BoundingBox
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace