RhinoCommon API
FileDwgWriteOptions.CurveMaxAngleRadians Property
Angle between pline segments in writing curve
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double CurveMaxAngleRadians { get; set; }
Public Property CurveMaxAngleRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace