RhinoCommon API
FileWriteOptions.FileTypeIndex Property
 Returns the FileTypeIndex that identifies the extension the file writing plugin will create.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int FileTypeIndex { get; }
Public ReadOnly Property FileTypeIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace