RhinoCommon API
Triangle3d.AB Property
 Gets the triangle edge connecting the A and B corners.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Line AB { get; }
Public ReadOnly Property AB As Line
	Get
Property Value
Type: Line
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace