RhinoCommon API
TrulyObservableOrderedSet<T>.Count Property
 Returns the total number of items in the set.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace