RhinoCommon API
FileSkpReadOptions.EmbedTexturesInModel Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSkpReadOptions.EmbedTexturesInModel"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool EmbedTexturesInModel { get; set; }
Public Property EmbedTexturesInModel As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSkpReadOptions Class
Rhino.FileIO Namespace