RhinoCommon API
ReduceMeshParameters.LockedComponents Property
List of topological mesh vertices and mesh vertices that will not be moved or deleted in reduction process. Each mesh vertex will lock the corresponding topological mesh vertex. In other words it is not possible to have a locked and non-locked mesh vertex at the same location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ComponentIndex[] LockedComponents { get; set; }
Public Property LockedComponents As ComponentIndex()
	Get
	Set
Property Value
Type: ComponentIndex[]
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace