RhinoCommon API
AnnotationBase.DecimalSeparator Property
 Set or get the decimal separator c
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public char DecimalSeparator { get; set; }
Public Property DecimalSeparator As Char
	Get
	Set
Property Value
Type: Char
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace