RhinoCommon API
SmartTrackSettings.UseSmartTrack Property
Gets or sets if the Smart Track feature is active.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool UseSmartTrack { get; set; }
Public Shared Property UseSmartTrack As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace