RhinoCommon API
File3dmThickening.Distance Property
 Specifies how thick meshes will be made.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double Distance { get; set; }
Public Property Distance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmThickening Class
Rhino.FileIO Namespace