RhinoCommon API
SubD.Edges Property
 All edges in this SubD
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDEdgeList Edges { get; }
Public ReadOnly Property Edges As SubDEdgeList
	Get
Property Value
Type: SubDEdgeList
See Also
Reference
SubD Class
Rhino.Geometry Namespace