RhinoCommon API
ObjectPropertiesPageEventArgs.EventRuntimeSerialNumber Property
 Gets the runtime serial number.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public uint EventRuntimeSerialNumber { get; }
Public ReadOnly Property EventRuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
The runtime serial number.
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace