RhinoCommon API
Mesh.IsOriented Property
 Returns true if the mesh is manifold and every pair of faces that share an "edge" have compatible orientations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public bool IsOriented { get; }
Public ReadOnly Property IsOriented As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Mesh Class
Rhino.Geometry Namespace