RhinoCommon API
File3dmEdgeSoftening.Softening Property
 The softening radius.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double Softening { get; set; }
Public Property Softening As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmEdgeSoftening Class
Rhino.FileIO Namespace