RhinoCommon API
AppearanceSettings.ShowCrosshairs Property
Gets or sets a value that determines if cross hairs are visible.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool ShowCrosshairs { get; set; }
Public Shared Property ShowCrosshairs As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace