RhinoCommon API
EmapAnalysisSettingsState.BlendWithObjectColor Property
 Gets or sets whether to blend the image with the object's color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool BlendWithObjectColor { get; set; }
Public Property BlendWithObjectColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
EmapAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace