RhinoCommon API
MatchSrfSettings.RefineMatch Property
 Add control point rows to the surface if necessary
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public bool RefineMatch { get; }
Public ReadOnly Property RefineMatch As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MatchSrfSettings Class
Rhino.Geometry Namespace