RhinoCommon API
UserInterfaceSlider.DisplayValue Property
 Should the slider display the current value as text on the screen
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool DisplayValue { get; set; }
Public Property DisplayValue As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
UserInterfaceSlider Class
Rhino.UI Namespace