RhinoCommon API
AnimationProperties.CaptureMethod Property
 Gets or sets the capture method of the animation which is either preview or full.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public string CaptureMethod { get; set; }
Public Property CaptureMethod As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace