RhinoCommon API
SubDEdgeSharpness.IsNotValidNorCrease Property
 Gets the opposite of IsValidOrCrease. Nan is true and Crease is false.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool IsNotValidNorCrease { get; }
Public ReadOnly Property IsNotValidNorCrease As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace