RhinoCommon API
Decal.TextureInstanceId Property
 Gets the asset instance id for this decal. This is the instance id of a material or texture.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public Guid TextureInstanceId { get; set; }
Public Property TextureInstanceId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Decal Class
Rhino.Render Namespace