RhinoCommon API
Layer.IsReference Property
 Gets a value indicting whether this layer is a referenced layer. Referenced layers are part of referenced documents.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override bool IsReference { get; }
Public Overrides ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Layer Class
Rhino.DocObjects Namespace