RhinoCommon API
ModelAidSettings.AutoCPlaneAlignment Property
 //0 = object, 1 = world, 2 = view
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static int AutoCPlaneAlignment { get; set; }
Public Shared Property AutoCPlaneAlignment As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace