RhinoCommon API
SubD.IsSolid Property
 Test SubD to see if the active level is a solid. A "solid" is a closed oriented manifold, or a closed oriented manifold.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool IsSolid { get; }
Public ReadOnly Property IsSolid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubD Class
Rhino.Geometry Namespace