RhinoCommon API
RhinoDoc.Linetypes Property
 Linetypes in the document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public LinetypeTable Linetypes { get; }
Public ReadOnly Property Linetypes As LinetypeTable
	Get
Property Value
Type: LinetypeTable
See Also
Reference
RhinoDoc Class
Rhino Namespace