RhinoCommon API
FileAiWriteOptions.OrderLayers Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileAiWriteOptions.OrderLayers"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool OrderLayers { get; set; }
Public Property OrderLayers As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileAiWriteOptions Class
Rhino.FileIO Namespace