RhinoCommon API
NamedPositionTable.Ids Property
Array of Named Position Guids.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid[] Ids { get; }
Public ReadOnly Property Ids As Guid()
	Get
Return Value
Type: Guid[]
 Guid array of each Named Position in the document.
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace