RhinoCommon API
PostEffect.PostEffectType Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffect.PostEffectType"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PostEffectType PostEffectType { get; }
Public ReadOnly Property PostEffectType As PostEffectType
	Get
Property Value
Type: PostEffectType
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace