RhinoCommon API
GetCylinder.Height Property
 Height of cylinder
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace