RhinoCommon API
UserInterfaceGrid.RowSeparators Property
 Draw a horizontal line between every pair of rows. Off by default.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool RowSeparators { get; set; }
Public Property RowSeparators As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace