RhinoCommon API
ArchivableDictionary.Keys Property
Gets all entry names or keys.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string[] Keys { get; }
Public ReadOnly Property Keys As String()
	Get
Property Value
Type: String[]
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace