RhinoCommon API
SmartTrackSettings.ActivationDelayMilliseconds Property
Gets or sets the activation delay in milliseconds.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int ActivationDelayMilliseconds { get; set; }
Public Shared Property ActivationDelayMilliseconds As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace