RhinoCommon API
DisplayModeDescription.PipelineLocked Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.PipelineLocked"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool PipelineLocked { get; set; }
Public Property PipelineLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace