RhinoCommon API
Dimension.FixedLengthExtensionOn Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.FixedLengthExtensionOn"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool FixedLengthExtensionOn { get; set; }
Public Property FixedLengthExtensionOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dimension Class
Rhino.Geometry Namespace