RhinoCommon API
AppearanceSettingsState.SelectionWindowFillColor Property
 Gets or sets the color used to fill a selection window
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Color SelectionWindowFillColor { get; set; }
Public Property SelectionWindowFillColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace