RhinoCommon API
PhysicallyBased.Specular Property
[Missing <summary> documentation for "P:Rhino.Render.ParameterNames.PhysicallyBased.Specular"]
 Namespace: Rhino.Render.ParameterNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Specular { get; }
Public Shared ReadOnly Property Specular As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ParameterNames Namespace