RhinoCommon API
SubDEdge.IsSharp Property
 Gets true if this edge is smooth and has a nonzero sharpness. A crease edge is not a sharp edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool IsSharp { get; }
Public ReadOnly Property IsSharp As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace