RhinoCommon API
AnnotationBase.UseKerning Property
 Use kerning data in font to set distances between glyphs
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UseKerning { get; set; }
Public Property UseKerning As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace