RhinoCommon API
RealtimeDisplayMode.Paused Property
[Missing <summary> documentation for "P:Rhino.Render.RealtimeDisplayMode.Paused"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.6
Syntax
public bool Paused { get; set; }
Public Property Paused As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace