RhinoCommon API
Decal.CRC Property
 The decal CRC identifies a decal by its state. Multiple decals which would be exactly the same would have the same CRC and are culled from the system. If you store this value with the intention of using it to find the decal again later, you must update your stored value whenever the decal state changes. You can detect when a decal changes by watching for the legacy OnUserDataTransformed event or the newer custom event uuidEventDecalUserDataTransformed.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int CRC { get; }
Public ReadOnly Property CRC As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Decal Class
Rhino.Render Namespace