RhinoCommon API
Material.Reflectivity Property
 Gets or sets how reflective a material is, 0f is no reflection 1f is 100% reflective.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public double Reflectivity { get; set; }
Public Property Reflectivity As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Material Class
Rhino.DocObjects Namespace