RhinoCommon API
Dimension.ToleranceLowerValue Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ToleranceLowerValue"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ToleranceLowerValue { get; set; }
Public Property ToleranceLowerValue As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace