RhinoCommon API
CorruptGeometryException.Pointer Property
 pointer to base geometry (ON_Object*)
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public IntPtr Pointer { get; }
Public ReadOnly Property Pointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
CorruptGeometryException Class
Rhino.Runtime Namespace