RhinoCommon API
CustomPostEffectAttribute.ExecuteWhileRenderingOption Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.CustomPostEffectAttribute.ExecuteWhileRenderingOption"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PostEffectExecuteWhileRenderingOptions ExecuteWhileRenderingOption { get; set; }
Public Property ExecuteWhileRenderingOption As PostEffectExecuteWhileRenderingOptions
	Get
	Set
Property Value
Type: PostEffectExecuteWhileRenderingOptions
See Also
Reference
CustomPostEffectAttribute Class
Rhino.Render.PostEffects Namespace