RhinoCommon API
Linetype.ComponentType Property
 Returns LinePattern.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace