RhinoCommon API
FileReference.FullPathStatus Property
 Gets the file reference status.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public FileReferenceStatus FullPathStatus { get; }
Public ReadOnly Property FullPathStatus As FileReferenceStatus
	Get
Property Value
Type: FileReferenceStatus
See Also
Reference
FileReference Class
Rhino.FileIO Namespace