RhinoCommon API
ContentUuids.GraniteTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.GraniteTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid GraniteTextureType { get; }
Public Shared ReadOnly Property GraniteTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace