RhinoCommon API
DimensionStyle.TextUnderlined Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextUnderlined"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TextUnderlined { get; set; }
Public Property TextUnderlined As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace