RhinoCommon API
DimensionStyle.LengthFactor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LengthFactor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double LengthFactor { get; set; }
Public Property LengthFactor As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace