RhinoCommon API
TextFields.InstanceAttributeField.Key Property
 Attribute key
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string Key { get; }
Public ReadOnly Property Key As String
	Get
Property Value
Type: String
See Also
Reference
TextFields.InstanceAttributeField Class
Rhino.Runtime Namespace