RhinoCommon API
DimensionStyle.MaskColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.MaskColor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Color MaskColor { get; set; }
Public Property MaskColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace