RhinoCommon API
ModelAidSettings.StickyAutoCPlane Property
 Gets or set whether the auto cplane will stay even after deselection
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool StickyAutoCPlane { get; set; }
Public Shared Property StickyAutoCPlane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace