RhinoCommon API
RenderPrimitiveList.Count Property
 Number of meshes in this list
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace