RhinoCommon API
CursorTooltipSettingsState.Offset Property
 The x and y distances in pixels from the cursor location to the tooltip.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point Offset { get; set; }
Public Property Offset As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace