RhinoCommon API
ShrinkWrapParameters.Offset Property
 Distance to offset outward or inward
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double Offset { get; set; }
Public Property Offset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ShrinkWrapParameters Class
Rhino.Geometry Namespace