RhinoCommon API
Dimension.DistanceScale Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.DistanceScale"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double DistanceScale { get; set; }
Public Property DistanceScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace