RhinoCommon API
FileUsdWriteOptions.IncludeUserStrings Property
 Includes user strings in prim data
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IncludeUserStrings { get; set; }
Public Property IncludeUserStrings As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileUsdWriteOptions Class
Rhino.FileIO Namespace