RhinoCommon API
File3dmRenderContent.IsChild Property
True if this is a child of another render content (i.e., has a parent; is not top-level).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsChild { get; }
Public ReadOnly Property IsChild As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace