RhinoCommon API
Notification.AllowedAssemblies Property
 The assemblies that can modify this instance.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ICollection<Assembly> AllowedAssemblies { get; }
Public ReadOnly Property AllowedAssemblies As ICollection(Of Assembly)
	Get
Property Value
Type: ICollection<Assembly>
Remarks
If empty, any assembly is allowed to edit the instance. You may specify additional assemblies that should have access to an instance at creation time.
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace