RhinoCommon API
FileWriteOptions.IncludePreviewImage Property
 The file written should include a preview image if your File Writing Plug-in supports it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IncludePreviewImage { get; set; }
Public Property IncludePreviewImage As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace