RhinoCommon API
HistorySettings.UpdateEnabled Property
 When history update is enabled, dependent objects are automatically updated when an antecedent is modified.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool UpdateEnabled { get; set; }
Public Shared Property UpdateEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
HistorySettings Class
Rhino.ApplicationSettings Namespace