RhinoCommon API
MeshExtruder.Transform Property
 Transform of extrusion
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public Transform Transform { get; set; }
Public Property Transform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace