RhinoCommon API
GetPolyline.ThirdPointPrompt Property
Prompt when getting third point
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string ThirdPointPrompt { get; set; }
Public Property ThirdPointPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace