RhinoCommon API
FileObjWriteOptions.CreateNgons Property
Note: This API is now obsolete.
 Setting to enable/disable the creation of ngons for the output
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use NgonMode.")]
public bool CreateNgons { get; set; }
<ObsoleteAttribute("Use NgonMode.")>
Public Property CreateNgons As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace