RhinoCommon API
StringParserSettings.ParseSettingsRationalNumber Property
 - The rational number settings parse and optional unary + or unary - and then parse one or more digits.If a rational number fraction bar follows the last digit in the numerator, then it is parsed and an integer denominator is parsed.The denominator cannot have a unary + or - preceding the digits.Parsing stops after the last digit in the denominator.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static StringParserSettings ParseSettingsRationalNumber { get; }
Public Shared ReadOnly Property ParseSettingsRationalNumber As StringParserSettings
	Get
Property Value
Type: StringParserSettings
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace