RhinoCommon API
Layer.IsReferenceParentLayer Property
 Returns true if the layer is a parent layer of the layer tree from a linked instance definition or the layer tree from a worksession reference model.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsReferenceParentLayer { get; }
Public ReadOnly Property IsReferenceParentLayer As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Layer Class
Rhino.DocObjects Namespace