RhinoCommon API
ToolbarFileCollection.SidebarIsVisible Property
 Returns true if the sizebar is visible.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool SidebarIsVisible { get; set; }
Public Shared Property SidebarIsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace