RhinoCommon API
HiddenLineDrawing.Viewport Property
 Returns the ViewportInfo used by the hidden line drawing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ViewportInfo Viewport { get; }
Public ReadOnly Property Viewport As ViewportInfo
	Get
Return Value
Type: ViewportInfo
The ViewportInfo
See Also
Reference
HiddenLineDrawing Class
Rhino.Geometry Namespace