RhinoCommon API
FileIgsWriteOptions.Units Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.Units"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public UnitSystem Units { get; set; }
Public Property Units As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace