RhinoCommon API
ChooseOneObjectSettingsState.ShowTitlebarAndBorder Property
ShowTitlebarAndBorder
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ShowTitlebarAndBorder { get; set; }
Public Property ShowTitlebarAndBorder As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace