RhinoCommon API
StringParserSettings.ParseSettingsRealNumber Property
 - The real number settings parse and optional unary + or unary - and then parse a number that can be integer, decimal, scientific e notation or pi.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static StringParserSettings ParseSettingsRealNumber { get; }
Public Shared ReadOnly Property ParseSettingsRealNumber As StringParserSettings
	Get
Property Value
Type: StringParserSettings
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace