RhinoCommon API
ChooseOneObjectSettings.HighlightColor Property
HighlightColor
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Color HighlightColor { get; set; }
Public Shared Property HighlightColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace