RhinoCommon API
RhinoObjectAnalysisModeChangedEventArgs.TheObject Property
 The Rhino object whose visual analysis mode changed.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RhinoObject TheObject { get; }
Public ReadOnly Property TheObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
RhinoObjectAnalysisModeChangedEventArgs Class
Rhino.DocObjects Namespace