RhinoCommon API
RealtimeDisplayModeClassInfo.DrawOpenGl Property
 Return true if the RealtimeDisplayMode draws its result using OpenGL. RenderWindow usage will then be skipped.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract bool DrawOpenGl { get; }
Public MustOverride ReadOnly Property DrawOpenGl As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace