RhinoCommon API
RTreeEventArgs.Id Property
 Gets the identifier of the found item.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Id { get; }
Public ReadOnly Property Id As Integer
	Get
Property Value
Type: Int32
Exceptions
Exception | Condition
OverflowException | If, on 64-bit platforms, the value of this instance is too large or too small to be represented as a 32-bit signed integer.
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace