RhinoCommon API
Dimension.CentermarkSize Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.CentermarkSize"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double CentermarkSize { get; set; }
Public Property CentermarkSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace