RhinoCommon API
ContentUuids.ProjectionChangerTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.ProjectionChangerTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid ProjectionChangerTextureType { get; }
Public Shared ReadOnly Property ProjectionChangerTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace