RhinoCommon API
TransformField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Transform Value { get; set; }
Public Property Value As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
TransformField Class
Rhino.Render.Fields Namespace