RhinoCommon API
File3dmEdgeSoftening.EdgeAngleThreshold Property
 Threshold angle (in degrees) which controls whether an edge is softened or not. The angle refers to the angles between the adjacent faces of an edge.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double EdgeAngleThreshold { get; set; }
Public Property EdgeAngleThreshold As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmEdgeSoftening Class
Rhino.FileIO Namespace