RhinoCommon API
RhinoPageView.PageNumber Property
 Gets or sets the runtime page number and updates the page number for all of the other pages. The first page has a value of 0.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int PageNumber { get; set; }
Public Property PageNumber As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace