RhinoCommon API
RenderPrimitive.RenderMaterial Property
 The RenderMaterial associated with this mesh or null if there is not one.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public RenderMaterial RenderMaterial { get; }
Public ReadOnly Property RenderMaterial As RenderMaterial
	Get
Property Value
Type: RenderMaterial
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace