RhinoCommon API
PageViewGroup.Description Property
 Gets and sets a brief description of the page view group.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
See Also
Reference
PageViewGroup Class
Rhino.DocObjects Namespace