RhinoCommon API
SmartTrackSettings.ActivePointColor Property
Gets or sets the active point color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color ActivePointColor { get; set; }
Public Shared Property ActivePointColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace