RhinoCommon API
DisplayPipelineAttributes.LockedObjectUsage Property
 Set asource of display attributes for locked objects
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public DisplayPipelineAttributes.LockedObjectUse LockedObjectUsage { get; set; }
Public Property LockedObjectUsage As DisplayPipelineAttributes.LockedObjectUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.LockedObjectUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace