RhinoCommon API
CurvatureGraphSettingsState.SrfUHair Property
 Gets or sets the whether to show surface U hairs
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SrfUHair { get; set; }
Public Property SrfUHair As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CurvatureGraphSettingsState Class
Rhino.ApplicationSettings Namespace