RhinoCommon API
DisplayPipelineAttributes.CurveThicknessScale Property
 Scale thickness for curves
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public float CurveThicknessScale { get; set; }
Public Property CurveThicknessScale As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace