RhinoCommon API
RhinoApp.CheckNewObject Property
 Returns true if Rhino will validate each object added to the document. This can be time consuming but is valuable for debugging.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public static bool CheckNewObject { get; set; }
Public Shared Property CheckNewObject As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace