RhinoCommon API
SimulatedTexture.TransparentColor Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.TransparentColor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Color4f TransparentColor { get; set; }
Public Property TransparentColor As Color4f
	Get
	Set
Property Value
Type: Color4f
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace