RhinoCommon API
Brep.Faces Property
 Gets the brep faces list accessor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BrepFaceList Faces { get; }
Public ReadOnly Property Faces As BrepFaceList
	Get
Property Value
Type: BrepFaceList
See Also
Reference
Brep Class
Rhino.Geometry Namespace