RhinoCommon API
GetPointMouseEventArgs.LeftButtonDown Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.LeftButtonDown"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool LeftButtonDown { get; }
Public ReadOnly Property LeftButtonDown As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace