RhinoCommon API
ICurrentEnvironment.ForReflectionAndRefraction Property
 Get or set the RenderEnvironment used as custom reflection (and refraction) environment. If getting, null will be returned if the custom reflection override is disabled. If setting, passing null will turn the custom reflection environment override off but it will not actually set its id to null. Setting to a valid environment will also turn the custom reflection environment override on.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
RenderEnvironment ForReflectionAndRefraction { get; set; }
Property ForReflectionAndRefraction As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
Implements
ICurrentEnvironment_Get.ForReflectionAndRefraction
See Also
Reference
ICurrentEnvironment Interface
Rhino.Render Namespace