RhinoCommon API
RenderContentEventArgs.EnvironmentUsage Property
Note: This API is now obsolete.
 Meaningful for CurrentEnvironmentChanged event. Will be one of Background, ReflectionAndRefraction or Skylighting.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
[ObsoleteAttribute("Call EnvironmentUsageEx instead")]
public RenderEnvironment.Usage EnvironmentUsage { get; }
<ObsoleteAttribute("Call EnvironmentUsageEx instead")>
Public ReadOnly Property EnvironmentUsage As RenderEnvironment.Usage
	Get
Property Value
Type: RenderEnvironment.Usage
See Also
Reference
RenderContentEventArgs Class
Rhino.Render Namespace