RhinoCommon API
ProviderIds.Dithering Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.Dithering"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid Dithering { get; }
Public Shared ReadOnly Property Dithering As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace