RhinoCommon API
QuadRemeshParameters.GuideCurveInfluence Property
 0 = Approximate 1 = Interpolate Edge Ring 2 = Interpolate Edge Loop This value is ignored if Guide Curves are not supplied
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int GuideCurveInfluence { get; set; }
Public Property GuideCurveInfluence As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
QuadRemeshParameters Class
Rhino.Geometry Namespace