RhinoCommon API
PanelIds.Libraries Property
 Rhino Render Libraries panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public static Guid Libraries { get; }
Public Shared ReadOnly Property Libraries As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace