RhinoCommon API
LengthMassProperties.CentroidCoordinatesSecondMomentsError Property
 Uncertainty in centroid coordinates second moments calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public Vector3d CentroidCoordinatesSecondMomentsError { get; }
Public ReadOnly Property CentroidCoordinatesSecondMomentsError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace