RhinoCommon API
CustomRenderMeshProvider.ThickeningId Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderMeshProvider.ThickeningId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid ThickeningId { get; }
Public Shared ReadOnly Property ThickeningId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace