RhinoCommon API
File3mfWriteOptions.Designer Property
[Missing <summary> documentation for "P:Rhino.FileIO.File3mfWriteOptions.Designer"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public string Designer { get; set; }
Public Property Designer As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3mfWriteOptions Class
Rhino.FileIO Namespace