RhinoCommon API
CurvatureGraphSettings.SrfUHair Property
 Gets or sets the surface U hairs are on;
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool SrfUHair { get; set; }
Public Shared Property SrfUHair As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CurvatureGraphSettings Class
Rhino.ApplicationSettings Namespace