RhinoCommon API
PhysicallyBasedMaterial.SpecularTint Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.SpecularTint"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double SpecularTint { get; set; }
Public Property SpecularTint As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace