RhinoCommon API
DisplayPipelineAttributes.PointRadius Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.PointRadius"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public float PointRadius { get; set; }
Public Property PointRadius As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace