RhinoCommon API
TextDotUserInterfaceObject.MouseOverTextHeight Property
 Font height used when the mouse is over the dot. The default behavior is to grow the dot a small amount when the mouse is over to help the user know that the dot is acts as a user interface object
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int MouseOverTextHeight { get; set; }
Public Property MouseOverTextHeight As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
TextDotUserInterfaceObject Class
Rhino.UI Namespace