RhinoCommon API
RibbonOffsetParameters.RibbonSurfaceGenerationMethod Property
 0 - no surfaces will be created, curves only 1 - Simple Sweep 2 2 - Sweep 2 mixed with NetworkSrf corners
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public RibbonOffsetSurfaceMethod RibbonSurfaceGenerationMethod { get; set; }
Public Property RibbonSurfaceGenerationMethod As RibbonOffsetSurfaceMethod
	Get
	Set
Property Value
Type: RibbonOffsetSurfaceMethod
See Also
Reference
RibbonOffsetParameters Class
Rhino.Geometry Namespace