RhinoCommon API
IntersectingMeshPair.MeshIndexA Property
 The index of the first mesh, in meshesA.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int MeshIndexA { get; }
Public ReadOnly Property MeshIndexA As Integer
	Get
Property Value
Type: Int32
See Also
Reference
IntersectingMeshPair Structure
Rhino.Geometry.Intersect Namespace