RhinoCommon API
RadialDimension.LeaderArrowSize Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.LeaderArrowSize"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double LeaderArrowSize { get; set; }
Public Property LeaderArrowSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace