RhinoCommon API
Decal.IsVisible Property
 Gets the decal's visibility.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.18
Syntax
public bool IsVisible { get; }
Public ReadOnly Property IsVisible As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Decal Class
Rhino.Render Namespace