RhinoCommon API
DirectionAnalysisSettings.V Property
 Gets or sets whether to display the V dir.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool V { get; set; }
Public Shared Property V As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DirectionAnalysisSettings Class
Rhino.ApplicationSettings Namespace