RhinoCommon API
FileAiWriteOptions.ExportHatchesAsSolidFills Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileAiWriteOptions.ExportHatchesAsSolidFills"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ExportHatchesAsSolidFills { get; set; }
Public Property ExportHatchesAsSolidFills As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileAiWriteOptions Class
Rhino.FileIO Namespace