RhinoCommon API
EventWatcher.IncludeHeadlessDocuments Property
 Gets whether this watcher also receives events for headless documents.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IncludeHeadlessDocuments { get; }
Public ReadOnly Property IncludeHeadlessDocuments As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
EventWatcher Class
Rhino Namespace