RhinoCommon API
Triangle3d.PerpendicularCA Property
 Gets the perpendicular bisector for edge CA.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Line PerpendicularCA { get; }
Public ReadOnly Property PerpendicularCA As Line
	Get
Property Value
Type: Line
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace