RhinoCommon API
FileSettingsState.FileLockingOpenWarning Property
Displays an information dialog which identifies computer file is open on.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool FileLockingOpenWarning { get; set; }
Public Property FileLockingOpenWarning As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace