RhinoCommon API
AppearanceSettingsState.GridXAxisLineColor Property
Gets or sets the color of X axis line in the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color GridXAxisLineColor { get; set; }
Public Property GridXAxisLineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace