RhinoCommon API
PolyCurve.IsNested Property
 Gets a value indicating whether or not a PolyCurve contains nested PolyCurves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsNested { get; }
Public ReadOnly Property IsNested As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace
PolyCurve.RemoveNesting()