RhinoCommon API
CursorTooltipSettings.PointPane Property
 Displays the current construction plane coordinates.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool PointPane { get; set; }
Public Shared Property PointPane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace