RhinoCommon API
RhinoObject.UsePreviewMesh Property
 True when the display should draw this object's preview mesh instead of its render or analysis mesh.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UsePreviewMesh { get; }
Public ReadOnly Property UsePreviewMesh As Boolean
	Get
Property Value
Type: Boolean
Remarks
 Only meaningful while drawing: the meshing worker thread raises this for the objects it is previewing and it is false the rest of the time. A texture or false colour VisualAnalysisMode reads it from SetUpDisplayAttributes to decide whether to show mesh wires, which is what the built-in analysis modes do.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace