RhinoCommon API
RadialDimension.TextOrientation Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.TextOrientation"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override TextOrientation TextOrientation { get; set; }
Public Overrides Property TextOrientation As TextOrientation
	Get
	Set
Property Value
Type: TextOrientation
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace