RhinoCommon API
ContentUuids.TurbulenceTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.TurbulenceTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid TurbulenceTextureType { get; }
Public Shared ReadOnly Property TurbulenceTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace