RhinoCommon API
Sphere.IsValid Property
 Gets a value that indicates whether the sphere is valid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace