RhinoCommon API
PrintedPageDefinition.Height Property
 Height of the page in Units
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PrintedPageDefinition Class
Rhino Namespace