RhinoCommon API
SubDEdge.VertexFrom Property
 Start vertex for this edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDVertex VertexFrom { get; }
Public ReadOnly Property VertexFrom As SubDVertex
	Get
Property Value
Type: SubDVertex
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace