RhinoCommon API
AsyncRenderContext.RenderWindow Property
 Handle to the RenderWindow for the instance of this class. This is a convenience property for implementors to use.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderWindow RenderWindow { get; set; }
Public Property RenderWindow As RenderWindow
	Get
	Set
Property Value
Type: RenderWindow
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace