RhinoCommon API
RenderPrimitive.PrimitiveType Property
 Call this before extracting meshes if you support render primitives to get the RenderPrimitiveType of this mesh then call the associated TryGetSphere(Sphere), TryGetPlane(PlaneSurface), TryGetCone(Cone, Plane), or TryGetBox(Box) method. Calling the Mesh() property will mesh the primitive and return a mesh always.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public RenderPrimitiveType PrimitiveType { get; }
Public ReadOnly Property PrimitiveType As RenderPrimitiveType
	Get
Property Value
Type: RenderPrimitiveType
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace