RhinoCommon API
Brep.FilletSurfaceSettings.InnerSlider Property
 A number between -0.95 and 0.95 indicating how far to push the inner control point toward or away from the theoretical middle control point - only for non-rational fillets
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double InnerSlider { get; }
Public ReadOnly Property InnerSlider As Double
	Get
Property Value
Type: Double
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace