RhinoCommon API
FileDwgReadOptions.ImportUnreferencedLayers Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgReadOptions.ImportUnreferencedLayers"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportUnreferencedLayers { get; set; }
Public Property ImportUnreferencedLayers As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgReadOptions Class
Rhino.FileIO Namespace