RhinoCommon API
RhinoDoc.ModelSpaceHatchScalingEnabled Property
 True if hatch scaling is enabled, false if not.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.16
Syntax
public bool ModelSpaceHatchScalingEnabled { get; set; }
Public Property ModelSpaceHatchScalingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace