RhinoCommon API
DisplayPipelineAttributes.BackOverrideObjectTransparency Property
 Objects acquire transparency from render materials.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public bool BackOverrideObjectTransparency { get; set; }
Public Property BackOverrideObjectTransparency As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace