RhinoCommon API
AppearanceSettings.ShowViewportTitles Property
 Shows or hides viewport titles.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool ShowViewportTitles { get; set; }
Public Shared Property ShowViewportTitles As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace