RhinoCommon API
UserInterfaceTextBox.PlaceholderText Property
 Text drawn, dimmed, when the box is empty and does not have focus
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string PlaceholderText { get; set; }
Public Property PlaceholderText As String
	Get
	Set
Property Value
Type: String
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace