RhinoCommon API
PanelIds.ContextHelp Property
 Rhino Context-Sensitive Help panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid ContextHelp { get; }
Public Shared ReadOnly Property ContextHelp As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace