RhinoCommon API
RenderWindow.ChannelGPU.DisplayTechnology Property
 Return the type of API used for this channel's texture handle.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public DisplayTechnology DisplayTechnology { get; }
Public ReadOnly Property DisplayTechnology As DisplayTechnology
	Get
Property Value
Type: DisplayTechnology
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace