RhinoCommon API
Particle.Color Property
[Missing <summary> documentation for "P:Rhino.Geometry.Particle.Color"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color Color { get; set; }
Public Property Color As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Particle Class
Rhino.Geometry Namespace