RhinoCommon API
RenderContent.TypeDescription Property
 Description for your content type. i.e., "Procedural checker pattern"
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public abstract string TypeDescription { get; }
Public MustOverride ReadOnly Property TypeDescription As String
	Get
Property Value
Type: String
See Also
Reference
RenderContent Class
Rhino.Render Namespace