RhinoCommon API
DisplayPipelineAttributes.MeshNakedEdgeThickness Property
 Naked mesh edge width in pixels.}
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int MeshNakedEdgeThickness { get; set; }
Public Property MeshNakedEdgeThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace