RhinoCommon API
RenderSettings.BackgroundColorBottom Property
 Gets or sets the background bottom color used in rendering.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color BackgroundColorBottom { get; set; }
Public Property BackgroundColorBottom As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
RenderSettings Class
Rhino.Render Namespace