RhinoCommon API
Font.EnglishFamilyName Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.EnglishFamilyName"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.9
Syntax
public string EnglishFamilyName { get; }
Public ReadOnly Property EnglishFamilyName As String
	Get
Property Value
Type: String
See Also
Reference
Font Class
Rhino.DocObjects Namespace