RhinoCommon API
CurvatureAnalysisSettingsState.ShowIsoCurves Property
 Gets or sets whether to show isocurves.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ShowIsoCurves { get; set; }
Public Property ShowIsoCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CurvatureAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace