RhinoCommon API
IWindow.Shown Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IWindow.Shown"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool Shown { get; set; }
Property Shown As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace