RhinoCommon API
Material.RefractionGlossiness Property
 Gets or sets the refraction glossiness.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double RefractionGlossiness { get; set; }
Public Property RefractionGlossiness As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Material Class
Rhino.DocObjects Namespace