RhinoCommon API
SubD.Faces Property
 All faces in this SubD
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDFaceList Faces { get; }
Public ReadOnly Property Faces As SubDFaceList
	Get
Property Value
Type: SubDFaceList
See Also
Reference
SubD Class
Rhino.Geometry Namespace