RhinoCommon API
SubDComponent.IsDeleted Property
 Returns true if the SubD component is deleted.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public bool IsDeleted { get; }
Public ReadOnly Property IsDeleted As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace