RhinoCommon API
SubDComponentParameter.ComponentId Property
 Gets the id of the SubD component this parameter is relative to, or 0 if this parameter is not set.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public uint ComponentId { get; }
Public ReadOnly Property ComponentId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace