RhinoCommon API
DisplayPipelineAttributes.ShadowBiasX Property
 ShadowBiasX (Self shadowing artifacts) from 0 (dirty) to 50 (cleaner).
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public double ShadowBiasX { get; set; }
Public Property ShadowBiasX As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace