RhinoCommon API
Toolbar.BitmapSize Property
 Gets and sets the size of the toolbar image.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Size BitmapSize { get; set; }
Public Shared Property BitmapSize As Size
	Get
	Set
Property Value
Type: Size
See Also
Reference
Toolbar Class
Rhino.UI Namespace