RhinoCommon API
SectionStyleTableEventArgs.NewState Property
 The section style.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SectionStyle NewState { get; }
Public ReadOnly Property NewState As SectionStyle
	Get
Property Value
Type: SectionStyle
See Also
Reference
SectionStyleTableEventArgs Class
Rhino.DocObjects.Tables Namespace