RhinoCommon API
FileCsvDocument.HasHeader Property
 True if the document has a header row of column names. See ColumnIndex(String).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool HasHeader { get; }
Public ReadOnly Property HasHeader As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace