RhinoCommon API
Markup.Created Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Markup.Created"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public DateTime Created { get; }
Public ReadOnly Property Created As DateTime
	Get
Property Value
Type: DateTime
See Also
Reference
Markup Class
Rhino.DocObjects Namespace