RhinoCommon API
AppearanceSettingsState.DefaultObjectColor Property
Gets or sets the default object color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color DefaultObjectColor { get; set; }
Public Property DefaultObjectColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace