RhinoCommon API
RhinoDoc.RedoActive Property
 Returns true if Redo is currently active.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool RedoActive { get; }
Public ReadOnly Property RedoActive As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace