RhinoCommon API
SafeFrame.Enabled Property
 Determines whether the safe-frame is enabled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SafeFrame Class
Rhino.Render Namespace