RhinoCommon API
Vector3f.Zero Property
 Gets the value of the vector with components 0,0,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector3f Zero { get; }
Public Shared ReadOnly Property Zero As Vector3f
	Get
Property Value
Type: Vector3f
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace