RhinoCommon API
RayShootEvent.Point Property
 The 3d hit point.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Point3d Point { get; set; }
Public Property Point As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
RayShootEvent Structure
Rhino.Geometry.Intersect Namespace