RhinoCommon API
FileObjWriteOptions.MeshParameters Property
 Mesh parameters to use when meshing geometry that is not already a mesh.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public MeshingParameters MeshParameters { get; set; }
Public Property MeshParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace