RhinoCommon API
SectionStyleTable.ActiveCount Property
 Returns number of section styles in the table, excluding deleted section styles.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int ActiveCount { get; }
Public ReadOnly Property ActiveCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SectionStyleTable Class
Rhino.DocObjects.Tables Namespace