RhinoCommon API
Transform2d.M12 Property
Gets or sets this[1,2], the Y translation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double M12 { get; set; }
Public Property M12 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace