RhinoCommon API
File3mfWriteOptions.Metadata Property
[Missing <summary> documentation for "P:Rhino.FileIO.File3mfWriteOptions.Metadata"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public Dictionary<string, string> Metadata { get; }
Public ReadOnly Property Metadata As Dictionary(Of String, String)
	Get
Property Value
Type: Dictionary<String, String>
See Also
Reference
File3mfWriteOptions Class
Rhino.FileIO Namespace