RhinoCommon API
RenderMaterial.PictureMaterialGuid Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PictureMaterialGuid"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid PictureMaterialGuid { get; }
Public Shared ReadOnly Property PictureMaterialGuid As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace