RhinoCommon API
CommandStyleAttribute.Styles Property
 Gets the associated style.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Style Styles { get; }
Public ReadOnly Property Styles As Style
	Get
Property Value
Type: Style
See Also
Reference
CommandStyleAttribute Class
Rhino.Commands Namespace