RhinoCommon API
RhinoDocObserverArgs.RuntimeSerialNumber Property
 Document runtime serial number, will be different across Rhino sessions.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint RuntimeSerialNumber { get; }
Public ReadOnly Property RuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RhinoDocObserverArgs Class
Rhino Namespace