RhinoCommon API
ICollapsibleSection.Id Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.Id"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
Guid Id { get; }
ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace