RhinoCommon API
ContentUuids.Texture2DCheckerTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.Texture2DCheckerTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid Texture2DCheckerTextureType { get; }
Public Shared ReadOnly Property Texture2DCheckerTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace