RhinoCommon API
Triangle3d.MedianB Property
 Gets the median line starting at corner B.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Line MedianB { get; }
Public ReadOnly Property MedianB As Line
	Get
Property Value
Type: Line
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace