RhinoCommon API
MeshingParameters.GridAngle Property
 Gets or sets the maximum allowed angle difference (in radians) for a single sampling quad. The angle pertains to the surface normals.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double GridAngle { get; set; }
Public Property GridAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace