RhinoCommon API
Text3d.BoundingBox Property
 Gets the bounding box for this Text3d object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
Text3d Class
Rhino.Display Namespace