RhinoCommon API
FileCsvWriteOptions.ObjectKeys Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.ObjectKeys"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ObjectKeys { get; set; }
Public Property ObjectKeys As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace