RhinoCommon API
UserDictionary.Dictionary Property
 Gets the dictionary that is associated with this class.
This dictionary is unique.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ArchivableDictionary Dictionary { get; }
Public ReadOnly Property Dictionary As ArchivableDictionary
	Get
Property Value
Type: ArchivableDictionary
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace