RhinoCommon API
MeshInstance.Ancestry Property
 Returns a the ancestry information for this object. Note well - the ancestry records contain complete copies of the object attributes for each level of the block hierarchy. Please do not be tempted to use the ModelObjectId of the instance objects to look them up in the document - the document may have changed since the change queue entries were added.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
public MeshInstance.AncestryRecord[] Ancestry { get; }
Public ReadOnly Property Ancestry As MeshInstance.AncestryRecord()
	Get
Property Value
Type: MeshInstance.AncestryRecord[]
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace