RhinoCommon API
AppearanceSettingsState.SelectionWindowStrokeColor Property
 Gets or sets the color used to draw the stroke of a selection window
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Color SelectionWindowStrokeColor { get; set; }
Public Property SelectionWindowStrokeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace