RhinoCommon API
RenderMeshes.ObjectId Property
 The ObjectId with which this IRenderMeshes object is associated.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid ObjectId { get; }
Public ReadOnly Property ObjectId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderMeshes Class
Rhino.Render.CustomRenderMeshes Namespace