RhinoCommon API
RuiUpdateUi.MenuIndex Property
Zero based index of item in the Windows menu
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public int MenuIndex { get; }
Public ReadOnly Property MenuIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace