RhinoCommon API
Field.AutomaticRegisteredProperty Property
[Missing <summary> documentation for "P:Rhino.Render.Fields.Field.AutomaticRegisteredProperty"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public bool AutomaticRegisteredProperty { get; set; }
Public Property AutomaticRegisteredProperty As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Field Class
Rhino.Render.Fields Namespace