RhinoCommon API
DrawForegroundEventArgs.DrawWorldAxes Property
[Missing <summary> documentation for "P:Rhino.Display.DrawForegroundEventArgs.DrawWorldAxes"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool DrawWorldAxes { get; set; }
Public Property DrawWorldAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DrawForegroundEventArgs Class
Rhino.Display Namespace