RhinoCommon API
PhysicallyBased.SubsurfaceScatteringRadius Property
[Missing <summary> documentation for "P:Rhino.Render.ChildSlotNames.PhysicallyBased.SubsurfaceScatteringRadius"]
 Namespace: Rhino.Render.ChildSlotNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string SubsurfaceScatteringRadius { get; }
Public Shared ReadOnly Property SubsurfaceScatteringRadius As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ChildSlotNames Namespace