RhinoCommon API
WorksessionModel.Alias Property
 The alias used to decorate names - layers, materials, and so on - that come from this model.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Alias { get; }
Public ReadOnly Property Alias As String
	Get
Property Value
Type: String
See Also
Reference
WorksessionModel Class
Rhino.DocObjects Namespace