RhinoCommon API
RhinoDoc.ModelSpaceHatchScale Property
 The scale factor for hatches in model space when Hatch Scaling is enabled
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public double ModelSpaceHatchScale { get; set; }
Public Property ModelSpaceHatchScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RhinoDoc Class
Rhino Namespace