RhinoCommon API
MatchSrfSettings.PreserveIso Property
 The way the surface iso-lines align with the target
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public PreserveIsoCurveMethod PreserveIso { get; set; }
Public Property PreserveIso As PreserveIsoCurveMethod
	Get
	Set
Property Value
Type: PreserveIsoCurveMethod
See Also
Reference
MatchSrfSettings Class
Rhino.Geometry Namespace