RhinoCommon API
DimStyleTable.CurrentId Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTable.CurrentId"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid CurrentId { get; }
Public ReadOnly Property CurrentId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace