RhinoCommon API
RenderSettings.Sun Property
 If this object is associated with a document, this gets the document sun. If this object is associated with a File3dm, this gets the File3dm's sun. Otherwise it gets a 'free-floating' sun object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Sun Sun { get; }
Public ReadOnly Property Sun As Sun
	Get
Property Value
Type: Sun
See Also
Reference
RenderSettings Class
Rhino.Render Namespace