RhinoCommon API
Dimension.PlainUserText Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.PlainUserText"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string PlainUserText { get; }
Public ReadOnly Property PlainUserText As String
	Get
Property Value
Type: String
See Also
Reference
Dimension Class
Rhino.Geometry Namespace