RhinoCommon API
Extrusion.IsMiteredAtStart Property
 Returns a value indicating whether a miter plane at start is defined.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsMiteredAtStart { get; }
Public ReadOnly Property IsMiteredAtStart As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace