RhinoCommon API
RenderEnvironment.TextureChildSlotName Property
[Missing <summary> documentation for "P:Rhino.Render.RenderEnvironment.TextureChildSlotName"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string TextureChildSlotName { get; }
Public ReadOnly Property TextureChildSlotName As String
	Get
Property Value
Type: String
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace