RhinoCommon API
Mesh.Ngons Property
 Gets access to the mesh ngon list.
Ngons represent groups of Faces (triangles + quads).
Faces are used to tessellate an Ngon internally.
When a triangle or quad is referenced in the Ngon list, it is no longer visualized and conceived as a single entity, but takes part of the Ngon.
If you need to get access to both Ngons and the faces that are not referenced by Ngons, that is, all polygons that are visible in the mesh, then use the GetNgonAndFacesEnumerable() helper method.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public MeshNgonList Ngons { get; }
Public ReadOnly Property Ngons As MeshNgonList
	Get
Property Value
Type: MeshNgonList
See Also
Reference
Mesh Class
Rhino.Geometry Namespace