RhinoCommon API
Analytics.UsageStatisticsEnabled Property
 Determine if user allows automatic data collection from Rhino
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool UsageStatisticsEnabled { get; }
Public Shared ReadOnly Property UsageStatisticsEnabled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Analytics Class
Rhino.Runtime Namespace