RhinoCommon API
GeneralSettings.MiddleMouseMode Property
 Gets or sets what happens when the user clicks the middle mouse.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static MiddleMouseMode MiddleMouseMode { get; set; }
Public Shared Property MiddleMouseMode As MiddleMouseMode
	Get
	Set
Property Value
Type: MiddleMouseMode
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace