RhinoCommon API
Command.LocalName Property
 Gets the local name of the command.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual string LocalName { get; }
Public Overridable ReadOnly Property LocalName As String
	Get
Property Value
Type: String
See Also
Reference
Command Class
Rhino.Commands Namespace