RhinoCommon API
ModelComponent.DeletedName Property
 Gets the name of a component that is deleted.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public string DeletedName { get; }
Public ReadOnly Property DeletedName As String
	Get
Property Value
Type: String
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace