RhinoCommon API
RenderMaterial.DefaultPreviewBackgroundType Property
 Set or get the default scene background for the image that appears in preview panes
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public RenderMaterial.PreviewBackgroundType DefaultPreviewBackgroundType { get; set; }
Public Property DefaultPreviewBackgroundType As RenderMaterial.PreviewBackgroundType
	Get
	Set
Property Value
Type: RenderMaterial.PreviewBackgroundType
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace