RhinoCommon API
DisplayPipelineAttributes.SkylightShadowQuality Property
 Skylight shadow quality, from 0 (lowest) to 8 (highest)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int SkylightShadowQuality { get; set; }
Public Property SkylightShadowQuality As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace