RhinoCommon API
CommandEventArgs.CommandHelpURL Property
 Gets the help url of the command that raised this event.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string CommandHelpURL { get; }
Public ReadOnly Property CommandHelpURL As String
	Get
Property Value
Type: String
Remarks
 Null is a possible return. Calling function must check before using result. m_help_url will get set only if the commmand has a ContextHelpURL override.
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace