RhinoCommon API
HatchLine.PatternLength Property
 Get the total length of a pattern repeat.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double PatternLength { get; }
Public ReadOnly Property PatternLength As Double
	Get
Property Value
Type: Double
See Also
Reference
HatchLine Class
Rhino.DocObjects Namespace