RhinoCommon API
CloudHostUtils.Signature Property
Signed proof of entitlement returned by the cloud provider (null when not applicable).
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.33
Syntax
public static string Signature { get; }
Public Shared ReadOnly Property Signature As String
	Get
Property Value
Type: String
See Also
Reference
CloudHostUtils Class
Rhino.Runtime Namespace