RhinoCommon API
DisplayPipeline.NestLevel Property
 Gets the current nested viewport drawing level. This is used to know if you are currently inside the drawing of a nested viewport (detail object in Rhino).
Nest level = 0 Drawing is occurring in a standard Rhino viewport or on the page viewport.
Nest level = 1 Drawing is occurring inside a detail view object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int NestLevel { get; }
Public ReadOnly Property NestLevel As Integer
	Get
Property Value
Type: Int32
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace