RhinoCommon API
CustomGripObject.Weight Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.CustomGripObject.Weight"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override double Weight { get; set; }
Public Overrides Property Weight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace