RhinoCommon API
DisplayPipelineAttributes.ClippingShadeTransparency Property
 Specifies the clipping plane transparency percentage.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int ClippingShadeTransparency { get; set; }
Public Property ClippingShadeTransparency As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace