RhinoCommon API
MeshCheckParameters.CheckForUnusedVertices Property
 If true, then look for vertices that are not referenced by any face in the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool CheckForUnusedVertices { get; set; }
Public Property CheckForUnusedVertices As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace