RhinoCommon API
DimensionStyle.DimensionScale Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimensionScale"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double DimensionScale { get; set; }
Public Property DimensionScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace