RhinoCommon API
LicenseStatus.SerialNumber Property
The "for display only" product license or serial number.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string SerialNumber { get; set; }
Public Property SerialNumber As String
	Get
	Set
Property Value
Type: String
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace