RhinoCommon API
RhinoView.Floating Property
 Floating state of RhinoView. if true, then the view will be in a floating frame window. Otherwise the view will be embedded in the main frame.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Floating { get; set; }
Public Property Floating As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoView Class
Rhino.Display Namespace