RhinoCommon API
RhinoDoc.Views Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.Views"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ViewTable Views { get; }
Public ReadOnly Property Views As ViewTable
	Get
Property Value
Type: ViewTable
See Also
Reference
RhinoDoc Class
Rhino Namespace