RhinoCommon API
RhinoDocCommonTable<T>.Document Property
Document that owns this table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoDocCommonTable<T> Class
Rhino.DocObjects.Tables Namespace