RhinoCommon API
File3dmThickening.OffsetOnly Property
 Specifies whether to only offset the original surface.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool OffsetOnly { get; set; }
Public Property OffsetOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmThickening Class
Rhino.FileIO Namespace