RhinoCommon API
LineCurve.Line Property
 Gets or sets the Line value inside this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Line Line { get; set; }
Public Property Line As Line
	Get
	Set
Property Value
Type: Line
See Also
Reference
LineCurve Class
Rhino.Geometry Namespace