RhinoCommon API
DisplayPen.JoinStyle Property
 How corners of curves are joined
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public LineJoinStyle JoinStyle { get; set; }
Public Property JoinStyle As LineJoinStyle
	Get
	Set
Property Value
Type: LineJoinStyle
See Also
Reference
DisplayPen Class
Rhino.Display Namespace