RhinoCommon API
ViewSettingsState.ZoomExtentsPerspectiveViewBorder Property
 Border amount to apply to perspective viewport during zoom extents
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public double ZoomExtentsPerspectiveViewBorder { get; set; }
Public Property ZoomExtentsPerspectiveViewBorder As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace