RhinoCommon API
ImageFileEventArgs.RenderEngine Property
[Missing <summary> documentation for "P:Rhino.Render.ImageFileEventArgs.RenderEngine"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public string RenderEngine { get; }
Public ReadOnly Property RenderEngine As String
	Get
Property Value
Type: String
See Also
Reference
ImageFileEventArgs Class
Rhino.Render Namespace