RhinoCommon API
GumballSettingsState.PlaneLocation Property
 Specifies the distance of the plane indicators from the gumball origin in pixels.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PlaneLocation { get; set; }
Public Property PlaneLocation As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace