RhinoCommon API
MouseState.DeviceLocation Property
 Where the mouse is, in device pixels of the surface this event came from.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PointF DeviceLocation { get; }
Public ReadOnly Property DeviceLocation As PointF
	Get
Property Value
Type: PointF
See Also
Reference
MouseState Class
Rhino.UI Namespace