RhinoCommon API
NamedColor.Color Property
 Gets the color for this entry.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Color Color { get; }
Public ReadOnly Property Color As Color
	Get
Property Value
Type: Color
See Also
Reference
NamedColor Class
Rhino.UI Namespace