RhinoCommon API
LicenseData.LicenseTitle Property
 The title of the license. This is provided by the plug-in that validated the license. (e.g. "Rhinoceros 6.0 Commercial")
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string LicenseTitle { get; set; }
Public Property LicenseTitle As String
	Get
	Set
Property Value
Type: String
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace