RhinoCommon API
SimpleArrayBrepPointer.Count Property
 Gets the amount of breps in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SimpleArrayBrepPointer Class
Rhino.Runtime.InteropWrappers Namespace