RhinoCommon API
PointCloudItem.Normal Property
 Gets or sets the normal vector for this point cloud item. If this point cloud item does not have a normal vector, Vector3d.Unset is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d Normal { get; set; }
Public Property Normal As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace