RhinoCommon API
DisplayPipelineAttributes.CurveColor Property
Color used for drawing curves
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Color CurveColor { get; set; }
Public Property CurveColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace