RhinoCommon API
ViewCaptureSettings.DrawRectangle Property
 Rectangle where drawing is confined to on MediaSize
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public Rectangle DrawRectangle { get; }
Public ReadOnly Property DrawRectangle As Rectangle
	Get
Property Value
Type: Rectangle
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace