RhinoCommon API
RhinoApp.InCommand Property
 Gets the nested command count.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static int InCommand { get; }
Public Shared ReadOnly Property InCommand As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoApp Class
Rhino Namespace