RhinoCommon API
Brep.FilletSurfaceSettings.Chamfer Property
 If true, a ruled chamfered surface is created.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Chamfer { get; }
Public ReadOnly Property Chamfer As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace