RhinoCommon API
FileIgsWriteOptions.NotesInStartSection Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.NotesInStartSection"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool NotesInStartSection { get; set; }
Public Property NotesInStartSection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace