RhinoCommon API
FileCsvWriteOptions.ObjectName Property
Object information
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ObjectName { get; set; }
Public Property ObjectName As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace