RhinoCommon API
DisplayPipelineAttributes.SubDReflectionPlaneColor Property
 Reflection plane color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public Color SubDReflectionPlaneColor { get; set; }
Public Property SubDReflectionPlaneColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace