RhinoCommon API
DisplayPipeline.ActiveTopLevelObject Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.ActiveTopLevelObject"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public RhinoObject ActiveTopLevelObject { get; }
Public ReadOnly Property ActiveTopLevelObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace