RhinoCommon API
FileGltfWriteOptions.SubDMeshType Property
 The mesh type for exported SubDs
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public FileGltfWriteOptions.SubDMeshing SubDMeshType { get; set; }
Public Property SubDMeshType As FileGltfWriteOptions.SubDMeshing
	Get
	Set
Property Value
Type: FileGltfWriteOptions.SubDMeshing
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace