RhinoCommon API
ViewCaptureWriter.PageSize Property
[Missing <summary> documentation for "P:Rhino.Runtime.ViewCaptureWriter.PageSize"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Size PageSize { get; }
Protected ReadOnly Property PageSize As Size
	Get
Property Value
Type: Size
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace