RhinoCommon API
FileGltfWriteOptions.MeshParameters Property
 Mesh parameters to use when meshing geometry that is not already a mesh. Only used when UseRenderMeshes is disabled.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public MeshingParameters MeshParameters { get; set; }
Public Property MeshParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace