RhinoCommon API
HiddenLineDrawingObjectCurve.Segments Property
 The HiddenLineDrawingCurve objects that make up this full curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public HiddenLineDrawingSegment[] Segments { get; }
Public ReadOnly Property Segments As HiddenLineDrawingSegment()
	Get
Property Value
Type: HiddenLineDrawingSegment[]
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace