RhinoCommon API
Material.FresnelReflections Property
 Gets or sets if Fresnel reflections are used.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool FresnelReflections { get; set; }
Public Property FresnelReflections As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Material Class
Rhino.DocObjects Namespace