RhinoCommon API
DecalCreateParams.VectorUp Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.VectorUp"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Vector3d VectorUp { get; set; }
Public Property VectorUp As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace