RhinoCommon API
DimStyleTable.BuiltInStyles Property
 Creates an array of default DimensionStyle objects
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle[] BuiltInStyles { get; }
Public ReadOnly Property BuiltInStyles As DimensionStyle()
	Get
Property Value
Type: DimensionStyle[]
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace