RhinoCommon API
FileAiWriteOptions.AiUnits Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileAiWriteOptions.AiUnits"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileAiWriteOptions.Units AiUnits { get; set; }
Public Property AiUnits As FileAiWriteOptions.Units
	Get
	Set
Property Value
Type: FileAiWriteOptions.Units
See Also
Reference
FileAiWriteOptions Class
Rhino.FileIO Namespace