RhinoCommon API
RhinoDoc.UserStringChangedArgs.Document Property
 Document containing the user string
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoDoc.UserStringChangedArgs Class
Rhino Namespace