RhinoCommon API
IResizableList<T>.Count Property
 Gets or sets the length of the list. This hides (Shadows in Vb.Net) the read-only Count property of the generic list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
int Count { get; set; }
Property Count As Integer
	Get
	Set
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
IResizableList<T> Interface
Rhino.Collections Namespace