RhinoCommon API
RhinoDoc.PageRelativeTolerance Property
Page space relative tolerance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double PageRelativeTolerance { get; set; }
Public Property PageRelativeTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RhinoDoc Class
Rhino Namespace