RhinoCommon API
ObjectAttributes.CustomMeshingParameters Property
 Returns or sets the per-object render meshing parameters, which controls the object's render mesh density. If this property is null, then the object uses the document's render meshing parameters. To remove the per-object render meshing parameters, set this property to null.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public MeshingParameters CustomMeshingParameters { get; set; }
Public Property CustomMeshingParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace