RhinoCommon API
Material.SpecularColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.SpecularColor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color SpecularColor { get; set; }
Public Property SpecularColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Material Class
Rhino.DocObjects Namespace