RhinoCommon API
Dimension.AltLengthRoundoff Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AltLengthRoundoff"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double AltLengthRoundoff { get; set; }
Public Property AltLengthRoundoff As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace