RhinoCommon API
File3dm.Strings Property
 Document user strings in this file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public File3dmStringTable Strings { get; }
Public ReadOnly Property Strings As File3dmStringTable
	Get
Property Value
Type: File3dmStringTable
See Also
Reference
File3dm Class
Rhino.FileIO Namespace