RhinoCommon API
GetPolyline.FirstPointPrompt Property
Prompt when getting first point
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string FirstPointPrompt { get; set; }
Public Property FirstPointPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace