RhinoCommon API
MappingTag.Id Property
 Gets or sets a map globally unique identifier.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
MappingTag Class
Rhino.Render Namespace