RhinoCommon API
GetCone.BothSides Property
 Determines if we're supposed to do both sides
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool BothSides { get; set; }
Public Property BothSides As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace