RhinoCommon API
PageSettings.TopMarginMillimeters Property
Top margin in millimeters.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public double TopMarginMillimeters { get; set; }
Public Property TopMarginMillimeters As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PageSettings Class
Rhino.DocObjects Namespace