RhinoCommon API
RhinoDoc.MeshingParameterStyle Property
 Type of MeshingParameters currently used by the document to mesh objects
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public MeshingParameterStyle MeshingParameterStyle { get; set; }
Public Property MeshingParameterStyle As MeshingParameterStyle
	Get
	Set
Property Value
Type: MeshingParameterStyle
See Also
Reference
RhinoDoc Class
Rhino Namespace