RhinoCommon API
Dimension.ArrowBlockId2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ArrowBlockId2"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid ArrowBlockId2 { get; set; }
Public Property ArrowBlockId2 As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Dimension Class
Rhino.Geometry Namespace