RhinoCommon API
FileTxtWriteOptions.ExportVertexColors Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileTxtWriteOptions.ExportVertexColors"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ExportVertexColors { get; set; }
Public Property ExportVertexColors As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileTxtWriteOptions Class
Rhino.FileIO Namespace