RhinoCommon API
RhinoApp.UserIsLoggedIn Property
 Returns true if the user is logged in; else returns false. A logged in user does not guarantee that the auth tokens managed by the CloudZooManager instance are valid.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool UserIsLoggedIn { get; }
Public Shared ReadOnly Property UserIsLoggedIn As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace