RhinoCommon API
Markup.Bitmap Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Markup.Bitmap"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Bitmap Bitmap { get; }
Public ReadOnly Property Bitmap As Bitmap
	Get
Property Value
Type: Bitmap
See Also
Reference
Markup Class
Rhino.DocObjects Namespace