RhinoCommon API
SmartTrackSettingsState.UseSmartTrack Property
Gets or sets if the 'smart track' feature is active.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool UseSmartTrack { get; set; }
Public Property UseSmartTrack As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace