RhinoCommon API
ShutLiningCurveInfo.Curve Property
 The profile curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Curve Curve { get; }
Public ReadOnly Property Curve As Curve
	Get
Property Value
Type: Curve
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace