RhinoCommon API
File3dmCurvePiping.Segments Property
 Specifies the number of segments in the pipe (minimum value 2).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int Segments { get; set; }
Public Property Segments As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
File3dmCurvePiping Class
Rhino.FileIO Namespace