RhinoCommon API
PlugInInfo.PlugInType Property
 Returns the plug-in type.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PlugInType PlugInType { get; }
Public ReadOnly Property PlugInType As PlugInType
	Get
Property Value
Type: PlugInType
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace