RhinoCommon API
BrepEdge.EdgeIndex Property
 Gets the index of this edge in the Brep.Edges collection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int EdgeIndex { get; }
Public ReadOnly Property EdgeIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace