RhinoCommon API
FilePlyWriteOptions.ExportASCII Property
 Determines whether to export as Ascii.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool ExportASCII { get; set; }
Public Property ExportASCII As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace