RhinoCommon API
RhinoList<T>.First Property
 Gets or sets the first item in the list. This is synonymous to calling List[0].
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public T First { get; set; }
Public Property First As T
	Get
	Set
Property Value
Type: T
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace