RhinoCommon API
ReduceMeshParameters.CancelToken Property
[Missing <summary> documentation for "P:Rhino.Geometry.ReduceMeshParameters.CancelToken"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public CancellationToken CancelToken { get; set; }
Public Property CancelToken As CancellationToken
	Get
	Set
Property Value
Type: CancellationToken
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace