RhinoCommon API
UndoRedoEventArgs.IsEndRecording Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsEndRecording"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsEndRecording { get; }
Public ReadOnly Property IsEndRecording As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace