RhinoCommon API
CurveKinkDefinition.KinkAngleDegrees Property
 The angle, in degrees, used to determine if when an abrupt change in tangent or curvature vector direction is a kink.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double KinkAngleDegrees { get; set; }
Public Property KinkAngleDegrees As Double
	Get
	Set
Return Value
Type: Double
 The tangent or curvature kink angle in degrees.
See Also
Reference
CurveKinkDefinition Class
Rhino.Geometry Namespace