RhinoCommon API
File3dmSettings.PageDistanceDisplayMode Property
 Gets or sets the page space distance display mode (decimal, feet, or feet and inches).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public DistanceDisplayMode PageDistanceDisplayMode { get; set; }
Public Property PageDistanceDisplayMode As DistanceDisplayMode
	Get
	Set
Property Value
Type: DistanceDisplayMode
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace