RhinoCommon API
RenderContent.TopLevel Property
 Returns true if this content has no parent, false if it is the child of another content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public bool TopLevel { get; }
Public ReadOnly Property TopLevel As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderContent Class
Rhino.Render Namespace