RhinoCommon API
ObjectEnumeratorSettings.UseFastSelection Property
 When SelectedObjectsFilter is true, enables an optimized iterator that walks only the document's selected objects rather than scanning the whole object table. Use this for selection-driven UI that re-queries on every selection change (e.g. panel enable-state). Only valid for the current selection set: do not use it while selection is actively changing. Ignored unless SelectedObjectsFilter is also true.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UseFastSelection { get; set; }
Public Property UseFastSelection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace