RhinoCommon API
SubDEdgeChain.Edges Property
 The edges of this chain, in order.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubDEdge[] Edges { get; }
Public ReadOnly Property Edges As SubDEdge()
	Get
Property Value
Type: SubDEdge[]
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace