RhinoCommon API
GetLine.GetLineMode Property
 Mode used
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public GetLineMode GetLineMode { get; set; }
Public Property GetLineMode As GetLineMode
	Get
	Set
Property Value
Type: GetLineMode
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace