RhinoCommon API
Mesh.PrincipalCurvatures Property
 Gets access to the (optional) principal curvatures list in this mesh. Principal curvatures are found on analysis meshes, not render meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public MeshPrincipalCurvatureList PrincipalCurvatures { get; }
Public ReadOnly Property PrincipalCurvatures As MeshPrincipalCurvatureList
	Get
Property Value
Type: MeshPrincipalCurvatureList
See Also
Reference
Mesh Class
Rhino.Geometry Namespace