RhinoCommon API
File3dmSettings.InstanceDefinitionLinkUpdate Property
How instance definition links are updated when the model is opened.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public int InstanceDefinitionLinkUpdate { get; set; }
Public Property InstanceDefinitionLinkUpdate As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace