RhinoCommon API
PhysicallyBased.BRDF Property
[Missing <summary> documentation for "P:Rhino.Render.ParameterNames.PhysicallyBased.BRDF"]
 Namespace: Rhino.Render.ParameterNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string BRDF { get; }
Public Shared ReadOnly Property BRDF As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ParameterNames Namespace