RhinoCommon API
SubDCreationOptions.MinimumConcaveCornerAngleRadians Property
 If ConcaveCornerTest == ConcaveCornerOption.AtMeshCorner, then an input mesh boundary vertex becomes a SubD corner when the number of edges that end at the vertex is >= MinimumConcaveCornerEdgeCount edges and the corner angle is >= MinimumConcaveCornerAngleRadians.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double MinimumConcaveCornerAngleRadians { get; set; }
Public Property MinimumConcaveCornerAngleRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace