RhinoCommon API
EndAnalysisSettings.Color Property
 Gets or sets a color used to display the points.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Color Color { get; set; }
Public Shared Property Color As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
EndAnalysisSettings Class
Rhino.ApplicationSettings Namespace