RhinoCommon API
ZebraAnalysisSettings.StripeThickness Property
 Gets or sets the stripe thickness, where 0 = thinnest and 6 = thickest.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public static int StripeThickness { get; set; }
Public Shared Property StripeThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ZebraAnalysisSettings Class
Rhino.ApplicationSettings Namespace