RhinoCommon API
File3dmRenderContent.ChildSlotName Property
The render content's child slot name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string ChildSlotName { get; }
Public ReadOnly Property ChildSlotName As String
	Get
Property Value
Type: String
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace