RhinoCommon API
PostEffectUuids.WireframeIsocurvesRGBA Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.WireframeIsocurvesRGBA"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid WireframeIsocurvesRGBA { get; }
Public Shared ReadOnly Property WireframeIsocurvesRGBA As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace