RhinoCommon API
Leader.LeaderTextHorizontalAlignment Property
 Gets or sets the horizontal alignment of the leader's text
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextHorizontalAlignment LeaderTextHorizontalAlignment { get; set; }
Public Property LeaderTextHorizontalAlignment As TextHorizontalAlignment
	Get
	Set
Property Value
Type: TextHorizontalAlignment
See Also
Reference
Leader Class
Rhino.Geometry Namespace