RhinoCommon API
DimensionStyle.ToleranceHeightScale Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ToleranceHeightScale"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ToleranceHeightScale { get; set; }
Public Property ToleranceHeightScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace