RhinoCommon API
RhinoSettings.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.DataSources.RhinoSettings.CppPointer"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace