RhinoCommon API
StringParserSettings.ParseRationalNumber Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseRationalNumber"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseRationalNumber { get; set; }
Public Property ParseRationalNumber As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace