RhinoCommon API
PostEffectUuids.GaussianBlur Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.GaussianBlur"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid GaussianBlur { get; }
Public Shared ReadOnly Property GaussianBlur As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace