RhinoCommon API
GripObject.Index Property
[Missing <summary> documentation for "P:Rhino.DocObjects.GripObject.Index"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override int Index { get; set; }
Public Overrides Property Index As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace