RhinoCommon API
DisplayPipelineAttributes.ControlPolygonWireThickness Property
 The width of the control polygon lines in pixels.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int ControlPolygonWireThickness { get; set; }
Public Property ControlPolygonWireThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace