RhinoCommon API
CentermarkObject.CentermarkGeometry Property
 Get the dimension geometry for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Centermark CentermarkGeometry { get; }
Public ReadOnly Property CentermarkGeometry As Centermark
	Get
Property Value
Type: Centermark
See Also
Reference
CentermarkObject Class
Rhino.DocObjects Namespace