RhinoCommon API
LicenseLease.LeaseId Property
 The ID of this lease.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string LeaseId { get; }
Public ReadOnly Property LeaseId As String
	Get
Property Value
Type: String
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace