RhinoCommon API
Dimension.LengthRoundoff Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.LengthRoundoff"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double LengthRoundoff { get; set; }
Public Property LengthRoundoff As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace