RhinoCommon API
PlugIn.AskOnLoadProtection Property
 If true, Rhino will display a warning dialog when load-protected plug-ins are attempting to load. If false, load-protected plug-ins will silently not load.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool AskOnLoadProtection { get; set; }
Public Shared Property AskOnLoadProtection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace