RhinoCommon API
RhinoDoc.ModelSpaceAnnotationScalingEnabled Property
 If ModelSpaceAnnotationScaling is on, sizes in dimstyles are multiplied by dimscale when the annotation is displayed in a model space viewport not in a detail
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ModelSpaceAnnotationScalingEnabled { get; set; }
Public Property ModelSpaceAnnotationScalingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace