RhinoCommon API
File3dmRenderTexture.Filename Property
 If the texture has a file name, returns that file name. Otherwise returns an empty string.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string Filename { get; }
Public ReadOnly Property Filename As String
	Get
Property Value
Type: String
See Also
Reference
File3dmRenderTexture Class
Rhino.FileIO Namespace