RhinoCommon API
SubDComponentParameter.IsFaceParameter Property
 Gets true if this parameter identifies a surface point inside a SubD face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsFaceParameter { get; }
Public ReadOnly Property IsFaceParameter As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace