RhinoCommon API
NurbsSurfacePointList.CountU Property
 Gets the number of control points in the U direction of this surface.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int CountU { get; }
Public ReadOnly Property CountU As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace