RhinoCommon API
PhysicallyBasedMaterial.ReflectiveIOR Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.ReflectiveIOR"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double ReflectiveIOR { get; set; }
Public Property ReflectiveIOR As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace