RhinoCommon API
RhinoApp.IsCloudZooNode Property
 Returns true if rhino is currently using the Cloud Zoo false otherwise
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool IsCloudZooNode { get; }
Public Shared ReadOnly Property IsCloudZooNode As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace