RhinoCommon API
DocumentOpenEventArgs.Merge Property
 true if file is being merged into the current document. This occurs during the "Import" command.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Merge { get; }
Public ReadOnly Property Merge As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DocumentOpenEventArgs Class
Rhino Namespace