RhinoCommon API
DisplayModeDescription.WireframePipelineRequired Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.WireframePipelineRequired"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool WireframePipelineRequired { get; set; }
Public Property WireframePipelineRequired As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace