RhinoCommon API
ViewInfo.FocalBlurSampleCount Property
 Gets or sets the Focal blur sample count of the active viewport
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint FocalBlurSampleCount { get; set; }
Public Property FocalBlurSampleCount As UInteger
	Get
	Set
Property Value
Type: UInt32
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace