RhinoCommon API
GumballDisplayConduit.PreTransform Property
 The pre-transform is a transformation that needs to be applied before the gumball transformation.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Transform PreTransform { get; set; }
Public Property PreTransform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace