RhinoCommon API
RhinoDoc.EarthAnchorPoint Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.EarthAnchorPoint"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public EarthAnchorPoint EarthAnchorPoint { get; set; }
Public Property EarthAnchorPoint As EarthAnchorPoint
	Get
	Set
Property Value
Type: EarthAnchorPoint
See Also
Reference
RhinoDoc Class
Rhino Namespace