RhinoCommon API
StringParserSettings.ParseSettingsDoubleNumber Property
 - The double number settings parse and optional unary + or unary - and then parse a number that can be integer, decimal, or scientific e notation.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static StringParserSettings ParseSettingsDoubleNumber { get; }
Public Shared ReadOnly Property ParseSettingsDoubleNumber As StringParserSettings
	Get
Property Value
Type: StringParserSettings
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace