RhinoCommon API
UserInterfaceObjectBase.BoundToActiveView Property
[Missing <summary> documentation for "P:Rhino.UI.UserInterfaceObjectBase.BoundToActiveView"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool BoundToActiveView { get; set; }
Public Property BoundToActiveView As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace