RhinoCommon API
ModelAidSettingsState.EnableOsnapHighlight Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettingsState.EnableOsnapHighlight"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool EnableOsnapHighlight { get; set; }
Public Property EnableOsnapHighlight As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace