RhinoCommon API
SubDEdgeSharpness.IsConstantOrCrease Property
 Gets true if both ends have the same valid sharpness value, or if this is Crease.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool IsConstantOrCrease { get; }
Public ReadOnly Property IsConstantOrCrease As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace