RhinoCommon API
ICurrentEnvironment.ForBackground_CheckMode Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment.ForBackground_CheckMode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Same as ForBackground. Please use ForBackground")]
RenderEnvironment ForBackground_CheckMode { get; set; }
<ObsoleteAttribute("Same as ForBackground. Please use ForBackground")>
Property ForBackground_CheckMode As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
Implements
ICurrentEnvironment_Get.ForBackground_CheckMode
See Also
Reference
ICurrentEnvironment Interface
Rhino.Render Namespace