RhinoCommon API
AddCustomUISectionsEventArgs.ExpandableContentUI Property
[Missing <summary> documentation for "P:Rhino.Render.AddCustomUISectionsEventArgs.ExpandableContentUI"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public ExpandableContentUI ExpandableContentUI { get; }
Public ReadOnly Property ExpandableContentUI As ExpandableContentUI
	Get
Property Value
Type: ExpandableContentUI
See Also
Reference
AddCustomUISectionsEventArgs Class
Rhino.Render Namespace