RhinoCommon API
ColorRGBA.R Property
 Gets or sets the red channel value. Red channels are limited to a 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double R { get; set; }
Public Property R As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace