RhinoCommon API
RhinoReplaceObjectEventArgs.OldRhinoObject Property
 The existing object, or the object about to be deleted. At the time is called, this object has not been deleted.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoObject OldRhinoObject { get; }
Public ReadOnly Property OldRhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
RhinoReplaceObjectEventArgs Class
Rhino.DocObjects Namespace
RhinoDoc.ReplaceRhinoObject