RhinoCommon API
Font.IsGeometricToleranceFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.IsGeometricToleranceFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsGeometricToleranceFont { get; }
Public ReadOnly Property IsGeometricToleranceFont As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Font Class
Rhino.DocObjects Namespace