RhinoCommon API
EndAnalysisSettingsState.Color Property
 Gets or sets a color used to display the points.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color Color { get; set; }
Public Property Color As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
EndAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace