RhinoCommon API
RadialDimension.TextLocation Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.TextLocation"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override DimensionStyle.TextLocation TextLocation { get; set; }
Public Overrides Property TextLocation As DimensionStyle.TextLocation
	Get
	Set
Property Value
Type: DimensionStyle.TextLocation
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace