RhinoCommon API
File3dmMeshModifiers.Thickening Property
 Returns an object that provides access to thickening information. If no thickening information is present, the method returns null.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmThickening Thickening { get; }
Public ReadOnly Property Thickening As File3dmThickening
	Get
Property Value
Type: File3dmThickening
See Also
Reference
File3dmMeshModifiers Class
Rhino.FileIO Namespace