RhinoCommon API
DisplayPipelineAttributes.MeshNonmanifoldEdgeThickness Property
 Non-manifold mesh edge width in pixels
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int MeshNonmanifoldEdgeThickness { get; set; }
Public Property MeshNonmanifoldEdgeThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace