RhinoCommon API
TwoColorRenderTexture.Texture1Amount Property
[Missing <summary> documentation for "P:Rhino.Render.TwoColorRenderTexture.Texture1Amount"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public double Texture1Amount { get; set; }
Public Property Texture1Amount As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace