RhinoCommon API
StringParserSettings.ParseHyphenAsNumberDash Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseHyphenAsNumberDash"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseHyphenAsNumberDash { get; set; }
Public Property ParseHyphenAsNumberDash As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace