RhinoCommon API
GumballSettings.ArcThickness Property
 Specifies the thickness of the rotation arcs in pixels. Set arc thickness to zero to turn off rotation handles.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int ArcThickness { get; set; }
Public Shared Property ArcThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace