RhinoCommon API
MeshInstance.AncestryRecord.ReferenceAttributes Property
 The object attributes from the InstanceObject
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
public ObjectAttributes ReferenceAttributes { get; }
Public ReadOnly Property ReferenceAttributes As ObjectAttributes
	Get
Property Value
Type: ObjectAttributes
See Also
Reference
MeshInstance.AncestryRecord Class
Rhino.Render.ChangeQueue Namespace