RhinoCommon API
RhinoView.ActiveViewportID Property
 Returns viewport ID for the active viewport. Faster than ActiveViewport function when working with page views.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid ActiveViewportID { get; }
Public ReadOnly Property ActiveViewportID As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoView Class
Rhino.Display Namespace