RhinoCommon API
ArchivableDictionary.ParentUserData Property
 If this dictionary is part of user-data (or is a UserDictionary), then this is the parent user data. null if this dictionary is not part of user-data
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public UserData ParentUserData { get; }
Public ReadOnly Property ParentUserData As UserData
	Get
Property Value
Type: UserData
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace