RhinoCommon API
ModelAidSettings.ProjectToCPlaneInPlanParallelViews Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettings.ProjectToCPlaneInPlanParallelViews"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool ProjectToCPlaneInPlanParallelViews { get; set; }
Public Shared Property ProjectToCPlaneInPlanParallelViews As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace