RhinoCommon API
File3dmRenderContent.PlugInId Property
The content's plug-in id.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid PlugInId { get; }
Public ReadOnly Property PlugInId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace