RhinoCommon API
FileIgsWriteOptions.MeshType Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.MeshType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileIgsWriteOptions.MeshesMode MeshType { get; set; }
Public Property MeshType As FileIgsWriteOptions.MeshesMode
	Get
	Set
Property Value
Type: FileIgsWriteOptions.MeshesMode
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace