RhinoCommon API
CurvatureAnalysisSettingsState.Style Property
 Gets or sets the curvature analysis style.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public CurvatureAnalysisSettings.CurvatureStyle Style { get; set; }
Public Property Style As CurvatureAnalysisSettings.CurvatureStyle
	Get
	Set
Property Value
Type: CurvatureAnalysisSettings.CurvatureStyle
See Also
Reference
CurvatureAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace