RhinoCommon API
BrepSurfaceList.Count Property
 Gets the number of surfaces in a brep.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.4
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepSurfaceList Class
Rhino.Geometry.Collections Namespace