RhinoCommon API
FileObjReadOptions.IgnoreTextures Property
 Determines whether textures are read from the .mtl file, if it exists.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IgnoreTextures { get; set; }
Public Property IgnoreTextures As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace