RhinoCommon API
RenderSettings.RenderChannels Property
 If this object is associated with a document, this gets the document render channels. Otherwise it gets a 'free-floating' render channels object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RenderChannels RenderChannels { get; }
Public ReadOnly Property RenderChannels As RenderChannels
	Get
Property Value
Type: RenderChannels
See Also
Reference
RenderSettings Class
Rhino.Render Namespace