RhinoCommon API
DetailViewObject.DetailGeometry Property
 Returns the detail view geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DetailView DetailGeometry { get; }
Public ReadOnly Property DetailGeometry As DetailView
	Get
Property Value
Type: DetailView
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace