RhinoCommon API
ICurrentEnvironment.ForLighting Property
 Get or set the RenderEnvironment used as custom skylighting environment. If getting, null will be returned if the custom skylighting environment override is disabled. If setting, passing null will turn the custom skylighting environment override off but it will not actually set its id to null. Setting to a valid environment will also turn the custom skylighting environment override on.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
RenderEnvironment ForLighting { get; set; }
Property ForLighting As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
Implements
ICurrentEnvironment_Get.ForLighting
See Also
Reference
ICurrentEnvironment Interface
Rhino.Render Namespace