RhinoCommon API
AnnotationObjectBase.AnnotationGeometry Property
 Get the annotation base geometry for this object
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public AnnotationBase AnnotationGeometry { get; }
Public ReadOnly Property AnnotationGeometry As AnnotationBase
	Get
Property Value
Type: AnnotationBase
See Also
Reference
AnnotationObjectBase Class
Rhino.DocObjects Namespace