RhinoCommon API
RenderSettings.RenderPoints Property
 Gets or sets a value indicating whether to instruct the rendering engine to show points.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool RenderPoints { get; set; }
Public Property RenderPoints As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderSettings Class
Rhino.Render Namespace