RhinoCommon API
LayerTableEventArgs.EventType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LayerTableEventArgs.EventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public LayerTableEventType EventType { get; }
Public ReadOnly Property EventType As LayerTableEventType
	Get
Property Value
Type: LayerTableEventType
See Also
Reference
LayerTableEventArgs Class
Rhino.DocObjects.Tables Namespace