RhinoCommon API
ObjectAttributes.HatchBoundaryVisible Property
 Draw the bounrdaries for a hatch (default is false)
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool HatchBoundaryVisible { get; set; }
Public Property HatchBoundaryVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace