RhinoCommon API
Material.DisableLighting Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.DisableLighting"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DisableLighting { get; set; }
Public Property DisableLighting As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Material Class
Rhino.DocObjects Namespace