RhinoCommon API
ViewCaptureSettings.MediaSize Property
 Total size of the image or page in dots
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Size MediaSize { get; }
Public ReadOnly Property MediaSize As Size
	Get
Property Value
Type: Size
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace