RhinoCommon API
MouseCallback.Enabled Property
[Missing <summary> documentation for "P:Rhino.UI.MouseCallback.Enabled"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MouseCallback Class
Rhino.UI Namespace