RhinoCommon API
Linetype.AlwaysModelDistances Property
 Linetype patterns and widths are typically interpreted as distances on the printed output when printing. In this case AlwaysModelDistances is false (default). When set to true, the linetype pattern and width will be interpreted as being in world distances. This is useful for cases like modeling a road as a single curve.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public bool AlwaysModelDistances { get; set; }
Public Property AlwaysModelDistances As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace