RhinoCommon API
FileFbxReadOptions.ImportMeshesAsSubD Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileFbxReadOptions.ImportMeshesAsSubD"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportMeshesAsSubD { get; set; }
Public Property ImportMeshesAsSubD As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileFbxReadOptions Class
Rhino.FileIO Namespace