RhinoCommon API
MarkupTableEventArgs.Document Property
The Rhino document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
MarkupTableEventArgs Class
Rhino.DocObjects.Tables Namespace