RhinoCommon API
RuiUpdateUi.Text Property
Menu item text
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace