RhinoCommon API
Layer.ModelIsVisible Property
 Gets or sets the model visiblity of this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ModelIsVisible { get; set; }
Public Property ModelIsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Layer Class
Rhino.DocObjects Namespace