RhinoCommon API
RhinoDoc.ModelRelativeTolerance Property
Model space relative tolerance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ModelRelativeTolerance { get; set; }
Public Property ModelRelativeTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RhinoDoc Class
Rhino Namespace