RhinoCommon API
SimpleArrayLinetypePointer.Count Property
 Gets the amount of linetypes in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.6
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SimpleArrayLinetypePointer Class
Rhino.Runtime.InteropWrappers Namespace