RhinoCommon API
ViewInfo.DisplayModeId Property
 The id of the display mode this view opens in - wireframe, shaded, rendered, or any custom display mode. DisplayModeDescription holds the standard ids. A nil id means the view has no display mode of its own and opens in wireframe, which is what every template generated without this property did.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public Guid DisplayModeId { get; set; }
Public Property DisplayModeId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace