RhinoCommon API
Brep.Loops Property
 Gets the brep loop list accessor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BrepLoopList Loops { get; }
Public ReadOnly Property Loops As BrepLoopList
	Get
Property Value
Type: BrepLoopList
See Also
Reference
Brep Class
Rhino.Geometry Namespace