RhinoCommon API
FileIgsWriteOptions.Scale Property
(model space units)/(real world units) For example, if unit_system = TL_INCHES and 1 model space unit = 8 inches, then scale = 0.125.Note that model space units are stored in the IGES file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double Scale { get; set; }
Public Property Scale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace