RhinoCommon API
GuidField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Guid Value { get; set; }
Public Property Value As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
GuidField Class
Rhino.Render.Fields Namespace