RhinoCommon API
RhinoViewport.LockedProjection Property
 If true, the camera location, camera direction, and lens angle should not be changed.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool LockedProjection { get; set; }
Public Property LockedProjection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace