RhinoCommon API
RenderTexture.PixelSize2 Property
 Override to provide details on the actual pixel sizes of this texture in UVW directions return null if the texture should not be treated as a bitmap.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public virtual (int width, int height, int depth)? PixelSize2 { get; }
Public Overridable ReadOnly Property PixelSize2 As (width As Integer, height As Integer, depth As Integer)?
	Get
Property Value
Type: Nullable<ValueTuple<Int32, Int32, Int32>>
See Also
Reference
RenderTexture Class
Rhino.Render Namespace