RhinoCommon API
Panels.EtoPanelStyleName Property
 Style applied to Eto controls hosted by the Rhino.UI.Panels and Rhino.UI.ObjectProperties systems.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public static string EtoPanelStyleName { get; }
Public Shared ReadOnly Property EtoPanelStyleName As String
	Get
Property Value
Type: String
The name of the Eto panel style.
See Also
Reference
Panels Class
Rhino.UI Namespace