RhinoCommon API
ContentUuids.PaintMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.PaintMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid PaintMaterialType { get; }
Public Shared ReadOnly Property PaintMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace