RhinoCommon API
DraftAngleAnalysisSettingsState.ShowIsoCurves Property
 Show isoparametric curves.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool ShowIsoCurves { get; set; }
Public Property ShowIsoCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DraftAngleAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace