RhinoCommon API
RhinoTransformObjectsEventArgs.Grips Property
 An array of Rhino object grips that will be transformed. WARNING: these objects may be deleted at anytime after the event handler has been notified. Do not save references to these objects. Use the object's runtime serial number to safely reference these objects at a later time.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public GripObject[] Grips { get; }
Public ReadOnly Property Grips As GripObject()
	Get
Property Value
Type: GripObject[]
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace