RhinoCommon API
ProviderIds.ContentUpdatePreviewMarkersEventInfo Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.ContentUpdatePreviewMarkersEventInfo"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid ContentUpdatePreviewMarkersEventInfo { get; }
Public Shared ReadOnly Property ContentUpdatePreviewMarkersEventInfo As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace