RhinoCommon API
PhysicallyBased.SubsurfaceScatteringColor Property
[Missing <summary> documentation for "P:Rhino.Render.ParameterNames.PhysicallyBased.SubsurfaceScatteringColor"]
 Namespace: Rhino.Render.ParameterNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string SubsurfaceScatteringColor { get; }
Public Shared ReadOnly Property SubsurfaceScatteringColor As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ParameterNames Namespace