RhinoCommon API
DisplayPipelineAttributes.ViewDisplayAttributes.WorldAxisColorZ Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes.WorldAxisColorZ"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color WorldAxisColorZ { get; set; }
Public Property WorldAxisColorZ As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace