RhinoCommon API
DimensionStyle.StackFractionFormat Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.StackFractionFormat"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.StackDisplayFormat StackFractionFormat { get; set; }
Public Property StackFractionFormat As DimensionStyle.StackDisplayFormat
	Get
	Set
Property Value
Type: DimensionStyle.StackDisplayFormat
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace