RhinoCommon API
FilePlyWriteOptions.ExportNormals Property
 Determines whether to export vertex normals.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool ExportNormals { get; set; }
Public Property ExportNormals As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace