RhinoCommon API
FileSvgReadOptions.RetainGrouping Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSvgReadOptions.RetainGrouping"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool RetainGrouping { get; set; }
Public Property RetainGrouping As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSvgReadOptions Class
Rhino.FileIO Namespace