RhinoCommon API
FileCsvWriteOptions.LayerColor Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.LayerColor"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool LayerColor { get; set; }
Public Property LayerColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace