RhinoCommon API
RuntimeDocumentDataTable.Document Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.RuntimeDocumentDataTable.Document"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RuntimeDocumentDataTable Class
Rhino.DocObjects.Tables Namespace