RhinoCommon API
FileUsdWriteOptions.ForceMeshes Property
 Forces all geometry to be represented as meshes
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ForceMeshes { get; set; }
Public Property ForceMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileUsdWriteOptions Class
Rhino.FileIO Namespace