RhinoCommon API
StringParserSettings.ParseIntegerDashFraction Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseIntegerDashFraction"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseIntegerDashFraction { get; set; }
Public Property ParseIntegerDashFraction As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace