RhinoCommon API
ProviderIds.Decals Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.Decals"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public static Guid Decals { get; }
Public Shared ReadOnly Property Decals As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace