RhinoCommon API
LicenseStatus.CheckOutExpirationDate Property
 The date and time the checked out license will expire. Note, this is only set if m_license_type = Standalone or CloudZoo and if "limited license checkout" was enabled on the Zoo server in the case of Standalone. Note, date and time is in local time coordinates.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DateTime? CheckOutExpirationDate { get; set; }
Public Property CheckOutExpirationDate As DateTime?
	Get
	Set
Property Value
Type: Nullable<DateTime>
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace