RhinoCommon API
MeshInterference.IndexA Property
 The index of the first clashing, or interfering object.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int IndexA { get; set; }
Public Property IndexA As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshInterference Structure
Rhino.Geometry.Intersect Namespace