RhinoCommon API
DisplayPipelineAttributes.SubDReflectionPlaneColorUsage Property
 SubD replection plane color use
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public DisplayPipelineAttributes.SubDReflectionPlaneColorUse SubDReflectionPlaneColorUsage { get; set; }
Public Property SubDReflectionPlaneColorUsage As DisplayPipelineAttributes.SubDReflectionPlaneColorUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.SubDReflectionPlaneColorUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace