RhinoCommon API
Texture.Id Property
 Gets the globally unique identifier of this texture.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
Texture Class
Rhino.DocObjects Namespace