RhinoCommon API
SubDEdgeSharpness.Trend Property
 Gets +1 if the sharpness increases along the edge, -1 if it decreases, and 0 if it is constant. Returns UnsetIntIndex if this is not valid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public int Trend { get; }
Public ReadOnly Property Trend As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace