RhinoCommon API
MeshProviderIds.Shutlining Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderMeshes.MeshProviderIds.Shutlining"]
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Guid Shutlining { get; }
Public Shared ReadOnly Property Shutlining As Guid
	Get
Property Value
Type: Guid
See Also
Reference
MeshProviderIds Class
Rhino.Render.CustomRenderMeshes Namespace