RhinoCommon API
ProviderIds.RenderChannels Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.RenderChannels"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Guid RenderChannels { get; }
Public Shared ReadOnly Property RenderChannels As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace