RhinoCommon API
DisplayPipelineAttributes.BackMaterialDiffuseColor Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.BackMaterialDiffuseColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public Color BackMaterialDiffuseColor { get; set; }
Public Property BackMaterialDiffuseColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace