RhinoCommon API
RhinoDocObserverArgs.Doc Property
 Document
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoDoc Doc { get; }
Public ReadOnly Property Doc As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoDocObserverArgs Class
Rhino Namespace