RhinoCommon API
LicenseLease.GroupName Property
 Name of Rhino Accounts group that this lease came from
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string GroupName { get; }
Public ReadOnly Property GroupName As String
	Get
Property Value
Type: String
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace