RhinoCommon API
AppearanceSettingsState.ShowCursorWhenCrosshairsVisible Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.AppearanceSettingsState.ShowCursorWhenCrosshairsVisible"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ShowCursorWhenCrosshairsVisible { get; set; }
Public Property ShowCursorWhenCrosshairsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace