RhinoCommon API
PackageManagerSettings.Sources Property
 semicolon separated list of paths/urls that the package manager uses for sources
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public static string Sources { get; set; }
Public Shared Property Sources As String
	Get
	Set
Property Value
Type: String
See Also
Reference
PackageManagerSettings Class
Rhino.ApplicationSettings Namespace