RhinoCommon API
PhysicallyBased.ClearcoatRoughness Property
[Missing <summary> documentation for "P:Rhino.Render.ParameterNames.PhysicallyBased.ClearcoatRoughness"]
 Namespace: Rhino.Render.ParameterNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string ClearcoatRoughness { get; }
Public Shared ReadOnly Property ClearcoatRoughness As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ParameterNames Namespace