RhinoCommon API
ObjectPropertiesPage.PageType Property
 Override this and return the page you want to replace a specific object properties page.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public virtual PropertyPageType PageType { get; }
Public Overridable ReadOnly Property PageType As PropertyPageType
	Get
Property Value
Type: PropertyPageType
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace