RhinoCommon API
ViewSettings.RotateViewAroundObjectAtMouseCursor Property
 Gets or sets the 'Rotate view around object at mouse cursor' value.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.19
Syntax
public static bool RotateViewAroundObjectAtMouseCursor { get; set; }
Public Shared Property RotateViewAroundObjectAtMouseCursor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace