RhinoCommon API
RhinoObjectSelectionEventArgs.RhinoObjectCount Property
 Can be faster to call than RhinoObjects.Length
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public int RhinoObjectCount { get; }
Public ReadOnly Property RhinoObjectCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoObjectSelectionEventArgs Class
Rhino.DocObjects Namespace