RhinoCommon API
FileStpWriteOptions.Export2dCurves Property
 Some (not most, and not Rhino) importing applications can make use of the 2-D trimming curves to get a more accurate and faster import. The size of the step file will be larger
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Export2dCurves { get; set; }
Public Property Export2dCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileStpWriteOptions Class
Rhino.FileIO Namespace