RhinoCommon API
DynamicObjectTransform.MeshInstanceId Property
 Get the mesh instance id for this dynamic object.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint MeshInstanceId { get; }
Public ReadOnly Property MeshInstanceId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
DynamicObjectTransform Class
Rhino.Render.ChangeQueue Namespace