RhinoCommon API
ModelAidSettingsState.SnappyGumballEnabled Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettingsState.SnappyGumballEnabled"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SnappyGumballEnabled { get; set; }
Public Property SnappyGumballEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace