RhinoCommon API
StringParserSettings.ParseFeetInches Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseFeetInches"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseFeetInches { get; set; }
Public Property ParseFeetInches As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace