RhinoCommon API
AppearanceSettings.FrameBackgroundColor Property
 Gets or sets the background color of the frame.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color FrameBackgroundColor { get; set; }
Public Shared Property FrameBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace