RhinoCommon API
FileCsvDocument.ColumnCount Property
 The number of columns in the document. Every row has exactly this many fields.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int ColumnCount { get; }
Public ReadOnly Property ColumnCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace