RhinoCommon API
ContentUuids.PhysicalSkyTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.PhysicalSkyTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Guid PhysicalSkyTextureType { get; }
Public Shared ReadOnly Property PhysicalSkyTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace