RhinoCommon API
RhinoView.Size Property
 Gets or sets the size of the view
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Size Size { get; set; }
Public Property Size As Size
	Get
	Set
Property Value
Type: Size
See Also
Reference
RhinoView Class
Rhino.Display Namespace