RhinoCommon API
SimulatedTexture.HasTransparentColor Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.HasTransparentColor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public bool HasTransparentColor { get; set; }
Public Property HasTransparentColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace