RhinoCommon API
Texture.MinFilter Property
 The MinFilter setting controls how the color of the image pixel is calculated when the image pixel corresponds to multiple texture bitmap pixels.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public TextureFilter MinFilter { get; set; }
Public Property MinFilter As TextureFilter
	Get
	Set
Property Value
Type: TextureFilter
See Also
Reference
Texture Class
Rhino.DocObjects Namespace