RhinoCommon API
Dimension.UseDefaultTextPoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.UseDefaultTextPoint"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool UseDefaultTextPoint { get; set; }
Public Property UseDefaultTextPoint As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dimension Class
Rhino.Geometry Namespace