RhinoCommon API
Environment.BackgroundImage Property
Return Value
Type: Texture
The background image texture.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Texture BackgroundImage { get; }
Public ReadOnly Property BackgroundImage As Texture
	Get
Property Value
Type: Texture
See Also
Reference
Environment Class
Rhino.DocObjects Namespace