RhinoCommon API
RenderSettings.NamedView Property
 Get or set the given named view
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public string NamedView { get; set; }
Public Property NamedView As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RenderSettings Class
Rhino.Render Namespace