RhinoCommon API
Brep.VariationalPatchSettings.SpanCountV Property
 Number of spans in V-direction
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int SpanCountV { get; set; }
Public Property SpanCountV As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace