RhinoCommon API
ContentUuids.BlendMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.BlendMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid BlendMaterialType { get; }
Public Shared ReadOnly Property BlendMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace