RhinoCommon API
IOpenIDConnectToken.MemberGroups Property
 Returns all the groups the user is a member of, but not an admin or an owner.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
IReadOnlyDictionary<string, RhinoAccountsGroup> MemberGroups { get; }
ReadOnly Property MemberGroups As IReadOnlyDictionary(Of String, RhinoAccountsGroup)
	Get
Property Value
Type: IReadOnlyDictionary<String, RhinoAccountsGroup>
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace