RhinoCommon API
PageViewPropertiesChangeEventArgs.DocumentSerialNumber Property
 The serial number of the Rhino document.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public uint DocumentSerialNumber { get; }
Public ReadOnly Property DocumentSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
PageViewPropertiesChangeEventArgs Class
Rhino.Display Namespace