RhinoCommon API
NurbsCurveFitParameters.PointCountRange Property
 Gets or sets the point count range as an IndexPair.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IndexPair PointCountRange { get; set; }
Public Property PointCountRange As IndexPair
	Get
	Set
Property Value
Type: IndexPair
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace