RhinoCommon API
Linetype.Width Property
 Base width for this linetype
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double Width { get; set; }
Public Property Width As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace