RhinoCommon API
GroundPlane.TextureSizeLocked Property
 Texture size locked.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TextureSizeLocked { get; set; }
Public Property TextureSizeLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GroundPlane Class
Rhino.Render Namespace