RhinoCommon API
Brep.VariationalPatchSettings.MaxRefinements Property
 The maximum number of refinements to apply (default 5).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int MaxRefinements { get; set; }
Public Property MaxRefinements As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace