RhinoCommon API
DracoCompression.VertexAttributePosition Property
 The attribute position for vertices when compressed
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
public int VertexAttributePosition { get; }
Public ReadOnly Property VertexAttributePosition As Integer
	Get
Property Value
Type: Int32
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace