RhinoCommon API
NameHash.Sha1Hash Property
 Gets the 20-bytes long SHA-1 hash of ordinal minimum mapped Unicode (UTF-32) code points.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public byte[] Sha1Hash { get; }
Public ReadOnly Property Sha1Hash As Byte()
	Get
Property Value
Type: Byte[]
See Also
Reference
NameHash Class
Rhino.FileIO Namespace