RhinoCommon API
AppearanceSettingsState.ViewportBackgroundColor Property
Gets or sets the viewport background color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color ViewportBackgroundColor { get; set; }
Public Property ViewportBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace