RhinoCommon API
GripsDrawEventArgs.DrawStaticStuff Property
 If true, then draw stuff that moves when grips are dragged, like the curve being bent by a dragged control point.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool DrawStaticStuff { get; }
Public ReadOnly Property DrawStaticStuff As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace