RhinoCommon API
ModelAidSettingsState.Ortho Property
Gets or sets the enabled state of Rhino's ortho modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Ortho { get; set; }
Public Property Ortho As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace