RhinoCommon API
ReduceMeshParameters.AllowDistortion Property
 If true, faces are removed until DesiredPolygonCount is reached, distorting the shape as needed. If false, only flat (coplanar) regions are simplified, which leaves the shape unchanged and ignores DesiredPolygonCount.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AllowDistortion { get; set; }
Public Property AllowDistortion As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace