RhinoCommon API
File3dmRenderContent.TopLevel Property
The top-level parent content. Returns this if this is the top-level item.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmRenderContent TopLevel { get; }
Public ReadOnly Property TopLevel As File3dmRenderContent
	Get
Property Value
Type: File3dmRenderContent
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace