RhinoCommon API
DimensionStyle.ToleranceResolution Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ToleranceResolution"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int ToleranceResolution { get; set; }
Public Property ToleranceResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace