RhinoCommon API
SectionStyle.HatchRotationRadians Property
 Rotation to apply to the hatch patterh
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double HatchRotationRadians { get; set; }
Public Property HatchRotationRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace