RhinoCommon API
FileSkpReadOptions.UseSketchUpTextureWriter Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSkpReadOptions.UseSketchUpTextureWriter"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool UseSketchUpTextureWriter { get; set; }
Public Property UseSketchUpTextureWriter As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSkpReadOptions Class
Rhino.FileIO Namespace