RhinoCommon API
MeshNgon.Item Property
 Get a mesh vertex index from the ngon's vertex index list.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As Integer
	Get
Parameters
index
Type: System.Int32
A mesh vertex number between 0 and MeshNgon.VertexCount-1 that refers to a mesh vertex index in this ngon.
Return Value
Type: Int32
A mesh vertex index.
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace
Rhino.Geometry.MeshNgon