RhinoCommon API
DisplayModeDescription.PenId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.PenId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid PenId { get; }
Public Shared ReadOnly Property PenId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace