RhinoCommon API
AppearanceSettings.TrackingColor Property
 Gets or sets the tracking color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color TrackingColor { get; set; }
Public Shared Property TrackingColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace