RhinoCommon API
ModelAidSettings.NearMidIntPerpSnapToMeshes Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettings.NearMidIntPerpSnapToMeshes"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool NearMidIntPerpSnapToMeshes { get; set; }
Public Shared Property NearMidIntPerpSnapToMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace