RhinoCommon API
DimensionStyle.ClippingArrowType2 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ClippingArrowType2"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public DimensionStyle.ClippingArrowType ClippingArrowType2 { get; set; }
Public Property ClippingArrowType2 As DimensionStyle.ClippingArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ClippingArrowType
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace