RhinoCommon API
Line.FromZ Property
 Gets or sets the Z coordinate of the line From point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double FromZ { get; set; }
Public Property FromZ As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Line Structure
Rhino.Geometry Namespace