RhinoCommon API
StringParserSettings.ParseCommaAsDigitSeparator Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseCommaAsDigitSeparator"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseCommaAsDigitSeparator { get; set; }
Public Property ParseCommaAsDigitSeparator As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace