RhinoCommon API
RenderChannels.Mode Property
[Missing <summary> documentation for "P:Rhino.Render.RenderChannels.Mode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RenderChannels.Modes Mode { get; set; }
Public Property Mode As RenderChannels.Modes
	Get
	Set
Property Value
Type: RenderChannels.Modes
See Also
Reference
RenderChannels Class
Rhino.Render Namespace