RhinoCommon API
RhinoDoc.TextureMappingEventArgs.EventType Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.TextureMappingEventArgs.EventType"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public RhinoDoc.TextureMappingEventType EventType { get; }
Public ReadOnly Property EventType As RhinoDoc.TextureMappingEventType
	Get
Property Value
Type: RhinoDoc.TextureMappingEventType
See Also
Reference
RhinoDoc.TextureMappingEventArgs Class
Rhino Namespace