RhinoCommon API
DisplayPipelineAttributes.BakeTextures Property
 Adds the ability to display procedural textures in viewports. When it is turned off, procedural textures in viewports look different from the rendering.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public bool BakeTextures { get; set; }
Public Property BakeTextures As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace