RhinoCommon API
CustomRenderContentAttribute.IsLinear Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.IsLinear"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.16
Syntax
public bool IsLinear { get; set; }
Public Property IsLinear As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace