RhinoCommon API
GumballAppearanceSettings.RotateZEnabled Property
 When RotateZ is true, the Z rotation control is available. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool RotateZEnabled { get; set; }
Public Property RotateZEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace