RhinoCommon API
Brep.VariationalPatchSettings.Domain Property
 The domain creation option
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RhinoVariationalDomain Domain { get; set; }
Public Property Domain As RhinoVariationalDomain
	Get
	Set
Property Value
Type: RhinoVariationalDomain
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace