RhinoCommon API
ModelComponent.IsReference Property
 Gets a value indicting whether this component is a referenced component. Referenced components are part of referenced documents.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public virtual bool IsReference { get; }
Public Overridable ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace