RhinoCommon API
ColorGradient.EndPoint Property
 End point of gradient
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Point3d EndPoint { get; set; }
Public Property EndPoint As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
ColorGradient Class
Rhino.Display Namespace