RhinoCommon API
EmapAnalysisSettings.ShowIsoparams Property
 Gets or sets whether to display iso curves.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool ShowIsoparams { get; set; }
Public Shared Property ShowIsoparams As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
EmapAnalysisSettings Class
Rhino.ApplicationSettings Namespace