RhinoCommon API
ViewCaptureSettings.ViewArea Property
 How the RhinoViewport is mapped to the output rectangle
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
public ViewCaptureSettings.ViewAreaMapping ViewArea { get; set; }
Public Property ViewArea As ViewCaptureSettings.ViewAreaMapping
	Get
	Set
Property Value
Type: ViewCaptureSettings.ViewAreaMapping
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace