RhinoCommon API
LicenseLease.RenewableUntil Property
 The date when the license in the cloud zoo entity will expire, if any
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.25
Syntax
public DateTime? RenewableUntil { get; }
Public ReadOnly Property RenewableUntil As DateTime?
	Get
Property Value
Type: Nullable<DateTime>
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace