RhinoCommon API
LengthMassProperties.WorldCoordinatesRadiiOfGyration Property
 Radii of gyration with respect to world coordinate system. X = sqrt(integral of (y^2 + z^2) dm/M) Y = sqrt(integral of (z^2 + x^2) dm/M) Z = sqrt(integral of (z^2 + y^2) dm/M)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public Vector3d WorldCoordinatesRadiiOfGyration { get; }
Public ReadOnly Property WorldCoordinatesRadiiOfGyration As Vector3d
	Get
Property Value
Type: Vector3d
Remarks
 What is meant by "radii of gyration" varies widely in textbooks and papers. The values returned here are the integrals listed in the Returns section.
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace