RhinoCommon API
SelCommand.TestGrips Property
[Missing <summary> documentation for "P:Rhino.Commands.SelCommand.TestGrips"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TestGrips { get; set; }
Public Property TestGrips As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SelCommand Class
Rhino.Commands Namespace