RhinoCommon API
FileDwgReadOptions.MakeExtrusions Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgReadOptions.MakeExtrusions"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool MakeExtrusions { get; set; }
Public Property MakeExtrusions As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgReadOptions Class
Rhino.FileIO Namespace