RhinoCommon API
ColorRGBA.G Property
 Gets or sets the green channel value. Green channels are limited to a 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double G { get; set; }
Public Property G As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace