RhinoCommon API
FileIgsWriteOptions.SplitClosedSurfaces Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.SplitClosedSurfaces"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SplitClosedSurfaces { get; set; }
Public Property SplitClosedSurfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace