RhinoCommon API
RenderContent.Tags Property
 Tags for this content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public string Tags { get; set; }
Public Property Tags As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RenderContent Class
Rhino.Render Namespace