RhinoCommon API
SubDComponentParameter.FaceCornerParameters Property
 Gets the two parameters inside the face corner identified by FaceCornerIndex. Both run from 0 to 1/2: (0,0) is the corner vertex and (1/2,1/2) is the center of the face. X runs towards the midpoint of the edge leaving the corner and Y towards the midpoint of the edge entering it. The point is Unset if IsFaceParameter is false.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Point2d FaceCornerParameters { get; }
Public ReadOnly Property FaceCornerParameters As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace