RhinoCommon API
MeshCheckParameters.DegenerateFaceCount Property
 Gets the total degenerate face count for all meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int DegenerateFaceCount { get; }
Public ReadOnly Property DegenerateFaceCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace