RhinoCommon API
ColorCMYK.C Property
 Gets or sets the Cyan channel value. Cyan channels are limited to the 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double C { get; set; }
Public Property C As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace