RhinoCommon API
Skylight.ShadowIntensity Property
 ShadowIntensity is currently unused.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ShadowIntensity { get; set; }
Public Property ShadowIntensity As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Skylight Class
Rhino.Render Namespace