RhinoCommon API
RenderMeshProvider.ProviderId Property
 The localized name of the provider for UI display.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public virtual Guid ProviderId { get; }
Public Overridable ReadOnly Property ProviderId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace