RhinoCommon API
LengthValue.Units Property
 LengthUnit used by this LengthValue
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public LengthUnit Units { get; }
Public ReadOnly Property Units As LengthUnit
	Get
Property Value
Type: LengthUnit
See Also
Reference
LengthValue Class
Rhino Namespace