RhinoCommon API
ContentUuids.CrossHatchBumpTexture Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.CrossHatchBumpTexture"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid CrossHatchBumpTexture { get; }
Public Shared ReadOnly Property CrossHatchBumpTexture As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace