RhinoCommon API
StringParserSettings.ParseArithmeticExpression Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseArithmeticExpression"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseArithmeticExpression { get; set; }
Public Property ParseArithmeticExpression As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace