RhinoCommon API
SubDDisplayParameters.DisplayDensityIsAbsolute Property
 True if the SubD display density setting is absolute.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public bool DisplayDensityIsAbsolute { get; }
Public ReadOnly Property DisplayDensityIsAbsolute As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace