RhinoCommon API
ICurrentEnvironment.ForBackground Property
 Get or set the RenderEnvironment used as the 360 degree backdrop environment. If getting, null will be returned if the background mode is set to 'Solid Color' or 'Gradient' (i.e., not 'Environment'). If setting, passing null will not work because this environment usage can't be turned off.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
RenderEnvironment ForBackground { get; set; }
Property ForBackground As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
Implements
ICurrentEnvironment_Get.ForBackground
See Also
Reference
ICurrentEnvironment Interface
Rhino.Render Namespace