RhinoCommon API
Light.IsDirectionalLight Property
 Gets a value indicating whether the light style is LightStyle CameraDirectional or WorldDirectional.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsDirectionalLight { get; }
Public ReadOnly Property IsDirectionalLight As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Light Class
Rhino.Geometry Namespace