RhinoCommon API
FileWriteOptions.FileTypeId Property
 Returns nil for a Rhino .3dm file or the GUID of the plugin that wrote the file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Guid FileTypeId { get; }
Public ReadOnly Property FileTypeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace