RhinoCommon API
DisplayModeDescription.ShadedId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.ShadedId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid ShadedId { get; }
Public Shared ReadOnly Property ShadedId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace