RhinoCommon API
ShutLiningCurveInfo.IsBump Property
 True if profile constitutes a bump. See Rhino's Help for more information.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsBump { get; }
Public ReadOnly Property IsBump As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace