RhinoCommon API
PointCloud.ContainsPointValues Property
 Gets a value indicating whether or not the points in this point cloud have extra values assigned to them. Extra values can be used to store a user-defined values, such as intensity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public bool ContainsPointValues { get; }
Public ReadOnly Property ContainsPointValues As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace