RhinoCommon API
PostEffect.ExecuteWhileRenderingOption Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffect.ExecuteWhileRenderingOption"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PostEffectExecuteWhileRenderingOptions ExecuteWhileRenderingOption { get; }
Public ReadOnly Property ExecuteWhileRenderingOption As PostEffectExecuteWhileRenderingOptions
	Get
Property Value
Type: PostEffectExecuteWhileRenderingOptions
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace