RhinoCommon API
DisplayPipeline.ActiveObjectNestingStack Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.ActiveObjectNestingStack"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public RhinoObject[] ActiveObjectNestingStack { get; }
Public ReadOnly Property ActiveObjectNestingStack As RhinoObject()
	Get
Property Value
Type: RhinoObject[]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace