RhinoCommon API
MetaData.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.DataSources.MetaData.CppPointer"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
MetaData Class
Rhino.Render.DataSources Namespace