RhinoCommon API
DisplayPipelineAttributes.ControlPolygonGripSize Property
 The control point size in pixels.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int ControlPolygonGripSize { get; set; }
Public Property ControlPolygonGripSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace