RhinoCommon API
DisplayPipelineAttributes.SurfaceEdgeColorReduction Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeColorReduction"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public int SurfaceEdgeColorReduction { get; set; }
Public Property SurfaceEdgeColorReduction As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace