RhinoCommon API
RenderMeshProviderProgress.Target Property
 Target progress
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double Target { get; set; }
Public Property Target As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RenderMeshProviderProgress Class
Rhino.Render.CustomRenderMeshes Namespace