RhinoCommon API
WorksessionModel.IsActiveModel Property
 True if this is the worksession's active model - the document you are editing - rather than a reference model.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsActiveModel { get; }
Public ReadOnly Property IsActiveModel As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
WorksessionModel Class
Rhino.DocObjects Namespace