RhinoCommon API
WorksessionFile.ModelCount Property
Gets the number of models.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int ModelCount { get; }
Public ReadOnly Property ModelCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace