RhinoCommon API
SubDCreationOptions.ConvexCornerTest Property
 Get or sets the convex corner test option.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDCreationOptions.ConvexCornerOption ConvexCornerTest { get; set; }
Public Property ConvexCornerTest As SubDCreationOptions.ConvexCornerOption
	Get
	Set
Property Value
Type: SubDCreationOptions.ConvexCornerOption
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace