RhinoCommon API
PlugInInfo.IsLoaded Property
 Returns true if the plug-in is loaded, false otherwise.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsLoaded { get; }
Public ReadOnly Property IsLoaded As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace