RhinoCommon API
FileDwgWriteOptions.WriteThickCurves Property
Write extrusions with simple profile curves as thick curves.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool WriteThickCurves { get; set; }
Public Property WriteThickCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace