RhinoCommon API
CurvatureAnalysisSettings.ShowIsoCurves Property
 Gets or sets whether to show isocurves.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool ShowIsoCurves { get; set; }
Public Shared Property ShowIsoCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace