RhinoCommon API
Font.FaceName Property
 Returns Face name
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string FaceName { get; }
Public ReadOnly Property FaceName As String
	Get
Property Value
Type: String
See Also
Reference
Font Class
Rhino.DocObjects Namespace