RhinoCommon API
RhinoApp.SendWriteToConsole Property
 Enable or disable sending command window strings to the console RhinoApp.Write(...) calls would be sent to the console when this is enabled
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public static bool SendWriteToConsole { get; set; }
Public Shared Property SendWriteToConsole As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace