RhinoCommon API
ContentUuids.GlassMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.GlassMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid GlassMaterialType { get; }
Public Shared ReadOnly Property GlassMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace