RhinoCommon API
MeshCurvatureStats.Count Property
 Gets the number of "finite" values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCurvatureStats Class
Rhino.Geometry Namespace