RhinoCommon API
BrepLoop.IsSurfaceBoundary Property
 True if the loop's trims all run along the edge's of the underlying surface's parameter space.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.20
Syntax
public bool IsSurfaceBoundary { get; }
Public ReadOnly Property IsSurfaceBoundary As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace