RhinoCommon API
DisplayPipelineAttributes.ShowClipIntersectionSurfaces Property
Show fills where clipping planes clip solid objects
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ShowClipIntersectionSurfaces { get; set; }
Public Property ShowClipIntersectionSurfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace