RhinoCommon API
OrdinateDimensionObject.OrdinateDimensionGeometry Property
 Get the dimension geometry for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public OrdinateDimension OrdinateDimensionGeometry { get; }
Public ReadOnly Property OrdinateDimensionGeometry As OrdinateDimension
	Get
Property Value
Type: OrdinateDimension
See Also
Reference
OrdinateDimensionObject Class
Rhino.DocObjects Namespace