RhinoCommon API
Font.Underlined Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Underlined"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Underlined { get; }
Public ReadOnly Property Underlined As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Font Class
Rhino.DocObjects Namespace