RhinoCommon API
Triangle3d.AltitudeC Property
 Gets the altitude line starting at corner C.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Line AltitudeC { get; }
Public ReadOnly Property AltitudeC As Line
	Get
Property Value
Type: Line
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace