RhinoCommon API
Dithering.On Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Render.Dithering.On"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[ObsoleteAttribute("Use Enabled")]
public bool On { get; set; }
<ObsoleteAttribute("Use Enabled")>
Public Property On As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dithering Class
Rhino.Render Namespace