RhinoCommon API
DetailViewObject.Viewport Property
 Gets the detail view's viewport.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace