RhinoCommon API
ViewportInfo.CameraAngle Property
 Gets or sets the 1/2 of smallest subtended view angle. See GetCameraAngles(Double, Double, Double) for more information.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double CameraAngle { get; set; }
Public Property CameraAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace