RhinoCommon API
File3dsReadOptions.ImportLights Property
[Missing <summary> documentation for "P:Rhino.FileIO.File3dsReadOptions.ImportLights"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportLights { get; set; }
Public Property ImportLights As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dsReadOptions Class
Rhino.FileIO Namespace