RhinoCommon API
FileRawReadOptions.RawModelUnits Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileRawReadOptions.RawModelUnits"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public UnitSystem RawModelUnits { get; set; }
Public Property RawModelUnits As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
FileRawReadOptions Class
Rhino.FileIO Namespace