RhinoCommon API
Texture.ProjectionMode Property
 How texture is projected onto geometry
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public TextureProjectionModes ProjectionMode { get; set; }
Public Property ProjectionMode As TextureProjectionModes
	Get
	Set
Property Value
Type: TextureProjectionModes
See Also
Reference
Texture Class
Rhino.DocObjects Namespace