RhinoCommon API
MeshCurvatureStats.Average Property
 Get the average of "finite" values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Average { get; }
Public ReadOnly Property Average As Double
	Get
Property Value
Type: Double
See Also
Reference
MeshCurvatureStats Class
Rhino.Geometry Namespace