RhinoCommon API
ZebraAnalysisSettingsState.ShowIsoCurves Property
 Get or sets the display of surface isocurves.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public bool ShowIsoCurves { get; set; }
Public Property ShowIsoCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ZebraAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace