RhinoCommon API
NurbsCurveFitParameters.OptimizeCurve Property
 If OptimizeCurve = false, then all options below are ignored and the Greville interpolant is returned. Rhino 1 - Rhino 8 Rebuild command created a result similar to what's created when m_bOptimizeCurve = false.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool OptimizeCurve { get; set; }
Public Property OptimizeCurve As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace