RhinoCommon API
AppearanceSettings.SelectionWindowFillColor Property
 Color used to fill selection window
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Color SelectionWindowFillColor { get; set; }
Public Shared Property SelectionWindowFillColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace