RhinoCommon API
Symbols.PlusMinusSymbol Property
 Plus-Minus tolerance symbol
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static char PlusMinusSymbol { get; }
Public Shared ReadOnly Property PlusMinusSymbol As Char
	Get
Property Value
Type: Char
See Also
Reference
Symbols Class
Rhino Namespace