RhinoCommon API
FileTxtWriteOptions.Precision Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileTxtWriteOptions.Precision"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int Precision { get; set; }
Public Property Precision As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
FileTxtWriteOptions Class
Rhino.FileIO Namespace