RhinoCommon API
File3dmShutLining.ForceUpdate Property
 Specifies whether updating is forced or not.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ForceUpdate { get; set; }
Public Property ForceUpdate As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace