RhinoCommon API
AnimationProperties.FileExtension Property
 Gets or sets the file extension of the saved frames created by the animation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public string FileExtension { get; set; }
Public Property FileExtension As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace