RhinoCommon API
Plane.XAxis Property
 Gets or sets the X axis vector of this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d XAxis { get; set; }
Public Property XAxis As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
Plane Structure
Rhino.Geometry Namespace