RhinoCommon API
ColorHSL.H Property
 Gets or sets the hue channel value. Hue channels rotate between 0.0 and 1.0.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double H { get; set; }
Public Property H As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace