RhinoCommon API
RhinoObject.RuntimeSerialNumber Property
 Gets the objects runtime serial number.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public uint RuntimeSerialNumber { get; }
Public ReadOnly Property RuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace