RhinoCommon API
SmartTrackSettings.MarkerSmartPoint Property
 TODO - Figure out what this does.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool MarkerSmartPoint { get; set; }
Public Shared Property MarkerSmartPoint As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace