RhinoCommon API
NurbsCurveFitParameters.CurvatureBiasIntensity Property
 Curvature bias is used to make the fit curve stay close to regions of relatively high curvature. Use CurvatureBiasCoefficient() to convert this enum to the the value passed to the optimizer.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public NurbsCurveFitParameters.Intensity CurvatureBiasIntensity { get; set; }
Public Property CurvatureBiasIntensity As NurbsCurveFitParameters.Intensity
	Get
	Set
Property Value
Type: NurbsCurveFitParameters.Intensity
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace