RhinoCommon API
RhinoAccoountsProgressInfo.Description Property
 A localized description of the state that may be shown to the user of the application.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
See Also
Reference
RhinoAccoountsProgressInfo Class
Rhino.Runtime.RhinoAccounts Namespace