RhinoCommon API
Transform2d.Nan Property
 Gets a transform matrix in which every value is not-a-number. The static constructors return this when they are given invalid input.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d Nan { get; }
Public Shared ReadOnly Property Nan As Transform2d
	Get
Property Value
Type: Transform2d
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace