RhinoCommon API
UserInterfaceGrid.CornerRadius Property
[Missing <summary> documentation for "P:Rhino.UI.UserInterfaceGrid.CornerRadius"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double CornerRadius { get; set; }
Public Property CornerRadius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace