RhinoCommon API
AppearanceSettingsState.GridYAxisLineColor Property
Gets or sets the color of Y axis line in the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color GridYAxisLineColor { get; set; }
Public Property GridYAxisLineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace