RhinoCommon API
AppearanceSettings.GridZAxisLineColor Property
 Gets or sets the color of the Z axis of the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color GridZAxisLineColor { get; set; }
Public Shared Property GridZAxisLineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace