RhinoCommon API
RhinoDoc.RenderContentTableEventArgs.EventType Property
 Event type
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public RhinoDoc.RenderContentTableEventType EventType { get; }
Public ReadOnly Property EventType As RhinoDoc.RenderContentTableEventType
	Get
Property Value
Type: RhinoDoc.RenderContentTableEventType
See Also
Reference
RhinoDoc.RenderContentTableEventArgs Class
Rhino Namespace