RhinoCommon API
AppearanceSettings.DirectionArrowIconShaftSize Property
 length of direction arrow shaft icon in pixels.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static int DirectionArrowIconShaftSize { get; set; }
Public Shared Property DirectionArrowIconShaftSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace