RhinoCommon API
StringParserSettings.ParseFullStopAsDecimalPoint Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseFullStopAsDecimalPoint"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseFullStopAsDecimalPoint { get; set; }
Public Property ParseFullStopAsDecimalPoint As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace