RhinoCommon API
PlugIn.LocalPlugInName Property
 Optionally override this to provide a localized plug-in name
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual string LocalPlugInName { get; }
Protected Overridable ReadOnly Property LocalPlugInName As String
	Get
Property Value
Type: String
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace