RhinoCommon API
Material.ReflectionGlossiness Property
 Gets or sets the reflection glossiness.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ReflectionGlossiness { get; set; }
Public Property ReflectionGlossiness As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Material Class
Rhino.DocObjects Namespace