RhinoCommon API
File3dmShutLining.AutoUpdate Property
 Specifies whether the shut-lining automatically updates or not.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool AutoUpdate { get; set; }
Public Property AutoUpdate As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace