RhinoCommon API
RhinoApp.Rhino3Id Property
Gets the ID of Rhino 3.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid Rhino3Id { get; }
Public Shared ReadOnly Property Rhino3Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoApp Class
Rhino Namespace