RhinoCommon API
BrepLoop.Trims Property
 List of trims for this loop
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public BrepTrimList Trims { get; }
Public ReadOnly Property Trims As BrepTrimList
	Get
Property Value
Type: BrepTrimList
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace