RhinoCommon API
EmapAnalysisSettingsState.ShowIsoparams Property
 Gets or sets whether to display iso curves.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ShowIsoparams { get; set; }
Public Property ShowIsoparams As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
EmapAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace