RhinoCommon API
ViewCaptureSettings.DrawAxis Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawAxis"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DrawAxis { get; set; }
Public Property DrawAxis As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace