RhinoCommon API
File3dmRenderContent.TypeId Property
The unique id of the content type.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid TypeId { get; }
Public ReadOnly Property TypeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace