RhinoCommon API
Decal.EndLongitude Property
 Gets the end angle of the decal's arc of longitude or 'vertical sweep'. This is actually a LATITUDINAL angle. Only used when mapping is spherical.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public double EndLongitude { get; }
Public ReadOnly Property EndLongitude As Double
	Get
Property Value
Type: Double
See Also
Reference
Decal Class
Rhino.Render Namespace