RhinoCommon API
FileVdaWriteOptions.ReceivingDepartment Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVdaWriteOptions.ReceivingDepartment"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string ReceivingDepartment { get; set; }
Public Property ReceivingDepartment As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileVdaWriteOptions Class
Rhino.FileIO Namespace