RhinoCommon API
DisplayPipelineAttributes.SurfaceEdgeThicknessScale Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeThicknessScale"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public float SurfaceEdgeThicknessScale { get; set; }
Public Property SurfaceEdgeThicknessScale As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace