RhinoCommon API
IOpenIDConnectToken.AuthTime Property
 Time when the End-User authentication occurred
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
DateTime? AuthTime { get; }
ReadOnly Property AuthTime As DateTime?
	Get
Property Value
Type: Nullable<DateTime>
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace