RhinoCommon API
PhysicallyBased.Clearcoat Property
[Missing <summary> documentation for "P:Rhino.Render.ChildSlotNames.PhysicallyBased.Clearcoat"]
 Namespace: Rhino.Render.ChildSlotNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Clearcoat { get; }
Public Shared ReadOnly Property Clearcoat As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ChildSlotNames Namespace