RhinoCommon API
EndAnalysisSettings.OpenEnds Property
 Gets or sets whether to display the open curve end points.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool OpenEnds { get; set; }
Public Shared Property OpenEnds As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
EndAnalysisSettings Class
Rhino.ApplicationSettings Namespace