RhinoCommon API
RhinoDoc.NamedLayerStates Property
 Collection of named layer states.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public NamedLayerStateTable NamedLayerStates { get; }
Public ReadOnly Property NamedLayerStates As NamedLayerStateTable
	Get
Property Value
Type: NamedLayerStateTable
See Also
Reference
RhinoDoc Class
Rhino Namespace