RhinoCommon API
Quaternion.Vector Property
 The imaginary part of the quaternion
(B,C,D)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d Vector { get; }
Public ReadOnly Property Vector As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace