RhinoCommon API
NurbsCurveFitParameters.Closed Property
 Number of total control points if the NURBS curve will be periodic. This number is >= PointCount() and includes periodic duplicates.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Closed { get; set; }
Public Property Closed As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace