RhinoCommon API
CustomUndoEventArgs.CommandId Property
[Missing <summary> documentation for "P:Rhino.Commands.CustomUndoEventArgs.CommandId"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid CommandId { get; }
Public ReadOnly Property CommandId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace