RhinoCommon API
FileFbxReadOptions.UnweldAngle Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileFbxReadOptions.UnweldAngle"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double UnweldAngle { get; set; }
Public Property UnweldAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileFbxReadOptions Class
Rhino.FileIO Namespace