RhinoCommon API
NurbsCurveFitParameters.MinimumClosedPointCount Property
 The minimum closed point count
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int MinimumClosedPointCount { get; }
Public Shared ReadOnly Property MinimumClosedPointCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace