RhinoCommon API
RhinoViewport.CameraX Property
Gets the "unit to the right" vector.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d CameraX { get; }
Public ReadOnly Property CameraX As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace