RhinoCommon API
AppearanceSettings.SelectionWindowCrossingFillColor Property
 Color used to fill selection crossing window
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Color SelectionWindowCrossingFillColor { get; set; }
Public Shared Property SelectionWindowCrossingFillColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace