RhinoCommon API
LayerTableEventArgs.OldState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LayerTableEventArgs.OldState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Layer OldState { get; }
Public ReadOnly Property OldState As Layer
	Get
Property Value
Type: Layer
See Also
Reference
LayerTableEventArgs Class
Rhino.DocObjects.Tables Namespace