RhinoCommon API
Sun.North Property
 Angle in degrees on world X-Y plane that should be considered north in the model. The angle is measured starting at the x-axis and increases anti-clockwise. The y-axis corresponds to a 'north' angle of 90 degrees.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double North { get; set; }
Public Property North As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Sun Class
Rhino.Render Namespace