RhinoCommon API
StringParserSettings.ParseMathFunctions Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseMathFunctions"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseMathFunctions { get; set; }
Public Property ParseMathFunctions As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace