RhinoCommon API
CustomUndoEventArgs.Tag Property
[Missing <summary> documentation for "P:Rhino.Commands.CustomUndoEventArgs.Tag"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Object Tag { get; }
Public ReadOnly Property Tag As Object
	Get
Property Value
Type: Object
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace