RhinoCommon API
IZooClientUtilities.UserIsLoggedIn Property
 Returns true if the user is logged in; else returns false. A logged in user does not guarantee that the auth tokens managed by the CloudZooManager instance are valid.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool UserIsLoggedIn { get; }
ReadOnly Property UserIsLoggedIn As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace