RhinoCommon API
EarthAnchorPoint.EarthBasepointElevationCoordinateSystem Property
 Gets or sets a value indicating the zero level convention relating to a location on Earth.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public EarthCoordinateSystem EarthBasepointElevationCoordinateSystem { get; set; }
Public Property EarthBasepointElevationCoordinateSystem As EarthCoordinateSystem
	Get
	Set
Property Value
Type: EarthCoordinateSystem
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace