RhinoCommon API
Vector2d.IsValid Property
 Gets a value indicating whether this vector is valid. A valid vector must be formed of valid component values for x, y and z.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace