RhinoCommon API
Cylinder.BasePlane Property
 Gets or sets the base plane of the cylinder.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Plane BasePlane { get; set; }
Public Property BasePlane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace