RhinoCommon API
FilePlyWriteOptions.ExportColors Property
 Determines whether to export vertex colors.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool ExportColors { get; set; }
Public Property ExportColors As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace