RhinoCommon API
Brep.FilletSurfaceSettings.AngleTolerance Property
 Angle tolerance to decide when faces are tangent-continuous
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double AngleTolerance { get; }
Public ReadOnly Property AngleTolerance As Double
	Get
Property Value
Type: Double
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace