RhinoCommon API
ColorRGBA.Green Property
[Missing <summary> documentation for "P:Rhino.Display.ColorRGBA.Green"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static ColorRGBA Green { get; }
Public Shared ReadOnly Property Green As ColorRGBA
	Get
Property Value
Type: ColorRGBA
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace