RhinoCommon API
LicenseStatus.LicenseType Property
The license contentType. (e.g. Standalone, Network, etc.)
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public LicenseType LicenseType { get; set; }
Public Property LicenseType As LicenseType
	Get
	Set
Property Value
Type: LicenseType
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace