RhinoCommon API
ArchivableDictionary.Version Property
 Gets or sets the version of this ArchivableDictionary.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Version { get; set; }
Public Property Version As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace