RhinoCommon API
PageViewGroupTableEventArgs.PageViewGroupIndex Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.PageViewGroupTableEventArgs.PageViewGroupIndex"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PageViewGroupIndex { get; }
Public ReadOnly Property PageViewGroupIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PageViewGroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace