RhinoCommon API
LightArray.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.LightArray.CppPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
LightArray Class
Rhino.Render Namespace