RhinoCommon API
FileObjWriteOptions.MeshType Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileObjWriteOptions.MeshType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public FileObjWriteOptions.VertexWelding MeshType { get; set; }
Public Property MeshType As FileObjWriteOptions.VertexWelding
	Get
	Set
Property Value
Type: FileObjWriteOptions.VertexWelding
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace