RhinoCommon API
FileGltfWriteOptions.SubDSurfaceMeshingDensity Property
 Determines how coarse the mesh output will be when surface meshing subd objects See comments for ON_SubDDisplayParameters in opennurbs_mesh.h for details regarding numbers used.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public int SubDSurfaceMeshingDensity { get; set; }
Public Property SubDSurfaceMeshingDensity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace