RhinoCommon API
RhinoDoc.RenderMaterialAssignmentChangedEventArgs.NewRenderMaterial Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.NewRenderMaterial"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public Guid NewRenderMaterial { get; }
Public ReadOnly Property NewRenderMaterial As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoDoc.RenderMaterialAssignmentChangedEventArgs Class
Rhino Namespace