RhinoCommon API
FileCsvWriteOptions.CumulativeMassProperties Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.CumulativeMassProperties"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool CumulativeMassProperties { get; set; }
Public Property CumulativeMassProperties As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace