RhinoCommon API
DisplayPen.PatternLengthInWorldUnits Property
 If true, lengths in pattern definition are interpreted to be in world units. If false, screen pixel distances are used.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool PatternLengthInWorldUnits { get; set; }
Public Property PatternLengthInWorldUnits As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPen Class
Rhino.Display Namespace