RhinoCommon API
EarthAnchorPoint.KMLOrientationTiltAngleDegrees Property
 Gets Keyhole Markup Language (KML) orientation tilt angle in degrees.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public double KMLOrientationTiltAngleDegrees { get; }
Public ReadOnly Property KMLOrientationTiltAngleDegrees As Double
	Get
Property Value
Type: Double
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace