RhinoCommon API
Extrusion.PathTangent Property
 Gets the up vector of the path.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d PathTangent { get; }
Public ReadOnly Property PathTangent As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace