RhinoCommon API
CommonComponentTable<T>.ComponentType Property
 Returns the actual component type of a table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract ModelComponentType ComponentType { get; }
Public MustOverride ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
See Also
Reference
CommonComponentTable<T> Class
Rhino.FileIO Namespace