RhinoCommon API
ComponentFunctionInfo.IsDefault Property
 Determines if the component is a default one.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsDefault { get; }
Public ReadOnly Property IsDefault As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace