RhinoCommon API
ModelAidSettings.ShiftNudgeKeyStep Property
Gets or sets the Shift-key based nudge step amount.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static double ShiftNudgeKeyStep { get; set; }
Public Shared Property ShiftNudgeKeyStep As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace