RhinoCommon API
LinearDimension.Aligned Property
 Gets or sets a value indicating whether this annotation is aligned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Aligned { get; set; }
Public Property Aligned As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace