RhinoCommon API
RhinoApp.InstallationType Property
Gets the product installation type, as seen in Rhino's ABOUT dialog box.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Installation InstallationType { get; }
Public Shared ReadOnly Property InstallationType As Installation
	Get
Property Value
Type: Installation
See Also
Reference
RhinoApp Class
Rhino Namespace