RhinoCommon API
RhinoApp.ExeVersion Property
 Major version of Rhino executable 4, 5, ...
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int ExeVersion { get; }
Public Shared ReadOnly Property ExeVersion As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoApp Class
Rhino Namespace