RhinoCommon API
Triangle3d.AngleB Property
 Gets the angle at the B corner.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public double AngleB { get; }
Public ReadOnly Property AngleB As Double
	Get
Property Value
Type: Double
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace