RhinoCommon API
Vector2d.X Property
 Gets or sets the X (first) component of this vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace