RhinoCommon API
AnimationProperties.Images Property
 Gets or sets the full path to the saved frames of an animation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public string[] Images { get; set; }
Public Property Images As String()
	Get
	Set
Property Value
Type: String[]
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace