RhinoCommon API
File3dmNotes.Notes Property
 Gets or sets the text content of the notes.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Notes { get; set; }
Public Property Notes As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace