RhinoCommon API
PrintedPageDefinition.Units Property
 Unit system for the width and height of the page
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UnitSystem Units { get; set; }
Public Property Units As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
PrintedPageDefinition Class
Rhino Namespace