RhinoCommon API
RenderContent.DocumentOwner Property
 If this render content is owned by a document, the document will be returned. This is the same as getting the document the render content is attached to. Otherwise returns null.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.13
Syntax
public RhinoDoc DocumentOwner { get; }
Public ReadOnly Property DocumentOwner As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RenderContent Class
Rhino.Render Namespace