RhinoCommon API
SoftTransformSettings.ShowConstraintWidgets Property
 Enables or disables constraint widgets on the edges of surfaces when points are on.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool ShowConstraintWidgets { get; set; }
Public Shared Property ShowConstraintWidgets As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SoftTransformSettings Class
Rhino.ApplicationSettings Namespace