RhinoCommon API
ModelComponent.NamePathSeparator Property
 Returns the string "::". This is the string Rhino uses in layer full path names to separate the names of individual layers.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string NamePathSeparator { get; }
Public Shared ReadOnly Property NamePathSeparator As String
	Get
Property Value
Type: String
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace