RhinoCommon API
DisplayPipelineAttributes.SurfaceIsoThicknessUsed Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThicknessUsed"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public bool SurfaceIsoThicknessUsed { get; set; }
Public Property SurfaceIsoThicknessUsed As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace