RhinoCommon API
File3dmSettings.PageAngleToleranceRadians Property
Gets or sets the page space angle tolerance.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double PageAngleToleranceRadians { get; set; }
Public Property PageAngleToleranceRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace