RhinoCommon API
Skylight.CustomEnvironmentOn Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Render.Skylight.CustomEnvironmentOn"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use RenderSettings methods")]
public bool CustomEnvironmentOn { get; set; }
<ObsoleteAttribute("Use RenderSettings methods")>
Public Property CustomEnvironmentOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Skylight Class
Rhino.Render Namespace