RhinoCommon API
BitmapEntry.IsReference Property
 Gets a value indicting whether this bitmap is a referenced bitmap. Referenced bitmaps are part of referenced documents.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public override bool IsReference { get; }
Public Overrides ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BitmapEntry Class
Rhino.DocObjects Namespace