RhinoCommon API
HatchPattern.HatchLineCount Property
 Get the number of HatchLines in the pattern.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int HatchLineCount { get; }
Public ReadOnly Property HatchLineCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace