RhinoCommon API
DetailViewObject.PageToWorldTransform Property
 Returns the page coordinate to world coordinate transformation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Transform PageToWorldTransform { get; }
Public ReadOnly Property PageToWorldTransform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace