RhinoCommon API
GumballAppearanceSettings.MenuSize Property
Radius of menu circle.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int MenuSize { get; set; }
Public Property MenuSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace