RhinoCommon API
PostEffectUuids.BriCon Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.BriCon"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid BriCon { get; }
Public Shared ReadOnly Property BriCon As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace