RhinoCommon API
ModelAidSettings.GridSnap Property
Gets or sets the enabled state of Rhino's grid snap modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool GridSnap { get; set; }
Public Shared Property GridSnap As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace