RhinoCommon API
SubDComponentParameter.IsSet Property
 Gets true if this parameter identifies a point on a SubD.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsSet { get; }
Public ReadOnly Property IsSet As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace