RhinoCommon API
DisplayPipelineAttributes.SubDCreaseInteriorThicknessScale Property
 Edge thickness scale
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public float SubDCreaseInteriorThicknessScale { get; set; }
Public Property SubDCreaseInteriorThicknessScale As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace