RhinoCommon API
FileDwgReadOptions.SetLayerMaterialToLayerColor Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgReadOptions.SetLayerMaterialToLayerColor"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SetLayerMaterialToLayerColor { get; set; }
Public Property SetLayerMaterialToLayerColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgReadOptions Class
Rhino.FileIO Namespace