RhinoCommon API
ComponentIndex.IsSet Property
 True if is set to a value between and .
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.26
Syntax
public bool IsSet { get; }
Public ReadOnly Property IsSet As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ComponentIndex Structure
Rhino.Geometry Namespace
ComponentIndex.ComponentIndexType
ComponentIndexType.BrepVertex
ComponentIndexType.DimLeaderPoint