RhinoCommon API
MeshTopologyVertexList.Count Property
 Gets or sets the number of mesh topology vertices.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
ICollection.Count
IReadOnlyCollection<T>.Count
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace