RhinoCommon API
EarthAnchorPoint.KMLOrientationRollAngleDegrees Property
 Gets Keyhole Markup Language (KML) orientation roll angle in degrees.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public double KMLOrientationRollAngleDegrees { get; }
Public ReadOnly Property KMLOrientationRollAngleDegrees As Double
	Get
Property Value
Type: Double
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace