RhinoCommon API
GetTorus.SecondSize Property
 Second radius or diameter (based on InSecondDiameterMode)
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double SecondSize { get; set; }
Public Property SecondSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GetTorus Class
Rhino.Input.Custom Namespace