RhinoCommon API
CustomPostEffectAttribute.ExecuteWhileRenderingDelay Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.CustomPostEffectAttribute.ExecuteWhileRenderingDelay"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int ExecuteWhileRenderingDelay { get; set; }
Public Property ExecuteWhileRenderingDelay As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
CustomPostEffectAttribute Class
Rhino.Render.PostEffects Namespace