RhinoCommon API
ViewSettings.ViewRotation Property
 Gets or sets the view rotation value.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.1
Syntax
public static ViewSettings.ViewRotationStyle ViewRotation { get; set; }
Public Shared Property ViewRotation As ViewSettings.ViewRotationStyle
	Get
	Set
Property Value
Type: ViewSettings.ViewRotationStyle
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace