RhinoCommon API
SubDCreationOptions.InteriorCreases Property
 Create an interior sub-D crease along all input mesh double edges
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static SubDCreationOptions InteriorCreases { get; }
Public Shared ReadOnly Property InteriorCreases As SubDCreationOptions
	Get
Property Value
Type: SubDCreationOptions
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace