RhinoCommon API
ViewportInfo.FrustumLeftPlane Property
 Gets the frustum left plane that separates visible from off-screen.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Plane FrustumLeftPlane { get; }
Public ReadOnly Property FrustumLeftPlane As Plane
	Get
Property Value
Type: Plane
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace