RhinoCommon API
ICollapsibleSection.PlugInId Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.PlugInId"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
Guid PlugInId { get; }
ReadOnly Property PlugInId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace