RhinoCommon API
HostUtils.RunningInNetCore Property
 Tests if this process is currently executing under the .NET Core runtime.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool RunningInNetCore { get; }
Public Shared ReadOnly Property RunningInNetCore As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace