RhinoCommon API
RhinoDoc.NamedPositions Property
 Collection of named positions.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public NamedPositionTable NamedPositions { get; }
Public ReadOnly Property NamedPositions As NamedPositionTable
	Get
Property Value
Type: NamedPositionTable
See Also
Reference
RhinoDoc Class
Rhino Namespace