RhinoCommon API
File3dmRenderContent.Hidden Property
True if the content is hidden.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Hidden { get; }
Public ReadOnly Property Hidden As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace