RhinoCommon API
RhinoDoc.ActiveSpace Property
 Get the space associated with the active viewport for this document
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public ActiveSpace ActiveSpace { get; }
Public ReadOnly Property ActiveSpace As ActiveSpace
	Get
Property Value
Type: ActiveSpace
See Also
Reference
RhinoDoc Class
Rhino Namespace