RhinoCommon API
HermiteSurface.IsValid Property
 Returns true if the all of values in all of the internal data structures contain valid values, false otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace