RhinoCommon API
ChooseOneObjectSettings.ShowAllOption Property
ShowAllOption
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool ShowAllOption { get; set; }
Public Shared Property ShowAllOption As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace