RhinoCommon API
Light.AttenuationType Property
 Get the type of attenuation for this light.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Light.Attenuation AttenuationType { get; set; }
Public Property AttenuationType As Light.Attenuation
	Get
	Set
Property Value
Type: Light.Attenuation
See Also
Reference
Light Class
Rhino.Geometry Namespace