RhinoCommon API
File3dm.CreatedBy Property
 Gets a string that names the user who created the file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string CreatedBy { get; }
Public ReadOnly Property CreatedBy As String
	Get
Property Value
Type: String
See Also
Reference
File3dm Class
Rhino.FileIO Namespace