RhinoCommon API
ViewCaptureSettings.VerticalScale Property
 Vertical stretch to be applied to output. Useful for calibrating printers
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public double VerticalScale { get; set; }
Public Property VerticalScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace