RhinoCommon API
FileIgsWriteOptions.PolySurfaceType Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.PolySurfaceType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileIgsWriteOptions.PolySurfacesMode PolySurfaceType { get; set; }
Public Property PolySurfaceType As FileIgsWriteOptions.PolySurfacesMode
	Get
	Set
Property Value
Type: FileIgsWriteOptions.PolySurfacesMode
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace