RhinoCommon API
DisplayPipelineAttributes.UseAssignedObjectMaterial Property
 Gets or sets whether objects ought to be drawn using their assigned rendering material.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool UseAssignedObjectMaterial { get; set; }
Public Property UseAssignedObjectMaterial As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace