RhinoCommon API
UserInterfaceTextBox.ReadOnly Property
 A read only text box can take focus and be scrolled through, but typing does not change it. False by default.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ReadOnly { get; set; }
Public Property ReadOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace