RhinoCommon API
LengthUnit.DisplaySymbol Property
 Lower case singular localized unit symbol.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string DisplaySymbol { get; }
Public ReadOnly Property DisplaySymbol As String
	Get
Property Value
Type: String
See Also
Reference
LengthUnit Structure
Rhino Namespace