RhinoCommon API
DisplayPipelineAttributes.ClippingShadeSelectedPlane Property
 Shades the selected clipping plane.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ClippingShadeSelectedPlane { get; set; }
Public Property ClippingShadeSelectedPlane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace