RhinoCommon API
LengthValue.UnitSystem Property
 UnitSystem used by this LengthValue
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public UnitSystem UnitSystem { get; }
Public ReadOnly Property UnitSystem As UnitSystem
	Get
Property Value
Type: UnitSystem
See Also
Reference
LengthValue Class
Rhino Namespace