RhinoCommon API
MeshExtruder.SurfaceParameterMode Property
 Mode for creating surface parameters for extruded areas
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public MeshExtruderParameterMode SurfaceParameterMode { get; set; }
Public Property SurfaceParameterMode As MeshExtruderParameterMode
	Get
	Set
Property Value
Type: MeshExtruderParameterMode
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace