RhinoCommon API
MeshFace.C Property
 Gets or sets the third corner index of the mesh face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int C { get; set; }
Public Property C As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace