RhinoCommon API
PageViewGroupTable.ComponentType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.PageViewGroupTable.ComponentType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
See Also
Reference
PageViewGroupTable Class
Rhino.DocObjects.Tables Namespace