RhinoCommon API
MeshCurveIntersection.Incidence Property
The kind of mesh feature this hit lies on: face, edge, or vertex.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public MeshIncidence Incidence { get; }
Public ReadOnly Property Incidence As MeshIncidence
	Get
Property Value
Type: MeshIncidence
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace