RhinoCommon API
ContentUuids.CompositeMaterialCCI Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.CompositeMaterialCCI"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid CompositeMaterialCCI { get; }
Public Shared ReadOnly Property CompositeMaterialCCI As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace