RhinoCommon API
TextEntity.TextOrientation Property
[Missing <summary> documentation for "P:Rhino.Geometry.TextEntity.TextOrientation"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextOrientation TextOrientation { get; set; }
Public Property TextOrientation As TextOrientation
	Get
	Set
Property Value
Type: TextOrientation
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace