RhinoCommon API
UserInterfaceGrid.BorderThickness Property
[Missing <summary> documentation for "P:Rhino.UI.UserInterfaceGrid.BorderThickness"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double BorderThickness { get; set; }
Public Property BorderThickness As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace