RhinoCommon API
File3dmDisplacement.SweepResolutionFormula Property
 Specifies which formula is used to calculate sweep resolution from initial quality.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmDisplacement.SweepResolutionFormulas SweepResolutionFormula { get; set; }
Public Property SweepResolutionFormula As File3dmDisplacement.SweepResolutionFormulas
	Get
	Set
Property Value
Type: File3dmDisplacement.SweepResolutionFormulas
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace