RhinoCommon API
Linetype.PatternLength Property
Total length of one repeat of the pattern.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double PatternLength { get; }
Public ReadOnly Property PatternLength As Double
	Get
Property Value
Type: Double
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace