RhinoCommon API
MeshTopologyEdgeList.Count Property
 Gets the amount of edges in this list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace