RhinoCommon API
IOpenIDConnectToken.Picture Property
 The url of a picture/avatar/icon of the user this token represents.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
string Picture { get; }
ReadOnly Property Picture As String
	Get
Property Value
Type: String
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace