RhinoCommon API
PageViewGroupTableEventArgs.EventType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.PageViewGroupTableEventArgs.EventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PageViewGroupTableEventType EventType { get; }
Public ReadOnly Property EventType As PageViewGroupTableEventType
	Get
Property Value
Type: PageViewGroupTableEventType
See Also
Reference
PageViewGroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace