RhinoCommon API
ModelComponent.ComponentStatus Property
 Gets or sets the component status of the model component.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual ComponentStatus ComponentStatus { get; set; }
Public Overridable Property ComponentStatus As ComponentStatus
	Get
	Set
Property Value
Type: ComponentStatus
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace