RhinoCommon API
SerializationOptions.WriteUserData Property
 Gets or sets a value indicating whether to write user data.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool WriteUserData { get; set; }
Public Property WriteUserData As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace