RhinoCommon API
RayShootEvent.BrepFaceIndex Property
 If GeometryIndex references a Brep, then the index of the Brep face that was hit. If GeometryIndex references a surface, than RhinoMath.UnsetIntIndex.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int BrepFaceIndex { get; set; }
Public Property BrepFaceIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RayShootEvent Structure
Rhino.Geometry.Intersect Namespace