RhinoCommon API
DisplayPipelineAttributes.SurfaceNakedEdgeColorReductionPercent Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeColorReductionPercent"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SurfaceNakedEdgeColorReductionPercent { get; set; }
Public Property SurfaceNakedEdgeColorReductionPercent As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace