RhinoCommon API
FileDwgWriteOptions.ExportPolycurvesAs Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgWriteOptions.ExportPolycurvesAs"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileDwgWriteOptions.ExportPolycurveMode ExportPolycurvesAs { get; set; }
Public Property ExportPolycurvesAs As FileDwgWriteOptions.ExportPolycurveMode
	Get
	Set
Property Value
Type: FileDwgWriteOptions.ExportPolycurveMode
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace