RhinoCommon API
ChooseOneObjectSettings.DynamicHighlight Property
DynamicHighlight
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool DynamicHighlight { get; set; }
Public Shared Property DynamicHighlight As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace