RhinoCommon API
RhinoReplaceObjectEventArgs.Document Property
 The document where the event occurred.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoReplaceObjectEventArgs Class
Rhino.DocObjects Namespace