RhinoCommon API
ContentUuids.PhysicallyBasedMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.PhysicallyBasedMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Guid PhysicallyBasedMaterialType { get; }
Public Shared ReadOnly Property PhysicallyBasedMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace