RhinoCommon API
BrepFace.OuterLoop Property
 Every face has a single outer loop.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BrepLoop OuterLoop { get; }
Public ReadOnly Property OuterLoop As BrepLoop
	Get
Property Value
Type: BrepLoop
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace