RhinoCommon API
ExtrusionObject.ExtrusionGeometry Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ExtrusionObject.ExtrusionGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Extrusion ExtrusionGeometry { get; }
Public ReadOnly Property ExtrusionGeometry As Extrusion
	Get
Property Value
Type: Extrusion
See Also
Reference
ExtrusionObject Class
Rhino.DocObjects Namespace