RhinoCommon API
PageViewGroup.IsExpanded Property
 Gets or sets the expanded state of the page view group.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsExpanded { get; set; }
Public Property IsExpanded As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PageViewGroup Class
Rhino.DocObjects Namespace