RhinoCommon API
DisplayPointAttributes.StrokeColor Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPointAttributes.StrokeColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Color? StrokeColor { get; set; }
Public Property StrokeColor As Color?
	Get
	Set
Property Value
Type: Nullable<Color>
See Also
Reference
DisplayPointAttributes Class
Rhino.Display Namespace