RhinoCommon API
AppearanceSettings.HelpLanguageIdentifier Property
 Gets or sets the language identifier used by the Help system (the Help panel, F1 context help and the online help web site). This is independent of LanguageIdentifier, which is the language used by the user interface. A value of zero, the default, means the Help follows the user interface language. See EffectiveHelpLanguageIdentifier for the identifier the Help system actually uses.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int HelpLanguageIdentifier { get; set; }
Public Shared Property HelpLanguageIdentifier As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace