RhinoCommon API
ReduceMeshParameters.FaceTags Property
[Missing <summary> documentation for "P:Rhino.Geometry.ReduceMeshParameters.FaceTags"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int[] FaceTags { get; set; }
Public Property FaceTags As Integer()
	Get
	Set
Property Value
Type: Int32[]
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace