RhinoCommon API
Light.Name Property
 Gets or sets the light name.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Light Class
Rhino.Geometry Namespace