RhinoCommon API
FileNwdWriteOptions.Version Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileNwdWriteOptions.Version"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public NavisWorksVersion Version { get; set; }
Public Property Version As NavisWorksVersion
	Get
	Set
Property Value
Type: NavisWorksVersion
See Also
Reference
FileNwdWriteOptions Class
Rhino.FileIO Namespace