RhinoCommon API
SubDToBrepOptions.DefaultUnpacked Property
 Default ON_SubDToBrepParameters settings for creating an unpacked brep. Locally-G1 smoothing of extraordinary vertices, unpacked faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static SubDToBrepOptions DefaultUnpacked { get; }
Public Shared ReadOnly Property DefaultUnpacked As SubDToBrepOptions
	Get
Property Value
Type: SubDToBrepOptions
See Also
Reference
SubDToBrepOptions Class
Rhino.Geometry Namespace