RhinoCommon API
UndoRedoEventArgs.IsPurgeRecord Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsPurgeRecord"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsPurgeRecord { get; }
Public ReadOnly Property IsPurgeRecord As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace