RhinoCommon API
PostEffectUuids.ToneMapper_BlackWhitePoint Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.ToneMapper_BlackWhitePoint"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid ToneMapper_BlackWhitePoint { get; }
Public Shared ReadOnly Property ToneMapper_BlackWhitePoint As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace