RhinoCommon API
Font.FamilyName Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.FamilyName"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public string FamilyName { get; }
Public ReadOnly Property FamilyName As String
	Get
Property Value
Type: String
See Also
Reference
Font Class
Rhino.DocObjects Namespace