RhinoCommon API
HistoryRecord.Handle Property
 Wrapped native C++ pointer to CRhinoHistory instance
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public IntPtr Handle { get; }
Public ReadOnly Property Handle As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace