RhinoCommon API
UserInterfaceGrid.BackgroundOpacity Property
 How opaque the background is, from 0 (not drawn at all) to 1 (solid, the default). Leave BackgroundColor as Color.Empty and the grid uses the theme's panel color at this opacity, which gives a see through panel over the model that still follows the theme. A BackgroundColor that was set is drawn at this opacity on top of its own alpha. The border is not affected.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double BackgroundOpacity { get; set; }
Public Property BackgroundOpacity As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace