RhinoCommon API
RenderContent.IsHiddenByAutoDelete Property
 Contents can be created as 'auto-delete' by certain commands such as 'Picture'. These contents are automatically hidden from the user when the associated Rhino object is deleted. They are later deleted when the document is saved.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public bool IsHiddenByAutoDelete { get; }
Public ReadOnly Property IsHiddenByAutoDelete As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderContent Class
Rhino.Render Namespace