RhinoCommon API
PhysicallyBasedMaterial.Sheen Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.Sheen"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double Sheen { get; set; }
Public Property Sheen As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace