RhinoCommon API
ViewInfo.FocalBlurJitter Property
 Gets or sets the Focal blur jitter of the active viewport
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double FocalBlurJitter { get; set; }
Public Property FocalBlurJitter As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace