RhinoCommon API
SimulatedTexture.ProjectionMode Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.ProjectionMode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public SimulatedTexture.ProjectionModes ProjectionMode { get; set; }
Public Property ProjectionMode As SimulatedTexture.ProjectionModes
	Get
	Set
Property Value
Type: SimulatedTexture.ProjectionModes
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace