RhinoCommon API
ModelAidSettingsState.MousePickboxRadius Property
Gets or sets the radius of the mouse pick box in pixels.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int MousePickboxRadius { get; set; }
Public Property MousePickboxRadius As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace