RhinoCommon API
Triangle3d.AltitudeA Property
 Gets the altitude line starting at corner A.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Line AltitudeA { get; }
Public ReadOnly Property AltitudeA As Line
	Get
Property Value
Type: Line
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace