RhinoCommon API
SubDEdgeChain.EdgeCount Property
 The number of edges in this chain.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public uint EdgeCount { get; }
Public ReadOnly Property EdgeCount As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace