RhinoCommon API
AppearanceSettingsState.CurrentLayerBackgroundColor Property
 Gets or sets the color used by the layer manager dialog as the background color for the current layer.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color CurrentLayerBackgroundColor { get; set; }
Public Property CurrentLayerBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace