RhinoCommon API
Sphere.Unset Property
 Gets a sphere with invalid members.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Sphere Unset { get; }
Public Shared ReadOnly Property Unset As Sphere
	Get
Property Value
Type: Sphere
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace