RhinoCommon API
DracoCompression.NormalAttributePosition Property
 The attribute position for normals when compressed
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
public int NormalAttributePosition { get; }
Public ReadOnly Property NormalAttributePosition As Integer
	Get
Property Value
Type: Int32
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace