RhinoCommon API
Cone.Plane Property
 Gets or sets the base plane of the cone. The apex of the cone is at the plane's origin.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Cone Structure
Rhino.Geometry Namespace