RhinoCommon API
RhinoDoc.RuntimeData Property
 Collection of document runtime data. This is a good place to put non-serializable, per document data, such as panel view models. Note well: This data will be dispose with the document and does not get serialized.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public RuntimeDocumentDataTable RuntimeData { get; }
Public ReadOnly Property RuntimeData As RuntimeDocumentDataTable
	Get
Property Value
Type: RuntimeDocumentDataTable
The runtime document data table.
See Also
Reference
RhinoDoc Class
Rhino Namespace