RhinoCommon API
RebuildCurveOptions.RhinoDocumentSerialNumber Property
 Serial number of the Rhino document containing the target curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int RhinoDocumentSerialNumber { get; }
Public ReadOnly Property RhinoDocumentSerialNumber As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace