RhinoCommon API
ObjectPropertiesPage.EnglishPageTitle Property
 English string used to describe this page
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public abstract string EnglishPageTitle { get; }
Public MustOverride ReadOnly Property EnglishPageTitle As String
	Get
Property Value
Type: String
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace