RhinoCommon API
RenderContent.Private Property
 The Content type should not be shown in the UI if Private is true
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Private { get; }
Public ReadOnly Property Private As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderContent Class
Rhino.Render Namespace