RhinoCommon API
DisplayPipelineAttributes.SubDReflectionPlaneAxisLineOn Property
 Apply Turnh on or off the reflection plane axis line
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public bool SubDReflectionPlaneAxisLineOn { get; set; }
Public Property SubDReflectionPlaneAxisLineOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace