RhinoCommon API
LicenseLease.IssuedAt Property
 The date this lease was issued
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DateTime IssuedAt { get; }
Public ReadOnly Property IssuedAt As DateTime
	Get
Property Value
Type: DateTime
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace