RhinoCommon API
DimensionStyle.SuppressArrow1 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.SuppressArrow1"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SuppressArrow1 { get; set; }
Public Property SuppressArrow1 As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace