RhinoCommon API
GumballSettings.SnappyGumball Property
 If true, snaps to object snap locations. if false, ignores object snap locations.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool SnappyGumball { get; set; }
Public Shared Property SnappyGumball As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace