RhinoCommon API
CursorTooltipSettings.RelativePointPane Property
 Displays the relative construction plane coordinates and angle from the last picked point.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool RelativePointPane { get; set; }
Public Shared Property RelativePointPane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace