RhinoCommon API
DisplayPipelineAttributes.AmbientLightingColor Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.AmbientLightingColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public Color AmbientLightingColor { get; set; }
Public Property AmbientLightingColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace