RhinoCommon API
SectionStyleTableEventArgs.OldState Property
 The old or previous section style.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SectionStyle OldState { get; }
Public ReadOnly Property OldState As SectionStyle
	Get
Property Value
Type: SectionStyle
See Also
Reference
SectionStyleTableEventArgs Class
Rhino.DocObjects.Tables Namespace