RhinoCommon API
Texture.TextureCombineMode Property
 Determines how this texture is combined with others in a material's texture list.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public TextureCombineMode TextureCombineMode { get; set; }
Public Property TextureCombineMode As TextureCombineMode
	Get
	Set
Property Value
Type: TextureCombineMode
See Also
Reference
Texture Class
Rhino.DocObjects Namespace