RhinoCommon API
LicenseData.SerialNumber Property
 The "for display only" product license. This is provided by the plug-in that validated the license.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string SerialNumber { get; set; }
Public Property SerialNumber As String
	Get
	Set
Property Value
Type: String
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace