RhinoCommon API
ViewSettingsState.RotateViewAroundAutogumball Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ViewSettingsState.RotateViewAroundAutogumball"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool RotateViewAroundAutogumball { get; set; }
Public Property RotateViewAroundAutogumball As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace