RhinoCommon API
GumballFrame.Plane Property
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballFrame.Plane"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Plane Plane {
	get;
 set; }
Public Property Plane As Plane
		Get
	Set
Property Value
Type: Plane
See Also
Reference
GumballFrame Structure
Rhino.UI.Gumball Namespace