RhinoCommon API
RenderSettings.LinearWorkflow Property
 If this object is associated with a document, this gets the document linear workflow. If this object is associated with a File3dm, this gets the File3dm's linear workflow. Otherwise it gets a 'free-floating' linear workflow object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LinearWorkflow LinearWorkflow { get; }
Public ReadOnly Property LinearWorkflow As LinearWorkflow
	Get
Property Value
Type: LinearWorkflow
See Also
Reference
RenderSettings Class
Rhino.Render Namespace