RhinoCommon API
AppearanceSettingsState.CommandPromptTextColor Property
Gets or sets the command prompt text color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color CommandPromptTextColor { get; set; }
Public Property CommandPromptTextColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace