RhinoCommon API
GroundPlane.MaterialInstanceId Property
 Id of material in material table for this ground plane.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid MaterialInstanceId { get; set; }
Public Property MaterialInstanceId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
GroundPlane Class
Rhino.Render Namespace