RhinoCommon API
DisplayModeDescription.SupportsShadeCommand Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.SupportsShadeCommand"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SupportsShadeCommand { get; set; }
Public Property SupportsShadeCommand As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace