RhinoCommon API
Transform.IsRotation Property
 Returns true if this is a proper rotation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public bool IsRotation { get; }
Public ReadOnly Property IsRotation As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Transform Structure
Rhino.Geometry Namespace