RhinoCommon API
ArchivableDictionary.Values Property
Gets all values in this dictionary.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Object[] Values { get; }
Public ReadOnly Property Values As Object()
	Get
Property Value
Type: Object[]
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace