RhinoCommon API
Material.TransparentColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.TransparentColor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color TransparentColor { get; set; }
Public Property TransparentColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Material Class
Rhino.DocObjects Namespace