RhinoCommon API
AnnotationBase.MaskUsesViewportColor Property
 If true, the viewport's color is used for the mask color. If false, the color defined by MaskColor is used
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool MaskUsesViewportColor { get; set; }
Public Property MaskUsesViewportColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace