RhinoCommon API
MouseCursor.Location Property
 Retrieves the position of the mouse cursor, in screen coordinates
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public static Point2d Location { get; }
Public Shared ReadOnly Property Location As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
MouseCursor Class
Rhino.UI Namespace