RhinoCommon API
PreviewRenderedEventArgs.Bitmap Property
 The Bitmap of the rendered preview
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public Bitmap Bitmap { get; set; }
Public Property Bitmap As Bitmap
	Get
	Set
Property Value
Type: Bitmap
See Also
Reference
PreviewRenderedEventArgs Class
Rhino.Render Namespace