RhinoCommon API
Light.IsSpotLight Property
 Gets a value indicating whether the light style is LightStyle CameraSpot or WorldSpot.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsSpotLight { get; }
Public ReadOnly Property IsSpotLight As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Light Class
Rhino.Geometry Namespace