RhinoCommon API
InstanceDefinition.IsTenuous Property
 True if this instance definition is from a linked file. It will be saved only if it is referenced by an instance reference object that is in the active geometry list and is being saved. Note that there can be multiple linked instance definitions with references to tenuous instance definitions.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsTenuous { get; }
Public ReadOnly Property IsTenuous As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace