RhinoCommon API
RhinoDoc.Bitmaps Property
 bitmaps used in textures, backgrounds, wallpapers, ...
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BitmapTable Bitmaps { get; }
Public ReadOnly Property Bitmaps As BitmapTable
	Get
Property Value
Type: BitmapTable
See Also
Reference
RhinoDoc Class
Rhino Namespace