RhinoCommon API
DisplayPipelineAttributes.ShowSubDBoundary Property
 Set visibility of SubD naked edges.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public bool ShowSubDBoundary { get; set; }
Public Property ShowSubDBoundary As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace