RhinoCommon API
ContentUuids.PlasticMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.PlasticMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid PlasticMaterialType { get; }
Public Shared ReadOnly Property PlasticMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace