RhinoCommon API
ViewportInfo.ScreenPort Property
 Get or set the screen port. SetScreenPort(Rectangle) and
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Rectangle ScreenPort { get; set; }
Public Property ScreenPort As Rectangle
	Get
	Set
Property Value
Type: Rectangle
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace
ViewportInfo.GetScreenPort()