RhinoCommon API
IOpenIDConnectToken.Aud Property
 The id of the client (the audience) this token is intended for.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
string Aud { get; }
ReadOnly Property Aud As String
	Get
Property Value
Type: String
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace