RhinoCommon API
DisplayPointAttributes.Diameter Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPointAttributes.Diameter"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public float? Diameter { get; set; }
Public Property Diameter As Single?
	Get
	Set
Property Value
Type: Nullable<Single>
See Also
Reference
DisplayPointAttributes Class
Rhino.Display Namespace