RhinoCommon API
DetailView.PageToModelRatio Property
 Gets the ratio of page units to model units for this detail view. Returns 0 if the projection is not parallel.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double PageToModelRatio { get; }
Public ReadOnly Property PageToModelRatio As Double
	Get
Property Value
Type: Double
Remarks
 This property is only meaningful when IsParallelProjection is true. For non-parallel projections, the ratio is undefined and this property returns 0.
See Also
Reference
DetailView Class
Rhino.Geometry Namespace