RhinoCommon API
HostUtils.RunningOnServer Property
 Tests if this process is currently executing in a server environment.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public static bool RunningOnServer { get; }
Public Shared ReadOnly Property RunningOnServer As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace