RhinoCommon API
FloatField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public float Value { get; set; }
Public Property Value As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
FloatField Class
Rhino.Render.Fields Namespace