RhinoCommon API
IntersectingMeshPair.FaceIndexB Property
 The index of a face of the second mesh that intersects FaceIndexA, or -1 if it could not be determined.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int FaceIndexB { get; }
Public ReadOnly Property FaceIndexB As Integer
	Get
Property Value
Type: Int32
See Also
Reference
IntersectingMeshPair Structure
Rhino.Geometry.Intersect Namespace