RhinoCommon API
DimensionStyle.LeaderTextHorizontalAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderTextHorizontalAlignment"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextHorizontalAlignment LeaderTextHorizontalAlignment { get; set; }
Public Property LeaderTextHorizontalAlignment As TextHorizontalAlignment
	Get
	Set
Property Value
Type: TextHorizontalAlignment
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace