RhinoCommon API
Linetype.ShapeSpacing Property
 If shapes are present in this linetype, this is the distance between shapes
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double ShapeSpacing { get; set; }
Public Property ShapeSpacing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace