RhinoCommon API
LengthMassProperties.WorldCoordinatesProductMoments Property
 Returns the world coordinate product moments if they were able to be calculated. X is integral of "xy dm" over the length Y is integral of "yz dm" over the length Z is integral of "zx dm" over the length.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public Vector3d WorldCoordinatesProductMoments { get; }
Public ReadOnly Property WorldCoordinatesProductMoments As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace