RhinoCommon API
RebuildCurveOptions.OutputToCurrentLayer Property
 True if output rebuilt curves should be on the current layer. False if output rebuild curves should be on the target curve's layer.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool OutputToCurrentLayer { get; set; }
Public Property OutputToCurrentLayer As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace