RhinoCommon API
RhinoViewport.FrustumAspect Property
Gets the width/height ratio of the frustum.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double FrustumAspect { get; }
Public ReadOnly Property FrustumAspect As Double
	Get
Property Value
Type: Double
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace