RhinoCommon API
RhinoApp.InstallationTypeString Property
Gets the type of installation (product edition) of the license or lease.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string InstallationTypeString { get; }
Public Shared ReadOnly Property InstallationTypeString As String
	Get
Property Value
Type: String
See Also
Reference
RhinoApp Class
Rhino Namespace