RhinoCommon API
GetCurve.ThirdPointPrompt Property
Prompt used when getting the third and following points. The default is the localized "Next point. Press Enter when done".
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string ThirdPointPrompt { get; set; }
Public Property ThirdPointPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace