RhinoCommon API
UserInterfaceCheckBox.CheckState Property
 State of the check box. Setting the state does not raise CheckedChanged; that is only for a state the user changed by clicking.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceCheckState CheckState { get; set; }
Public Property CheckState As UserInterfaceCheckState
	Get
	Set
Property Value
Type: UserInterfaceCheckState
See Also
Reference
UserInterfaceCheckBox Class
Rhino.UI Namespace