RhinoCommon API
IntersectionEvent.PointA2 Property
 Gets the end point of the overlap on Curve A. If the intersection type is not overlap, this value is meaningless.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d PointA2 { get; }
Public ReadOnly Property PointA2 As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace