RhinoCommon API
UserInterfaceObjectBase.Tooltip Property
 Text shown in a tooltip when the mouse rests over this object. Null or an empty string means no tooltip, which is what an object starts with. One tooltip is on screen at a time; whichever object the mouse is over owns it.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Tooltip { get; set; }
Public Property Tooltip As String
	Get
	Set
Property Value
Type: String
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace