RhinoCommon API
Brep.FilletSurfaceSettings.TanSlider Property
 A number between -0.95 and 0.95 indicating how far to push the tangent control points toward or away from the theoretical middle control point(s) - only for non-rational fillets
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double TanSlider { get; }
Public ReadOnly Property TanSlider As Double
	Get
Property Value
Type: Double
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace