RhinoCommon API
SubD.Vertices Property
 All vertices in this SubD
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDVertexList Vertices { get; }
Public ReadOnly Property Vertices As SubDVertexList
	Get
Property Value
Type: SubDVertexList
See Also
Reference
SubD Class
Rhino.Geometry Namespace