RhinoCommon API
RhinoViewport.ConstructionAxesVisible Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.ConstructionAxesVisible"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ConstructionAxesVisible { get; set; }
Public Property ConstructionAxesVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace