RhinoCommon API
TextDot.FontHeight Property
 Height of font used for displaying the dot
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.2
Syntax
public int FontHeight { get; set; }
Public Property FontHeight As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
TextDot Class
Rhino.Geometry Namespace