RhinoCommon API
PageViewGroupTable.Count Property
 Returns number of page view groups in the table, including deleted page view groups.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public override int Count { get; }
Public Overrides ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
IReadOnlyCollection<T>.Count
ICollection<T>.Count
See Also
Reference
PageViewGroupTable Class
Rhino.DocObjects.Tables Namespace