RhinoCommon API
AppearanceSettings.CrosshairColor Property
 Gets or sets the color of the crosshair icon.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color CrosshairColor { get; set; }
Public Shared Property CrosshairColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace