RhinoCommon API
GumballSettings.RotateViewAroundGumball Property
 Sets the view rotation center to the gumball origin.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool RotateViewAroundGumball { get; set; }
Public Shared Property RotateViewAroundGumball As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace