RhinoCommon API
MeshDisplacementInfo.White Property
 Value considered highest point of the displacement texture.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double White { get; set; }
Public Property White As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace