RhinoCommon API
RhinoApp.IsSkinned Property
 Is Rhino currently using custom, user-interface Skin.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public static bool IsSkinned { get; }
Public Shared ReadOnly Property IsSkinned As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace