RhinoCommon API
LicenseData.LicenseExpires Property
[Missing <summary> documentation for "P:Rhino.PlugIns.LicenseData.LicenseExpires"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool LicenseExpires { get; }
Public ReadOnly Property LicenseExpires As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace