RhinoCommon API
GroundPlane.Enabled Property
 Return true if ground plane is enabled
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Enabled { get; }
Public ReadOnly Property Enabled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace