RhinoCommon API
RefinementSettings.ContinueRequest Property
 A token to request computation termination.
 Namespace: Rhino.Geometry.MeshRefinements
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public CancellationToken ContinueRequest { get; set; }
Public Property ContinueRequest As CancellationToken
	Get
	Set
Property Value
Type: CancellationToken
See Also
Reference
RefinementSettings Class
Rhino.Geometry.MeshRefinements Namespace