RhinoCommon API
AppearanceSettings.LockedObjectColor Property
color used to draw locked objects.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color LockedObjectColor { get; set; }
Public Shared Property LockedObjectColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace