RhinoCommon API
AngularDimension.AngleResolution Property
[Missing <summary> documentation for "P:Rhino.Geometry.AngularDimension.AngleResolution"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int AngleResolution { get; set; }
Public Property AngleResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace