RhinoCommon API
CurvatureGraphSettingsState.HairDensity Property
 Gets or sets the hair density.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int HairDensity { get; set; }
Public Property HairDensity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
CurvatureGraphSettingsState Class
Rhino.ApplicationSettings Namespace