RhinoCommon API
ChooseOneObjectSettingsState.ShowObjectLayer Property
ShowObjectLayer
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ShowObjectLayer { get; set; }
Public Property ShowObjectLayer As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace