RhinoCommon API
MeshSplitOptions.CreateNgons Property
 Gets or sets whether ngons are created along the split ridge, to preserve the boundary look.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool CreateNgons { get; set; }
Public Property CreateNgons As Boolean
	Get
	Set
Property Value
Type: Boolean
The default value is true.
See Also
Reference
MeshSplitOptions Class
Rhino.Geometry Namespace