RhinoCommon API
IntField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public int Value { get; set; }
Public Property Value As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
IntField Class
Rhino.Render.Fields Namespace