RhinoCommon API
Vector2f.YAxis Property
 Gets the value of the vector with components 0,1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public static Vector2f YAxis { get; }
Public Shared ReadOnly Property YAxis As Vector2f
	Get
Property Value
Type: Vector2f
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace