RhinoCommon API
CreatePreviewEventArgs.PreviewNotifier Property
[Missing <summary> documentation for "P:Rhino.Render.CreatePreviewEventArgs.PreviewNotifier"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PreviewNotification PreviewNotifier { get; }
Public ReadOnly Property PreviewNotifier As PreviewNotification
	Get
Property Value
Type: PreviewNotification
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace