RhinoCommon API
GeneralSettings.UseExtrusions Property
 Should extrusion objects be created for things like cylinders
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool UseExtrusions { get; }
Public Shared ReadOnly Property UseExtrusions As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace