RhinoCommon API
ContentUuids.MetalMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.MetalMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid MetalMaterialType { get; }
Public Shared ReadOnly Property MetalMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace