RhinoCommon API
FileCsvWriteOptions.VolumeMoments Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.VolumeMoments"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool VolumeMoments { get; set; }
Public Property VolumeMoments As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace