RhinoCommon API
RhinoDoc.Strings Property
 Collection of document user data strings in this document
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public StringTable Strings { get; }
Public ReadOnly Property Strings As StringTable
	Get
Property Value
Type: StringTable
See Also
Reference
RhinoDoc Class
Rhino Namespace