RhinoCommon API
HatchPattern.Defaults.Hatch2 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Defaults.Hatch2"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static HatchPattern Hatch2 { get; }
Public Shared ReadOnly Property Hatch2 As HatchPattern
	Get
Property Value
Type: HatchPattern
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace