RhinoCommon API
NurbsCurveFitParameters.PointCountRangeMaximum Property
[Missing <summary> documentation for "P:Rhino.Geometry.NurbsCurveFitParameters.PointCountRangeMaximum"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PointCountRangeMaximum { get; }
Public ReadOnly Property PointCountRangeMaximum As Integer
	Get
Return Value
Type: Int32
 Maximum number of distinct control points in the NURBS curve fit.
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace