RhinoCommon API
RhinoObject.GripsId Property
 Which kind of grips this object currently has on.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid GripsId { get; }
Public ReadOnly Property GripsId As Guid
	Get
Property Value
Type: Guid
Remarks
Default both for default grips and for no grips at all. GripsOn tells those two apart.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace