RhinoCommon API
HiddenLineDrawingPoint.SourceObject Property
 Return the source object that this point came from.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public HiddenLineDrawingObject SourceObject { get; }
Public ReadOnly Property SourceObject As HiddenLineDrawingObject
	Get
Property Value
Type: HiddenLineDrawingObject
See Also
Reference
HiddenLineDrawingPoint Class
Rhino.Geometry Namespace