RhinoCommon API
RibbonOffsetParameters.OffsetLocation Property
 Inside or Outside point location
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public Point3d OffsetLocation { get; set; }
Public Property OffsetLocation As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
RibbonOffsetParameters Class
Rhino.Geometry Namespace