RhinoCommon API
DrawEventArgs.Viewport Property
[Missing <summary> documentation for "P:Rhino.Display.DrawEventArgs.Viewport"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
See Also
Reference
DrawEventArgs Class
Rhino.Display Namespace