RhinoCommon API
ZebraAnalysisSettings.ShowIsoCurves Property
 Get or sets the display of surface isocurves.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public static bool ShowIsoCurves { get; set; }
Public Shared Property ShowIsoCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ZebraAnalysisSettings Class
Rhino.ApplicationSettings Namespace