RhinoCommon API
GetPolyline.SecondPointPrompt Property
Prompt when getting second point
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string SecondPointPrompt { get; set; }
Public Property SecondPointPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace