RhinoCommon API
SimulatedTexture.TransparentColorSensitivity Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.TransparentColorSensitivity"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public double TransparentColorSensitivity { get; set; }
Public Property TransparentColorSensitivity As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace