RhinoCommon API
SubDEdgeSharpness.IsDecreasing Property
 Gets true if EndSharpness(0) is greater than EndSharpness(1).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool IsDecreasing { get; }
Public ReadOnly Property IsDecreasing As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace