RhinoCommon API
Triangle3d.B Property
 Gets the second triangle corner.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Point3d B { get; }
Public ReadOnly Property B As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace