RhinoCommon API
ViewSettings.AutoAdjustTargetDepth Property
 Gets or sets the 'Auto adjust camera target after Pan and Zoom' value.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.19
Syntax
public static bool AutoAdjustTargetDepth { get; set; }
Public Shared Property AutoAdjustTargetDepth As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace