RhinoCommon API
GetPointMouseEventArgs.Source Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.Source"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GetPoint Source { get; }
Public ReadOnly Property Source As GetPoint
	Get
Property Value
Type: GetPoint
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace