RhinoCommon API
IWindow.Window Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IWindow.Window"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
IntPtr Window { get; }
ReadOnly Property Window As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace