RhinoCommon API
FileDwgReadOptions.MeshPrecision Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgReadOptions.MeshPrecision"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileDwgReadOptions.MeshPrecisionMode MeshPrecision { get; set; }
Public Property MeshPrecision As FileDwgReadOptions.MeshPrecisionMode
	Get
	Set
Property Value
Type: FileDwgReadOptions.MeshPrecisionMode
See Also
Reference
FileDwgReadOptions Class
Rhino.FileIO Namespace