RhinoCommon API
PostEffectUuids.WireframePointsRGBA Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.WireframePointsRGBA"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid WireframePointsRGBA { get; }
Public Shared ReadOnly Property WireframePointsRGBA As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace