RhinoCommon API
EarthAnchorPoint.KMLOrientationHeadingAngleDegrees Property
 Gets Keyhole Markup Language (KML) orientation heading angle in degrees.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public double KMLOrientationHeadingAngleDegrees { get; }
Public ReadOnly Property KMLOrientationHeadingAngleDegrees As Double
	Get
Property Value
Type: Double
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace