RhinoCommon API
DisplayPipelineAttributes.HonorDrawOrder Property
 Draw order support for this display mode. When true (the default), objects with a non-zero draw order are drawn in front of or behind other objects based on that draw order. When false, this display mode ignores per object draw order and draws everything in the standard order.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool HonorDrawOrder { get; set; }
Public Property HonorDrawOrder As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace