RhinoCommon API
Instance.IsForcedMaterial Property
 The material for this instance should override any display mode materials.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool IsForcedMaterial { get; set; }
Public Property IsForcedMaterial As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Instance Class
Rhino.Render.CustomRenderMeshes Namespace