RhinoCommon API
TextDot.FontFace Property
Font face used for displaying the dot
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.2
Syntax
public string FontFace { get; set; }
Public Property FontFace As String
	Get
	Set
Property Value
Type: String
See Also
Reference
TextDot Class
Rhino.Geometry Namespace