RhinoCommon API
TextEntity.TextHorizontalAlignment Property
[Missing <summary> documentation for "P:Rhino.Geometry.TextEntity.TextHorizontalAlignment"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextHorizontalAlignment TextHorizontalAlignment { get; set; }
Public Property TextHorizontalAlignment As TextHorizontalAlignment
	Get
	Set
Property Value
Type: TextHorizontalAlignment
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace