RhinoCommon API
GetPointMouseEventArgs.WindowPoint Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.WindowPoint"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point WindowPoint { get; }
Public ReadOnly Property WindowPoint As Point
	Get
Property Value
Type: Point
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace