RhinoCommon API
FileGHSReadOptions.RemoveColinearPoints Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileGHSReadOptions.RemoveColinearPoints"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool RemoveColinearPoints { get; set; }
Public Property RemoveColinearPoints As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileGHSReadOptions Class
Rhino.FileIO Namespace