RhinoCommon API
UserInterfaceControl.Text Property
[Missing <summary> documentation for "P:Rhino.UI.UserInterfaceControl.Text"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public virtual string Text { get; set; }
Public Overridable Property Text As String
	Get
	Set
Property Value
Type: String
See Also
Reference
UserInterfaceControl Class
Rhino.UI Namespace