RhinoCommon API
File3dmThickening.BothSides Property
 Specifies whether to thicken to both sides of the surface.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool BothSides { get; set; }
Public Property BothSides As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmThickening Class
Rhino.FileIO Namespace