RhinoCommon API
Command.PlugIn Property
 Gets the plug-in where this commands is placed.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PlugIn PlugIn { get; }
Public ReadOnly Property PlugIn As PlugIn
	Get
Property Value
Type: PlugIn
See Also
Reference
Command Class
Rhino.Commands Namespace