RhinoCommon API
RebuildCurveOptions.SmoothingIntensity Property
 When SmoothingPermitted is true, SmoothingIntensity sets and gets the intensity of forcing the 2nd point of contiguous triples of control points to be halfway between the 1st and 3rd point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RebuildCurveIntensity SmoothingIntensity { get; set; }
Public Property SmoothingIntensity As RebuildCurveIntensity
	Get
	Set
Property Value
Type: RebuildCurveIntensity
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace