RhinoCommon API
FileDwgWriteOptions.CurveSegmentLength Property
Max length for any polyline segment
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double CurveSegmentLength { get; set; }
Public Property CurveSegmentLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace