RhinoCommon API
DimensionStyle.ToleranceUpperValue Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ToleranceUpperValue"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ToleranceUpperValue { get; set; }
Public Property ToleranceUpperValue As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace