RhinoCommon API
ContentUuids.DoubleSidedMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.DoubleSidedMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Guid DoubleSidedMaterialType { get; }
Public Shared ReadOnly Property DoubleSidedMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace