RhinoCommon API
GumballSettingsState.YAxisColor Property
 Specifies the gumball y axis color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color YAxisColor { get; set; }
Public Property YAxisColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace