RhinoCommon API
ThicknessAnalysisSettings.DistanceRange Property
 The distance range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Interval DistanceRange { get; set; }
Public Shared Property DistanceRange As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
ThicknessAnalysisSettings Class
Rhino.ApplicationSettings Namespace