RhinoCommon API
RenderContentEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentEventArgs.Document"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RenderContentEventArgs Class
Rhino.Render Namespace