RhinoCommon API
Triangle3d.C Property
 Gets the third triangle corner.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Point3d C { get; }
Public ReadOnly Property C As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace