RhinoCommon API
ModelAidSettingsState.NearMidIntPerpSnapToMeshes Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettingsState.NearMidIntPerpSnapToMeshes"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool NearMidIntPerpSnapToMeshes { get; set; }
Public Property NearMidIntPerpSnapToMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace