RhinoCommon API
MeshCageMorph.IsValid Property
Returns true if the space morph definition is valid, false otherwise.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MeshCageMorph Class
Rhino.Geometry.Morphs Namespace