RhinoCommon API
DisplayPipelineAttributes.WorldAxesIconColorUsage Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.WorldAxesIconColorUsage"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public DisplayPipelineAttributes.WorldAxesIconColorUse WorldAxesIconColorUsage { get; set; }
Public Property WorldAxesIconColorUsage As DisplayPipelineAttributes.WorldAxesIconColorUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.WorldAxesIconColorUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace