RhinoCommon API
Material.IsDefaultMaterial Property
 By default Rhino layers and objects are assigned the default rendering material.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsDefaultMaterial { get; }
Public ReadOnly Property IsDefaultMaterial As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Material Class
Rhino.DocObjects Namespace