RhinoCommon API
CommandPromptChangedEventArgs.Prompt Property
Command line prompt text
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Prompt { get; }
Public ReadOnly Property Prompt As String
	Get
Property Value
Type: String
See Also
Reference
CommandPromptChangedEventArgs Class
Rhino.UI Namespace