RhinoCommon API
Arc.Length Property
 Gets the length of the arc. (Length = Radius * (subtended angle in radians)).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
See Also
Reference
Arc Structure
Rhino.Geometry Namespace