RhinoCommon API
CommandEventArgs.CommandPluginName Property
 Gets the name of the plug-in that this command belongs to. If the command is internal to Rhino, then this property is an empty string.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string CommandPluginName { get; }
Public ReadOnly Property CommandPluginName As String
	Get
Property Value
Type: String
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace