RhinoCommon API
MeshNgon.Empty Property
 Gets an empty MeshNgon.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static MeshNgon Empty { get; }
Public Shared ReadOnly Property Empty As MeshNgon
	Get
Property Value
Type: MeshNgon
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace