RhinoCommon API
RebuildCurveOptions.TangentMatchingPermitted Property
 Returns true if the user interface may offer tangent matching as an option.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool TangentMatchingPermitted { get; }
Public ReadOnly Property TangentMatchingPermitted As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace