RhinoCommon API
HiddenLineDrawingObject.Tag Property
 Returns the extra data used to cross-reference the object specified in HiddenLineDrawing.AddObject.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Object Tag { get; }
Public ReadOnly Property Tag As Object
	Get
Property Value
Type: Object
See Also
Reference
HiddenLineDrawingObject Class
Rhino.Geometry Namespace