RhinoCommon API
TextureMapping.ComponentType Property
 Returns TextureMapping.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
TextureMapping Class
Rhino.Render Namespace