RhinoCommon API
NurbsCurveFitParameters.TangentMatching Property
 Gets ot Sets the TangentMatching value
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public NurbsCurveFitParameters.TangentMatch TangentMatching { get; set; }
Public Property TangentMatching As NurbsCurveFitParameters.TangentMatch
	Get
	Set
Property Value
Type: NurbsCurveFitParameters.TangentMatch
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace