RhinoCommon API
PhysicallyBased.Bump Property
[Missing <summary> documentation for "P:Rhino.Render.ParameterNames.PhysicallyBased.Bump"]
 Namespace: Rhino.Render.ParameterNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Bump { get; }
Public Shared ReadOnly Property Bump As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ParameterNames Namespace