RhinoCommon API
Transform2d.M00 Property
Gets or sets this[0,0].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double M00 { get; set; }
Public Property M00 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace