RhinoCommon API
PointCloud.ContainsNormals Property
 Gets a value indicating whether or not the points in this point cloud have normals assigned to them.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ContainsNormals { get; }
Public ReadOnly Property ContainsNormals As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace