RhinoCommon API
Transform2d.M10 Property
Gets or sets this[1,0].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double M10 { get; set; }
Public Property M10 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace