RhinoCommon API
GumballSettings.MergeFacesAfterExtrude Property
 Merges faces after extruding.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool MergeFacesAfterExtrude { get; set; }
Public Shared Property MergeFacesAfterExtrude As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace