RhinoCommon API
SoftTransformSettings.Radius Property
 The radius of effect for soft transform. Other components on the object this distance and closer to selected components will be transformed.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static double Radius { get; set; }
Public Shared Property Radius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SoftTransformSettings Class
Rhino.ApplicationSettings Namespace