RhinoCommon API
DisplayPipelineAttributes.SurfaceEdgeColorUsage Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeColorUsage"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public DisplayPipelineAttributes.SurfaceEdgeColorUse SurfaceEdgeColorUsage { get; set; }
Public Property SurfaceEdgeColorUsage As DisplayPipelineAttributes.SurfaceEdgeColorUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.SurfaceEdgeColorUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace