RhinoCommon API
PageViewGroup.ComponentStatus Property
 Gets or sets the status of the page view group.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public override ComponentStatus ComponentStatus { get; set; }
Public Overrides Property ComponentStatus As ComponentStatus
	Get
	Set
Property Value
Type: ComponentStatus
See Also
Reference
PageViewGroup Class
Rhino.DocObjects Namespace