RhinoCommon API
PostEffect.SerialNumber Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffect.SerialNumber"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int SerialNumber { get; set; }
Public Property SerialNumber As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace