RhinoCommon API
DisplayModeDescription.ArtisticId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.ArtisticId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.26
Syntax
public static Guid ArtisticId { get; }
Public Shared ReadOnly Property ArtisticId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace