RhinoCommon API
SquishParameters.InteriorCompressConstant Property
 Spring constant for compressed interior edges times the rest length
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public double InteriorCompressConstant { get; set; }
Public Property InteriorCompressConstant As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SquishParameters Class
Rhino.Geometry Namespace