RhinoCommon API
ContentUuids.AdvancedDotTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.AdvancedDotTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid AdvancedDotTextureType { get; }
Public Shared ReadOnly Property AdvancedDotTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace