RhinoCommon API
ICurrentEnvironment_Get.ForBackground Property
 Get the RenderEnvironment used as the 360 degree backdrop environment. Null will be returned if the background mode is set to 'Solid Color' or 'Gradient' (i.e., not 'Environment').
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
RenderEnvironment ForBackground { get; }
ReadOnly Property ForBackground As RenderEnvironment
	Get
Property Value
Type: RenderEnvironment
See Also
Reference
ICurrentEnvironment_Get Interface
Rhino.Render Namespace