RhinoCommon API
Hatch.BasePoint Property
 Gets or sets the hatch pattern base point
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public Point3d BasePoint { get; set; }
Public Property BasePoint As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Hatch Class
Rhino.Geometry Namespace