RhinoCommon API
RibbonOffsetParameters.BlendRadius Property
 Positive, typically the same as distance. When the offset results in a self-intersection that gets trimmed off at a kink, the kink will be blended out using this radius.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public double BlendRadius { get; set; }
Public Property BlendRadius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RibbonOffsetParameters Class
Rhino.Geometry Namespace