RhinoCommon API
ProviderIds.RdkRenderingPostEffectGlare Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.RdkRenderingPostEffectGlare"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public static Guid RdkRenderingPostEffectGlare { get; }
Public Shared ReadOnly Property RdkRenderingPostEffectGlare As Guid
	Get
Property Value
Type: Guid
Remarks
Obsolete; the Glare post effect was removed in Rhino 7.
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace