RhinoCommon API
RenderWindowClonedEventArgs.NewRenderWindow Property
[Missing <summary> documentation for "P:Rhino.Render.RenderWindowClonedEventArgs.NewRenderWindow"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public RenderWindow NewRenderWindow { get; }
Public ReadOnly Property NewRenderWindow As RenderWindow
	Get
Property Value
Type: RenderWindow
See Also
Reference
RenderWindowClonedEventArgs Class
Rhino.Render Namespace