RhinoCommon API
AnnotationBase.MaskFrame Property
 Gets or sets whether to draw a frame around a text mask
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public DimensionStyle.MaskFrame MaskFrame { get; set; }
Public Property MaskFrame As DimensionStyle.MaskFrame
	Get
	Set
Property Value
Type: DimensionStyle.MaskFrame
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace