RhinoCommon API
AnimationProperties.EndYear Property
 Gets or sets the end year for seasonal day sun animation in the range 1800 to 2199.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public int EndYear { get; set; }
Public Property EndYear As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace