RhinoCommon API
RadialDimension.RadiusPoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.RadiusPoint"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point2d RadiusPoint { get; set; }
Public Property RadiusPoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace