RhinoCommon API
Sun.DaylightSaving Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Render.Sun.DaylightSaving"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
[ObsoleteAttribute("Use DaylightSavingOn")]
public bool DaylightSaving { get; set; }
<ObsoleteAttribute("Use DaylightSavingOn")>
Public Property DaylightSaving As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Sun Class
Rhino.Render Namespace