RhinoCommon API
SubDFace.SurfaceCenterFrame Property
 Get the limit surface tangent plane at the center of the face. The plane's origin is the point on the limit surface at the center of the face. The plane's z axis is the limit surface normal vector at the center of the face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Plane SurfaceCenterFrame { get; }
Public ReadOnly Property SurfaceCenterFrame As Plane
	Get
Return Value
Type: Plane
 Limit surface tanget plane at the face's center.
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace