RhinoCommon API
ZooClientParameters.ProductTitle Property
 Title of the product, "Rhinoceros 6" for example.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string ProductTitle { get; }
Public ReadOnly Property ProductTitle As String
	Get
Property Value
Type: String
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace