RhinoCommon API
SmartTrackSettingsState.MaxSmartPoints Property
Gets or sets the maximum number of smart points.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int MaxSmartPoints { get; set; }
Public Property MaxSmartPoints As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace