RhinoCommon API
ChooseOneObjectSettingsState.MaxAutoResizeItems Property
MaxAutoResizeItems
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int MaxAutoResizeItems { get; set; }
Public Property MaxAutoResizeItems As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace