RhinoCommon API
PointCloudItem.Hidden Property
 Gets or sets the hidden flag of this point cloud item. If this point cloud item does not have a hidden flag, false is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Hidden { get; set; }
Public Property Hidden As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace