RhinoCommon API
DisplayPipelineAttributes.ClipSelectionHighlight Property
 Clips the highlight wires. Shaded selections always clip.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ClipSelectionHighlight { get; set; }
Public Property ClipSelectionHighlight As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace