RhinoCommon API
ViewSettings.DefinedViewSetClippingPlanes Property
 Gets or sets the 'Named views set clipping planes' value.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.19
Syntax
public static bool DefinedViewSetClippingPlanes { get; set; }
Public Shared Property DefinedViewSetClippingPlanes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace