RhinoCommon API
File3dmDisplacement.FinalMaxFaces Property
 Specifies how many faces the reduction post process should target.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int FinalMaxFaces { get; set; }
Public Property FinalMaxFaces As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace