RhinoCommon API
DisplayPipelineAttributes.UseCustomObjectColorBackfaces Property
 Gets or sets whether objects ought to be drawn using a custom color for back faces.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool UseCustomObjectColorBackfaces { get; set; }
Public Property UseCustomObjectColorBackfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace