RhinoCommon API
DisplayPipelineAttributes.ViewDisplayAttributes.GridCornerRadius Property
 The radius used to round the corners of the grid.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public float GridCornerRadius { get; set; }
Public Property GridCornerRadius As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace