RhinoCommon API
UserData.ShouldWrite Property
 If you want to save this user data in a 3dm file, override ShouldWrite and return true. If you do support serialization, you must also override the Read and Write functions.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public virtual bool ShouldWrite { get; }
Public Overridable ReadOnly Property ShouldWrite As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace