RhinoCommon API
UserDataList.Item Property
 Retrieve through indexer. Read-only access.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UserData this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As UserData
	Get
Parameters
index
Type: System.Int32
Return Value
Type: UserData
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace