RhinoCommon API
PageViewGroup.MemberCount Property
 Get the number of page views that are members of this page view group.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int MemberCount { get; }
Public ReadOnly Property MemberCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PageViewGroup Class
Rhino.DocObjects Namespace