RhinoCommon API
ModelAidSettingsState.OsnapCursorMode Property
Gets or sets the OSnap cursor mode.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public CursorMode OsnapCursorMode { get; set; }
Public Property OsnapCursorMode As CursorMode
	Get
	Set
Property Value
Type: CursorMode
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace