RhinoCommon API
SimulatedTexture.Filename Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.Filename"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public string Filename { get; set; }
Public Property Filename As String
	Get
	Set
Property Value
Type: String
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace