RhinoCommon API
Polyline.SegmentCount Property
 Gets the number of segments for this polyline.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int SegmentCount { get; }
Public ReadOnly Property SegmentCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Polyline Class
Rhino.Geometry Namespace