RhinoCommon API
RhinoDoc.RenderMaterials Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderMaterials"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public RenderMaterialTable RenderMaterials { get; }
Public ReadOnly Property RenderMaterials As RenderMaterialTable
	Get
Property Value
Type: RenderMaterialTable
See Also
Reference
RhinoDoc Class
Rhino Namespace