RhinoCommon API
RhinoObject.GroupCount Property
Number of groups object belongs to.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int GroupCount { get; }
Public ReadOnly Property GroupCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace