RhinoCommon API
SurfaceCurvature.IsNaN Property
 True if either of kappa1 or kappa2 is NaN.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsNaN { get; }
Public ReadOnly Property IsNaN As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace