RhinoCommon API
DisplayPipeline.DepthMode Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.DepthMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DepthMode DepthMode { get; set; }
Public Property DepthMode As DepthMode
	Get
	Set
Property Value
Type: DepthMode
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace