RhinoCommon API
GripUserInterfaceObject.GripColor Property
[Missing <summary> documentation for "P:Rhino.UI.GripUserInterfaceObject.GripColor"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color GripColor { get; set; }
Public Property GripColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GripUserInterfaceObject Class
Rhino.UI Namespace