RhinoCommon API
PreviewAppearance.CppPointer Property
 Previewappearances c++ pointer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace