RhinoCommon API
DisplayPipelineAttributes.ShowSeams Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ShowSeams"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ShowSeams { get; set; }
Public Property ShowSeams As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace