RhinoCommon API
FileXamlWriteOptions.MeshingParameters Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileXamlWriteOptions.MeshingParameters"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public MeshingParameters MeshingParameters { get; set; }
Public Property MeshingParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
Remarks
 This is not currently being used but may be in the future. See UseExistingRenderMeshes.
See Also
Reference
FileXamlWriteOptions Class
Rhino.FileIO Namespace