RhinoCommon API
RenderChannels.CustomList Property
[Missing <summary> documentation for "P:Rhino.Render.RenderChannels.CustomList"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Guid[] CustomList { get; set; }
Public Property CustomList As Guid()
	Get
	Set
Property Value
Type: Guid[]
See Also
Reference
RenderChannels Class
Rhino.Render Namespace