RhinoCommon API
RhinoView.RuntimeSerialNumber Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoView.RuntimeSerialNumber"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint RuntimeSerialNumber { get; }
Public ReadOnly Property RuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RhinoView Class
Rhino.Display Namespace