RhinoCommon API
HatchLine.BasePoint Property
 Get and sets this line's 2d base point.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Point2d BasePoint { get; set; }
Public Property BasePoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
HatchLine Class
Rhino.DocObjects Namespace