RhinoCommon API
ProviderIds.CurrentEnvironment Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.CurrentEnvironment"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid CurrentEnvironment { get; }
Public Shared ReadOnly Property CurrentEnvironment As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace