RhinoCommon API
DisplayPipelineAttributes.ShowSubDNonmanifoldEdges Property
 Turn on/off color differentiation of SubD symmetry children.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public bool ShowSubDNonmanifoldEdges { get; set; }
Public Property ShowSubDNonmanifoldEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace