RhinoCommon API
IWindow.Enabled Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IWindow.Enabled"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool Enabled { get; set; }
Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace