RhinoCommon API
Brep.SolidOrientation Property
 Gets the solid orientation state of this Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BrepSolidOrientation SolidOrientation { get; }
Public ReadOnly Property SolidOrientation As BrepSolidOrientation
	Get
Property Value
Type: BrepSolidOrientation
See Also
Reference
Brep Class
Rhino.Geometry Namespace