RhinoCommon API
RhinoDoc.IsSendingMail Property
 true if Rhino is in the process of sending this document as an email attachment.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsSendingMail { get; }
Public ReadOnly Property IsSendingMail As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace