RhinoCommon API
SweepOneRail.IsRoadlike Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.IsRoadlike"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsRoadlike { get; }
Public ReadOnly Property IsRoadlike As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace