RhinoCommon API
DigitizerPlugIn.DigitizerUnitSystem Property
 Unit system of the points the digitizer passes to SendPoint(). Rhino uses this value when it calibrates a digitizer. This unit system must be not change.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract UnitSystem DigitizerUnitSystem { get; }
Protected MustOverride ReadOnly Property DigitizerUnitSystem As UnitSystem
	Get
Property Value
Type: UnitSystem
See Also
Reference
DigitizerPlugIn Class
Rhino.PlugIns Namespace