RhinoCommon API
GroupTableEventArgs.OldState Property
 If the event is GroupTableEventType.Modified, then the old Group.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public Group OldState { get; }
Public ReadOnly Property OldState As Group
	Get
Property Value
Type: Group
See Also
Reference
GroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace