RhinoCommon API
GripsDrawEventArgs.LockedGripColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripsDrawEventArgs.LockedGripColor"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color LockedGripColor { get; set; }
Public Property LockedGripColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace