RhinoCommon API
Decal.Radius Property
 Gets the radius of the decal. Only used when mapping is cylindrical or spherical.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Decal Class
Rhino.Render Namespace