RhinoCommon API
ICommonComponentTable<T>.ComponentType Property
 Returns the model component type the table handles.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
ModelComponentType ComponentType { get; }
ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
ICommonComponentTable<T> Interface
Rhino.FileIO Namespace