RhinoCommon API
PostEffectUuids.Glow Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.Glow"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid Glow { get; }
Public Shared ReadOnly Property Glow As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace