RhinoCommon API
SquishParameters.SaveMapping Property
 If SaveMapping is true, then ON_SquishMesh() will save extra information on the squished mesh so 3d points and curves near the input mesh can be mapped to the squished mesh and 2d points and curves on the squished mesh can be mapped back to the 3d mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public bool SaveMapping { get; set; }
Public Property SaveMapping As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SquishParameters Class
Rhino.Geometry Namespace