RhinoCommon API
GetPointMouseEventArgs.Point Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.Point"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d Point { get; }
Public ReadOnly Property Point As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace