RhinoCommon API
Dimension.TextFormula Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.TextFormula"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string TextFormula { get; set; }
Public Property TextFormula As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Dimension Class
Rhino.Geometry Namespace