RhinoCommon API
MeshPrincipalCurvatureList.Count Property
 Gets or sets the number of principal curvatures.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Count { get; set; }
Public Property Count As Integer
	Get
	Set
Property Value
Type: Int32
Implements
IResizableList<T>.Count
ICollection<T>.Count
ICollection.Count
IReadOnlyCollection<T>.Count
See Also
Reference
MeshPrincipalCurvatureList Class
Rhino.Geometry.Collections Namespace