RhinoCommon API
OrdinateDimension.KinkPoint1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.OrdinateDimension.KinkPoint1"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point2d KinkPoint1 { get; }
Public ReadOnly Property KinkPoint1 As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace