RhinoCommon API
DisplayPipelineAttributes.ShowLights Property
Show light widgets.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public bool ShowLights { get; set; }
Public Property ShowLights As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace