RhinoCommon API
RhinoDoc.PageUnits Property
Length unit used on page space geometry.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public LengthUnit PageUnits { get; set; }
Public Property PageUnits As LengthUnit
	Get
	Set
Property Value
Type: LengthUnit
See Also
Reference
RhinoDoc Class
Rhino Namespace