RhinoCommon API
GroundPlane.TextureOffsetLocked Property
 Texture offset locked.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TextureOffsetLocked { get; set; }
Public Property TextureOffsetLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GroundPlane Class
Rhino.Render Namespace