RhinoCommon API
FileObjReadOptions.MapYtoZ Property
 Setting to transform OBJ's Y axis to Rhino's Z axis
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool MapYtoZ { get; set; }
Public Property MapYtoZ As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace