RhinoCommon API
SubDFace.ControlNetCenterFrame Property
 The face's control net center frame is a plane with normal equal to ControlNetCenterNormal and origin equal to ControlNetCenterPoint. The x and y axes of the frame have no predictable relationship to the face or SubD control net topology.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Plane ControlNetCenterFrame { get; }
Public ReadOnly Property ControlNetCenterFrame As Plane
	Get
Return Value
Type: Plane
 A plane with unit normal equal to ControlNetCenterNormal and origin equal to ControlNetCenterPoint.
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace