RhinoCommon API
MeshCheckParameters.NonUnitVectorNormalCount Property
 Get the total count of normals that are not unit vectors for all meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int NonUnitVectorNormalCount { get; }
Public ReadOnly Property NonUnitVectorNormalCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace