RhinoCommon API
DimensionStyle.ClippingArrowLength Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ClippingArrowLength"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double ClippingArrowLength { get; set; }
Public Property ClippingArrowLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace