RhinoCommon API
DisplayRenderSettings.CullBackFaces Property
 True if backfaces should be culled
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool CullBackFaces { get; }
Public ReadOnly Property CullBackFaces As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayRenderSettings Class
Rhino.Render.ChangeQueue Namespace