RhinoCommon API
RenderMaterial.SmellsLikePlastic Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikePlastic"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SmellsLikePlastic { get; }
Public ReadOnly Property SmellsLikePlastic As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace