RhinoCommon API
Layer.IsDeleted Property
 Gets a value indicating whether this layer has been deleted and is currently in the Undo buffer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override bool IsDeleted { get; }
Public Overrides ReadOnly Property IsDeleted As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Layer Class
Rhino.DocObjects Namespace