RhinoCommon API
DimensionStyle.ExtensionLineOffset Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ExtensionLineOffset"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ExtensionLineOffset { get; set; }
Public Property ExtensionLineOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace