RhinoCommon API
SubD.Empty Property
 Get a new, empty SubD object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.18
Syntax
public static SubD Empty { get; }
Public Shared ReadOnly Property Empty As SubD
	Get
Property Value
Type: SubD
See Also
Reference
SubD Class
Rhino.Geometry Namespace