RhinoCommon API
IntersectionEvent.ParameterB Property
 Gets the parameter on Curve B where the intersection occurred. If the intersection type is overlap, then this will return the start of the overlap region.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ParameterB { get; }
Public ReadOnly Property ParameterB As Double
	Get
Property Value
Type: Double
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace