RhinoCommon API
HatchPattern.Defaults.Hatch3 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Defaults.Hatch3"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static HatchPattern Hatch3 { get; }
Public Shared ReadOnly Property Hatch3 As HatchPattern
	Get
Property Value
Type: HatchPattern
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace