RhinoCommon API
MeshCurveIntersection.PointTolerance Property
Certified half-width on each 3D point slot.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double PointTolerance { get; }
Public ReadOnly Property PointTolerance As Double
	Get
Property Value
Type: Double
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace