RhinoCommon API
ContentHash.Sha1NameHash Property
 Gets the 20-bytes long SHA1 hash of the name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public byte[] Sha1NameHash { get; }
Public ReadOnly Property Sha1NameHash As Byte()
	Get
Property Value
Type: Byte[]
See Also
Reference
ContentHash Class
Rhino.FileIO Namespace