RhinoCommon API
FileSettings.CreateOtherBackupFiles Property
Gets or sets a value that controls the creation of other types of backup files.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool CreateOtherBackupFiles { get; set; }
Public Shared Property CreateOtherBackupFiles As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace