RhinoCommon API
SubDVertex.Edges Property
 All edges that this vertex is part of
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public IEnumerable<SubDEdge> Edges { get; }
Public ReadOnly Property Edges As IEnumerable(Of SubDEdge)
	Get
Property Value
Type: IEnumerable<SubDEdge>
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace