RhinoCommon API
MeshDisplacementInfo.ChannelNumber Property
 Mapping channel number for the displacement mapping.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int ChannelNumber { get; set; }
Public Property ChannelNumber As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace