RhinoCommon API
RhinoDoc.IsOpening Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.IsOpening"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsOpening { get; }
Public ReadOnly Property IsOpening As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace