RhinoCommon API
IUserInterfaceSection.Hidden Property
 Return true if the section should be hidden, else return false.
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool Hidden { get; }
ReadOnly Property Hidden As Boolean
	Get
Property Value
Type: Boolean
Remarks
 This is not to be confused with IsShown(). Hidden tells the holder whether or not to hide the section. IsShown reports the current physical state of the control.
Remarks
 This method is called continuously by the holder and should be implemented to be as fast as possible. It is recommended that the state be calculated and cached in UserInterfaceDisplayData(UserInterfaceSection, RenderContent[]) and the cached value returned here.
See Also
Reference
IUserInterfaceSection Interface
Rhino.Render.UI Namespace