RhinoCommon API
FileIgsWriteOptions.IgesVersion Property
Version of IGES spec to write
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileIgsWriteOptions.IgeswVersionMode IgesVersion { get; set; }
Public Property IgesVersion As FileIgsWriteOptions.IgeswVersionMode
	Get
	Set
Property Value
Type: FileIgsWriteOptions.IgeswVersionMode
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace