RhinoCommon API
TransformObjectList.Count Property
 Number of elements in this list
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace