RhinoCommon API
TransformObjectList.GripOwnerCount Property
 Number of elements in grip owner list
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int GripOwnerCount { get; }
Public ReadOnly Property GripOwnerCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace