RhinoCommon API
BrepTrim.Brep Property
 Gets the Brep that owns this trim.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace