RhinoCommon API
RhinoAccoountsProgressInfo.Metadata Property
 Any metadata of interest that may be used by the caller of a task.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Dictionary<Object, Object> Metadata { get; }
Public ReadOnly Property Metadata As Dictionary(Of Object, Object)
	Get
Property Value
Type: Dictionary<Object, Object>
See Also
Reference
RhinoAccoountsProgressInfo Class
Rhino.Runtime.RhinoAccounts Namespace