RhinoCommon API
HiddenLineDrawingSegment.CurveSideFills Property
 The SideFill fields are only valid for visible curves. With respect to the HiddenLineDrawing, the region to the left (or right respectively) of this curve is described by CurveSideFills[0] or CurveSideFills[1], respectively. If exactly one of these regions is empty this is a scene silhouette. If this region contains a surface it is either a surface which in 3-D is adjacent to this edge or it an surface that is further away from the camera, we call this a shadow surface. unknown is used for unset values and for projecting curves
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public HiddenLineDrawingSegment.SideFill[] CurveSideFills { get; }
Public ReadOnly Property CurveSideFills As HiddenLineDrawingSegment.SideFill()
	Get
Property Value
Type: HiddenLineDrawingSegment.SideFill[]
See Also
Reference
HiddenLineDrawingSegment Class
Rhino.Geometry Namespace