RhinoCommon API
DisplayPipelineAttributes.ControlPolygonShow Property
 Shows the control polygon and only shows the control points.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ControlPolygonShow { get; set; }
Public Property ControlPolygonShow As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace