RhinoCommon API
SubDToBrepOptions.Default Property
 Default SubDToBrepOptions settings. Currently selects the same options as DefaultUnpacked: Locally-G1 smoothing of extraordinary vertices, unpacked faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static SubDToBrepOptions Default { get; }
Public Shared ReadOnly Property Default As SubDToBrepOptions
	Get
Property Value
Type: SubDToBrepOptions
Remarks
 These are the settings used by ON_SubD::BrepForm()
See Also
Reference
SubDToBrepOptions Class
Rhino.Geometry Namespace