RhinoCommon API
ThicknessAnalysisSettings.ShowIsoCurves Property
 Get or sets the display of surface isocurves.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool ShowIsoCurves { get; set; }
Public Shared Property ShowIsoCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ThicknessAnalysisSettings Class
Rhino.ApplicationSettings Namespace