RhinoCommon API
RhinoObjectAnalysisModeChangedEventArgs.AnalysisModeId Property
 The id of the visual analysis mode.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Guid AnalysisModeId { get; }
Public ReadOnly Property AnalysisModeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoObjectAnalysisModeChangedEventArgs Class
Rhino.DocObjects Namespace