RhinoCommon API
RhinoDoc.UndoRecordingIsActive Property
 true if undo recording is actually happening now.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool UndoRecordingIsActive { get; }
Public ReadOnly Property UndoRecordingIsActive As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace