RhinoCommon API
ContentUuids.PerlinMarbleTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.PerlinMarbleTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid PerlinMarbleTextureType { get; }
Public Shared ReadOnly Property PerlinMarbleTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace