RhinoCommon API
DirectionAnalysisSettingsState.U Property
 Gets or sets whether to display the U dir.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool U { get; set; }
Public Property U As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DirectionAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace