RhinoCommon API
MeshCheckParameters.NonManifoldEdgeCount Property
 Gets the total number of non-manifold edges for all meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int NonManifoldEdgeCount { get; }
Public ReadOnly Property NonManifoldEdgeCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace