RhinoCommon API
DimensionStyle.LeaderLandingLength Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderLandingLength"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double LeaderLandingLength { get; set; }
Public Property LeaderLandingLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace