RhinoCommon API
DisplayPipelineAttributes.ShowPointClouds Property
Show point clouds.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public bool ShowPointClouds { get; set; }
Public Property ShowPointClouds As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace