RhinoCommon API
Mesh.Mapping Property
 Get the mapping for this mesh.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public MappingChannelCollection Mapping { get; }
Public ReadOnly Property Mapping As MappingChannelCollection
	Get
Property Value
Type: MappingChannelCollection
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace
Mesh.Mappings