RhinoCommon API
DisplayPipelineAttributes.PointCloudStyle Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.PointCloudStyle"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public PointStyle PointCloudStyle { get; set; }
Public Property PointCloudStyle As PointStyle
	Get
	Set
Property Value
Type: PointStyle
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace