RhinoCommon API
DisplayPipelineAttributes.ShowSurfaceNakedEdge Property
 Turn Surface Naked Edge visibility on or off
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public bool ShowSurfaceNakedEdge { get; set; }
Public Property ShowSurfaceNakedEdge As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace