RhinoCommon API
Triangle3d.AltitudeB Property
 Gets the altitude line starting at corner B.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Line AltitudeB { get; }
Public ReadOnly Property AltitudeB As Line
	Get
Property Value
Type: Line
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace