RhinoCommon API
FileDwgWriteOptions.SimplifyTolerance Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgWriteOptions.SimplifyTolerance"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double SimplifyTolerance { get; set; }
Public Property SimplifyTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace