RhinoCommon API
FileX3dvWriteOptions.ExportTextureCoordinates Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileX3dvWriteOptions.ExportTextureCoordinates"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ExportTextureCoordinates { get; set; }
Public Property ExportTextureCoordinates As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileX3dvWriteOptions Class
Rhino.FileIO Namespace