RhinoCommon API
RenderContent.TypeName Property
 Name for your content type. i.e., "My .net Texture"
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public abstract string TypeName { get; }
Public MustOverride ReadOnly Property TypeName As String
	Get
Property Value
Type: String
See Also
Reference
RenderContent Class
Rhino.Render Namespace