RhinoCommon API
FileGltfWriteOptions.MapZToY Property
 Setting to transform Rhino's Z axis to glTF's Y axis
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public bool MapZToY { get; set; }
Public Property MapZToY As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace