RhinoCommon API
FileStlReadOptions.SplitDisjointMeshes Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileStlReadOptions.SplitDisjointMeshes"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SplitDisjointMeshes { get; set; }
Public Property SplitDisjointMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileStlReadOptions Class
Rhino.FileIO Namespace