RhinoCommon API
DisplayPipelineAttributes.SubDSmoothInteriorColorReduction Property
 Color reduction percentage
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public int SubDSmoothInteriorColorReduction { get; set; }
Public Property SubDSmoothInteriorColorReduction As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace