RhinoCommon API
PageViewPropertiesChangeEventArgs.PageView Property
 Gets the Rhino page view.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public RhinoPageView PageView { get; }
Public ReadOnly Property PageView As RhinoPageView
	Get
Property Value
Type: RhinoPageView
See Also
Reference
PageViewPropertiesChangeEventArgs Class
Rhino.Display Namespace