RhinoCommon API
PersistentSettings.HiddenFromUserInterface Property
 If false then values will appear in the EditOptions window
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool HiddenFromUserInterface { get; set; }
Public Property HiddenFromUserInterface As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PersistentSettings Class
Rhino Namespace