RhinoCommon API
AppearanceSettingsState.SelectedObjectColor Property
 The color used to draw selected objects. The default is yellow, but this can be customized by the user.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color SelectedObjectColor { get; set; }
Public Property SelectedObjectColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace