RhinoCommon API
SubDCreationOptions.MaximumConvexCornerEdgeCount Property
 If ConvexCornerTest == ConvexCornerOption.AtMeshCorner, then an input mesh boundary vertex becomes a SubD corner when the number of edges that end at the vertex is <= MaximumConvexCornerEdgeCount edges and the corner angle is <= MaximumConvexCornerAngleRadians.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public uint MaximumConvexCornerEdgeCount { get; set; }
Public Property MaximumConvexCornerEdgeCount As UInteger
	Get
	Set
Property Value
Type: UInt32
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace