RhinoCommon API
DisplayConduit.Enabled Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayConduit.Enabled"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace