RhinoCommon API
File3dm.Materials Property
Note: This API is now obsolete.
 Materials in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use the new AllMaterials property")]
public IList<Material> Materials { get; }
<ObsoleteAttribute("Use the new AllMaterials property")>
Public ReadOnly Property Materials As IList(Of Material)
	Get
Property Value
Type: IList<Material>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace