RhinoCommon API
ViewCaptureSettings.DrawMargins Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawMargins"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DrawMargins { get; set; }
Public Property DrawMargins As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace