RhinoCommon API
Font.FamilyPlusFaceName Property
 Returns concatenated Family and Face names
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.9
Syntax
public string FamilyPlusFaceName { get; }
Public ReadOnly Property FamilyPlusFaceName As String
	Get
Property Value
Type: String
See Also
Reference
Font Class
Rhino.DocObjects Namespace