RhinoCommon API
ContentUuids.BlendMaterialCCI Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.BlendMaterialCCI"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid BlendMaterialCCI { get; }
Public Shared ReadOnly Property BlendMaterialCCI As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace