RhinoCommon API
GumballSettingsState.TipLength Property
 Specifies the length of the direction arrows in pixels.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int TipLength { get; set; }
Public Property TipLength As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace