RhinoCommon API
GripsDrawEventArgs.SelectedGripColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripsDrawEventArgs.SelectedGripColor"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color SelectedGripColor { get; set; }
Public Property SelectedGripColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace