RhinoCommon API
DimensionStyle.LengthResolution Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LengthResolution"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int LengthResolution { get; set; }
Public Property LengthResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace