RhinoCommon API
PersistentSettingsEventArgs.Cancel Property
[Missing <summary> documentation for "P:Rhino.PersistentSettingsEventArgs.Cancel"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Cancel { get; set; }
Public Property Cancel As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PersistentSettingsEventArgs Class
Rhino Namespace