RhinoCommon API
DimensionStyle.DrawForward Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DrawForward"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DrawForward { get; set; }
Public Property DrawForward As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace