RhinoCommon API
PageViewGroupTableEventArgs.OldState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.PageViewGroupTableEventArgs.OldState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PageViewGroup OldState { get; }
Public ReadOnly Property OldState As PageViewGroup
	Get
Property Value
Type: PageViewGroup
See Also
Reference
PageViewGroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace