RhinoCommon API
RenderContent.GroupId Property
 Group ID of the content
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.26
Syntax
public Guid GroupId { get; set; }
Public Property GroupId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
RenderContent Class
Rhino.Render Namespace