RhinoCommon API
DisplayModeDescription.WireframeId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.WireframeId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid WireframeId { get; }
Public Shared ReadOnly Property WireframeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace