RhinoCommon API
ModelAidSettingsState.ProjectToCPlaneInPlanParallelViews Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettingsState.ProjectToCPlaneInPlanParallelViews"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ProjectToCPlaneInPlanParallelViews { get; set; }
Public Property ProjectToCPlaneInPlanParallelViews As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace