RhinoCommon API
Arc.Center Property
 Gets or sets the center point for this arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d Center { get; set; }
Public Property Center As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Arc Structure
Rhino.Geometry Namespace