RhinoCommon API
DisplayMaterial.BackTransparency Property
 Gets or sets the transparency of the back side material (0.0 = opaque to 1.0 = transparent)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double BackTransparency { get; set; }
Public Property BackTransparency As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace