RhinoCommon API
VolumeMassProperties.CentroidCoordinatesSecondMomentsError Property
 Uncertainty in centroid coordinates second moments calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d CentroidCoordinatesSecondMomentsError { get; }
Public ReadOnly Property CentroidCoordinatesSecondMomentsError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace