RhinoCommon API
SubDToBrepOptions.PackFaces Property
 Get or sets the pack faces option.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool PackFaces { get; set; }
Public Property PackFaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SubDToBrepOptions Class
Rhino.Geometry Namespace