RhinoCommon API
Circle.Circumference Property
 Gets or sets the circumference of this circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Circumference { get; set; }
Public Property Circumference As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Circle Structure
Rhino.Geometry Namespace