RhinoCommon API
ZebraAnalysisSettings.VerticalStripes Property
 Set to true for vertical stripes, or false for horizontal stripes.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public static bool VerticalStripes { get; set; }
Public Shared Property VerticalStripes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ZebraAnalysisSettings Class
Rhino.ApplicationSettings Namespace