RhinoCommon API
FileIgsWriteOptions.Sender Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.Sender"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string Sender { get; set; }
Public Property Sender As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace