RhinoCommon API
DisplayPipelineAttributes.ClippingShadeColor Property
 Clipping plane solid color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public Color ClippingShadeColor { get; set; }
Public Property ClippingShadeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace