RhinoCommon API
Dimension.FixedExtensionLength Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.FixedExtensionLength"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double FixedExtensionLength { get; set; }
Public Property FixedExtensionLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace