RhinoCommon API
CursorTooltipSettings.TextColor Property
Tooltip text color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color TextColor { get; set; }
Public Shared Property TextColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace