RhinoCommon API
AnnotationBase.AnnotationType Property
 Type of annotation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual AnnotationType AnnotationType { get; }
Public Overridable ReadOnly Property AnnotationType As AnnotationType
	Get
Property Value
Type: AnnotationType
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace