RhinoCommon API
Leader.LeaderArrowBlockId Property
 Id of the block used as the arrow for the leader when the arrow type is 'User arrow'
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid LeaderArrowBlockId { get; set; }
Public Property LeaderArrowBlockId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Leader Class
Rhino.Geometry Namespace