RhinoCommon API
GetCurve.UseEndTangent Property
 When true, an interpolated curve ends tangent to EndTangent. Default is false. Ignored on a closed curve unless Sharp is true, and ignored while SubDFriendly is true. The getter offers its EndTangent option to the user only at degree 3 with SubDFriendly off; a tangent set here still applies at any degree.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UseEndTangent { get; set; }
Public Property UseEndTangent As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace