RhinoCommon API
RhinoDoc.Worksession Property
 Provides access to the document's worksession.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Worksession Worksession { get; }
Public ReadOnly Property Worksession As Worksession
	Get
Property Value
Type: Worksession
See Also
Reference
RhinoDoc Class
Rhino Namespace