RhinoCommon API
PhysicallyBasedMaterial.Emission Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.Emission"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Color4f Emission { get; set; }
Public Property Emission As Color4f
	Get
	Set
Property Value
Type: Color4f
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace