RhinoCommon API
DimensionStyle.IsReference Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.IsReference"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override bool IsReference { get; }
Public Overrides ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace