RhinoCommon API
PointCloud.ContainsColors Property
 Gets a value indicating whether or not the points in this point cloud have colors assigned to them.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ContainsColors { get; }
Public ReadOnly Property ContainsColors As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace