RhinoCommon API
FileDwgWriteOptions.Simplify Property
use lines and arcs where possible
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Simplify { get; set; }
Public Property Simplify As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace