RhinoCommon API
LicenseStatus.LicenseTitle Property
The title of the license. (e.g. "Rhinoceros 6.0 Commercial")
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string LicenseTitle { get; set; }
Public Property LicenseTitle As String
	Get
	Set
Property Value
Type: String
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace