RhinoCommon API
FileUsdWriteOptions.MeshingParameters Property
 Leaving this empty will not insert a Prim
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public MeshingParameters MeshingParameters { get; set; }
Public Property MeshingParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
See Also
Reference
FileUsdWriteOptions Class
Rhino.FileIO Namespace