RhinoCommon API
Hatch.PatternRotation Property
 Gets or sets the relative rotation of the pattern.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double PatternRotation { get; set; }
Public Property PatternRotation As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Hatch Class
Rhino.Geometry Namespace