RhinoCommon API
File3dmDisplacement.MeshMemoryLimit Property
 Specifies in megabytes how much memory can be allocated for use by the displacement mesh.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int MeshMemoryLimit { get; set; }
Public Property MeshMemoryLimit As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace