RhinoCommon API
DisplayPipelineAttributes.SubDNonManifoldApplyPattern Property
 Apply pattern to the edge
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public bool SubDNonManifoldApplyPattern { get; set; }
Public Property SubDNonManifoldApplyPattern As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace