RhinoCommon API
GumballSettings.TipWidth Property
 Specifies the width of the direction arrows in pixels.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int TipWidth { get; set; }
Public Shared Property TipWidth As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace