RhinoCommon API
GrasshopperDisplayMaterial.Striping Property
 Gets or sets whether the G2 striping overlay is applied. Default: false.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Striping { get; set; }
Public Property Striping As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GrasshopperDisplayMaterial Class
Rhino.Display Namespace