RhinoCommon API
LinearDimension.ExtensionLine2End Property
 End of the second extension line.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point2d ExtensionLine2End { get; set; }
Public Property ExtensionLine2End As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace