RhinoCommon API
RhinoObject.InstanceDefinitionModelSerialNumber Property
 When a component is in a model as part of the information required for a linked instance definition, this value identifies the linked instance definition reference model.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public override uint InstanceDefinitionModelSerialNumber { get; }
Public Overrides ReadOnly Property InstanceDefinitionModelSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Remarks
 Reference components are not saved in .3dm archives. Typically this value is set and locked by the code that adds a component to a model. This value is not saved in .3dm archives.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace