RhinoCommon API
SmartTrackSettingsState.GuideColor Property
 Gets or sets the active guide color
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public Color GuideColor { get; set; }
Public Property GuideColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace