RhinoCommon API
PageViewPropertiesChangeEventArgs.Document Property
 Gets the Rhino document.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
PageViewPropertiesChangeEventArgs Class
Rhino.Display Namespace