RhinoCommon API
PostEffectData.On Property
 The 'on' state of this post effect.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool On { get; set; }
Public Property On As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PostEffectData Class
Rhino.Render.PostEffects Namespace