RhinoCommon API
IOpenIDConnectToken.Phone Property
 The phone of the user this token represents.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
string Phone { get; }
ReadOnly Property Phone As String
	Get
Property Value
Type: String
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace