RhinoCommon API
Material.IsDeleted Property
 Deleted materials are kept in the runtime material table so that undo will work with materials. Call IsDeleted to determine to determine if a material is deleted.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override bool IsDeleted { get; }
Public Overrides ReadOnly Property IsDeleted As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Material Class
Rhino.DocObjects Namespace