RhinoCommon API
LightTable.Skylight Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTable.Skylight"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Skylight Skylight { get; }
Public ReadOnly Property Skylight As Skylight
	Get
Property Value
Type: Skylight
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace