RhinoCommon API
FileDwgWriteOptions.UseLWPolylines Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgWriteOptions.UseLWPolylines"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool UseLWPolylines { get; set; }
Public Property UseLWPolylines As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace