RhinoCommon API
RenderMeshProviderProgress.Text Property
 Return a textural progress report
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RenderMeshProviderProgress Class
Rhino.Render.CustomRenderMeshes Namespace