RhinoCommon API
AppearanceSettingsState.CommandPromptFontName Property
Name of the font used in the command prompt
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string CommandPromptFontName { get; set; }
Public Property CommandPromptFontName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace