RhinoCommon API
FileGHSReadOptions.ViewType Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileGHSReadOptions.ViewType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileGHSReadOptions.ReadViewType ViewType { get; set; }
Public Property ViewType As FileGHSReadOptions.ReadViewType
	Get
	Set
Property Value
Type: FileGHSReadOptions.ReadViewType
See Also
Reference
FileGHSReadOptions Class
Rhino.FileIO Namespace