RhinoCommon API
FileSettings.SearchPathCount Property
 Gets the amount of search paths that are currently defined.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int SearchPathCount { get; }
Public Shared ReadOnly Property SearchPathCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace