RhinoCommon API
EndAnalysisSettings.ClosedSeams Property
 Gets or sets whether to display the closed curve seam points.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool ClosedSeams { get; set; }
Public Shared Property ClosedSeams As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
EndAnalysisSettings Class
Rhino.ApplicationSettings Namespace