RhinoCommon API
DrawEventArgs.Display Property
[Missing <summary> documentation for "P:Rhino.Display.DrawEventArgs.Display"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DisplayPipeline Display { get; }
Public ReadOnly Property Display As DisplayPipeline
	Get
Property Value
Type: DisplayPipeline
See Also
Reference
DrawEventArgs Class
Rhino.Display Namespace