RhinoCommon API
TaskCompleteEventArgs.Doc Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.TaskCompleteEventArgs.Doc"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoDoc Doc { get; set; }
Public Property Doc As RhinoDoc
	Get
	Set
Property Value
Type: RhinoDoc
See Also
Reference
TaskCompleteEventArgs Class
Rhino.Input.Custom Namespace