RhinoCommon API
File3dmRenderContent.IsTopLevel Property
True if this is a top-level render content (i.e., has no parent; is not a child).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsTopLevel { get; }
Public ReadOnly Property IsTopLevel As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace