RhinoCommon API
LengthUnit.Symbol Property
Non localized unit symbol string.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Symbol { get; }
Public ReadOnly Property Symbol As String
	Get
Property Value
Type: String
See Also
Reference
LengthUnit Structure
Rhino Namespace