RhinoCommon API
RhinoApp.ValidationGracePeriodDaysLeft Property
 Returns number of days within which validation must occur. Zero when validation grace period has expired. Raises InvalidLicenseTypeException if LicenseType is one of: EvaluationSaveLimited EvaluationTimeLimited Viewer Unknown
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public static int ValidationGracePeriodDaysLeft { get; }
Public Shared ReadOnly Property ValidationGracePeriodDaysLeft As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoApp Class
Rhino Namespace