RhinoCommon API
File3dmEmbeddedFile.Filename Property
the fully-qualified filename of the embedded file. This filename may or may not refer to a local file depending on the way the embedded file was loaded. For example, if it was loaded from an archive, the filename could be that of a file on a different computer.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string Filename { get; }
Public ReadOnly Property Filename As String
	Get
Property Value
Type: String
See Also
Reference
File3dmEmbeddedFile Class
Rhino.FileIO Namespace