RhinoCommon API
RhinoDoc.GroundPlane Property
Note: This API is now obsolete.
Gets the ground plane of this document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute]
public GroundPlane GroundPlane { get; }
<ObsoleteAttribute>
Public ReadOnly Property GroundPlane As GroundPlane
	Get
Property Value
Type: GroundPlane
Exceptions
Exception | Condition
RdkNotLoadedException | If the RDK is not loaded.
See Also
Reference
RhinoDoc Class
Rhino Namespace