RhinoCommon API
DimensionStyle.AngularRoundoff Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AngularRoundoff"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double AngularRoundoff { get; set; }
Public Property AngularRoundoff As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace