RhinoCommon API
FileIgsWriteOptions.FlagDependentSurfacesAs03 Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.FlagDependentSurfacesAs03"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool FlagDependentSurfacesAs03 { get; set; }
Public Property FlagDependentSurfacesAs03 As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace