RhinoCommon API
HatchLine.DashCount Property
 Gets the number of dashes + gaps in this line.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int DashCount { get; }
Public ReadOnly Property DashCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
HatchLine Class
Rhino.DocObjects Namespace