RhinoCommon API
SmartTrackSettingsState.SmartTangents Property
Gets or sets a value indicating if the 'Smart Tangents' feature is active.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool SmartTangents { get; set; }
Public Property SmartTangents As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace