RhinoCommon API
UserInterfaceTextBox.BorderColor Property
 Color of the outline around the box. Color.Empty, the default, means use the standard color for the theme that is in use. The outline is drawn thicker and brighter while the box has keyboard focus, whatever color it is given.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color BorderColor { get; set; }
Public Property BorderColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace