RhinoCommon API
ViewportInfo.IsFrustumLeftRightSymmetric Property
 Gets or sets a value that indicates whether the camera frustum has a vertical symmetry axis.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsFrustumLeftRightSymmetric { get; set; }
Public Property IsFrustumLeftRightSymmetric As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace