RhinoCommon API
DimStyleTableEventArgs.OldState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTableEventArgs.OldState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle OldState { get; }
Public ReadOnly Property OldState As DimensionStyle
	Get
Property Value
Type: DimensionStyle
See Also
Reference
DimStyleTableEventArgs Class
Rhino.DocObjects.Tables Namespace