RhinoCommon API
LicenseStatus.RegisteredOwner Property
The registered owner of the product. (e.g. "Dale Fugier")
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string RegisteredOwner { get; set; }
Public Property RegisteredOwner As String
	Get
	Set
Property Value
Type: String
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace