RhinoCommon API
File3dmViewTable.Count Property
 Gets the amount of items in the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace