RhinoCommon API
LinetypeTable.Item Property
 Conceptually, the linetype table is an array of linetypes. The operator[] can be used to get individual linetypes. A linetype is either active or deleted and this state is reported by Linetype.IsDeleted.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Linetype this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As Linetype
	Get
Parameters
index
Type: System.Int32
zero based array index.
Return Value
Type: Linetype
 Reference to the linetype. If index is out of range, the current linetype is returned. Note that this reference may become invalid after AddLinetype() is called.
Remarks
 Detaching a worksession reference model, or purging a linked instance definition, removes its linetypes but leaves the table slots they occupied empty; the slots cannot be closed up, because table indices are persistent references that objects store. Count spans the empty slots and they accumulate for the life of the document. An index that lands on one returns the continuous line pattern rather than throwing, and nothing about it says it is a stand-in except its index, which is -1 and never the index you asked for - so test index == Linetypes[index].Index before treating an entry as real. Enumerating the table with foreach goes through the document manifest rather than the raw table array, so it does not visit empty slots at all. See RH-97389.
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace