RhinoCommon API
ObjectAttributes.HatchBoundaryPlotWeightMillimeters Property
 Plot width of hatch boundary curves. values less than -1 (-10 is default): plot weight is determined by the m_plot_weight -1: do not plot 0: use default weight defined by the print dialog positive values are thicknesses in millimeters to print to
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double HatchBoundaryPlotWeightMillimeters { get; set; }
Public Property HatchBoundaryPlotWeightMillimeters As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace