RhinoCommon API
ViewInfo.FocalBlurDistance Property
 Gets or sets the Focal blur distance of the active viewport
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double FocalBlurDistance { get; set; }
Public Property FocalBlurDistance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace