RhinoCommon API
ChooseOneObjectSettingsState.DynamicHighlight Property
DynamicHighlight
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool DynamicHighlight { get; set; }
Public Property DynamicHighlight As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace