RhinoCommon API
Cylinder.IsFinite Property
 true if the cylinder is finite (Height0 != Height1) false if the cylinder is infinite.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsFinite { get; }
Public ReadOnly Property IsFinite As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace