RhinoCommon API
NurbsCurveFitParameters.ConstrainedPointCount Property
 If Closed() is true, the number of constrained points is (TangentMatchStart() || TangentMatchEnd() ? 1 : 0) + (TangentMatchStart()?1:0) + (TangentMatchEnd()?1:0). If Closed() is false, the number of constrained points is 2 + (SubDFriendly() ? 2 : 0) + (TangentMatchStart()?1:0) + (TangentMatchEnd()?1:0).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int ConstrainedPointCount { get; }
Public ReadOnly Property ConstrainedPointCount As Integer
	Get
Return Value
Type: Int32
 Number of constrained points.
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace