RhinoCommon API
PlugIn.UnknownUserDataEventArgs.PlugInId Property
[Missing <summary> documentation for "P:Rhino.PlugIns.PlugIn.UnknownUserDataEventArgs.PlugInId"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.17
Syntax
public Guid PlugInId { get; }
Public ReadOnly Property PlugInId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PlugIn.UnknownUserDataEventArgs Class
Rhino.PlugIns Namespace