RhinoCommon API
UserInterfaceObjectBase.HasKeyboardFocus Property
 Does this object have keyboard focus? An object with keyboard focus gets first refusal on what is typed in a viewport; what it does not use carries on to the command line as usual.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool HasKeyboardFocus { get; }
Public ReadOnly Property HasKeyboardFocus As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace