RhinoCommon API
SubDFace.ControlNetCenterNormal Property
 When the face's control net polygon is planar, the face's control net normal is a unit vector perpendicular to the plane that points outwards. If the control net polygon is not planar, the control net normal is control net normal is a unit vector that is the average of the control polygon's corner normals.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Vector3d ControlNetCenterNormal { get; }
Public ReadOnly Property ControlNetCenterNormal As Vector3d
	Get
Return Value
Type: Vector3d
 A unit vector that is normal to planar control net polygons and a good compromise for nonplanar control net polygons.
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace