RhinoCommon API
NurbsCurveFitParameters.MinimumDegree Property
 The minimum degree of the fit
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int MinimumDegree { get; }
Public Shared ReadOnly Property MinimumDegree As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace