RhinoCommon API
GetCone.AroundDirectionMinimumCount Property
 The minimum number of faces in the around direction.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int AroundDirectionMinimumCount { get; set; }
Public Property AroundDirectionMinimumCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace