RhinoCommon API
RenderMeshProviderProgress.IsComplete Property
 true if complete, otherwise false.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsComplete { get; set; }
Public Property IsComplete As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderMeshProviderProgress Class
Rhino.Render.CustomRenderMeshes Namespace