RhinoCommon API
TwistSpaceMorph.InfiniteTwist Property
 If true, the deformation is constant throughout the object, even if the axis is shorter than the object. If false, the deformation takes place only the length of the axis.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public bool InfiniteTwist { get; set; }
Public Property InfiniteTwist As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TwistSpaceMorph Class
Rhino.Geometry.Morphs Namespace