RhinoCommon API
PageViewGroupTableEventArgs.NewState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.PageViewGroupTableEventArgs.NewState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public PageViewGroup NewState { get; }
Public ReadOnly Property NewState As PageViewGroup
	Get
Property Value
Type: PageViewGroup
See Also
Reference
PageViewGroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace