RhinoCommon API
RhinoAccountsGroup.Name Property
 The name of the group. The name can be changed at anytime by group members.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
RhinoAccountsGroup Class
Rhino.Runtime.RhinoAccounts Namespace