RhinoCommon API
File3dmEdgeSoftening.Faceted Property
 Specifies whether the edges are faceted.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Faceted { get; set; }
Public Property Faceted As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmEdgeSoftening Class
Rhino.FileIO Namespace