RhinoCommon API
AppearanceSettings.ShowStatusBar Property
 Shows or hides the status bar user interface.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool ShowStatusBar { get; set; }
Public Shared Property ShowStatusBar As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace