RhinoCommon API
FileIgsWriteOptions.PointType Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.PointType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileIgsWriteOptions.PointObjectsMode PointType { get; set; }
Public Property PointType As FileIgsWriteOptions.PointObjectsMode
	Get
	Set
Property Value
Type: FileIgsWriteOptions.PointObjectsMode
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace