RhinoCommon API
Quaternion.Zero Property
 Returns the default quaternion, where all coefficients are 0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Quaternion Zero { get; }
Public Shared ReadOnly Property Zero As Quaternion
	Get
Property Value
Type: Quaternion
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace