RhinoCommon API
IOpenIDConnectToken.IsUpdated Property
 true if the token has been updated; false otherwise.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
bool IsUpdated { get; }
ReadOnly Property IsUpdated As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace