RhinoCommon API
Cylinder.Axis Property
 Gets the axis direction of the cylinder.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d Axis { get; }
Public ReadOnly Property Axis As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace