RhinoCommon API
UserInterfaceControl.TextColor Property
 Color used to draw the text. Color.Empty, the default, means use the standard text color for the theme that is in use.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color TextColor { get; set; }
Public Property TextColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
UserInterfaceControl Class
Rhino.UI Namespace