RhinoCommon API
ColorXYZ.Y Property
 Gets or set the Y channel value. Channel will be limited to 0~1.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Y { get; set; }
Public Property Y As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace