RhinoCommon API
UserInterfaceGrid.RowSpacing Property
 Space between rows in logical pixels. The default is 2.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double RowSpacing { get; set; }
Public Property RowSpacing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace