RhinoCommon API
DisplayPipelineAttributes.SurfaceEdgeApplyPattern Property
 Turn pattern application on or off
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public bool SurfaceEdgeApplyPattern { get; set; }
Public Property SurfaceEdgeApplyPattern As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace