RhinoCommon API
RenderPlugIn.SupportedChannels Property
 Override to communicate that the renderer supports more channels beside the default channels RGBA, Depth, Normal, Albedo. See RenderWindow.StandardChannels. RenderWindow.ChannelId can be used to get the GUIDs for the channels to support
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual Guid[] SupportedChannels { get; }
Protected Overridable ReadOnly Property SupportedChannels As Guid()
	Get
Property Value
Type: Guid[]
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace