RhinoCommon API
CustomRenderContentAttribute.RenderEngineId Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.RenderEngineId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid RenderEngineId { get; }
Public ReadOnly Property RenderEngineId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace