RhinoCommon API
StackedDialogPage.HasChildren Property
 Will be true if this page contains sub pages.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool HasChildren { get; }
Public ReadOnly Property HasChildren As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace