RhinoCommon API
RhinoDoc.SectionStyles Property
 Collection of section styles in this document
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SectionStyleTable SectionStyles { get; }
Public ReadOnly Property SectionStyles As SectionStyleTable
	Get
Property Value
Type: SectionStyleTable
See Also
Reference
RhinoDoc Class
Rhino Namespace