RhinoCommon API
FileSettings.TemplateFolder Property
Returns or sets the location of Rhino's template files.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string TemplateFolder { get; set; }
Public Shared Property TemplateFolder As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace