RhinoCommon API
FileGHSReadOptions.AttachGhsData Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileGHSReadOptions.AttachGhsData"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool AttachGhsData { get; set; }
Public Property AttachGhsData As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileGHSReadOptions Class
Rhino.FileIO Namespace