RhinoCommon API
RenderContentKindList.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentKindList.CppPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RenderContentKindList Class
Rhino.Render Namespace