RhinoCommon API
ViewSettingsState.ViewRotation Property
 Gets or sets the view rotation value.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.1
Syntax
public ViewSettings.ViewRotationStyle ViewRotation { get; set; }
Public Property ViewRotation As ViewSettings.ViewRotationStyle
	Get
	Set
Property Value
Type: ViewSettings.ViewRotationStyle
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace