RhinoCommon API
AppearanceSettings.CommandPromptPosition Property
 Gets or sets the command prompt position.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static CommandPromptPosition CommandPromptPosition { get; set; }
Public Shared Property CommandPromptPosition As CommandPromptPosition
	Get
	Set
Property Value
Type: CommandPromptPosition
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace