RhinoCommon API
Mesh.HasCachedTextureCoordinates Property
 Will return true if SetCachedTextureCoordinates has been called; otherwise will return false.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public bool HasCachedTextureCoordinates { get; }
Public ReadOnly Property HasCachedTextureCoordinates As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Mesh Class
Rhino.Geometry Namespace