RhinoCommon API
StringParserSettings.DefaultLengthUnitSystem Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.DefaultLengthUnitSystem"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public UnitSystem DefaultLengthUnitSystem { get; set; }
Public Property DefaultLengthUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace