RhinoCommon API
ReduceMeshParameters.Error Property
[Missing <summary> documentation for "P:Rhino.Geometry.ReduceMeshParameters.Error"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Error { get; }
Public ReadOnly Property Error As String
	Get
Property Value
Type: String
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace