RhinoCommon API
Decal.VectorUp Property
 For cylindrical and spherical mapping, the vector is unitized.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public Vector3d VectorUp { get; set; }
Public Property VectorUp As Vector3d
	Get
	Set
Return Value
Type: Vector3d
The 'up' vector of the decal. For planar mapping the length of the vector is relevant.
See Also
Reference
Decal Class
Rhino.Render Namespace