RhinoCommon API
RhinoViewport.IsValidCamera Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.IsValidCamera"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsValidCamera { get; }
Public ReadOnly Property IsValidCamera As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace