RhinoCommon API
File3dm.RenderMaterials Property
 The render materials in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmRenderMaterials RenderMaterials { get; }
Public ReadOnly Property RenderMaterials As File3dmRenderMaterials
	Get
Property Value
Type: File3dmRenderMaterials
See Also
Reference
File3dm Class
Rhino.FileIO Namespace