RhinoCommon API
DisplayPipelineAttributes.SubDReflectionAxisLineColor Property
 Reflection axis line color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public Color SubDReflectionAxisLineColor { get; set; }
Public Property SubDReflectionAxisLineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace