RhinoCommon API
Point2dField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Point2d Value { get; set; }
Public Property Value As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
Point2dField Class
Rhino.Render.Fields Namespace