RhinoCommon API
File3dmSettings.ActiveViewId Property
 The viewport id of the view that is active when the model is opened. When this is nil Rhino activates the first view in the view table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public Guid ActiveViewId { get; set; }
Public Property ActiveViewId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace