RhinoCommon API
ContentUuids.ResampleTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.ResampleTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid ResampleTextureType { get; }
Public Shared ReadOnly Property ResampleTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace