RhinoCommon API
AnimationProperties.LightIndex Property
 Internal value used while previewing animation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public int LightIndex { get; set; }
Public Property LightIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace