RhinoCommon API
AppearanceSettingsState.LockedObjectColor Property
Gets or sets the color used to draw locked objects.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color LockedObjectColor { get; set; }
Public Property LockedObjectColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace