RhinoCommon API
GumballSettings.YAxisColor Property
 Specifies the gumball y axis color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Color YAxisColor { get; set; }
Public Shared Property YAxisColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace