RhinoCommon API
Field.Name Property
 Field name value string passed to the constructor.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
Field Class
Rhino.Render.Fields Namespace