RhinoCommon API
MeshPart.TriangleCount Property
[Missing <summary> documentation for "P:Rhino.Geometry.MeshPart.TriangleCount"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public int TriangleCount { get; }
Public ReadOnly Property TriangleCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace