RhinoCommon API
DecalCreateParams.Height Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.Height"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace