RhinoCommon API
ModelAidSettingsState.ShiftNudgeKeyStep Property
Gets or sets the Shift-key based nudge step amount.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ShiftNudgeKeyStep { get; set; }
Public Property ShiftNudgeKeyStep As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace