RhinoCommon API
RhinoTransformObjectsEventArgs.GripOwners Property
 An array of Rhino object grip owners that will be changed when the grips are transformed. WARNING: these objects may be deleted at anytime after the event handler has been notified. Do not save references to these objects. Use the object's runtime serial number to safely reference these objects at a later time.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RhinoObject[] GripOwners { get; }
Public ReadOnly Property GripOwners As RhinoObject()
	Get
Property Value
Type: RhinoObject[]
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace