RhinoCommon API
HiddenLineDrawingObject.OccludingSections Property
 Objects in this drawing could have occluding sections. Objects must added with the occluding section option set as desired.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool OccludingSections { get; set; }
Public Property OccludingSections As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
HiddenLineDrawingObject Class
Rhino.Geometry Namespace