RhinoCommon API
RhinoDoc.Snapshots Property
 Collection of snapshots.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public SnapshotTable Snapshots { get; }
Public ReadOnly Property Snapshots As SnapshotTable
	Get
Property Value
Type: SnapshotTable
See Also
Reference
RhinoDoc Class
Rhino Namespace