RhinoCommon API
File3dm.Linetypes Property
Note: This API is now obsolete.
 Linetypes in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use the new AllLinetypes property")]
public IList<Linetype> Linetypes { get; }
<ObsoleteAttribute("Use the new AllLinetypes property")>
Public ReadOnly Property Linetypes As IList(Of Linetype)
	Get
Property Value
Type: IList<Linetype>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace