RhinoCommon API
RebuildCurveOptions.ShowControlPoints Property
 True if the control points of the rebuilt curves are displayed during the dynamic preview.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ShowControlPoints { get; set; }
Public Property ShowControlPoints As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace