RhinoCommon API
SelCommand.TestLights Property
[Missing <summary> documentation for "P:Rhino.Commands.SelCommand.TestLights"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TestLights { get; set; }
Public Property TestLights As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SelCommand Class
Rhino.Commands Namespace