RhinoCommon API
SurfaceCurvature.MaximumPrincipalCurvature Property
 If set, the maximum of kapp1 and kappa2 returned. Otherwise, the quiet NaN is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double MaximumPrincipalCurvature { get; }
Public ReadOnly Property MaximumPrincipalCurvature As Double
	Get
Property Value
Type: Double
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace