RhinoCommon API
RhinoViewport.CameraTarget Property
 Viewport target point.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d CameraTarget { get; }
Public ReadOnly Property CameraTarget As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace