RhinoCommon API
Triangle3d.Area Property
 Gets the area inside this triangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
Property Value
Type: Double
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace