RhinoCommon API
RTree.Count Property
 Gets the number of items in this tree.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RTree Class
Rhino.Geometry Namespace