RhinoCommon API
HistorySettings.RecordNextCommand Property
 Enable history recording until the end of the next command
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool RecordNextCommand { get; set; }
Public Shared Property RecordNextCommand As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
HistorySettings Class
Rhino.ApplicationSettings Namespace