RhinoCommon API
PointCloud.HiddenPointCount Property
 Gets the number of points that have their Hidden flag set.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int HiddenPointCount { get; }
Public ReadOnly Property HiddenPointCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace