RhinoCommon API
IsoDrawEffect.DiscardGap Property
[Missing <summary> documentation for "P:Rhino.Display.IsoDrawEffect.DiscardGap"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool DiscardGap { get; set; }
Public Property DiscardGap As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace