RhinoCommon API
IOpenIDConnectToken.EmailVerified Property
 true if all the emails in the account have been verified; false otherwise.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
bool? EmailVerified { get; }
ReadOnly Property EmailVerified As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace