RhinoCommon API
Point3dField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Point3d Value { get; set; }
Public Property Value As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Point3dField Class
Rhino.Render.Fields Namespace