RhinoCommon API
DimensionStyle.DimRadialTextOrientation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimRadialTextOrientation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextOrientation DimRadialTextOrientation { get; set; }
Public Property DimRadialTextOrientation As TextOrientation
	Get
	Set
Property Value
Type: TextOrientation
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace