RhinoCommon API
SubDEdgeSharpness.Maximum Property
 A sharpness of MaximumValue at both ends. This is the sharpest an edge can be without being a crease.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static SubDEdgeSharpness Maximum { get; }
Public Shared ReadOnly Property Maximum As SubDEdgeSharpness
	Get
Property Value
Type: SubDEdgeSharpness
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace