RhinoCommon API
SweepOneRail.SweepTolerance Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.SweepTolerance"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double SweepTolerance { get; set; }
Public Property SweepTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace