RhinoCommon API
Brep.VariationalPatchResult.G0Int Property
 This value will be not-null if any internal constraints were used. It will be true if those constraints were met within the internal positional tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool? G0Int { get; }
Public ReadOnly Property G0Int As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
See Also
Reference
Brep.VariationalPatchResult Class
Rhino.Geometry Namespace