RhinoCommon API
SweepTwoRail.AngleToleranceRadians Property
 Gets or sets the angle tolerance in radians.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double AngleToleranceRadians { get; set; }
Public Property AngleToleranceRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace