RhinoCommon API
Field.TextureAmountMax Property
 Set Max value for Texture amount
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double TextureAmountMax { get; set; }
Public Property TextureAmountMax As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Field Class
Rhino.Render.Fields Namespace