RhinoCommon API
InstanceReferenceGeometry.Xform Property
Transformation for this reference.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public Transform Xform { get; }
Public ReadOnly Property Xform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
InstanceReferenceGeometry Class
Rhino.Geometry Namespace