RhinoCommon API
GroundPlane.TextureOffset Property
 Get texture offset on the ground plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Vector2d TextureOffset { get; }
Public ReadOnly Property TextureOffset As Vector2d
	Get
Property Value
Type: Vector2d
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace