RhinoCommon API
NamedLayerStateTable.Document Property
 Document that owns this table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
NamedLayerStateTable Class
Rhino.DocObjects.Tables Namespace