RhinoCommon API
ContentUuids.CompositeMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.CompositeMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid CompositeMaterialType { get; }
Public Shared ReadOnly Property CompositeMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace