RhinoCommon API
EmapAnalysisSettingsState.FileName Property
 Gets or sets the current emap file name.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string FileName { get; set; }
Public Property FileName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
EmapAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace