RhinoCommon API
Dimension.ForceDimensionLineBetweenExtensionLines Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ForceDimensionLineBetweenExtensionLines"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.20
Syntax
public bool ForceDimensionLineBetweenExtensionLines { get; set; }
Public Property ForceDimensionLineBetweenExtensionLines As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dimension Class
Rhino.Geometry Namespace