RhinoCommon API
FileGltfWriteOptions.ExportMaterials Property
 Setting to determine whether or not materials are written to the glTF file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public bool ExportMaterials { get; set; }
Public Property ExportMaterials As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace