RhinoCommon API
Environment.BackgroundProjection Property
Return Value
Type: Environment.BackgroundProjections
The background projection.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Environment.BackgroundProjections BackgroundProjection { get; }
Public ReadOnly Property BackgroundProjection As Environment.BackgroundProjections
	Get
Property Value
Type: Environment.BackgroundProjections
See Also
Reference
Environment Class
Rhino.DocObjects Namespace