RhinoCommon API
RenderContent.IsDefaultInstance Property
 Checks if render content is default instance.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsDefaultInstance { get; }
Public ReadOnly Property IsDefaultInstance As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderContent Class
Rhino.Render Namespace