RhinoCommon API
DisplayPointAttributes.PointStyle Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPointAttributes.PointStyle"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public PointStyle? PointStyle { get; set; }
Public Property PointStyle As PointStyle?
	Get
	Set
Property Value
Type: Nullable<PointStyle>
See Also
Reference
DisplayPointAttributes Class
Rhino.Display Namespace