RhinoCommon API
IOpenIDConnectToken.Iat Property
 The date the token was issued.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
DateTime? Iat { get; }
ReadOnly Property Iat As DateTime?
	Get
Property Value
Type: Nullable<DateTime>
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace