RhinoCommon API
ConstructionPlaneGridDefaults.GridThickFrequency Property
 This line frequency. 0: none, 1: all lines are thick, 2: every other is thick, ...
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public int GridThickFrequency { get; set; }
Public Property GridThickFrequency As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ConstructionPlaneGridDefaults Class
Rhino.DocObjects Namespace