RhinoCommon API
FileGltfWriteOptions.CullBackfaces Property
 Setting that determines whether or not the meshes in the glTF will be rendered with or without backface culling. Known as DoubleSided in the glTF specification.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public bool CullBackfaces { get; set; }
Public Property CullBackfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace