RhinoCommon API
CursorTooltipSettingsState.CommandPromptPane Property
 Displays the current command prompt.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool CommandPromptPane { get; set; }
Public Property CommandPromptPane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace