RhinoCommon API
DisplayAttributeMaterial.IndexOfRefraction Property
 Index of refraction.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double IndexOfRefraction { get; set; }
Public Property IndexOfRefraction As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace