RhinoCommon API
CurvatureGraphSettings.SurfaceUHairColor Property
 Gets or sets the surface U hair color;
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Color SurfaceUHairColor { get; set; }
Public Shared Property SurfaceUHairColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
CurvatureGraphSettings Class
Rhino.ApplicationSettings Namespace