RhinoCommon API
Notification.Item Property
 Gets or sets metadata for this instance.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string this[
	string key
] { get; set; }
Public Default Property Item (
	key As String
) As String
	Get
	Set
Parameters
key
Type: System.String
The key to use to get or set metadata.
Return Value
Type: String
null if the key does not map to any metadata; otherwise returns the string representing the metadata.
Exceptions
Exception | Condition
InvalidOperationException | Thrown if the calling assembly cannot modify this instance
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace