RhinoCommon API
Dimension.ExtensionLineOffset Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ExtensionLineOffset"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ExtensionLineOffset { get; set; }
Public Property ExtensionLineOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace