RhinoCommon API
ModelAidSettings.OrthoUseZ Property
 Gets or sets whether Ortho will snap to the CPlane Z axis
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool OrthoUseZ { get; set; }
Public Shared Property OrthoUseZ As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace