RhinoCommon API
PanelIds.Environment Property
 Rhino Environment panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid Environment { get; }
Public Shared ReadOnly Property Environment As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace