RhinoCommon API
DisplayPipelineAttributes.ViewDisplayAttributes.GridFade Property
 The amount the grid fades out towards its edges, from 0.0 (no fade) to 1.0 (full fade).
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public float GridFade { get; set; }
Public Property GridFade As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace