RhinoCommon API
PersistentSettingsSavedEventArgs.PlugInSettings Property
 The old PlugIn settings
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PersistentSettings PlugInSettings { get; }
Public ReadOnly Property PlugInSettings As PersistentSettings
	Get
Property Value
Type: PersistentSettings
See Also
Reference
PersistentSettingsSavedEventArgs Class
Rhino Namespace
PlugIn.Settings
PlugIn.SettingsSaved