RhinoCommon API
DisplayPen.CapStyle Property
 How caps are drawn at the ends of open curves
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public LineCapStyle CapStyle { get; set; }
Public Property CapStyle As LineCapStyle
	Get
	Set
Property Value
Type: LineCapStyle
See Also
Reference
DisplayPen Class
Rhino.Display Namespace