RhinoCommon API
PlugInInfo.WebSite Property
 Returns the web site, or URL, of the organization or company that created the plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string WebSite { get; }
Public ReadOnly Property WebSite As String
	Get
Property Value
Type: String
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace