RhinoCommon API
PointCloudItem.Index Property
 Gets the index of this point cloud item.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace