RhinoCommon API
File3dmSettings.CustomRenderMeshingParameters Property
The meshing parameters stored as the model's custom render mesh settings.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public MeshingParameters CustomRenderMeshingParameters { get; set; }
Public Property CustomRenderMeshingParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace