RhinoCommon API
File3dsWriteOptions.SaveLights Property
[Missing <summary> documentation for "P:Rhino.FileIO.File3dsWriteOptions.SaveLights"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SaveLights { get; set; }
Public Property SaveLights As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dsWriteOptions Class
Rhino.FileIO Namespace