RhinoCommon API
ChooseOneObjectSettingsState.ShowAllOption Property
ShowAllOption
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ShowAllOption { get; set; }
Public Property ShowAllOption As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace