RhinoCommon API
ColorHSL.L Property
 Gets or sets the luminance channel value. Luminance channels are limited to a 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double L { get; set; }
Public Property L As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace