RhinoCommon API
RebuildCurveOptions.InputSpanCountRange Property
 The range of span counts in the input curves. InputDegreeRange.I = minimum input curve span count. InputDegreeRange.J = maximum input curve span count.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IndexPair InputSpanCountRange { get; }
Public ReadOnly Property InputSpanCountRange As IndexPair
	Get
Property Value
Type: IndexPair
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace