RhinoCommon API
ColorCMYK.K Property
 Gets or sets the Key channel value. Key channels are limited to the 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double K { get; set; }
Public Property K As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace