RhinoCommon API
FileIgsWriteOptions.Organization Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileIgsWriteOptions.Organization"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string Organization { get; set; }
Public Property Organization As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace