RhinoCommon API
MeshCurveIntersection.FaceIndices Property
All mesh faces that share this hit, sorted ascending. For a face-interior hit or a 1-valence mesh boundary edge, contains just FaceIndex. For a hit on a shared mesh edge, contains the 2+ faces meeting at that edge. For a vertex hit, contains every face incident to that vertex.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IReadOnlyList<int> FaceIndices { get; }
Public ReadOnly Property FaceIndices As IReadOnlyList(Of Integer)
	Get
Property Value
Type: IReadOnlyList<Int32>
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace