RhinoCommon API
AppearanceSettingsState.ShowViewportTitles Property
 Get/Set viewport title visibility
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ShowViewportTitles { get; set; }
Public Property ShowViewportTitles As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace