RhinoCommon API
HatchPattern.HatchLines Property
 Gets all the hatch lines.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IEnumerable<HatchLine> HatchLines { get; }
Public ReadOnly Property HatchLines As IEnumerable(Of HatchLine)
	Get
Property Value
Type: IEnumerable<HatchLine>
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace