RhinoCommon API
MeshProviderIds.EdgeSoftening Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderMeshes.MeshProviderIds.EdgeSoftening"]
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Guid EdgeSoftening { get; }
Public Shared ReadOnly Property EdgeSoftening As Guid
	Get
Property Value
Type: Guid
See Also
Reference
MeshProviderIds Class
Rhino.Render.CustomRenderMeshes Namespace