RhinoCommon API
Cone.BasePoint Property
Center of base circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d BasePoint { get; }
Public ReadOnly Property BasePoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Cone Structure
Rhino.Geometry Namespace