RhinoCommon API
GpuDeviceInfo.Memory Property
 Memory of the device in bytes
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public ulong Memory { get; }
Public ReadOnly Property Memory As ULong
	Get
Property Value
Type: UInt64
See Also
Reference
GpuDeviceInfo Class
Rhino Namespace