RhinoCommon API
GeneralSettingsState.MouseSelectMode Property
 Gets or sets the current selection mode.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public MouseSelectMode MouseSelectMode { get; set; }
Public Property MouseSelectMode As MouseSelectMode
	Get
	Set
Property Value
Type: MouseSelectMode
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace