RhinoCommon API
MeshInstance.AncestryRecord.DefinitionId Property
 The ModelObjectId of the InstanceDefinition
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.2
Syntax
public Guid DefinitionId { get; }
Public ReadOnly Property DefinitionId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
MeshInstance.AncestryRecord Class
Rhino.Render.ChangeQueue Namespace