RhinoCommon API
GroupTableEventArgs.EventType Property
 The event type.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GroupTableEventType EventType { get; }
Public ReadOnly Property EventType As GroupTableEventType
	Get
Property Value
Type: GroupTableEventType
See Also
Reference
GroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace