RhinoCommon API
HatchLine.GetDashes Property
 Gets all of the dashes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public IEnumerable<double> GetDashes { get; }
Public ReadOnly Property GetDashes As IEnumerable(Of Double)
	Get
Property Value
Type: IEnumerable<Double>
See Also
Reference
HatchLine Class
Rhino.DocObjects Namespace