RhinoCommon API
DisplayPipelineAttributes.UseCustomBackface Property
 Use a custom material for displaying backfaces.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.20
Syntax
public bool UseCustomBackface { get; set; }
Public Property UseCustomBackface As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace