RhinoCommon API
Layer.IsVisible Property
 Gets or sets the global visibility of this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsVisible { get; set; }
Public Property IsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Layer Class
Rhino.DocObjects Namespace