RhinoCommon API
PageSettings.PrinterName Property
Name of the printer this layout targets, if any.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public string PrinterName { get; set; }
Public Property PrinterName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
PageSettings Class
Rhino.DocObjects Namespace