RhinoCommon API
NurbsCurveFitParameters.CurvatureBiasCoefficient Property
 When CurvatureBiasIntensity == NurbsCurveFitParameters.Intensity::Custom, this value is used as the curvature bias parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double CurvatureBiasCoefficient { get; set; }
Public Property CurvatureBiasCoefficient As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace