RhinoCommon API
RhinoDoc.PageDistanceDisplayMode Property
Gets/Sets the distance display mode for page space.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public DistanceDisplayMode PageDistanceDisplayMode { get; set; }
Public Property PageDistanceDisplayMode As DistanceDisplayMode
	Get
	Set
Property Value
Type: DistanceDisplayMode
See Also
Reference
RhinoDoc Class
Rhino Namespace