RhinoCommon API
File3dmNotes.IsHtml Property
 Gets or sets the text format. If the format is HTML, true; false otherwise.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsHtml { get; set; }
Public Property IsHtml As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace