RhinoCommon API
MeshCurveIntersection.BarycentricTolerance Property
Certified half-width on each barycentric slot.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double BarycentricTolerance { get; }
Public ReadOnly Property BarycentricTolerance As Double
	Get
Property Value
Type: Double
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace