RhinoCommon API
Leader.LeaderArrowType Property
 The arrowhead type for the leader
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.ArrowType LeaderArrowType { get; set; }
Public Property LeaderArrowType As DimensionStyle.ArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ArrowType
See Also
Reference
Leader Class
Rhino.Geometry Namespace