RhinoCommon API
PickContext.PickMode Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.PickContext.PickMode"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public PickMode PickMode { get; set; }
Public Property PickMode As PickMode
	Get
	Set
Property Value
Type: PickMode
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace