RhinoCommon API
ClippingPlane.ClipViewports Property
 Get an array of RhinoViewports this clipping plane is supposed to clip.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public RhinoViewport[] ClipViewports { get; }
Public ReadOnly Property ClipViewports As RhinoViewport()
	Get
Property Value
Type: RhinoViewport[]
See Also
Reference
ClippingPlane Class
Rhino.Render.ChangeQueue Namespace