RhinoCommon API
PostEffect.Id Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffect.Id"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace