RhinoCommon API
ModelAidSettingsState.ExtendTrimLines Property
Gets or sets the enabled state of Rhino's extend trim lines.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ExtendTrimLines { get; set; }
Public Property ExtendTrimLines As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace