RhinoCommon API
MappingChannelCollection.Item Property
 Get MappingChannel on index
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MappingChannel this[
	int i
] { get; }
Public ReadOnly Default Property Item (
	i As Integer
) As MappingChannel
	Get
Parameters
i
Type: System.Int32
Return Value
Type: MappingChannel
See Also
Reference
MappingChannelCollection Class
Rhino.Render.ChangeQueue Namespace