RhinoCommon API
PhysicallyBasedMaterial.Material Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.Material"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Material Material { get; }
Public ReadOnly Property Material As Material
	Get
Property Value
Type: Material
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace