RhinoCommon API
AreaMassProperties.CentroidCoordinatesProductMoments Property
 Product moments with respect to centroid coordinate system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.26
Syntax
public Vector3d CentroidCoordinatesProductMoments { get; }
Public ReadOnly Property CentroidCoordinatesProductMoments As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace