RhinoCommon API
LinearDimension.DimensionLinePoint Property
 Point on annotation plane where dimension line starts
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point2d DimensionLinePoint { get; set; }
Public Property DimensionLinePoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace