RhinoCommon API
DisplayPipelineAttributes.AxesSizePercentage Property
 Size of axes as a percentage of the grid extents.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int AxesSizePercentage { get; set; }
Public Property AxesSizePercentage As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace