RhinoCommon API
MeshPoint.EdgeIndex Property
 When set, EdgeIndex is an index of an edge in the mesh's edge list.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int EdgeIndex { get; }
Public ReadOnly Property EdgeIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace