RhinoCommon API
File3dmDisplacement.FairingOn Property
 Specifies whether or not to perform a fairing step. Fairing straightens rough feature edges.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool FairingOn { get; set; }
Public Property FairingOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace