RhinoCommon API
SimulatedTexture.OriginalFilename Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.OriginalFilename"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public string OriginalFilename { get; }
Public ReadOnly Property OriginalFilename As String
	Get
Property Value
Type: String
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace