RhinoCommon API
SubDComponent.IsHighlighted Property
 Returns true if the SubD component is highlighted.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public bool IsHighlighted { get; }
Public ReadOnly Property IsHighlighted As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace