RhinoCommon API
GroundPlane.Altitude Property
 Get the altitude for ground plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Altitude { get; }
Public ReadOnly Property Altitude As Double
	Get
Property Value
Type: Double
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace