RhinoCommon API
MeshCheckParameters.DuplicateFaceCount Property
 Gets the total count of duplicate faces for all meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int DuplicateFaceCount { get; }
Public ReadOnly Property DuplicateFaceCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace