RhinoCommon API
FileDwgWriteOptions.CurveChordHeight Property
Absolute distance from pline to nurb
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double CurveChordHeight { get; set; }
Public Property CurveChordHeight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace