RhinoCommon API
CullObjectEventArgs.RhinoObjectSerialNumber Property
 Gets the rhino object runtime serial number.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public uint RhinoObjectSerialNumber { get; }
Public ReadOnly Property RhinoObjectSerialNumber As UInteger
	Get
Property Value
Type: UInt32
The rhino object serial number.
See Also
Reference
CullObjectEventArgs Class
Rhino.Display Namespace