RhinoCommon API
RhinoApp.DefaultUiFont Property
 Default font used to render user interface
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Font DefaultUiFont { get; }
Public Shared ReadOnly Property DefaultUiFont As Font
	Get
Property Value
Type: Font
See Also
Reference
RhinoApp Class
Rhino Namespace