RhinoCommon API
FileIgsWriteOptions.NoZerosInTSection Property
The GridTool program used at NASA Langly cannot read IGES files that have leading zeros in the T section.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool NoZerosInTSection { get; set; }
Public Property NoZerosInTSection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace