RhinoCommon API
ZooClientParameters.ProductGuid Property
 Guid used by ZooClient to identify the plug-in requesting a license from ZooClient. This Guid may be used by different versions of the plug-in. If different licenses are used by different versions of the plug-in, the plug-in must also specify a LicenseGuid.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid ProductGuid { get; }
Public ReadOnly Property ProductGuid As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace