RhinoCommon API
Dimension.Suffix Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.Suffix"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Suffix { get; set; }
Public Property Suffix As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Dimension Class
Rhino.Geometry Namespace