RhinoCommon API
ModelAidSettingsState.OsnapPickboxRadius Property
Enables or disables Rhino's planar modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int OsnapPickboxRadius { get; set; }
Public Property OsnapPickboxRadius As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace