RhinoCommon API
LengthMassProperties.CentroidCoordinatesRadiiOfGyration Property
 Radii of gyration with respect to centroid coordinate system. X = sqrt(integral of ((y-y0)^2 + (z-z0)^2) dm/M) Y = sqrt(integral of ((z-z0)^2 + (x-x0)^2) dm/M) Z = sqrt(integral of ((z-z0)^2 + (y-y0)^2) dm/M) where (x0,y0,z0) = centroid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public Vector3d CentroidCoordinatesRadiiOfGyration { get; }
Public ReadOnly Property CentroidCoordinatesRadiiOfGyration As Vector3d
	Get
Property Value
Type: Vector3d
Remarks
 What is meant by "radii of gyration" varies widely in textbooks and papers. The values returned here are the integrals listed in the Returns section.
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace