RhinoCommon API
DimensionStyle.AlternateZeroSuppress Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateZeroSuppress"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.ZeroSuppression AlternateZeroSuppress { get; set; }
Public Property AlternateZeroSuppress As DimensionStyle.ZeroSuppression
	Get
	Set
Property Value
Type: DimensionStyle.ZeroSuppression
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace