RhinoCommon API
ClippingPlane.Plane Property
 Get the plane that represents this clipping plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Plane Plane { get; }
Public ReadOnly Property Plane As Plane
	Get
Property Value
Type: Plane
See Also
Reference
ClippingPlane Class
Rhino.Render.ChangeQueue Namespace