RhinoCommon API
GripsDrawEventArgs.GripColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripsDrawEventArgs.GripColor"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color GripColor { get; set; }
Public Property GripColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace