RhinoCommon API
FilePlyWriteOptions.ExportDoubles Property
 Determines whether vertexes are exported as doubles or floats.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool ExportDoubles { get; set; }
Public Property ExportDoubles As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
only has impact for binary export, floats are always exported to ascii.
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace