RhinoCommon API
Silhouette.GeometryComponentIndex Property
 Gets the component index corresponding with this silhouette curve. This field is only set when the entire silhouette curve is part of some geometry component.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ComponentIndex GeometryComponentIndex { get; }
Public ReadOnly Property GeometryComponentIndex As ComponentIndex
	Get
Property Value
Type: ComponentIndex
See Also
Reference
Silhouette Class
Rhino.Geometry Namespace