RhinoCommon API
FileSwReadOptions.RotateYtoZ Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSwReadOptions.RotateYtoZ"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool RotateYtoZ { get; set; }
Public Property RotateYtoZ As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSwReadOptions Class
Rhino.FileIO Namespace