RhinoCommon API
PhysicallyBased.Emission Property
[Missing <summary> documentation for "P:Rhino.Render.ChildSlotNames.PhysicallyBased.Emission"]
 Namespace: Rhino.Render.ChildSlotNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Emission { get; }
Public Shared ReadOnly Property Emission As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ChildSlotNames Namespace