RhinoCommon API
Transform.M20 Property
Gets or sets this[2,0].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double M20 { get; set; }
Public Property M20 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Transform Structure
Rhino.Geometry Namespace