RhinoCommon API
ZooClientParameters.OnLeaseChanged Property
 Delegate called by ZooClient when a cloud zoo lease is changed
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public OnLeaseChangedDelegate OnLeaseChanged { get; }
Public ReadOnly Property OnLeaseChanged As OnLeaseChangedDelegate
	Get
Property Value
Type: OnLeaseChangedDelegate
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace