RhinoCommon API
PhysicallyBased.Displacement Property
[Missing <summary> documentation for "P:Rhino.Render.ChildSlotNames.PhysicallyBased.Displacement"]
 Namespace: Rhino.Render.ChildSlotNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Displacement { get; }
Public Shared ReadOnly Property Displacement As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ChildSlotNames Namespace