RhinoCommon API
Fonts.NormalFont Property
 Returns the normal font used for dialog boxes and buttons.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Font NormalFont { get; }
Public Shared ReadOnly Property NormalFont As Font
	Get
Property Value
Type: Font
See Also
Reference
Fonts Class
Rhino.UI Namespace