RhinoCommon API
ViewTable.PageViewCount Property
 Gets the number of page views in the document
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PageViewCount { get; }
Public ReadOnly Property PageViewCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace