RhinoCommon API
ObjectEnumeratorSettings.ReferenceObjects Property
 When true, objects that are for reference and not saved in file are returned.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ReferenceObjects { get; set; }
Public Property ReferenceObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace