RhinoCommon API
ViewCaptureSettings.LinetypeWidthUnitsArePageLengths Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.LinetypeWidthUnitsArePageLengths"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool LinetypeWidthUnitsArePageLengths { get; set; }
Public Property LinetypeWidthUnitsArePageLengths As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace