RhinoCommon API
AnnotationBase.TextFormula Property
Note: This API is now obsolete.
 See RichText
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use RichText")]
public string TextFormula { get; set; }
<ObsoleteAttribute("Use RichText")>
Public Property TextFormula As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace