RhinoCommon API
PostEffectUuids.Gamma Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.Gamma"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid Gamma { get; }
Public Shared ReadOnly Property Gamma As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace