RhinoCommon API
RenderWindow.Channel.Id Property
 Return the channel id.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace