RhinoCommon API
DimensionStyle.SuppressArrow2 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.SuppressArrow2"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SuppressArrow2 { get; set; }
Public Property SuppressArrow2 As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace