RhinoCommon API
MeshCurveIntersection.PointB Property
3D point on the curve at the end of the event.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Point3d PointB { get; }
Public ReadOnly Property PointB As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace