RhinoCommon API
ViewCaptureSettings.IsValid Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.IsValid"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace