RhinoCommon API
BrepRegionFaceSide.Brep Property
 The brep this side belongs to.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepRegionFaceSide Class
Rhino.Geometry Namespace