RhinoCommon API
KeyboardShortcut.Modifier Property
Modifier key used for shortcut
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public ModifierKey Modifier { get; set; }
Public Property Modifier As ModifierKey
	Get
	Set
Property Value
Type: ModifierKey
See Also
Reference
KeyboardShortcut Class
Rhino.ApplicationSettings Namespace