RhinoCommon API
DisplayModeDescription.AmbientOcclusionId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.AmbientOcclusionId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid AmbientOcclusionId { get; }
Public Shared ReadOnly Property AmbientOcclusionId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace