RhinoCommon API
Curve.IsPeriodic Property
 Gets a value indicating whether or not this curve is considered to be Periodic.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsPeriodic { get; }
Public ReadOnly Property IsPeriodic As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Curve Class
Rhino.Geometry Namespace