RhinoCommon API
StdVectorOfSharedPtrToMesh.Count Property
 Gets the amount of meshes in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
StdVectorOfSharedPtrToMesh Class
Rhino.Runtime.InteropWrappers Namespace