RhinoCommon API
DisplayPipelineAttributes.ShadowColor Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ShadowColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public Color ShadowColor { get; set; }
Public Property ShadowColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace