RhinoCommon API
RenderMaterialTable.Item Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterialTable.Item(System.Int32)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderMaterial this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As RenderMaterial
	Get
Parameters
index
Type: System.Int32
Property Value
Type: RenderMaterial
See Also
Reference
RenderMaterialTable Class
Rhino.Render Namespace