RhinoCommon API
DocumentEventArgs.Document Property
 Gets the document for this event. This field might be null.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
DocumentEventArgs Class
Rhino Namespace