RhinoCommon API
SubDVertex.Tag Property
 identifies the type of subdivision vertex
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public SubDVertexTag Tag { get; set; }
Public Property Tag As SubDVertexTag
	Get
	Set
Property Value
Type: SubDVertexTag
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace