RhinoCommon API
ViewportInfo.FrustumRightPlane Property
 Gets the frustum right plane that separates visible from off-screen.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Plane FrustumRightPlane { get; }
Public ReadOnly Property FrustumRightPlane As Plane
	Get
Property Value
Type: Plane
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace