RhinoCommon API
Transform2d.Determinant Property
 The determinant of the 2x2 linear part of this matrix. Because the bottom row is (0,0,1) this is also the signed area scale factor of the transformation. A negative determinant means the transformation reverses orientation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Determinant { get; }
Public ReadOnly Property Determinant As Double
	Get
Property Value
Type: Double
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace