RhinoCommon API
MeshExtruder.TextureCoordinateMode Property
 Mode for creating texture coordinates for extruded areas
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public MeshExtruderParameterMode TextureCoordinateMode { get; set; }
Public Property TextureCoordinateMode As MeshExtruderParameterMode
	Get
	Set
Property Value
Type: MeshExtruderParameterMode
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace