RhinoCommon API
LicenseLease.GroupId Property
 ID of Rhino Accounts group that this lease came from
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string GroupId { get; }
Public ReadOnly Property GroupId As String
	Get
Property Value
Type: String
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace