RhinoCommon API
MetaDataProxy.CppPointer Property
 MetaDataProxy c++ pointer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
MetaDataProxy Class
Rhino.Render Namespace