RhinoCommon API
DecalCreateParams.Transparency Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.Transparency"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double Transparency { get; set; }
Public Property Transparency As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace