RhinoCommon API
ChooseOneObjectSettings.ShowObjectTypeDetails Property
ShowObjectTypeDetails
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool ShowObjectTypeDetails { get; set; }
Public Shared Property ShowObjectTypeDetails As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace