RhinoCommon API
RenderContentSerializer.ContentKind Property
 Kind of content created when importing or exporting this file type - ie, Material, Texture or Environment
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RenderContentKind ContentKind { get; }
Public ReadOnly Property ContentKind As RenderContentKind
	Get
Property Value
Type: RenderContentKind
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace