RhinoCommon API
FileWriteOptions.IncludeBitmapTable Property
 The file written should include the bitmap table if your File Writing Plug-in supports it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IncludeBitmapTable { get; set; }
Public Property IncludeBitmapTable As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace