RhinoCommon API
SafeFrame.LiveFrameOn Property
 Turn on the live area, which shows the size of the rendered view as a yellow frame in the viewport.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public bool LiveFrameOn { get; set; }
Public Property LiveFrameOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SafeFrame Class
Rhino.Render Namespace