RhinoCommon API
AnimationProperties.HtmlFileName Property
 Gets or sets the HTML file name. This property is the same as AnimationName.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public string HtmlFileName { get; set; }
Public Property HtmlFileName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace