RhinoCommon API
SubDSurfaceInterpolator.ContextId Property
 The context assigned id. This id is provided for applications using ON_SubDSurfaceInterpolator. It is not inspected or used in any part of the interpolation setup or calculations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid ContextId { get; set; }
Public Property ContextId As Guid
	Get
	Set
Property Value
Type: Guid
Remarks
 In Rhino, when an interpolator is being used to modify a CRhinoSubDObject, this id is often the Rhino object id.
See Also
Reference
SubDSurfaceInterpolator Class
Rhino.Geometry Namespace