RhinoCommon API
SubDComponentParameter.ActiveFaceId Property
 Gets the id of the face this parameter uses to resolve which sector of a vertex or which side of an edge it means, or 0 if there is none. It is always 0 when IsFaceParameter is true; use ComponentId in that case.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public uint ActiveFaceId { get; }
Public ReadOnly Property ActiveFaceId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace