RhinoCommon API
ObjectAttributes.DetailBackgroundVisible Property
 Should the background color show for a detail
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool DetailBackgroundVisible { get; set; }
Public Property DetailBackgroundVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace