RhinoCommon API
GetPoint.OsnapEventType Property
 Gets the type of object snap used to obtain the point.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.24
Syntax
public OsnapModes OsnapEventType { get; }
Public ReadOnly Property OsnapEventType As OsnapModes
	Get
Property Value
Type: OsnapModes
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace