RhinoCommon API
PickContext.PickGroupsEnabled Property
 True if GroupObjects should be added to the pick list
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool PickGroupsEnabled { get; set; }
Public Property PickGroupsEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace