RhinoCommon API
DisplayPipelineAttributes.SubDBoundaryThicknessScale Property
 Edge thickness scale
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public float SubDBoundaryThicknessScale { get; set; }
Public Property SubDBoundaryThicknessScale As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace