RhinoCommon API
StringParserSettings.ParseSpaceAsDigitSeparator Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseSpaceAsDigitSeparator"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseSpaceAsDigitSeparator { get; set; }
Public Property ParseSpaceAsDigitSeparator As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace