RhinoCommon API
PostEffectChannel.Id Property
 Return the channel id which indicates what type of data is used in this channel.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public virtual Guid Id { get; }
Public Overridable ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectChannel Class
Rhino.Render.PostEffects Namespace