RhinoCommon API
MeshInstance.RenderMaterial Property
 RenderMaterial associated with mesh instance
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderMaterial RenderMaterial { get; }
Public ReadOnly Property RenderMaterial As RenderMaterial
	Get
Property Value
Type: RenderMaterial
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace