RhinoCommon API
DisplayPipelineAttributes.ViewDisplayAttributes.WorldAxisColorY Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes.WorldAxisColorY"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color WorldAxisColorY { get; set; }
Public Property WorldAxisColorY As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace