RhinoCommon API
DisplayPipeline.DisplayPipelineAttributes Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.DisplayPipelineAttributes"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public DisplayPipelineAttributes DisplayPipelineAttributes { get; }
Public ReadOnly Property DisplayPipelineAttributes As DisplayPipelineAttributes
	Get
Property Value
Type: DisplayPipelineAttributes
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace