RhinoCommon API
RhinoDoc.Materials Property
Materials in the document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public MaterialTable Materials { get; }
Public ReadOnly Property Materials As MaterialTable
	Get
Property Value
Type: MaterialTable
See Also
Reference
RhinoDoc Class
Rhino Namespace