RhinoCommon API
CommandEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.Commands.CommandEventArgs.Document"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace