RhinoCommon API
ViewportInfo.IsCameraDirectionLocked Property
 Gets or sets a value that indicates whether the direction that the camera faces is unmodifiable.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsCameraDirectionLocked { get; set; }
Public Property IsCameraDirectionLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace