RhinoCommon API
Brep.FilletSurfaceSettings.Degree Property
 Degree of the arc approxiation (3, 4, or 5) - only for non-rational fillets
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Degree { get; }
Public ReadOnly Property Degree As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace