RhinoCommon API
CachedTextureCoordinates.Item Property
 Gets the element at the specified index. Never call the set method, it will always throw a NotSupportedException because this list is read-only.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As Point3d
	Get
Parameters
index
Type: System.Int32
 The zero-based index of the element to get.
Return Value
Type: Point3d
 The element at the specified index.
Exceptions
Exception | Condition
NotSupportedException |  IList implementation, this list is always read-only so calling the set method will always cause a NotSupportedException to be thrown.
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace