RhinoCommon API
File3dmEdgeSoftening.On Property
 Specifies whether edge softening is enabled or not.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool On { get; set; }
Public Property On As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmEdgeSoftening Class
Rhino.FileIO Namespace