RhinoCommon API
FileIgsWriteOptions.FitRationalSurfaces Property
true means non-conic rational surfaces will be fit with non-rational surfaces
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool FitRationalSurfaces { get; set; }
Public Property FitRationalSurfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace