RhinoCommon API
ViewSettings.DefinedViewSetProjection Property
 Gets or sets the 'Named views set projection' value.
When true, restoring a named view causes the viewport projection saved with the view to also restore.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool DefinedViewSetProjection { get; set; }
Public Shared Property DefinedViewSetProjection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace