RhinoCommon API
CurvatureAnalysisSettingsState.MeanRange Property
 Gets or sets the Mean curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Interval MeanRange { get; set; }
Public Property MeanRange As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
CurvatureAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace