RhinoCommon API
CommandLineOption.CurrentNumericValue Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.CommandLineOption.CurrentNumericValue"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double CurrentNumericValue { get; }
Public ReadOnly Property CurrentNumericValue As Double
	Get
Property Value
Type: Double
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace