RhinoCommon API
FileWriteOptions.BackupFileFolder Property
 For use on Apple frameworks only. Returns the final destination file name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public string BackupFileFolder { get; set; }
Public Property BackupFileFolder As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace