RhinoCommon API
MeshingParameters.RefineAngle Property
 Gets or sets the mesh parameter refine angle in radians.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double RefineAngle { get; set; }
Public Property RefineAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace