RhinoCommon API
MeshPoint.EdgeParameter Property
 Edge parameter when found.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double EdgeParameter { get; }
Public ReadOnly Property EdgeParameter As Double
	Get
Property Value
Type: Double
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace