RhinoCommon API
RenderPropertyChangedEvent.Document Property
 The document triggering the event.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RenderPropertyChangedEvent Class
Rhino.Render Namespace