RhinoCommon API
GumballAppearanceSettings.TranslateYZEnabled Property
 When TranslateYZ is true, the YZ plane translation control is available in appropriate views. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool TranslateYZEnabled { get; set; }
Public Property TranslateYZEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace