RhinoCommon API
File3dmSettings.GridDefaults Property
 The construction plane grid defaults new views inherit: grid and snap spacing, line counts, and whether the grid, its axes and the world axes icon are drawn.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public ConstructionPlaneGridDefaults GridDefaults { get; set; }
Public Property GridDefaults As ConstructionPlaneGridDefaults
	Get
	Set
Property Value
Type: ConstructionPlaneGridDefaults
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace