RhinoCommon API
NamedViewTable.Count Property
Number of named views in the table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace