RhinoCommon API
ContentUuids.MaskTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.MaskTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid MaskTextureType { get; }
Public Shared ReadOnly Property MaskTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace