RhinoCommon API
KeyboardShortcut.Macro Property
Macro to execute when key plus modifier are pressed
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public string Macro { get; set; }
Public Property Macro As String
	Get
	Set
Property Value
Type: String
See Also
Reference
KeyboardShortcut Class
Rhino.ApplicationSettings Namespace