RhinoCommon API
PurgeStatistics.TotalPurgedCount Property
 The total number of table objects that were purged.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int TotalPurgedCount { get; }
Public ReadOnly Property TotalPurgedCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PurgeStatistics Class
Rhino Namespace