RhinoCommon API
DisplayPipelineAttributes.ControlPolygonUseSolidLines Property
 Use dotted / solid lines
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool ControlPolygonUseSolidLines { get; set; }
Public Property ControlPolygonUseSolidLines As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace