RhinoCommon API
RhinoApp.SerialNumber Property
Gets the product serial number, as seen in Rhino's ABOUT dialog box.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string SerialNumber { get; }
Public Shared ReadOnly Property SerialNumber As String
	Get
Property Value
Type: String
See Also
Reference
RhinoApp Class
Rhino Namespace