RhinoCommon API
DisplayPipelineAttributes.PreProcessColors Property
 Linear workflow input colors
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public bool PreProcessColors { get; set; }
Public Property PreProcessColors As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace