RhinoCommon API
DisplayPipelineAttributes.SubDNonManifoldColorReduction Property
 Color reduction percentage
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public int SubDNonManifoldColorReduction { get; set; }
Public Property SubDNonManifoldColorReduction As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace