RhinoCommon API
LicenseLease.ProductTitle Property
 Title of product that this lease is issued to. For example, "Rhino 6"
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string ProductTitle { get; }
Public ReadOnly Property ProductTitle As String
	Get
Property Value
Type: String
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace