RhinoCommon API
RhinoDoc.PageAbsoluteTolerance Property
Page space absolute tolerance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double PageAbsoluteTolerance { get; set; }
Public Property PageAbsoluteTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RhinoDoc Class
Rhino Namespace