RhinoCommon API
PageViewGroup.SortIndex Property
 Gets the runtime index used to sort page view groups.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int SortIndex { get; }
Public ReadOnly Property SortIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PageViewGroup Class
Rhino.DocObjects Namespace