RhinoCommon API
Brep.VariationalPatchSettings.Tolerance Property
 Tolerance for positional (G0) constraints on edges
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Tolerance { get; set; }
Public Property Tolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace