RhinoCommon API
GeneralSettings.ContextMenuDelay Property
 Time to wait before permitting context menu display.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static TimeSpan ContextMenuDelay { get; set; }
Public Shared Property ContextMenuDelay As TimeSpan
	Get
	Set
Property Value
Type: TimeSpan
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace