RhinoCommon API
IOpenIDConnectToken.Exp Property
 The date the token expires.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
DateTime? Exp { get; }
ReadOnly Property Exp As DateTime?
	Get
Property Value
Type: Nullable<DateTime>
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace