RhinoCommon API
SoftTransformSettings.CvCountV Property
 Controls the number of control vertices affected by soft transform for surfaces in the V direction.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int CvCountV { get; set; }
Public Shared Property CvCountV As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SoftTransformSettings Class
Rhino.ApplicationSettings Namespace