RhinoCommon API
ModelAidSettings.SnapToOccluded Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettings.SnapToOccluded"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool SnapToOccluded { get; set; }
Public Shared Property SnapToOccluded As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace