RhinoCommon API
DimensionStyle.LeaderTextVerticalAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderTextVerticalAlignment"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public TextVerticalAlignment LeaderTextVerticalAlignment { get; set; }
Public Property LeaderTextVerticalAlignment As TextVerticalAlignment
	Get
	Set
Property Value
Type: TextVerticalAlignment
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace