RhinoCommon API
MaterialRefs.Values Property
 Gets an ICollection containing the MaterialRef objects in this dictionary.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public ICollection<MaterialRef> Values { get; }
Public ReadOnly Property Values As ICollection(Of MaterialRef)
	Get
Property Value
Type: ICollection<MaterialRef>
Implements
IDictionary<TKey, TValue>.Values
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace