RhinoCommon API
Arc.AngleDegrees Property
 Gets or sets the sweep -or subtended- angle (in Degrees) for this arc segment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double AngleDegrees { get; set; }
Public Property AngleDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Arc Structure
Rhino.Geometry Namespace