RhinoCommon API
AppearanceSettingsState.MenuVisible Property
 Get/Set menu visibility
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool MenuVisible { get; set; }
Public Property MenuVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace