RhinoCommon API
InstanceDefinition.ComponentType Property
 Returns InstanceDefinition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace