RhinoCommon API
RenderSettings.GroundPlane Property
 If this object is associated with a document, this gets the document ground plane. If this object is associated with a File3dm, this gets the File3dm's ground plane. Otherwise it gets a 'free-floating' ground plane object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public GroundPlane GroundPlane { get; }
Public ReadOnly Property GroundPlane As GroundPlane
	Get
Property Value
Type: GroundPlane
See Also
Reference
RenderSettings Class
Rhino.Render Namespace