RhinoCommon API
LicenseData.DateToExpire Property
 The date and time the license is set to expire. This is provided by the plug in that validated the license. This time value should be in Coordinated Universal Time (UTC).
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public DateTime? DateToExpire { get; set; }
Public Property DateToExpire As DateTime?
	Get
	Set
Property Value
Type: Nullable<DateTime>
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace