RhinoCommon API
Box.Empty Property
 Empty Box. Empty boxes are considered to be invalid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Box Empty { get; }
Public Shared ReadOnly Property Empty As Box
	Get
Property Value
Type: Box
See Also
Reference
Box Structure
Rhino.Geometry Namespace