RhinoCommon API
SubDComponentParameter.ComponentIndex Property
 Gets the component index of the SubD component this parameter is relative to. It is Unset if this parameter is not set.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public ComponentIndex ComponentIndex { get; }
Public ReadOnly Property ComponentIndex As ComponentIndex
	Get
Property Value
Type: ComponentIndex
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace