RhinoCommon API
FileObjWriteOptions.ExportMaterialDefinitions Property
 Setting to write an .mtl file and "usemtl"s in the obj file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ExportMaterialDefinitions { get; set; }
Public Property ExportMaterialDefinitions As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace