RhinoCommon API
TextDotUserInterfaceObject.Text Property
 Text content for grip
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
Property Value
Type: String
See Also
Reference
TextDotUserInterfaceObject Class
Rhino.UI Namespace