RhinoCommon API
ToolbarFileCollection.MruSidebarIsVisible Property
 Returns true if the most-recently-used sizebar is visible.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool MruSidebarIsVisible { get; set; }
Public Shared Property MruSidebarIsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace