RhinoCommon API
ObjectEnumeratorSettings.LockedObjects Property
 When true, locked objects or objects on locked layers are returned.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool LockedObjects { get; set; }
Public Property LockedObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace