RhinoCommon API
SectionStyle.BoundaryVisible Property
 Should the boundary for this section be displayed
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool BoundaryVisible { get; set; }
Public Property BoundaryVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace