RhinoCommon API
IntersectionEvent.OverlapA Property
 Gets the interval on curve A where the overlap occurs. If the intersection type is not overlap, this value is meaningless.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Interval OverlapA { get; }
Public ReadOnly Property OverlapA As Interval
	Get
Property Value
Type: Interval
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace