RhinoCommon API
ModelComponent.HasName Property
 Returns a value indicating whether the component has a Name.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool HasName { get; }
Public ReadOnly Property HasName As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace