RhinoCommon API
Quaternion.LengthSquared Property
 Gets the result of (a^2 + b^2 + c^2 + d^2).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double LengthSquared { get; }
Public ReadOnly Property LengthSquared As Double
	Get
Property Value
Type: Double
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace