RhinoCommon API
ContentHash.Sha1ContentHash Property
 Gets the 20-bytes long SHA1 hash of the content.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public byte[] Sha1ContentHash { get; }
Public ReadOnly Property Sha1ContentHash As Byte()
	Get
Property Value
Type: Byte[]
See Also
Reference
ContentHash Class
Rhino.FileIO Namespace