RhinoCommon API
Interval.IsDecreasing Property
 Returns true if T[0] > T[1].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsDecreasing { get; }
Public ReadOnly Property IsDecreasing As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Interval Structure
Rhino.Geometry Namespace