RhinoCommon API
ObjectEnumeratorSettings.MaterialIndexFilter Property
 The material filter property can be used to limit the iteration to objects that use a specific material. The default is to iterate through all objects no matter the material assignment.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.25
Syntax
public int MaterialIndexFilter { get; set; }
Public Property MaterialIndexFilter As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace