RhinoCommon API
MeshInstance.ObjectAttributes Property
 The ObjectAttributes associated with a MeshInstance
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public ObjectAttributes ObjectAttributes { get; }
Public ReadOnly Property ObjectAttributes As ObjectAttributes
	Get
Property Value
Type: ObjectAttributes
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace