RhinoCommon API
CustomRenderMeshProvider.ShutLiningId Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderMeshProvider.ShutLiningId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid ShutLiningId { get; }
Public Shared ReadOnly Property ShutLiningId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace