RhinoCommon API
ProviderIds.PreviewSettings Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.PreviewSettings"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid PreviewSettings { get; }
Public Shared ReadOnly Property PreviewSettings As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace