RhinoCommon API
Light.IsPointLight Property
 Gets a value indicating whether the light style is LightStyle CameraPoint or WorldPoint.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsPointLight { get; }
Public ReadOnly Property IsPointLight As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Light Class
Rhino.Geometry Namespace