RhinoCommon API
RhinoAccoountsProgressInfo.State Property
 The state to report.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public ProgressState State { get; }
Public ReadOnly Property State As ProgressState
	Get
Property Value
Type: ProgressState
See Also
Reference
RhinoAccoountsProgressInfo Class
Rhino.Runtime.RhinoAccounts Namespace