RhinoCommon API
AsyncRenderContext.RenderThread Property
 Holder for render thread, that gets set through StartRenderThread()
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Thread RenderThread { get; }
Public ReadOnly Property RenderThread As Thread
	Get
Property Value
Type: Thread
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace