RhinoCommon API
FileDstReadOptions.ImportJumps Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDstReadOptions.ImportJumps"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportJumps { get; set; }
Public Property ImportJumps As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDstReadOptions Class
Rhino.FileIO Namespace