RhinoCommon API
PythonScript.ContextId Property
 Gets or sets a context unique identified.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int ContextId { get; set; }
Public Property ContextId As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace