RhinoCommon API
Brep.FilletSurfaceResults.OutBreps1 Property
 If the second input face was trimmed, the trimmed results are returned here
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IList<Brep> OutBreps1 { get; }
Public ReadOnly Property OutBreps1 As IList(Of Brep)
	Get
Property Value
Type: IList<Brep>
See Also
Reference
Brep.FilletSurfaceResults Class
Rhino.Geometry Namespace