RhinoCommon API
Ellipse.Radius1 Property
 Gets or sets the radius of the ellipse along the base plane X semi-axis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Radius1 { get; set; }
Public Property Radius1 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace