RhinoCommon API
Brep.FilletSurfaceResults.Face0 Property
 The first face used as input for the fillet surface generation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public BrepFace Face0 { get; }
Public ReadOnly Property Face0 As BrepFace
	Get
Property Value
Type: BrepFace
See Also
Reference
Brep.FilletSurfaceResults Class
Rhino.Geometry Namespace