RhinoCommon API
PreviewJobSignature.CppPointer Property
 UnManaged pointer of the PreviewJobsingature
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
PreviewJobSignature Class
Rhino.Render Namespace