RhinoCommon API
PythonScript.ScriptContextDoc Property
 object set to variable held in scriptcontext.doc.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Object ScriptContextDoc { get; set; }
Public Property ScriptContextDoc As Object
	Get
	Set
Property Value
Type: Object
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace