RhinoCommon API
DetailView.IsParallelProjection Property
 Gets or sets whether the view is parallel.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsParallelProjection { get; set; }
Public Property IsParallelProjection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DetailView Class
Rhino.Geometry Namespace