RhinoCommon API
AnnotationBase.TextHasRtfFormatting Property
 Gets a value indicating whether the annotation's text is formatted as RTF (Rich Text Format). Returns true if the text begins with an RTF header; otherwise, false.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool TextHasRtfFormatting { get; }
Public ReadOnly Property TextHasRtfFormatting As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace