RhinoCommon API
DimensionStyle.AlternateRoundoff Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateRoundoff"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double AlternateRoundoff { get; set; }
Public Property AlternateRoundoff As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace