RhinoCommon API
Transform.ZeroTransformation Property
 ZeroTransformation diagonal = (0,0,0,1)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public static Transform ZeroTransformation { get; }
Public Shared ReadOnly Property ZeroTransformation As Transform
	Get
Property Value
Type: Transform
See Also
Reference
Transform Structure
Rhino.Geometry Namespace