RhinoCommon API
Dimension.TextAngleType Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.TextAngleType"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual DimensionStyle.LeaderContentAngleStyle TextAngleType { get; set; }
Public Overridable Property TextAngleType As DimensionStyle.LeaderContentAngleStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderContentAngleStyle
See Also
Reference
Dimension Class
Rhino.Geometry Namespace