RhinoCommon API
RhinoView.DisplayPipeline Property
 Gets the display pipeline used for this view.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DisplayPipeline DisplayPipeline { get; }
Public ReadOnly Property DisplayPipeline As DisplayPipeline
	Get
Property Value
Type: DisplayPipeline
See Also
Reference
RhinoView Class
Rhino.Display Namespace