RhinoCommon API
SubDEdgeChain.ParentSubD Property
 The SubD this chain runs through.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public SubD ParentSubD { get; }
Public ReadOnly Property ParentSubD As SubD
	Get
Property Value
Type: SubD
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace