RhinoCommon API
File3dm.RenderEnvironments Property
 The render environments in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmRenderEnvironments RenderEnvironments { get; }
Public ReadOnly Property RenderEnvironments As File3dmRenderEnvironments
	Get
Property Value
Type: File3dmRenderEnvironments
See Also
Reference
File3dm Class
Rhino.FileIO Namespace