RhinoCommon API
SectionStyleTable.Count Property
 Returns number of section styles in the section style table, including deleted section styles.
 This count also spans table slots emptied by a purge, so it can be larger than the number of section styles that are actually there. See the remarks on the indexer.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
SectionStyleTable Class
Rhino.DocObjects.Tables Namespace