RhinoCommon API
HiddenLineDrawingSegment.SegmentVisibility Property
 Returns the segment's visibility
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public HiddenLineDrawingSegment.Visibility SegmentVisibility { get; }
Public ReadOnly Property SegmentVisibility As HiddenLineDrawingSegment.Visibility
	Get
Property Value
Type: HiddenLineDrawingSegment.Visibility
See Also
Reference
HiddenLineDrawingSegment Class
Rhino.Geometry Namespace