RhinoCommon API
DisplayPipelineAttributes.EnglishName Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.EnglishName"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string EnglishName { get; set; }
Public Property EnglishName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace