RhinoCommon API
Dimension.ArrowFit Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ArrowFit"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.20
Syntax
public DimensionStyle.ArrowFit ArrowFit { get; set; }
Public Property ArrowFit As DimensionStyle.ArrowFit
	Get
	Set
Property Value
Type: DimensionStyle.ArrowFit
See Also
Reference
Dimension Class
Rhino.Geometry Namespace