RhinoCommon API
Texture.Rotation Property
 Helper for access to the rotation value encoded in UvwTransform
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double Rotation { get; set; }
Public Property Rotation As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Texture Class
Rhino.DocObjects Namespace