RhinoCommon API
RenderPrimitive.RhinoObject Property
 The Rhino object associated with this render primitive.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public RhinoObject RhinoObject { get; }
Public ReadOnly Property RhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace