RhinoCommon API
RhinoDoc.Objects Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.Objects"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ObjectTable Objects { get; }
Public ReadOnly Property Objects As ObjectTable
	Get
Property Value
Type: ObjectTable
See Also
Reference
RhinoDoc Class
Rhino Namespace