RhinoCommon API
PanelIds.Display Property
 Rhino Display Properties panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid Display { get; }
Public Shared ReadOnly Property Display As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace