RhinoCommon API
File3dmSettings.RenderSettings Property
 Gets or sets the render settings.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public RenderSettings RenderSettings { get; }
Public ReadOnly Property RenderSettings As RenderSettings
	Get
Property Value
Type: RenderSettings
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace