RhinoCommon API
StringParserSettings.ParseMultiplication Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseMultiplication"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseMultiplication { get; set; }
Public Property ParseMultiplication As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace