RhinoCommon API
RhinoDoc.SubDAppearance Property
 Returns or sets the appearance of all SubD objects in the document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.5
Syntax
public SubDComponentLocation SubDAppearance { get; set; }
Public Property SubDAppearance As SubDComponentLocation
	Get
	Set
Property Value
Type: SubDComponentLocation
Remarks
 When setting this property, if the document contains SubD objects, then the document will be redrawn automatically.
See Also
Reference
RhinoDoc Class
Rhino Namespace