RhinoCommon API
RhinoApp.SchemeName Property
 Gets the current Registry scheme name.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string SchemeName { get; }
Public Shared ReadOnly Property SchemeName As String
	Get
Property Value
Type: String
See Also
Reference
RhinoApp Class
Rhino Namespace