RhinoCommon API
SquishParameters.BoundaryStretchConstant Property
 Spring constant for stretched boundary edges
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public double BoundaryStretchConstant { get; set; }
Public Property BoundaryStretchConstant As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SquishParameters Class
Rhino.Geometry Namespace