RhinoCommon API
FileFbxWriteOptions.SaveMaterialsAs Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileFbxWriteOptions.SaveMaterialsAs"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileFbxWriteOptions.MaterialType SaveMaterialsAs { get; set; }
Public Property SaveMaterialsAs As FileFbxWriteOptions.MaterialType
	Get
	Set
Property Value
Type: FileFbxWriteOptions.MaterialType
See Also
Reference
FileFbxWriteOptions Class
Rhino.FileIO Namespace