RhinoCommon API
Vector3dField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Vector3d Value { get; set; }
Public Property Value As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
Vector3dField Class
Rhino.Render.Fields Namespace