RhinoCommon API
FileCsvDocument.RowCount Property
 The number of rows in the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int RowCount { get; }
Public ReadOnly Property RowCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace