RhinoCommon API
Transform.M30 Property
Gets or sets this[3,0].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double M30 { get; set; }
Public Property M30 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Transform Structure
Rhino.Geometry Namespace