RhinoCommon API
Plane.Unset Property
 Gets a plane that contains Unset origin and axis vectors.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Plane Unset { get; }
Public Shared ReadOnly Property Unset As Plane
	Get
Property Value
Type: Plane
See Also
Reference
Plane Structure
Rhino.Geometry Namespace