RhinoCommon API
MeshInterference.IndexB Property
 The index of the second clashing, or interfering object.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int IndexB { get; set; }
Public Property IndexB As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshInterference Structure
Rhino.Geometry.Intersect Namespace