RhinoCommon API
CurveSegment.Reversed Property
 True if this piece of the curve should be reversed.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool Reversed { get; }
Public ReadOnly Property Reversed As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CurveSegment Structure
Rhino.Runtime.InteropWrappers Namespace