RhinoCommon API
DisplayModeDescription.RenderedShadowsId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.RenderedShadowsId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid RenderedShadowsId { get; }
Public Shared ReadOnly Property RenderedShadowsId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace