RhinoCommon API
ViewInfo.ShowConstructionGrid Property
Whether the construction plane grid is drawn in this view.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool ShowConstructionGrid { get; set; }
Public Property ShowConstructionGrid As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace