RhinoCommon API
AppearanceSettingsState.SelectionWindowCrossingStrokeColor Property
 Gets or sets the color used to draw the stroke of a crossing selection window
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Color SelectionWindowCrossingStrokeColor { get; set; }
Public Property SelectionWindowCrossingStrokeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace