RhinoCommon API
LightTableEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTableEventArgs.Document"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace