RhinoCommon API
FileDwgReadOptions.NestLayers Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgReadOptions.NestLayers"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool NestLayers { get; set; }
Public Property NestLayers As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgReadOptions Class
Rhino.FileIO Namespace