RhinoCommon API
ViewCaptureWriter.PathPoint.Location Property
[Missing <summary> documentation for "P:Rhino.Runtime.ViewCaptureWriter.PathPoint.Location"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PointF Location {
	get;
 set; }
Public Property Location As PointF
		Get
	Set
Property Value
Type: PointF
See Also
Reference
ViewCaptureWriter.PathPoint Structure
Rhino.Runtime Namespace