RhinoCommon API
GetCylinder.VerticalDirectionMinimumCount Property
 The minimum number of faces in the vertical direction.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int VerticalDirectionMinimumCount { get; set; }
Public Property VerticalDirectionMinimumCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace