RhinoCommon API
StringField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public string Value { get; set; }
Public Property Value As String
	Get
	Set
Property Value
Type: String
See Also
Reference
StringField Class
Rhino.Render.Fields Namespace