RhinoCommon API
WorksessionModel.AttachFailed Property
 True if the most recent attempt to attach this model failed, which usually means the file is missing.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool AttachFailed { get; }
Public ReadOnly Property AttachFailed As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
WorksessionModel Class
Rhino.DocObjects Namespace