RhinoCommon API
ThumbData.Type Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.Type"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Type { get; set; }
Public Property Type As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace