RhinoCommon API
Rectangle3d.Center Property
 Gets the point in the center of the rectangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d Center { get; }
Public ReadOnly Property Center As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace