RhinoCommon API
Mesh.IsSolid Property
 Returns true if the mesh is solid. A "solid" is a closed oriented manifold.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public bool IsSolid { get; }
Public ReadOnly Property IsSolid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Mesh Class
Rhino.Geometry Namespace