RhinoCommon API
PlugIn.WindowPositionSettings Property
[Missing <summary> documentation for "P:Rhino.PlugIns.PlugIn.WindowPositionSettings"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PersistentSettings WindowPositionSettings { get; }
Public ReadOnly Property WindowPositionSettings As PersistentSettings
	Get
Property Value
Type: PersistentSettings
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace