RhinoCommon API
AppearanceSettingsState.WorldCoordIconXAxisColor Property
Gets or sets the color of the world X axis of the world coordinates icon, appearing usually bottom left in viewports.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color WorldCoordIconXAxisColor { get; set; }
Public Property WorldCoordIconXAxisColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace