RhinoCommon API
ICollapsibleSection.Collapsible Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.Collapsible"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
bool Collapsible { get; }
ReadOnly Property Collapsible As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace