RhinoCommon API
InstanceDefinitionGeometry.ComponentType Property
 Returns InstanceDefinition.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace