RhinoCommon API
SimpleArrayExtrusionPointer.Count Property
 Gets the amount of Extrusions in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SimpleArrayExtrusionPointer Class
Rhino.Runtime.InteropWrappers Namespace