RhinoCommon API
Leader.LeaderArrowSize Property
 The size of the leader arrow
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double LeaderArrowSize { get; set; }
Public Property LeaderArrowSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Leader Class
Rhino.Geometry Namespace