RhinoCommon API
Analytics.AppVersion Property
 Application version string. Maps to Google Analytics parameter 'av'
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string AppVersion { get; set; }
Public Property AppVersion As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Analytics Class
Rhino.Runtime Namespace