RhinoCommon API
ContentUuids.GradientTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.GradientTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid GradientTextureType { get; }
Public Shared ReadOnly Property GradientTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace