RhinoCommon API
RenderMeshProviderProgress.ProviderId Property
 The Id of the RenderMeshProvider that this report came from.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Guid ProviderId { get; set; }
Public Property ProviderId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
RenderMeshProviderProgress Class
Rhino.Render.CustomRenderMeshes Namespace