RhinoCommon API
MeshClash.ClashRadius Property
 Gets the clash, or intersection, radius.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ClashRadius { get; }
Public ReadOnly Property ClashRadius As Double
	Get
Property Value
Type: Double
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace