RhinoCommon API
RebuildCurveOptions.KinkAngleDegrees Property
 If the KinkSplitting is on, then KinkAngleDegrees is the angle in degrees used to detect discontinuous changes in target curve tangents and curvature directions.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double KinkAngleDegrees { get; set; }
Public Property KinkAngleDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace