RhinoCommon API
ICollapsibleSectionHolder.EmptyText Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSectionHolder.EmptyText"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
string EmptyText { set; }
WriteOnly Property EmptyText As String
	Set
Property Value
Type: String
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace