RhinoCommon API
PhysicallyBasedMaterial.Opacity Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.Opacity"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double Opacity { get; set; }
Public Property Opacity As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace