RhinoCommon API
RhinoSettings.CustomImageSizeIsPreset Property
[Missing <summary> documentation for "P:Rhino.Render.DataSources.RhinoSettings.CustomImageSizeIsPreset"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool CustomImageSizeIsPreset { get; set; }
Public Property CustomImageSizeIsPreset As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace