RhinoCommon API
Brep.VariationalPatchSettings.AngleToleranceRadians Property
 Tolerance for normal (G1) constraints
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double AngleToleranceRadians { get; set; }
Public Property AngleToleranceRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace