RhinoCommon API
File3dmMeshModifiers.EdgeSoftening Property
 Returns an object that provides access to edge softening information. If no edge softening information is present, the method returns null.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmEdgeSoftening EdgeSoftening { get; }
Public ReadOnly Property EdgeSoftening As File3dmEdgeSoftening
	Get
Property Value
Type: File3dmEdgeSoftening
See Also
Reference
File3dmMeshModifiers Class
Rhino.FileIO Namespace