RhinoCommon API
RenderContent.CanBeEdited Property
 Determines if the content can be edited.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool CanBeEdited { get; }
Public ReadOnly Property CanBeEdited As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderContent Class
Rhino.Render Namespace