RhinoCommon API
DisplayPipelineAttributes.ShowPoints Property
Show points.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public bool ShowPoints { get; set; }
Public Property ShowPoints As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace