RhinoCommon API
IHelp.HelpUrl Property
 Help topic URL which gets passed to RhinoHelp.Show
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
string HelpUrl { get; }
ReadOnly Property HelpUrl As String
	Get
Property Value
Type: String
See Also
Reference
IHelp Interface
Rhino.UI Namespace