RhinoCommon API
RenderMaterial.PlasterMaterialGuid Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PlasterMaterialGuid"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid PlasterMaterialGuid { get; }
Public Shared ReadOnly Property PlasterMaterialGuid As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace