RhinoCommon API
RenderMaterial.SmellsLikePlaster Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikePlaster"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SmellsLikePlaster { get; }
Public ReadOnly Property SmellsLikePlaster As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace