RhinoCommon API
PythonScript.ScriptContextCommand Property
 Command associated with this script. Used for localiation
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Command ScriptContextCommand { get; set; }
Public Property ScriptContextCommand As Command
	Get
	Set
Property Value
Type: Command
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace