RhinoCommon API
Markup.CreatedBy Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Markup.CreatedBy"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string CreatedBy { get; }
Public ReadOnly Property CreatedBy As String
	Get
Property Value
Type: String
See Also
Reference
Markup Class
Rhino.DocObjects Namespace