RhinoCommon API
MeshInstance.MeshId Property
 Get the mesh identifier for this mesh instance.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid MeshId { get; }
Public ReadOnly Property MeshId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace