RhinoCommon API
SubDEdgeSharpness.Nan Property
 A sharpness whose ends are both NaN. This is what the factory methods return when their input is not valid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static SubDEdgeSharpness Nan { get; }
Public Shared ReadOnly Property Nan As SubDEdgeSharpness
	Get
Property Value
Type: SubDEdgeSharpness
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace