RhinoCommon API
GetCurve.Points Property
 The points picked during the most recent call to GetControlPointCurve or GetInterpolatedCurve. Empty before the first call. When the curve was closed, the first point is repeated at the end.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Point3d[] Points { get; }
Public ReadOnly Property Points As Point3d()
	Get
Property Value
Type: Point3d[]
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace