RhinoCommon API
FileCsvWriteOptions.AreaMoments Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.AreaMoments"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool AreaMoments { get; set; }
Public Property AreaMoments As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace