RhinoCommon API
ModelAidSettingsState.OnlySnapToSelected Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettingsState.OnlySnapToSelected"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool OnlySnapToSelected { get; set; }
Public Property OnlySnapToSelected As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace