RhinoCommon API
CurvatureGraphSettingsState.SampleDensity Property
 Gets or sets the sample density.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int SampleDensity { get; set; }
Public Property SampleDensity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
CurvatureGraphSettingsState Class
Rhino.ApplicationSettings Namespace