RhinoCommon API
DimensionStyle.BaselineSpacing Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.BaselineSpacing"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double BaselineSpacing { get; set; }
Public Property BaselineSpacing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace