RhinoCommon API
MeshInstance.CastShadows Property
Note: This API is now obsolete.
 Return true if mesh instance should cast shadows
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Use ObjectAttributes")]
public bool CastShadows { get; }
<ObsoleteAttribute("Use ObjectAttributes")>
Public ReadOnly Property CastShadows As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace