RhinoCommon API
FileCsvWriteOptions.LayerIndex Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.LayerIndex"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool LayerIndex { get; set; }
Public Property LayerIndex As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace