RhinoCommon API
FileSkpReadOptions.JoinEdges Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSkpReadOptions.JoinEdges"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool JoinEdges { get; set; }
Public Property JoinEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSkpReadOptions Class
Rhino.FileIO Namespace