RhinoCommon API
File3dmNamedConstructionPlanes.Item Property
 Gets the named construction plane at an index.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ConstructionPlane this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As ConstructionPlane
	Get
Parameters
index
Type: System.Int32
Zero based array index.
Return Value
Type: ConstructionPlane
 A construction plane at the index, or null on error.
See Also
Reference
File3dmNamedConstructionPlanes Class
Rhino.FileIO Namespace