RhinoCommon API
IZooClientUtilities.LoggedInUserName Property
 Returns the name of the logged in user, or null if the user is not logged in.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
string LoggedInUserName { get; }
ReadOnly Property LoggedInUserName As String
	Get
Property Value
Type: String
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace