RhinoCommon API
DisplayPipelineAttributes.SubDSmoothInteriorApplyPattern Property
 Apply pattern to the edge
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public bool SubDSmoothInteriorApplyPattern { get; set; }
Public Property SubDSmoothInteriorApplyPattern As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace