RhinoCommon API
PersistentSettingsSavedEventArgs.SavedByThisRhino Property
 Will be true if this instance of Rhino is writing the settings file or false if a different instance of Rhino has modified the settings file.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SavedByThisRhino { get; }
Public ReadOnly Property SavedByThisRhino As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PersistentSettingsSavedEventArgs Class
Rhino Namespace