RhinoCommon API
CustomRenderContentAttribute.IsNormalMap Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.IsNormalMap"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.16
Syntax
public bool IsNormalMap { get; set; }
Public Property IsNormalMap As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace