RhinoCommon API
AppearanceSettingsState.SelectionWindowCrossingFillColor Property
 Gets or sets the color used to fill a crossing selection window
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Color SelectionWindowCrossingFillColor { get; set; }
Public Property SelectionWindowCrossingFillColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace