RhinoCommon API
Extrusion.PathEnd Property
 Gets the end point of the path.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d PathEnd { get; }
Public ReadOnly Property PathEnd As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace