RhinoCommon API
UserInterfaceCheckBox.Checked Property
 Convenience for the two state case. Checked is true when the state is On, and an indeterminate check box is not checked.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Checked { get; set; }
Public Property Checked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
UserInterfaceCheckBox Class
Rhino.UI Namespace