RhinoCommon API
GeneralSettingsState.MiddleMouseMode Property
 Gets or sets what happens when the user clicks the middle mouse.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public MiddleMouseMode MiddleMouseMode { get; set; }
Public Property MiddleMouseMode As MiddleMouseMode
	Get
	Set
Property Value
Type: MiddleMouseMode
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace