RhinoCommon API
DisplayPipeline.ActiveObject Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.ActiveObject"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public RhinoObject ActiveObject { get; }
Public ReadOnly Property ActiveObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace