RhinoCommon API
IntersectionEvent.PointB Property
 Gets the point on Curve B (or Surface B) where the intersection occurred. If the intersection type is overlap, then this will return the start of the overlap region.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d PointB { get; }
Public ReadOnly Property PointB As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace