RhinoCommon API
Field.UseTextureOn Property
 True if 'texture on' is in use, otherwise false. In the UI 'texture on' is represented as a checkbox. If true then the checbox is shown. If false then the checkbox is not shown.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public bool UseTextureOn { get; set; }
Public Property UseTextureOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Field Class
Rhino.Render.Fields Namespace