RhinoCommon API
FileX3dvWriteOptions.ExportVertexColors Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileX3dvWriteOptions.ExportVertexColors"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ExportVertexColors { get; set; }
Public Property ExportVertexColors As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileX3dvWriteOptions Class
Rhino.FileIO Namespace