RhinoCommon API
RenderContent.ChildSlotName Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContent.ChildSlotName"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public string ChildSlotName { get; set; }
Public Property ChildSlotName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RenderContent Class
Rhino.Render Namespace