RhinoCommon API
ViewInfo.SectionBehavior Property
 How a view will interact with clipping planes
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public ViewSectionBehavior SectionBehavior { get; set; }
Public Property SectionBehavior As ViewSectionBehavior
	Get
	Set
Property Value
Type: ViewSectionBehavior
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace