RhinoCommon API
SoftTransformSettingsState.MeasureDistanceAlong Property
 When true the distance for components affected by soft transform is calculated along the object. Otherwise world distance is used.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool MeasureDistanceAlong { get; set; }
Public Property MeasureDistanceAlong As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SoftTransformSettingsState Class
Rhino.ApplicationSettings Namespace