RhinoCommon API
DisplayPipelineAttributes.ShowIntersections Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ShowIntersections"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ShowIntersections { get; set; }
Public Property ShowIntersections As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace