RhinoCommon API
MeshNgonList.Item Property
 Returns the mesh ngon at the given index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshNgon this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As MeshNgon
	Get
	Set
Parameters
index
Type: System.Int32
Index of face to get. Must be larger than or equal to zero and smaller than the Face Count of the mesh.
Property Value
Type: MeshNgon
Implements
IList<T>.Item[Int32]
IReadOnlyList<T>.Item[Int32]
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace