RhinoCommon API
AppearanceSettings.ShowCursorWhenCrosshairsVisible Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.AppearanceSettings.ShowCursorWhenCrosshairsVisible"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool ShowCursorWhenCrosshairsVisible { get; set; }
Public Shared Property ShowCursorWhenCrosshairsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace