RhinoCommon API
Brep.VariationalPatchResult.Warning Property
 Warnings generated during patch generation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Warning { get; }
Public ReadOnly Property Warning As String
	Get
Property Value
Type: String
See Also
Reference
Brep.VariationalPatchResult Class
Rhino.Geometry Namespace