RhinoCommon API
WorksessionModel.FileTypeId Property
 The id of the plug-in used to read the model's file.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Guid FileTypeId { get; }
Public ReadOnly Property FileTypeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
WorksessionModel Class
Rhino.DocObjects Namespace