RhinoCommon API
File3dmPlugInDetails.Id Property
Plug-in Id
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
File3dmPlugInDetails Class
Rhino.FileIO Namespace