RhinoCommon API
CurveSegment.Index Property
 The index of the curve used by this boundary element.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
CurveSegment Structure
Rhino.Runtime.InteropWrappers Namespace