RhinoCommon API
FileWriteOptions.RhinoDoc Property
Source RhinoDoc that is being written
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
public RhinoDoc RhinoDoc { get; }
Public ReadOnly Property RhinoDoc As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace