RhinoCommon API
Dimension.ZeroSuppression Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ZeroSuppression"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.ZeroSuppression ZeroSuppression { get; set; }
Public Property ZeroSuppression As DimensionStyle.ZeroSuppression
	Get
	Set
Property Value
Type: DimensionStyle.ZeroSuppression
See Also
Reference
Dimension Class
Rhino.Geometry Namespace