RhinoCommon API
RhinoDoc.TextureMappingEventArgs.OldMapping Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.TextureMappingEventArgs.OldMapping"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public TextureMapping OldMapping { get; }
Public ReadOnly Property OldMapping As TextureMapping
	Get
Property Value
Type: TextureMapping
See Also
Reference
RhinoDoc.TextureMappingEventArgs Class
Rhino Namespace