RhinoCommon API
SectionStyle.InUse Property
 Returns true if a section style is use by an object, layer, or instance definition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool InUse { get; }
Public ReadOnly Property InUse As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace