RhinoCommon API
SmartTrackSettingsState.ActivePointColor Property
Gets or sets the active point color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color ActivePointColor { get; set; }
Public Property ActivePointColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace