RhinoCommon API
DirectionGripUserInterfaceObject.GripDirection Property
 Constrained direction of grip
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Vector3d GripDirection { get; set; }
Public Property GripDirection As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
DirectionGripUserInterfaceObject Class
Rhino.UI Namespace