RhinoCommon API
FileObjWriteOptions.MergeNestedGroupingNames Property
 Setting to merge nested layer or group names into a single OBJ group name
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public bool MergeNestedGroupingNames { get; set; }
Public Property MergeNestedGroupingNames As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
 Setting this to true will take a layer setup like this in Rhino Grandparent Parent Child and make a group name of Grandparent__Parent__Child in obj. If false it will be 3 separate group names in obj and will look like this in the file. g Grandparent Parent Child
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace