RhinoCommon API
ObjectAttributes.Decals Property
 Gets all object decals associated with this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public Decals Decals { get; }
Public ReadOnly Property Decals As Decals
	Get
Property Value
Type: Decals
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace