RhinoCommon API
Transform2d.Item Property
 Gets or sets the matrix value at the given row and column indices.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double this[
	int row,
	int column
] { get; set; }
Public Default Property Item (
	row As Integer,
	column As Integer
) As Double
	Get
	Set
Parameters
row
Type: System.Int32
Index of row to access, must be 0 or 1.
column
Type: System.Int32
Index of column to access, must be 0, 1 or 2.
Property Value
Type: Double
The new value at [row, column]
Return Value
Type: Double
The value at [row, column]
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace