RhinoCommon API
GetCylinder.Cap Property
 Gets or sets whether or not the output should be capped.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Cap { get; set; }
Public Property Cap As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace