RhinoCommon API
File3dmDisplacement.RefineSensitivity Property
 Specifies how sensitive the divider for contrasts is on the displacement texture. Specify 1 to split all mesh edges on each refine step. Specify 0.99 to make even slight contrasts on the displacement texture cause edges to be split. Specifying 0.01 only splits edges where heavy contrast exists.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double RefineSensitivity { get; set; }
Public Property RefineSensitivity As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace