RhinoCommon API
BrepFace.ProxyBrepSubDFaceId Property
 If this face is part of a brep created by SubD.ProxyBrep(), then the subd component id of the corresponding SubD face is returned. Otherwise 0 is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.19
Syntax
public uint ProxyBrepSubDFaceId { get; }
Public ReadOnly Property ProxyBrepSubDFaceId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace