RhinoCommon API
GumballSettings.XAxisColor Property
 Specifies the gumball x axis color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Color XAxisColor { get; set; }
Public Shared Property XAxisColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace