RhinoCommon API
RhinoDoc.UndoRecordingEnabled Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.UndoRecordingEnabled"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool UndoRecordingEnabled { get; set; }
Public Property UndoRecordingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace