RhinoCommon API
ViewSettingsState.DefinedViewSetCPlane Property
 Gets or sets the 'named views set CPlane' value.
When true, restoring a named view causes the construction plane saved with that view to also restore.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool DefinedViewSetCPlane { get; set; }
Public Property DefinedViewSetCPlane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace