RhinoCommon API
BezierSurface.IsValid Property
Tests an object to see if it is valid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace