RhinoCommon API
FileReadOptions.NewMode Property
 true means we are reading template information in something like a OnFileNew event.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool NewMode { get; set; }
Public Property NewMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace