RhinoCommon API
DimensionStyle.ToleranceLowerValue Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ToleranceLowerValue"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ToleranceLowerValue { get; set; }
Public Property ToleranceLowerValue As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace