RhinoCommon API
Vector3f.IsZero Property
 Gets a value indicating whether the X, Y, and Z values are all equal to 0.0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsZero { get; }
Public ReadOnly Property IsZero As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace