RhinoCommon API
Brep.Vertices Property
 Gets the brep vertices list accessor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.5
Syntax
public BrepVertexList Vertices { get; }
Public ReadOnly Property Vertices As BrepVertexList
	Get
Property Value
Type: BrepVertexList
See Also
Reference
Brep Class
Rhino.Geometry Namespace