RhinoCommon API
FileSettingsState.AutoSaveMeshes Property
Saves render and display meshes in autosave file.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool AutoSaveMeshes { get; set; }
Public Property AutoSaveMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace