RhinoCommon API
RhinoViewport.IsParallelProjection Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.IsParallelProjection"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsParallelProjection { get; }
Public ReadOnly Property IsParallelProjection As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace