RhinoCommon API
DisplayPipelineAttributes.SurfaceIsoColorsUsed Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceIsoColorsUsed"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public bool SurfaceIsoColorsUsed { get; set; }
Public Property SurfaceIsoColorsUsed As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace