RhinoCommon API
AnnotationBase.HasPropertyOverrides Property
[Missing <summary> documentation for "P:Rhino.Geometry.AnnotationBase.HasPropertyOverrides"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool HasPropertyOverrides { get; }
Public ReadOnly Property HasPropertyOverrides As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace