RhinoCommon API
MeshCurvatureStats.InfiniteCount Property
 Gets the number of "infinite" values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int InfiniteCount { get; }
Public ReadOnly Property InfiniteCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCurvatureStats Class
Rhino.Geometry Namespace