RhinoCommon API
HatchPattern.Defaults.Plus Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Defaults.Plus"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static HatchPattern Plus { get; }
Public Shared ReadOnly Property Plus As HatchPattern
	Get
Property Value
Type: HatchPattern
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace