RhinoCommon API
VolumeMassProperties.WorldCoordinatesMomentsOfInertiaError Property
 Uncertainty in world coordinates moments of inertia calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d WorldCoordinatesMomentsOfInertiaError { get; }
Public ReadOnly Property WorldCoordinatesMomentsOfInertiaError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace