RhinoCommon API
DimensionStyle.SuppressDimensionLine1 Property
 Suppresses the dimension line and arrowhead between the first extension line and the dimension text.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SuppressDimensionLine1 { get; set; }
Public Property SuppressDimensionLine1 As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace