RhinoCommon API
RhinoDoc.Modified Property
 Returns or sets the document's modified flag.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Modified { get; set; }
Public Property Modified As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace