RhinoCommon API
GetTorus.PromptForMeshDensity Property
 Set true if you are prompting for a mesh or subd torus.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool PromptForMeshDensity { get; set; }
Public Property PromptForMeshDensity As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetTorus Class
Rhino.Input.Custom Namespace