RhinoCommon API
HostUtils.RunningAsRhinoInside Property
 Indicates whether Rhino is running inside another application. returns false if Rhino.exe is the top-level application. returns true if some other application is the top-level application.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool RunningAsRhinoInside { get; }
Public Shared ReadOnly Property RunningAsRhinoInside As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace