RhinoCommon API
Transform.Determinant Property
 The determinant of this 4x4 matrix.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Determinant { get; }
Public ReadOnly Property Determinant As Double
	Get
Property Value
Type: Double
See Also
Reference
Transform Structure
Rhino.Geometry Namespace