RhinoCommon API
GetObject.ObjectsWerePreselected Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetObject.ObjectsWerePreselected"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ObjectsWerePreselected { get; }
Public ReadOnly Property ObjectsWerePreselected As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace