RhinoCommon API
EmapAnalysisSettings.FileName Property
 Gets or sets the current emap file name.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static string FileName { get; set; }
Public Shared Property FileName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
EmapAnalysisSettings Class
Rhino.ApplicationSettings Namespace