RhinoCommon API
TrulyObservableOrderedSet<T>.Item Property
 Gets or replaces an element in the ordered set at the specified index.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public T this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As T
	Get
	Set
Parameters
index
Type: System.Int32
The index of the element.
Return Value
Type: T
the element at the given index.
Implements
IList<T>.Item[Int32]
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown if the index passed is out of bounds.
InvalidOperationException | Thrown if the item that will be replaced at the specified index cannot be modified by the current assembly.
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace