RhinoCommon API
UserInterfaceControl.TextHeight Property
 Height of the text in logical pixels. A value of 0, the default, means use the standard control font height. Controls that draw no text ignore this setting.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public float TextHeight { get; set; }
Public Property TextHeight As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
UserInterfaceControl Class
Rhino.UI Namespace