RhinoCommon API
ModelAidSettingsState.ExtendToApparentIntersection Property
Gets or sets the enabled state of Rhino's extend to apparent intersections.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ExtendToApparentIntersection { get; set; }
Public Property ExtendToApparentIntersection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace