RhinoCommon API
AppearanceSettingsState.CommandPromptBackgroundColor Property
Gets or sets the command prompt background color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color CommandPromptBackgroundColor { get; set; }
Public Property CommandPromptBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace