RhinoCommon API
CurveObject.CurveGeometry Property
 Returns the underlying curve geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Curve CurveGeometry { get; }
Public ReadOnly Property CurveGeometry As Curve
	Get
Property Value
Type: Curve
See Also
Reference
CurveObject Class
Rhino.DocObjects Namespace