RhinoCommon API
Color4f.G Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.G"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public float G { get; }
Public ReadOnly Property G As Single
	Get
Property Value
Type: Single
See Also
Reference
Color4f Structure
Rhino.Display Namespace