RhinoCommon API
CommandAlias.Instant Property
 Is the command alias instant? Instant aliases run without the need for spacebar or enter
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Instant { get; set; }
Public Property Instant As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CommandAlias Class
Rhino.ApplicationSettings Namespace