RhinoCommon API
StringParserSettings.ParseAddition Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseAddition"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseAddition { get; set; }
Public Property ParseAddition As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace