RhinoCommon API
RhinoDoc.Manifest Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.Manifest"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ManifestTable Manifest { get; }
Public ReadOnly Property Manifest As ManifestTable
	Get
Property Value
Type: ManifestTable
See Also
Reference
RhinoDoc Class
Rhino Namespace