RhinoCommon API
Texture.MagFilter Property
 The MagFilter setting controls how the color of the image pixel is calculated when the image pixel corresponds to a fraction of a texture bitmap pixel.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public TextureFilter MagFilter { get; set; }
Public Property MagFilter As TextureFilter
	Get
	Set
Property Value
Type: TextureFilter
See Also
Reference
Texture Class
Rhino.DocObjects Namespace