RhinoCommon API
IntersectionEvent.OverlapB Property
 Gets the interval on curve B where the overlap occurs. If the intersection type is not overlap, this value is meaningless.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Interval OverlapB { get; }
Public ReadOnly Property OverlapB As Interval
	Get
Property Value
Type: Interval
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace