RhinoCommon API
RenderMeshProviderProgress.Amount Property
 The amount of progress towards the target
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double Amount { get; set; }
Public Property Amount As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RenderMeshProviderProgress Class
Rhino.Render.CustomRenderMeshes Namespace