RhinoCommon API
PointObject.PointGeometry Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PointObject.PointGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point PointGeometry { get; }
Public ReadOnly Property PointGeometry As Point
	Get
Property Value
Type: Point
See Also
Reference
PointObject Class
Rhino.DocObjects Namespace