RhinoCommon API
File3dmObjectTable.Count Property
 Returns the total amount of items in the object table, including lights.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override int Count { get; }
Public Overrides ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
IReadOnlyCollection<T>.Count
ICollection<T>.Count
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace