RhinoCommon API
Font.EnglishFaceName Property
 Returns English Face name
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.9
Syntax
public string EnglishFaceName { get; }
Public ReadOnly Property EnglishFaceName As String
	Get
Property Value
Type: String
See Also
Reference
Font Class
Rhino.DocObjects Namespace