RhinoCommon API
LightTableEventArgs.EventType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTableEventArgs.EventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public LightTableEventType EventType { get; }
Public ReadOnly Property EventType As LightTableEventType
	Get
Property Value
Type: LightTableEventType
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace