RhinoCommon API
ComponentStatus.Damaged Property
 The damaged flag is checked.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static ComponentStatus Damaged { get; }
Public Shared ReadOnly Property Damaged As ComponentStatus
	Get
Property Value
Type: ComponentStatus
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace