RhinoCommon API
PlugInInfo.ShipsWithRhino Property
 Returns true if the plug-in ships with Rhino, false otherwise.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ShipsWithRhino { get; }
Public ReadOnly Property ShipsWithRhino As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace