RhinoCommon API
ModelAidSettings.Osnap Property
Enables or disables Rhino's object snap modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool Osnap { get; set; }
Public Shared Property Osnap As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace