RhinoCommon API
NurbsCurvePointList.Count Property
 Gets the number of control points in this curve.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace