RhinoCommon API
ViewportInfo.CameraLocation Property
 Gets the camera location (position) point.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d CameraLocation { get; }
Public ReadOnly Property CameraLocation As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace