RhinoCommon API
GripUserInterfaceObject.GripStrokeWidth Property
[Missing <summary> documentation for "P:Rhino.UI.GripUserInterfaceObject.GripStrokeWidth"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public float GripStrokeWidth { get; set; }
Public Property GripStrokeWidth As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
GripUserInterfaceObject Class
Rhino.UI Namespace