RhinoCommon API
ObjectAttributes.HatchBackgroundFillPrintColor Property
 Fill color for hatches when printing (default is Color.Empty)
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color HatchBackgroundFillPrintColor { get; set; }
Public Property HatchBackgroundFillPrintColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace