RhinoCommon API
FileDwgWriteOptions.ExportMeshesAs Property
Rhino meshes as polyface meshes or 3dfaces
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileDwgWriteOptions.ExportMeshMode ExportMeshesAs { get; set; }
Public Property ExportMeshesAs As FileDwgWriteOptions.ExportMeshMode
	Get
	Set
Property Value
Type: FileDwgWriteOptions.ExportMeshMode
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace