RhinoCommon API
RhinoApp.IsInternetAccessAllowed Property
 Returns true when Rhino is allowed to access the Internet, false otherwise. Note, this does not test if Internet access is available.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public static bool IsInternetAccessAllowed { get; }
Public Shared ReadOnly Property IsInternetAccessAllowed As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace