RhinoCommon API
FileSettings.SaveViewChanges Property
true for users who consider view changes a document change.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool SaveViewChanges { get; set; }
Public Shared Property SaveViewChanges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace