RhinoCommon API
PersistentSettings.ChildKeys Property
 Gets a collection containing the keys in the settings dictionary.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ICollection<string> ChildKeys { get; }
Public ReadOnly Property ChildKeys As ICollection(Of String)
	Get
Property Value
Type: ICollection<String>
See Also
Reference
PersistentSettings Class
Rhino Namespace