RhinoCommon API
GripUserInterfaceObject.GripShapeRotationRadians Property
[Missing <summary> documentation for "P:Rhino.UI.GripUserInterfaceObject.GripShapeRotationRadians"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public float GripShapeRotationRadians { get; set; }
Public Property GripShapeRotationRadians As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
GripUserInterfaceObject Class
Rhino.UI Namespace