RhinoCommon API
AppearanceSettingsState.CommandPromptHypertextColor Property
Gets or sets the command prompt hypertext color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color CommandPromptHypertextColor { get; set; }
Public Property CommandPromptHypertextColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace