RhinoCommon API
WorksessionFileLayerValues.Visible Property
Gets or sets whether the layer is visible.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Visible { get; set; }
Public Property Visible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
WorksessionFileLayerValues Class
Rhino.FileIO Namespace