RhinoCommon API
PostEffect.CanDisplayHelp Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffect.CanDisplayHelp"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool CanDisplayHelp { get; }
Public ReadOnly Property CanDisplayHelp As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace