RhinoCommon API
IntersectingMeshPair.FaceIndexA Property
 The index of a face of the first mesh that intersects FaceIndexB, or -1 if it could not be determined.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int FaceIndexA { get; }
Public ReadOnly Property FaceIndexA As Integer
	Get
Property Value
Type: Int32
See Also
Reference
IntersectingMeshPair Structure
Rhino.Geometry.Intersect Namespace