RhinoCommon API
LicenseData.LicenseCount Property
 The number of instances supported by this license. This is provided by the plug in that validated the license.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int LicenseCount { get; set; }
Public Property LicenseCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace