RhinoCommon API
DisplayAttributeMaterial.OverrideObjectColor Property
 Objects acquire color from render materials.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool OverrideObjectColor { get; set; }
Public Property OverrideObjectColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace