RhinoCommon API
RenderWindow.Channel.Height Property
 Return the channel height.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int Height { get; }
Public ReadOnly Property Height As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace