RhinoCommon API
File3dmSettings.CurrentPlotColor Property
The plot colour new objects are created with.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public Color CurrentPlotColor { get; set; }
Public Property CurrentPlotColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace