RhinoCommon API
Transform.IsZero Property
 True if matrix is Zero4x4, ZeroTransformation, or some other type of zero. The value xform[3][3] can be anything.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public bool IsZero { get; }
Public ReadOnly Property IsZero As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Transform Structure
Rhino.Geometry Namespace