RhinoCommon API
RhinoDoc.DistanceDisplayPrecision Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.DistanceDisplayPrecision"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int DistanceDisplayPrecision { get; }
Public ReadOnly Property DistanceDisplayPrecision As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoDoc Class
Rhino Namespace