RhinoCommon API
Dimension.BaselineSpacing Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.BaselineSpacing"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double BaselineSpacing { get; set; }
Public Property BaselineSpacing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace