RhinoCommon API
ObjectPropertiesPage.AllObjectsMustBeSupported Property
 Returns false which only requires a single item of SupportedTypes to be selected. Override if you wish to change the above behavior.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public virtual bool AllObjectsMustBeSupported { get; }
Public Overridable ReadOnly Property AllObjectsMustBeSupported As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace