RhinoCommon API
CommandAliasList.InstantAliasDelayMilliseconds Property
 Timer delay to use before triggering instant aliases
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int InstantAliasDelayMilliseconds { get; set; }
Public Shared Property InstantAliasDelayMilliseconds As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace