RhinoCommon API
ViewCaptureSettings.DrawBackground Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawBackground"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool DrawBackground { get; set; }
Public Property DrawBackground As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace