RhinoCommon API
RebuildCurveOptions.Degree Property
 The degree the rebuit curves will have. Changing the degree can change other options. After changing the degre, user interface code must update all displayed values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Degree { get; set; }
Public Property Degree As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace