RhinoCommon API
Point2f.Item Property
 Accesses the coordinates of this point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Single
	Get
	Set
Parameters
index
Type: System.Int32
Either 0 or 1.
Return Value
Type: Single
If index is 0, the X (first) coordinate. If index is 1, the Y (second) coordinate.
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace