RhinoCommon API
Worksession.Document Property
 Gets the document that owns this worksession.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace