RhinoCommon API
InstanceDefinitionGeometry.IsLinkedType Property
 Returns true if this instance definition is linked to an external source archive, that is, if its UpdateType is Linked or LinkedAndEmbedded.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsLinkedType { get; }
Public ReadOnly Property IsLinkedType As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace