RhinoCommon API
Layer.RenderMaterial Property
 Gets or sets the RenderMaterial for objects on this layer that have MaterialSource() == MaterialFromLayer. A null result indicates that no RenderMaterial has been assigned and the material created by the default Material constructor or the RenderMaterialIndex should be used.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public RenderMaterial RenderMaterial { get; set; }
Public Property RenderMaterial As RenderMaterial
	Get
	Set
Property Value
Type: RenderMaterial
See Also
Reference
Layer Class
Rhino.DocObjects Namespace