RhinoCommon API
FileGltfWriteOptions.UseRenderMeshes Property
 When enabled the meshes already generated for rendering the objects are exported. When disabled the objects are meshed for export using MeshParameters.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UseRenderMeshes { get; set; }
Public Property UseRenderMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace