RhinoCommon API
DisplayPipelineAttributes.SubDBoundaryEdgeColorUsage Property
 Edge color usage
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public DisplayPipelineAttributes.SubDEdgeColorUse SubDBoundaryEdgeColorUsage { get; set; }
Public Property SubDBoundaryEdgeColorUsage As DisplayPipelineAttributes.SubDEdgeColorUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.SubDEdgeColorUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace