RhinoCommon API
MeshingParameters.RefineGrid Property
 Gets or sets a value indicating whether or not the sampling grid can be refined when certain tolerances are not met.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool RefineGrid { get; set; }
Public Property RefineGrid As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace