RhinoCommon API
ComponentFunctionInfo.InputNames Property
 The function input parameter names.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IReadOnlyList<string> InputNames { get; }
Public ReadOnly Property InputNames As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace