RhinoCommon API
FileCsvWriteOptions.SurroundPointsWithDoubleQuotes Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.SurroundPointsWithDoubleQuotes"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SurroundPointsWithDoubleQuotes { get; set; }
Public Property SurroundPointsWithDoubleQuotes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace