RhinoCommon API
ViewCaptureSettings.OffsetAnchor Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.OffsetAnchor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public ViewCaptureSettings.AnchorLocation OffsetAnchor { get; set; }
Public Property OffsetAnchor As ViewCaptureSettings.AnchorLocation
	Get
	Set
Property Value
Type: ViewCaptureSettings.AnchorLocation
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace