RhinoCommon API
PersistentSettings.StringListRootKey Property
 Adding this string to a string list when calling SetStringList will cause the ProgramData setting to get inserted at that location in the list.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string StringListRootKey { get; }
Public Shared ReadOnly Property StringListRootKey As String
	Get
Property Value
Type: String
See Also
Reference
PersistentSettings Class
Rhino Namespace