RhinoCommon API
UserInterfaceSlider.HorizontalOrientation Property
[Missing <summary> documentation for "P:Rhino.UI.UserInterfaceSlider.HorizontalOrientation"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool HorizontalOrientation { get; set; }
Public Property HorizontalOrientation As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
UserInterfaceSlider Class
Rhino.UI Namespace