RhinoCommon API
AppearanceSettings.ViewportBackgroundColor Property
 Gets or sets the viewport background color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color ViewportBackgroundColor { get; set; }
Public Shared Property ViewportBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace