RhinoCommon API
GumballSettings.EnableGumball Property
 Turns the gumball widget on any time objects are selected.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool EnableGumball { get; set; }
Public Shared Property EnableGumball As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace