RhinoCommon API
NurbsCurveFitParameters.PointCountRangeMinimum Property
[Missing <summary> documentation for "P:Rhino.Geometry.NurbsCurveFitParameters.PointCountRangeMinimum"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PointCountRangeMinimum { get; }
Public ReadOnly Property PointCountRangeMinimum As Integer
	Get
Return Value
Type: Int32
 Minimum number of distinct control points in the NURBS curve fit.
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace