RhinoCommon API
CurveBooleanRegions.PointCount Property
 If this object were created using the Curve.CreateBooleanRegions override that accepts a collection of points as input, then this value will be equal to the length of the points collection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int PointCount { get; }
Public ReadOnly Property PointCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
CurveBooleanRegions Class
Rhino.Geometry Namespace