RhinoCommon API
FileObjReadOptions.MorphTargetOnly Property
 TODO
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool MorphTargetOnly { get; set; }
Public Property MorphTargetOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace