RhinoCommon API
ModelAidSettings.HighlightControlPolygon Property
Gets or sets the enabled state of Rhino's highlight dialog modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool HighlightControlPolygon { get; set; }
Public Shared Property HighlightControlPolygon As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace