RhinoCommon API
RebuildCurveOptions.CurrentOutputSpanCountRange Property
 The range of span counts in the rebuilt curves calculated using the current properties. When multiple target curves are being rebuilt with variable point counts or kink splittings, the resulting rebuilt curves can have a range of span counts. CurrentOutputSpanCountRange.I = minimum span count. CurrentOutputSpanCountRange.J = maximum span count. NOTE WELL: Do not confuse span counts with point counts. The span count is always <= PointCount - Degree and is the number of spans in the rebuilt NURBS curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IndexPair CurrentOutputSpanCountRange { get; }
Public ReadOnly Property CurrentOutputSpanCountRange As IndexPair
	Get
Property Value
Type: IndexPair
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace