RhinoCommon API
RhinoApp.InvokeRequired Property
 Returns true if we are currently not running on the main user interface thread
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool InvokeRequired { get; }
Public Shared ReadOnly Property InvokeRequired As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace