RhinoCommon API
AppearanceSettings.SelectionWindowStrokeColor Property
 Color used to draw stroke for selection window
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Color SelectionWindowStrokeColor { get; set; }
Public Shared Property SelectionWindowStrokeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace