RhinoCommon API
SweepOneRail.IsFreeform Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.IsFreeform"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsFreeform { get; }
Public ReadOnly Property IsFreeform As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace