RhinoCommon API
RhinoApp.IsPreRelease Property
 Returns true if Rhino is compiled as pre-release build (Beta, WIP) false otherwise
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool IsPreRelease { get; }
Public Shared ReadOnly Property IsPreRelease As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace