RhinoCommon API
ModelAidSettings.OsnapPickboxRadius Property
Enables or disables Rhino's planar modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int OsnapPickboxRadius { get; set; }
Public Shared Property OsnapPickboxRadius As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace