RhinoCommon API
ComponentStatus.IsHighlighted Property
 Returns true if highlighted. False otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsHighlighted { get; }
Public ReadOnly Property IsHighlighted As Boolean
	Get
Return Value
Type: Boolean
The component status for highlighted.
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace