RhinoCommon API
FileObjWriteOptions.VcsFormat Property
 Export vertex colors as 0 == floats (0.0-1.0) or 1 == ints (0-255)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int VcsFormat { get; set; }
Public Property VcsFormat As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace