RhinoCommon API
DisplayPipelineAttributes.UseCustomObjectMaterialBackfaces Property
 Gets or sets whether objects ought to be drawn using a custom material on backfaces.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool UseCustomObjectMaterialBackfaces { get; set; }
Public Property UseCustomObjectMaterialBackfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace