RhinoCommon API
FileCsvWriteOptions.ObjectColor Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.ObjectColor"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ObjectColor { get; set; }
Public Property ObjectColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace