RhinoCommon API
SafeFrame.PerspectiveOnly Property
 Show the safe-frame only in perspective views.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public bool PerspectiveOnly { get; set; }
Public Property PerspectiveOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SafeFrame Class
Rhino.Render Namespace