RhinoCommon API
AppearanceSettings.GridXAxisLineColor Property
 Gets or sets the color of the X axis of the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color GridXAxisLineColor { get; set; }
Public Shared Property GridXAxisLineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace