RhinoCommon API
GpuDeviceInfo.MemoryAsString Property
 Memory of the device as a human-readable string
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public string MemoryAsString { get; }
Public ReadOnly Property MemoryAsString As String
	Get
Property Value
Type: String
See Also
Reference
GpuDeviceInfo Class
Rhino Namespace