RhinoCommon API
DisplayPipelineAttributes.HighlightSurfaces Property
 Shades entire object with highlight color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool HighlightSurfaces { get; set; }
Public Property HighlightSurfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace