RhinoCommon API
ViewCaptureWriter.Pen.Join Property
[Missing <summary> documentation for "P:Rhino.Runtime.ViewCaptureWriter.Pen.Join"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public LineJoinStyle Join { get; }
Public ReadOnly Property Join As LineJoinStyle
	Get
Property Value
Type: LineJoinStyle
See Also
Reference
ViewCaptureWriter.Pen Class
Rhino.Runtime Namespace