RhinoCommon API
FileFbxWriteOptions.SaveViews Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileFbxWriteOptions.SaveViews"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SaveViews { get; set; }
Public Property SaveViews As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileFbxWriteOptions Class
Rhino.FileIO Namespace