RhinoCommon API
DecalCreateParams.MinU Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.MinU"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double MinU { get; set; }
Public Property MinU As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace