RhinoCommon API
FileVdaWriteOptions.Variant Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVdaWriteOptions.Variant"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string Variant { get; set; }
Public Property Variant As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileVdaWriteOptions Class
Rhino.FileIO Namespace