RhinoCommon API
ZebraAnalysisSettingsState.VerticalStripes Property
 Set to true for vertical stripes, or false for horizontal stripes.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public bool VerticalStripes { get; set; }
Public Property VerticalStripes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ZebraAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace