RhinoCommon API
ModelComponent.Id Property
 Gets or sets the ID of the current instance.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public virtual Guid Id { get; set; }
Public Overridable Property Id As Guid
	Get
	Set
Property Value
Type: Guid
Exceptions
Exception | Condition
InvalidOperationException |  When setting the ID failed. This usually happened because the instance ID is already locked.
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace