RhinoCommon API
Triangle3d.MedianC Property
 Gets the median line starting at corner C.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Line MedianC { get; }
Public ReadOnly Property MedianC As Line
	Get
Property Value
Type: Line
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace