RhinoCommon API
AnimationProperties.DisplayMode Property
 Gets or sets the ID of the view display mode (wireframe, shaded...).
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public Guid DisplayMode { get; set; }
Public Property DisplayMode As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace