RhinoCommon API
EdgeAnalysisSettingsState.ShowEdgeColor Property
 Gets or sets a color used to enhance display edges in commands like _ShowEdges and _ShowNakedEdges.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color ShowEdgeColor { get; set; }
Public Property ShowEdgeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
EdgeAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace