RhinoCommon API
GrasshopperDisplayMaterial.Diffuse Property
 Gets or sets the diffuse colour — the colour reached in the brightest areas of the shading. The alpha channel is opacity, following the usual Color convention: A=255 is fully opaque and A=0 fully transparent. Note this differs from Diffuse, which ignores alpha. Default: opaque white.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color Diffuse { get; set; }
Public Property Diffuse As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GrasshopperDisplayMaterial Class
Rhino.Display Namespace