RhinoCommon API
PlugIn.InstalledPlugInCount Property
 Returns the number of installed Rhino plug-ins.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int InstalledPlugInCount { get; }
Public Shared ReadOnly Property InstalledPlugInCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace