RhinoCommon API
FileLwoReadOptions.Unweld Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileLwoReadOptions.Unweld"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Unweld { get; set; }
Public Property Unweld As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileLwoReadOptions Class
Rhino.FileIO Namespace