RhinoCommon API
ProviderIds.ImageFileInfo Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.ImageFileInfo"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public static Guid ImageFileInfo { get; }
Public Shared ReadOnly Property ImageFileInfo As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace