RhinoCommon API
Leader.LeaderLandingLength Property
 Gets or sets the length of the landing line
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double LeaderLandingLength { get; set; }
Public Property LeaderLandingLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Leader Class
Rhino.Geometry Namespace