RhinoCommon API
RhinoDoc.CurrentEnvironment Property
Note: This API is now obsolete.
 Access to the current environment for various uses
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Please use Rhino.Render.RenderSettings methods")]
public ICurrentEnvironment CurrentEnvironment { get; }
<ObsoleteAttribute("Please use Rhino.Render.RenderSettings methods")>
Public ReadOnly Property CurrentEnvironment As ICurrentEnvironment
	Get
Property Value
Type: ICurrentEnvironment
See Also
Reference
RhinoDoc Class
Rhino Namespace