RhinoCommon API
ToolbarGroup.Id Property
 Gets the id of the toolbar group.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ToolbarGroup Class
Rhino.UI Namespace