RhinoCommon API
RenderContentSerializer.FileExtension Property
 File extension associated with this serialize object
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public string FileExtension { get; }
Public ReadOnly Property FileExtension As String
	Get
Property Value
Type: String
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace