RhinoCommon API
Brep.IsManifold Property
 Gets a value indicating whether or not the Brep is manifold. Non manifold breps have at least one edge that is shared among three or more faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsManifold { get; }
Public ReadOnly Property IsManifold As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Brep Class
Rhino.Geometry Namespace