RhinoCommon API
InstanceDefinitionGeometry.UnitSystem Property
 Gets the unit system of the instance definition. If the instance definition was imported from another 3dm file, the unit system may differ from that of the document.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UnitSystem UnitSystem { get; }
Public ReadOnly Property UnitSystem As UnitSystem
	Get
Property Value
Type: UnitSystem
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace