RhinoCommon API
NurbsCurveFitParameters.MaximumDegree Property
 The maximum degree of the fit
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int MaximumDegree { get; }
Public Shared ReadOnly Property MaximumDegree As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace