RhinoCommon API
GrasshopperDisplayMaterial.StipplingAmount Property
 Gets or sets how much of the stipple pattern is turned off, as a fraction from 0 to 1 (used only when Stippling is true). Default: 0.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double StipplingAmount { get; set; }
Public Property StipplingAmount As Double
	Get
	Set
Property Value
Type: Double
Remarks
 The pattern is an 8x8 Bayer mask — 64 cells — and this is the fraction of those cells that stop drawing: 0 turns none off (nothing is stippled away), 0.5 turns off about half of them (32 of 64), and 1 is clamped to 63 of 64, so a trace of the mesh always remains rather than disappearing entirely. Values outside 0 to 1 are clamped.
See Also
Reference
GrasshopperDisplayMaterial Class
Rhino.Display Namespace