RhinoCommon API
ModelAidSettings.ControlPolygonDisplayDensity Property
Gets or sets the control polygon display density.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int ControlPolygonDisplayDensity { get; set; }
Public Shared Property ControlPolygonDisplayDensity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace