RhinoCommon API
FileDwgWriteOptions.CurveUseSegmentLength Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgWriteOptions.CurveUseSegmentLength"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool CurveUseSegmentLength { get; set; }
Public Property CurveUseSegmentLength As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace