RhinoCommon API
TextureMapping.Capped Property
 // The m_bCapped applies to planar, cylinder and box mappings. If m_bCapped is false, the cylinder or box is "infinite", if m_bCapped is true, they are finite. In planar mappings, m_bCapped=false means "the Z texture coordinate will always be 0.0" this is now the default behaviour in Rhino 5.0 - it's what users expect apparently.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public bool Capped { get; set; }
Public Property Capped As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TextureMapping Class
Rhino.Render Namespace