RhinoCommon API
FileDwgWriteOptions.Flatten Property
Project to cplane or view
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileDwgWriteOptions.FlattenMode Flatten { get; set; }
Public Property Flatten As FileDwgWriteOptions.FlattenMode
	Get
	Set
Property Value
Type: FileDwgWriteOptions.FlattenMode
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace