RhinoCommon API
File3mfWriteOptions.Copyright Property
[Missing <summary> documentation for "P:Rhino.FileIO.File3mfWriteOptions.Copyright"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public string Copyright { get; set; }
Public Property Copyright As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3mfWriteOptions Class
Rhino.FileIO Namespace