RhinoCommon API
ViewSettings.TwoPointPerspectiveLensLength Property
 Gets the two point perspective lens length. The default is 20mm.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.20
Syntax
public static double TwoPointPerspectiveLensLength { get; }
Public Shared ReadOnly Property TwoPointPerspectiveLensLength As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace