RhinoCommon API
RenderWindowClonedEventArgs.OldRenderWindow Property
[Missing <summary> documentation for "P:Rhino.Render.RenderWindowClonedEventArgs.OldRenderWindow"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public RenderWindow OldRenderWindow { get; }
Public ReadOnly Property OldRenderWindow As RenderWindow
	Get
Property Value
Type: RenderWindow
See Also
Reference
RenderWindowClonedEventArgs Class
Rhino.Render Namespace