RhinoCommon API
PlugInInfo.FileTypeDescriptions Property
 Returns the description of supported file types for file import and file export plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string[] FileTypeDescriptions { get; }
Public ReadOnly Property FileTypeDescriptions As String()
	Get
Property Value
Type: String[]
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace