RhinoCommon API
Font.Strikeout Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Strikeout"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool Strikeout { get; }
Public ReadOnly Property Strikeout As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Font Class
Rhino.DocObjects Namespace