RhinoCommon API
ZebraAnalysisSettings.StripeColor Property
 Gets or sets the stripe color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public static Color StripeColor { get; set; }
Public Shared Property StripeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
ZebraAnalysisSettings Class
Rhino.ApplicationSettings Namespace