RhinoCommon API
IsoDrawEffect.UsedBandColorCount Property
[Missing <summary> documentation for "P:Rhino.Display.IsoDrawEffect.UsedBandColorCount"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int UsedBandColorCount { get; set; }
Public Property UsedBandColorCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace