RhinoCommon API
ArcCurve.Radius Property
 Gets the radius of this ArcCurve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Radius { get; }
Public ReadOnly Property Radius As Double
	Get
Property Value
Type: Double
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace