RhinoCommon API
CurvatureGraphSettingsState.SurfaceUHairColor Property
 Gets or sets the surface U hair color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Color SurfaceUHairColor { get; set; }
Public Property SurfaceUHairColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
CurvatureGraphSettingsState Class
Rhino.ApplicationSettings Namespace