RhinoCommon API
Sun.Latitude Property
 The observer's latitude.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Latitude { get; set; }
Public Property Latitude As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Sun Class
Rhino.Render Namespace