RhinoCommon API
EarthAnchorPoint.EarthBasepointLongitude Property
 Gets or sets the point longitude on earth, in degrees.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double EarthBasepointLongitude { get; set; }
Public Property EarthBasepointLongitude As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace