RhinoCommon API
SmartTrackSettingsState.PointColor Property
Gets or sets the point color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color PointColor { get; set; }
Public Property PointColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace