RhinoCommon API
FileWriteOptions.DestinationFileName Property
 For use on Apple frameworks only. Returns the final destination file name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public string DestinationFileName { get; }
Public ReadOnly Property DestinationFileName As String
	Get
Property Value
Type: String
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace