RhinoCommon API
DisplayPen.PatternAutoscale Property
 Scale pattern in detail views
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool PatternAutoscale { get; set; }
Public Property PatternAutoscale As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPen Class
Rhino.Display Namespace