RhinoCommon API
Cone.IsValid Property
 true if plane is valid, height is not zero and radius is not zero.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Cone Structure
Rhino.Geometry Namespace