RhinoCommon API
ChangeQueue.ViewId Property
 Return view ID for a RhinoDoc based ChangeQueue. Returns Guid.Empty if no view was associated with the changequeue, i.e. preview rendering.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid ViewId { get; }
Public ReadOnly Property ViewId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace