RhinoCommon API
FileObjWriteOptions.TrimCurveType Property
 trimming curve option
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public FileObjWriteOptions.CurveType TrimCurveType { get; set; }
Public Property TrimCurveType As FileObjWriteOptions.CurveType
	Get
	Set
Property Value
Type: FileObjWriteOptions.CurveType
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace