RhinoCommon API
PageViewPropertiesChangeEventArgs.PageViewSerialNumber Property
 The serial number of the page view.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public uint PageViewSerialNumber { get; }
Public ReadOnly Property PageViewSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
PageViewPropertiesChangeEventArgs Class
Rhino.Display Namespace