RhinoCommon API
DisplayPipelineAttributes.UseCustomObjectColor Property
 Gets or sets whether objects ought to be drawn using a custom color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool UseCustomObjectColor { get; set; }
Public Property UseCustomObjectColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace