RhinoCommon API
Sun.ManualControlOn Property
Manual control 'on' state. When true, allows the user to set the sun azimuth and altitude directly. When false, the values are computed.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ManualControlOn { get; set; }
Public Property ManualControlOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Sun Class
Rhino.Render Namespace