RhinoCommon API
File3dmWriteOptions.SaveUserData Property
 Include custom user data in the file. Default is true
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
public bool SaveUserData { get; set; }
Public Property SaveUserData As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace