RhinoCommon API
Transform.IsZeroTransformation Property
 True if all values are 0, except for M33 which is 1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public bool IsZeroTransformation { get; }
Public ReadOnly Property IsZeroTransformation As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Transform Structure
Rhino.Geometry Namespace
Transform.IsZeroTransformationWithTolerance(Double)