RhinoCommon API
FileTxtWriteOptions.Delimiter Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileTxtWriteOptions.Delimiter"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileTxtWriteOptions.DelimiterMode Delimiter { get; set; }
Public Property Delimiter As FileTxtWriteOptions.DelimiterMode
	Get
	Set
Property Value
Type: FileTxtWriteOptions.DelimiterMode
See Also
Reference
FileTxtWriteOptions Class
Rhino.FileIO Namespace