RhinoCommon API
DisplayBitmap.Size Property
 Size of the underlying bitmap image
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Size Size { get; }
Public ReadOnly Property Size As Size
	Get
Property Value
Type: Size
See Also
Reference
DisplayBitmap Class
Rhino.Display Namespace