RhinoCommon API
Curve.PointAtMid Property
 Evaluates point at the middle, or mid, of the curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public Point3d PointAtMid { get; }
Public ReadOnly Property PointAtMid As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Curve Class
Rhino.Geometry Namespace