RhinoCommon API
DimensionStyle.AlternateDimensionLengthDisplay Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateDimensionLengthDisplay"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.LengthDisplay AlternateDimensionLengthDisplay { get; set; }
Public Property AlternateDimensionLengthDisplay As DimensionStyle.LengthDisplay
	Get
	Set
Property Value
Type: DimensionStyle.LengthDisplay
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace