RhinoCommon API
ViewSettings.DefinedViewSetCPlane Property
 Gets or sets the 'Named views set CPlane' value.
When true, restoring a named view causes the construction plane saved with that view to also restore.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool DefinedViewSetCPlane { get; set; }
Public Shared Property DefinedViewSetCPlane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace