RhinoCommon API
LengthMassProperties.WorldCoordinatesFirstMoments Property
 Returns the world coordinate first moments if they were able to be calculated. X is integral of "x dm" over the length Y is integral of "y dm" over the length Z is integral of "z dm" over the length.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public Vector3d WorldCoordinatesFirstMoments { get; }
Public ReadOnly Property WorldCoordinatesFirstMoments As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace