RhinoCommon API
ClippingPlaneSurface.PlaneDepth Property
 Distance that the clipping has an effect
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double PlaneDepth { get; set; }
Public Property PlaneDepth As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace