RhinoCommon API
OpenFileDialog.InitialDirectory Property
 Gets or sets the initial directory displayed by the file dialog box.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string InitialDirectory { get; set; }
Public Property InitialDirectory As String
	Get
	Set
Property Value
Type: String
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace