RhinoCommon API
TextureGraphInfo.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.TextureGraphInfo.CppPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
TextureGraphInfo Class
Rhino.Render Namespace