RhinoCommon API
FileStlReadOptions.WeldAngle Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileStlReadOptions.WeldAngle"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double WeldAngle { get; set; }
Public Property WeldAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileStlReadOptions Class
Rhino.FileIO Namespace