RhinoCommon API
MeshThicknessMeasurement.OppositePoint Property
 Gets the point opposite to the measurement point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Point3d OppositePoint { get; }
Public ReadOnly Property OppositePoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
MeshThicknessMeasurement Structure
Rhino.Geometry Namespace