RhinoCommon API
AppearanceSettings.WorldCoordIconYAxisColor Property
 Gets or sets the color of the world coordinate Y axis.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Color WorldCoordIconYAxisColor { get; set; }
Public Shared Property WorldCoordIconYAxisColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace