RhinoCommon API
RebuildCurveOptions.KinkSplitting Property
[Missing <summary> documentation for "P:Rhino.Geometry.RebuildCurveOptions.KinkSplitting"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RebuildCurveKinkSplitting KinkSplitting { get; set; }
Public Property KinkSplitting As RebuildCurveKinkSplitting
	Get
	Set
Property Value
Type: RebuildCurveKinkSplitting
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace