RhinoCommon API
GetColorEventArgs.Title Property
[Missing <summary> documentation for "P:Rhino.UI.GetColorEventArgs.Title"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Title { get; }
Public ReadOnly Property Title As String
	Get
Property Value
Type: String
See Also
Reference
GetColorEventArgs Class
Rhino.UI Namespace