RhinoCommon API
ConstructionPlane.GridZColor Property
 Gets or sets the color of the grid Z-axis mark.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color GridZColor { get; set; }
Public Property GridZColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace