RhinoCommon API
UserInterfaceSection.RenderContent Property
 The RenderContent object that created this user interface object.
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public RenderContent RenderContent { get; }
Public ReadOnly Property RenderContent As RenderContent
	Get
Property Value
Type: RenderContent
See Also
Reference
UserInterfaceSection Class
Rhino.Render.UI Namespace