RhinoCommon API
RhinoTransformObjectsEventArgs.Transform Property
 The transformation to be applied.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public Transform Transform { get; }
Public ReadOnly Property Transform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace