RhinoCommon API
FileTxtReadOptions.Delimiter Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileTxtReadOptions.Delimiter"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileTxtReadOptions.DelimiterMode Delimiter { get; set; }
Public Property Delimiter As FileTxtReadOptions.DelimiterMode
	Get
	Set
Property Value
Type: FileTxtReadOptions.DelimiterMode
See Also
Reference
FileTxtReadOptions Class
Rhino.FileIO Namespace