RhinoCommon API
PointCloud.ContainsHiddenFlags Property
 Gets a value indicating whether or not the points in this point cloud have hidden flags assigned to them.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ContainsHiddenFlags { get; }
Public ReadOnly Property ContainsHiddenFlags As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace