RhinoCommon API
NamedValue.Name Property
[Missing <summary> documentation for "P:Rhino.Render.NamedValue.Name"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
NamedValue Class
Rhino.Render Namespace