RhinoCommon API
GroundPlane.TextureOffset Property
 Texture mapping offset in world units.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector2d TextureOffset { get; set; }
Public Property TextureOffset As Vector2d
	Get
	Set
Property Value
Type: Vector2d
See Also
Reference
GroundPlane Class
Rhino.Render Namespace