RhinoCommon API
PrintedPageDefinition.Description Property
 Name of the page
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
See Also
Reference
PrintedPageDefinition Class
Rhino Namespace