RhinoCommon API
ConstructionPlaneGridDefaults.SnapSpacing Property
 When grid snap is enabled, the distance between snap points. Typically this is the same distance as grid spacing
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public double SnapSpacing { get; set; }
Public Property SnapSpacing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ConstructionPlaneGridDefaults Class
Rhino.DocObjects Namespace