RhinoCommon API
FileWriteOptions.CreateOtherBackupFiles Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.CreateOtherBackupFiles"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool CreateOtherBackupFiles { get; set; }
Public Property CreateOtherBackupFiles As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace