RhinoCommon API
StdVectorGuid.Count Property
 Gets the amount of elements in this vector.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ulong Count { get; }
Public ReadOnly Property Count As ULong
	Get
Property Value
Type: UInt64
See Also
Reference
StdVectorGuid Class
Rhino.Runtime.InteropWrappers Namespace