RhinoCommon API
FileXamlWriteOptions.AddRotationScrollbars Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileXamlWriteOptions.AddRotationScrollbars"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool AddRotationScrollbars { get; set; }
Public Property AddRotationScrollbars As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileXamlWriteOptions Class
Rhino.FileIO Namespace