RhinoCommon API
PlugInInfo.Fax Property
 Returns the fax number of the organization or company that created the plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string Fax { get; }
Public ReadOnly Property Fax As String
	Get
Property Value
Type: String
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace