RhinoCommon API
UndoRecordEntry.SerialNumber Property
 The runtime serial number Rhino assigned to this undo event.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public uint SerialNumber { get; }
Public ReadOnly Property SerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
UndoRecordEntry Class
Rhino Namespace