RhinoCommon API
UserInterfaceRadioButton.CheckedButtonInGroup Property
 The button in this button's group that is on, which can be this button, or null when nothing in the group has been turned on yet. The buttons have to have been added to a document for this to find anything, since it is the native side that keeps track of a group.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public UserInterfaceRadioButton CheckedButtonInGroup { get; }
Public ReadOnly Property CheckedButtonInGroup As UserInterfaceRadioButton
	Get
Property Value
Type: UserInterfaceRadioButton
See Also
Reference
UserInterfaceRadioButton Class
Rhino.UI Namespace