RhinoCommon API
GetTruncatedCone.Height Property
 Height of truncated cone.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GetTruncatedCone Class
Rhino.Input.Custom Namespace