RhinoCommon API
RebuildCurveOptions.CurrentOutputMaximumDeviation Property
 The maximum deviation between a target curve and the corresponding rebuilt curve calculated using the current properties.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double CurrentOutputMaximumDeviation { get; }
Public ReadOnly Property CurrentOutputMaximumDeviation As Double
	Get
Property Value
Type: Double
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace