RhinoCommon API
RhinoObject.EnabledGripsId Property
 Which kind of grips this object currently has on.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid EnabledGripsId { get; }
Public ReadOnly Property EnabledGripsId As Guid
	Get
Property Value
Type: Guid
Remarks
Empty both for default grips and for no grips at all. GripsOn tells those two apart. Record it to replay a grip selection later: handing it back to EnableGrips(Guid) restores the same kind. From a grip, reach it as Owner.EnabledGripsId.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace