RhinoCommon API
WorksessionFileLayerValues.Locked Property
Gets or sets whether the layer is locked.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Locked { get; set; }
Public Property Locked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
WorksessionFileLayerValues Class
Rhino.FileIO Namespace