RhinoCommon API
File3dmCurvePiping.Faceted Property
 Specifies whether the pipe is faceted or not.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Faceted { get; set; }
Public Property Faceted As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmCurvePiping Class
Rhino.FileIO Namespace