RhinoCommon API
LengthMassProperties.Length Property
 Gets the length solution.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace