RhinoCommon API
ICollapsibleSection.ViewModel Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.ViewModel"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
IRdkViewModel ViewModel { get; }
ReadOnly Property ViewModel As IRdkViewModel
	Get
Property Value
Type: IRdkViewModel
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace