RhinoCommon API
FileDwgWriteOptions.IsDefault Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgWriteOptions.IsDefault"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsDefault { get; set; }
Public Property IsDefault As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace