RhinoCommon API
DisplayPipelineAttributes.ShowEdges Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ShowEdges"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ShowEdges { get; set; }
Public Property ShowEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace