RhinoCommon API
RhinoPageView.ActiveDetail Property
 Returns the active detail object. If no detail is active, or if the page is active, then null is returned.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public DetailViewObject ActiveDetail { get; }
Public ReadOnly Property ActiveDetail As DetailViewObject
	Get
Property Value
Type: DetailViewObject
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace