RhinoCommon API
ModelAidSettings.ExtendToApparentIntersection Property
Gets or sets the enabled state of Rhino's extend to apparent intersections.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool ExtendToApparentIntersection { get; set; }
Public Shared Property ExtendToApparentIntersection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace