RhinoCommon API
SmartTrackSettingsState.UseDottedLines Property
Gets or sets a value indicating if lines are drawn dotted.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool UseDottedLines { get; set; }
Public Property UseDottedLines As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace