RhinoCommon API
HostUtils.OperatingSystemVersion Property
 Returns Operating System Version "6.1" | "6.3" | ... | "Unknown"
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public static string OperatingSystemVersion { get; }
Public Shared ReadOnly Property OperatingSystemVersion As String
	Get
Property Value
Type: String
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace