RhinoCommon API
DimensionStyle.FitText Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.FitText"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.20
Syntax
public DimensionStyle.TextFit FitText { get; set; }
Public Property FitText As DimensionStyle.TextFit
	Get
	Set
Property Value
Type: DimensionStyle.TextFit
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace