RhinoCommon API
DateTimeField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public DateTime Value { get; set; }
Public Property Value As DateTime
	Get
	Set
Property Value
Type: DateTime
See Also
Reference
DateTimeField Class
Rhino.Render.Fields Namespace