RhinoCommon API
RhinoDoc.RenderSettings Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderSettings"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RenderSettings RenderSettings { get; set; }
Public Property RenderSettings As RenderSettings
	Get
	Set
Property Value
Type: RenderSettings
See Also
Reference
RhinoDoc Class
Rhino Namespace