RhinoCommon API
MeshInstance.MeshIndex Property
Note: This API is now obsolete.
 Get the mesh index for this mesh instance.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("Will always return 0")]
public int MeshIndex { get; }
<ObsoleteAttribute("Will always return 0")>
Public ReadOnly Property MeshIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace