RhinoCommon API
GeneralSettingsState.MaximumPopupMenuLines Property
 Gets or sets the maximum number of popup menu lines.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int MaximumPopupMenuLines { get; set; }
Public Property MaximumPopupMenuLines As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace