RhinoCommon API
Sun.Vector Property
[Missing <summary> documentation for "P:Rhino.Render.Sun.Vector"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d Vector { get; set; }
Public Property Vector As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
Sun Class
Rhino.Render Namespace