RhinoCommon API
FileObjWriteOptions.SubDMeshType Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileObjWriteOptions.SubDMeshType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public FileObjWriteOptions.SubDMeshing SubDMeshType { get; set; }
Public Property SubDMeshType As FileObjWriteOptions.SubDMeshing
	Get
	Set
Property Value
Type: FileObjWriteOptions.SubDMeshing
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace