RhinoCommon API
DisplayPipelineAttributes.ControlPolygonColor Property
 Control polygon color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public Color ControlPolygonColor { get; set; }
Public Property ControlPolygonColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace