RhinoCommon API
LicenseLease.ProductVersion Property
 Version of product that this lease is issued to. For example, "6.0"
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string ProductVersion { get; }
Public ReadOnly Property ProductVersion As String
	Get
Property Value
Type: String
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace