RhinoCommon API
AngularDimension.AngleRoundoff Property
[Missing <summary> documentation for "P:Rhino.Geometry.AngularDimension.AngleRoundoff"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double AngleRoundoff { get; set; }
Public Property AngleRoundoff As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace