RhinoCommon API
ICollapsibleSectionHolder.LeftMargin Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSectionHolder.LeftMargin"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
int LeftMargin { get; set; }
Property LeftMargin As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace