RhinoCommon API
ReplayHistoryData.Results Property
 Provides access to BOTH inputs and outputs of the replay history operation.
Use this property to then call an appropriate UpdateToX() method and make your custom history support work.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ReplayHistoryResult[] Results { get; }
Public ReadOnly Property Results As ReplayHistoryResult()
	Get
Property Value
Type: ReplayHistoryResult[]
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace