RhinoCommon API
FileIgsWriteOptions.ForceTrimmedSurfaces Property
true means all surfaces will be exported as 143 or 144s CATIA may like this better.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ForceTrimmedSurfaces { get; set; }
Public Property ForceTrimmedSurfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace