RhinoCommon API
FileDwgReadOptions.ModelUnits Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgReadOptions.ModelUnits"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public UnitSystem ModelUnits { get; set; }
Public Property ModelUnits As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
FileDwgReadOptions Class
Rhino.FileIO Namespace