RhinoCommon API
SubDFace.SurfaceCenterNormal Property
 Get the limit surface normal vector at the center of the face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Vector3d SurfaceCenterNormal { get; }
Public ReadOnly Property SurfaceCenterNormal As Vector3d
	Get
Return Value
Type: Vector3d
 Limit surface normal vector at the face's center.
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace