RhinoCommon API
QuadRemeshParameters.AdaptiveQuadCount Property
 Respect the original Target Quad Count value as much as possible. True returns more quads than TargetQuadCount depending on amount of high-curvature areas. Note: this value is ignored when TargetEdgeLength > 0
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool AdaptiveQuadCount { get; set; }
Public Property AdaptiveQuadCount As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
QuadRemeshParameters Class
Rhino.Geometry Namespace