RhinoCommon API
HostUtils.RunningInMono Property
 Tests if this process is currently executing under the Mono runtime.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool RunningInMono { get; }
Public Shared ReadOnly Property RunningInMono As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace