RhinoCommon API
RenderSettings.FlatShade Property
 Gets or sets a value indicating whether to render using flat shading.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool FlatShade { get; set; }
Public Property FlatShade As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderSettings Class
Rhino.Render Namespace