RhinoCommon API
RhinoApp.CommandPrompt Property
Rhino command prompt.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string CommandPrompt { get; set; }
Public Shared Property CommandPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RhinoApp Class
Rhino Namespace