RhinoCommon API
SmartTrackSettings.Parallels Property
Turns on and off the ability to draw parallel tracking lines.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool Parallels { get; set; }
Public Shared Property Parallels As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace