RhinoCommon API
CursorTooltipSettingsState.RelativePointPane Property
 Displays the relative construction plane coordinates and angle from the last picked point.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool RelativePointPane { get; set; }
Public Property RelativePointPane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace