RhinoCommon API
FileStlReadOptions.Weld Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileStlReadOptions.Weld"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Weld { get; set; }
Public Property Weld As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileStlReadOptions Class
Rhino.FileIO Namespace