RhinoCommon API
RealtimeDisplayModeClassInfo.Name Property
 Get human-facing class description for RealtimeDisplayMode implementation. This string might show up in the Rhino UI.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract string Name { get; }
Public MustOverride ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace