RhinoCommon API
File3dmNotes.WindowRectangle Property
 Gets or sets the position of the Notes when they were saved.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Rectangle WindowRectangle { get; set; }
Public Property WindowRectangle As Rectangle
	Get
	Set
Property Value
Type: Rectangle
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace