RhinoCommon API
SerializationOptions.MinRhinoVersion Property
 Gets the earliest serialization version available.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.19
Syntax
public static int MinRhinoVersion { get; }
Public Shared ReadOnly Property MinRhinoVersion As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace