RhinoCommon API
DisplayPipelineAttributes.MeshEdgeColor Property
 Sets the mesh edge color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public Color MeshEdgeColor { get; set; }
Public Property MeshEdgeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace