RhinoCommon API
FileFbxWriteOptions.SaveVertexNormals Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileFbxWriteOptions.SaveVertexNormals"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SaveVertexNormals { get; set; }
Public Property SaveVertexNormals As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileFbxWriteOptions Class
Rhino.FileIO Namespace