RhinoCommon API
RenderContentType.PlugInId Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentType.PlugInId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid PlugInId { get; }
Public ReadOnly Property PlugInId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderContentType Class
Rhino.Render Namespace