RhinoCommon API
GetTorus.InSecondDiameterMode Property
 Second radius option. Determines if the second "size" value is representing a radius or diameter
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool InSecondDiameterMode { get; set; }
Public Property InSecondDiameterMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetTorus Class
Rhino.Input.Custom Namespace