RhinoCommon API
AnimationProperties.RenderFull Property
 Gets or sets a value indicating whether to capture a frame in rendered mode.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public bool RenderFull { get; set; }
Public Property RenderFull As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace