RhinoCommon API
RenderSettings.ImageDpi Property
 Number of dots/inch (dots=pixels) to use when printing and saving bitmaps. The default is 72.0 dots/inch.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public double ImageDpi { get; set; }
Public Property ImageDpi As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RenderSettings Class
Rhino.Render Namespace