RhinoCommon API
FileDwgWriteOptions.CurveUseMaxAngle Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgWriteOptions.CurveUseMaxAngle"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool CurveUseMaxAngle { get; set; }
Public Property CurveUseMaxAngle As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace