RhinoCommon API
FileSlcWriteOptions.AngleBetweenSegmentsDegrees Property
 The angle that determines how smooth the polylines of the slice curves will be. When the number is small you will get a smooth final output but it will take more time to export and a larger file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double AngleBetweenSegmentsDegrees { get; set; }
Public Property AngleBetweenSegmentsDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileSlcWriteOptions Class
Rhino.FileIO Namespace