RhinoCommon API
Cone.Radius Property
 Gets or sets the radius of the cone.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Cone Structure
Rhino.Geometry Namespace