RhinoCommon API
MeshCheckParameters.InvalidNgonCount Property
 Gets the total number of invalid ngons for all meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int InvalidNgonCount { get; }
Public ReadOnly Property InvalidNgonCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace