RhinoCommon API
LengthValue.LengthString Property
 Return length as a string
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string LengthString { get; }
Public ReadOnly Property LengthString As String
	Get
Return Value
Type: String
See Also
Reference
LengthValue Class
Rhino Namespace