RhinoCommon API
RenderPipeline.RenderSessionId Property
 Get the Id associated with this render session, this is useful when looking up Rhino.Render.RenderPanels.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public Guid RenderSessionId { get; }
Public ReadOnly Property RenderSessionId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace