RhinoCommon API
ContentUuids.BasicMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.BasicMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid BasicMaterialType { get; }
Public Shared ReadOnly Property BasicMaterialType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace