RhinoCommon API
FileUsdWriteOptions.DefaultLayer Property
 The root prim for the USD File
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string DefaultLayer { get; set; }
Public Property DefaultLayer As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileUsdWriteOptions Class
Rhino.FileIO Namespace