RhinoCommon API
BezierSurface.IsRational Property
 Gets a value indicating whether or not the surface is rational. Rational surfaces have control-points with custom weights.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool IsRational { get; }
Public ReadOnly Property IsRational As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace