RhinoCommon API
FilePovWriteOptions.ExportAsOneFile Property
[Missing <summary> documentation for "P:Rhino.FileIO.FilePovWriteOptions.ExportAsOneFile"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ExportAsOneFile { get; set; }
Public Property ExportAsOneFile As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FilePovWriteOptions Class
Rhino.FileIO Namespace