RhinoCommon API
Font.IsEngravingFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.IsEngravingFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public bool IsEngravingFont { get; }
Public ReadOnly Property IsEngravingFont As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Font Class
Rhino.DocObjects Namespace