RhinoCommon API
IOpenIDConnectToken.Sub Property
 The unique id for the subject this token represents.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
string Sub { get; }
ReadOnly Property Sub As String
	Get
Property Value
Type: String
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace