RhinoCommon API
PhysicallyBasedMaterial.UseBaseColorTextureAlphaForObjectAlphaTransparencyTexture Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.UseBaseColorTextureAlphaForObjectAlphaTransparencyTexture"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool UseBaseColorTextureAlphaForObjectAlphaTransparencyTexture { get; set; }
Public Property UseBaseColorTextureAlphaForObjectAlphaTransparencyTexture As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace