RhinoCommon API
RebuildCurveOptions.PointCountRangePermitted Property
 If user interface is permitted to set a range of point counts, then PointCountRangePermitted = true and SetPointCountRange() may be used to set the range. Otherwise point count ranges are not permitted\ and user interface must use PointCount to set a single value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool PointCountRangePermitted { get; }
Public ReadOnly Property PointCountRangePermitted As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace