RhinoCommon API
FileSvgReadOptions.ImportFilledObjectAs Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSvgReadOptions.ImportFilledObjectAs"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileSvgReadOptions.ImportFillMode ImportFilledObjectAs { get; set; }
Public Property ImportFilledObjectAs As FileSvgReadOptions.ImportFillMode
	Get
	Set
Property Value
Type: FileSvgReadOptions.ImportFillMode
See Also
Reference
FileSvgReadOptions Class
Rhino.FileIO Namespace