RhinoCommon API
DisplayPipelineAttributes.ShadowMemoryUsage Property
 Value from 1 to 16384 indicating how much memory is to be allocated. Actual memory use is ShadowMemoryUsage*ShadowMemoryUsage*4.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int ShadowMemoryUsage { get; set; }
Public Property ShadowMemoryUsage As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace