RhinoCommon API
ObjectAttributes.HatchBoundaryPlotColorSource Property
 Source for the hatch boundary plot/print color. Determines whether the boundary plot color is read from the layer, from the object's main attribute color, inherited from the parent, or read from the custom override color set by HatchBoundaryPlotColor (ColorCustom).
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public ItemColorSource HatchBoundaryPlotColorSource { get; set; }
Public Property HatchBoundaryPlotColorSource As ItemColorSource
	Get
	Set
Property Value
Type: ItemColorSource
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace