RhinoCommon API
RebuildCurveOptions.InputPointCountRange Property
 The range of point counts in the input curves. InputPointCountRange.I = minimum input curve point count. InputPointCountRange.J = maximum input curve point count.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public IndexPair InputPointCountRange { get; }
Public ReadOnly Property InputPointCountRange As IndexPair
	Get
Property Value
Type: IndexPair
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace