RhinoCommon API
ComponentFunctionInfo.OutputNames Property
 Grasshopper returns several items in general. This property returns the output names.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IReadOnlyList<string> OutputNames { get; }
Public ReadOnly Property OutputNames As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace