RhinoCommon API
HiddenLineDrawingSegment.ParentCurve Property
 This curve is a sub-curve of the returned HiddenLineDrawingFullCurve object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public HiddenLineDrawingObjectCurve ParentCurve { get; }
Public ReadOnly Property ParentCurve As HiddenLineDrawingObjectCurve
	Get
Property Value
Type: HiddenLineDrawingObjectCurve
See Also
Reference
HiddenLineDrawingSegment Class
Rhino.Geometry Namespace