RhinoCommon API
HostUtils.RhinoAssemblyDirectory Property
 Gets the Rhino system managed assembly directory.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string RhinoAssemblyDirectory { get; }
Public Shared ReadOnly Property RhinoAssemblyDirectory As String
	Get
Property Value
Type: String
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace