RhinoCommon API
RealtimeDisplayModeClassInfo.RequiredDisplayTechnology Property
 Override to return the display techonology your DisplayMode requires for the viewport to be running in.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public virtual DisplayTechnology RequiredDisplayTechnology { get; }
Public Overridable ReadOnly Property RequiredDisplayTechnology As DisplayTechnology
	Get
Property Value
Type: DisplayTechnology
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace