RhinoCommon API
FileSettings.HelpFilePath Property
 Gets the Rhino help file path.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string HelpFilePath { get; }
Public Shared ReadOnly Property HelpFilePath As String
	Get
Property Value
Type: String
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace