RhinoCommon API
Vector3d.Z Property
 Gets or sets the Z (third) component of the vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Z { get; set; }
Public Property Z As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace