RhinoCommon API
Analytics.AppInstallerId Property
 App Installer Id. In Rhino, we use this to differentiate between different builds such as "WIP" and "Commercial". Maps to Google Analytics parameter 'aiid'
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string AppInstallerId { get; set; }
Public Property AppInstallerId As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Analytics Class
Rhino.Runtime Namespace