RhinoCommon API
ViewCaptureSettings.ArrowheadSizeMillimeters Property
 Arrowhead size in millimeters.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public double ArrowheadSizeMillimeters { get; set; }
Public Property ArrowheadSizeMillimeters As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace