RhinoCommon API
LicenseData.ErrorMessage Property
 Error message set by calls to callback functions
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string ErrorMessage { get; set; }
Public Property ErrorMessage As String
	Get
	Set
Property Value
Type: String
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace