RhinoCommon API
ColorGradient.GradientType Property
 Gradient fill type associated with this hatch
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public GradientType GradientType { get; set; }
Public Property GradientType As GradientType
	Get
	Set
Property Value
Type: GradientType
See Also
Reference
ColorGradient Class
Rhino.Display Namespace