RhinoCommon API
ArchivableDictionary.ChangeSerialNumber Property
 Retrieve current change serial number. This is a number that gets increased each time a datum is set or changed.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public uint ChangeSerialNumber { get; }
Public ReadOnly Property ChangeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace