RhinoCommon API
SubDVertex.Next Property
 Next vertex in linked list of vertices on this level
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDVertex Next { get; }
Public ReadOnly Property Next As SubDVertex
	Get
Property Value
Type: SubDVertex
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace