RhinoCommon API
GeneralSettings.MaximumPopupMenuLines Property
 Gets or sets the maximum number of popup menu lines.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int MaximumPopupMenuLines { get; set; }
Public Shared Property MaximumPopupMenuLines As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace