RhinoCommon API
NameHash.ParentId Property
 Only useful if this participates in a tree structure, as with layers.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid ParentId { get; }
Public ReadOnly Property ParentId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
NameHash Class
Rhino.FileIO Namespace