RhinoCommon API
SimulatedTexture.Rotation Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.Rotation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public double Rotation { get; set; }
Public Property Rotation As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace