RhinoCommon API
SquishParameters.Algorithm Property
 The flattening algorithm to use: Geometric: (scale independent)the "spring" constant is proportional to 1/L^2 and the result is independent of scale. PhysicalStress: (scale dependent) the "spring" constant is proportional to 1/L.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public SquishFlatteningAlgorithm Algorithm { get; set; }
Public Property Algorithm As SquishFlatteningAlgorithm
	Get
	Set
Property Value
Type: SquishFlatteningAlgorithm
See Also
Reference
SquishParameters Class
Rhino.Geometry Namespace