RhinoCommon API
UndoRedoEventArgs.IsBeginRedo Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsBeginRedo"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsBeginRedo { get; }
Public ReadOnly Property IsBeginRedo As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace