RhinoCommon API
NamedViewTable.Selection Property
 Returns the current selection in the Named Views panel. If more than one such panel is open, it will return the selection in the most recently opened panel.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public string[] Selection { get; }
Public ReadOnly Property Selection As String()
	Get
Property Value
Type: String[]
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace