RhinoCommon API
RhinoApp.IsRunningAutomated Property
Is Rhino currently being executed through automation
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool IsRunningAutomated { get; }
Public Shared ReadOnly Property IsRunningAutomated As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace