RhinoCommon API
UserInterfaceGrid.ChildCount Property
 Number of cells that have been filled, including the empty ones added with AddEmptyCell. This is not the same as ColumnCount * RowCount.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int ChildCount { get; }
Public ReadOnly Property ChildCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace