RhinoCommon API
NurbsCurveFitParameters.KinkSplitting Property
 Gets or sets the kink splitting behavior used when fitting a NURBS curve. See also
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public NurbsCurveFitParameters.KinkSplit KinkSplitting { get; set; }
Public Property KinkSplitting As NurbsCurveFitParameters.KinkSplit
	Get
	Set
Property Value
Type: NurbsCurveFitParameters.KinkSplit
Remarks
This property determines how the curve fitting algorithm handles kinks or sharp changes in direction. Adjusting this value can influence the smoothness and accuracy of the resulting curve. Choose an appropriate value based on whether preserving or smoothing out kinks is desired for your application.
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace
Rhino.Geometry.NurbsCurveFitParameters.KinkSplit