RhinoCommon API
FileIgsWriteOptions.FitRationalCurves Property
true means all rational NURBS will be fit with non-rational cubics.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool FitRationalCurves { get; set; }
Public Property FitRationalCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace