RhinoCommon API
CurvatureAnalysisSettingsState.MinRadiusRange Property
 Gets or sets the Minimum Radius curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Interval MinRadiusRange { get; set; }
Public Property MinRadiusRange As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
CurvatureAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace