RhinoCommon API
Dimension.NumericValue Property
 Gets the numeric value (or measurement), depending on geometry type.
LinearDimension: distance between arrow tips
RadialDimension: radius or diameter depending on type
AngularDimension: angle in radians
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double NumericValue { get; }
Public ReadOnly Property NumericValue As Double
	Get
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace