RhinoCommon API
DisplayPipelineAttributes.SurfaceEdgeColor Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public Color SurfaceEdgeColor { get; set; }
Public Property SurfaceEdgeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace