RhinoCommon API
Layer.IgesLevel Property
 Gets or sets the IGES level for this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int IgesLevel { get; set; }
Public Property IgesLevel As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Layer Class
Rhino.DocObjects Namespace