RhinoCommon API
MeshProviderIds.CurvePiping Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderMeshes.MeshProviderIds.CurvePiping"]
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Guid CurvePiping { get; }
Public Shared ReadOnly Property CurvePiping As Guid
	Get
Property Value
Type: Guid
See Also
Reference
MeshProviderIds Class
Rhino.Render.CustomRenderMeshes Namespace