RhinoCommon API
Light.ShadowIntensity Property
 Gets or sets the shadow intensity for the light.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ShadowIntensity { get; set; }
Public Property ShadowIntensity As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Light Class
Rhino.Geometry Namespace