RhinoCommon API
MeshNgon.BoundaryVertexCount Property
 Get the number of vertices in this ngon. about length information.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int BoundaryVertexCount { get; }
Public ReadOnly Property BoundaryVertexCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace
Rhino.Geometry.MeshNgon