RhinoCommon API
CustomRenderContentAttribute.IsBuiltIn Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.IsBuiltIn"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsBuiltIn { get; set; }
Public Property IsBuiltIn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace