RhinoCommon API
RadialDimension.LeaderTextHorizontalAlignment Property
 Gets or sets the horizontal alignment of the radial dimension's text
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.9
Syntax
public TextHorizontalAlignment LeaderTextHorizontalAlignment { get; set; }
Public Property LeaderTextHorizontalAlignment As TextHorizontalAlignment
	Get
	Set
Property Value
Type: TextHorizontalAlignment
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace