RhinoCommon API
RhinoApp.LoggedInUserAvatar Property
 Returns the logged in user's avatar picture. Returns a default avatar if the user does not have an avatar or if the avatar could not be fetched.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Image LoggedInUserAvatar { get; }
Public Shared ReadOnly Property LoggedInUserAvatar As Image
	Get
Property Value
Type: Image
See Also
Reference
RhinoApp Class
Rhino Namespace