RhinoCommon API
FilePdfReadOptions.PdfUnits Property
[Missing <summary> documentation for "P:Rhino.FileIO.FilePdfReadOptions.PdfUnits"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FilePdfReadOptions.PDF_UNITS PdfUnits { get; set; }
Public Property PdfUnits As FilePdfReadOptions.PDF_UNITS
	Get
	Set
Property Value
Type: FilePdfReadOptions.PDF_UNITS
See Also
Reference
FilePdfReadOptions Class
Rhino.FileIO Namespace