RhinoCommon API
ViewportInfo.FrustumTopPlane Property
 Gets the frustum top plane that separates visible from off-screen.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Plane FrustumTopPlane { get; }
Public ReadOnly Property FrustumTopPlane As Plane
	Get
Property Value
Type: Plane
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace