RhinoCommon API
DocumentEventArgs.DocumentId Property
Note: This API is now obsolete.
 Gets the document Id of the document for this event.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use DocumentSerialNumber or Document properties")]
public int DocumentId { get; }
<ObsoleteAttribute("Use DocumentSerialNumber or Document properties")>
Public ReadOnly Property DocumentId As Integer
	Get
Property Value
Type: Int32
See Also
Reference
DocumentEventArgs Class
Rhino Namespace