RhinoCommon API
RhinoDoc.NextUndoRecordSerialNumber Property
 The serial number that will be assigned to the next undo record that is constructed.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint NextUndoRecordSerialNumber { get; }
Public ReadOnly Property NextUndoRecordSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RhinoDoc Class
Rhino Namespace