RhinoCommon API
DimensionStyle.UnitSystem Property
 The dimension style's own unit system. This is what the style's lengths - text height, arrow size and so on - are expressed in, and openNURBS uses it internally to get scales right when annotation moves between model space, page space and instance definitions whose unit systems differ. A style that reports None has no unit system of its own, and unknown scales resolve to 1.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public UnitSystem UnitSystem { get; set; }
Public Property UnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace