RhinoCommon API
CommandAliasList.Count Property
Returns the number of command alias in Rhino.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int Count { get; }
Public Shared ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace