RhinoCommon API
ModelAidSettings.GumballExtrudeMergeFaces Property
 When ExtrudeMergeFaces is true the gumball will attempt to merge faces if possible after extruding a face
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool GumballExtrudeMergeFaces { get; set; }
Public Shared Property GumballExtrudeMergeFaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace