RhinoCommon API
File3dmDisplacement.RefineSteps Property
 Specifies the number of refinement passes
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int RefineSteps { get; set; }
Public Property RefineSteps As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace