RhinoCommon API
DimensionStyle.ArrowLength Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ArrowLength"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ArrowLength { get; set; }
Public Property ArrowLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace