RhinoCommon API
GumballSettings.ZAxisColor Property
 Specifies the gumball z axis color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Color ZAxisColor { get; set; }
Public Shared Property ZAxisColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace