RhinoCommon API
ObjectEnumeratorSettings.IncludePhantoms Property
 The default object enumerator settings will not iterate through phantom objects. If you want the iterator to include phantom objects, then set this property to true.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IncludePhantoms { get; set; }
Public Property IncludePhantoms As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace