RhinoCommon API
ComponentFunctionInfo.OutputDescriptions Property
 Grasshopper returns several items in general. This property returns the output descriptions.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IReadOnlyList<string> OutputDescriptions { get; }
Public ReadOnly Property OutputDescriptions As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace