RhinoCommon API
RebuildCurveOptions.MinimumPointCount Property
 The minimum point count. If the context permits ranges of point counts, then it is possible that MinimumPointCount < MaximumPointCount. Otherwise MinimumPointCount = MaximumPointCount = PointCount.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int MinimumPointCount { get; }
Public ReadOnly Property MinimumPointCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace