RhinoCommon API
AppearanceSettings.LanguageIdentifier Property
Gets or sets the language identifier.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int LanguageIdentifier { get; set; }
Public Shared Property LanguageIdentifier As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace