RhinoCommon API
DisplayPipelineAttributes.BackfaceDisplayStyle Property
 Changes the display of the backfaces (the side opposite of the surface normal direction).
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.20
Syntax
public DisplayPipelineAttributes.BackfaceStyle BackfaceDisplayStyle { get; set; }
Public Property BackfaceDisplayStyle As DisplayPipelineAttributes.BackfaceStyle
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.BackfaceStyle
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace