RhinoCommon API
ProviderIds.ContentSelection Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.ContentSelection"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid ContentSelection { get; }
Public Shared ReadOnly Property ContentSelection As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace