RhinoCommon API
SubDEdgeSharpness.IsValidOrCrease Property
 Gets true if both ends are between 0.0 and MaximumValue, or if this is Crease.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool IsValidOrCrease { get; }
Public ReadOnly Property IsValidOrCrease As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace