RhinoCommon API
DisplayPipelineAttributes.SurfaceNakedEdgeColorUsage Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeColorUsage"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public DisplayPipelineAttributes.SurfaceNakedEdgeColorUse SurfaceNakedEdgeColorUsage { get; set; }
Public Property SurfaceNakedEdgeColorUsage As DisplayPipelineAttributes.SurfaceNakedEdgeColorUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.SurfaceNakedEdgeColorUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace