RhinoCommon API
Font.IsSingleStrokeFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.IsSingleStrokeFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public bool IsSingleStrokeFont { get; }
Public ReadOnly Property IsSingleStrokeFont As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Font Class
Rhino.DocObjects Namespace