RhinoCommon API
IsoDrawEffect.Point Property
[Missing <summary> documentation for "P:Rhino.Display.IsoDrawEffect.Point"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Point3d Point { get; set; }
Public Property Point As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace