RhinoCommon API
FileCsvWriteOptions.GroupIndexes Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.GroupIndexes"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool GroupIndexes { get; set; }
Public Property GroupIndexes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace