RhinoCommon API
ReduceMeshParameters.DesiredPolygonCount Property
Desired or target number of faces
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int DesiredPolygonCount { get; set; }
Public Property DesiredPolygonCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace