RhinoCommon API
GumballAppearanceSettings.ScaleGripSize Property
in pixels.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int ScaleGripSize { get; set; }
Public Property ScaleGripSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace