RhinoCommon API
FileObjWriteOptions.ExportGroupNameLayerNames Property
 Setting to determine whether object, group or layer names will become "g"s in the OBJ output file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public FileObjWriteOptions.ObjGroupNames ExportGroupNameLayerNames { get; set; }
Public Property ExportGroupNameLayerNames As FileObjWriteOptions.ObjGroupNames
	Get
	Set
Property Value
Type: FileObjWriteOptions.ObjGroupNames
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace