RhinoCommon API
RhinoDoc.Fonts Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.RhinoDoc.Fonts"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use DimStyles table instead")]
public FontTable Fonts { get; }
<ObsoleteAttribute("Use DimStyles table instead")>
Public ReadOnly Property Fonts As FontTable
	Get
Property Value
Type: FontTable
See Also
Reference
RhinoDoc Class
Rhino Namespace