RhinoCommon API
AnimationProperties.RenderPreview Property
 Gets or sets a value indicating whether to capture a frame in preview rendered mode.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public bool RenderPreview { get; set; }
Public Property RenderPreview As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace