RhinoCommon API
ChooseOneObjectSettingsState.ShowObjectTypeDetails Property
ShowObjectTypeDetails
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ShowObjectTypeDetails { get; set; }
Public Property ShowObjectTypeDetails As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace