RhinoCommon API
FileDwgWriteOptions.ExportSplinesAs Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgWriteOptions.ExportSplinesAs"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileDwgWriteOptions.ExportSplineMode ExportSplinesAs { get; set; }
Public Property ExportSplinesAs As FileDwgWriteOptions.ExportSplineMode
	Get
	Set
Property Value
Type: FileDwgWriteOptions.ExportSplineMode
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace