RhinoCommon API
UserInterfaceControl.TrackingPoint Property
 3d location that control "sticks" to if not null
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Point3d? TrackingPoint { get; set; }
Public Property TrackingPoint As Point3d?
	Get
	Set
Property Value
Type: Nullable<Point3d>
See Also
Reference
UserInterfaceControl Class
Rhino.UI Namespace