RhinoCommon API
File3dmSettings.MeshingParameters Property
 The meshing parameters Rhino uses to build render meshes for this model. Rhino derives the "Jagged & faster" / "Smooth & slower" choice from these when the model is opened, so a model that leaves them at the openNURBS default gets jagged render meshes.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public MeshingParameters MeshingParameters { get; set; }
Public Property MeshingParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace