RhinoCommon API
MappingChannelCollection.Count Property
 Get count of MappingChannels in this collection
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MappingChannelCollection Class
Rhino.Render.ChangeQueue Namespace