RhinoCommon API
MarkupViewChangedEventArgs.Index Property
 The table index of the markup being viewed or edited, or -1 if none (for example when leaving markup mode or while creating a new markup).
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MarkupViewChangedEventArgs Class
Rhino.DocObjects.Tables Namespace