RhinoCommon API
AppearanceSettings.ShowFullPathInTitleBar Property
Gets or sets a value that determines if the full path of the document is shown in the Rhino title bar.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool ShowFullPathInTitleBar { get; set; }
Public Shared Property ShowFullPathInTitleBar As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace