RhinoCommon API
PhysicallyBased.SpecularTint Property
[Missing <summary> documentation for "P:Rhino.Render.ChildSlotNames.PhysicallyBased.SpecularTint"]
 Namespace: Rhino.Render.ChildSlotNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string SpecularTint { get; }
Public Shared ReadOnly Property SpecularTint As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ChildSlotNames Namespace