RhinoCommon API
ClippingPlaneSurface.ParticipationListsEnabled Property
 Should the object and layer participation lists be used when determining clipping
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ParticipationListsEnabled { get; set; }
Public Property ParticipationListsEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace