RhinoCommon API
MeshObject.MeshGeometry Property
[Missing <summary> documentation for "P:Rhino.DocObjects.MeshObject.MeshGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Mesh MeshGeometry { get; }
Public ReadOnly Property MeshGeometry As Mesh
	Get
Property Value
Type: Mesh
See Also
Reference
MeshObject Class
Rhino.DocObjects Namespace