RhinoCommon API
SubDVertex.Previous Property
 Previous vertex in linked list of vertices on this level
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public SubDVertex Previous { get; }
Public ReadOnly Property Previous As SubDVertex
	Get
Property Value
Type: SubDVertex
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace