RhinoCommon API
DimensionStyle.DimRadialTextAngleType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimRadialTextAngleType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.LeaderContentAngleStyle DimRadialTextAngleType { get; set; }
Public Property DimRadialTextAngleType As DimensionStyle.LeaderContentAngleStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderContentAngleStyle
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace