RhinoCommon API
File3dmSettings.ModelUnits Property
 Gets or sets the model length units, using LengthUnit value.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public LengthUnit ModelUnits { get; set; }
Public Property ModelUnits As LengthUnit
	Get
	Set
Property Value
Type: LengthUnit
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace