RhinoCommon API
AnnotationObjectBase.HasMeasurableTextFields Property
 Test if the text in the annotation object contains fields that involve length, area, or volume measurements
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool HasMeasurableTextFields { get; }
Public ReadOnly Property HasMeasurableTextFields As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
AnnotationObjectBase Class
Rhino.DocObjects Namespace