RhinoCommon API
DisplayPipelineAttributes.UseObjectBackfaceMaterial Property
 Use the backface material of the object for displaying its backfaces.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.20
Syntax
public bool UseObjectBackfaceMaterial { get; set; }
Public Property UseObjectBackfaceMaterial As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace