RhinoCommon API
Material.RenderPlugInId Property
 The Id of the RenderPlugIn that is associated with this material.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Guid RenderPlugInId { get; set; }
Public Property RenderPlugInId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Material Class
Rhino.DocObjects Namespace