RhinoCommon API
DisplayPipelineAttributes.ShowCreases Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ShowCreases"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ShowCreases { get; set; }
Public Property ShowCreases As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace