RhinoCommon API
HiddenLineDrawing.Segments Property
 Sub-curve objects calculated by the hidden line drawing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IEnumerable<HiddenLineDrawingSegment> Segments { get; }
Public ReadOnly Property Segments As IEnumerable(Of HiddenLineDrawingSegment)
	Get
Property Value
Type: IEnumerable<HiddenLineDrawingSegment>
See Also
Reference
HiddenLineDrawing Class
Rhino.Geometry Namespace