RhinoCommon API
Extrusion.IsMiteredAtEnd Property
 Gets a value indicating whether a miter plane at the end is defined.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsMiteredAtEnd { get; }
Public ReadOnly Property IsMiteredAtEnd As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace