RhinoCommon API
StringParserSettings.DefaultAngleUnitSystem Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.DefaultAngleUnitSystem"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public AngleUnitSystem DefaultAngleUnitSystem { get; set; }
Public Property DefaultAngleUnitSystem As AngleUnitSystem
	Get
	Set
Property Value
Type: AngleUnitSystem
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace