RhinoCommon API
ContentUI.CppPointer Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ContentUI.CppPointer"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.11
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
ContentUI Class
Rhino.UI.Controls Namespace