RhinoCommon API
RhinoDoc.InGetPoint Property
 Returns true if currently in a GetPoint.Get().
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public bool InGetPoint { get; }
Public ReadOnly Property InGetPoint As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace