RhinoCommon API
DisplayPipelineAttributes.BackOverrideObjectReflectivity Property
 Objects acquire reflectivity from render materials.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public bool BackOverrideObjectReflectivity { get; set; }
Public Property BackOverrideObjectReflectivity As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace