RhinoCommon API
WorksessionFile.CurrentVersion Property
The worksession file version Rhino 5 and later write.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int CurrentVersion { get; }
Public Shared ReadOnly Property CurrentVersion As Integer
	Get
Property Value
Type: Int32
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace