RhinoCommon API
ViewSettingsState.DefinedViewSetProjection Property
 Gets or sets the 'named views set projection' value.
When true, restoring a named view causes the viewport projection saved with the view to also restore.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool DefinedViewSetProjection { get; set; }
Public Property DefinedViewSetProjection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace