RhinoCommon API
Material.PreviewColor Property
 Very simple preview color function for GUIs.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.6
Syntax
public Color PreviewColor { get; }
Public ReadOnly Property PreviewColor As Color
	Get
Property Value
Type: Color
See Also
Reference
Material Class
Rhino.DocObjects Namespace