RhinoCommon API
FileSkpReadOptions.JoinFaces Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSkpReadOptions.JoinFaces"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool JoinFaces { get; set; }
Public Property JoinFaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSkpReadOptions Class
Rhino.FileIO Namespace