RhinoCommon API
ProviderIds.GroundPlane Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.GroundPlane"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid GroundPlane { get; }
Public Shared ReadOnly Property GroundPlane As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace