RhinoCommon API
RenderContent.Document Property
Note: This API is now obsolete.
 Obsolete. Do not use. You should use DocumentOwner instead.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
[ObsoleteAttribute("Use DocumentOwner")]
public RhinoDoc Document { get; }
<ObsoleteAttribute("Use DocumentOwner")>
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RenderContent Class
Rhino.Render Namespace