RhinoCommon API
ContentUuids.MarbleTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.MarbleTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid MarbleTextureType { get; }
Public Shared ReadOnly Property MarbleTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace