RhinoCommon API
Quaternion.IsZero Property
 true if a, b, c, and d are all zero.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsZero { get; }
Public ReadOnly Property IsZero As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace