RhinoCommon API
ModelAidSettings.DragStartsWindowSelection Property
 When enabled, a click and drag that starts on top of an object starts a window/crossing selection instead of dragging the object, the same as holding down the Alt key. Grip dragging and gumball dragging are not affected, and a click that does not drag still selects normally.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool DragStartsWindowSelection { get; set; }
Public Shared Property DragStartsWindowSelection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace