RhinoCommon API
ViewportInfo.IsValidFrustum Property
 Gets a value that indicates whether the frustum is valid.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsValidFrustum { get; }
Public ReadOnly Property IsValidFrustum As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace