RhinoCommon API
GripUserInterfaceObject.GripLocation Property
[Missing <summary> documentation for "P:Rhino.UI.GripUserInterfaceObject.GripLocation"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Point3d GripLocation { get; set; }
Public Property GripLocation As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
GripUserInterfaceObject Class
Rhino.UI Namespace