RhinoCommon API
ObjectPropertiesPageEventArgs.ObjectCount Property
[Missing <summary> documentation for "P:Rhino.UI.ObjectPropertiesPageEventArgs.ObjectCount"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int ObjectCount { get; }
Public ReadOnly Property ObjectCount As Integer
	Get
Return Value
Type: Int32
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace