RhinoCommon API
NurbsCurveFitParameters.PointCount Property
 Number of distinct control points in the NURBS curve fit. If a range of point counts is possible, this is the minimum number.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int PointCount { get; set; }
Public Property PointCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace