RhinoCommon API
Markup.ModifiedBy Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Markup.ModifiedBy"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string ModifiedBy { get; }
Public ReadOnly Property ModifiedBy As String
	Get
Property Value
Type: String
See Also
Reference
Markup Class
Rhino.DocObjects Namespace