RhinoCommon API
Triangle3d.AreaCenter Property
 Gets the triangle area centroid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Point3d AreaCenter { get; }
Public ReadOnly Property AreaCenter As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace