RhinoCommon API
AnimationProperties.Longitude Property
 Gets or sets the longitude for sun animations in the range of -180 to +180.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public double Longitude { get; set; }
Public Property Longitude As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace