RhinoCommon API
Vector2f.Unset Property
 Gets the value of the vector with each component set to RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Vector2f Unset { get; }
Public Shared ReadOnly Property Unset As Vector2f
	Get
Property Value
Type: Vector2f
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace