RhinoCommon API
PostEffect.IsSelected Property
 Return true if the post effect is selected.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool IsSelected { get; }
Public ReadOnly Property IsSelected As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace