RhinoCommon API
DisplayPipelineAttributes.ShowSurfaceEdges Property
Show surface edges.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public bool ShowSurfaceEdges { get; set; }
Public Property ShowSurfaceEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace