RhinoCommon API
DisplayPipelineAttributes.MeshVertexSize Property
 Mesh vertex size in pixels
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int MeshVertexSize { get; set; }
Public Property MeshVertexSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace