RhinoCommon API
GumballSettingsState.ZAxisColor Property
 Specifies the gumball z axis color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color ZAxisColor { get; set; }
Public Property ZAxisColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace