RhinoCommon API
UserInterfaceGrid.ColumnCount Property
 Number of columns in the grid. The default is 1. Changing the column count reflows the children that have already been added.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int ColumnCount { get; set; }
Public Property ColumnCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace