RhinoCommon API
ICollapsibleSection.CommandOptionName Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.CommandOptionName"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
LocalizeStringPair CommandOptionName { get; }
ReadOnly Property CommandOptionName As LocalizeStringPair
	Get
Property Value
Type: LocalizeStringPair
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace