RhinoCommon API
AnnotationBase.Plane Property
 Plane that this annotation lies on
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace