RhinoCommon API
RenderContentManager.UserRenderContentPath Property
 Get the path to: Windows: C:\Users\user\AppData\Roaming\McNeel\Rhinoceros\6.0\Localization\en-US\Render Content macOS: ~/Library/Application Support/McNeel/Rhinoceros/6.0/Render Content If a CustomLibraryPath is set, this is returned
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public static string UserRenderContentPath { get; }
Public Shared ReadOnly Property UserRenderContentPath As String
	Get
Property Value
Type: String
See Also
Reference
RenderContentManager Class
Rhino.Render Namespace