RhinoCommon API
File3dmShutLining.On Property
 Specifies whether shut-lining is enabled or not.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool On { get; set; }
Public Property On As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace