RhinoCommon API
Linetype.WidthUnits Property
 Unit system that widths are defined in. UnitSystem.None is default and means that the width is defined in pixels.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public UnitSystem WidthUnits { get; set; }
Public Property WidthUnits As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace