RhinoCommon API
Matrix.IsRowOrthogonal Property
 Gets a value indicating whether the matrix is row orthogonal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsRowOrthogonal { get; }
Public ReadOnly Property IsRowOrthogonal As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Matrix Class
Rhino.Geometry Namespace