RhinoCommon API
BrepFaceList.HasPerFaceColors Property
 True if one or more faces on the active level have per face color overrides.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.18
Syntax
public bool HasPerFaceColors { get; }
Public ReadOnly Property HasPerFaceColors As Boolean
	Get
Property Value
Type: Boolean
Remarks
 Per face colors are a mutable property on BrepFace and are set with PerFaceColor.
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace