RhinoCommon API
File3dmCurvePiping.CapType Property
 Specifies the cap type to use.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmCurvePiping.CapTypes CapType { get; set; }
Public Property CapType As File3dmCurvePiping.CapTypes
	Get
	Set
Property Value
Type: File3dmCurvePiping.CapTypes
See Also
Reference
File3dmCurvePiping Class
Rhino.FileIO Namespace