RhinoCommon API
AngularDimensionObject.AngularDimensionGeometry Property
 Get the dimension geometry for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public AngularDimension AngularDimensionGeometry { get; }
Public ReadOnly Property AngularDimensionGeometry As AngularDimension
	Get
Property Value
Type: AngularDimension
See Also
Reference
AngularDimensionObject Class
Rhino.DocObjects Namespace