RhinoCommon API
ObjectPropertiesPageEventArgs.View Property
 Active view
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoView View { get; }
Public ReadOnly Property View As RhinoView
	Get
Property Value
Type: RhinoView
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace