RhinoCommon API
Skylight.UsesCustomEnvironment Property
 Return true if skylight uses custom environment
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool UsesCustomEnvironment { get; }
Public ReadOnly Property UsesCustomEnvironment As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Skylight Class
Rhino.Render.ChangeQueue Namespace