RhinoCommon API
WorksessionFileLayerValues.Color Property
Gets or sets the layer color.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color Color { get; set; }
Public Property Color As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
WorksessionFileLayerValues Class
Rhino.FileIO Namespace