RhinoCommon API
ChooseOneObjectSettingsState.ShowObjectType Property
ShowObjectType
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ShowObjectType { get; set; }
Public Property ShowObjectType As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace