RhinoCommon API
RenderSettings.SpecificViewport Property
 Set or get the given specific viewport
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public string SpecificViewport { get; set; }
Public Property SpecificViewport As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RenderSettings Class
Rhino.Render Namespace