RhinoCommon API
MappingChannel.Channel Property
 Get channel number for this MappingChannel
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public int Channel { get; }
Public ReadOnly Property Channel As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MappingChannel Class
Rhino.Render.ChangeQueue Namespace