RhinoCommon API
ModelComponent.ReferenceModelSerialNumber Property
 When a component is in a model for reference, this value identifies the reference model.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public virtual uint ReferenceModelSerialNumber { get; }
Public Overridable ReadOnly Property ReferenceModelSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Remarks
 Reference components are not saved in .3dm archives. Typically this value is set and locked by the code that adds a component to a model. This value is not saved in .3dm archives.
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace