RhinoCommon API
PrintedPageDefinition.Width Property
 Width of the page in Units
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Width { get; set; }
Public Property Width As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PrintedPageDefinition Class
Rhino Namespace