RhinoCommon API
AppearanceSettings.DefaultFontFaceName Property
 Gets or sets the default font face name used in Rhino.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string DefaultFontFaceName { get; }
Public Shared ReadOnly Property DefaultFontFaceName As String
	Get
Property Value
Type: String
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace