RhinoCommon API
DisplayPipelineAttributes.ShowSubDReflectionPlanePreview Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ShowSubDReflectionPlanePreview"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public bool ShowSubDReflectionPlanePreview { get; set; }
Public Property ShowSubDReflectionPlanePreview As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace