RhinoCommon API
FileDwgReadOptions.ConvertWidePolylinesToSurfaces Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgReadOptions.ConvertWidePolylinesToSurfaces"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ConvertWidePolylinesToSurfaces { get; set; }
Public Property ConvertWidePolylinesToSurfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDwgReadOptions Class
Rhino.FileIO Namespace