RhinoCommon API
RenderMaterial.SmellsLikeTexturedPlastic Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeTexturedPlastic"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SmellsLikeTexturedPlastic { get; }
Public ReadOnly Property SmellsLikeTexturedPlastic As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace