RhinoCommon API
DisplayModeDescription.AllowObjectAssignment Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.AllowObjectAssignment"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool AllowObjectAssignment { get; set; }
Public Property AllowObjectAssignment As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace