RhinoCommon API
FileIgsWriteOptions.UseParentLabelOnCurves Property
copy parent label to dependent curves
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool UseParentLabelOnCurves { get; set; }
Public Property UseParentLabelOnCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace