RhinoCommon API
OptionInteger.InitialValue Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.OptionInteger.InitialValue"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int InitialValue { get; }
Public ReadOnly Property InitialValue As Integer
	Get
Property Value
Type: Int32
See Also
Reference
OptionInteger Class
Rhino.Input.Custom Namespace