RhinoCommon API
Leader.LeaderContentAngleStyle Property
 Angle for text of leader text
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.LeaderContentAngleStyle LeaderContentAngleStyle { get; set; }
Public Property LeaderContentAngleStyle As DimensionStyle.LeaderContentAngleStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderContentAngleStyle
See Also
Reference
Leader Class
Rhino.Geometry Namespace