RhinoCommon API
MeshSplitOptions.SplitAtCoplanar Property
 Gets or sets whether coplanar areas are separated. If false, coplanar areas will not be separated.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool SplitAtCoplanar { get; set; }
Public Property SplitAtCoplanar As Boolean
	Get
	Set
Property Value
Type: Boolean
The default value is true.
See Also
Reference
MeshSplitOptions Class
Rhino.Geometry Namespace