RhinoCommon API
File3dmMeshModifiers.Displacement Property
 Returns an object that provides access to displacement information. If no displacement information is present, the method returns null.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public File3dmDisplacement Displacement { get; }
Public ReadOnly Property Displacement As File3dmDisplacement
	Get
Property Value
Type: File3dmDisplacement
See Also
Reference
File3dmMeshModifiers Class
Rhino.FileIO Namespace