RhinoCommon API
SquishParameters.BoundaryCompressConstant Property
 Spring constant for compressed boundary edges times the rest length
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public double BoundaryCompressConstant { get; set; }
Public Property BoundaryCompressConstant As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SquishParameters Class
Rhino.Geometry Namespace