RhinoCommon API
PanelIds.FileExplorer Property
 Rhino File Explorer panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Guid FileExplorer { get; }
Public Shared ReadOnly Property FileExplorer As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace