RhinoCommon API
SectionStyleTableEventArgs.EventType Property
 The event type.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SectionStyleTableEventType EventType { get; }
Public ReadOnly Property EventType As SectionStyleTableEventType
	Get
Property Value
Type: SectionStyleTableEventType
See Also
Reference
SectionStyleTableEventArgs Class
Rhino.DocObjects.Tables Namespace