RhinoCommon API
SafeFrame.ActionFrameOn Property
 Turn on the user specified action area, which shown with blue frames.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public bool ActionFrameOn { get; set; }
Public Property ActionFrameOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SafeFrame Class
Rhino.Render Namespace