RhinoCommon API
Brep.FilletSurfaceSettings.ContinueAcrossTangentFaces Property
 If true, the fillets or chamfers will be extended to neighboring faces as long as neighboring faces are tangent to the input faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ContinueAcrossTangentFaces { get; set; }
Public Property ContinueAcrossTangentFaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace