RhinoCommon API
FileVdaWriteOptions.Confidentiality Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVdaWriteOptions.Confidentiality"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string Confidentiality { get; set; }
Public Property Confidentiality As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileVdaWriteOptions Class
Rhino.FileIO Namespace