RhinoCommon API
KeyboardShortcut.Key Property
Key used for shortcut
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public KeyboardKey Key { get; set; }
Public Property Key As KeyboardKey
	Get
	Set
Property Value
Type: KeyboardKey
See Also
Reference
KeyboardShortcut Class
Rhino.ApplicationSettings Namespace