RhinoCommon API
DirectionGripUserInterfaceObject.ArrowShape Property
 Shape used for end of direction line
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public GripUserInterfaceObjectShape ArrowShape { get; set; }
Public Property ArrowShape As GripUserInterfaceObjectShape
	Get
	Set
Property Value
Type: GripUserInterfaceObjectShape
See Also
Reference
DirectionGripUserInterfaceObject Class
Rhino.UI Namespace