RhinoCommon API
FileX3dvWriteOptions.MeshingParameters Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileX3dvWriteOptions.MeshingParameters"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public MeshingParameters MeshingParameters { get; set; }
Public Property MeshingParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
See Also
Reference
FileX3dvWriteOptions Class
Rhino.FileIO Namespace