RhinoCommon API
ProviderIds.SelectionNavigator Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.SelectionNavigator"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid SelectionNavigator { get; }
Public Shared ReadOnly Property SelectionNavigator As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace