RhinoCommon API
File3mfWriteOptions.Description Property
[Missing <summary> documentation for "P:Rhino.FileIO.File3mfWriteOptions.Description"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3mfWriteOptions Class
Rhino.FileIO Namespace