RhinoCommon API
ViewInfo.FocalBlurMode Property
 Gets or sets the Focal blur mode of the active viewport
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ViewInfoFocalBlurModes FocalBlurMode { get; set; }
Public Property FocalBlurMode As ViewInfoFocalBlurModes
	Get
	Set
Property Value
Type: ViewInfoFocalBlurModes
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace