RhinoCommon API
DecalCreateParams.DecalProjection Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.DecalProjection"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DecalProjection DecalProjection { get; set; }
Public Property DecalProjection As DecalProjection
	Get
	Set
Property Value
Type: DecalProjection
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace