RhinoCommon API
ViewCaptureSettings.CropRectangle Property
 Actual area of output rectangle that view capture is sent to.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Rectangle CropRectangle { get; }
Public ReadOnly Property CropRectangle As Rectangle
	Get
Property Value
Type: Rectangle
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace