RhinoCommon API
DimensionStyle.LineSpaceScale Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LineSpaceScale"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double LineSpaceScale { get; set; }
Public Property LineSpaceScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace