RhinoCommon API
ObjectAttributes.Space Property
 Starting with V4, objects can be in either model space or page space. If an object is in page space, then ViewportId is not nil and identifies the page it is on.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ActiveSpace Space { get; set; }
Public Property Space As ActiveSpace
	Get
	Set
Property Value
Type: ActiveSpace
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace