RhinoCommon API
ModelAidSettingsState.ProjectSnapToCPlane Property
Gets or sets the enabled state of Rhino's Project modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool ProjectSnapToCPlane { get; set; }
Public Property ProjectSnapToCPlane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace