RhinoCommon API
DisplayPipelineAttributes.ClippingPlaneFillColorUsage Property
 Specifies how the color for the clipping plane object fill is determined.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public DisplayPipelineAttributes.ClippingPlaneFillColorUse ClippingPlaneFillColorUsage { get; set; }
Public Property ClippingPlaneFillColorUsage As DisplayPipelineAttributes.ClippingPlaneFillColorUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.ClippingPlaneFillColorUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace