RhinoCommon API
ModelAidSettingsState.OrthoAngle Property
Gets or sets the base orthogonal angle.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double OrthoAngle { get; set; }
Public Property OrthoAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace