RhinoCommon API
GumballSettingsState.MenuBallColor Property
 Specifies the gumball menu ball color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color MenuBallColor { get; set; }
Public Property MenuBallColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballSettingsState Class
Rhino.ApplicationSettings Namespace