RhinoCommon API
File3dmSettings.ModelAbsoluteTolerance Property
Gets or sets the model space absolute tolerance.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ModelAbsoluteTolerance { get; set; }
Public Property ModelAbsoluteTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace