RhinoCommon API
DisplayPipelineAttributes.UseSectionStyles Property
 When enabled, the appearances of clipping fills and edges are based on objects' section style properties.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public bool UseSectionStyles { get; set; }
Public Property UseSectionStyles As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace