RhinoCommon API
PreviewAppearance.SceneScale Property
 Scene size - the actual size that is rendered
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double SceneScale { get; }
Public ReadOnly Property SceneScale As Double
	Get
Property Value
Type: Double
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace