RhinoCommon API
MeshCurveIntersection.IsOverlap Property
True if this event is a range over which the curve lies in the face's plane.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsOverlap { get; }
Public ReadOnly Property IsOverlap As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace