RhinoCommon API
FileIgsWriteOptions.ForceBezierKnotsOnSurfaces Property
true means all NURBS surfaces will have their internal knots set to full multiplicity.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ForceBezierKnotsOnSurfaces { get; set; }
Public Property ForceBezierKnotsOnSurfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace