RhinoCommon API
AppearanceSettingsState.CrosshairsAlignedToScreen Property
 Gets or sets a value that determines if the cross hairs are drawn horizontally and vertically on the screen instead of running along the construction plane's x and y axes.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool CrosshairsAlignedToScreen { get; set; }
Public Property CrosshairsAlignedToScreen As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace