RhinoCommon API
Arrowhead.ArrowType Property
 Type of arrowhead used by annotation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.ArrowType ArrowType { get; }
Public ReadOnly Property ArrowType As DimensionStyle.ArrowType
	Get
Property Value
Type: DimensionStyle.ArrowType
See Also
Reference
Arrowhead Class
Rhino.Geometry Namespace