RhinoCommon API
HostUtils.OperatingSystemEdition Property
 Returns Operating System Edition: "Professional" | "ServerDatacenter" | ... | "Unknown"
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public static string OperatingSystemEdition { get; }
Public Shared ReadOnly Property OperatingSystemEdition As String
	Get
Property Value
Type: String
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace