RhinoCommon API
DisplayAttributeMaterial.Shine Property
 Shine, 0 to MaxShine.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Shine { get; set; }
Public Property Shine As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace