RhinoCommon API
DisplayAttributeMaterial.Emission Property
 Emission color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color Emission { get; set; }
Public Property Emission As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace