RhinoCommon API
ObjectAttributes.OCSMappingChannelId Property
 The mapping channel id to use when calling MappingChannel to retrieve the OCS mapping if there is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.17
Syntax
public static int OCSMappingChannelId { get; }
Public Shared ReadOnly Property OCSMappingChannelId As Integer
	Get
Return Value
Type: Int32
The mapping channel id to use when calling MappingChannel to retrieve the OCS mapping if there is one.
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace