RhinoCommon API
BoundingBox.Unset Property
 Gets a bounding box that has Unset coordinates for Min and Max.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static BoundingBox Unset { get; }
Public Shared ReadOnly Property Unset As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace