RhinoCommon API
BrepEdge.EdgeCurve Property
 Get the brep.Curves3D[] 3d curve geometry used by this edge or null.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Curve EdgeCurve { get; }
Public ReadOnly Property EdgeCurve As Curve
	Get
Property Value
Type: Curve
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace