RhinoCommon API
FileVdaWriteOptions.ObjectCode Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVdaWriteOptions.ObjectCode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string ObjectCode { get; set; }
Public Property ObjectCode As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileVdaWriteOptions Class
Rhino.FileIO Namespace