RhinoCommon API
GetTorus.InDiameterMode Property
 Determines if the "size" value is representing a radius or diameter
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool InDiameterMode { get; set; }
Public Property InDiameterMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetTorus Class
Rhino.Input.Custom Namespace