RhinoCommon API
ByteArrayField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public byte[] Value { get; set; }
Public Property Value As Byte()
	Get
	Set
Property Value
Type: Byte[]
See Also
Reference
ByteArrayField Class
Rhino.Render.Fields Namespace