RhinoCommon API
FileObjWriteOptions.ExportAsTriangles Property
 Enable/disable export of faces as triangles.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
public bool ExportAsTriangles { get; set; }
Public Property ExportAsTriangles As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace