RhinoCommon API
GeometryBase.IsShallowDuplicate Property
 Is this instance a 'shallow copy'. Shallow copies are no different than regular instances with the exception that they will convert to complete independent 'deep' copies if a non const operation is perform on the instance (something that mutates the internal data)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.27
Syntax
public bool IsShallowDuplicate { get; }
Public ReadOnly Property IsShallowDuplicate As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace