RhinoCommon API
SquishParameters.Default Property
 Gets the default Squishing parameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public static SquishParameters Default { get; }
Public Shared ReadOnly Property Default As SquishParameters
	Get
Property Value
Type: SquishParameters
See Also
Reference
SquishParameters Class
Rhino.Geometry Namespace