RhinoCommon API
DimensionStyle.ArrowType1 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ArrowType1"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.ArrowType ArrowType1 { get; set; }
Public Property ArrowType1 As DimensionStyle.ArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ArrowType
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace