RhinoCommon API
Interpolator.Cyclical Property
 Gets or sets a value indicating whether or not the values inside this Interpolator are to be treated as cyclical (i.e. circular).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Cyclical { get; set; }
Public Property Cyclical As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Interpolator Class
Rhino.Geometry Namespace