RhinoCommon API
File3dmNamedConstructionPlanes.Count Property
 Number of named construction planes in the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
File3dmNamedConstructionPlanes Class
Rhino.FileIO Namespace