RhinoCommon API
Arc.StartPoint Property
 Gets the start point of the arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d StartPoint { get; }
Public ReadOnly Property StartPoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Arc Structure
Rhino.Geometry Namespace