RhinoCommon API
ModelAidSettings.ExtendTrimLines Property
Gets or sets the enabled state of Rhino's extend trim lines.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool ExtendTrimLines { get; set; }
Public Shared Property ExtendTrimLines As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace