RhinoCommon API
MaterialRefCreateParams.MaterialSource Property
 Determines if the simple material should come from the object or from it's layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public ObjectMaterialSource MaterialSource { get; set; }
Public Property MaterialSource As ObjectMaterialSource
	Get
	Set
Property Value
Type: ObjectMaterialSource
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace