RhinoCommon API
RhinoApp.DaysUntilExpiration Property
 Returns number of days until license expires. Zero when license is expired. Raises InvalidLicenseTypeException if LicenseExpires would return false.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public static int DaysUntilExpiration { get; }
Public Shared ReadOnly Property DaysUntilExpiration As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoApp Class
Rhino Namespace