RhinoCommon API
StringParserSettings.ParseScientificENotation Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseScientificENotation"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseScientificENotation { get; set; }
Public Property ParseScientificENotation As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace