RhinoCommon API
Line.FromY Property
 Gets or sets the Y coordinate of the line From point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double FromY { get; set; }
Public Property FromY As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Line Structure
Rhino.Geometry Namespace