RhinoCommon API
DisplayPipelineAttributes.PreProcessTextures Property
 Linear workflow input textures
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public bool PreProcessTextures { get; set; }
Public Property PreProcessTextures As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace