RhinoCommon API
Line.ToX Property
 Gets or sets the X coordinate of the line To point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ToX { get; set; }
Public Property ToX As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Line Structure
Rhino.Geometry Namespace