RhinoCommon API
SubDComponent.IsHidden Property
 Returns true if the SubD component is hidden.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public bool IsHidden { get; }
Public ReadOnly Property IsHidden As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace