RhinoCommon API
HiddenLineDrawingObjectCurve.IsProjecting Property
 Returns true if all the non clipped portions of this curve are projecting.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsProjecting { get; }
Public ReadOnly Property IsProjecting As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace