RhinoCommon API
RhinoApp.NodeType Property
Gets license the node type.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static LicenseNode NodeType { get; }
Public Shared ReadOnly Property NodeType As LicenseNode
	Get
Property Value
Type: LicenseNode
See Also
Reference
RhinoApp Class
Rhino Namespace