RhinoCommon API
Dimension.ArrowSize Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ArrowSize"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ArrowSize { get; set; }
Public Property ArrowSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace