RhinoCommon API
GumballDisplayConduit.PickResult Property
The initial mouse down event sets PickResult.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GumballPickResult PickResult { get; }
Public ReadOnly Property PickResult As GumballPickResult
	Get
Property Value
Type: GumballPickResult
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace