RhinoCommon API
PlugInDescriptionAttribute.Value Property
[Missing <summary> documentation for "P:Rhino.PlugIns.PlugInDescriptionAttribute.Value"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Value { get; }
Public ReadOnly Property Value As String
	Get
Property Value
Type: String
See Also
Reference
PlugInDescriptionAttribute Class
Rhino.PlugIns Namespace