RhinoCommon API
ArchivableDictionary.Name Property
 Gets or sets the name string of this ArchivableDictionary.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace