RhinoCommon API
DimStyleTable.Current Property
 Returns an instance of the current DimensionStyle.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle Current { get; }
Public ReadOnly Property Current As DimensionStyle
	Get
Property Value
Type: DimensionStyle
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace