RhinoCommon API
Material.EmissionColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.EmissionColor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color EmissionColor { get; set; }
Public Property EmissionColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Material Class
Rhino.DocObjects Namespace