RhinoCommon API
DisplayPipelineAttributes.UseBackfaceMaterial Property
 Use the backface material for displaying backfaces.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.20
Syntax
public bool UseBackfaceMaterial { get; set; }
Public Property UseBackfaceMaterial As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace