RhinoCommon API
MatchSrfSettings.MatchClosestPoints Property
 Match the edge to the closest points on the target edge
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public bool MatchClosestPoints { get; set; }
Public Property MatchClosestPoints As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MatchSrfSettings Class
Rhino.Geometry Namespace