RhinoCommon API
ColorLAB.B Property
 Gets or sets the Opponent channel. The channel is limited to -1~+1.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double B { get; set; }
Public Property B As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace