RhinoCommon API
RebuildCurveOptions.PointCountRangeTolerance Property
 When PointCountRangePermitted is true and MinimumPointCount < MaximumPointCount, PointCountRangeTolerance specifies the desired maximum deviation between the target and rebuilt curves. If there is a rebuilt curve in the point count range with deviation <= PointCountRangeTolerance, then the rebuilt curve with the smallest point count whose deviation <= tolerance is returned. Otherwise the curve with the smallest deviation is returned. Use SetPointCountRange(min,max,tol) to set PointCountRangeTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double PointCountRangeTolerance { get; }
Public ReadOnly Property PointCountRangeTolerance As Double
	Get
Property Value
Type: Double
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace