RhinoCommon API
Texture.TreatAsLinear Property
 If false, the texture color values should be correctly by the linear workflow pre-process gamma value (in the document) if linear workflow is on. Otherwise, if the values is true, the values should be used raw from the texture.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public bool TreatAsLinear { get; set; }
Public Property TreatAsLinear As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Texture Class
Rhino.DocObjects Namespace