RhinoCommon API
CustomGripObject.OriginalLocation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.CustomGripObject.OriginalLocation"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d OriginalLocation { get; set; }
Public Property OriginalLocation As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace