RhinoCommon API
Transform2d.Unset Property
 Gets a transform matrix filled with RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static Transform2d Unset { get; }
Public Shared ReadOnly Property Unset As Transform2d
	Get
Property Value
Type: Transform2d
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace