RhinoCommon API
ObjectAttributes.IsDocumentControlled Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectAttributes.IsDocumentControlled"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override bool IsDocumentControlled { get; }
Public Overrides ReadOnly Property IsDocumentControlled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace