RhinoCommon API
IndexPair.J Property
 Gets or sets the second, J index.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int J { get; set; }
Public Property J As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
IndexPair Structure
Rhino Namespace