RhinoCommon API
ViewUserInterfaceTable.Document Property
Document that owns this object table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
ViewUserInterfaceTable Class
Rhino.DocObjects.Tables Namespace