RhinoCommon API
DracoCompressionOptions.CompressionLevel Property
 Compression level. 0 if fastest, but least compression. 10 is slowest, but best compression
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int CompressionLevel { get; set; }
Public Property CompressionLevel As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DracoCompressionOptions Class
Rhino.FileIO Namespace