RhinoCommon API
Surface.IsSubDFriendly Property
 Returns true if the surface is a non-rational, uniform, natural or periodic, cubic NURBS surface. Otherwise, false is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool IsSubDFriendly { get; }
Public ReadOnly Property IsSubDFriendly As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Surface Class
Rhino.Geometry Namespace