RhinoCommon API
AppearanceSettingsState.DefaultFontFaceName Property
 Gets or sets the name of the default font face.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string DefaultFontFaceName { get; set; }
Public Property DefaultFontFaceName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace