RhinoCommon API
CreatePreviewEventArgs.Reason Property
 Reason the preview is getting generated
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public CreatePreviewReason Reason { get; }
Public ReadOnly Property Reason As CreatePreviewReason
	Get
Property Value
Type: CreatePreviewReason
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace