RhinoCommon API
Texture.WrapW Property
 Texture wrapping mode in the W direction
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public TextureUvwWrapping WrapW { get; set; }
Public Property WrapW As TextureUvwWrapping
	Get
	Set
Property Value
Type: TextureUvwWrapping
See Also
Reference
Texture Class
Rhino.DocObjects Namespace