RhinoCommon API
DisplayPipelineAttributes.SurfaceEdgeColorReductionPercent Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeColorReductionPercent"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SurfaceEdgeColorReductionPercent { get; set; }
Public Property SurfaceEdgeColorReductionPercent As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace