RhinoCommon API
RenderSettings.Snapshot Property
 Set or get the given snapshot view
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public string Snapshot { get; set; }
Public Property Snapshot As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RenderSettings Class
Rhino.Render Namespace