RhinoCommon API
StringParserSettings.ParseSubtraction Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseSubtraction"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseSubtraction { get; set; }
Public Property ParseSubtraction As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace