RhinoCommon API
ViewEventArgs.View Property
[Missing <summary> documentation for "P:Rhino.Display.ViewEventArgs.View"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoView View { get; }
Public ReadOnly Property View As RhinoView
	Get
Property Value
Type: RhinoView
See Also
Reference
ViewEventArgs Class
Rhino.Display Namespace