RhinoCommon API
File3dmThickening.On Property
 Specifies whether the feature is enabled or not.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool On { get; set; }
Public Property On As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmThickening Class
Rhino.FileIO Namespace