RhinoCommon API
BrepCurveList.Count Property
Gets the number of curves in this list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepCurveList Class
Rhino.Geometry.Collections Namespace