RhinoCommon API
DraftAngleAnalysisSettings.ShowIsoCurves Property
 Show isoparametric curves.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool ShowIsoCurves { get; set; }
Public Shared Property ShowIsoCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DraftAngleAnalysisSettings Class
Rhino.ApplicationSettings Namespace