RhinoCommon API
PostEffectUuids.ToneMapper_Clamp Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.ToneMapper_Clamp"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid ToneMapper_Clamp { get; }
Public Shared ReadOnly Property ToneMapper_Clamp As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace