RhinoCommon API
CommandLineOption.StringOptionValue Property
 Assigned by RhinoGet.Get if an option value is specified in a script or by a command window control.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.24
Syntax
public string StringOptionValue { get; }
Public ReadOnly Property StringOptionValue As String
	Get
Property Value
Type: String
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace