RhinoCommon API
SelectionFilterSettings.Enabled Property
 Enables or disables the global object selection filter.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool Enabled { get; set; }
Public Shared Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SelectionFilterSettings Class
Rhino.ApplicationSettings Namespace