RhinoCommon API
MeshFaceList.TriangleCount Property
 Gets the number of faces that are valid triangles (3 corners).
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int TriangleCount { get; }
Public ReadOnly Property TriangleCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace