RhinoCommon API
HostUtils.OperatingSystemInstallationType Property
 Returns Operating System Installation Type: "Client" | "Server" | "Unknown"
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public static string OperatingSystemInstallationType { get; }
Public Shared ReadOnly Property OperatingSystemInstallationType As String
	Get
Property Value
Type: String
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace