RhinoCommon API
Linetype.IsReference Property
 Gets a value indicting whether this linetype is a referenced linetype. Referenced linetypes are part of referenced documents.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override bool IsReference { get; }
Public Overrides ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace