RhinoCommon API
GetLine.FeedbackColor Property
 If set, the feedback color is used to draw the dynamic line when the second point is begin picked. If not set, the active layer color is used.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public Color FeedbackColor { get; set; }
Public Property FeedbackColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace