RhinoCommon API
DisplayPipelineAttributes.ShowHiddenLines Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ShowHiddenLines"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool ShowHiddenLines { get; set; }
Public Property ShowHiddenLines As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace