RhinoCommon API
ViewSettings.DefinedViewSetDisplayMode Property
 Gets or sets the 'Named views set display mode' value.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.19
Syntax
public static bool DefinedViewSetDisplayMode { get; set; }
Public Shared Property DefinedViewSetDisplayMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace