RhinoCommon API
RenderSettings.RenderSource Property
 Gets or sets the render source RenderSettings.RenderingSources enumeration.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public RenderSettings.RenderingSources RenderSource { get; set; }
Public Property RenderSource As RenderSettings.RenderingSources
	Get
	Set
Property Value
Type: RenderSettings.RenderingSources
See Also
Reference
RenderSettings Class
Rhino.Render Namespace