RhinoCommon API
DisplayPipelineAttributes.CullBackfaces Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.CullBackfaces"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public bool CullBackfaces { get; set; }
Public Property CullBackfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace