RhinoCommon API
ToolbarFile.ToolbarCount Property
 Get the number of toolbars in the toolbar file.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int ToolbarCount { get; }
Public ReadOnly Property ToolbarCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace