RhinoCommon API
ToolbarFile.Name Property
 Gets the name, or alias, of the toolbar file.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace