RhinoCommon API
RenderPlugIn.PerferBasicContent Property
 Set to true if you would like Rhino to quickly create a basic render content in response to 'Create New' commands. Set to false if you would prefer Rhino to display the render content chooser dialog.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.12
Syntax
public bool PerferBasicContent { get; set; }
Public Property PerferBasicContent As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace