RhinoCommon API
GeneralSettingsState.NewObjectIsoparmCount Property
 Gets or sets the number of isoparm curves to show on new objects.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int NewObjectIsoparmCount { get; set; }
Public Property NewObjectIsoparmCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace