RhinoCommon API
HostUtils.RunningOniOS Property
 Tests if this process is currently executing on the iOS platform.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static bool RunningOniOS { get; }
Public Shared ReadOnly Property RunningOniOS As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace