RhinoCommon API
DisplayPipelineAttributes.ViewDisplayAttributes.GridBoundaryThickness Property
 The thickness of the grid boundary.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public float GridBoundaryThickness { get; set; }
Public Property GridBoundaryThickness As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace