RhinoCommon API
ZooClientParameters.LicenseGuid Property
 Guid used by ZooClient to identify the license saved by ZooClient. This differs from ProductGuid because different versions of a plug-in with the same Plug-in ID may need different licenses.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid LicenseGuid { get; }
Public ReadOnly Property LicenseGuid As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace