RhinoCommon API
RhinoPageView.PaperName Property
 Returns the name of the layout's media, or paper (e.g. Letter, Legal, A1, etc.), used to determine the page width and page height.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public string PaperName { get; }
Public ReadOnly Property PaperName As String
	Get
Property Value
Type: String
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace