RhinoCommon API
ModelAidSettings.NudgeKeyStep Property
Gets or sets the nudge step amount.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static double NudgeKeyStep { get; set; }
Public Shared Property NudgeKeyStep As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace