RhinoCommon API
FileSettings.TemplateFile Property
Returns or sets the location of Rhino's template file.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string TemplateFile { get; set; }
Public Shared Property TemplateFile As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace