RhinoCommon API
DisplayPipelineAttributes.SurfaceNakedEdgeApplyPattern Property
 Turn pattern application on or off
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public bool SurfaceNakedEdgeApplyPattern { get; set; }
Public Property SurfaceNakedEdgeApplyPattern As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace