RhinoCommon API
GumballFrame.ScaleMode Property
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballFrame.ScaleMode"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GumballScaleMode ScaleMode {
	get;
 set; }
Public Property ScaleMode As GumballScaleMode
		Get
	Set
Property Value
Type: GumballScaleMode
See Also
Reference
GumballFrame Structure
Rhino.UI.Gumball Namespace