RhinoCommon API
Cone.ApexPoint Property
Point at tip of the cone.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d ApexPoint { get; }
Public ReadOnly Property ApexPoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Cone Structure
Rhino.Geometry Namespace