RhinoCommon API
Dimension.AlternateBelowLine Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AlternateBelowLine"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AlternateBelowLine { get; set; }
Public Property AlternateBelowLine As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dimension Class
Rhino.Geometry Namespace