RhinoCommon API
FileWriteOptions.AllowUserInterfaceWithHeadlessDocument Property
 If true, file writing plug-ins may show user interface (a dialog when SuppressDialogBoxes is false, command line getters when it is true) even though the document being written is headless.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool AllowUserInterfaceWithHeadlessDocument { get; set; }
Public Property AllowUserInterfaceWithHeadlessDocument As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
 Added 2026-07-10 by wfcook for RH-95100
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace