RhinoCommon API
SmartTrackSettingsState.ActivationDelayMilliseconds Property
Gets or sets the activation delay in milliseconds.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int ActivationDelayMilliseconds { get; set; }
Public Property ActivationDelayMilliseconds As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace