RhinoCommon API
ColorLCH.L Property
 Gets or sets the Lightness channel.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double L { get; set; }
Public Property L As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace