RhinoCommon API
FileObjWriteOptions.UseSimpleDialog Property
 Determines whether to use the simple or detailed meshing dialog.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool UseSimpleDialog { get; set; }
Public Property UseSimpleDialog As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace