RhinoCommon API
RhinoApp.LoggedInUserName Property
 Returns the name of the logged in user, or null if the user is not logged in.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string LoggedInUserName { get; }
Public Shared ReadOnly Property LoggedInUserName As String
	Get
Property Value
Type: String
See Also
Reference
RhinoApp Class
Rhino Namespace