RhinoCommon API
FileDgnReadOptions.ImportUnreferencedBlocks Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDgnReadOptions.ImportUnreferencedBlocks"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportUnreferencedBlocks { get; set; }
Public Property ImportUnreferencedBlocks As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDgnReadOptions Class
Rhino.FileIO Namespace