RhinoCommon API
EarthAnchorPoint.EarthBasepointLatitude Property
 Gets or sets a point latitude on earth, in degrees. +90 = north pole, 0 = equator, -90 = south pole.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double EarthBasepointLatitude { get; set; }
Public Property EarthBasepointLatitude As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace