RhinoCommon API
SubDEdgeSharpness.Item Property
 Gets the sharpness at the start or the end of the edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public double this[
	int endIndex
] { get; }
Public ReadOnly Default Property Item (
	endIndex As Integer
) As Double
	Get
Parameters
endIndex
Type: System.Int32
0 for the start of the edge, 1 for the end.
Return Value
Type: Double
The sharpness, or NaN if endIndex is out of range.
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace