RhinoCommon API
RhinoDoc.RenderMaterialAssignmentChangedEventArgs.LayerId Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.LayerId"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public Guid LayerId { get; }
Public ReadOnly Property LayerId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoDoc.RenderMaterialAssignmentChangedEventArgs Class
Rhino Namespace