RhinoCommon API
Instance.Mesh Property
 Returns the mesh associated with this geometry. Note that this function will always return a mesh even if the type is not a mesh...so you can always call this function without checking the type to give you the mesh. It's more efficient to use the primitive directly of course...but if you don't support it...
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Mesh Mesh { get; set; }
Public Property Mesh As Mesh
	Get
	Set
Property Value
Type: Mesh
See Also
Reference
Instance Class
Rhino.Render.CustomRenderMeshes Namespace