RhinoCommon API
AreaMassProperties.Area Property
 Gets the area solution.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
Property Value
Type: Double
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace