RhinoCommon API
DetailViewObject.DescriptiveTitle Property
 Detail objects have two strings that can be used to describe the detail: 1. The name string that is part of the object's attributes 2. The viewport projection title that is part of the viewport This function combines these two strings to create a single "description" string in the form of attribute_name - projection_title.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string DescriptiveTitle { get; }
Public ReadOnly Property DescriptiveTitle As String
	Get
Property Value
Type: String
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace