RhinoCommon API
SubDFace.LimitSurfaceCenterPoint Property
 Get the limit surface point location at the center of the face
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Point3d LimitSurfaceCenterPoint { get; }
Public ReadOnly Property LimitSurfaceCenterPoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace