RhinoCommon API
MeshExtruder.FaceDirectionMode Property
 Face direction mode determines how faces are oriented
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public MeshExtruderFaceDirectionMode FaceDirectionMode { get; set; }
Public Property FaceDirectionMode As MeshExtruderFaceDirectionMode
	Get
	Set
Property Value
Type: MeshExtruderFaceDirectionMode
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace