RhinoCommon API
AnimationProperties.CameraPathId Property
 Gets or sets the object ID of the camera path.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public Guid CameraPathId { get; set; }
Public Property CameraPathId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace