RhinoCommon API
PostEffectChannel.PixelSize Property
 Return the pixel size in bytes for this channel.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public int PixelSize { get; }
Public ReadOnly Property PixelSize As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PostEffectChannel Class
Rhino.Render.PostEffects Namespace