RhinoCommon API
UserInterfaceControl.Size Property
[Missing <summary> documentation for "P:Rhino.UI.UserInterfaceControl.Size"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public SizeF Size { get; set; }
Public Property Size As SizeF
	Get
	Set
Property Value
Type: SizeF
See Also
Reference
UserInterfaceControl Class
Rhino.UI Namespace