RhinoCommon API
Transform.M13 Property
Gets or sets this[1,3].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double M13 { get; set; }
Public Property M13 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Transform Structure
Rhino.Geometry Namespace