RhinoCommon API
FileAiReadOptions.AiUnits Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileAiReadOptions.AiUnits"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileAiReadOptions.Units AiUnits { get; set; }
Public Property AiUnits As FileAiReadOptions.Units
	Get
	Set
Property Value
Type: FileAiReadOptions.Units
See Also
Reference
FileAiReadOptions Class
Rhino.FileIO Namespace