RhinoCommon API
DecalCreateParams.StartLongitude Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.StartLongitude"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double StartLongitude { get; set; }
Public Property StartLongitude As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace