RhinoCommon API
ArcCurve.AngleRadians Property
 Gets the angles of this arc in radians.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double AngleRadians { get; }
Public ReadOnly Property AngleRadians As Double
	Get
Property Value
Type: Double
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace