RhinoCommon API
ViewCaptureSettings.IsScaleToFit Property
 Returns true if the model has been scaled to fit.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.21
Syntax
public bool IsScaleToFit { get; }
Public ReadOnly Property IsScaleToFit As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace