RhinoCommon API
ShrinkWrapParameters.PreserveColors Property
 Transfers mesh vertex and or point cloud colors to the shrinkwrapped results.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool PreserveColors { get; set; }
Public Property PreserveColors As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ShrinkWrapParameters Class
Rhino.Geometry Namespace