RhinoCommon API
RenderContent.Name Property
 Instance 'raw' name for this content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RenderContent Class
Rhino.Render Namespace