RhinoCommon API
ModelAidSettingsState.SnapToOccluded Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettingsState.SnapToOccluded"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SnapToOccluded { get; set; }
Public Property SnapToOccluded As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace