RhinoCommon API
GumballSettings.ScaleHandleSize Property
 Specifies the size of the scale handles in pixels. Set scale handle size to zero to turn off scale handles.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int ScaleHandleSize { get; set; }
Public Shared Property ScaleHandleSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballSettings Class
Rhino.ApplicationSettings Namespace