RhinoCommon API
CustomRenderContentAttribute.ImageBased Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.ImageBased"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ImageBased { get; set; }
Public Property ImageBased As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace