RhinoCommon API
Dimension.CentermarkStyle Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.CentermarkStyle"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.CenterMarkStyle CentermarkStyle { get; set; }
Public Property CentermarkStyle As DimensionStyle.CenterMarkStyle
	Get
	Set
Property Value
Type: DimensionStyle.CenterMarkStyle
See Also
Reference
Dimension Class
Rhino.Geometry Namespace