RhinoCommon API
LicenseData.ProductIcon Property
 The product's icon. This will displayed in the "license" page in the Options dialog. Note, this can be null. Note, LicenseData creates it's own copy of the icon.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Icon ProductIcon { get; set; }
Public Property ProductIcon As Icon
	Get
	Set
Property Value
Type: Icon
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace