RhinoCommon API
Point4d.Z Property
 Gets or sets the Z (third) coordinate of this point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Z { get; set; }
Public Property Z As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace