RhinoCommon API
WorksessionModel.Path Property
 The full path to the model's file. This is empty for an active model that has never been saved.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Path { get; }
Public ReadOnly Property Path As String
	Get
Property Value
Type: String
See Also
Reference
WorksessionModel Class
Rhino.DocObjects Namespace