RhinoCommon API
Layer.Description Property
 Gets and sets a short description of the layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Layer Class
Rhino.DocObjects Namespace