RhinoCommon API
Mesh.TopologyEdges Property
 Gets the MeshTopologyEdgeList object associated with this mesh.
This object stores edge connectivity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public MeshTopologyEdgeList TopologyEdges { get; }
Public ReadOnly Property TopologyEdges As MeshTopologyEdgeList
	Get
Property Value
Type: MeshTopologyEdgeList
See Also
Reference
Mesh Class
Rhino.Geometry Namespace