RhinoCommon API
VolumeMassProperties.WorldCoordinatesSecondMoments Property
 Returns the world coordinate second moments if they were able to be calculated. X is integral of "xx dm" over the volume Y is integral of "yy dm" over the volume Z is integral of "zz dm" over the volume.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d WorldCoordinatesSecondMoments { get; }
Public ReadOnly Property WorldCoordinatesSecondMoments As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace