RhinoCommon API
ModelComponent.HasId Property
 Returns a value indicating whether the component has an ID.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool HasId { get; }
Public ReadOnly Property HasId As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace