RhinoCommon API
SectionStyle.BackgroundFillMode Property
 How the background should be filled
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public SectionBackgroundFillMode BackgroundFillMode { get; set; }
Public Property BackgroundFillMode As SectionBackgroundFillMode
	Get
	Set
Property Value
Type: SectionBackgroundFillMode
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace