RhinoCommon API
SubDCreationOptions.InterpolateMeshVertices Property
 If false, input mesh vertex locations will be used to set SubD vertex control net locations. If true, input mesh vertex locations will be used to set SubD vertex limit surface locations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool InterpolateMeshVertices { get; set; }
Public Property InterpolateMeshVertices As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace