RhinoCommon API
FileDwgWriteOptions.Name Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDwgWriteOptions.Name"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace