RhinoCommon API
ViewCaptureSettings.PointSizeMillimeters Property
 Size of point objects in millimeters. if scale <= 0 the size is minimized so points are always drawn as small as possible
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public double PointSizeMillimeters { get; set; }
Public Property PointSizeMillimeters As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace