RhinoCommon API
PostEffectUuids.ToneMapper_Filmic Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectUuids.ToneMapper_Filmic"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.13
Syntax
public static Guid ToneMapper_Filmic { get; }
Public Shared ReadOnly Property ToneMapper_Filmic As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace