RhinoCommon API
Line.IsValid Property
 Gets a value indicating whether or not this line is valid. Valid lines must have valid start and end points, and the points must not be equal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Line Structure
Rhino.Geometry Namespace