RhinoCommon API
RibbonOffsetParameters.OffsetPlaneVector3d Property
 A vector that indicates the normal of the plane in which the offset will occur. This vector is typically similar to a logical extrude direction for the closed input curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public Vector3d OffsetPlaneVector3d { get; set; }
Public Property OffsetPlaneVector3d As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
RibbonOffsetParameters Class
Rhino.Geometry Namespace