RhinoCommon API
ChooseOneObjectSettings.UseCustomColor Property
UseCustomColor
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool UseCustomColor { get; set; }
Public Shared Property UseCustomColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace