RhinoCommon API
Panels.IconSizeInPixels Property
 Gets the panel icon size in pixels.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static Size IconSizeInPixels { get; }
Public Shared ReadOnly Property IconSizeInPixels As Size
	Get
Property Value
Type: Size
The size of the panel icon in pixels.
See Also
Reference
Panels Class
Rhino.UI Namespace