RhinoCommon API
LinearDimension.DistanceBetweenArrowTips Property
 Gets the distance between arrow tips.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double DistanceBetweenArrowTips { get; }
Public ReadOnly Property DistanceBetweenArrowTips As Double
	Get
Property Value
Type: Double
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace