RhinoCommon API
FileStlReadOptions.STLModelUnits Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileStlReadOptions.STLModelUnits"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public UnitSystem STLModelUnits { get; set; }
Public Property STLModelUnits As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
FileStlReadOptions Class
Rhino.FileIO Namespace