RhinoCommon API
File3dm.Layers Property
Note: This API is now obsolete.
 Layers in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use the new AllLayers property")]
public IList<Layer> Layers { get; }
<ObsoleteAttribute("Use the new AllLayers property")>
Public ReadOnly Property Layers As IList(Of Layer)
	Get
Property Value
Type: IList<Layer>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace