RhinoCommon API
AppearanceSettings.ViewportTabsVisibleAtStart Property
 Display viewport tabs at start
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static bool ViewportTabsVisibleAtStart { get; set; }
Public Shared Property ViewportTabsVisibleAtStart As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace