RhinoCommon API
StringParserSettings.ParseSignificandFractionalPart Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseSignificandFractionalPart"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ParseSignificandFractionalPart { get; set; }
Public Property ParseSignificandFractionalPart As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace