RhinoCommon API
Command.LastCommandResult Property
 Gets the result code of the last command.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Result LastCommandResult { get; }
Public Shared ReadOnly Property LastCommandResult As Result
	Get
Property Value
Type: Result
See Also
Reference
Command Class
Rhino.Commands Namespace