RhinoCommon API
Command.EnglishName Property
 Gets the name of the command. This method is abstract.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public abstract string EnglishName { get; }
Public MustOverride ReadOnly Property EnglishName As String
	Get
Property Value
Type: String
See Also
Reference
Command Class
Rhino.Commands Namespace