RhinoCommon API
AnimationProperties.StartSeconds Property
 Gets or sets the start seconds for seasonal/one day sun animation in the range 0 to 59.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public int StartSeconds { get; set; }
Public Property StartSeconds As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace