RhinoCommon API
RhinoDoc.ModelAbsoluteTolerance Property
Model space absolute tolerance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ModelAbsoluteTolerance { get; set; }
Public Property ModelAbsoluteTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RhinoDoc Class
Rhino Namespace