RhinoCommon API
Font.Stretch Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Stretch"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Font.FontStretch Stretch { get; }
Public ReadOnly Property Stretch As Font.FontStretch
	Get
Property Value
Type: Font.FontStretch
See Also
Reference
Font Class
Rhino.DocObjects Namespace