RhinoCommon API
MeshingParameters.Tolerance Property
 Gets or sets the maximum allowed edge deviation. This tolerance is measured between the center of the mesh edge and the surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Tolerance { get; set; }
Public Property Tolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace