RhinoCommon API
ViewCaptureSettings.UsePrintWidths Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.UsePrintWidths"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public bool UsePrintWidths { get; set; }
Public Property UsePrintWidths As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace