RhinoCommon API
RenderEnvironment.CurrentEnvironment Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Render.RenderEnvironment.CurrentEnvironment"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
[ObsoleteAttribute("Obsolete, use RhinoDoc.CurrentEnvironment")]
public static RenderEnvironment CurrentEnvironment { get; set; }
<ObsoleteAttribute("Obsolete, use RhinoDoc.CurrentEnvironment")>
Public Shared Property CurrentEnvironment As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace