RhinoCommon API
TextureMapping.Id Property
 The unique Id for this texture mapping object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public override Guid Id { get; }
Public Overrides ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
TextureMapping Class
Rhino.Render Namespace