RhinoCommon API
DisplayAttributeMaterial.Transparency Property
 Transparency, 0.0 opaque to 1.0 transparent.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public double Transparency { get; set; }
Public Property Transparency As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace