RhinoCommon API
DisplayPipelineAttributes.ShowSurfaceEdge Property
 Turn Surface Edge visibility on or off
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public bool ShowSurfaceEdge { get; set; }
Public Property ShowSurfaceEdge As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace