RhinoCommon API
RenderPlugIn.SupportsEditProperties Property
 Override this property and return true if your plug-in supports decals and overrides ShowDecalProperties(List<NamedValue>)
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool SupportsEditProperties { get; }
Protected Overridable ReadOnly Property SupportsEditProperties As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace