RhinoCommon API
ColorRGBA.Blue Property
[Missing <summary> documentation for "P:Rhino.Display.ColorRGBA.Blue"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static ColorRGBA Blue { get; }
Public Shared ReadOnly Property Blue As ColorRGBA
	Get
Property Value
Type: ColorRGBA
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace