RhinoCommon API
DraftAngleAnalysisSettingsState.AngleRange Property
 The angle range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Interval AngleRange { get; set; }
Public Property AngleRange As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
DraftAngleAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace