RhinoCommon API
DimensionStyle.ArrowBlockId1 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ArrowBlockId1"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Guid ArrowBlockId1 { get; set; }
Public Property ArrowBlockId1 As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace