RhinoCommon API
ToolbarFile.GroupCount Property
 Get the number of toolbar groups in the toolbar file.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int GroupCount { get; }
Public ReadOnly Property GroupCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace