RhinoCommon API
TextDotUserInterfaceObject.DotBackgroundColor Property
 Text dot background color
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color DotBackgroundColor { get; set; }
Public Property DotBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
TextDotUserInterfaceObject Class
Rhino.UI Namespace