RhinoCommon API
DracoCompression.TextureCoordinatesAttributePosition Property
 The attribute position for texture coordinates when compressed
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
public int TextureCoordinatesAttributePosition { get; }
Public ReadOnly Property TextureCoordinatesAttributePosition As Integer
	Get
Property Value
Type: Int32
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace