RhinoCommon API
DisplayPipelineAttributes.ShadowEdgeBlur Property
 Set blurring from 0 (no blurring) to 16 (maximum blurring)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public double ShadowEdgeBlur { get; set; }
Public Property ShadowEdgeBlur As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace