RhinoCommon API
RhinoTransformObjectsEventArgs.ObjectsWillBeCopied Property
 True if the objects will be copied.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public bool ObjectsWillBeCopied { get; }
Public ReadOnly Property ObjectsWillBeCopied As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace