RhinoCommon API
EdgeAnalysisSettings.ShowEdges Property
 Gets or sets a value referring to the group of edges that are targeted.
0 = all.
1 = naked.
2 = non-manifold.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static int ShowEdges { get; set; }
Public Shared Property ShowEdges As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
EdgeAnalysisSettings Class
Rhino.ApplicationSettings Namespace