RhinoCommon API
Dithering.Enabled Property
[Missing <summary> documentation for "P:Rhino.Render.Dithering.Enabled"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dithering Class
Rhino.Render Namespace