RhinoCommon API
RhinoDoc.CurrentUndoRecordSerialNumber Property
 >0: undo recording is active and being saved on the undo record with the specified serial number. 0: undo recording is not active. (Disabled or nothing is being recorded.)
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint CurrentUndoRecordSerialNumber { get; }
Public ReadOnly Property CurrentUndoRecordSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RhinoDoc Class
Rhino Namespace