RhinoCommon API
ObjectEnumeratorSettings.SubObjectSelected Property
 If true then objects which only have a sub object selected will be included. This is false by default.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.3
Syntax
public bool SubObjectSelected { get; set; }
Public Property SubObjectSelected As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace