RhinoCommon API
Point4d.IsValid Property
 Returns an indication regarding the validity of this point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace