RhinoCommon API
PanelIds.Materials Property
 Rhino Materials panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static Guid Materials { get; }
Public Shared ReadOnly Property Materials As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace