RhinoCommon API
ControlPoint.X Property
 Gets or sets the X coordinate of the control point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace