RhinoCommon API
CustomRenderMeshProvider.CurvePipingId Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderMeshProvider.CurvePipingId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid CurvePipingId { get; }
Public Shared ReadOnly Property CurvePipingId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace