RhinoCommon API
HiddenLineDrawingParameters.IncludeTangentSeams Property
 Include tangent seams in hidden line drawing (default is true)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IncludeTangentSeams { get; set; }
Public Property IncludeTangentSeams As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace