RhinoCommon API
Mesh.Mappings Property
 Get the mapping channels for this mesh
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public MappingChannel[] Mappings { get; }
Public ReadOnly Property Mappings As MappingChannel()
	Get
Property Value
Type: MappingChannel[]
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace