RhinoCommon API
FileWriteOptions.CreateBackupFiles Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.CreateBackupFiles"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool CreateBackupFiles { get; set; }
Public Property CreateBackupFiles As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace