RhinoCommon API
GroupTableEventArgs.NewState Property
 The Group that has changed.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.10
Syntax
public Group NewState { get; }
Public ReadOnly Property NewState As Group
	Get
Property Value
Type: Group
See Also
Reference
GroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace