RhinoCommon API
ViewCaptureWriter.Pen.Color Property
[Missing <summary> documentation for "P:Rhino.Runtime.ViewCaptureWriter.Pen.Color"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Color Color { get; }
Public ReadOnly Property Color As Color
	Get
Property Value
Type: Color
See Also
Reference
ViewCaptureWriter.Pen Class
Rhino.Runtime Namespace