RhinoCommon API
RuiUpdateUi.MenuHandle Property
Windows menu handle of menu that contains this item
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public IntPtr MenuHandle { get; }
Public ReadOnly Property MenuHandle As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace