RhinoCommon API
MeshInstance.Transform Property
 Transform for the MeshInstance
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Transform Transform { get; }
Public ReadOnly Property Transform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace