RhinoCommon API
MarkupViewChangedEventArgs.Mode Property
The markup mode the document is now in.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public MarkupMode Mode { get; }
Public ReadOnly Property Mode As MarkupMode
	Get
Property Value
Type: MarkupMode
See Also
Reference
MarkupViewChangedEventArgs Class
Rhino.DocObjects.Tables Namespace