RhinoCommon API
DisplayPipelineAttributes.ColorReductionPct Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ColorReductionPct"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ColorReductionPct { get; set; }
Public Property ColorReductionPct As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace