RhinoCommon API
RenderSettings.ImageUnitSystem Property
 unit system to use when converting image pixel size and DPI information into a print size. Default = inches
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public UnitSystem ImageUnitSystem { get; set; }
Public Property ImageUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
RenderSettings Class
Rhino.Render Namespace