RhinoCommon API
Quaternion.IsVector Property
 true if a = 0 and at least one of b, c, or d is not zero.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsVector { get; }
Public ReadOnly Property IsVector As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace