RhinoCommon API
CustomRenderContentAttribute.IsHdrCapable Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.IsHdrCapable"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.16
Syntax
public bool IsHdrCapable { get; set; }
Public Property IsHdrCapable As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace