RhinoCommon API
ModelAidSettingsState.SnapToFiltered Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.ModelAidSettingsState.SnapToFiltered"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SnapToFiltered { get; set; }
Public Property SnapToFiltered As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace