RhinoCommon API
ProviderIds.LinearWorkflow Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.LinearWorkflow"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid LinearWorkflow { get; }
Public Shared ReadOnly Property LinearWorkflow As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace