RhinoCommon API
DirectionGripUserInterfaceObject.ArrowRadius Property
 Size of direction end shape
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public float ArrowRadius { get; set; }
Public Property ArrowRadius As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DirectionGripUserInterfaceObject Class
Rhino.UI Namespace