RhinoCommon API
ColorLCH.H Property
 Gets or sets the Hue channel. The hue channel is limited to the 0~360 degree range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double H { get; set; }
Public Property H As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace