RhinoCommon API
FileReadOptions.ReferenceModelGrandParentLayerId Property
 Information that ultimately is part of a worksession reference model or linked instance definition model is being read, all layers are added as sub-layers of a grand-parent layer.When the information being read is destined for the active model, no grandparent layer is used. Value is Guid.Empty if no grandparent layer is in use.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public Guid ReferenceModelGrandParentLayerId { get; }
Public ReadOnly Property ReferenceModelGrandParentLayerId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace