RhinoCommon API
InstanceDefinition.LayerStyle Property
 Specifies how model components (layers, materials, dimension styles, etc.) from linked instance definition files appear in the active model.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public InstanceDefinitionLayerStyle LayerStyle { get; set; }
Public Property LayerStyle As InstanceDefinitionLayerStyle
	Get
	Set
Property Value
Type: InstanceDefinitionLayerStyle
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace