RhinoCommon API
SquishParameters.PreserveTopology Property
 the mesh has coincident vertices and PreserveTopology is true, then the flattening is based on the mesh's topology and coincident vertices will remain coincident. Otherwise coincident vertices are free to move apart.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public bool PreserveTopology { get; set; }
Public Property PreserveTopology As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SquishParameters Class
Rhino.Geometry Namespace