RhinoCommon API
ObjectAttributes.UserStringCount Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectAttributes.UserStringCount"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int UserStringCount { get; }
Public ReadOnly Property UserStringCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace