RhinoCommon API
FileCsvWriteOptions.ObjectDescription Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.ObjectDescription"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ObjectDescription { get; set; }
Public Property ObjectDescription As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace