RhinoCommon API
FileSkpWriteOptions.ExportPlanarRegionsAsPolygons Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSkpWriteOptions.ExportPlanarRegionsAsPolygons"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ExportPlanarRegionsAsPolygons { get; set; }
Public Property ExportPlanarRegionsAsPolygons As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSkpWriteOptions Class
Rhino.FileIO Namespace