RhinoCommon API
DimensionStyle.HasFieldOverrides Property
 Checks if any fields in this DimensionStyle are overrides
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool HasFieldOverrides { get; }
Public ReadOnly Property HasFieldOverrides As Boolean
	Get
Return Value
Type: Boolean
 True if any fields are overrides False is no fields are overrides
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace