RhinoCommon API
FileVdaWriteOptions.SendersName Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVdaWriteOptions.SendersName"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string SendersName { get; set; }
Public Property SendersName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileVdaWriteOptions Class
Rhino.FileIO Namespace