RhinoCommon API
Texture.Offset Property
 Helper for access to the offset value encoded in UvwTransform
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Vector2d Offset { get; set; }
Public Property Offset As Vector2d
	Get
	Set
Property Value
Type: Vector2d
See Also
Reference
Texture Class
Rhino.DocObjects Namespace