RhinoCommon API
ViewportInfo.FrustumHeight Property
 Gets the frustum height. This is FrustumTop - FrustumBottom.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double FrustumHeight { get; }
Public ReadOnly Property FrustumHeight As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace