RhinoCommon API
GroundPlane.Altitude Property
 Height above world XY plane in model units. Auto-altitude is computed if enabled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Altitude { get; set; }
Public Property Altitude As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GroundPlane Class
Rhino.Render Namespace