RhinoCommon API
UnitsChangedWithScalingEventArgs.Scale Property
 The scale factor.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.20
Syntax
public double Scale { get; }
Public ReadOnly Property Scale As Double
	Get
Property Value
Type: Double
See Also
Reference
UnitsChangedWithScalingEventArgs Class
Rhino Namespace