RhinoCommon API
ContentUuids.EXRTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.EXRTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid EXRTextureType { get; }
Public Shared ReadOnly Property EXRTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace