RhinoCommon API
UserInterfaceSlider.DigitPrecision Property
 Number of digits of precision for the slider. If you want the slider to only represent integer values, set the Digits value to 0.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int DigitPrecision { get; set; }
Public Property DigitPrecision As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
UserInterfaceSlider Class
Rhino.UI Namespace