RhinoCommon API
PostEffect.Styles Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffect.Styles"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PostEffectStyles Styles { get; }
Public ReadOnly Property Styles As PostEffectStyles
	Get
Property Value
Type: PostEffectStyles
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace