RhinoCommon API
Color4f.A Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.A"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public float A { get; }
Public ReadOnly Property A As Single
	Get
Property Value
Type: Single
See Also
Reference
Color4f Structure
Rhino.Display Namespace