RhinoCommon API
SnapshotTable.Names Property
Array of Snapshot names.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public string[] Names { get; }
Public ReadOnly Property Names As String()
	Get
Return Value
Type: String[]
 A string array with the names of all Snapshots in the document.
See Also
Reference
SnapshotTable Class
Rhino.DocObjects.Tables Namespace