RhinoCommon API
Brep.Trims Property
 Gets the brep trims list accessor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public BrepTrimList Trims { get; }
Public ReadOnly Property Trims As BrepTrimList
	Get
Property Value
Type: BrepTrimList
See Also
Reference
Brep Class
Rhino.Geometry Namespace