RhinoCommon API
FileStpWriteOptions.Schema Property
 Get and set the schema of the step file being written.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileStpWriteOptions.StepSchema Schema { get; set; }
Public Property Schema As FileStpWriteOptions.StepSchema
	Get
	Set
Property Value
Type: FileStpWriteOptions.StepSchema
See Also
Reference
FileStpWriteOptions Class
Rhino.FileIO Namespace