RhinoCommon API
MaterialRefs.Keys Property
 Gets an ICollection containing the plug-in Id's in this dictionary.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public ICollection<Guid> Keys { get; }
Public ReadOnly Property Keys As ICollection(Of Guid)
	Get
Property Value
Type: ICollection<Guid>
Implements
IDictionary<TKey, TValue>.Keys
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace