RhinoCommon API
TextFields.InstanceAttributeField.Prompt Property
 Prompt displayed by the UI when inserting a block
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string Prompt { get; }
Public ReadOnly Property Prompt As String
	Get
Property Value
Type: String
See Also
Reference
TextFields.InstanceAttributeField Class
Rhino.Runtime Namespace