RhinoCommon API
CollapsibleSectionImpl.CppPointer Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.CollapsibleSectionImpl.CppPointer"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace