RhinoCommon API
FileSettings.AutoSaveInterval Property
how often the document will be saved when Rhino's automatic file saving mechanism is enabled.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static TimeSpan AutoSaveInterval { get; set; }
Public Shared Property AutoSaveInterval As TimeSpan
	Get
	Set
Property Value
Type: TimeSpan
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace