RhinoCommon API
NotificationButtonClickedArgs.ButtonClicked Property
 The button that was clicked.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ButtonType ButtonClicked { get; }
Public ReadOnly Property ButtonClicked As ButtonType
	Get
Property Value
Type: ButtonType
See Also
Reference
NotificationButtonClickedArgs Class
Rhino.Runtime.Notifications Namespace