RhinoCommon API
FileAiReadOptions.AiScale Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileAiReadOptions.AiScale"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public double AiScale { get; set; }
Public Property AiScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
FileAiReadOptions Class
Rhino.FileIO Namespace