RhinoCommon API
PersistentSettings.RhinoAppSettings Property
[Missing <summary> documentation for "P:Rhino.PersistentSettings.RhinoAppSettings"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
public static PersistentSettings RhinoAppSettings { get; }
Public Shared ReadOnly Property RhinoAppSettings As PersistentSettings
	Get
Property Value
Type: PersistentSettings
See Also
Reference
PersistentSettings Class
Rhino Namespace