RhinoCommon API
RebuildCurveOptions.UniformityIntensity Property
 When UniformityPermitted is true, UniformityIntensity sets and gets the intensity of forcing the the distance between control points to be equal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RebuildCurveIntensity UniformityIntensity { get; set; }
Public Property UniformityIntensity As RebuildCurveIntensity
	Get
	Set
Property Value
Type: RebuildCurveIntensity
See Also
Reference
RebuildCurveOptions Class
Rhino.Geometry Namespace