RhinoCommon API
BrepFace.FaceIndex Property
Index of face in Brep.Faces array.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int FaceIndex { get; }
Public ReadOnly Property FaceIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace