RhinoCommon API
DimensionStyle.ArcLengthSymbol Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ArcLengthSymbol"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int ArcLengthSymbol { get; set; }
Public Property ArcLengthSymbol As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace