RhinoCommon API
DecalCreateParams.MapToInside Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.MapToInside"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool MapToInside { get; set; }
Public Property MapToInside As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace