RhinoCommon API
InstanceDefinition.UnitSystem Property
 Gets the unit system of the instance definition. If the instance definition was imported from another 3dm file, the unit system may differ from that of the document.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public UnitSystem UnitSystem { get; set; }
Public Property UnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace