RhinoCommon API
DisplayPipelineAttributes.ClippingEdgeThickness Property
 Edge thickness in pixels.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int ClippingEdgeThickness { get; set; }
Public Property ClippingEdgeThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace