RhinoCommon API
DirectionAnalysisSettingsState.V Property
 Gets or sets whether to display the V dir.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool V { get; set; }
Public Property V As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DirectionAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace