RhinoCommon API
Interval.ZeroToTwoPi Property
 Gets an Interval whose limits are 0.0 and 2*Pi.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static Interval ZeroToTwoPi { get; }
Public Shared ReadOnly Property ZeroToTwoPi As Interval
	Get
Property Value
Type: Interval
See Also
Reference
Interval Structure
Rhino.Geometry Namespace