RhinoCommon API
FileXamlWriteOptions.AnimationAxis Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileXamlWriteOptions.AnimationAxis"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public FileXamlWriteOptions.AnimationMode AnimationAxis { get; set; }
Public Property AnimationAxis As FileXamlWriteOptions.AnimationMode
	Get
	Set
Property Value
Type: FileXamlWriteOptions.AnimationMode
See Also
Reference
FileXamlWriteOptions Class
Rhino.FileIO Namespace