RhinoCommon API
InstanceDefinition.Index Property
 Index of this instance definition in the index definition table.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public override int Index { get; }
Public Overrides ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace