RhinoCommon API
DisplayMaterial.IsTwoSided Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayMaterial.IsTwoSided"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsTwoSided { get; set; }
Public Property IsTwoSided As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace