RhinoCommon API
ObjectEnumeratorSettings.LayerIndexFilter Property
 The layer filter property can be used to limit the iteration to objects on a specific layer. The default is to iterate through all layers.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int LayerIndexFilter { get; set; }
Public Property LayerIndexFilter As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace