RhinoCommon API
Fonts.TitleFont Property
 Returns a font used for dialog titles. 2x the size of NormalFont, and bold.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Font TitleFont { get; }
Public Shared ReadOnly Property TitleFont As Font
	Get
Property Value
Type: Font
See Also
Reference
Fonts Class
Rhino.UI Namespace