RhinoCommon API
AppearanceSettingsState.GridThickLineColor Property
Gets or sets the color of the thick line in the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Color GridThickLineColor { get; set; }
Public Property GridThickLineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace