RhinoCommon API
SubD.ErrorCount Property
 The number of errors the SubD code has trapped since the process started.
 This is a diagnostic counter, not a per-SubD property. Sample it before and after an operation to find out whether that operation hit an internal error, which usually means the SubD is not valid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public static uint ErrorCount { get; }
Public Shared ReadOnly Property ErrorCount As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
SubD Class
Rhino.Geometry Namespace