RhinoCommon API
FileCsvWriteOptions.VolumeCentroid Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileCsvWriteOptions.VolumeCentroid"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool VolumeCentroid { get; set; }
Public Property VolumeCentroid As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace