RhinoCommon API
PhysicallyBasedMaterial.Anisotropic Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.Anisotropic"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double Anisotropic { get; set; }
Public Property Anisotropic As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace