RhinoCommon API
MaterialTableEventArgs.EventType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.MaterialTableEventArgs.EventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public MaterialTableEventType EventType { get; }
Public ReadOnly Property EventType As MaterialTableEventType
	Get
Property Value
Type: MaterialTableEventType
See Also
Reference
MaterialTableEventArgs Class
Rhino.DocObjects.Tables Namespace