RhinoCommon API
RhinoDoc.PageAngleToleranceRadians Property
Page space angle tolerance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double PageAngleToleranceRadians { get; set; }
Public Property PageAngleToleranceRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RhinoDoc Class
Rhino Namespace