RhinoCommon API
BrepEdge.Valence Property
 Gets the topological valency of this edge. The topological valency is defined by how many adjacent faces share this edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public EdgeAdjacency Valence { get; }
Public ReadOnly Property Valence As EdgeAdjacency
	Get
Property Value
Type: EdgeAdjacency
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace