RhinoCommon API
ObjectTable.BoundingBox Property
 Gets the bounding box for all objects (normal, locked and hidden) in this document that exist in "model" space. This bounding box does not include objects that exist in layout space.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace