RhinoCommon API
SubDFace.ControlNetCenterPoint Property
 The face's control net center point is the average of the face's vertex control net points. This is the same point as the face's subdivision point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Point3d ControlNetCenterPoint { get; }
Public ReadOnly Property ControlNetCenterPoint As Point3d
	Get
Return Value
Type: Point3d
 The average of the face's vertex control net points
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace