RhinoCommon API
TextDot.Point Property
 Gets or sets the position of the text dot.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d Point { get; set; }
Public Property Point As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
TextDot Class
Rhino.Geometry Namespace