RhinoCommon API
DetailViewObject.WorldToPageTransform Property
 Gets the world coordinate to page coordinate transformation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Transform WorldToPageTransform { get; }
Public ReadOnly Property WorldToPageTransform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace