RhinoCommon API
AddCustomUISectionsEventArgs.EventType Property
 The type of the event.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Guid EventType { get; }
Public ReadOnly Property EventType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
AddCustomUISectionsEventArgs Class
Rhino.Render Namespace