RhinoCommon API
CreatePreviewEventArgs.Quality Property
 Quality of the preview image that is being requested for the preview scene
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public PreviewSceneQuality Quality { get; }
Public ReadOnly Property Quality As PreviewSceneQuality
	Get
Property Value
Type: PreviewSceneQuality
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace