RhinoCommon API
AppearanceSettingsState.EditCandidateColor Property
Gets or sets the color of objects that are eligible to be edited.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Color EditCandidateColor { get; set; }
Public Property EditCandidateColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace