RhinoCommon API
SectionStyle.IsUnset Property
 Returns true if the section style is unset.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsUnset { get; }
Public ReadOnly Property IsUnset As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace