RhinoCommon API
DisplayModeDescription.RaytracedId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.RaytracedId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid RaytracedId { get; }
Public Shared ReadOnly Property RaytracedId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace