RhinoCommon API
MeshCurveIntersection.FaceTriangleIndex Property
0 for a triangle face; 0 or 1 for the two sub-triangles of a quad face.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int FaceTriangleIndex { get; }
Public ReadOnly Property FaceTriangleIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace