RhinoCommon API
RhinoDoc.ModelUrl Property
 Gets and sets the link address, or URL, for the model.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string ModelUrl { get; set; }
Public Property ModelUrl As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RhinoDoc Class
Rhino Namespace