RhinoCommon API
RhinoApp.LicenseExpires Property
 Returns true if the license will expire false otherwise
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public static bool LicenseExpires { get; }
Public Shared ReadOnly Property LicenseExpires As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace