RhinoCommon API
FileVdaWriteOptions.ProjectName Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVdaWriteOptions.ProjectName"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string ProjectName { get; set; }
Public Property ProjectName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileVdaWriteOptions Class
Rhino.FileIO Namespace