RhinoCommon API
FileTxtReadOptions.CreatePointCloud Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileTxtReadOptions.CreatePointCloud"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool CreatePointCloud { get; set; }
Public Property CreatePointCloud As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileTxtReadOptions Class
Rhino.FileIO Namespace