RhinoCommon API
CurvatureGraphSettingsState.SrfVHair Property
 Gets or sets the whether to show surface V hairs
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SrfVHair { get; set; }
Public Property SrfVHair As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CurvatureGraphSettingsState Class
Rhino.ApplicationSettings Namespace