RhinoCommon API
LinearWorkflow.PreProcessGamma Property
 Linear workflow pre-process gamma value. This is currently the same as the post-process gamma value.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public float PreProcessGamma { get; set; }
Public Property PreProcessGamma As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace