RhinoCommon API
PlugInInfo.UpdateUrl Property
 Returns the web site, or URL, were an updated version of the plug-in can be found.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public string UpdateUrl { get; }
Public ReadOnly Property UpdateUrl As String
	Get
Property Value
Type: String
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace