RhinoCommon API
FileGltfWriteOptions.UseDisplayColorForUnsetMaterials Property
 Setting to display color as material when material index for object is -1.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public bool UseDisplayColorForUnsetMaterials { get; set; }
Public Property UseDisplayColorForUnsetMaterials As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace