RhinoCommon API
RhinoApp.UpdatesAndStatisticsStatus Property
 Returns true when Rhino is allowed to access the Internet, false otherwise. Note, this does not test if Internet access is available.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.15
Syntax
public static int UpdatesAndStatisticsStatus { get; }
Public Shared ReadOnly Property UpdatesAndStatisticsStatus As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoApp Class
Rhino Namespace