RhinoCommon API
ViewCaptureWriter.Dpi Property
[Missing <summary> documentation for "P:Rhino.Runtime.ViewCaptureWriter.Dpi"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected double Dpi { get; }
Protected ReadOnly Property Dpi As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace