RhinoCommon API
PhysicallyBasedMaterial.AnisotropicRotation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.AnisotropicRotation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double AnisotropicRotation { get; set; }
Public Property AnisotropicRotation As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace