RhinoCommon API
RenderPropertyChangedEvent.Context Property
 Optional argument which may specify the property being modified.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public int Context { get; }
Public ReadOnly Property Context As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RenderPropertyChangedEvent Class
Rhino.Render Namespace