RhinoCommon API
FileSwReadOptions.ImportPartsAsBlocks Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileSwReadOptions.ImportPartsAsBlocks"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool ImportPartsAsBlocks { get; set; }
Public Property ImportPartsAsBlocks As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileSwReadOptions Class
Rhino.FileIO Namespace