RhinoCommon API
RhinoDoc.IsAvailable Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.IsAvailable"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool IsAvailable { get; }
Public ReadOnly Property IsAvailable As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace