RhinoCommon API
DisplayPipelineAttributes.SubDBoundaryEdgeColor Property
 Edge color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public Color SubDBoundaryEdgeColor { get; set; }
Public Property SubDBoundaryEdgeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace