RhinoCommon API
DisplayPipelineAttributes.ShowTangentEdges Property
Show tangent edges.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public bool ShowTangentEdges { get; set; }
Public Property ShowTangentEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace