RhinoCommon API
DisplayPipelineAttributes.LockedObjectTransparency Property
 LockedObjectTransparency.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int LockedObjectTransparency { get; set; }
Public Property LockedObjectTransparency As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace