RhinoCommon API
File3dmSettings.CurrentLinePatternId Property
The id of the current line pattern (linetype).
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public Guid CurrentLinePatternId { get; set; }
Public Property CurrentLinePatternId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace