RhinoCommon API
DisplayPipelineAttributes.ShadowIntensity Property
 Shadow intensity (percentage 0-100)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public int ShadowIntensity { get; set; }
Public Property ShadowIntensity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace