RhinoCommon API
PhysicallyBasedMaterial.BRDF Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PhysicallyBasedMaterial.BRDF"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PhysicallyBasedMaterial.BRDFs BRDF { get; set; }
Public Property BRDF As PhysicallyBasedMaterial.BRDFs
	Get
	Set
Property Value
Type: PhysicallyBasedMaterial.BRDFs
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace