RhinoCommon API
Instance.IsRequestingPlugInDependent Property
 If this instance will change depending on the requesting plug-in.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool IsRequestingPlugInDependent { get; set; }
Public Property IsRequestingPlugInDependent As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Instance Class
Rhino.Render.CustomRenderMeshes Namespace