RhinoCommon API
ViewportInfo.ScreenPortAspect Property
 Gets the screen aspect ratio.
This is width / height.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ScreenPortAspect { get; }
Public ReadOnly Property ScreenPortAspect As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace