RhinoCommon API
DisplayRenderSettings.ForceFlatShading Property
 True if flat shading is forced
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool ForceFlatShading { get; }
Public ReadOnly Property ForceFlatShading As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayRenderSettings Class
Rhino.Render.ChangeQueue Namespace