RhinoCommon API
ContentUuids.BasicMaterialCCI Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.BasicMaterialCCI"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid BasicMaterialCCI { get; }
Public Shared ReadOnly Property BasicMaterialCCI As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace