RhinoCommon API
ObjectPropertiesPage.Index Property
 The page navigation control adds buttons in the order the pages are processed, override this method and return a sort index to move the button to the beginning of the list. By default this returns -1 which puts the button at the end of the list.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public virtual int Index { get; }
Public Overridable ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace