RhinoCommon API
RhinoView.Document Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoView.Document"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoView Class
Rhino.Display Namespace