RhinoCommon API
GetCurve.UseActiveLayerLinetype Property
 When true, the linetype of the active layer is used for the dynamic drawing. Default is false.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UseActiveLayerLinetype { get; set; }
Public Property UseActiveLayerLinetype As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace