RhinoCommon API
UndoRedoEventArgs.IsBeginUndo Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsBeginUndo"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsBeginUndo { get; }
Public ReadOnly Property IsBeginUndo As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace