RhinoCommon API
CurvatureGraphSettings.HairScale Property
 Gets or sets the hair scale;
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static int HairScale { get; set; }
Public Shared Property HairScale As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
CurvatureGraphSettings Class
Rhino.ApplicationSettings Namespace