RhinoCommon API
MeshInstance.RootId Property
 Get the Guid of the object that is at the root of the MeshInstance ancestry, or Guid.Empty if this has no root.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public Guid RootId { get; }
Public ReadOnly Property RootId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace