RhinoCommon API
RhinoDoc.IsReadOnly Property
 Current read-only mode for this document. true if the document can be viewed but NOT saved. false if document can be viewed and saved.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsReadOnly { get; }
Public ReadOnly Property IsReadOnly As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace