RhinoCommon API
LicenseData.BuildType Property
 The build of the product that this license work with. When your product requests a license from the Zoo, it will specify one of these build types.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public LicenseBuildType BuildType { get; set; }
Public Property BuildType As LicenseBuildType
	Get
	Set
Property Value
Type: LicenseBuildType
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace