RhinoCommon API
FileSlcWriteOptions.EndPoint Property
 End of the slicing normal
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Point3d EndPoint { get; set; }
Public Property EndPoint As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
FileSlcWriteOptions Class
Rhino.FileIO Namespace