RhinoCommon API
LinetypeTableEventArgs.LinetypeIndex Property
 Index of the linetype.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int LinetypeIndex { get; }
Public ReadOnly Property LinetypeIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
LinetypeTableEventArgs Class
Rhino.DocObjects.Tables Namespace