RhinoCommon API
DocumentOpenEventArgs.Reference Property
 true if file is opened as a reference file.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Reference { get; }
Public ReadOnly Property Reference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DocumentOpenEventArgs Class
Rhino Namespace