RhinoCommon API
RhinoDoc.WorksessionFileChangedEventArgs.Document Property
Document the worksession belongs to.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoDoc.WorksessionFileChangedEventArgs Class
Rhino Namespace