RhinoCommon API
NurbsSurface.OrderU Property
 Gets the order in the U direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int OrderU { get; }
Public ReadOnly Property OrderU As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace