RhinoCommon API
ViewInfo.ClippingPlanesIds Property
 Returns a list of clipping plane Ids associated with this view.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public Guid[] ClippingPlanesIds { get; }
Public ReadOnly Property ClippingPlanesIds As Guid()
	Get
Property Value
Type: Guid[]
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace