RhinoCommon API
NurbsCurveFitParameters.SampleCount Property
 This is the number of points the NURBS curve is fit through. Is it common for these points to be sampled from an input curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int SampleCount { get; }
Public ReadOnly Property SampleCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsCurveFitParameters Class
Rhino.Geometry Namespace