RhinoCommon API
HiddenLineDrawingSegment.CurveGeometry Property
 The actual curve geometry
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Curve CurveGeometry { get; }
Public ReadOnly Property CurveGeometry As Curve
	Get
Property Value
Type: Curve
See Also
Reference
HiddenLineDrawingSegment Class
Rhino.Geometry Namespace