RhinoCommon API
Cone.Height Property
 Gets or sets the height of the circular right cone.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Cone Structure
Rhino.Geometry Namespace