RhinoCommon API
SubDEdgeSharpness.MaximumEndSharpness Property
 Gets the larger of the two end sharpness values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public double MaximumEndSharpness { get; }
Public ReadOnly Property MaximumEndSharpness As Double
	Get
Property Value
Type: Double
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace