RhinoCommon API
DisplayPen.HaloThickness Property
 Halos are blended colors drawn around a curve for purposes like selection
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public float HaloThickness { get; set; }
Public Property HaloThickness As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPen Class
Rhino.Display Namespace