RhinoCommon API
ObjectPropertiesPage.PageIconEmbeddedResourceString Property
 Resource string for a embedded icon resource in the assembly containing the page instance. If this returns a valid resource and Rhino can load the icon the loaded icon will get used directly otherwise; the PageIcon method will get called.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public virtual string PageIconEmbeddedResourceString { get; }
Public Overridable ReadOnly Property PageIconEmbeddedResourceString As String
	Get
Property Value
Type: String
The page icon embedded resource string.
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace