RhinoCommon API
LinetypeTable.ByLayerLinetypeName Property
 Returns the text name of the by-layer linetype.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string ByLayerLinetypeName { get; }
Public ReadOnly Property ByLayerLinetypeName As String
	Get
Property Value
Type: String
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace