RhinoCommon API
FileSettings.ExecutableFolder Property
Returns the directory where the main Rhino executable is located.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static string ExecutableFolder { get; }
Public Shared ReadOnly Property ExecutableFolder As String
	Get
Property Value
Type: String
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace