RhinoCommon API
AppearanceSettings.CommandPromptFontSize Property
 Size of font used in command prompt (in points)
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static int CommandPromptFontSize { get; set; }
Public Shared Property CommandPromptFontSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace