RhinoCommon API
AppearanceSettings.EffectiveHelpLanguageIdentifier Property
 Gets the language identifier the Help system uses. This is HelpLanguageIdentifier when it has been set, otherwise LanguageIdentifier. Never returns zero.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static int EffectiveHelpLanguageIdentifier { get; }
Public Shared ReadOnly Property EffectiveHelpLanguageIdentifier As Integer
	Get
Property Value
Type: Int32
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace