RhinoCommon API
LinetypeTable.Count Property
 Returns number of linetypes in the linetypes table, including deleted linetypes.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace