RhinoCommon API
ICollapsibleSectionHolder.TopMargin Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSectionHolder.TopMargin"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
int TopMargin { get; set; }
Property TopMargin As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace