RhinoCommon API
Material.AlphaTransparency Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.AlphaTransparency"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool AlphaTransparency { get; set; }
Public Property AlphaTransparency As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Material Class
Rhino.DocObjects Namespace