RhinoCommon API
FileIgsWriteOptions.SimplifyCurves Property
TRUE means NURBS that are lines or arcs will be written as lines or arcs instead of 126's
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool SimplifyCurves { get; set; }
Public Property SimplifyCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace