RhinoCommon API
FilePlyWriteOptions.UseSimpleDialog Property
 Determines whether to use the simple or detailed meshing dialog.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool UseSimpleDialog { get; set; }
Public Property UseSimpleDialog As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace