RhinoCommon API
FileVdaWriteOptions.Address Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileVdaWriteOptions.Address"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public string Address { get; set; }
Public Property Address As String
	Get
	Set
Property Value
Type: String
See Also
Reference
FileVdaWriteOptions Class
Rhino.FileIO Namespace