RhinoCommon API
PostEffectPipeline.GPUAllowed Property
 Post effect authors should check that GPU use is allowed before using the GPU in a post effect.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool GPUAllowed { get; }
Public ReadOnly Property GPUAllowed As Boolean
	Get
Return Value
Type: Boolean
Return true if the pipeline is allowed to use the GPU, else false
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace