RhinoCommon API
BrepTrim.StartVertex Property
 BrepVertex at start of trim
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public BrepVertex StartVertex { get; }
Public ReadOnly Property StartVertex As BrepVertex
	Get
Property Value
Type: BrepVertex
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace