RhinoCommon API
CustomGripObject.MovedOtherThanLocation Property
 Set this when the grip changes something other than its location, such as a weight, so that Rhino counts the grip as moved. Rhino already counts a grip whose location moved, so this only adds to that. Cleared when Rhino undoes the grip move.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool MovedOtherThanLocation { get; set; }
Public Property MovedOtherThanLocation As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
 A stored flag rather than something Rhino asks for: it is read once per grip per draw, so answering it across the managed boundary would cost a transition per grip per frame. Real time work driven by grip movement belongs in CustomObjectGrips.OnDraw, which runs on the display thread, together with the NewLocation latch.
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace