RhinoCommon API
DirectionGripUserInterfaceObject.OneWay Property
 Is the grip a single direction grip
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool OneWay { get; set; }
Public Property OneWay As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DirectionGripUserInterfaceObject Class
Rhino.UI Namespace