RhinoCommon API
RenderMeshes.InstanceCount Property
 The number of instance objects in this collection.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int InstanceCount { get; }
Public ReadOnly Property InstanceCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RenderMeshes Class
Rhino.Render.CustomRenderMeshes Namespace