RhinoCommon API
ZebraAnalysisSettingsState.StripeThickness Property
 Gets or sets the stripe thickness, where 0 = thinnest and 6 = thickest.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public int StripeThickness { get; set; }
Public Property StripeThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ZebraAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace