RhinoCommon API
DisplayPipelineAttributes.ClippingEdgeColorUsage Property
 Specifies how the color for the Edges is determined
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public DisplayPipelineAttributes.ClippingEdgeColorUse ClippingEdgeColorUsage { get; set; }
Public Property ClippingEdgeColorUsage As DisplayPipelineAttributes.ClippingEdgeColorUse
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.ClippingEdgeColorUse
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace