RhinoCommon API
GeneralSettings.SplitCreasedSurfaces Property
 Should surfaces be split into polysurfaces with smooth faces. This setting is read-only.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static bool SplitCreasedSurfaces { get; }
Public Shared ReadOnly Property SplitCreasedSurfaces As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace