RhinoCommon API
AreaMassProperties.WorldCoordinatesProductMomentsError Property
 Uncertainty in world coordinates second moments calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Vector3d WorldCoordinatesProductMomentsError { get; }
Public ReadOnly Property WorldCoordinatesProductMomentsError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace