RhinoCommon API
RdkEdit.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.DataSources.RdkEdit.CppPointer"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RdkEdit Class
Rhino.Render.DataSources Namespace