RhinoCommon API
RhinoDoc.IsCommandRunning Property
 Returns true if Rhino is currently running a command.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool IsCommandRunning { get; }
Public ReadOnly Property IsCommandRunning As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoDoc Class
Rhino Namespace