RhinoCommon API
NodeInCodeTable.Count Property
 Returns the amount of items in this table.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NodeInCodeTable Class
Rhino.NodeInCode Namespace