RhinoCommon API
PhysicallyBased.SheenTint Property
[Missing <summary> documentation for "P:Rhino.Render.ChildSlotNames.PhysicallyBased.SheenTint"]
 Namespace: Rhino.Render.ChildSlotNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string SheenTint { get; }
Public Shared ReadOnly Property SheenTint As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBased Class
Rhino.Render.ChildSlotNames Namespace