RhinoCommon API
RhinoObject.RenderMaterial Property
 Gets the render material associated with this object or null if there is none. This does not pay attention to the material source and will not check parent objects or layers for a RenderMaterial.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public RenderMaterial RenderMaterial { get; set; }
Public Property RenderMaterial As RenderMaterial
	Get
	Set
Property Value
Type: RenderMaterial
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace