RhinoCommon API
MeshingParameters.RelativeTolerance Property
 Gets or sets the relative tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double RelativeTolerance { get; set; }
Public Property RelativeTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace