RhinoCommon API
ICurrentEnvironment_Get.ForReflectionAndRefraction Property
 Get the RenderEnvironment used as custom reflection (and refraction) environment. Null will be returned if the custom reflection override is disabled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
RenderEnvironment ForReflectionAndRefraction { get; }
ReadOnly Property ForReflectionAndRefraction As RenderEnvironment
	Get
Property Value
Type: RenderEnvironment
See Also
Reference
ICurrentEnvironment_Get Interface
Rhino.Render Namespace