RhinoCommon API
SmartTrackSettingsState.Parallels Property
Turns on and off the ability to draw parallel tracking lines.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool Parallels { get; set; }
Public Property Parallels As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace