RhinoCommon API
CommandEventArgs.CommandEnglishName Property
 Gets the English name of the command that raised this event.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string CommandEnglishName { get; }
Public ReadOnly Property CommandEnglishName As String
	Get
Property Value
Type: String
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace