RhinoCommon API
AppearanceSettings.SelectionWindowCrossingStrokeColor Property
 Color used to draw stroke for selection crossing window
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Color SelectionWindowCrossingStrokeColor { get; set; }
Public Shared Property SelectionWindowCrossingStrokeColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace