RhinoCommon API
RealtimeDisplayModeClassInfo.RealtimeDisplayModeType Property
 Get the type being registered.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public abstract Type RealtimeDisplayModeType { get; }
Public MustOverride ReadOnly Property RealtimeDisplayModeType As Type
	Get
Property Value
Type: Type
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace