RhinoCommon API
RenderMaterial.SmellsLikeTexturedGlass Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeTexturedGlass"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SmellsLikeTexturedGlass { get; }
Public ReadOnly Property SmellsLikeTexturedGlass As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace