RhinoCommon API
CommandEventArgs.CommandLocalName Property
 Gets the name of the command that raised this event in the local language.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string CommandLocalName { get; }
Public ReadOnly Property CommandLocalName As String
	Get
Property Value
Type: String
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace