RhinoCommon API
RhinoApp.IsSafeModeEnabled Property
Is Rhino being executed in safe mode
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public static bool IsSafeModeEnabled { get; }
Public Shared ReadOnly Property IsSafeModeEnabled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoApp Class
Rhino Namespace