RhinoCommon API
DimensionStyle.ForceDimensionLineBetweenExtensionLines Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ForceDimensionLineBetweenExtensionLines"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.20
Syntax
public bool ForceDimensionLineBetweenExtensionLines { get; set; }
Public Property ForceDimensionLineBetweenExtensionLines As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace