RhinoCommon API
Cylinder.Center Property
 Gets the center point of the defining circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d Center { get; }
Public ReadOnly Property Center As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace