RhinoCommon API
WorksessionModel.IsAttached Property
 True if the model's contents are currently attached to the document.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool IsAttached { get; }
Public ReadOnly Property IsAttached As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
WorksessionModel Class
Rhino.DocObjects Namespace