RhinoCommon API
CursorTooltipSettingsState.EnableGumballToolTips Property
 Turns on/off gumball tooltips
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool EnableGumballToolTips { get; set; }
Public Property EnableGumballToolTips As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace