RhinoCommon API
File3dmDisplacement.InitialQuality Property
 Specifies how densely the object is initially subdivided. The lower the value, the higher the resolution of the displaced mesh.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public int InitialQuality { get; set; }
Public Property InitialQuality As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace