RhinoCommon API
BinaryArchiveReader.CurrentPosition Property
current offset (in bytes) into archive ( like ftell() )
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ulong CurrentPosition { get; }
Public ReadOnly Property CurrentPosition As ULong
	Get
Property Value
Type: UInt64
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace