RhinoCommon API
SoftTransformSettingsState.FalloffColor Property
 Controls the color used to shade meshes and edges when an object is affected by soft transform.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public Color FalloffColor { get; set; }
Public Property FalloffColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
SoftTransformSettingsState Class
Rhino.ApplicationSettings Namespace