RhinoCommon API
File3mfWriteOptions.Title Property
[Missing <summary> documentation for "P:Rhino.FileIO.File3mfWriteOptions.Title"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.7
Syntax
public string Title { get; set; }
Public Property Title As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3mfWriteOptions Class
Rhino.FileIO Namespace