RhinoCommon API
FileDgnReadOptions.GroupCellHeaders Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileDgnReadOptions.GroupCellHeaders"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public bool GroupCellHeaders { get; set; }
Public Property GroupCellHeaders As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileDgnReadOptions Class
Rhino.FileIO Namespace