RhinoCommon API
ContentUuids.SimpleBitmapTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.SimpleBitmapTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid SimpleBitmapTextureType { get; }
Public Shared ReadOnly Property SimpleBitmapTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace