RhinoCommon API
ContentUuids.TileTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.TileTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid TileTextureType { get; }
Public Shared ReadOnly Property TileTextureType As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ContentUuids Class
Rhino.Render Namespace