RhinoCommon API
BitmapEntry.FileName Property
The name of this bitmap.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public string FileName { get; }
Public ReadOnly Property FileName As String
	Get
Property Value
Type: String
See Also
Reference
BitmapEntry Class
Rhino.DocObjects Namespace