RhinoCommon API
Toolbar.TabSize Property
 Gets and sets the size of the toolbar tab.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Size TabSize { get; set; }
Public Shared Property TabSize As Size
	Get
	Set
Property Value
Type: Size
See Also
Reference
Toolbar Class
Rhino.UI Namespace