RhinoCommon API
PlugIn.SettingsDirectory Property
 Get the plug-in's settings directory. This is the directory where the plug-in's persistent settings files are saved. This directory will be located in the user's profile folder. Note, this does not verify the directory exists.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public string SettingsDirectory { get; }
Public ReadOnly Property SettingsDirectory As String
	Get
Property Value
Type: String
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace