RhinoCommon API
Ellipse.Plane Property
 Gets or sets the base plane of the ellipse.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace