RhinoCommon API
FilePlyWriteOptions.ExportMaterial Property
 Determines whether to export a material.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool ExportMaterial { get; set; }
Public Property ExportMaterial As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace