RhinoCommon API
InstanceDefinitionGeometry.UrlDescription Property
 Gets or sets the description of the URL or hyperlink of the definition.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public string UrlDescription { get; set; }
Public Property UrlDescription As String
	Get
	Set
Property Value
Type: String
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace