RhinoCommon API
FileWriteOptions.IncludeHistory Property
 The file written should include history information if your File Writing Plug-In supports it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IncludeHistory { get; set; }
Public Property IncludeHistory As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace