RhinoCommon API
NurbsCurvePointList.ControlPolygonLength Property
 Gets the length of the polyline connecting all control points.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public double ControlPolygonLength { get; }
Public ReadOnly Property ControlPolygonLength As Double
	Get
Property Value
Type: Double
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace