RhinoCommon API
Brep.VariationalPatchSettings.DegreeU Property
 Surface degree in U-direction
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public int DegreeU { get; set; }
Public Property DegreeU As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace