RhinoCommon API
GetEllipse.FirstPoint Property
 Returns the first point. If in "from foci" mode, then this is the first foci point.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Point3d FirstPoint { get; }
Public ReadOnly Property FirstPoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
GetEllipse Class
Rhino.Input.Custom Namespace