RhinoCommon API
CustomRenderMeshProvider.EdgeSofteningId Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderMeshProvider.EdgeSofteningId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static Guid EdgeSofteningId { get; }
Public Shared ReadOnly Property EdgeSofteningId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace