RhinoCommon API
Command.HistoryReplayOnObjectAttributeChange Property
 By default, object attribute changes do not trigger history replay. Set this property to true, typically in the command's constructor, if you want objects created with this command to trigger history replay when their attributes change.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.34
Syntax
public bool HistoryReplayOnObjectAttributeChange { get; set; }
Public Property HistoryReplayOnObjectAttributeChange As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Command Class
Rhino.Commands Namespace