RhinoCommon API
PanelEventArgs.DocumentSerialNumber Property
[Missing <summary> documentation for "P:Rhino.UI.PanelEventArgs.DocumentSerialNumber"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint DocumentSerialNumber { get; }
Public ReadOnly Property DocumentSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
PanelEventArgs Class
Rhino.UI Namespace