RhinoCommon API
ChooseOneObjectSettings.MaxAutoResizeItems Property
MaxAutoResizeItems
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static int MaxAutoResizeItems { get; set; }
Public Shared Property MaxAutoResizeItems As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ChooseOneObjectSettings Class
Rhino.ApplicationSettings Namespace