RhinoCommon API
FileStlReadOptions.UseFileNameAsObjectName Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileStlReadOptions.UseFileNameAsObjectName"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public bool UseFileNameAsObjectName { get; set; }
Public Property UseFileNameAsObjectName As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileStlReadOptions Class
Rhino.FileIO Namespace