RhinoCommon API
DimensionStyle.ScaleRightLengthMillimeters Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ScaleRightLengthMillimeters"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public double ScaleRightLengthMillimeters { get; set; }
Public Property ScaleRightLengthMillimeters As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace