RhinoCommon API
Font.Italic Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Italic"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool Italic { get; }
Public ReadOnly Property Italic As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Font Class
Rhino.DocObjects Namespace