RhinoCommon API
SubDEdgeSharpness.IsCrease Property
 Gets true if this is Crease.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public bool IsCrease { get; }
Public ReadOnly Property IsCrease As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace