RhinoCommon API
IOpenIDConnectToken.RawToken Property
 The raw OpenIDConnect token.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
string RawToken { get; }
ReadOnly Property RawToken As String
	Get
Property Value
Type: String
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace