RhinoCommon API
File3dmPlugInDetails.Name Property
Public facing name of the plug-in
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dmPlugInDetails Class
Rhino.FileIO Namespace