RhinoCommon API
SubDCreationOptions.Smooth Property
 No interior creases and no corners.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static SubDCreationOptions Smooth { get; }
Public Shared ReadOnly Property Smooth As SubDCreationOptions
	Get
Property Value
Type: SubDCreationOptions
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace