RhinoCommon API
DimensionStyle.DimTextLocation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimTextLocation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public DimensionStyle.TextLocation DimTextLocation { get; set; }
Public Property DimTextLocation As DimensionStyle.TextLocation
	Get
	Set
Property Value
Type: DimensionStyle.TextLocation
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace