RhinoCommon API
RhinoObject.NextRuntimeSerialNumber Property
 Gets the runtime serial number that will be assigned to the next Rhino Object that is created.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public static uint NextRuntimeSerialNumber { get; }
Public Shared ReadOnly Property NextRuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace