RhinoCommon API
DynamicObjectTransform.Transform Property
 Transform for the DynamicObject
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public Transform Transform { get; }
Public ReadOnly Property Transform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
DynamicObjectTransform Class
Rhino.Render.ChangeQueue Namespace