RhinoCommon API
TwoColorRenderTexture Properties
The TwoColorRenderTexture type exposes the following members.
Properties
Name | Description
Color1
Color2
SuperSample
SwapColors
Texture1Amount
Texture1On
Texture2Amount
Texture2On
Top
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace