RhinoCommon API
KeyboardShortcut Properties
The KeyboardShortcut type exposes the following members.
Properties
Name | Description
Key
Key used for shortcut
Macro
Macro to execute when key plus modifier are pressed
Modifier
Modifier key used for shortcut
Top
See Also
Reference
KeyboardShortcut Class
Rhino.ApplicationSettings Namespace