RhinoCommon API
FileObjReadOptions Properties
The FileObjReadOptions type exposes the following members.
Properties
Name | Description
DisplayColorFromObjMaterial
 Determines whether textures are read from the .mtl file, if it exists.
IgnoreTextures
 Determines whether textures are read from the .mtl file, if it exists.
MapYtoZ
 Setting to transform OBJ's Y axis to Rhino's Z axis
MorphTargetOnly
 TODO
ReverseGroupOrder
 Determines how groups/layers are nested when reading an obj file. Left to Right (default = false) or Right to Left (true)
Split32BitTextures
UseObjGroupsAs
UseObjObjectsAs
Top
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace