RhinoCommon API
FileUdoWriteOptions Properties
The FileUdoWriteOptions type exposes the following members.
Properties
Name | Description
MeshingParameters
Top
See Also
Reference
FileUdoWriteOptions Class
Rhino.FileIO Namespace