RhinoCommon API
RhinoAfterTransformObjectsEventArgs Properties
The RhinoAfterTransformObjectsEventArgs type exposes the following members.
Properties
Name | Description
TransformEventId
 The transformation event id.
Top
See Also
Reference
RhinoAfterTransformObjectsEventArgs Class
Rhino.DocObjects Namespace