RhinoCommon API
SurfaceDirectionIndicators Properties
The SurfaceDirectionIndicators type exposes the following members.
Properties
Name | Description
IsValid
 Returns true if this instance is valid. The geometry that was used to create may not have been garbage collected.
Top
See Also
Reference
SurfaceDirectionIndicators Class
Rhino.Geometry Namespace