RhinoCommon API
MeshCageMorph Properties
The MeshCageMorph type exposes the following members.
Properties
Name | Description
IsValid
Returns true if the space morph definition is valid, false otherwise.
Top
See Also
Reference
MeshCageMorph Class
Rhino.Geometry.Morphs Namespace