RhinoCommon API
HudMaxPassesChangedEventArgs Properties
The RealtimeDisplayMode.HudMaxPassesChangedEventArgs type exposes the following members.
Properties
Name | Description
MaxPasses
Top
See Also
Reference
RealtimeDisplayMode.HudMaxPassesChangedEventArgs Class
Rhino.Render Namespace