RhinoCommon API
Triangle3d Properties
The Triangle3d type exposes the following members.
Properties
Name | Description
A
 Gets the first triangle corner.
AB
 Gets the triangle edge connecting the A and B corners.
AltitudeA
 Gets the altitude line starting at corner A.
AltitudeB
 Gets the altitude line starting at corner B.
AltitudeC
 Gets the altitude line starting at corner C.
AngleA
 Gets the angle at the A corner.
AngleB
 Gets the angle at the B corner.
AngleC
 Gets the angle at the C corner.
Area
 Gets the area inside this triangle.
AreaCenter
 Gets the triangle area centroid.
B
 Gets the second triangle corner.
BC
 Gets the triangle edge connecting the B and C corners.
BoundingBox
 Gets the bounding box of this triangle.
C
 Gets the third triangle corner.
CA
 Gets the triangle edge connecting the C and A corners.
Circumcenter
 Gets the triangle circumcenter.
Circumcircle
 Gets the circumcircle of this triangle.
MedianA
 Gets the median line starting at corner A.
MedianB
 Gets the median line starting at corner B.
MedianC
 Gets the median line starting at corner C.
Orthocenter
 Gets the triangle orthocenter.
Perimeter
 Gets the perimeter of this triangle. This is the sum of the lengths of all edges.
PerpendicularAB
 Gets the perpendicular bisector for edge AB.
PerpendicularBC
 Gets the perpendicular bisector for edge BC.
PerpendicularCA
 Gets the perpendicular bisector for edge CA.
Top
See Also
Reference
Triangle3d Structure
Rhino.Geometry Namespace