RhinoCommon API
RealtimeDisplayModeClassInfo Properties
The RealtimeDisplayModeClassInfo type exposes the following members.
Properties
Name | Description
DontRegisterAttributesOnStart
 Override and return true when you don't want your class info to cause display attributes to be registered with the system.
DrawOpenGl
 Return true if the RealtimeDisplayMode draws its result using OpenGL. RenderWindow usage will then be skipped.
GUID
 Get the RealtimeDisplayMode implementation GUID
Name
 Get human-facing class description for RealtimeDisplayMode implementation. This string might show up in the Rhino UI.
RealtimeDisplayModeType
 Get the type being registered.
RequiredDisplayTechnology
 Override to return the display techonology your DisplayMode requires for the viewport to be running in.
Top
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace