RhinoCommon API
LengthMassProperties Properties
The LengthMassProperties type exposes the following members.
Properties
Name | Description
Centroid
 Gets the length centroid in the world coordinate system.
CentroidCoordinatesMomentsOfInertia
 Moments of inertia with respect to centroid coordinate system. X = integral of ((y-y0)^2 + (z-z0)^2) dm Y = integral of ((z-z0)^2 + (x-x0)^2) dm Z = integral of ((z-z0)^2 + (y-y0)^2) dm where (x0,y0,z0) = centroid.
CentroidCoordinatesMomentsOfInertiaError
 Uncertainty in centroid coordinates moments of inertia calculation.
CentroidCoordinatesProductMoments
 Product moments with respect to centroid coordinate system.
CentroidCoordinatesProductMomentsError
 Uncertainty in product moments with respect to centroid coordinate system.
CentroidCoordinatesRadiiOfGyration
 Radii of gyration with respect to centroid coordinate system. X = sqrt(integral of ((y-y0)^2 + (z-z0)^2) dm/M) Y = sqrt(integral of ((z-z0)^2 + (x-x0)^2) dm/M) Z = sqrt(integral of ((z-z0)^2 + (y-y0)^2) dm/M) where (x0,y0,z0) = centroid.
CentroidCoordinatesSecondMoments
 Second moments with respect to centroid coordinate system. X = integral of (x-x0)^2 dm Y = integral of (y-y0)^2 dm Z = integral of (z-z0)^2 dm where (x0,y0,z0) = centroid.
CentroidCoordinatesSecondMomentsError
 Uncertainty in centroid coordinates second moments calculation.
CentroidError
 Gets the uncertainty in the centroid calculation.
Length
 Gets the length solution.
LengthError
 Gets the uncertainty in the length calculation.
WorldCoordinatesFirstMoments
 Returns the world coordinate first moments if they were able to be calculated. X is integral of "x dm" over the length Y is integral of "y dm" over the length Z is integral of "z dm" over the length.
WorldCoordinatesFirstMomentsError
 Uncertainty in world coordinates first moments calculation.
WorldCoordinatesMomentsOfInertia
 The moments of inertia about the world coordinate axes. X = integral of (y^2 + z^2) dm Y = integral of (z^2 + x^2) dm Z = integral of (z^2 + y^2) dm.
WorldCoordinatesMomentsOfInertiaError
 Uncertainty in world coordinates moments of inertia calculation.
WorldCoordinatesProductMoments
 Returns the world coordinate product moments if they were able to be calculated. X is integral of "xy dm" over the length Y is integral of "yz dm" over the length Z is integral of "zx dm" over the length.
WorldCoordinatesProductMomentsError
 Uncertainty in world coordinates second moments calculation.
WorldCoordinatesRadiiOfGyration
 Radii of gyration with respect to world coordinate system. X = sqrt(integral of (y^2 + z^2) dm/M) Y = sqrt(integral of (z^2 + x^2) dm/M) Z = sqrt(integral of (z^2 + y^2) dm/M)
WorldCoordinatesSecondMoments
 Returns the world coordinate second moments if they were able to be calculated. X is integral of "xx dm" over the length Y is integral of "yy dm" over the length Z is integral of "zz dm" over the length.
WorldCoordinatesSecondMomentsError
 Uncertainty in world coordinates second moments calculation.
Top
See Also
Reference
LengthMassProperties Class
Rhino.Geometry Namespace