RhinoCommon API
FileSettingsState Properties
The FileSettingsState type exposes the following members.
Properties
Name | Description
AutoSaveEnabled
Enables or disables Rhino's automatic file saving mechanism.
AutoSaveInterval
How often the document will be saved when Rhino's automatic file saving mechanism is enabled.
AutoSaveMeshes
Saves render and display meshes in autosave file.
ClipboardCopyToPreviousRhinoVersion
 Gets or sets a value that decides if copies to the clipboard are performed in both the current and previous Rhino clipboard formats. This means you will double the size of what is saved in the clipboard but will be able to copy from the current to the previous version using the clipboard.
ClipboardOnExit
 Gets or sets a value that determines what to do with clipboard data on exit.
CreateBackupFiles
 Gets or sets a value indicating whether to create backup files.
FileLockingEnabled
Ensures that only one person at a time can have a file open for saving.
FileLockingOpenWarning
Displays an information dialog which identifies computer file is open on.
PrefillExportFileName
 Gets or sets a value indicating whether the Export command fills in the file name.
SaveViewChanges
true for users who consider view changes a document change.
TemplateFileDir
 Gets or sets the directory used for template files.
Top
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace