RhinoCommon API
Point3d Properties
The Point3d type exposes the following members.
Properties
Name | Description
IsValid
 Each coordinate of the point must pass the IsValidDouble(Double) test.
Item
 Gets or sets an indexed coordinate of this point.
MaximumCoordinate
 Gets the largest (both positive and negative) valid coordinate in this point, or RhinoMath.UnsetValue if no coordinate is valid, as an absolute value.
MinimumCoordinate
 Gets the smallest (both positive and negative) coordinate value in this point.
Origin
 Gets the value of a point at location 0,0,0.
Unset
 Gets the value of a point at location RhinoMath.UnsetValue,RhinoMath.UnsetValue,RhinoMath.UnsetValue.
X
 Gets or sets the X (first) coordinate of this point.
Y
 Gets or sets the Y (second) coordinate of this point.
Z
 Gets or sets the Z (third) coordinate of this point.
Top
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace