RhinoCommon API
IWindow Properties
The IWindow type exposes the following members.
Properties
Name | Description
Caption
Created
Enabled
Parent
Shown
Window
Top
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace