RhinoCommon API
Line Properties
The Line type exposes the following members.
Properties
Name | Description
BoundingBox
 Gets the line's 3d axis aligned bounding box.
Direction
 Gets the direction of this line segment. The length of the direction vector equals the length of the line segment.
From
 Start point of line segment.
FromX
 Gets or sets the X coordinate of the line From point.
FromY
 Gets or sets the Y coordinate of the line From point.
FromZ
 Gets or sets the Z coordinate of the line From point.
IsValid
 Gets a value indicating whether or not this line is valid. Valid lines must have valid start and end points, and the points must not be equal.
Length
 Gets or sets the length of this line segment. Note that a negative length will invert the line segment without making the actual length negative. The line From point will remain fixed when a new Length is set.
To
 End point of line segment.
ToX
 Gets or sets the X coordinate of the line To point.
ToY
 Gets or sets the Y coordinate of the line To point.
ToZ
 Gets or sets the Z coordinate of the line To point.
UnitTangent
 Gets the tangent of the line segment. Note that tangent vectors are always unit vectors.
Unset
 Gets a line segment which has Unset end points.
Top
See Also
Reference
Line Structure
Rhino.Geometry Namespace