RhinoCommon API
RhinoObjectEventArgs Properties
The RhinoObjectEventArgs type exposes the following members.
Properties
Name | Description
ObjectId
TheObject
Top
See Also
Reference
RhinoObjectEventArgs Class
Rhino.DocObjects Namespace