RhinoCommon API
MeshFace Properties
The MeshFace type exposes the following members.
Properties
Name | Description
A
 Gets or sets the first corner index of the mesh face.
B
 Gets or sets the second corner index of the mesh face.
C
 Gets or sets the third corner index of the mesh face.
D
 Gets or sets the fourth corner index of the mesh face. If D equals C, the mesh face is considered to be a triangle rather than a quad.
IsQuad
 Gets a value indicating whether or not this mesh face is a quad. A mesh face is considered to be a triangle when C does not equal D, thus it is possible for an Invalid mesh face to also be a quad.
IsTriangle
 Gets a value indicating whether or not this mesh face is a triangle. A mesh face is considered to be a triangle when C equals D, thus it is possible for an Invalid mesh face to also be a triangle.
Item
 Gets or sets the vertex index associated with an entry in this face.
Unset
 Gets an Unset MeshFace. Unset faces have Int32.MinValue for all corner indices.
Top
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace