RhinoCommon API
WorksessionModel Properties
The WorksessionModel type exposes the following members.
Properties
Name | Description
Alias
 The alias used to decorate names - layers, materials, and so on - that come from this model.
AttachFailed
 True if the most recent attempt to attach this model failed, which usually means the file is missing.
FileTypeId
 The id of the plug-in used to read the model's file.
IsActiveModel
 True if this is the worksession's active model - the document you are editing - rather than a reference model.
IsAttached
 True if the model's contents are currently attached to the document.
Path
 The full path to the model's file. This is empty for an active model that has never been saved.
SerialNumber
 The reference model's serial number, which identifies this model in calls like Detach(UInt32). Zero means this is the worksession's active model.
 Reference model serial numbers are unique across the application, not just within one document, so a serial number from another document's worksession will simply not be found rather than matching the wrong model.
UpdateAvailable
 True if the file on disk has changed since it was attached, so Update(UInt32) has something to do.
 This is only filled in when the snapshot was taken with the file check enabled. Models enables it; pass false to GetModels(Boolean) to skip it, and this is then always false.
Top
See Also
Reference
WorksessionModel Class
Rhino.DocObjects Namespace