RhinoCommon API
FontQuartet Properties
The FontQuartet type exposes the following members.
Properties
Name | Description
HasBoldFont
HasBoldItalicFont
HasItalicFont
HasRegularFont
QuartetName
Top
See Also
Reference
FontQuartet Class
Rhino.DocObjects Namespace