RhinoCommon API
SimpleArrayClippingPlaneObjectPointer Properties
The SimpleArrayClippingPlaneObjectPointer type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of clipping planes in this array.
Top
See Also
Reference
SimpleArrayClippingPlaneObjectPointer Class
Rhino.Runtime.InteropWrappers Namespace