RhinoCommon API
Vector3dField Properties
The Vector3dField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
Vector3dField Class
Rhino.Render.Fields Namespace