RhinoCommon API
RhinoModifyObjectAttributesEventArgs Properties
The RhinoModifyObjectAttributesEventArgs type exposes the following members.
Properties
Name | Description
Document
DocumentSerialNumber
 The document runtime serial number.
NewAttributes
OldAttributes
RhinoObject
Top
See Also
Reference
RhinoModifyObjectAttributesEventArgs Class
Rhino.DocObjects Namespace