RhinoCommon API
FileSkpReadOptions Properties
The FileSkpReadOptions type exposes the following members.
Properties
Name | Description
AddObjectsToGroups
DisplayColorBy
EmbedTexturesInModel
ImportCurves
ImportFacesAsMeshes
Set to false for trimmed planes.
JoinEdges
JoinFaces
UseGroupLayers
UseSketchUpTextureWriter
Weld
WeldAngle
Top
See Also
Reference
FileSkpReadOptions Class
Rhino.FileIO Namespace