RhinoCommon API
Centermark Properties
The Centermark type exposes the following members.
Properties
Name | Description
Radius
 Gets or sets the center mark's radius.
Top
See Also
Reference
Centermark Class
Rhino.Geometry Namespace