RhinoCommon API
RibbonOffsetParameters Properties
The RibbonOffsetParameters type exposes the following members.
Properties
Name | Description
AlignCrossSections
 When false: cross section slashes between input and output curve are located at the ends of ruled spans. When true: cross section slashes between input and output curve are located at the mid points of ruled spans and blends.
BlendRadius
 Positive, typically the same as distance. When the offset results in a self-intersection that gets trimmed off at a kink, the kink will be blended out using this radius.
OffsetDistance
 Offset curve distance from input curve.
OffsetLocation
 Inside or Outside point location
OffsetPlaneVector3d
 A vector that indicates the normal of the plane in which the offset will occur. This vector is typically similar to a logical extrude direction for the closed input curve.
OffsetTolerance
 Used to determine self-intersections of offset curve, not offset error.
RebuildPointCount
 Rebuild offset curve with defined number of control points 0 for disabled
RefitTolerance
 Refit the offset curve to a specified tolerance 0 for disabled
RibbonSurfaceGenerationMethod
 0 - no surfaces will be created, curves only 1 - Simple Sweep 2 2 - Sweep 2 mixed with NetworkSrf corners
Top
See Also
Reference
RibbonOffsetParameters Class
Rhino.Geometry Namespace