RhinoCommon API
ColorHSL Properties
The ColorHSL type exposes the following members.
Properties
Name | Description
A
 Gets or sets the alpha channel value. Alpha channels are limited to a 0~1 range.
H
 Gets or sets the hue channel value. Hue channels rotate between 0.0 and 1.0.
L
 Gets or sets the luminance channel value. Luminance channels are limited to a 0~1 range.
S
 Gets or sets the saturation channel value. Saturation channels are limited to a 0~1 range.
Top
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace