RhinoCommon API
AncestryRecord Properties
The MeshInstance.AncestryRecord type exposes the following members.
Properties
Name | Description
DefinitionId
 The ModelObjectId of the InstanceDefinition
ReferenceAttributes
 The object attributes from the InstanceObject
ReferenceId
 The ModelObjectId of the InstanceObject
Transform
 The transform from the InstanceObject
Top
See Also
Reference
MeshInstance.AncestryRecord Class
Rhino.Render.ChangeQueue Namespace