RhinoCommon API
SceneObject Properties
The CreatePreviewEventArgs.SceneObject type exposes the following members.
Properties
Name | Description
Material
Mesh
Top
See Also
Reference
CreatePreviewEventArgs.SceneObject Class
Rhino.Render Namespace