RhinoCommon API
PostEffectUuids Properties
The PostEffectUuids type exposes the following members.
Properties
Name | Description
Bloom
BriCon
DepthOfField
Dithering
Fog
Gamma
GaussianBlur
Glare
Glow
HueSatLum
Multiplier
Noise
ToneMapper_BlackWhitePoint
ToneMapper_Clamp
ToneMapper_FalseColor
ToneMapper_Filmic
ToneMapper_Logarithmic
Watermark
WireframeAnnotationsRGBA
WireframeCurvesRGBA
WireframeIsocurvesRGBA
WireframePointsRGBA
Top
See Also
Reference
PostEffectUuids Class
Rhino.Render.PostEffects Namespace