RhinoCommon API
File3dmNamedConstructionPlanes Properties
The File3dmNamedConstructionPlanes type exposes the following members.
Properties
Name | Description
Count
 Number of named construction planes in the table.
Item
 Gets the named construction plane at an index.
Top
See Also
Reference
File3dmNamedConstructionPlanes Class
Rhino.FileIO Namespace