RhinoCommon API
NurbsSurface Properties
The NurbsSurface type exposes the following members.
Properties
Name | Description
IsRational
 Gets a value indicating whether or not the NURBS surface is rational.
KnotsU
 The U direction knot vector.
KnotsV
 The V direction knot vector.
OrderU
 Gets the order in the U direction.
OrderV
 Gets the order in the V direction.
Points
 Gets a collection of surface control points that form this surface.
Top
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace