RhinoCommon API
FilePdf Properties
The FilePdf type exposes the following members.
Properties
Name | Description
LayersAsOptionalContentGroups
 Add layers as "optional content groups" to the PDF. This is the visible layer tree available in PDF viewers
Top
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace