RhinoCommon API
Transform Properties
The Transform type exposes the following members.
Properties
Name | Description
Determinant
 The determinant of this 4x4 matrix.
Identity
 Gets a new identity transform matrix. An identity matrix defines no transformation.
IsAffine
 Tests for an affine transformation. A transformation is affine if it is valid and its last row is [0, 0, 0, 1]. An affine transformation can be broken into a linear transformation and a translation.
IsIdentity
Return true if this Transform is the identity transform
IsLinear
 Tests for a linear transformation. A transformation is affine if it is valid and its last row is [0, 0, 0, 1]. If in addition its last column is ( 0, 0, 0, 1)^T then it is linear. An affine transformation can be broken into a linear transformation and a translation.
IsRotation
 Returns true if this is a proper rotation.
IsValid
 Gets a value indicating whether or not this Transform is a valid matrix. A valid transform matrix is not allowed to have any invalid numbers.
IsZero
 True if matrix is Zero4x4, ZeroTransformation, or some other type of zero. The value xform[3][3] can be anything.
IsZero4x4
 True if all values are 0
IsZeroTransformation
 True if all values are 0, except for M33 which is 1.
Item
 Gets or sets the matrix value at the given row and column indices.
M00
Gets or sets this[0,0].
M01
Gets or sets this[0,1].
M02
Gets or sets this[0,2].
M03
Gets or sets this[0,3].
M10
Gets or sets this[1,0].
M11
Gets or sets this[1,1].
M12
Gets or sets this[1,2].
M13
Gets or sets this[1,3].
M20
Gets or sets this[2,0].
M21
Gets or sets this[2,1].
M22
Gets or sets this[2,2].
M23
Gets or sets this[2,3].
M30
Gets or sets this[3,0].
M31
Gets or sets this[3,1].
M32
Gets or sets this[3,2].
M33
Gets or sets this[3,3].
RigidType
 Gets a value indicating whether or not the Transform is rigid. A rigid transformation can be broken into a proper rotation and a translation, while an isometry transformation could also include a reflection.
SimilarityType
 Gets a value indicating whether or not the Transform maintains similarity. The easiest way to think of Similarity is that any circle, when transformed, remains a circle. Whereas a non-similarity Transform deforms circles into ellipses.
Unset
 Gets an XForm filled with RhinoMath.UnsetValue.
ZeroTransformation
 ZeroTransformation diagonal = (0,0,0,1)
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace