RhinoCommon API
File3dsWriteOptions Properties
The File3dsWriteOptions type exposes the following members.
Properties
Name | Description
MeshingParameters
SaveLights
SaveViews
Top
See Also
Reference
File3dsWriteOptions Class
Rhino.FileIO Namespace