RhinoCommon API
BrepEdge Properties
The BrepEdge type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this edge.
EdgeCurve
 Get the brep.Curves3D[] 3d curve geometry used by this edge or null.
EdgeCurveIndex
 Get the brep.Curves3D[] index of the 3d curve geometry used by this edge or -1.
EdgeIndex
 Gets the index of this edge in the Brep.Edges collection.
EndVertex
 BrepVertex at end of edge
ProxyBrepSubDEdgeId
 If this edge is part of a brep created by SubD.ProxyBrep(), then the subd component id of the corresponding SubD edge is returned. Otherwise 0 is returned.
StartVertex
 BrepVertex at start of edge
Tolerance
 Gets or sets the accuracy of the edge curve (>=0.0 or RhinoMath.UnsetValue) A value of UnsetValue indicates that the tolerance should be computed. The maximum distance from the edge's 3d curve to any surface of a face that has this edge as a portion of its boundary must be <= this tolerance.
TrimCount
 Gets the number of trim-curves that use this edge.
Valence
 Gets the topological valency of this edge. The topological valency is defined by how many adjacent faces share this edge.
Top
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace