RhinoCommon API
Vector3d Properties
The Vector3d type exposes the following members.
Properties
Name | Description
IsUnitVector
 Gets a value indicating whether or not this is a unit vector. A unit vector has length 1.
IsValid
 Gets a value indicating whether this vector is valid. A valid vector must be formed of valid component values for x, y and z.
IsZero
 Gets a value indicating whether the X, Y, and Z values are all equal to 0.0.
Item
 Gets or sets a vector component at the given index.
Length
 Computes the length (or magnitude, or size) of this vector. This is an application of Pythagoras' theorem. If this vector is invalid, its length is considered 0.
MaximumCoordinate
 Gets the largest (both positive and negative) component value in this vector, as an absolute value.
MinimumCoordinate
 Gets the smallest (both positive and negative) component value in this vector.
SquareLength
 Computes the squared length (or magnitude, or size) of this vector. This is an application of Pythagoras' theorem. While the Length property checks for input validity, this property does not. You should check validity in advance, if this vector can be invalid.
Unset
 Gets the value of the vector with each component set to RhinoMath.UnsetValue.
X
 Gets or sets the X (first) component of the vector.
XAxis
 Gets the value of the vector with components 1,0,0.
Y
 Gets or sets the Y (second) component of the vector.
YAxis
 Gets the value of the vector with components 0,1,0.
Z
 Gets or sets the Z (third) component of the vector.
ZAxis
 Gets the value of the vector with components 0,0,1.
Zero
 Gets the value of the vector with components 0,0,0.
Top
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace