RhinoCommon API
ViewUserInterfaceTable Properties
The ViewUserInterfaceTable type exposes the following members.
Properties
Name | Description
Document
Document that owns this object table.
Top
See Also
Reference
ViewUserInterfaceTable Class
Rhino.DocObjects.Tables Namespace