RhinoCommon API
TwistSpaceMorph Properties
The TwistSpaceMorph type exposes the following members.
Properties
Name | Description
InfiniteTwist
 If true, the deformation is constant throughout the object, even if the axis is shorter than the object. If false, the deformation takes place only the length of the axis.
TwistAngleRadians
 Twist angle in radians.
TwistAxis
Axis to rotate about.
Top
See Also
Reference
TwistSpaceMorph Class
Rhino.Geometry.Morphs Namespace