RhinoCommon API
FileAiReadOptions Properties
The FileAiReadOptions type exposes the following members.
Properties
Name | Description
AiScale
AiUnits
PreserveModelScale
RhinoScale
Top
See Also
Reference
FileAiReadOptions Class
Rhino.FileIO Namespace