RhinoCommon API
RhinoApp Properties
The RhinoApp type exposes the following members.
Properties
Name | Description
BuildDate
 Gets the build date.
CanSave
 Returns true when Rhino is allowed to save, false otherwise Conditions where Rhino is not allowed to save are: when evaluation licenses are expired; when a Cloud Zoo lease is expired; when a license is shared by a single user on multiple computers, and the current computer is not active.
CheckNewObject
 Returns true if Rhino will validate each object added to the document. This can be time consuming but is valuable for debugging.
CommandHistoryWindowText
 Text in Rhino's command history window.
CommandLineOut
 Provides a TextWriter that can write to the command line.
CommandPrompt
Rhino command prompt.
CommandWindowCaptureEnabled
 Enable or disable capturing of the strings sent to the CommandWindow through Write and WriteLine calls
CurrentRhinoId
Gets the current ID of Rhino.
DaysUntilExpiration
 Returns number of days until license expires. Zero when license is expired. Raises InvalidLicenseTypeException if LicenseExpires would return false.
DefaultUiFont
 Default font used to render user interface
ExeServiceRelease
 Service release version of Rhino executable (0, 1, 2, ...) The integer is the service release number of Rhino. For example, this function returns "0" if Rhino V4SR0 is running and returns "1" if Rhino V4SR1 is running.
ExeVersion
 Major version of Rhino executable 4, 5, ...
InCommand
 Gets the nested command count.
InstallationType
Gets the product installation type, as seen in Rhino's ABOUT dialog box.
InstallationTypeString
Gets the type of installation (product edition) of the license or lease.
InvokeRequired
 Returns true if we are currently not running on the main user interface thread
IsClosing
 Returns true if Rhino is in the process of closing, false otherwise. This can be true even before the Closing event fires, such as when RhinoDoc.CloseDocument event is called.
IsCloudZooNode
 Returns true if rhino is currently using the Cloud Zoo false otherwise
IsEvaluation
 Returns true if Rhino is licensed as an Evaluation product false otherwise
IsExiting
 Returns true if Rhino is in the process of exiting, false otherwise. This can be true even before the Closing event fires, such as when RhinoDoc.CloseDocument event is called.
IsInternetAccessAllowed
 Returns true when Rhino is allowed to access the Internet, false otherwise. Note, this does not test if Internet access is available.
IsLicenseValidated
 Returns true if the license is validated false otherwise
IsOnMainThread
 Is the current thread the main thread
IsParentDesktop
 Returns true if Rhino's parent window is the desktop, false otherwise.
IsPreRelease
 Returns true if Rhino is compiled as pre-release build (Beta, WIP) false otherwise
IsRunningAutomated
Is Rhino currently being executed through automation
IsRunningBatchMode
 Is Rhino currently being executed as a batch run, either started with the /batchmode command line switch or put into batch mode since by the BatchMode command. A batch run has a main window but no user: commands take their input from the command line rather than showing dialogs, and modal message boxes are written to the command line instead of being shown.
IsRunningHeadless
Is Rhino currently being executed in headless mode
IsRunningUnattended
 Is Rhino running with no user available to answer a question. True when either IsRunningHeadless or IsRunningBatchMode is true.
IsSafeModeEnabled
Is Rhino being executed in safe mode
IsSkinned
 Is Rhino currently using custom, user-interface Skin.
LicenseExpires
 Returns true if the license will expire false otherwise
LicenseUserName
Gets the name of the user that owns the license or lease.
LicenseUserOrganization
Gets the name of the organization of the user that owns the license or lease.
LoggedInUserAvatar
 Returns the logged in user's avatar picture. Returns a default avatar if the user does not have an avatar or if the avatar could not be fetched.
LoggedInUserName
 Returns the name of the logged in user, or null if the user is not logged in.
Name
Gets the application name.
NodeType
Gets license the node type.
Rhino2Id
Gets the ID of Rhino 2.
Rhino3Id
Gets the ID of Rhino 3.
Rhino4Id
Gets the ID of Rhino 4.
Rhino5Id
Gets the ID of Rhino 5
Rhino6Id
Gets the ID of Rhino 6
Rhino7Id
Gets the ID of Rhino 7
SchemeName
 Gets the current Registry scheme name.
SdkServiceRelease
 Rhino SDK 9 digit SDK service release number in the form YYYYMMDDn Service release of the Rhino SDK supported by this executable. Rhino will only load plug-ins that require a service release of <= this release number. For example, SR1 will load all plug-ins made with any SDK released up through and including the SR1 SDK. But, SR1 will not load a plug-in built using the SR2 SDK. If an "old" Rhino tries to load a "new" plug-in, the user is told that they have to get a free Rhino.exe update in order for the plug-in to load. Rhino.exe updates are available from http://www.rhino3d.com.
SdkVersion
 Rhino SDK 9 digit SDK version number in the form YYYYMMDDn Rhino will only load plug-ins that were build with exactly the same version of the SDK.
SendWriteToConsole
 Enable or disable sending command window strings to the console RhinoApp.Write(...) calls would be sent to the console when this is enabled
SerialNumber
Gets the product serial number, as seen in Rhino's ABOUT dialog box.
ToolbarFiles
 Collection of currently open toolbar files in the application
UpdatesAndStatisticsStatus
 Returns true when Rhino is allowed to access the Internet, false otherwise. Note, this does not test if Internet access is available.
UserIsLoggedIn
 Returns true if the user is logged in; else returns false. A logged in user does not guarantee that the auth tokens managed by the CloudZooManager instance are valid.
ValidationGracePeriodDaysLeft
 Returns number of days within which validation must occur. Zero when validation grace period has expired. Raises InvalidLicenseTypeException if LicenseType is one of: EvaluationSaveLimited EvaluationTimeLimited Viewer Unknown
Version
 File version of the main Rhino process
VersionControlRevision
 McNeel version control revision identifier at the time this version of Rhino was built.
Top
See Also
Reference
RhinoApp Class
Rhino Namespace