RhinoCommon API
PostEffect Properties
The PostEffect type exposes the following members.
Properties
Name | Description
CanDisplayHelp
ExecuteWhileRenderingOption
Id
IsSelected
 Return true if the post effect is selected.
LocalName
On
PostEffectType
RequiredChannels
 The RDK calls this method to determine which channels a post effect requires. If a required channel is not available, the RDK will hide the post effect's UI and display explanatory text instead. Note: As a convenience, the default implementation adds IRhRdkRenderWindow::chanRGBA to the output array. Most post effects should be able to use this default with no need to override the method.
SerialNumber
Shown
Styles
Top
See Also
Reference
PostEffect Class
Rhino.Render.PostEffects Namespace