RhinoCommon API
SimulatedTexture Properties
The SimulatedTexture type exposes the following members.
Properties
Name | Description
BitmapSize
Filename
Filtered
HasTransparentColor
LocalMappingTransform
MappingChannel
Offset
OriginalFilename
ProjectionMode
Repeat
Repeating
Rotation
TransparentColor
TransparentColorSensitivity
Top
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace