RhinoCommon API
ComponentStatus Properties
The ComponentStatus type exposes the following members.
Properties
Name | Description
AllSet
 All flags are checked.
Clear
 This is the default value and equal to undefined.
Damaged
 The damaged flag is checked.
Hidden
 The hidden flag is checked.
Highlighted
 The highlight selection flag is checked.
IsClear
 True if every setting is 0 or false.
IsDamaged
 Returns false if component is not damaged. True otherwise.
IsHidden
 Returns true if hidden. False otherwise.
IsHighlighted
 Returns true if highlighted. False otherwise.
IsLocked
 Returns true if locked. False otherwise.
IsSelected
 Returns true if selected or selected persistent. False otherwise.
IsSelectedPersistent
 Returns true if selected persistent. False otherwise.
Locked
 The locked flag is checked.
Selected
 The selection flag is checked.
SelectedPersistent
 The persistent selection flag is checked.
Top
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace