RhinoCommon API
StringParserSettings Properties
The StringParserSettings type exposes the following members.
Properties
Name | Description
DefaultAngleUnitSystem
DefaultLengthUnitSystem
DefaultParseSettings
 - The default settings parse just about everything in a reasonable way. - Any angle values with unspecified units will be treated as radians. Angles without units can be encountered while parsing formulas, lengths and points and need to be thoughtfully considered in most parsing situations.
ParseAddition
ParseArcDegreesMinutesSeconds
ParseArithmeticExpression
ParseCommaAsDecimalPoint
ParseCommaAsDigitSeparator
ParseDAsExponentInScientificENotation
ParseDivision
ParseExplicitFormulaExpression
ParseFeetInches
ParseFullStopAsDecimalPoint
ParseFullStopAsDigitSeparator
ParseHyphenAsNumberDash
ParseHyphenMinusAsNumberDash
ParseIntegerDashFraction
ParseLeadingWhiteSpace
ParseMathFunctions
ParseMultiplication
ParsePairedParentheses
ParsePi
ParseRationalNumber
ParseScientificENotation
ParseSettingsDegrees
 - The default settings parse just about everything in a reasonable way. - Any angle values with unspecified units will be treated as degrees.Angles without units can be encountered while parsing formulas, lengths and points and need to be thoughtfully considered in most parsing situations.
ParseSettingsDoubleNumber
 - The double number settings parse and optional unary + or unary - and then parse a number that can be integer, decimal, or scientific e notation.
ParseSettingsEmpty
 - ON_ParseSetting::FalseSettings has all parsing options set to false. - A common use of ON_ParseSettings FalseSettings is to initialize ON_ParseSettings classes that are used to report what happened during parsing.Any parsing results value set to true after parsing indicates that type of parsing occurred.
ParseSettingsIntegerNumber
 - The integer settings parse and optional unary + or unary - and then parses one or more digits.Parsing stops after the last digit.
ParseSettingsRadians
 - The default settings parse just about everything in a reasonable way. - Any angle values with unspecified units will be treated as radians.Angles without units can be encountered while parsing formulas, lengths and points and need to be thoughtfully considered in most parsing situations.
ParseSettingsRationalNumber
 - The rational number settings parse and optional unary + or unary - and then parse one or more digits.If a rational number fraction bar follows the last digit in the numerator, then it is parsed and an integer denominator is parsed.The denominator cannot have a unary + or - preceding the digits.Parsing stops after the last digit in the denominator.
ParseSettingsRealNumber
 - The real number settings parse and optional unary + or unary - and then parse a number that can be integer, decimal, scientific e notation or pi.
ParseSignificandDigitSeparators
ParseSignificandFractionalPart
ParseSignificandIntegerPart
ParseSpaceAsDigitSeparator
ParseSubtraction
ParseSurveyorsNotation
ParseUnaryMinus
ParseUnaryPlus
PreferedLocaleId
Top
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace