RhinoCommon API
SimpleArrayArrayPoint3d Properties
The SimpleArrayArrayPoint3d type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of polylines in this array.
Item
 Gets a point in a polyline.
Top
See Also
Reference
SimpleArrayArrayPoint3d Class
Rhino.Runtime.InteropWrappers Namespace