RhinoCommon API
SimpleArray2dex Properties
The SimpleArray2dex type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of elements in this array.
Top
See Also
Reference
SimpleArray2dex Class
Rhino.Runtime.InteropWrappers Namespace