RhinoCommon API
BrepSurfaceList Properties
The BrepSurfaceList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of surfaces in a brep.
Item
 Gets the Surface at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
BrepSurfaceList Class
Rhino.Geometry.Collections Namespace