RhinoCommon API
NurbsSurfaceKnotList Properties
The NurbsSurfaceKnotList type exposes the following members.
Properties
Name | Description
ClampedAtEnd
Determines if a knot vector is clamped.
ClampedAtStart
Determines if a knot vector is clamped.
Count
Gets the total number of knots in this curve.
Item
 Gets or sets the knot vector value at the given index.
KnotStyle
 Gets the style of the knot vector.
Top
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace