RhinoCommon API
Dimension Properties
The Dimension type exposes the following members.
Properties
Name | Description
AlternateBelowLine
AltLengthFactor
AltLengthResolution
AltLengthRoundoff
AltPrefix
AltSuffix
AltToleranceResolution
AltUnitsDisplay
AltZeroSuppression
ArrowBlockId1
ArrowBlockId2
ArrowFit
ArrowheadType1
ArrowheadType2
ArrowSize
BaselineSpacing
CentermarkSize
CentermarkStyle
DetailMeasured
DimensionLineExtension
DistanceScale
ExtensionLineExtension
ExtensionLineOffset
FixedExtensionLength
FixedLengthExtensionOn
ForceArrowPosition |  Obsolete.
ForceDimensionLineBetweenExtensionLines
ForceDimLine
ForceTextPosition |  Obsolete.
LengthFactor
LengthResolution
LengthRoundoff
NumericValue
 Gets the numeric value (or measurement), depending on geometry type.
LinearDimension: distance between arrow tips
RadialDimension: radius or diameter depending on type
AngularDimension: angle in radians
PlainUserText
Prefix
Suffix
SuppressDimensionLine1
 Suppresses the dimension line and arrowhead between the first extension line and the dimension text.
SuppressDimensionLine2
 Suppresses the dimension line and arrowhead between the second extension line and the dimension text.
SuppressExtension1
SuppressExtension2
TextAngleType
TextFit
TextFormula
TextLocation
TextOrientation
TextPosition
 Gets and sets the position of text on the plane.
TextRotation
ToleranceFormat
ToleranceHeightScale
ToleranceLowerValue
ToleranceResolution
ToleranceUpperValue
UseDefaultTextPoint
ZeroSuppression
Top
See Also
Reference
Dimension Class
Rhino.Geometry Namespace