RhinoCommon API
IOAuth2Token Properties
The IOAuth2Token type exposes the following members.
Properties
Name | Description
Exp
 The expiration of the token. Expired tokens will be considered invalid by the Rhino Accounts server.
IsExpired
 true if the token is expired; false otherwise.
RawToken
 The raw token that can be passed to various servers for authorization.
Scope
 The scope of the token.
Top
See Also
Reference
IOAuth2Token Interface
Rhino.Runtime.RhinoAccounts Namespace