RhinoCommon API
GetCurve Properties
The GetCurve type exposes the following members.
Properties
Name | Description
Degree
 Degree of the resulting curve. Default is 3. Setting any value other than 3 clears SubDFriendly.
EndTangent
 End tangent of an interpolated curve. Only used when UseEndTangent is true.
FirstPointPrompt
Prompt used when getting the first point. The default is the localized "Start of curve".
KnotSpacing
 Knot spacing used when interpolating. Default is Chord. Only Uniform, Chord and ChordSquareRoot are accepted. Closing the curve selects the periodic form of the value set here, so passing a periodic value would take the knot style out of range. Ignored when SubDFriendly is true.
Points
 The points picked during the most recent call to GetControlPointCurve or GetInterpolatedCurve. Empty before the first call. When the curve was closed, the first point is repeated at the end.
SecondPointPrompt
Prompt used when getting the second point. The default is the localized "Next point".
Sharp
 When true, closing the curve produces a sharp corner at the seam instead of a periodic curve. Default is false.
StartTangent
 Start tangent of an interpolated curve. Only used when UseStartTangent is true.
SubDFriendly
 When true, the result is a cubic, uniform, non-rational curve that is either periodic or has zero second derivatives at both ends. Default is false. Setting this to true sets Degree to 3, because a SubD friendly curve is always cubic. While this is true, KnotSpacing, StartTangent and EndTangent are ignored.
ThirdPointPrompt
Prompt used when getting the third and following points. The default is the localized "Next point. Press Enter when done".
UseActiveLayerLinetype
 When true, the linetype of the active layer is used for the dynamic drawing. Default is false.
UseEndTangent
 When true, an interpolated curve ends tangent to EndTangent. Default is false. Ignored on a closed curve unless Sharp is true, and ignored while SubDFriendly is true. The getter offers its EndTangent option to the user only at degree 3 with SubDFriendly off; a tangent set here still applies at any degree.
UseStartTangent
 When true, an interpolated curve starts tangent to StartTangent. Default is false. Ignored on a closed curve unless Sharp is true, and ignored while SubDFriendly is true. The getter offers its StartTangent option to the user only at degree 3 with SubDFriendly off; a tangent set here still applies at any degree.
Top
See Also
Reference
GetCurve Class
Rhino.Input.Custom Namespace