RhinoCommon API
UserStringChangedArgs Properties
The RhinoDoc.UserStringChangedArgs type exposes the following members.
Properties
Name | Description
Document
 Document containing the user string
Key
 Key for the string being changed
Top
See Also
Reference
RhinoDoc.UserStringChangedArgs Class
Rhino Namespace