RhinoCommon API
Sphere Properties
The Sphere type exposes the following members.
Properties
Name | Description
BoundingBox
 Gets the world aligned bounding box for this Sphere. If the Sphere is Invalid, an empty box is returned.
Center
 Gets or sets the center point of the sphere.
Diameter
 Gets or sets the diameter for this sphere.
EquatorialPlane
 Gets or sets the Equatorial plane for this sphere.
IsValid
 Gets a value that indicates whether the sphere is valid.
NorthPole
 Gets the point at the North Pole of the sphere.
This is the parameterization singularity that can be obtained, at V value +Math.Pi/2.
Radius
 Gets or sets the Radius for this sphere.
SouthPole
 Gets the point at the South Pole of the sphere.
This is the parameterization singularity that can be obtained, at V value -Math.Pi/2.
Unset
 Gets a sphere with invalid members.
Top
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace