RhinoCommon API
Point2f Properties
The Point2f type exposes the following members.
Properties
Name | Description
IsValid
 Gets a value indicating whether this point is considered valid.
Item
 Accesses the coordinates of this point.
Unset
 Gets the standard unset point.
X
 Gets or sets the X (first) component of the vector.
Y
 Gets or sets the Y (second) component of the vector.
Top
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace