RhinoCommon API
RhinoObjectAnalysisModeChangedEventArgs Properties
The RhinoObjectAnalysisModeChangedEventArgs type exposes the following members.
Properties
Name | Description
AnalysisMode
 The visual analysis mode.
AnalysisModeId
 The id of the visual analysis mode.
Document
 Gets the Rhino document.
DocumentSerialNumber
 The serial number of the Rhino document.
Enabled
 True if the visual analysis mode was enabled, false otherwise.
ObjectId
 The id of the Rhino object whose visual analysis mode changed.
TheObject
 The Rhino object whose visual analysis mode changed.
Top
See Also
Reference
RhinoObjectAnalysisModeChangedEventArgs Class
Rhino.DocObjects Namespace