RhinoCommon API
SurfaceCurvature Properties
The SurfaceCurvature type exposes the following members.
Properties
Name | Description
Gaussian
 The Gaussian curvature is kappa1*kappa2.
IsNaN
 True if either of kappa1 or kappa2 is NaN.
IsSet
 True if kappa1 and kappa2 are both valid finite values.
IsUnset
 True if either of kappa1 or kappa2 is not a valid finite value.
IsZero
 True if both kappa1 and kappa2 are zero.
MaximumPrincipalCurvature
 If set, the maximum of kapp1 and kappa2 returned. Otherwise, the quiet NaN is returned.
MaximumRadius
 If a principal curvature value is zero or the principal curvatures have opposite signs, then the maximum radius of curvature is infinite RhinoMath.InfiniteRadius is returned. Otherwise the maximum radius of curvature is 1/min(fabs(kappa1),fabs(kappa2)).
Mean
 The mean curvature is (kappa1+kappa2)/2.
MinimumPrincipalCurvature
 If set, the minimum of kappa1 and kappa2 returned. Otherwise, the quiet NaN is returned.
MinimumRadius
 The minimum radius of curvature is 1/max(fabs(kappa1),fabs(kappa2)). Infinite radius values are returned as RhinoMath.InfiniteRadius.
Normal
 Gets the normal direction of the surface at the u,v parameter where the surface curvature was evaluated.
Point
 Gets the point at the u,v parameter where the surface curvature was evaluated.
UVPoint
 Gets the u,v parameter where the surface curvature was evaluated.
Top
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace