RhinoCommon API
MeshPart Properties
The MeshPart type exposes the following members.
Properties
Name | Description
EndFaceIndex
End of subinterval of parent mesh face array
EndVertexIndex
End of subinterval of parent mesh vertex array
StartFaceIndex
Start of subinterval of parent mesh face array
StartVertexIndex
Start of subinterval of parent mesh vertex array
TriangleCount
VertexCount
EndVertexIndex - StartVertexIndex
Top
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace