RhinoCommon API
BrepVertexList Properties
The BrepVertexList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of brep vertices.
Item
 Gets the BrepVertex at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
BrepVertexList Class
Rhino.Geometry.Collections Namespace