RhinoCommon API
RhinoObjectSelectionEventArgs Properties
The RhinoObjectSelectionEventArgs type exposes the following members.
Properties
Name | Description
Document
RhinoObjectCount
 Can be faster to call than RhinoObjects.Length
RhinoObjects
Selected
 Returns true if objects are being selected. Returns false if objects are being deselected.
Top
See Also
Reference
RhinoObjectSelectionEventArgs Class
Rhino.DocObjects Namespace