RhinoCommon API
RotationGripUserInterfaceObject Properties
The RotationGripUserInterfaceObject type exposes the following members.
Properties
Name | Description
GripPointVisible
 Is the grip point itself drawn
Top
See Also
Reference
RotationGripUserInterfaceObject Class
Rhino.UI Namespace