RhinoCommon API
Point2dField Properties
The Point2dField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
Point2dField Class
Rhino.Render.Fields Namespace