RhinoCommon API
RhinoViewport Properties
The RhinoViewport type exposes the following members.
Properties
Name | Description
Bounds
 Gets the size and location of the viewport, in pixels, relative to the parent view.
Camera35mmLensLength
CameraAngle
 Gets or sets the 1/2 of smallest subtended view angle.
CameraDirection
CameraLocation
CameraTarget
 Viewport target point.
CameraUp
CameraX
Gets the "unit to the right" vector.
CameraY
Gets the "unit up" vector.
CameraZ
Gets the unit vector in CameraDirection.
ChangeCounter
 The value of change counter is incremented every time the view projection or construction plane changes. The user can the mouse and nestable view manipulation commands to change a view at any time. The value of change counter can be used to detect these changes in code that is sensitive to the view projection.
ConstructionAxesVisible
ConstructionGridVisible
DisplayMode
FrustumAspect
Gets the width/height ratio of the frustum.
Id
Unique id for this viewport.
IsParallelProjection
IsPerspectiveProjection
IsPlanView
 true if construction plane z axis is parallel to camera direction.
IsTwoPointPerspectiveProjection
IsValidCamera
IsValidFrustum
LockedProjection
 If true, the camera location, camera direction, and lens angle should not be changed.
Name
Name associated with this viewport.
ParentView
 Gets the parent view, if there is one Every RhinoView has an associated RhinoViewport that does all the 3d display work. Those associated viewports return the RhinoView as their parent view. However, RhinoViewports are used in other image creating contexts that do not have a parent RhinoView. If you call ParentView, you MUST check for NULL return values.
ScreenPortAspect
 screen port's width/height.
Size
 Get or set the height and width of the viewport (in pixels)
UserStringCount
ViewportType
WallpaperFilename
WallpaperGrayscale
WallpaperVisible
WorldAxesVisible
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace