RhinoCommon API
RhinoDoc Properties
The RhinoDoc type exposes the following members.
Properties
Name | Description
ActiveCommandId
 Get the ID of the active command.
ActiveDoc
 WARNING!! Do not use the ActiveDoc if you don't have to. Under Mac Rhino the ActiveDoc can change while a command is running. Use the doc that is passed to you in your RunCommand function or continue to use the same doc after the first call to ActiveDoc.
ActiveSpace
 Get the space associated with the active viewport for this document
AnimationProperties
Bitmaps
 bitmaps used in textures, backgrounds, wallpapers, ...
CurrentUndoRecordSerialNumber
 >0: undo recording is active and being saved on the undo record with the specified serial number. 0: undo recording is not active. (Disabled or nothing is being recorded.)
CustomRenderSizes
DateCreated
DateLastEdited
 Returns the date the document was created in Coordinated Universal Time (UTC). Use DateTime.ToLocalTime to convert to local time.
DimStyles
EarthAnchorPoint
Groups
HatchPatterns
InGetPoint
 Returns true if currently in a GetPoint.Get().
InstanceDefinitions
IsAvailable
IsClosing
IsCommandRunning
 Returns true if Rhino is currently running a command.
IsCreating
IsHeadless
IsInitializing
IsLocked
 Check to see if the file associated with this document is locked. If it is locked then this is the only document that will be able to write the file. Other instances of Rhino will fail to write this document.
IsOpening
IsReadOnly
 Current read-only mode for this document. true if the document can be viewed but NOT saved. false if document can be viewed and saved.
IsSendingMail
 true if Rhino is in the process of sending this document as an email attachment.
Layers
 Layers in the document.
LayoutSpaceAnnotationScalingEnabled
 If LayoutSpaceAnnotationScaling is on, sizes in dimstyles are multiplied by dimscale when the annotation is displayed in a detail viewport not in a detail
Lights
Linetypes
 Linetypes in the document.
LinkedInstanceDefinitionUpdate
 Controls if, when, and how linked and linked and embedded instance definitions are updated when the source archive that was used to create the instance definition has changed.
Manifest
MarkupMode
 The markup mode this document is currently in: creating, viewing or editing a markup, or None when not in markup mode. MarkupViewChanged reports changes to this value.
Markups
 Collection of markups in this document
Materials
Materials in the document.
MeshingParameterStyle
 Type of MeshingParameters currently used by the document to mesh objects
ModelAbsoluteTolerance
Model space absolute tolerance.
ModelAngleToleranceDegrees
Model space angle tolerance.
ModelAngleToleranceRadians
Model space angle tolerance.
ModelBasepoint
 The base point in the model that is used when inserting the model into another as a block definition. By default the base point in any model is 0,0,0.
ModelDistanceDisplayMode
Gets/Sets the distance display mode for model space.
ModelDistanceDisplayPrecision
ModelRelativeTolerance
Model space relative tolerance.
ModelSpaceAnnotationScalingEnabled
 If ModelSpaceAnnotationScaling is on, sizes in dimstyles are multiplied by dimscale when the annotation is displayed in a model space viewport not in a detail
ModelSpaceHatchScale
 The scale factor for hatches in model space when Hatch Scaling is enabled
ModelSpaceHatchScalingEnabled
 True if hatch scaling is enabled, false if not.
ModelSpaceTextScale
 The scale factor for text in model space when Annotation Scaling is enabled
ModelUnits
Length unit used on model space.
ModelUnitSystem
ModelUrl
 Gets and sets the link address, or URL, for the model.
Modified
 Returns or sets the document's modified flag.
Name
Returns the name of the currently loaded Rhino document (3DM file).
NamedConstructionPlanes
 Collection of named construction planes.
NamedLayerStates
 Collection of named layer states.
NamedPositions
 Collection of named positions.
NamedViews
 Collection of named views.
NextUndoRecordSerialNumber
 The serial number that will be assigned to the next undo record that is constructed.
Notes
Returns or sets the document's notes.
NotesLocked
Objects
PageAbsoluteTolerance
Page space absolute tolerance.
PageAngleToleranceDegrees
Page space angle tolerance.
PageAngleToleranceRadians
Page space angle tolerance.
PageDistanceDisplayMode
Gets/Sets the distance display mode for page space.
PageDistanceDisplayPrecision
PageRelativeTolerance
Page space relative tolerance.
PageUnits
Length unit used on page space geometry.
PageUnitSystem
PageViewGroups
 Collection of markups in this document
Path
Returns the path of the currently loaded Rhino document (3DM file).
RedoActive
 Returns true if Redo is currently active.
RenderEnvironments
RenderMaterials
RenderSettings
RenderTextures
RuntimeData
 Collection of document runtime data. This is a good place to put non-serializable, per document data, such as panel view models. Note well: This data will be dispose with the document and does not get serialized.
RuntimeSerialNumber
 Unique serialNumber for the document while the application is running. This is not a persistent value.
SectionStyles
 Collection of section styles in this document
Snapshots
 Collection of snapshots.
Strings
 Collection of document user data strings in this document
SubDAppearance
 Returns or sets the appearance of all SubD objects in the document.
TemplateFileUsed
 name of the template file used to create this document. This is a runtime value only present if the document was newly created.
UndoActive
 Returns true if Undo is currently active.
UndoRecordingEnabled
UndoRecordingIsActive
 true if undo recording is actually happening now.
Views
ViewUserInterface
Worksession
 Provides access to the document's worksession.
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace