RhinoCommon API
File3dmWriteOptions Properties
The File3dmWriteOptions type exposes the following members.
Properties
Name | Description
SaveAnalysisMeshes |  Obsolete.
 Include analysis meshes in the file. Default is true
SaveRenderMeshes |  Obsolete.
 Include Render meshes in the file. Default is true
SaveUserData
 Include custom user data in the file. Default is true
Version
File version. Default is major version number of this assembly version.
Must be in range [2; current version].
Alternatively, 0 is a placeholder for the last valid version.
Rhino can read its current version, plus earlier file versions except 1.
Use latest version when possible.
Top
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace