RhinoCommon API
Vector2d Properties
The Vector2d type exposes the following members.
Properties
Name | Description
IsValid
 Gets a value indicating whether this vector is valid. A valid vector must be formed of valid component values for x, y and z.
Length
 Computes the length (or magnitude, or size) of this vector. This is an application of Pythagoras' theorem.
SquareLength
 Returns the square of the length of the vector.
Unset
 Gets the value of the vector with components set as RhinoMath.UnsetValue,RhinoMath.UnsetValue.
X
 Gets or sets the X (first) component of this vector.
Y
 Gets or sets the Y (second) component of this vector.
Zero
 Gets the value of the vector with components 0,0.
Top
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace