RhinoCommon API
MeshVertexStatusList Properties
The MeshVertexStatusList type exposes the following members.
Properties
Name | Description
Capacity
 Gets or sets the total number of hidden vertex information the internal data structure can hold without resizing.
Count
 Gets or sets the number of hidden vertices. For this to be a valid part of a mesh, this count should be the same as the one of mesh vertices.
HiddenCount
 Gets a value indicating how many vertices have been set to hidden.
Item
 Gets or sets the hidden value at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
MeshVertexStatusList Class
Rhino.Geometry.Collections Namespace