RhinoCommon API
IntersectionEvent Properties
The IntersectionEvent type exposes the following members.
Properties
Name | Description
IsOverlap
 All curve intersection events are either a single point or an overlap.
IsPoint
 All curve intersection events are either a single point or an overlap.
OverlapA
 Gets the interval on curve A where the overlap occurs. If the intersection type is not overlap, this value is meaningless.
OverlapB
 Gets the interval on curve B where the overlap occurs. If the intersection type is not overlap, this value is meaningless.
ParameterA
 Gets the parameter on Curve A where the intersection occurred. If the intersection type is overlap, then this will return the start of the overlap region.
ParameterB
 Gets the parameter on Curve B where the intersection occurred. If the intersection type is overlap, then this will return the start of the overlap region.
PointA
 Gets the point on Curve A where the intersection occurred. If the intersection type is overlap, then this will return the start of the overlap region.
PointA2
 Gets the end point of the overlap on Curve A. If the intersection type is not overlap, this value is meaningless.
PointB
 Gets the point on Curve B (or Surface B) where the intersection occurred. If the intersection type is overlap, then this will return the start of the overlap region.
PointB2
 Gets the end point of the overlap on Curve B (or Surface B). If the intersection type is not overlap, this value is meaningless.
Top
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace