RhinoCommon API
Fonts Properties
The Fonts type exposes the following members.
Properties
Name | Description
BoldHeadingFont
 Returns a font that is 1.2x NormalFont and Bold
HeadingFont
 Returns a font used for dialog headings. 1.2x the size of NormalFont.
NormalFont
 Returns the normal font used for dialog boxes and buttons.
SmallFont
 Returns a font use for small text in dialog boxes. 0.8x the size of NormalFont.
TitleFont
 Returns a font used for dialog titles. 2x the size of NormalFont, and bold.
Top
See Also
Reference
Fonts Class
Rhino.UI Namespace