RhinoCommon API
FilePlyWriteOptions Properties
The FilePlyWriteOptions type exposes the following members.
Properties
Name | Description
ExportASCII
 Determines whether to export as Ascii.
ExportColors
 Determines whether to export vertex colors.
ExportDoubles
 Determines whether vertexes are exported as doubles or floats.
ExportMaterial
 Determines whether to export a material.
ExportNormals
 Determines whether to export vertex normals.
MeshingParameters
UseSimpleDialog
 Determines whether to use the simple or detailed meshing dialog.
Top
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace