RhinoCommon API
CustomGripObject Properties
The CustomGripObject type exposes the following members.
Properties
Name | Description
Index
 The grip's index. CustomObjectGrips.AddGrip already assigns this the grip's position in the grips list, and Rhino passes it back as the gripIndex argument of NeighborGrip and as the key of the grip direction cache. Setting it to anything else makes those arguments disagree with CustomObjectGrips.Grip(int), which is indexed by list position.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
MovedOtherThanLocation
 Set this when the grip changes something other than its location, such as a weight, so that Rhino counts the grip as moved. Rhino already counts a grip whose location moved, so this only adds to that. Cleared when Rhino undoes the grip move.
OriginalLocation
Weight |  (Overrides GripObject.Weight.)
Top
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace