RhinoCommon API
CommandAlias Properties
The CommandAlias type exposes the following members.
Properties
Name | Description
Alias
 String that represents an alias
Instant
 Is the command alias instant? Instant aliases run without the need for spacebar or enter
Macro
 Macro to run when an alias is input
Top
See Also
Reference
CommandAlias Class
Rhino.ApplicationSettings Namespace