RhinoCommon API
IUserInterfaceSection Properties
The IUserInterfaceSection type exposes the following members.
Properties
Name | Description
Hidden
 Return true if the section should be hidden, else return false.
Top
See Also
Reference
IUserInterfaceSection Interface
Rhino.Render.UI Namespace