RhinoCommon API
SimpleArrayMeshPointer Properties
The SimpleArrayMeshPointer type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of meshes in this array.
Top
See Also
Reference
SimpleArrayMeshPointer Class
Rhino.Runtime.InteropWrappers Namespace