RhinoCommon API
BrepFace Properties
The BrepFace type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this face.
FaceIndex
Index of face in Brep.Faces array.
Id
 Gets or sets the persistent id of this Brep face. By default, the id is Guid.Zero. Note, Rhino does not set this id. Thus, the property is available for use as a way of tracking Brep faces.
IsSurface
 Gets a value indicating whether the face is synonymous with the underlying surface. If a Face has no trimming curves then it is considered a Surface.
Loops
 Loops in this face.
MaterialChannelIndex
 This face's rendering material channel index.
OrientationIsReversed
 true if face orientation is opposite of natural surface orientation.
OuterLoop
 Every face has a single outer loop.
PackId
 0 if the pack it is unset, or >0 if the set pack id.
PerFaceColor
 If per-face color is "Empty", then this face does not have a custom color
ProxyBrepSubDFaceId
 If this face is part of a brep created by SubD.ProxyBrep(), then the subd component id of the corresponding SubD face is returned. Otherwise 0 is returned.
SurfaceIndex
 Surface index of the 3d surface geometry used by this face or -1
Top
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace