RhinoCommon API
SubDEdgeSharpness Properties
The SubDEdgeSharpness type exposes the following members.
Properties
Name | Description
Average
 Gets the average of the two end sharpness values.
Crease
 A sharpness of CreaseValue at both ends, used to indicate that an edge is a crease rather than a sharp edge. IsValid is false for this value; see IsValidOrCrease.
Delta
 Gets EndSharpness(1) - EndSharpness(0), or NaN if this is neither valid nor a crease.
IsConstant
 Gets true if both ends have the same valid sharpness value. Crease and Nan are both false; see IsConstantOrCrease.
IsConstantOrCrease
 Gets true if both ends have the same valid sharpness value, or if this is Crease.
IsCrease
 Gets true if this is Crease.
IsCreaseOrSharp
 Gets (IsCrease || IsSharp).
IsDecreasing
 Gets true if EndSharpness(0) is greater than EndSharpness(1).
IsIncreasing
 Gets true if EndSharpness(0) is less than EndSharpness(1).
IsNotValid
 Gets the opposite of IsValid. Crease and Nan are both true.
IsNotValidNorCrease
 Gets the opposite of IsValidOrCrease. Nan is true and Crease is false.
IsSharp
 Gets true if both ends are valid and at least one is greater than 0.0. Crease and Nan are both false: a crease edge is not a sharp edge.
IsValid
 Gets true if both ends are between 0.0 and MaximumValue. Crease and Nan are both false; see IsValidOrCrease.
IsValidOrCrease
 Gets true if both ends are between 0.0 and MaximumValue, or if this is Crease.
IsVariable
 Gets true if this is valid and the two ends differ. Crease and Nan are both false.
IsZero
 Gets true if both ends are 0.0, which is the sharpness of a smooth edge.
Item
 Gets the sharpness at the start or the end of the edge.
Maximum
 A sharpness of MaximumValue at both ends. This is the sharpest an edge can be without being a crease.
MaximumEndSharpness
 Gets the larger of the two end sharpness values.
MinimumEndSharpness
 Gets the smaller of the two end sharpness values.
Nan
 A sharpness whose ends are both NaN. This is what the factory methods return when their input is not valid.
Smooth
 A sharpness of 0.0 at both ends, which is what a smooth edge has. This is also the default value of a SubDEdgeSharpness.
Trend
 Gets +1 if the sharpness increases along the edge, -1 if it decreases, and 0 if it is constant. Returns UnsetIntIndex if this is not valid.
Top
See Also
Reference
SubDEdgeSharpness Structure
Rhino.Geometry Namespace