RhinoCommon API
ChangeQueue Properties
The ChangeQueue type exposes the following members.
Properties
Name | Description
DisplayPipelineAttributes
 Get the DisplayPipelineAttributes if available, null otherwise
IsPreview
 Return true if this ChangeQueue is created for preview rendering. No view was set for preview rendering.
ViewId
 Return view ID for a RhinoDoc based ChangeQueue. Returns Guid.Empty if no view was associated with the changequeue, i.e. preview rendering.
Top
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace