RhinoCommon API
ColorHSV Properties
The ColorHSV type exposes the following members.
Properties
Name | Description
A
 Gets or sets the alpha channel value. Alpha channels are limited to a 0~1 range.
H
 Gets or sets the hue channel value. Hue channels rotate between 0.0 and 1.0.
S
 Gets or sets the saturation channel value. Saturation channels are limited to a 0~1 range.
V
 Gets or sets the value (brightness) channel value. Value channels are limited to a 0~1 range.
Top
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace