RhinoCommon API
GetTransform Properties
The GetTransform type exposes the following members.
Properties
Name | Description
HaveTransform
ObjectList
Transform
Top
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace