RhinoCommon API
EventArgs Properties
The EventArgs type exposes the following members.
Properties
Name | Description
DataType
Top
See Also
Reference
EventArgs Class
Rhino.UI.Controls.DataSource Namespace