RhinoCommon API
ObjectEnumeratorSettings Properties
The ObjectEnumeratorSettings type exposes the following members.
Properties
Name | Description
ActiveObjects
 When true, objects that are part of current model and saved in file are returned.
ClassTypeFilter
DeletedObjects
 When true, deleted objects are returned.
HiddenObjects
 When true, hidden objects or objects on hidden layers are returned.
IdefObjects
 When true, objects in instance definitions (not the instance references) are returned.
IncludeGrips
 The default object enumerator settings will not iterate through grip objects. If you want the iterator to include grips, then set this property to true.
IncludeLights
 The default object enumerator settings will not iterate through render light objects. If you want the iterator to include lights, then set this property to true.
IncludePhantoms
 The default object enumerator settings will not iterate through phantom objects. If you want the iterator to include phantom objects, then set this property to true.
LayerIndexFilter
 The layer filter property can be used to limit the iteration to objects on a specific layer. The default is to iterate through all layers.
LockedObjects
 When true, locked objects or objects on locked layers are returned.
MaterialIndexFilter
 The material filter property can be used to limit the iteration to objects that use a specific material. The default is to iterate through all objects no matter the material assignment.
NameFilter
 The name filter property can be used to limit the iteration to objects with a specific name.
NormalObjects
 When true, normal objects (e.g. not locked and not hidden) are returned.
ObjectTypeFilter
 The object type filter property can be used to limit the iteration to specific types of geometry. The default is to iterate all objects types.
ReferenceObjects
 When true, objects that are for reference and not saved in file are returned.
SelectedObjectsFilter
 The default object enumerator settings ignore the selected state of objects. If you want the iterator to limit itself to selected objects, then set this property to true.
SpaceFilter
 The viewport filter property can be used to limit the iteration to objects that reside on specific space.
SubObjectSelected
 If true then objects which only have a sub object selected will be included. This is false by default.
UseFastSelection
 When SelectedObjectsFilter is true, enables an optimized iterator that walks only the document's selected objects rather than scanning the whole object table. Use this for selection-driven UI that re-queries on every selection change (e.g. panel enable-state). Only valid for the current selection set: do not use it while selection is actively changing. Ignored unless SelectedObjectsFilter is also true.
ViewportFilter
 The viewport filter property can be used to limit the iteration to objects that are active in a specific viewport.
VisibleFilter
 The default object enumerator settings ignore the visibility state of objects. If you want the iterator to limit itself to visible objects, then set this property to true.
Top
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace