RhinoCommon API
BrepEdgeList Properties
The BrepEdgeList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of brep edges.
Item
 Gets the BrepEdge at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
BrepEdgeList Class
Rhino.Geometry.Collections Namespace