RhinoCommon API
FileFbxWriteOptions Properties
The FileFbxWriteOptions type exposes the following members.
Properties
Name | Description
MapRhinoZtoFbxY
MeshingParameters
SaveFileAs
SaveLights
SaveMaterialsAs
SaveObjectsAs
SaveVertexNormals
SaveViews
Top
See Also
Reference
FileFbxWriteOptions Class
Rhino.FileIO Namespace