RhinoCommon API
FileStlReadOptions Properties
The FileStlReadOptions type exposes the following members.
Properties
Name | Description
SplitDisjointMeshes
STLModelUnits
UseFileNameAsObjectName
Weld
WeldAngle
Top
See Also
Reference
FileStlReadOptions Class
Rhino.FileIO Namespace