RhinoCommon API
CustomRenderMeshProviderAttribute Properties
The CustomRenderMeshProviderAttribute type exposes the following members.
Properties
Name | Description
NonObjectIdsOnly
 If set to true, this will quickly return false for HasCustomRenderMeshes if the objectId is in the document.
Top
See Also
Reference
CustomRenderMeshProviderAttribute Class
Rhino.Render.CustomRenderMeshes Namespace