RhinoCommon API
Instance Properties
The Instance type exposes the following members.
Properties
Name | Description
IsForcedMaterial
 The material for this instance should override any display mode materials.
IsRequestingPlugInDependent
 If this instance will change depending on the requesting plug-in.
IsViewDependent
 If this instance will change depending on the view direction.
Material
 The material for this instance.
Mesh
 Returns the mesh associated with this geometry. Note that this function will always return a mesh even if the type is not a mesh...so you can always call this function without checking the type to give you the mesh. It's more efficient to use the primitive directly of course...but if you don't support it...
Transform
 The transform for this instance. Transform the geometry by this to set its final location in world space.
Top
See Also
Reference
Instance Class
Rhino.Render.CustomRenderMeshes Namespace