RhinoCommon API
LinearDimension Properties
The LinearDimension type exposes the following members.
Properties
Name | Description
Aligned
 Gets or sets a value indicating whether this annotation is aligned.
AnnotationType
Arrowhead1End
 Gets the arrow head end of the first extension line.
Arrowhead2End
 Gets the arrow head end of the second extension line.
DimensionLinePoint
 Point on annotation plane where dimension line starts
DistanceBetweenArrowTips
 Gets the distance between arrow tips.
ExtensionLine1End
 End of the first extension line.
ExtensionLine2End
 End of the second extension line.
Top
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace