RhinoCommon API
HatchPatternTableEventArgs Properties
The HatchPatternTableEventArgs type exposes the following members.
Properties
Name | Description
Document
 The document in which the event occurred.
EventType
 The event type.
HatchPatternIndex
 Index of the hatchpattern.
NewState
 The new state.
OldState
 The old state.
Top
See Also
Reference
HatchPatternTableEventArgs Class
Rhino.DocObjects.Tables Namespace