RhinoCommon API
File3dmObjectTable Properties
The File3dmObjectTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns ModelGeometry.
 (Overrides CommonComponentTable<T>.ComponentType.)
Count
 Returns the total amount of items in the object table, including lights.
 (Overrides CommonComponentTable<T>.Count.)
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace