RhinoCommon API
DirectionAnalysisSettings Properties
The DirectionAnalysisSettings type exposes the following members.
Properties
Name | Description
Color
Gets or sets a color used to show curve or surface direction.
Direction
 Gets or sets whether to display the direction.
U
 Gets or sets whether to display the U dir.
V
 Gets or sets whether to display the V dir.
Top
See Also
Reference
DirectionAnalysisSettings Class
Rhino.ApplicationSettings Namespace