RhinoCommon API
UserInterfaceObjectBase Properties
The UserInterfaceObjectBase type exposes the following members.
Properties
Name | Description
BoundToActiveView
HasKeyboardFocus
 Does this object have keyboard focus? An object with keyboard focus gets first refusal on what is typed in a viewport; what it does not use carries on to the command line as usual.
Tooltip
 Text shown in a tooltip when the mouse rests over this object. Null or an empty string means no tooltip, which is what an object starts with. One tooltip is on screen at a time; whichever object the mouse is over owns it.
Visible
 Is the user interface object visible? Objects that are not visible will not be drawn and will not receive mouse events
Top
See Also
Reference
UserInterfaceObjectBase Class
Rhino.UI Namespace