RhinoCommon API
ManifestTable Properties
The ManifestTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns Mixed.
Count
 Total number of items in the manifest, including deleted items.
LongCount
 Total number of items in the manifest, including deleted items.
Parent
 Returns the parent object. This is the RhinoDoc, or the File3md file.
Top
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace