RhinoCommon API
WorksessionFile Properties
The WorksessionFile type exposes the following members.
Properties
Name | Description
ActiveModelIndex
 Gets the index of the first active model, or -1 if there is no active model.
CurrentVersion
The worksession file version Rhino 5 and later write.
ModelCount
Gets the number of models.
Version
 Gets or sets the file version. Reading sets it to the version of the file that was read. Writing does not use it.
Top
See Also
Reference
WorksessionFile Class
Rhino.FileIO Namespace