RhinoCommon API
CurveIntersections Properties
The CurveIntersections type exposes the following members.
Properties
Name | Description
Count
 Gets the number of recorded intersection events.
Item
 Gets the intersection event data at the given index.
Top
See Also
Reference
CurveIntersections Class
Rhino.Geometry.Intersect Namespace