RhinoCommon API
FilletSurfaceSettings Properties
The Brep.FilletSurfaceSettings type exposes the following members.
Properties
Name | Description
AngleTolerance
 Angle tolerance to decide when faces are tangent-continuous
Chamfer
 If true, a ruled chamfered surface is created.
ContinueAcrossTangentFaces
 If true, the fillets or chamfers will be extended to neighboring faces as long as neighboring faces are tangent to the input faces.
Degree
 Degree of the arc approxiation (3, 4, or 5) - only for non-rational fillets
Extend
 If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges
G2Blend
 If true, a G2-continuous blend will be created
InnerSlider
 A number between -0.95 and 0.95 indicating how far to push the inner control point toward or away from the theoretical middle control point - only for non-rational fillets
NonRational
 Create a non-rational approximation to the arc. This requires Degree to be set to 3, 4, or 5 and TanSlider and InnerSlider to a value between -0.95 and 0.95.
Radius
 The radius of the fillets
SecondRadius
 The second radius of the fillets (only for chamfered surfaces)
TanSlider
 A number between -0.95 and 0.95 indicating how far to push the tangent control points toward or away from the theoretical middle control point(s) - only for non-rational fillets
Tolerance
 The tolerance. When in doubt, use the document's model absolute tolerance.
Trim
 If true, the input faces will be trimmed, if false, the input faces will be split.
Top
See Also
Reference
Brep.FilletSurfaceSettings Class
Rhino.Geometry Namespace