RhinoCommon API
ToolbarGroup Properties
The ToolbarGroup type exposes the following members.
Properties
Name | Description
Id
 Gets the id of the toolbar group.
IsDocked
 Returns true if the toolbar group is docked.
Name
 Gets the name of the toolbar group.
Visible
 Gets and sets a toolbar group's visibility.
Top
See Also
Reference
ToolbarGroup Class
Rhino.UI Namespace