RhinoCommon API
GetLine Properties
The GetLine type exposes the following members.
Properties
Name | Description
AcceptZeroLengthLine
 Controls whether or not a zero length line is acceptable. The default is to require the user to keep picking the end point until we get a point different than the start point.
FeedbackColor
 If set, the feedback color is used to draw the dynamic line when the second point is begin picked. If not set, the active layer color is used.
FirstPointPrompt
Prompt when getting first point
FixedLength
 If FixedLength > 0, the line must have the specified length
GetLineMode
 Mode used
HaveFeedbackColor
 If true, the feedback color is used to draw the dynamic line when the second point is begin picked. If false, the active layer color is used.
MidPointPrompt
Prompt when getting midpoint
SecondPointPrompt
Prompt when getting second point
Top
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace