RhinoCommon API
ColorGradient Properties
The ColorGradient type exposes the following members.
Properties
Name | Description
EndPoint
 End point of gradient
GradientType
 Gradient fill type associated with this hatch
Repeat
 Repeat factor for gradient. Factors greater than 1 define a reflected repeat factor while values less than -1 define a wrapped repeat factor.
StartPoint
 Start point of gradient
Top
See Also
Reference
ColorGradient Class
Rhino.Display Namespace