RhinoCommon API
Plane Properties
The Plane type exposes the following members.
Properties
Name | Description
IsValid
 Gets a value indicating whether or not this is a valid plane. A plane is considered to be valid when all fields contain reasonable information and the equation jibes with point and z-axis.
Normal
 Gets the normal of this plane. This is essentially the ZAxis of the plane.
Origin
 Gets or sets the origin point of this plane.
OriginX
 Gets or sets the X coordinate of the origin of this plane.
OriginY
 Gets or sets the Y coordinate of the origin of this plane.
OriginZ
 Gets or sets the Z coordinate of the origin of this plane.
Unset
 Gets a plane that contains Unset origin and axis vectors.
WorldXY
 plane coincident with the World XY plane.
WorldYZ
 plane coincident with the World YZ plane.
WorldZX
 plane coincident with the World ZX plane.
XAxis
 Gets or sets the X axis vector of this plane.
YAxis
 Gets or sets the Y axis vector of this plane.
ZAxis
 Gets or sets the Z axis vector of this plane.
Top
See Also
Reference
Plane Structure
Rhino.Geometry Namespace