RhinoCommon API
VariationalPatchResult Properties
The Brep.VariationalPatchResult type exposes the following members.
Properties
Name | Description
Error
 Errors generated during patch generation. If no result is obtained, this error can give more information about what went wrong.
G0
 This value will be not-null if any positional (G0) constraints were used. It will be true if those constraints were met within the positional tolerance.
G0Int
 This value will be not-null if any internal constraints were used. It will be true if those constraints were met within the internal positional tolerance.
G1
 This value will be not-null if any tangential (G1) constraints were used. It will be true if those constraints were met within the angle tolerance.
G2
 This value will be not-null if any curvature (G2) constraints were used. It will be true if those constraints were met within the curvature relative and zero tolerances.
Warning
 Warnings generated during patch generation
Top
See Also
Reference
Brep.VariationalPatchResult Class
Rhino.Geometry Namespace