RhinoCommon API
FileCsvDocument Properties
The FileCsvDocument type exposes the following members.
Properties
Name | Description
ColumnCount
 The number of columns in the document. Every row has exactly this many fields.
HasHeader
 True if the document has a header row of column names. See ColumnIndex(String).
Header
 The column names, or null if the document has no header. RowCount counts only the data rows; the header is not one of them.
Item
 Gets the value of a cell, addressed by column and row. Use TryGetString(Int32, Int32, String) for access that does not throw when the cell does not exist.
RowCount
 The number of rows in the document.
Top
See Also
Reference
FileCsvDocument Class
Rhino.FileIO Namespace