RhinoCommon API
SubDToBrepOptions Properties
The SubDToBrepOptions type exposes the following members.
Properties
Name | Description
Default
 Default SubDToBrepOptions settings. Currently selects the same options as DefaultUnpacked: Locally-G1 smoothing of extraordinary vertices, unpacked faces.
DefaultPacked
 Default ON_SubDToBrepParameters settings for creating a packed brep. Locally-G1 smoothing of extraordinary vertices, packed faces.
DefaultUnpacked
 Default ON_SubDToBrepParameters settings for creating an unpacked brep. Locally-G1 smoothing of extraordinary vertices, unpacked faces.
ExtraordinaryVertexProcess
 Get or sets the extraordinary vertex process option.
PackFaces
 Get or sets the pack faces option.
Top
See Also
Reference
SubDToBrepOptions Class
Rhino.Geometry Namespace