RhinoCommon API
ObjectPropertiesPageEventArgs Properties
The ObjectPropertiesPageEventArgs type exposes the following members.
Properties
Name | Description
DocRuntimeSerialNumber
 Document containing the objects and views
Document
 Document containing the objects and views
EventRuntimeSerialNumber
 Gets the runtime serial number.
ObjectCount
Objects
 Return a list of Rhino objects to be processed by this object properties page
ObjectTypes
Page
 The page sending these arguments
View
 Active view
Viewport
 Active viewport
Top
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace