RhinoCommon API
RenderPrimitiveList Properties
The RenderPrimitiveList type exposes the following members.
Properties
Name | Description
Count
 Number of meshes in this list
RhinoObject
 The Rhino object associated with this list
UseObjectsMappingChannels
 Returns true if the texture mapping will be taken from the Rhino object otherwise; the texture mapping will use the texture coordinates on the mesh only.
Top
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace