RhinoCommon API
ClippingPlaneSurface Properties
The ClippingPlaneSurface type exposes the following members.
Properties
Name | Description
DimensionStyleId
 The id of the dimstyle used by this clipping plane surface. This is used to help determine how the clipping plane is drawn with respect to things like arrows and fonts
ParticipationListsEnabled
 Should the object and layer participation lists be used when determining clipping
PlaneDepth
 Distance that the clipping has an effect
PlaneDepthEnabled
 Determines if the PlaneDepth value should be used
Top
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace