RhinoCommon API
PostProcessFrameBufferEventArgs Properties
The PostProcessFrameBufferEventArgs type exposes the following members.
Properties
Name | Description
FrameBufferSize
 Width and height in pixels of the frame this handler can read. A layout runs this channel once per detail, so this is not always the size of the view.
Top
See Also
Reference
PostProcessFrameBufferEventArgs Class
Rhino.Display Namespace