RhinoCommon API
IZooClientUtilities Properties
The IZooClientUtilities type exposes the following members.
Properties
Name | Description
LoggedInUserAvatar
 Returns the logged in user's avatar picture. Returns a default avatar if the user does not have an avatar or if the avatar could not be fetched.
LoggedInUserName
 Returns the name of the logged in user, or null if the user is not logged in.
UserIsLoggedIn
 Returns true if the user is logged in; else returns false. A logged in user does not guarantee that the auth tokens managed by the CloudZooManager instance are valid.
Top
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace