RhinoCommon API
MostRecentCommandDescription Properties
The MostRecentCommandDescription type exposes the following members.
Properties
Name | Description
DisplayString
Macro
Top
See Also
Reference
MostRecentCommandDescription Class
Rhino.Commands Namespace