RhinoCommon API
UserInterfaceCheckBox Properties
The UserInterfaceCheckBox type exposes the following members.
Properties
Name | Description
Checked
 Convenience for the two state case. Checked is true when the state is On, and an indeterminate check box is not checked.
CheckState
 State of the check box. Setting the state does not raise CheckedChanged; that is only for a state the user changed by clicking.
Top
See Also
Reference
UserInterfaceCheckBox Class
Rhino.UI Namespace