RhinoCommon API
ICollapsibleSectionHolder Properties
The ICollapsibleSectionHolder type exposes the following members.
Properties
Name | Description
BackgroundColor
BottomMargin
EmptyText
LeftMargin
RightMargin
ScrollPosition
SectionCount
Sections
SettingsPathSubKey
TopMargin
Top
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace