RhinoCommon API
GetSphere Properties
The GetSphere type exposes the following members.
Properties
Name | Description
DefaultSize
 Default radius or diameter (based on InDiameterMode)
InDiameterMode
 Determines if the "size" value is representing a radius or diameter
Top
See Also
Reference
GetSphere Class
Rhino.Input.Custom Namespace