RhinoCommon API
SubDComponentParameter Properties
The SubDComponentParameter type exposes the following members.
Properties
Name | Description
ActiveFaceId
 Gets the id of the face this parameter uses to resolve which sector of a vertex or which side of an edge it means, or 0 if there is none. It is always 0 when IsFaceParameter is true; use ComponentId in that case.
ComponentId
 Gets the id of the SubD component this parameter is relative to, or 0 if this parameter is not set.
ComponentIndex
 Gets the component index of the SubD component this parameter is relative to. It is Unset if this parameter is not set.
EdgeParameter
 Gets a value between 0 and 1 identifying a point on the edge, or NaN if IsEdgeParameter is false.
FaceCornerIndex
 Gets the index of the face corner the face parameters are measured in, or -1 if IsFaceParameter is false.
FaceCornerParameters
 Gets the two parameters inside the face corner identified by FaceCornerIndex. Both run from 0 to 1/2: (0,0) is the corner vertex and (1/2,1/2) is the center of the face. X runs towards the midpoint of the edge leaving the corner and Y towards the midpoint of the edge entering it. The point is Unset if IsFaceParameter is false.
FaceEdgeCount
 Gets the number of edges of the face, or 0 if IsFaceParameter is false.
IsEdgeParameter
 Gets true if this parameter identifies a surface point on a SubD edge.
IsFaceParameter
 Gets true if this parameter identifies a surface point inside a SubD face.
IsSet
 Gets true if this parameter identifies a point on a SubD.
IsVertexParameter
 Gets true if this parameter identifies the surface point at a SubD vertex.
Unset
 The unset parameter. It does not identify a point on any SubD.
Top
See Also
Reference
SubDComponentParameter Structure
Rhino.Geometry Namespace