RhinoCommon API
DetailView Properties
The DetailView type exposes the following members.
Properties
Name | Description
IsParallelProjection
 Gets or sets whether the view is parallel.
IsPerspectiveProjection
 Gets or sets whether the view is perspective.
IsProjectionLocked
 Gets or sets whether the view is locked.
PageToModelRatio
 Gets the ratio of page units to model units for this detail view. Returns 0 if the projection is not parallel.
Top
See Also
Reference
DetailView Class
Rhino.Geometry Namespace