RhinoCommon API
FilePovWriteOptions Properties
The FilePovWriteOptions type exposes the following members.
Properties
Name | Description
ExportAsOneFile
MeshingParameters
Top
See Also
Reference
FilePovWriteOptions Class
Rhino.FileIO Namespace