RhinoCommon API
FileCdWriteOptions Properties
The FileCdWriteOptions type exposes the following members.
Properties
Name | Description
MeshingParameters
Top
See Also
Reference
FileCdWriteOptions Class
Rhino.FileIO Namespace