RhinoCommon API
LengthValue Properties
The LengthValue type exposes the following members.
Properties
Name | Description
ContextAngleUnitSystem
 Returns the context AngleUnitSystem from this LengthValue's ParseSettings
ContextLocaleId
 returns the context LocaleId from this LengthValue
LengthString
 Return length as a string
LengthStringFormat
 Returns the StringFormat from this LengthValue
ParseSettings
 Parse settings
Units
 LengthUnit used by this LengthValue
UnitSystem
 UnitSystem used by this LengthValue
Top
See Also
Reference
LengthValue Class
Rhino Namespace