RhinoCommon API
FileNwdWriteOptions Properties
The FileNwdWriteOptions type exposes the following members.
Properties
Name | Description
MeshingParameters
Version
Top
See Also
Reference
FileNwdWriteOptions Class
Rhino.FileIO Namespace