RhinoCommon API
ReplayHistoryResult Properties
The ReplayHistoryResult type exposes the following members.
Properties
Name | Description
ExistingObject
 The previously existing object.
Do not attempt to edit this object. It might have been already deleted by, for example, dragging.
Top
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace