RhinoCommon API
CommandLineTextWriter Properties
The RhinoApp.CommandLineTextWriter type exposes the following members.
Properties
Name | Description
Encoding
 Returns Encoding Unicode.
 (Overrides TextWriter.Encoding.)
Top
See Also
Reference
RhinoApp.CommandLineTextWriter Class
Rhino Namespace