RhinoCommon API
MeshCheckParameters Properties
The MeshCheckParameters type exposes the following members.
Properties
Name | Description
CheckForBadNormals
 If true, then look for vertex normals that are not unit vectors, are zero length or vary greatly from the general direction of the face normals.
CheckForDegenerateFaces
 If true, then look for triangles and quads that have zero area and quads where one sub triangle has zero area.
CheckForDisjointMeshes
 If true, then look for faces in the mesh that are totally isolated from other faces in the mesh. (i.e. an island of faces, or many islands, that have a boundary of naked edges)
CheckForDuplicateFaces
 If true, then look for faces that have vertices (not necessarily vertex indexes) that are identical.
CheckForExtremelyShortEdges
 If true, then look for topological edges where the distance between the endpoints is less than ExtremelyShortEdgeDistance.
CheckForInvalidNgons
 If true, then look for ngons that have invalid information.
CheckForNakedEdges
 If true, then look for topological edges in the mesh topology where the face count is 1. Note, this check is also made if CheckForDuplicateFaces is true but the output is not shown if CheckForNakedEdges is false.
CheckForNonManifoldEdges
 If true, then look for topological edges in the mesh topology where the face count is greater than 2. Note, this check is also made if CheckForDuplicateFaces is true but the output is not shown if CheckForNonManifoldEdges is false.
CheckForRandomFaceNormals
 If true, then look for adjacent faces that have the same edge orientation. This typically means that clockwise/counterclockwise orientation, and face normal are not in sync.
CheckForSelfIntersection
 If true, then look for self intersections.
CheckForUnusedVertices
 If true, then look for vertices that are not referenced by any face in the mesh.
DegenerateFaceCount
 Gets the total degenerate face count for all meshes.
DisjointMeshCount
 Gets the total count of disjoint pieces for all meshes.
DuplicateFaceCount
 Gets the total count of duplicate faces for all meshes.
ExtremelyShortEdgeCount
 Gets the total number of extremely short edges for all meshes.
InvalidNgonCount
 Gets the total number of invalid ngons for all meshes.
NakedEdgeCount
 Gets the total number of naked edges for all meshes.
NonManifoldEdgeCount
 Gets the total number of non-manifold edges for all meshes.
NonUnitVectorNormalCount
 Get the total count of normals that are not unit vectors for all meshes.
RandomFaceNormalCount
 Gets the total count of random face normals for all meshes.
SelfIntersectingPairsCount
 Gets the total count of self intersections for all meshes.
UnusedVertexCount
 Gets the total count of unused vertices for all meshes.
VertexFaceNormalsDifferCount
 Gets the total count of vertex normals that differ greatly from face normals for all meshes.
ZeroLengthNormalCount
 Gets the total count of zero length normals for all meshes.
Top
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace