RhinoCommon API
Circle Properties
The Circle type exposes the following members.
Properties
Name | Description
BoundingBox
 Gets the circle's 3d axis aligned bounding box.
Center
 Gets or sets the center point of this circle.
Circumference
 Gets or sets the circumference of this circle.
Diameter
 Gets or sets the diameter (radius * 2.0) of this circle. Diameters should be positive values.
IsValid
 A valid circle has radius larger than 0.0 and a base plane which is must also be valid.
Normal
 Gets the normal vector for this circle.
Plane
 Gets or sets the plane of the circle.
Radius
 Gets or sets the radius of this circle. Radii should be positive values.
Unset
 Gets a circle with Unset components.
Top
See Also
Reference
Circle Structure
Rhino.Geometry Namespace