RhinoCommon API
CurveKinkDefinition Properties
The CurveKinkDefinition type exposes the following members.
Properties
Name | Description
CurvatureKinkRadiusRatio
 If the ratio (minimum radius of curvature)/(maximum radius of curvature) at a curvature discontinuity is < CurvatureKinkRadiusRatio, then that curvature discontinuity is treated as a kink. In particular, if CurvatureKinkRadiusRatio = 0, then curvature radius discontinuity checks are disabled.
CurvatureKinkZeroTolerance
 If the curvature <= CurvatureKinkZeroTolerance, then it is treated as zero curvature. Put another way, if (radius of curvature) * CurvatureKinkZeroTolerance >= 1, then the radius is treated as infinite. If CurvatureKinkZeroTolerance > 0, then the curvature kink test is scale dependent. If CurvatureKinkZeroTolerance = 0, then the curvature kink test is indpendent of scale.
KinkAngleDegrees
 The angle, in degrees, used to determine if when an abrupt change in tangent or curvature vector direction is a kink.
KinkAtCurvatureChange
 Returns true if curvature discontinuities should be tested when finding kinks. The angle used vector curvature direction discontinuities is KinkAngleDegrees(). The ratio used for radius of curvature discontinuities is CurvatureKinkRadiusRatio().
KinkAtTangentChange
 Returns true if tangent discontinuities should be tested when finding kinks. The angle used for testing is KinkAngleDegrees().
Top
See Also
Reference
CurveKinkDefinition Class
Rhino.Geometry Namespace