RhinoCommon API
NamedLayerStateTable Properties
The NamedLayerStateTable type exposes the following members.
Properties
Name | Description
Count
 Returns the number of named layers states in the document.
Document
 Document that owns this table.
Names
 Returns the names of named layer states in the document.
Top
See Also
Reference
NamedLayerStateTable Class
Rhino.DocObjects.Tables Namespace