RhinoCommon API
UserInterfaceSection Properties
The UserInterfaceSection type exposes the following members.
Properties
Name | Description
RenderContent
 The RenderContent object that created this user interface object.
Window
 The user control associated with this user interface object.
Top
See Also
Reference
UserInterfaceSection Class
Rhino.Render.UI Namespace