RhinoCommon API
GumballPickResult Properties
The GumballPickResult type exposes the following members.
Properties
Name | Description
Mode
Top
See Also
Reference
GumballPickResult Class
Rhino.UI.Gumball Namespace