RhinoCommon API
MeshInstance Properties
The MeshInstance type exposes the following members.
Properties
Name | Description
Ancestry
 Returns a the ancestry information for this object. Note well - the ancestry records contain complete copies of the object attributes for each level of the block hierarchy. Please do not be tempted to use the ModelObjectId of the instance objects to look them up in the document - the document may have changed since the change queue entries were added.
CastShadows |  Obsolete.
 Return true if mesh instance should cast shadows
Decals
 Read-only access to the decals for this MeshInstance if any. Null if no object attributes exist for this mesh instance.
GroupId |  Obsolete.
 Get identifier that specifies the grouping of these mesh instances - usually based on the object that this originally comprised.
InstanceId
 Get the instance identifier for this mesh instance.
MaterialId
 The Material CRC / RenderHash
MeshId
 Get the mesh identifier for this mesh instance.
MeshIndex |  Obsolete.
 Get the mesh index for this mesh instance.
ObjectAttributes
 The ObjectAttributes associated with a MeshInstance
OcsTransform |  Obsolete.
 OCS Transform for the MeshInstance - this is the Object Coordinate System texture mapping transformation set in the texture mapping properties dialog. (identity means no OCS, potentially just simple WCS/WCS Box)
ParentId
 Get the Guid of the object that is at the parent of the MeshInstance ancestry, or Guid.Empty if there is no parent.
ReceiveShadows |  Obsolete.
 Return true if mesh instance should receive shadows
RenderMaterial
 RenderMaterial associated with mesh instance
RootId
 Get the Guid of the object that is at the root of the MeshInstance ancestry, or Guid.Empty if this has no root.
Transform
 Transform for the MeshInstance
Top
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace