RhinoCommon API
ThumbData Properties
The ThumbData type exposes the following members.
Properties
Name | Description
Children
Content
Id
Image
Intensity
InUse
InUseColor
Name
Parent
PreviewAppearance
Selected
Tags
TopLevel
Type
Top
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace