RhinoCommon API
RenderPipeline Properties
The RenderPipeline type exposes the following members.
Properties
Name | Description
ConfirmationSeconds
 Sets the number of seconds that need to elapse during rendering before the user is asked if the rendered image should be saved.
PlugIn
RenderSessionId
 Get the Id associated with this render session, this is useful when looking up Rhino.Render.RenderPanels.
Top
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace