RhinoCommon API
MeshNgon Properties
The MeshNgon type exposes the following members.
Properties
Name | Description
BoundaryVertexCount
 Get the number of vertices in this ngon. about length information.
Empty
 Gets an empty MeshNgon.
FaceCount
 Get the number of faces in this ngon.
Item
 Get a mesh vertex index from the ngon's vertex index list.
Top
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace