RhinoCommon API
DisplayModeChangedEventArgs Properties
The DisplayModeChangedEventArgs type exposes the following members.
Properties
Name | Description
ChangedDisplayModeId
OldDisplayModeId
RhinoDoc
Viewport
Top
See Also
Reference
DisplayModeChangedEventArgs Class
Rhino.Display Namespace