RhinoCommon API
Silhouette Properties
The Silhouette type exposes the following members.
Properties
Name | Description
Curve
 3D curve representing the shape of the silhouette.
GeometryComponentIndex
 Gets the component index corresponding with this silhouette curve. This field is only set when the entire silhouette curve is part of some geometry component.
SilhouetteType
 Gets the type of this silhouette curve.
Top
See Also
Reference
Silhouette Class
Rhino.Geometry Namespace