RhinoCommon API
GetPoint Properties
The GetPoint type exposes the following members.
Properties
Name | Description
DynamicDrawColor
 Color used by CRhinoGetPoint::DynamicDraw to draw the current point and the line from the base point to the current point.
FullFrameRedrawDuringGet
 In the "RARE" case that you need to draw some depth buffered geometry during a Get() operation, setting this value to true will force entire frames to be redrawn while the user moves the mouse. This allows DisplayPipeline events to be triggered as well as OnPostDrawObjects NOTE!! Setting this value to true comes with a significant performance penalty because the scene needs to be fully regenerated every frame where the standard DynamicDraw event draws temporary decorations (geometry) on top of a static scene.
OsnapEventType
 Gets the type of object snap used to obtain the point.
Tag
 Gets or sets an arbitrary object that can be attached to this GetPoint instance. Useful for passing some/ information that you may need in a DynamicDraw event since you can get at this Tag from the GetPointDrawEventArgs.
Top
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace