RhinoCommon API
TextEntity Properties
The TextEntity type exposes the following members.
Properties
Name | Description
Justification
 Gets or sets the justification of text in relation to its base point.
TextHorizontalAlignment
TextOrientation
TextVerticalAlignment
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace