RhinoCommon API
DisplayBitmap Properties
The DisplayBitmap type exposes the following members.
Properties
Name | Description
Size
 Size of the underlying bitmap image
Top
See Also
Reference
DisplayBitmap Class
Rhino.Display Namespace