RhinoCommon API
MeshTextureCoordinateList Properties
The MeshTextureCoordinateList type exposes the following members.
Properties
Name | Description
Capacity
 Gets or sets the total number of texture coordinates the internal data structure can hold without resizing.
Count
 Gets or sets the number of texture coordinates.
Item
 Gets or sets the texture coordinate at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace