RhinoCommon API
Light Properties
The Light type exposes the following members.
Properties
Name | Description
Ambient
 Gets or sets the ambient color.
AttenuationType
 Get the type of attenuation for this light.
AttenuationVector
 Gets or Sets the attenuation vector.
CoordinateSystem
 Gets a value, determined by LightStyle, that explains whether the camera directions are relative to World or Camera spaces.
Diffuse
 Gets or sets the diffuse color.
Direction
 Gets or sets the vector direction of the camera.
HotSpot
 The hot spot setting runs from 0.0 to 1.0 and is used to provides a linear interface for controlling the focus or concentration of a spotlight. A hot spot setting of 0.0 corresponds to a spot exponent of 128. A hot spot setting of 1.0 corresponds to a spot exponent of 0.0.
Id
Gets the ID of this light.
Intensity
 Gets or sets the light intensity.
IsDirectionalLight
 Gets a value indicating whether the light style is LightStyle CameraDirectional or WorldDirectional.
IsEnabled
 Gets or sets a value that defines if the light is turned on (true) or off (false).
IsLinearLight
 Gets a value indicating whether the light style is LightStyle WorldLinear.
IsPointLight
 Gets a value indicating whether the light style is LightStyle CameraPoint or WorldPoint.
IsRectangularLight
 Gets a value indicating whether the light style is LightStyle WorldRectangular.
IsSpotLight
 Gets a value indicating whether the light style is LightStyle CameraSpot or WorldSpot.
IsSunLight
 Gets a value indicating whether this object is a Sun light.
Length
 Gets or sets the height in linear and rectangular lights.
(ignored for non-linear/rectangular lights.)
LightStyle
 Gets or sets a light style on this camera.
Location
 Gets or sets the light or 3D position or location.
Name
 Gets or sets the light name.
PerpendicularDirection
 Gets a perpendicular vector to the camera direction.
PowerCandela
 Gets or sets the light power in candelas (cd).
PowerLumens
 Gets or sets the light power in lumens (lm).
PowerWatts
 Gets or sets the light power in watts (W).
Radius
 Gets or sets the emitter radius (of the emitting sphere, in model units) for point and spot lights.
Ignored for other light types; linear light radius is derived from Width.
ShadowIntensity
 Gets or sets the shadow intensity for the light.
Specular
 Gets or sets the specular color.
SpotAngleRadians
 Gets or sets the spot angle in radians.
Ignored for non-spot lights.
angle = 0 to pi/2 (0 to 90 degrees).
SpotExponent
 The spot exponent varies from 0.0 to 128.0 and provides an exponential interface for controlling the focus or concentration of a spotlight (like the OpenGL GL_SPOT_EXPONENT parameter). The spot exponent and hot spot parameters are linked; changing one will change the other. A hot spot setting of 0.0 corresponds to a spot exponent of 128. A hot spot setting of 1.0 corresponds to a spot exponent of 0.0.
SpotLightShadowIntensity |  Obsolete.
 Gets or sets the spot light shadow intensity.
(ignored for non-spot lights.)
Width
 Gets or sets the width in linear and rectangular lights.
(ignored for non-linear/rectangular lights.)
Top
See Also
Reference
Light Class
Rhino.Geometry Namespace