RhinoCommon API
FileTxtWriteOptions Properties
The FileTxtWriteOptions type exposes the following members.
Properties
Name | Description
Delimiter
DelimiterCharacter
ExportVertexColors
Precision
SurroundWithDoubleQuotes
Top
See Also
Reference
FileTxtWriteOptions Class
Rhino.FileIO Namespace