RhinoCommon API
Color4f Properties
The Color4f type exposes the following members.
Properties
Name | Description
A
B
Black
Empty
G
L
R
White
Top
See Also
Reference
Color4f Structure
Rhino.Display Namespace