RhinoCommon API
GripUserInterfaceObject Properties
The GripUserInterfaceObject type exposes the following members.
Properties
Name | Description
GripColor
GripFillColor
GripLocation
GripRadius
GripShape
GripShapeRotationRadians
GripStrokeWidth
ObjectSnapCursorsEnabled
ObjectSnapPermitted
OnObjectCursorsEnabled
Top
See Also
Reference
GripUserInterfaceObject Class
Rhino.UI Namespace