RhinoCommon API
RhinoAccoountsProgressInfo Properties
The RhinoAccoountsProgressInfo type exposes the following members.
Properties
Name | Description
Description
 A localized description of the state that may be shown to the user of the application.
Metadata
 Any metadata of interest that may be used by the caller of a task.
State
 The state to report.
Top
See Also
Reference
RhinoAccoountsProgressInfo Class
Rhino.Runtime.RhinoAccounts Namespace