RhinoCommon API
PathPoint Properties
The ViewCaptureWriter.PathPoint type exposes the following members.
Properties
Name | Description
Location
PointType
Top
See Also
Reference
ViewCaptureWriter.PathPoint Structure
Rhino.Runtime Namespace