RhinoCommon API
Panels Properties
The Panels type exposes the following members.
Properties
Name | Description
EtoPanelStyleName
 Style applied to Eto controls hosted by the Rhino.UI.Panels and Rhino.UI.ObjectProperties systems.
IconSize
 Gets the panel icon size in logical units.
IconSizeInPixels
 Gets the panel icon size in pixels.
ScaledIconSize
 Gets the panel icon size in pixels with DPI scaling applied.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace