RhinoCommon API
OpenGLSettingsState Properties
The OpenGLSettingsState type exposes the following members.
Properties
Name | Description
AntialiasLevel
 AA level used in OpenGL viewports
Top
See Also
Reference
OpenGLSettingsState Class
Rhino.ApplicationSettings Namespace