RhinoCommon API
GroundPlane Properties
The GroundPlane type exposes the following members.
Properties
Name | Description
Altitude
 Get the altitude for ground plane
Crc
 Get the checksum of this groundplane object
Enabled
 Return true if ground plane is enabled
IsShadowOnly
 Get true if ground plane should be shadow-only
MaterialId
 The CRC / RenderHash of the material on this ground plane
ShowUnderside
 True if ground plane underside should be shown.
TextureOffset
 Get texture offset on the ground plane
TextureRotation
 Get texture rotation on the ground plane
TextureScale
 Get texture scale on the ground plane
Top
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace