RhinoCommon API
File3dmMaterialTable Properties
The File3dmMaterialTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns RenderMaterial.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
See Also
Reference
File3dmMaterialTable Class
Rhino.FileIO Namespace