RhinoCommon API
CustomRenderContentAttribute Properties
The CustomRenderContentAttribute type exposes the following members.
Properties
Name | Description
Category
ImageBased
IsBuiltIn
IsElevated
IsHdrCapable
IsLinear
IsNormalMap
IsPrivate
RenderEngineId
Top
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace