RhinoCommon API
NurbsSurfacePointList Properties
The NurbsSurfacePointList type exposes the following members.
Properties
Name | Description
CountU
 Gets the number of control points in the U direction of this surface.
CountV
 Gets the number of control points in the V direction of this surface.
PointSize
 Returns the control point size, or the number of doubles per control point. For rational curves, PointSize = Surface.Dimension + 1. For non-rational curves, PointSize = Surface.Dimension.
Top
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace