RhinoCommon API
GeometryBase Properties
The GeometryBase type exposes the following members.
Properties
Name | Description
HasBrepForm
 Returns true if the Brep.TryConvertBrep function will be successful for this object
IsDeformable
 true if object can be accurately modified with "squishy" transformations like projections, shears, and non-uniform scaling.
IsDocumentControlled
 If true this object may not be modified. Any properties or functions that attempt to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.
 (Overrides CommonObject.IsDocumentControlled.)
IsShallowDuplicate
 Is this instance a 'shallow copy'. Shallow copies are no different than regular instances with the exception that they will convert to complete independent 'deep' copies if a non const operation is perform on the instance (something that mutates the internal data)
ObjectType
 Useful for switch statements that need to differentiate between basic object types like points, curves, surfaces, and so on.
UserStringCount
 Gets the amount of user strings.
Top
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace