RhinoCommon API
PointCloudItem Properties
The PointCloudItem type exposes the following members.
Properties
Name | Description
Color
 Gets or sets the color of this point cloud item. If this point cloud item does not have a color, System.Drawing.Color.Black is returned.
Hidden
 Gets or sets the hidden flag of this point cloud item. If this point cloud item does not have a hidden flag, false is returned.
Index
 Gets the index of this point cloud item.
Location
 Gets or sets the location of this point cloud item.
Normal
 Gets or sets the normal vector for this point cloud item. If this point cloud item does not have a normal vector, Vector3d.Unset is returned.
PointValue
 Gets or set the extra value of this point cloud item. The extra value can be used to store a user-defined value, such as intensity. If this point cloud item does not have an extra value, RhinoMath.UnsetValue is returned.
X
 Gets or sets the X component of this point cloud item location.
Y
 Gets or sets the Y component of this point cloud item location.
Z
 Gets or sets the Z component of this point cloud item location.
Top
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace