RhinoCommon API
CullObjectEventArgs Properties
The CullObjectEventArgs type exposes the following members.
Properties
Name | Description
CullObject
RhinoObject
RhinoObjectSerialNumber
 Gets the rhino object runtime serial number.
Top
See Also
Reference
CullObjectEventArgs Class
Rhino.Display Namespace