RhinoCommon API
File3mfWriteOptions Properties
The File3mfWriteOptions type exposes the following members.
Properties
Name | Description
Copyright
Description
Designer
LicenseTerms
Metadata
MoveOutputToPositiveXYZOctant
Rating
Title
Top
See Also
Reference
File3mfWriteOptions Class
Rhino.FileIO Namespace