RhinoCommon API
Hatch Properties
The Hatch type exposes the following members.
Properties
Name | Description
BasePoint
 Gets or sets the hatch pattern base point
PatternIndex
 Gets or sets the index of the pattern in the document hatch pattern table.
PatternRotation
 Gets or sets the relative rotation of the pattern.
PatternScale
 Gets or sets the scaling factor of the pattern.
Plane
 Gets or sets the hatch plane
Top
See Also
Reference
Hatch Class
Rhino.Geometry Namespace