RhinoCommon API
MeshCurveIntersection Properties
The MeshCurveIntersection type exposes the following members.
Properties
Name | Description
BarycentricA
Barycentric coordinates of PointA wrt the face's triangle.
BarycentricB
Barycentric coordinates of PointB.
BarycentricTolerance
Certified half-width on each barycentric slot.
CurveParameter
Curve parameter range of the hit.
CurveParameterTolerance
Certified half-width on each curve parameter slot.
FaceIndex
Index into Faces of the canonical face that produced this hit (the lowest face index among FaceIndices).
FaceIndices
All mesh faces that share this hit, sorted ascending. For a face-interior hit or a 1-valence mesh boundary edge, contains just FaceIndex. For a hit on a shared mesh edge, contains the 2+ faces meeting at that edge. For a vertex hit, contains every face incident to that vertex.
FaceTriangleIndex
0 for a triangle face; 0 or 1 for the two sub-triangles of a quad face.
Incidence
The kind of mesh feature this hit lies on: face, edge, or vertex.
IsOnTriangleBoundary
True if this hit lies on a mesh-level boundary (Incidence is Edge or Vertex).
IsOverlap
True if this event is a range over which the curve lies in the face's plane.
IsPoint
True if this event is an isolated crossing.
PointA
3D point on the curve at the start of the event.
PointB
3D point on the curve at the end of the event.
PointTolerance
Certified half-width on each 3D point slot.
Top
See Also
Reference
MeshCurveIntersection Class
Rhino.Geometry.Intersect Namespace