RhinoCommon API
DimensionStyle Properties
The DimensionStyle type exposes the following members.
Properties
Name | Description
AlternateBelowLine
AlternateDimensionLengthDisplay
AlternateLengthFactor
AlternateLengthResolution
AlternatePrefix
AlternateRoundoff
AlternateSuffix
AlternateToleranceResolution
AlternateUnitsDisplay
AlternateZeroSuppress
AngleFormat
AngleResolution
AngleZeroSuppress
AngularRoundoff
ArcLengthSymbol
ArrowBlockId1
ArrowBlockId2
ArrowLength
ArrowType1
ArrowType2
BaselineSpacing
CentermarkSize
CenterMarkType
ClippingArrowLength
ClippingArrowType1
ClippingArrowType2
ComponentType
 Returns DimStyle.
 (Overrides ModelComponent.ComponentType.)
DecimalSeparator
DimensionLengthDisplay
DimensionLineExtension
DimensionScale
DimensionScaleValue
DimRadialTextAngleType
DimRadialTextLocation
DimRadialTextOrientation
DimTextAngleType
DimTextLocation
DimTextOrientation
DrawForward
DrawTextMask
ExtensionLineExtension
ExtensionLineOffset
FitArrow
FitText
FixedExtensionLength
FixedExtensionOn
Font
ForceDimensionLineBetweenExtensionLines
HasFieldOverrides
 Checks if any fields in this DimensionStyle are overrides
IsChild
 Tests if this DimensionStyle is a child of any other DimensionStyle
IsDeleted |  (Overrides ModelComponent.IsDeleted.)
IsReference |  (Overrides ModelComponent.IsReference.)
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
LeaderArrowBlockId
LeaderArrowLength
LeaderArrowType
LeaderContentAngleType
 Style of leader content angle Horizontal Aligned Rotated
LeaderCurveType
LeaderHasLanding
LeaderLandingLength
LeaderTextHorizontalAlignment
LeaderTextOrientation
LeaderTextRotationDegrees
LeaderTextRotationRadians
 Angle of leader text for Rotated style
LeaderTextVerticalAlignment
LengthFactor
LengthResolution
LineSpaceScale
MaskColor
MaskColorSource
MaskFrameType
MaskOffset
ParentId
 Get or Set the Id of this DimensionStyle's parent. If ParentId is Guid.Empty, this DimensionStyle has no parent
Prefix
Roundoff
ScaleLeftLengthMillimeters
ScaleRightLengthMillimeters
StackFractionFormat
StackHeightScale
Suffix
SuppressArrow1
SuppressArrow2
SuppressDimensionLine1
 Suppresses the dimension line and arrowhead between the first extension line and the dimension text.
SuppressDimensionLine2
 Suppresses the dimension line and arrowhead between the second extension line and the dimension text.
SuppressExtension1
SuppressExtension2
TextGap
TextHeight
TextHorizontalAlignment
TextMoveLeader
TextOrientation
TextRotation
TextUnderlined
TextVerticalAlignment
ToleranceFormat
ToleranceHeightScale
ToleranceLowerValue
ToleranceResolution
ToleranceUpperValue
ToleranceZeroSuppress
UnitSystem
 The dimension style's own unit system. This is what the style's lengths - text height, arrow size and so on - are expressed in, and openNURBS uses it internally to get scales right when annotation moves between model space, page space and instance definitions whose unit systems differ. A style that reports None has no unit system of its own, and unknown scales resolve to 1.
UseKerning
UserStringCount
 Gets the amount of user strings.
ZeroSuppress
Top
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace