RhinoCommon API
RhinoList<T> Properties
The RhinoList<T> generic type exposes the following members.
Properties
Name | Description
Capacity
 Gets or sets the total number of elements the internal data structure can hold without resizing.
Count
 Gets the number of elements actually contained in the List.
First
 Gets or sets the first item in the list. This is synonymous to calling List[0].
Item
 Gets or sets the element at the specified index.
Last
 Gets or sets the last item in the list. This is synonymous to calling List[Count-1].
NullCount
 Gets the number of null references (Nothing in Visual Basic) in this list. If T is a ValueType, this property always return zero.
Top
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace