RhinoCommon API
SimpleArraySubDPointer Properties
The SimpleArraySubDPointer type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of subds in this array.
Top
See Also
Reference
SimpleArraySubDPointer Class
Rhino.Runtime.InteropWrappers Namespace