RhinoCommon API
MeshDisplayAttributes Properties
The DisplayPipelineAttributes.MeshDisplayAttributes type exposes the following members.
Properties
Name | Description
AllMeshWiresColor
 Color.Empty means that we are NOT using a single color for all mesh wires.
HighlightMeshes
MeshWireThickness
ShowMeshVertices
ShowMeshWires
Top
See Also
Reference
DisplayPipelineAttributes.MeshDisplayAttributes Class
Rhino.Display Namespace