RhinoCommon API
File3dmNotes Properties
The File3dmNotes type exposes the following members.
Properties
Name | Description
IsHtml
 Gets or sets the text format. If the format is HTML, true; false otherwise.
IsVisible
 Gets or sets the notes visibility. If the notes are visible, true; false otherwise.
Notes
 Gets or sets the text content of the notes.
WindowRectangle
 Gets or sets the position of the Notes when they were saved.
Top
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace