RhinoCommon API
PolyCurve Properties
The PolyCurve type exposes the following members.
Properties
Name | Description
HasGap
 This is a quick way to see if the curve has gaps between the sub curve segments.
IsNested
 Gets a value indicating whether or not a PolyCurve contains nested PolyCurves.
SegmentCount
 Gets the number of segments that make up this Polycurve.
Top
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace