RhinoCommon API
ArcCurve Properties
The ArcCurve type exposes the following members.
Properties
Name | Description
AngleDegrees
 Gets the angles of this arc in degrees.
AngleRadians
 Gets the angles of this arc in radians.
Arc
 Gets the arc that is contained within this ArcCurve.
IsCompleteCircle
 Gets a value indicating whether or not this curve can be represented by a complete circle.
Radius
 Gets the radius of this ArcCurve.
Top
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace