RhinoCommon API
FileVdaWriteOptions Properties
The FileVdaWriteOptions type exposes the following members.
Properties
Name | Description
Address
CompanyName
Confidentiality
DateEffective
ObjectCode
PointDeviationHairsAsMDI
ProjectName
ReceivingDepartment
SendersName
SendingCompany
TelephoneNumber
Variant
Top
See Also
Reference
FileVdaWriteOptions Class
Rhino.FileIO Namespace