RhinoCommon API
MeshFaceNormalList Properties
The MeshFaceNormalList type exposes the following members.
Properties
Name | Description
Capacity
 Gets or sets the total number of face normals the internal data structure can hold without resizing.
Count
 Gets or sets the number of mesh face normals.
Item
 Gets or sets the face normal at the given face index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace