RhinoCommon API
LicenseLeaseChangedEventArgs Properties
The LicenseLeaseChangedEventArgs type exposes the following members.
Properties
Name | Description
Lease
 The lease returned by Rhino Accounts server
Top
See Also
Reference
LicenseLeaseChangedEventArgs Class
Rhino.PlugIns Namespace