RhinoCommon API
LinetypeTable Properties
The LinetypeTable type exposes the following members.
Properties
Name | Description
ActiveCount
 Returns number of linetypes in the linetypes table, excluding deleted linetypes.
ByLayerLinetypeName
 Returns the text name of the by-layer linetype.
ByParentLinetypeName
 Returns the text name of the by-parent linetype.
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
ContinuousLinetypeName
 Returns the text name of the continuous linetype.
Count
 Returns number of linetypes in the linetypes table, including deleted linetypes.
CurrentLinetype
 Returns reference to the current linetype. Note that this reference may become invalid after a call to AddLinetype().
CurrentLinetypeIndex
 At all times, there is a "current" linetype. Unless otherwise specified, new objects are assigned to the current linetype. If the current linetype source is LinetypeFromLayer the object's layer's linetype is used instead.
CurrentLinetypeSource
 Source used by an object to determine its current linetype to be used by new objects.
Document
Document that owns this table.
Item
 Conceptually, the linetype table is an array of linetypes. The operator[] can be used to get individual linetypes. A linetype is either active or deleted and this state is reported by Linetype.IsDeleted.
LinetypeScale
 For display in Rhino viewports, the linetypes are scaled by a single scale factor for all viewports. This is not used for printing, where all linetype patterns are scaled to print in their defined size 1:1 on the paper.
Top
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace