RhinoCommon API
CurvatureGraphSettings Properties
The CurvatureGraphSettings type exposes the following members.
Properties
Name | Description
CurveHairColor
 Gets or sets the curve hair color;
HairDensity
 Gets or sets the hair density;
HairScale
 Gets or sets the hair scale;
SampleDensity
 Gets or sets the sampling density;
SrfUHair
 Gets or sets the surface U hairs are on;
SrfVHair
 Gets or sets the surface V hairs are on;
SurfaceUHairColor
 Gets or sets the surface U hair color;
SurfaceVHairColor
 Gets or sets the surface V hair color;
Top
See Also
Reference
CurvatureGraphSettings Class
Rhino.ApplicationSettings Namespace