RhinoCommon API
CreateTexture2dPreviewEventArgs Properties
The CreateTexture2dPreviewEventArgs type exposes the following members.
Properties
Name | Description
PreviewImage
 Initially null. If this image is set, then this image will be used for the preview. If never set, the default internal simulation preview will be used.
PreviewImageSize
 Pixel size of the image that is being requested for the preview scene
Top
See Also
Reference
CreateTexture2dPreviewEventArgs Class
Rhino.Render Namespace