RhinoCommon API
Arrowhead Properties
The Arrowhead type exposes the following members.
Properties
Name | Description
ArrowType
 Type of arrowhead used by annotation
BlockId
 Id of block used for user-defined arrowhead
Top
See Also
Reference
Arrowhead Class
Rhino.Geometry Namespace