RhinoCommon API
BrepFaceList Properties
The BrepFaceList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of brep faces.
HasPerFaceColors
 True if one or more faces on the active level have per face color overrides.
Item
 Gets the BrepFace at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace