RhinoCommon API
Leader Properties
The Leader type exposes the following members.
Properties
Name | Description
Curve
 Gets the curve used by this leader
LeaderArrowBlockId
 Id of the block used as the arrow for the leader when the arrow type is 'User arrow'
LeaderArrowSize
 The size of the leader arrow
LeaderArrowType
 The arrowhead type for the leader
LeaderContentAngleStyle
 Angle for text of leader text
LeaderCurveStyle
 The style of the leader curve: polyline or spline
LeaderHasLanding
 Returns true if the leader has a landing line
LeaderLandingLength
 Gets or sets the length of the landing line
LeaderTextHorizontalAlignment
 Gets or sets the horizontal alignment of the leader's text
LeaderTextVerticalAlignment
 Gets or sets the vertical alignment of the leader's text
Points2D
 Get or set the 2d points defining the curve used by this leader
Points3D
 Get or set the 3d points defining the curve used by this leader
Top
See Also
Reference
Leader Class
Rhino.Geometry Namespace