RhinoCommon API
ColorRGBA Properties
The ColorRGBA type exposes the following members.
Properties
Name | Description
A
 Gets or sets the alpha channel value. Alpha channels are limited to a 0~1 range.
B
 Gets or sets the blue channel value. Blue channels are limited to a 0~1 range.
Black
Blue
G
 Gets or sets the green channel value. Green channels are limited to a 0~1 range.
Green
R
 Gets or sets the red channel value. Red channels are limited to a 0~1 range.
Red
White
Top
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace