RhinoCommon API
UserDataList Properties
The UserDataList type exposes the following members.
Properties
Name | Description
Count
Number of UserData objects in this list.
Item
 Retrieve through indexer. Read-only access.
Top
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace