RhinoCommon API
DisplayRenderSettings Properties
The DisplayRenderSettings type exposes the following members.
Properties
Name | Description
CullBackFaces
 True if backfaces should be culled
ForceFlatShading
 True if flat shading is forced
SceneLightingOn
 True if scene lighting is enabled
Top
See Also
Reference
DisplayRenderSettings Class
Rhino.Render.ChangeQueue Namespace