RhinoCommon API
AddCustomUISectionsEventArgs Properties
The AddCustomUISectionsEventArgs type exposes the following members.
Properties
Name | Description
EventType
 The type of the event.
ExpandableContentUI
Top
See Also
Reference
AddCustomUISectionsEventArgs Class
Rhino.Render Namespace