RhinoCommon API
SectionStyle Properties
The SectionStyle type exposes the following members.
Properties
Name | Description
BackgroundFillColor
 Fill color to apply to the background. Default is Color.Empty which means get the color from the source where this section style came from (object attributes or layer)
BackgroundFillMode
 How the background should be filled
BackgroundFillPrintColor
 Fill print color to apply to the background. Default is Color.Empty which means get the color from the source where this section style came from (object attributes or layer)
BoundaryColor
 Color to apply for the boundary curves. Default is Color.Empty which means get the color from the source where this section style came from (object attributes or layer)
BoundaryLinetypeIndex
BoundaryPlotWeightMillimeters
 Plot width of the boundary curves. values less than -1 (-10 is default): plot weight is determined by the object's attributes -1: do not plot 0: use default weight defined by the print dialog positive values are thicknesses in millimeters to print to NOTE: if a linetype is assigned to this section style that has a physical width (not pixels), then this value is ignored and the linetype value is used
BoundaryPrintColor
 Print color to apply for the boundary curves. Default is Color.Empty which means get the color from the source where this section style came from (object attributes or layer)
BoundaryVisible
 Should the boundary for this section be displayed
BoundaryWidthScale
 Scale applied to the boundary wire thickness
ComponentType
 Returns SectionStyle.
 (Overrides ModelComponent.ComponentType.)
HatchIndex
 Hatch pattern to use when drawing a fill pattern
HatchPatternColor
 Color to apply for the hatch pattern. Default is Color.Empty which means get the color from the source where this section style came from (object attributes or layer)
HatchPatternPlotWeightMillimeters
 Plot width of the hatch pattern curves. values less than -1 (-10 is default): plot weight is determined by the object's attributes -1: do not plot 0: use default weight defined by the print dialog positive values are thicknesses in millimeters to print to
HatchPatternPrintColor
 Print color to apply for the hatch pattern. Default is Color.Empty which means get the color from the source where this section style came from (object attributes or layer)
HatchRotationRadians
 Rotation to apply to the hatch patterh
HatchScale
 Scale to apply to the hatch pattern
InUse
 Returns true if a section style is use by an object, layer, or instance definition.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
IsUnset
 Returns true if the section style is unset.
SectionFillRule
 Rule to determine when to generate a hatch pattern and fill
Top
See Also
Reference
SectionStyle Class
Rhino.DocObjects Namespace