RhinoCommon API
AnnotationBase Properties
The AnnotationBase type exposes the following members.
Properties
Name | Description
AlternateDimensionLengthDisplay
 Alternate length display units and format
AnnotationType
 Type of annotation
DecimalSeparator
 Set or get the decimal separator c
DimensionLengthDisplay
 Length display units and format
DimensionScale
 Gets or sets the dimension scale
DimensionStyle
 If there are no overrides then the parent style is returned otherwise the dimension style saved with the annotation is returned.
DimensionStyleId
 Id of this annotation's parent dimstyle If this annotation has overrides to dimstyle properties, those overrides will be represented in the DimensionStyle returned by DimensionStyle(ParentStyle)
DrawForward
 Gets or sets whether the text is oriented towards the reader when viewed from behind
DrawTextFrame |  Obsolete.
 Gets or sets whether to draw a frame around a text mask
FirstCharFont
 Returns the font used by the first run of text in an annotation
Font
 The base Font for the text of the annotation. The text string is rich text and therefore a different font that the base font can be associated with sub strings of the text
FormatWidth
 Text format width (Wrapping rectangle)
HasPropertyOverrides
LineSpaceScale
 Scale applied to line spacing
MaskColor
 Color to use for drawing a text mask when it is enabled. If the mask is enabled and MaskColor is System.Drawing.Color.Transparent, then the viewport's color will be used for the MaskColor
MaskColorSource
 Gets or sets whether the mask background color is from the background or from a color
MaskEnabled
 Determines whether or not to draw a Text Mask
MaskFrame
 Gets or sets whether to draw a frame around a text mask
MaskOffset
 Offset for the border around text of the rectangle used to draw the mask. This value multiplied by TextHeight is the offset on each side of the tight rectangle around the text characters to the mask rectangle. The default value is 0.1.
MaskUsesViewportColor
 If true, the viewport's color is used for the mask color. If false, the color defined by MaskColor is used
ParentDimensionStyle
 The parent dimension style associated with this annotation
PlainText
 Text stripped of RTF formatting information
PlainTextWithFields
 Text stripped of RTF formatting information and with field expressions intact
Plane
 Plane that this annotation lies on
RichText
 Text including additional RTF formatting information
Text |  Obsolete.
 Text including additional RTF formatting information
TextFormula |  Obsolete.
 See RichText
TextHasRtfFormatting
 Gets a value indicating whether the annotation's text is formatted as RTF (Rich Text Format). Returns true if the text begins with an RTF header; otherwise, false.
TextHeight
 AnnotationBase.TextHeight Gets the parent dimstyle for the annotation and gets or sets the text height in the dimstyle
TextIsWrapped
 Is text wrapping on
TextModelWidth
 Width of text in the model
TextRotationDegrees
 Rotation of text in degrees
TextRotationRadians
 Rotation of text in radians
UseKerning
 Use kerning data in font to set distances between glyphs
Top
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace