RhinoCommon API
IntField Properties
The IntField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
IntField Class
Rhino.Render.Fields Namespace