RhinoCommon API
WorksessionFileModel Properties
The WorksessionFileModel type exposes the following members.
Properties
Name | Description
FullPath
 Gets or sets the full path of the model file, as saved. Nothing checks that it exists.
IsActive
 Gets or sets whether this is the model that was active when the worksession was saved. Every other model is a reference model.
LayerOverrideCount
 Gets the number of layer overrides. Rhino does not save or use layer overrides for the active model. Version 4 files do not have them.
RelativePath
 Gets or sets the path of the model file relative to the .rws file, as saved. Rhino uses it when the file is no longer at FullPath. It can be empty. Version 4 files do not have it.
Top
See Also
Reference
WorksessionFileModel Class
Rhino.FileIO Namespace