RhinoCommon API
UserInterfaceGrid Properties
The UserInterfaceGrid type exposes the following members.
Properties
Name | Description
BackgroundClaimsMouse
 Whether a click where the grid has no child control belongs to the grid or to whatever is behind it. The default is false, so clicks on the padding, on the gaps between cells and on empty cells go through to the viewport, which is what a heads up display over a model wants.
BackgroundOpacity
 How opaque the background is, from 0 (not drawn at all) to 1 (solid, the default). Leave BackgroundColor as Color.Empty and the grid uses the theme's panel color at this opacity, which gives a see through panel over the model that still follows the theme. A BackgroundColor that was set is drawn at this opacity on top of its own alpha. The border is not affected.
BorderColor
BorderThickness
ChildCount
 Number of cells that have been filled, including the empty ones added with AddEmptyCell. This is not the same as ColumnCount * RowCount.
ColumnCount
 Number of columns in the grid. The default is 1. Changing the column count reflows the children that have already been added.
ColumnSpacing
 Space between columns in logical pixels. The default is 6.
CornerRadius
RowCount
 Number of rows the current children occupy, computed from the child count, the column count and any column spans.
RowHeight
 Height of every row in logical pixels. The default is 0, which means each row is as tall as the tallest control in it.
RowSeparatorColor
RowSeparators
 Draw a horizontal line between every pair of rows. Off by default.
RowSpacing
 Space between rows in logical pixels. The default is 2.
Top
See Also
Reference
UserInterfaceGrid Class
Rhino.UI Namespace