RhinoCommon API
FileWriteOptions Properties
The FileWriteOptions type exposes the following members.
Properties
Name | Description
AllowUserInterfaceWithHeadlessDocument
 If true, file writing plug-ins may show user interface (a dialog when SuppressDialogBoxes is false, command line getters when it is true) even though the document being written is headless.
BackupFileFolder
 For use on Apple frameworks only. Returns the final destination file name.
CreateBackupFiles
CreateOtherBackupFiles
DestinationFileName
 For use on Apple frameworks only. Returns the final destination file name.
FileTypeId
 Returns nil for a Rhino .3dm file or the GUID of the plugin that wrote the file
FileTypeIndex
 Returns the FileTypeIndex that identifies the extension the file writing plugin will create.
FileTypeIs3dm
 True if the file time is some version of a Rhino 3dm file.
FileTypeIsComplete3dm
 True if the the file type is the current 3dm file version and everything in the document will be saved.
FileVersion
IncludeBitmapTable
 The file written should include the bitmap table if your File Writing Plug-in supports it.
IncludeHistory
 The file written should include history information if your File Writing Plug-In supports it.
IncludePreviewImage
 The file written should include a preview image if your File Writing Plug-in supports it.
IncludeRenderMeshes
 The file written should include the render meshes if your File Writing Plug-in supports it.
OptionsDictionary
 Additional read options.
Rhino3dmVersion
 Returns the version of the saved Rhino file 0: The file type is non-3dm file identified by FileTypeId() and FileTypeIndex(). >= 2: The file type is a 3dm file and the number specifies the earliest version of Rhino that will be able to read the 3dm file.
RhinoDoc
Source RhinoDoc that is being written
SuppressAllInput
SuppressDialogBoxes
 If true, it means the command has been run with a '-', meaning you should not ask questions during writing. (no dialogs, no "getters", etc.)
UpdateDocumentPath
 If a complete, current version, 3dm file is successfully saved, then the name of the file will be used to update the document's default file path and title and document will be marked as not modified.
UseCompression
WriteAsTemplate
 Write as template
WriteGeometryOnly
 If true, the file written should include only geometry File Writing Plug-in supports it.
WriteSelectedObjectsOnly
 If true, this command should export only the objects currently selected in the Rhino model.
WriteUserData
 If true, the file written should include User Data if your File Writing Plug-in supports it.
Xform
Top
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace