RhinoCommon API
HiddenLineDrawingObject Properties
The HiddenLineDrawingObject type exposes the following members.
Properties
Name | Description
Geometry
 Returns the geometry in world coordinates if UseXform is false. Otherwise, the geometry in object space coordinates is returned.
OccludingSections
 Objects in this drawing could have occluding sections. Objects must added with the occluding section option set as desired.
Tag
 Returns the extra data used to cross-reference the object specified in HiddenLineDrawing.AddObject.
Transform
 Returns the transformation passed into the Add... function when setting up the hidden line drawing parameters.
Top
See Also
Reference
HiddenLineDrawingObject Class
Rhino.Geometry Namespace