RhinoCommon API
ReplayHistoryData Properties
The ReplayHistoryData type exposes the following members.
Properties
Name | Description
Document
The document this record belongs to
HistoryVersion
 ReplayHistory overrides check the version number to ensure the information saved in the history record is compatible with the current implementation of ReplayHistory
RecordId
 Each history record has a unique id that Rhino assigns when it adds the history record to the history record table
Results
 Provides access to BOTH inputs and outputs of the replay history operation.
Use this property to then call an appropriate UpdateToX() method and make your custom history support work.
Top
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace