RhinoCommon API
CloudHostUtils Properties
The CloudHostUtils type exposes the following members.
Properties
Name | Description
DenyReason
Human-readable reason the entitlement was actively denied. Null both when entitled AND when the gate doesn't apply to this instance.
IsEntitled
True when the running instance is entitled by its cloud provider. See ICloudHost remarks for tri-state semantics.
Signature
Signed proof of entitlement returned by the cloud provider (null when not applicable).
Top
See Also
Reference
CloudHostUtils Class
Rhino.Runtime Namespace