RhinoCommon API
MeshExtruder Properties
The MeshExtruder type exposes the following members.
Properties
Name | Description
EdgeBasedUVN
 Edge based UVN defines UVN directions according to boundary edge directions
FaceDirectionMode
 Face direction mode determines how faces are oriented
KeepOriginalFaces
 Whether or not to keep original faces.
PreviewLines
 Gets Line objects to preview extruded mesh.
SurfaceParameterMode
 Mode for creating surface parameters for extruded areas
TextureCoordinateMode
 Mode for creating texture coordinates for extruded areas
Transform
 Transform of extrusion
UVN
 Whether or not to perform extrude in UVN basis.
Top
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace