RhinoCommon API
ViewportInfo Properties
The ViewportInfo type exposes the following members.
Properties
Name | Description
Camera35mmLensLength
 This property assumes the camera is horizontal and crop the film rather than the image when the aspect of the frustum is not 36/24. (35mm film is 36mm wide and 24mm high.) Setting preserves camera location, changes the frustum, but maintains the frustum's aspect.
CameraAngle
 Gets or sets the 1/2 of smallest subtended view angle. See GetCameraAngles(Double, Double, Double) for more information.
CameraDirection
 Gets the direction that the camera faces.
CameraLocation
 Gets the camera location (position) point.
CameraUp
 Gets the camera up vector.
CameraX
 Gets the unit "to the right" vector.
CameraY
 Gets the unit "up" vector.
CameraZ
 Gets the unit vector in -CameraDirection.
DefaultCameraDirection
 Default z=up perspective camera direction
FrustumAspect
 Setting FrustumAspect changes the larger of the frustum's width/height so that the resulting value of width/height matches the requested aspect. The camera angle is not changed. If you change the shape of the view port with a call SetScreenPort(), then you generally want to call SetFrustumAspect() with the value returned by GetScreenPortAspect().
FrustumBottom
 Gets the frustum bottom value. This is -top if the frustum has a horizontal symmetry axis.
This number is usually negative.
FrustumBottomPlane
 Gets the frustum bottom plane that separates visible from off-screen.
FrustumCenter
 Gets the frustum center point.
FrustumFar
 Gets the frustum far-cutting value.
FrustumFarPlane
 Gets far clipping plane if camera and frustum are valid. The plane's frame is the same as the camera's frame. The origin is located at the intersection of the camera direction ray and the far clipping plane. The plane's normal points into the frustum towards the camera location.
FrustumHeight
 Gets the frustum height. This is FrustumTop - FrustumBottom.
FrustumLeft
 Gets the frustum left value. This is -right if the frustum has a vertical symmetry axis.
This number is usually negative.
FrustumLeftPlane
 Gets the frustum left plane that separates visible from off-screen.
FrustumMaximumDiameter
 Gets the frustum maximum diameter, or the maximum between FrustumWidth and FrustumHeight.
FrustumMinimumDiameter
 Gets the frustum minimum diameter, or the minimum between FrustumWidth and FrustumHeight.
FrustumNear
 Gets the frustum near-cutting value.
FrustumNearPlane
 Gets near clipping plane if camera and frustum are valid. The plane's frame is the same as the camera's frame. The origin is located at the intersection of the camera direction ray and the near clipping plane. The plane's normal points out of the frustum towards the camera location.
FrustumRight
 Gets the frustum right value. This is -left if the frustum has a vertical symmetry axis.
This number is usually positive.
FrustumRightPlane
 Gets the frustum right plane that separates visible from off-screen.
FrustumTop
 Gets the frustum top value. This is -bottom if the frustum has a horizontal symmetry axis.
This number is usually positive.
FrustumTopPlane
 Gets the frustum top plane that separates visible from off-screen.
FrustumWidth
 Gets the frustum width. This is FrustumRight - FrustumLeft.
Id
 Sets the viewport's id to the value used to uniquely identify this viewport. There is no approved way to change the viewport id once it is set in order to maintain consistency across multiple viewports and those routines that manage them.
IsCameraDirectionLocked
 Gets or sets a value that indicates whether the direction that the camera faces is unmodifiable.
IsCameraLocationLocked
 Gets or sets a value that indicates whether the camera location is unmodifiable.
IsCameraUpLocked
 Gets or sets a value that indicates whether the camera up vector is unmodifiable.
IsFrustumLeftRightSymmetric
 Gets or sets a value that indicates whether the camera frustum has a vertical symmetry axis.
IsFrustumTopBottomSymmetric
 Gets or sets a value that indicates whether the camera frustum has a horizontal symmetry axis.
IsParallelProjection
 Get or set whether this projection is parallel.
IsPerspectiveProjection
 Get or set whether this projection is perspective.
IsTwoPointPerspectiveProjection
 Gets a value that indicates whether this projection is a two-point perspective.
IsValidCamera
 Gets a value that indicates whether the camera is valid.
IsValidFrustum
 Gets a value that indicates whether the frustum is valid.
PerspectiveMinNearDist
 Expert user function to control the minimum value of near when perspective projections are being used.
PerspectiveMinNearOverFar
 Expert user function to control the minimum ratio of near/far when perspective projections are begin used.
ScreenPort
 Get or set the screen port. SetScreenPort(Rectangle) and
ScreenPortAspect
 Gets the screen aspect ratio.
This is width / height.
TargetPoint
 The current value of the target point. This point does not play a role in the view projection calculations. It can be used as a fixed point when changing the camera so the visible regions of the before and after frustums both contain the region of interest. The default constructor sets this point on ON_3dPoint::UnsetPoint. You must explicitly call one SetTargetPoint() functions to set the target point.
ViewScale
 Applies scaling factors to parallel projection clipping coordinates by setting the m_clip_mod transformation. If you want to compress the view projection across the viewing plane, then set x = 0.5, y = 1.0, and z = 1.0.
Top
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace