RhinoCommon API
IsoDrawEffect Properties
The IsoDrawEffect type exposes the following members.
Properties
Name | Description
Direction
DiscardGap
DrawMode
Falloff
Frequency
GapColor
GapSize
Point
RotationRadians
UsedBandColorCount
Top
See Also
Reference
IsoDrawEffect Class
Rhino.Display Namespace