RhinoCommon API
FileRawReadOptions Properties
The FileRawReadOptions type exposes the following members.
Properties
Name | Description
RawModelUnits
Top
See Also
Reference
FileRawReadOptions Class
Rhino.FileIO Namespace