RhinoCommon API
SimpleArrayInterval Properties
The SimpleArrayInterval type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of elements in this array.
Top
See Also
Reference
SimpleArrayInterval Class
Rhino.Runtime.InteropWrappers Namespace