RhinoCommon API
File3dmHatchPatternTable Properties
The File3dmHatchPatternTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns HatchPattern.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
See Also
Reference
File3dmHatchPatternTable Class
Rhino.FileIO Namespace