RhinoCommon API
HermiteSurface Properties
The HermiteSurface type exposes the following members.
Properties
Name | Description
IsValid
 Returns true if the all of values in all of the internal data structures contain valid values, false otherwise.
UCount
 Gets the number of parameters in the "u" direction.
VCount
 Gets the number of parameters in the "v" direction.
Top
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace