RhinoCommon API
File3dmThickening Properties
The File3dmThickening type exposes the following members.
Properties
Name | Description
BothSides
 Specifies whether to thicken to both sides of the surface.
Distance
 Specifies how thick meshes will be made.
OffsetOnly
 Specifies whether to only offset the original surface.
On
 Specifies whether the feature is enabled or not.
Solid
 Specifies whether to make open meshes solid by adding walls when thickening.
Top
See Also
Reference
File3dmThickening Class
Rhino.FileIO Namespace