RhinoCommon API
NurbsCurvePointList Properties
The NurbsCurvePointList type exposes the following members.
Properties
Name | Description
ControlPolygonLength
 Gets the length of the polyline connecting all control points.
Count
 Gets the number of control points in this curve.
Item
 Gets or sets the control point location at the given index.
PointSize
 Returns the control point size, or the number of doubles per control point. For rational curves, PointSize = Curve.Dimension + 1. For non-rational curves, PointSize = Curve.Dimension.
Top
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace