RhinoCommon API
HiddenLineDrawingParameters Properties
The HiddenLineDrawingParameters type exposes the following members.
Properties
Name | Description
AbsoluteTolerance
 Absolute tolerance is used to decide if curves overlap or intersect. A suggested value is to use RhinoDoc.AbsoluteTolerance
Flatten
 Flatten the computed geometry
IncludeHiddenCurves
 Include hidden curves in hidden line drawing (default is true)
IncludeTangentEdges
 Include tangent edges in hidden line drawing (default is true)
IncludeTangentSeams
 Include tangent seams in hidden line drawing (default is true)
OccludingSectionOption
 Enable occluding section option (default is false)
Top
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace