RhinoCommon API
CursorTooltipSettingsState Properties
The CursorTooltipSettingsState type exposes the following members.
Properties
Name | Description
AutoSuppress
 Attempts to display only the most useful tooltip.
BackgroundColor
Tooltip background color.
CommandPromptPane
 Displays the current command prompt.
DistancePane
 Displays the distance from the last picked point.
EnableGumballToolTips
 Turns on/off gumball tooltips
Offset
 The x and y distances in pixels from the cursor location to the tooltip.
OsnapPane
 Displays the current object snap selection.
PointPane
 Displays the current construction plane coordinates.
RelativePointPane
 Displays the relative construction plane coordinates and angle from the last picked point.
TextColor
Tooltip text color.
TooltipsEnabled
Turns on/off cursor tooltips.
Top
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace