RhinoCommon API
Thumbnail Properties
The Thumbnail type exposes the following members.
Properties
Name | Description
CppPointer
 Thumbnail c++ pointer
Top
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace