RhinoCommon API
File3dmEdgeSoftening Properties
The File3dmEdgeSoftening type exposes the following members.
Properties
Name | Description
Chamfer
 Specifies whether to chamfer the edges.
EdgeAngleThreshold
 Threshold angle (in degrees) which controls whether an edge is softened or not. The angle refers to the angles between the adjacent faces of an edge.
Faceted
 Specifies whether the edges are faceted.
ForceSoftening
 Specifies whether to soften edges despite too large a radius.
On
 Specifies whether edge softening is enabled or not.
Softening
 The softening radius.
Top
See Also
Reference
File3dmEdgeSoftening Class
Rhino.FileIO Namespace