RhinoCommon API
CommandLineOption Properties
The CommandLineOption type exposes the following members.
Properties
Name | Description
CurrentListOptionIndex
CurrentNumericValue
CurrentToggleValue
EnglishName
 The English command option name
Index
LocalName
 The localized command option name
OptionType
 The type of this command line option
StringOptionValue
 Assigned by RhinoGet.Get if an option value is specified in a script or by a command window control.
Top
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace