RhinoCommon API
SimpleArrayMeshFace Properties
The SimpleArrayMeshFace type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of mesh faces in this array.
Top
See Also
Reference
SimpleArrayMeshFace Class
Rhino.Runtime.InteropWrappers Namespace