RhinoCommon API
BitmapTable Properties
The BitmapTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns Image.
 (Overrides CommonComponentTable<T>.ComponentType.)
Item
 Conceptually, the bitmap table is an array of bitmaps. The operator[] can be used to get individual bitmaps.
Top
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace