RhinoCommon API
RhinoAccountsGroup Properties
The RhinoAccountsGroup type exposes the following members.
Properties
Name | Description
Id
 The id of the group. The id is unique to a group within Rhino Accounts.
Name
 The name of the group. The name can be changed at anytime by group members.
Top
See Also
Reference
RhinoAccountsGroup Class
Rhino.Runtime.RhinoAccounts Namespace