RhinoCommon API
GetPolyline Properties
The GetPolyline type exposes the following members.
Properties
Name | Description
FirstPointPrompt
Prompt when getting first point
FourthPointPrompt
Prompt when getting fourth point
MaxPointCount
MinPointCount
SecondPointPrompt
Prompt when getting second point
ThirdPointPrompt
Prompt when getting third point
Top
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace