RhinoCommon API
PageViewPropertiesChangeEventArgs Properties
The PageViewPropertiesChangeEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the Rhino document.
DocumentSerialNumber
 The serial number of the Rhino document.
PageView
 Gets the Rhino page view.
PageViewSerialNumber
 The serial number of the page view.
Top
See Also
Reference
PageViewPropertiesChangeEventArgs Class
Rhino.Display Namespace