RhinoCommon API
Mesh Properties
The Mesh type exposes the following members.
Properties
Name | Description
ComponentStates
 Gets access to the vertex hidden/visibility collection in this mesh. This is a runtime property and it is not saved in the 3dm file.
DisjointMeshCount
 Gets the number of disjoint (topologically unconnected) pieces in this mesh.
FaceNormals
 Gets access to the face normal collection in this mesh.
Faces
 Gets access to the mesh face list.
HasCachedTextureCoordinates
 Will return true if SetCachedTextureCoordinates has been called; otherwise will return false.
HasPrincipalCurvatures
 HasPrincipalCurvatures
IsClosed
 Returns true if every mesh "edge" has two or more faces.
IsOriented
 Returns true if the mesh is manifold and every pair of faces that share an "edge" have compatible orientations.
IsSolid
 Returns true if the mesh is solid. A "solid" is a closed oriented manifold.
Ngons
 Gets access to the mesh ngon list.
Ngons represent groups of Faces (triangles + quads).
Faces are used to tessellate an Ngon internally.
When a triangle or quad is referenced in the Ngon list, it is no longer visualized and conceived as a single entity, but takes part of the Ngon.
If you need to get access to both Ngons and the faces that are not referenced by Ngons, that is, all polygons that are visible in the mesh, then use the GetNgonAndFacesEnumerable() helper method.
Normals
 Gets access to the vertex normal collection in this mesh.
PartitionCount
 Number of partition information chunks stored on this mesh based on the last call to CreatePartitions
PrincipalCurvatures
 Gets access to the (optional) principal curvatures list in this mesh. Principal curvatures are found on analysis meshes, not render meshes.
TextureCoordinates
 Gets access to the vertex texture coordinate collection in this mesh.
TopologyEdges
 Gets the MeshTopologyEdgeList object associated with this mesh.
This object stores edge connectivity.
TopologyVertices
 Gets the MeshTopologyVertexList object associated with this mesh.
This object stores vertex connectivity and the indices of vertices that were unified while computing the edge topology.
VertexColors
 Gets access to the (optional) vertex color collection in this mesh.
Vertices
 Gets access to the vertices set of this mesh.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace