RhinoCommon API
FileSkpWriteOptions Properties
The FileSkpWriteOptions type exposes the following members.
Properties
Name | Description
ExportPlanarRegionsAsPolygons
GroupObjects
MaxAngle
Version
 Set the version of the skp file being written.
Top
See Also
Reference
FileSkpWriteOptions Class
Rhino.FileIO Namespace