RhinoCommon API
EarthAnchorPoint Properties
The EarthAnchorPoint type exposes the following members.
Properties
Name | Description
Description
 Gets or sets the long form of the identifying information about this location.
EarthBasepointElevation
 Gets or sets the point elevation on earth, in meters.
EarthBasepointElevationCoordinateSystem
 Gets or sets a value indicating the zero level convention relating to a location on Earth.
EarthBasepointLatitude
 Gets or sets a point latitude on earth, in degrees. +90 = north pole, 0 = equator, -90 = south pole.
EarthBasepointLongitude
 Gets or sets the point longitude on earth, in degrees.
KMLOrientationHeadingAngleDegrees
 Gets Keyhole Markup Language (KML) orientation heading angle in degrees.
KMLOrientationHeadingAngleRadians
 Gets Keyhole Markup Language (KML) orientation heading angle in radians.
KMLOrientationRollAngleDegrees
 Gets Keyhole Markup Language (KML) orientation roll angle in degrees.
KMLOrientationRollAngleRadians
 Gets Keyhole Markup Language (KML) orientation roll angle in degrees.
KMLOrientationTiltAngleDegrees
 Gets Keyhole Markup Language (KML) orientation tilt angle in degrees.
KMLOrientationTiltAngleRadians
 Gets Keyhole Markup Language (KML) orientation tilt angle in degrees.
ModelBasePoint
Corresponding model point in model coordinates.
ModelEast
Earth directions in model coordinates.
ModelNorth
Earth directions in model coordinates.
Name
 Gets or sets the short form of the identifying information about this location.
Top
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace