RhinoCommon API
PersistentSettingsSavedEventArgs Properties
The PersistentSettingsSavedEventArgs type exposes the following members.
Properties
Name | Description
PlugInSettings
 The old PlugIn settings
SavedByThisRhino
 Will be true if this instance of Rhino is writing the settings file or false if a different instance of Rhino has modified the settings file.
Top
See Also
Reference
PersistentSettingsSavedEventArgs Class
Rhino Namespace