RhinoCommon API
ViewDisplayAttributes Properties
The DisplayPipelineAttributes.ViewDisplayAttributes type exposes the following members.
Properties
Name | Description
BlendGrid
DrawGrid
DrawGridAxes
DrawTransparentGridPlane
DrawWorldAxes
DrawZAxis
GridBoundaryThickness
 The thickness of the grid boundary.
GridCornerRadius
 The radius used to round the corners of the grid.
GridFade
 The amount the grid fades out towards its edges, from 0.0 (no fade) to 1.0 (full fade).
HorizontalViewportScale
ShowGridOnTop
UseDocumentGrid
VerticalViewportScale
WorldAxisColorX
WorldAxisColorY
WorldAxisColorZ
Top
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace