RhinoCommon API
DisplayPipeline Properties
The DisplayPipeline type exposes the following members.
Properties
Name | Description
ActiveObject
ActiveObjectNestingLevel
ActiveObjectNestingStack
ActiveTopLevelObject
DefaultCurveThickness
 Gets the curve thickness as defined by the current display mode. Note: this only applies to curve objects, Brep and Mesh wires may have different settings.
DepthMode
DisplayPipelineAttributes
DpiScale
 Scale factor used for high resolution displays. When a monitor that this pipeline is drawing to is at a DPI of 96, this value is one. On high DPI monitors, this value will commonly be greater than one.
DrawingGrips
 Gets a value that indicates whether the pipeline is currently in a grip drawing operation.
DrawingSurfaces
 Gets a value that indicates whether the pipeline is currently in a surface drawing operation. Surface drawing means draw the shaded triangles of a mesh representing the surface (mesh, extrusion, or brep). This is useful when inside of a draw event or display conduit to check and see if the geometry is about to be drawn as a shaded set of triangles representing the geometry. See DrawingWires to check and see if the wireframe representation of the geometry is going to be drawn.
DrawingWires
 Gets a value that indicates whether the pipeline is currently in a curve drawing operation. This is useful when inside of a draw event or display conduit to check and see if the geometry is about to be drawn is going to be drawing the wire representation of the geometry (mesh, extrusion, or brep). See DrawingSurfaces to check and see if the shaded mesh representation of the geometry is going to be drawn.
FrameBuffer
 Gets the contents of the frame buffer that this pipeline is drawing to.
FrameSize
 Gets the size of the frame buffer that this pipeline is drawing to.
IsDynamicDisplay
 Gets a value that indicates whether the viewport is in Dynamic Display state. Dynamic display is the state a viewport is in when it is rapidly redrawing because of an operation like panning or rotating. The pipeline will drop some level of detail while inside a dynamic display state to keep the frame rate as high as possible.
IsInViewCapture
 Gets a value that indicates whether this pipeline is currently drawing for ViewCaptureToFile or ViewCaptureToClipboard
IsOpen
 Is true of the pipeline is open, false otherwise.
IsOpenGL
 Gets a value indicating whether or not this pipeline is drawing into an OpenGL context.
IsPrinting
 Gets a value that indicates whether this pipeline is currently drawing for printing purposes.
IsStereoMode
 Gets a value that indicates whether this pipeline is currently using an engine that is performing stereo style drawing. Stereo drawing is for providing an "enhanced 3-D" effect through stereo viewing devices.
ModelTransform
 Gets or sets the current model transformation that is applied to vertices when drawing.
ModelTransformIsIdentity
 Gets a value that indicates whether the Model Transform is an Identity transformation.
NestLevel
 Gets the current nested viewport drawing level. This is used to know if you are currently inside the drawing of a nested viewport (detail object in Rhino).
Nest level = 0 Drawing is occurring in a standard Rhino viewport or on the page viewport.
Nest level = 1 Drawing is occurring inside a detail view object.
RenderPass
 Gets the current pass that the pipeline is in for drawing a frame. Typically drawing a frame requires a single pass through the DrawFrameBuffer function, but some special display effects can be achieved through drawing with multiple passes.
ShadingRequired
 Gets or sets the "ShadingRequired" flag. This flag gets set inside the pipeline when a request is made to draw a shaded mesh but the current render engine doesn't support shaded mesh drawing...at this point the redraw mechanism will make sure everything will work the next time around.
StereoProjection
 Gets the current stereo projection if stereo mode is on.
0 = left
1 = right
 If stereo mode is not enables, this property always returns 0.
SupportsShading
 Gets whether or not this pipeline supports shaded meshes.
Technology
 Get the GPU technology that this pipeline is actively using
Viewport
ZBiasMode
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace