RhinoCommon API
FileStlWriteOptions Properties
The FileStlWriteOptions type exposes the following members.
Properties
Name | Description
BinaryFile
ExportOpenObjects
MeshingParameters
Top
See Also
Reference
FileStlWriteOptions Class
Rhino.FileIO Namespace