RhinoCommon API
LightManagerSupportClient Properties
The LightManagerSupportClient type exposes the following members.
Properties
Name | Description
CppPointer
Top
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace