RhinoCommon API
SimpleArrayGeometryPointer Properties
The SimpleArrayGeometryPointer type exposes the following members.
Properties
Name | Description
Count
 Get the number of elements in the array
Top
See Also
Reference
SimpleArrayGeometryPointer Class
Rhino.Runtime.InteropWrappers Namespace