RhinoCommon API
ZAccess Properties
The Point3dList.ZAccess type exposes the following members.
Properties
Name | Description
Item
 Gets or sets the z-coordinate of the specified point.
Top
See Also
Reference
Point3dList.ZAccess Class
Rhino.Collections Namespace