RhinoCommon API
StringTable Properties
The StringTable type exposes the following members.
Properties
Name | Description
Count
 The number of user data strings in the current document.
Document
Document that owns this object table.
DocumentDataCount
DocumentUserTextCount
Top
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace