RhinoCommon API
YAccess Properties
The Point3dList.YAccess type exposes the following members.
Properties
Name | Description
Item
 Gets or sets the y-coordinate of the specified point.
Top
See Also
Reference
Point3dList.YAccess Class
Rhino.Collections Namespace