RhinoCommon API
EventInfoArgs Properties
The EventInfoArgs type exposes the following members.
Properties
Name | Description
DataType
EventInfoPtr
Top
See Also
Reference
EventInfoArgs Class
Rhino.UI.Controls.DataSource Namespace