RhinoCommon API
File3dmPlugInDetails Properties
The File3dmPlugInDetails type exposes the following members.
Properties
Name | Description
Filename
The plug-in's binary filename
Id
Plug-in Id
Name
Public facing name of the plug-in
Top
See Also
Reference
File3dmPlugInDetails Class
Rhino.FileIO Namespace