RhinoCommon API
ReduceMeshParameters Properties
The ReduceMeshParameters type exposes the following members.
Properties
Name | Description
Accuracy
Integer from 1 to 10 telling how accurate reduction algorithm to use. Greater number gives more accurate results
AllowDistortion
 If true, faces are removed until DesiredPolygonCount is reached, distorting the shape as needed. If false, only flat (coplanar) regions are simplified, which leaves the shape unchanged and ignores DesiredPolygonCount.
CancelToken
DesiredPolygonCount
Desired or target number of faces
Error
FaceTags
LockedComponents
List of topological mesh vertices and mesh vertices that will not be moved or deleted in reduction process. Each mesh vertex will lock the corresponding topological mesh vertex. In other words it is not possible to have a locked and non-locked mesh vertex at the same location.
NormalizeMeshSize
If true mesh is fitted to an axis aligned unit cube until reduction is complete
ProgressReporter
Top
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace