RhinoCommon API
ByteArrayField Properties
The ByteArrayField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
ByteArrayField Class
Rhino.Render.Fields Namespace