RhinoCommon API
DraftAngleAnalysisSettingsState Properties
The DraftAngleAnalysisSettingsState type exposes the following members.
Properties
Name | Description
AngleRange
 The angle range.
ShowIsoCurves
 Show isoparametric curves.
UpDirection
 The up direction.
Top
See Also
Reference
DraftAngleAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace