RhinoCommon API
File3dmRenderContent Properties
The File3dmRenderContent type exposes the following members.
Properties
Name | Description
AutoDelete
True if the content is automatically deleted when not in use.
Children
ChildSlotName
The render content's child slot name.
ComponentType
 Returns RenderContent.
 (Overrides ModelComponent.ComponentType.)
File3dmParent
The parent File3dm of the entire hierarchy.
GroupId
The content's group id.
Hidden
True if the content is hidden.
IsChild
True if this is a child of another render content (i.e., has a parent; is not top-level).
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
IsTopLevel
True if this is a top-level render content (i.e., has no parent; is not a child).
Kind
the kind of render content as a string.
Notes
The content's notes.
Parent
The parent content or null if this is the top level object.
PlugInId
The content's plug-in id.
Reference
True if the content is a reference content.
RenderEngineId
The content's render-engine id.
Tags
The content's tags.
TopLevel
The top-level parent content. Returns this if this is the top-level item.
TypeId
The unique id of the content type.
TypeName
The internal name of the content type.
Top
See Also
Reference
File3dmRenderContent Class
Rhino.FileIO Namespace