RhinoCommon API
MeshInterference Properties
The MeshInterference type exposes the following members.
Properties
Name | Description
HitPoints
 Array of hit points where the objects of IndexA and IndexB interfere.
IndexA
 The index of the first clashing, or interfering object.
IndexB
 The index of the second clashing, or interfering object.
Top
See Also
Reference
MeshInterference Structure
Rhino.Geometry.Intersect Namespace