RhinoCommon API
MeshClash Properties
The MeshClash type exposes the following members.
Properties
Name | Description
ClashPoint
 If valid, then the sphere centered at ClashPoint of ClashRadius distance intersects the clashing meshes.
ClashRadius
 Gets the clash, or intersection, radius.
MeshA
 Gets the first mesh.
MeshB
 Gets the second mesh.
Top
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace