RhinoCommon API
RenderMeshProviderProgress Properties
The RenderMeshProviderProgress type exposes the following members.
Properties
Name | Description
Amount
 The amount of progress towards the target
IsComplete
 true if complete, otherwise false.
ProviderId
 The Id of the RenderMeshProvider that this report came from.
Target
 Target progress
Text
 Return a textural progress report
Top
See Also
Reference
RenderMeshProviderProgress Class
Rhino.Render.CustomRenderMeshes Namespace