RhinoCommon API
FileDwgReadOptions Properties
The FileDwgReadOptions type exposes the following members.
Properties
Name | Description
ConvertRegionsToCurves
ConvertWidePolylinesToSurfaces
IgnoreThickness
ImportUnreferencedBlocks
ImportUnreferencedLayers
ImportUnreferencedLinetypes
LayoutUnits
MakeExtrusions
MeshPrecision
ModelUnits
NestLayers
SetLayerMaterialToLayerColor
Top
See Also
Reference
FileDwgReadOptions Class
Rhino.FileIO Namespace