RhinoCommon API
Sun Properties
The Sun type exposes the following members.
Properties
Name | Description
Accuracy
Accuracy.
Altitude
 The sun's altitude above the horizon in degrees in the range -90 to +90. Setting this value will also set the sun to manual control mode.
Azimuth
 The sun's azimuth in degrees. The value increases Eastwards with North as zero. Setting this value will also set the sun to manual control mode. Note: This value is not affected by the direction of north.
DaylightSaving |  Obsolete.
DaylightSavingMinutes
Daylight saving time in minutes
DaylightSavingOn
Daylight saving time 'on' state
Enabled
Turn the sun on/off in this document.
Hash
 Get a hash of the sun state.
Intensity
 Sun intensity.
Latitude
 The observer's latitude.
Light
 Get a Light which represents the sun. If manual control is in effect, no sun calculation is performed; the function uses the last known values of azimuth and altitude. If manual control is not in effect, the observer's position, date, time, time zone and daylight saving values are used to calculate the position of the sun.
Longitude
 The observer's longitude.
ManualControl |  Obsolete.
ManualControlOn
Manual control 'on' state. When true, allows the user to set the sun azimuth and altitude directly. When false, the values are computed.
North
 Angle in degrees on world X-Y plane that should be considered north in the model. The angle is measured starting at the x-axis and increases anti-clockwise. The y-axis corresponds to a 'north' angle of 90 degrees.
SkylightOn |  Obsolete.
Turn skylight on or off.
TimeZone
 The observer's time zone measured in hours relative to UTC.
Vector
Top
See Also
Reference
Sun Class
Rhino.Render Namespace