RhinoCommon API
VisualAnalysisMode Properties
The VisualAnalysisMode type exposes the following members.
Properties
Name | Description
Id
 Gets the visual analysis mode GUID. The Guid is specified with the GuidAttribute applied to the class.
Name
 Gets the name of the analysis mode. It is used by the _What command and the object properties details window to describe the object.
RhinoCurvatureColorAnalyisModeId
 Id for Rhino's built-in curvature color analysis mode. Surface curvature is shown using false color mapping.
RhinoCurvatureGraphAnalysisModeId
 Id for Rhino's built-in curvature graphs analysis mode. Curvature hair is shown on curves and surfaces.
RhinoDirectionAnalysisModeId
 Id for Rhino's built-in direction analysis mode.
RhinoDraftAngleAnalysisModeId
 Id for Rhino's built-in draft angle analysis mode. Draft angle is displayed using false colors.
RhinoEdgeAnalysisModeId
 Id for Rhino's built-in edge analysis mode. Brep and mesh edges are shown in a selected color.
RhinoEdgeContinuityAlalysisModeId
 Id for Rhino's built-in edge continuity analysis mode.
RhinoEmapAnalysisModeId
 Id for Rhino's built-in emap analysis mode. An environment map is shown on surfaces and meshes.
RhinoEndAnalysisModeId
 Id for Rhino's built-in End analysis mode.
RhinoThicknessAnalysisModeId
 Id for Rhino's built-in thickness analysis mode.
RhinoZebraStripeAnalysisModeId
 Id for Rhino's built-in zebra stripe analysis mode. Zebra stripes are shown on surfaces and meshes.
ShowIsoCurves
 Gets true if this visual analysis mode will show isocuves on shaded surface objects. Often a mode's user interface will provide a way to change this setting.
The default is false.
Style
 Gets the visual analysis mode style.
Top
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace