RhinoCommon API
ViewCapture Properties
The ViewCapture type exposes the following members.
Properties
Name | Description
DrawAxes
DrawGrid
DrawGridAxes
Height
 Height of capture in Pixels
Preview
RealtimeRenderPasses
ScaleScreenItems
TransparentBackground
Width
 Width of capture in Pixels
Top
See Also
Reference
ViewCapture Class
Rhino.Display Namespace