RhinoCommon API
NurbsCurveKnotList Properties
The NurbsCurveKnotList type exposes the following members.
Properties
Name | Description
Count
Total number of knots in this curve.
IsClampedEnd
 Gets a value indicating whether or not the knot vector is clamped at the end of the curve. Clamped curves are coincident with the first and last control-point. This requires fully multiple knots.
IsClampedStart
 Gets a value indicating whether or not the knot vector is clamped at the start of the curve. Clamped curves start at the first control-point. This requires fully multiple knots.
Item
 Gets or sets the knot vector value at the given index.
KnotStyle
 Gets the style of the knot vector.
Top
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace