RhinoCommon API
PostEffectChannel Properties
The PostEffectChannel type exposes the following members.
Properties
Name | Description
Id
 Return the channel id which indicates what type of data is used in this channel.
PixelSize
 Return the pixel size in bytes for this channel.
Top
See Also
Reference
PostEffectChannel Class
Rhino.Render.PostEffects Namespace