RhinoCommon API
DisplayPointAttributes Properties
The DisplayPointAttributes type exposes the following members.
Properties
Name | Description
Diameter
FillColor
PointStyle
RotationRadians
SecondarySize
StrokeColor
StrokeWidth
Top
See Also
Reference
DisplayPointAttributes Class
Rhino.Display Namespace