RhinoCommon API
AsyncRenderContext Properties
The AsyncRenderContext type exposes the following members.
Properties
Name | Description
Cancel
 If set to true rendering should be stopped. Is set to true only by StopRendering().
RenderThread
 Holder for render thread, that gets set through StartRenderThread()
RenderWindow
 Handle to the RenderWindow for the instance of this class. This is a convenience property for implementors to use.
Top
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace