RhinoCommon API
SimulatedEnvironment Properties
The SimulatedEnvironment type exposes the following members.
Properties
Name | Description
BackgroundColor
BackgroundImage
BackgroundProjection
Top
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace