RhinoCommon API
SimpleArrayInt Properties
The SimpleArrayInt type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of elements in this array.
Top
See Also
Reference
SimpleArrayInt Class
Rhino.Runtime.InteropWrappers Namespace