RhinoCommon API
SaveFileDialog Properties
The SaveFileDialog type exposes the following members.
Properties
Name | Description
DefaultExt
 The default file name extension. The returned string does not include the period.
FileName
 Gets or sets a string containing the file name selected in the file dialog box.
Filter
 Gets or sets the current file name filter string, which determines the choices that appear in the "Save as file type" or "Files of type" box in the dialog box. See System.Windows.Forms.FileDialog for details.
InitialDirectory
 Gets or sets the initial directory displayed by the file dialog box.
Title
 Gets or sets the file dialog box title.
Top
See Also
Reference
SaveFileDialog Class
Rhino.UI Namespace