RhinoCommon API
RhinoTransformObjectsEventArgs Properties
The RhinoTransformObjectsEventArgs type exposes the following members.
Properties
Name | Description
GripCount
 The number of Rhino object grips that will be transformed.
GripOwnerCount
 The number of Rhino object grip owners that will be changed when the grips are transformed.
GripOwners
 An array of Rhino object grip owners that will be changed when the grips are transformed. WARNING: these objects may be deleted at anytime after the event handler has been notified. Do not save references to these objects. Use the object's runtime serial number to safely reference these objects at a later time.
Grips
 An array of Rhino object grips that will be transformed. WARNING: these objects may be deleted at anytime after the event handler has been notified. Do not save references to these objects. Use the object's runtime serial number to safely reference these objects at a later time.
ObjectCount
 The number of Rhino objects that will be transformed.
Objects
 An array of Rhino objects to be transformed. WARNING: these objects may be deleted at anytime after the event handler has been notified. Do not save references to these objects. Use the object's runtime serial number to safely reference these objects at a later time.
ObjectsWillBeCopied
 True if the objects will be copied.
Transform
 The transformation to be applied.
TransformEventId
 The transformation event id.
Top
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace