RhinoCommon API
MaterialRef Properties
The MaterialRef type exposes the following members.
Properties
Name | Description
BackFaceMaterialId
 The Id of the Material used to render the back of an object.
BackFaceMaterialIndex
 The index of the material used to render the back of an object
FrontFaceMaterialId
 The Id of the Material used to render the front of an object.
FrontFaceMaterialIndex
 The index of the material used to render the front of an object
MaterialSource
 Determines if the simple material should come from the object or from it's layer.
PlugInId
 Identifies a rendering plug-in
Top
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace