RhinoCommon API
EmapAnalysisSettings Properties
The EmapAnalysisSettings type exposes the following members.
Properties
Name | Description
BlendWithObjectColor
 Gets or sets whether to blend the image with the object's color.
FileName
 Gets or sets the current emap file name.
ShowIsoparams
 Gets or sets whether to display iso curves.
Top
See Also
Reference
EmapAnalysisSettings Class
Rhino.ApplicationSettings Namespace