RhinoCommon API
SafeFrame Properties
The SafeFrame type exposes the following members.
Properties
Name | Description
ActionFrameLinked
 Action Frame Linked, On = Use the same scale for X and Y. Off = use different scales for X and Y.
ActionFrameOn
 Turn on the user specified action area, which shown with blue frames.
ActionFrameXScale
 Action Frame X-scale. This value should be in the range 0..1 but it is not clamped. It is displayed in the UI in the range 0..100.
ActionFrameYScale
 Action Frame Y-scale. This value should be in the range 0..1 but it is not clamped. It is displayed in the UI in the range 0..100.
Enabled
 Determines whether the safe-frame is enabled.
FieldsOn
 Show the 4 by 3 field grid in the safe-frame.
LiveFrameOn
 Turn on the live area, which shows the size of the rendered view as a yellow frame in the viewport.
PerspectiveOnly
 Show the safe-frame only in perspective views.
TitleFrameLinked
 Title Frame Linked, On = Use the same scale for X and Y. Off = use different scales for X and Y.
TitleFrameOn
 Show a user specified title area frame in orange.
TitleFrameXScale
 Title Frame X-scale. This value should be in the range 0..1 but it is not clamped. It is displayed in the UI in the range 0..100.
TitleFrameYScale
 Title Frame Y-scale. This value should be in the range 0..1 but it is not clamped. It is displayed in the UI in the range 0..100.
Top
See Also
Reference
SafeFrame Class
Rhino.Render Namespace