RhinoCommon API
MappingChannel Properties
The MappingChannel type exposes the following members.
Properties
Name | Description
Channel
 Get channel number for this MappingChannel
Local
 Local transform for the mapping
Mapping
 Return TexturMapping for this MappingChannel
Top
See Also
Reference
MappingChannel Class
Rhino.Render.ChangeQueue Namespace