RhinoCommon API
PointCloud Properties
The PointCloud type exposes the following members.
Properties
Name | Description
ContainsColors
 Gets a value indicating whether or not the points in this point cloud have colors assigned to them.
ContainsHiddenFlags
 Gets a value indicating whether or not the points in this point cloud have hidden flags assigned to them.
ContainsNormals
 Gets a value indicating whether or not the points in this point cloud have normals assigned to them.
ContainsPointValues
 Gets a value indicating whether or not the points in this point cloud have extra values assigned to them. Extra values can be used to store a user-defined values, such as intensity.
Count
 Gets the number of points in this point cloud.
HiddenPointCount
 Gets the number of points that have their Hidden flag set.
Item
 Gets the item at the given index.
Top
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace