RhinoCommon API
ColorXYZ Properties
The ColorXYZ type exposes the following members.
Properties
Name | Description
A
 Gets or set the Alpha channel value. Channel will be limited to 0~1.
X
 Gets or set the X channel value. Channel will be limited to 0~1.
Y
 Gets or set the Y channel value. Channel will be limited to 0~1.
Z
 Gets or set the Z channel value. Channel will be limited to 0~1.
Top
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace