RhinoCommon API
RenderContentSerializer Properties
The RenderContentSerializer type exposes the following members.
Properties
Name | Description
CanRead
 If true then the file type can be imported and will be included in the file open box when importing the specified render content kind.
CanWrite
 If true then the file type can be exported and will be included in the file save box when exporting the specified render content kind.
ContentKind
 Kind of content created when importing or exporting this file type - ie, Material, Texture or Environment
ContentType |  Obsolete.
 Kind of content created when importing or exporting this file type. Obsolete - use ContentKind
EnglishDescription
 English string describing this plug-in
FileExtension
 File extension associated with this serialize object
LocalDescription
 Localized plug-in description
Top
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace