RhinoCommon API
Analytics Properties
The Analytics type exposes the following members.
Properties
Name | Description
AppInstallerId
 App Installer Id. In Rhino, we use this to differentiate between different builds such as "WIP" and "Commercial". Maps to Google Analytics parameter 'aiid'
AppName
 Name of Application. For example, "Ocelot". Do not include version numbers. Maps to Google Analytics parameter 'an'
AppPlatform
 Platform application is running on. For example "Mac", "Windows". Again, don't include version numbers. Maps to Google Analytics parameter 'ai'
AppVersion
 Application version string. Maps to Google Analytics parameter 'av'
GoogleAnalyticsTrackingID
 Google Analytics Tracking ID
UsageStatisticsEnabled
 Determine if user allows automatic data collection from Rhino
UserId
 Returns a GUID that allows events to be aggregated by user. There is no way to determine who the end user is based on this GUID, unless the user tells you their ID. On Windows, this uses the registry to store the ID. On Mac, the Hardware UUID is used as the ID.
Top
See Also
Reference
Analytics Class
Rhino.Runtime Namespace