RhinoCommon API
ChooseOneObjectSettingsState Properties
The ChooseOneObjectSettingsState type exposes the following members.
Properties
Name | Description
AutomaticResize
AutomaticResize
DynamicHighlight
DynamicHighlight
FollowCursor
FollowCursor
HighlightColor
HighlightColor
MaxAutoResizeItems
MaxAutoResizeItems
ShowAllOption
ShowAllOption
ShowObjectColor
ShowObjectColor
ShowObjectLayer
ShowObjectLayer
ShowObjectName
ShowObjectName
ShowObjectType
ShowObjectType
ShowObjectTypeDetails
ShowObjectTypeDetails
ShowTitlebarAndBorder
ShowTitlebarAndBorder
UseCustomColor
UseCustomColor
XOffset
XOffset
YOffset
YOffset
Top
See Also
Reference
ChooseOneObjectSettingsState Class
Rhino.ApplicationSettings Namespace