RhinoCommon API
PhysicallyBasedMaterial Properties
The PhysicallyBasedMaterial type exposes the following members.
Properties
Name | Description
Alpha
Anisotropic
AnisotropicRotation
BaseColor
BRDF
Clearcoat
ClearcoatRoughness
Emission
Material
Metallic
Opacity
OpacityIOR
OpacityRoughness
ReflectiveIOR
Roughness
Sheen
SheenTint
Specular
SpecularTint
Subsurface
SubsurfaceScatteringColor
SubsurfaceScatteringRadius
UseBaseColorTextureAlphaForObjectAlphaTransparencyTexture
Top
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.DocObjects Namespace