RhinoCommon API
IHelp Properties
The IHelp type exposes the following members.
Properties
Name | Description
HelpUrl
 Help topic URL which gets passed to RhinoHelp.Show
Top
See Also
Reference
IHelp Interface
Rhino.UI Namespace