RhinoCommon API
EventWatcher Properties
The EventWatcher type exposes the following members.
Properties
Name | Description
IncludeHeadlessDocuments
 Gets whether this watcher also receives events for headless documents.
Top
See Also
Reference
EventWatcher Class
Rhino Namespace