RhinoCommon API
FileVrmlWriteOptions Properties
The FileVrmlWriteOptions type exposes the following members.
Properties
Name | Description
ExportTextureCoordinates
ExportVertexColors
ExportVertexNormals
MeshingParameters
Version
Top
See Also
Reference
FileVrmlWriteOptions Class
Rhino.FileIO Namespace