RhinoCommon API
ScaleValue Properties
The ScaleValue type exposes the following members.
Properties
Name | Description
LeftToRightScale
 LeftLengthValue / RightLengthValue
RightToLeftScale
 RightLengthValue / LeftLengthValue
Top
See Also
Reference
ScaleValue Class
Rhino Namespace