RhinoCommon API
Linetype Properties
The Linetype type exposes the following members.
Properties
Name | Description
AlwaysModelDistances
 Linetype patterns and widths are typically interpreted as distances on the printed output when printing. In this case AlwaysModelDistances is false (default). When set to true, the linetype pattern and width will be interpreted as being in world distances. This is useful for cases like modeling a road as a single curve.
ComponentType
 Returns LinePattern.
 (Overrides ModelComponent.ComponentType.)
HasShapes
 Does this linetype have shapes
InUse
 Returns true if the linetype is in use by a Rhino object, a layer, an instance definition, or a section style.
IsDeleted
 Gets a value indicating whether this linetype has been deleted and is currently in the Undo buffer.
 (Overrides ModelComponent.IsDeleted.)
IsModified
 true if this linetype has been modified by LinetypeTable.ModifyLinetype() and the modifications can be undone.
IsPatternLocked
 Returns true if the pattern is locked and cannot be modified.
IsReference
 Gets a value indicting whether this linetype is a referenced linetype. Referenced linetypes are part of referenced documents.
 (Overrides ModelComponent.IsReference.)
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
LineCapStyle
 Defines how the ends of open curves should be drawn
LineJoinStyle
 Defines how the corners of curves should be drawn
Name
The name of this linetype.
 (Overrides ModelComponent.Name.)
PatternLength
Total length of one repeat of the pattern.
SegmentCount
Number of segments in the pattern.
ShapeBounds
 The bounding box of the shapes in this linetype definition.
ShapeGap
 If shapes are present in this linetype, this is the gap around the shape.
ShapeLocalOffset
 Local offset applied to shapes
ShapeSpacing
 If shapes are present in this linetype, this is the distance between shapes
UserStringCount
 Gets the amount of user strings.
Width
 Base width for this linetype
WidthUnits
 Unit system that widths are defined in. UnitSystem.None is default and means that the width is defined in pixels.
Top
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace