RhinoCommon API
StdVectorOfSharedPtrToMesh Properties
The StdVectorOfSharedPtrToMesh type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of meshes in this array.
Top
See Also
Reference
StdVectorOfSharedPtrToMesh Class
Rhino.Runtime.InteropWrappers Namespace