RhinoCommon API
RenderMaterialAssignmentChangedEventArgs Properties
The RhinoDoc.RenderMaterialAssignmentChangedEventArgs type exposes the following members.
Properties
Name | Description
IsLayer
IsObject
LayerId
NewRenderMaterial
ObjectId
OldRenderMaterial
Top
See Also
Reference
RhinoDoc.RenderMaterialAssignmentChangedEventArgs Class
Rhino Namespace