RhinoCommon API
FileDwgWriteOptions Properties
The FileDwgWriteOptions type exposes the following members.
Properties
Name | Description
ColorMethod
pallette index: clrACI, RGB: clrRGB
CurveChordHeight
Absolute distance from pline to nurb
CurveMaxAngleDegrees
Angle between pline segments in writing curve
CurveMaxAngleRadians
Angle between pline segments in writing curve
CurveSegmentLength
Max length for any polyline segment
CurveUseChordHeight
CurveUseMaxAngle
CurveUseSegmentLength
ExportArcsAs
ExportLinesAs
ExportMeshesAs
Rhino meshes as polyface meshes or 3dfaces
ExportPolycurvesAs
ExportPolylinesAs
ExportSplinesAs
ExportSurfacesAs
Rhino surcaces as meshes(0) or curves(1) or acis(2)
Flatten
Project to cplane or view
FullLayerPath
write layernames as Parent$Child or Child
IsDefault
MinPointDistance
Name
NoDxfHeader
write an entities only dxf file ( R12 only)
PreserveArcNormals
Users wanted to use Pedit in AutoCAD to join them into plines and that didn't work if the normals of arcs being joined are different. Default will be true and will change the behavior
Simplify
use lines and arcs where possible
SimplifyTolerance
SplitPolycurves
Explode polycurves before exporting
SplitSplines
Split splines at FMKs before exporting
UseColor
Set AutoCAD display color with Rhino print or display color
UseLWPolylines
Version
 Version of DWG file to write
WriteThickCurves
Write extrusions with simple profile curves as thick curves.
Top
See Also
Reference
FileDwgWriteOptions Class
Rhino.FileIO Namespace