RhinoCommon API
CustomDisplay Properties
The CustomDisplay type exposes the following members.
Properties
Name | Description
ClippingBox
 Gets the clipping box of this CustomDisplay.
Enabled
 Gets or sets the Enabled state of this CustomDisplay instance. If you wish to terminate this CustomDisplay, place a call to Dispose() instead.
IsDisposed
 Gets a value indicating whether this CustomDisplay instance has been disposed. Once a CustomDisplay has been disposed, you can no longer use it.
Top
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace