RhinoCommon API
TextLog Properties
The TextLog type exposes the following members.
Properties
Name | Description
IndentSize
 0: one tab per indent. >0: number of spaces per indent
Top
See Also
Reference
TextLog Class
Rhino.FileIO Namespace