RhinoCommon API
RayShootEvent Properties
The RayShootEvent type exposes the following members.
Properties
Name | Description
BrepFaceIndex
 If GeometryIndex references a Brep, then the index of the Brep face that was hit. If GeometryIndex references a surface, than RhinoMath.UnsetIntIndex.
GeometryIndex
 The index of the surface or Brep that was hit.
Point
 The 3d hit point.
Top
See Also
Reference
RayShootEvent Structure
Rhino.Geometry.Intersect Namespace