RhinoCommon API
MeshFaceList Properties
The MeshFaceList type exposes the following members.
Properties
Name | Description
Capacity
 Gets or sets the total number of mesh triangles and quads the internal data structure can hold without resizing.
Count
 Gets or sets the number of mesh faces. When getting this can includes invalid faces.
Item
 Returns the mesh face at the given index.
QuadCount
 Gets the number of faces that are valid quads (4 corners).
TriangleCount
 Gets the number of faces that are valid triangles (3 corners).
Top
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace