RhinoCommon API
GetEllipse Properties
The GetEllipse type exposes the following members.
Properties
Name | Description
FirstPoint
 Returns the first point. If in "from foci" mode, then this is the first foci point.
IsModeFromFoci
 Indicates the ellipse was created from foci.
MarkFoci
 Indicates the user wants the ellipse foci marked with point objects.
SecondPoint
 Returns the second point. If in "from foci" mode, then this is the second foci point.
Top
See Also
Reference
GetEllipse Class
Rhino.Input.Custom Namespace