RhinoCommon API
Dithering Properties
The Dithering type exposes the following members.
Properties
Name | Description
Enabled
Method
On |  Obsolete.
Top
See Also
Reference
Dithering Class
Rhino.Render Namespace