RhinoCommon API
GroupTableEventArgs Properties
The GroupTableEventArgs type exposes the following members.
Properties
Name | Description
Document
 The document in which the event occurred.
EventType
 The event type.
GroupIndex
 The index of the Group that has changed.
NewState
 The Group that has changed.
OldState
 If the event is GroupTableEventType.Modified, then the old Group.
Top
See Also
Reference
GroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace