RhinoCommon API
DisplayConduit Properties
The DisplayConduit type exposes the following members.
Properties
Name | Description
Enabled
GeometryFilter
 The geometry filter will ensure that your conduit's per-object functions will only be called for objects that are of certain geometry type
SpaceFilter
 If you want this conduit to only work in a specific space (model or page), then set this filter to that specific space. The default is None meaning no filter is applied
Top
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace