RhinoCommon API
LinetypeTableEventArgs Properties
The LinetypeTableEventArgs type exposes the following members.
Properties
Name | Description
Document
 The document in which the event occurred.
EventType
 The event type.
LinetypeIndex
 Index of the linetype.
NewState
 The new state.
OldState
 The old state.
Top
See Also
Reference
LinetypeTableEventArgs Class
Rhino.DocObjects.Tables Namespace