RhinoCommon API
PreviewJobSignature Properties
The PreviewJobSignature type exposes the following members.
Properties
Name | Description
CppPointer
 UnManaged pointer of the PreviewJobsingature
Top
See Also
Reference
PreviewJobSignature Class
Rhino.Render Namespace