RhinoCommon API
FileFbxReadOptions Properties
The FileFbxReadOptions type exposes the following members.
Properties
Name | Description
ImportCameras
ImportLights
ImportMeshesAsSubD
MapFbxYtoRhinoZ
Unweld
UnweldAngle
Top
See Also
Reference
FileFbxReadOptions Class
Rhino.FileIO Namespace