RhinoCommon API
Point4dField Properties
The Point4dField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
Point4dField Class
Rhino.Render.Fields Namespace