RhinoCommon API
MeshVertexNormalList Properties
The MeshVertexNormalList type exposes the following members.
Properties
Name | Description
Capacity
 Gets or sets the amount of vertex normals that the list can hold without resizing.
Count
 Gets or sets the number of mesh vertex normals.
Item
 Gets or sets the vertex at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace