RhinoCommon API
Rectangle3d Properties
The Rectangle3d type exposes the following members.
Properties
Name | Description
Area
 Gets the unsigned Area of the rectangle.
BoundingBox
 Gets the world aligned bounding box for this rectangle.
Center
 Gets the point in the center of the rectangle.
Circumference
 Gets the circumference of the rectangle.
Height
 Gets the signed height of the rectangle. If the Y dimension is decreasing, the height will be negative.
IsValid
 Gets a value indicating whether or not this is a valid rectangle. A rectangle is considered to be valid when the base plane and both dimensions are valid.
Plane
 Gets or sets the base plane of the rectangle.
Unset
 Gets a rectangle with Unset components.
Width
 Gets the signed width of the rectangle. If the X dimension is decreasing, the width will be negative.
X
 Gets or sets the dimensions of the rectangle along the base plane X-Axis (i.e. the width).
Y
 Gets or sets the dimensions of the rectangle along the base plane Y-Axis (i.e. the height).
Top
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace