RhinoCommon API
Point2d Properties
The Point2d type exposes the following members.
Properties
Name | Description
IsValid
 If any coordinate of a point is UnsetValue, then the point is not valid.
Item
 Accesses the coordinates of this point.
MaximumCoordinate
 Gets the largest valid coordinate, or RhinoMath.UnsetValue if no coordinate is valid.
MinimumCoordinate
 Gets the smallest (both positive and negative) valid coordinate, or RhinoMath.UnsetValue if no coordinate is valid.
Origin
 Gets a point at 0,0.
Unset
 Gets a point at RhinoMath.UnsetValue,RhinoMath.UnsetValue.
X
 Gets or sets the X (first) coordinate of the point.
Y
 Gets or sets the Y (second) coordinate of the point.
Top
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace