RhinoCommon API
BrepRegionFaceSide Properties
The BrepRegionFaceSide type exposes the following members.
Properties
Name | Description
Brep
 The brep this side belongs to.
Face
Gets the face this side belongs to.
Region
 The region this side belongs to.
SurfaceNormalPointsIntoRegion
 Gets true if BrepFace's surface normal points into region; false otherwise.
Top
See Also
Reference
BrepRegionFaceSide Class
Rhino.Geometry Namespace