RhinoCommon API
ICommonComponentTable<T> Properties
The ICommonComponentTable<T> generic type exposes the following members.
Properties
Name | Description
ComponentType
 Returns the model component type the table handles.
Top
See Also
Reference
ICommonComponentTable<T> Interface
Rhino.FileIO Namespace