RhinoCommon API
HiddenLineDrawing Properties
The HiddenLineDrawing type exposes the following members.
Properties
Name | Description
Points
 Point objects calculated by the hidden line drawing.
Segments
 Sub-curve objects calculated by the hidden line drawing.
Viewport
 Returns the ViewportInfo used by the hidden line drawing.
WorldToHiddenLine
 Returns the world-coordinate system to HLD-coordinate system transformation.
Top
See Also
Reference
HiddenLineDrawing Class
Rhino.Geometry Namespace