RhinoCommon API
Light Properties
The Light type exposes the following members.
Properties
Name | Description
ChangeType
 Get what type of light change this represents
Data
 Get the actual light data
Id
 Get the light object id
IdCrc
 Get CRC computed from Id
MaterialId
 Get material ID of the material assigned to the light. Material ID is 0 if no material was assigned.
Top
See Also
Reference
Light Class
Rhino.Render.ChangeQueue Namespace