RhinoCommon API
ToolbarFileCollection Properties
The ToolbarFileCollection type exposes the following members.
Properties
Name | Description
Count
 Get tne number of open toolbar files.
Item
 Gets an open toolbar file by index.
MruSidebarIsVisible
 Returns true if the most-recently-used sizebar is visible.
SidebarIsVisible
 Returns true if the sizebar is visible.
Top
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace