RhinoCommon API
BinaryArchiveReader Properties
The BinaryArchiveReader type exposes the following members.
Properties
Name | Description
Archive3dmVersion
 If a 3dm archive is being read or written, then this is the version of the 3dm archive format (1, 2, 3, 4 or 5). 0 a 3dm archive is not being read/written 1 a version 1 3dm archive is being read/written 2 a version 2 3dm archive is being read/written 3 a version 3 3dm archive is being read/written 4 a version 4 3dm archive is being read/written 5 an old version 5 3dm archive is being read 50 a version 5 3dm archive is being read/written.
CurrentPosition
current offset (in bytes) into archive ( like ftell() )
ReadErrorOccured
 Gets or sets whether en error occurred during reading.
Top
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace