RhinoCommon API
GetCone Properties
The GetCone type exposes the following members.
Properties
Name | Description
AllowInputAngle
ApexAngleDegrees
AroundDirectionMinimumCount
 The minimum number of faces in the around direction.
BaseAngleDegrees
BothSides
 Determines if we're supposed to do both sides
Cap
 Gets or sets whether or not the output should be capped.
ConeConstraint
 State of the cone/cylinder constraint option. When the cone/cylinder option is selected, the circle is being made as a base for a cone/cylinder. By default the vertical cone/cylinder option not available but is not selected. By default the "Vertical" option applies to VerticalCircle.
DefaultSize
 Default radius or diameter (based on InDiameterMode)
Height
InDiameterMode
 Determines if the "size" value is representing a radius or diameter
VerticalDirectionMinimumCount
 The minimum number of faces in the vertical direction.
Top
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace