RhinoCommon API
IndexPair Properties
The IndexPair type exposes the following members.
Properties
Name | Description
Count
 Returns the amount of elements in this pair of indices, which is always 2.
I
 Gets or sets the first, I index.
Item
 Gets or sets a particular index of this structure.
Remarks
Only 0 and 1 are valid indices.
J
 Gets or sets the second, J index.
Top
See Also
Reference
IndexPair Structure
Rhino Namespace