RhinoCommon API
MetaDataProxy Properties
The MetaDataProxy type exposes the following members.
Properties
Name | Description
CppPointer
 MetaDataProxy c++ pointer
Top
See Also
Reference
MetaDataProxy Class
Rhino.Render Namespace