RhinoCommon API
SerializationOptions Properties
The SerializationOptions type exposes the following members.
Properties
Name | Description
MaxRhinoVersion
 Gets the most recent serialization version available.
MinRhinoVersion
 Gets the earliest serialization version available.
RhinoVersion
 Gets or sets a value indicating the Rhino version.
WriteAnalysisMeshes
 Gets or sets a value indicating whether to write analysis meshes
WriteRenderMeshes
 Gets or sets a value indicating whether to write render meshes
WriteUserData
 Gets or sets a value indicating whether to write user data.
Top
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace