RhinoCommon API
RuiUpdateUi Properties
The RuiUpdateUi type exposes the following members.
Properties
Name | Description
Checked
Set to true to enable menu item or false to check menu item
Enabled
Set to true to enable menu item or false to disable menu item
FileId
Id of the RUI file that owns this menu item
MenuHandle
Windows menu handle of menu that contains this item
MenuId
Id of the menu that owns this menu item
MenuIndex
Zero based index of item in the Windows menu
MenuItemId
Id of the menu item that owns this menu item
RadioChecked
Set to true to enable menu item or false to check menu item
Text
Menu item text
WindowsMenuItemId
Windows menu item ID
Top
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace