RhinoCommon API
RhinoPageView Properties
The RhinoPageView type exposes the following members.
Properties
Name | Description
ActiveDetail
 Returns the active detail object. If no detail is active, or if the page is active, then null is returned.
ActiveDetailId
 Returns the id of the active detail. If no detail is active, or if the page is active, then Guid.Empty is returned.
ActiveViewport
 Gets the active viewport. The ActiveViewport is the same as the MainViewport for standard RhinoViews. In a RhinoPageView, the active viewport may be the RhinoViewport of a child detail object. Most of the time, you will use ActiveViewport unless you explicitly need to work with the main viewport.
 (Overrides RhinoView.ActiveViewport.)
Description
 Gets and sets a brief description of the page view.
PageHeight
 Height of the page in the document's PageUnitSystem
PageIsActive
 Returns true if the page is active, rather than any detail view. This occurs when the MainViewport.Id == ActiveViewportID.
PageName
Same as the MainViewport.Name.
PageNumber
 Gets or sets the runtime page number and updates the page number for all of the other pages. The first page has a value of 0.
PageViewGroupCount
 Gets the number of page view groups this page view belongs to.
PageWidth
 Width of the page in the document's PageUnitSystem
PaperName
 Returns the name of the layout's media, or paper (e.g. Letter, Legal, A1, etc.), used to determine the page width and page height.
PrinterName
 Gets and sets the name of the layout's destination printer.
Top
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace