RhinoCommon API
Vector2dField Properties
The Vector2dField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
Vector2dField Class
Rhino.Render.Fields Namespace