RhinoCommon API
CommandPromptChangedEventArgs Properties
The CommandPromptChangedEventArgs type exposes the following members.
Properties
Name | Description
Options
Active command line options
Prompt
Command line prompt text
PromptDefault
Default command line prompt text
Top
See Also
Reference
CommandPromptChangedEventArgs Class
Rhino.UI Namespace