RhinoCommon API
ContentHash Properties
The ContentHash type exposes the following members.
Properties
Name | Description
ByteCount
 Gets the length of the content, in bytes.
HashTime
 Gets the hash time, rounded to seconds.
Sha1ContentHash
 Gets the 20-bytes long SHA1 hash of the content.
Sha1NameHash
 Gets the 20-bytes long SHA1 hash of the name.
Top
See Also
Reference
ContentHash Class
Rhino.FileIO Namespace