RhinoCommon API
SubDCreationOptions Properties
The SubDCreationOptions type exposes the following members.
Properties
Name | Description
ConcaveCornerTest
 Get or sets the concave corner test option.
ConvexAndConcaveCornersAndInteriorCreases
 Look for convex corners at sub-D vertices with 2 edges or fewer that have an included angle ≤ 120 degrees. Look for concave corners at sub-D vertices with 3 edges or more that have an included angle ≥ 240 degrees.
ConvexCornersAndInteriorCreases
 Look for convex corners at sub-D vertices with 2 edges or fewer that have an included angle ≤ 120 degrees.
ConvexCornerTest
 Get or sets the convex corner test option.
InteriorCreases
 Create an interior sub-D crease along all input mesh double edges
InteriorCreaseTest
 Get or sets the interior crease test option.
InterpolateMeshVertices
 If false, input mesh vertex locations will be used to set SubD vertex control net locations. If true, input mesh vertex locations will be used to set SubD vertex limit surface locations.
MaximumConvexCornerAngleRadians
 If ConvexCornerTest == ConvexCornerOption.AtMeshCorner, then an input mesh boundary vertex becomes a SubD corner when the number of edges that end at the vertex is <= MaximumConvexCornerEdgeCount edges and the corner angle is <= MaximumConvexCornerAngleRadians.
MaximumConvexCornerEdgeCount
 If ConvexCornerTest == ConvexCornerOption.AtMeshCorner, then an input mesh boundary vertex becomes a SubD corner when the number of edges that end at the vertex is <= MaximumConvexCornerEdgeCount edges and the corner angle is <= MaximumConvexCornerAngleRadians.
MinimumConcaveCornerAngleRadians
 If ConcaveCornerTest == ConcaveCornerOption.AtMeshCorner, then an input mesh boundary vertex becomes a SubD corner when the number of edges that end at the vertex is >= MinimumConcaveCornerEdgeCount edges and the corner angle is >= MinimumConcaveCornerAngleRadians.
MinimumConcaveCornerEdgeCount
 If ConcaveCornerTest == ConcaveCornerOption.AtMeshCorner, then an input mesh boundary vertex becomes a SubD corner when the number of edges that end at the vertex is >= MinimumConcaveCornerEdgeCount edges and the corner angle is >= MinimumConcaveCornerAngleRadians.
Smooth
 No interior creases and no corners.
TextureCoordinateTest
 Gets or sets the texture coordinate test option.
Top
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace