RhinoCommon API
IntersectingMeshPair Properties
The IntersectingMeshPair type exposes the following members.
Properties
Name | Description
FaceIndexA
 The index of a face of the first mesh that intersects FaceIndexB, or -1 if it could not be determined.
FaceIndexB
 The index of a face of the second mesh that intersects FaceIndexA, or -1 if it could not be determined.
MeshIndexA
 The index of the first mesh, in meshesA.
MeshIndexB
 The index of the second mesh, in meshesB, or in meshesA when meshesB is null.
Top
See Also
Reference
IntersectingMeshPair Structure
Rhino.Geometry.Intersect Namespace