RhinoCommon API
IResizableList<T> Properties
The IResizableList<T> generic type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the length of the list. This hides (Shadows in Vb.Net) the read-only Count property of the generic list.
Top
See Also
Reference
IResizableList<T> Interface
Rhino.Collections Namespace