RhinoCommon API
SimpleArrayLine Properties
The SimpleArrayLine type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of lines in this array.
Top
See Also
Reference
SimpleArrayLine Class
Rhino.Runtime.InteropWrappers Namespace