RhinoCommon API
FileSatWriteOptions Properties
The FileSatWriteOptions type exposes the following members.
Properties
Name | Description
Type
 Get and set the type of the sat file being written.
Top
See Also
Reference
FileSatWriteOptions Class
Rhino.FileIO Namespace