RhinoCommon API
MarkupTableEventArgs Properties
The MarkupTableEventArgs type exposes the following members.
Properties
Name | Description
Document
The Rhino document.
EventType
The event type.
Index
The index of the markup.
NewState
The markup
OldState
The old or previous markup.
Top
See Also
Reference
MarkupTableEventArgs Class
Rhino.DocObjects.Tables Namespace