RhinoCommon API
Point Properties
The Point type exposes the following members.
Properties
Name | Description
Location
 Gets or sets the location (position) of this point.
Top
See Also
Reference
Point Class
Rhino.Geometry Namespace