RhinoCommon API
ColorLCH Properties
The ColorLCH type exposes the following members.
Properties
Name | Description
A
 Gets or sets the Alpha channel. The Alpha channel is limited to the 0~1 range.
C
 Gets or sets the Chroma channel. Chroma is defined from -1.0 to +1.0.
H
 Gets or sets the Hue channel. The hue channel is limited to the 0~360 degree range.
L
 Gets or sets the Lightness channel.
Top
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace