RhinoCommon API
PointConstraint Properties
The Brep.PointConstraint type exposes the following members.
Properties
Name | Description
Point
 Location of the constraint
Top
See Also
Reference
Brep.PointConstraint Class
Rhino.Geometry Namespace