RhinoCommon API
HiddenLineDrawingObjectCurve Properties
The HiddenLineDrawingObjectCurve type exposes the following members.
Properties
Name | Description
ClippingPlaneIndex
 Index into HiddenLineDrawing.ClippingPlanes when SilhouetteType == SilhouetteType.SectionCut.
Index
 Index of this object in HiddenLineDrawing.FullCurves.
IsProjecting
 Returns true if all the non clipped portions of this curve are projecting.
IsValid
 Verifies the object is valid.
OriginalDomainStart
 Initialized to RhinoMath.UnsetValue. Valid if the full curve is closed. Rejoin can reparameterize the curve by moving the seam. When this has been done the original domain start is stored here.
Parameters
 Increasing, partition of curve.Domain.
Segments
 The HiddenLineDrawingCurve objects that make up this full curve.
SilhouetteType
 The silhouette event type
SourceObject
 Return the source object that this curve came from
SourceObjectComponentIndex
 Component of source object part that generated this curve.
Top
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace