RhinoCommon API
CustomPostEffectAttribute Properties
The CustomPostEffectAttribute type exposes the following members.
Properties
Name | Description
CanDisplayHelp
ExecuteWhileRenderingDelay
ExecuteWhileRenderingOption
Name
PostEffectType
Styles
Top
See Also
Reference
CustomPostEffectAttribute Class
Rhino.Render.PostEffects Namespace