RhinoCommon API
ShutLiningCurveInfo Properties
The ShutLiningCurveInfo type exposes the following members.
Properties
Name | Description
Curve
 The profile curve.
CurveIntervals
 The parts of the curve to use as profiles.
Enabled
 If true, this curve is active.
IsBump
 True if profile constitutes a bump. See Rhino's Help for more information.
Profile
 >The profile type.
Pull
 True if the curve should be pulled.
Radius
 The profile radius.
Top
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace