RhinoCommon API
GroupTable Properties
The GroupTable type exposes the following members.
Properties
Name | Description
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Item
 Conceptually, the group table is an array of groups. The operator[] can be used to get individual groups. A group is either active or deleted and this state is reported by Group.IsDeleted.
Top
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace