RhinoCommon API
DocumentSaveEventArgs Properties
The DocumentSaveEventArgs type exposes the following members.
Properties
Name | Description
ExportSelected
 true if only selected objects are being written to a file.
FileName
 Name of file being written.
Top
See Also
Reference
DocumentSaveEventArgs Class
Rhino Namespace