RhinoCommon API
Point3dField Properties
The Point3dField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
Point3dField Class
Rhino.Render.Fields Namespace