RhinoCommon API
TrulyObservableOrderedSet<T> Properties
The TrulyObservableOrderedSet<T> generic type exposes the following members.
Properties
Name | Description
Count
 Returns the total number of items in the set.
IsReadOnly
 Always returns false.
Item
 Gets or replaces an element in the ordered set at the specified index.
Top
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace