RhinoCommon API
SimpleArrayPoint2d Properties
The SimpleArrayPoint2d type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of points in this array.
Top
See Also
Reference
SimpleArrayPoint2d Class
Rhino.Runtime.InteropWrappers Namespace