RhinoCommon API
FontTable Properties
The FontTable type exposes the following members.
Properties
Name | Description
Count
Number of fonts in the table.
CurrentIndex
 At all times, there is a "current" font. Unless otherwise specified, new dimension objects are assigned to the current font. The current font is never deleted. Returns: Zero based font index of the current font.
Document
Document that owns this table.
Item
 Gets the font at a position.
Top
See Also
Reference
FontTable Class
Rhino.DocObjects.Tables Namespace