RhinoCommon API
AssemblyResolver Properties
The AssemblyResolver type exposes the following members.
Properties
Name | Description
CurrentDomainAssemblyResolve
 Standard resolver function used by Rhino in execution context. This is added to the Current AssemblyResolve.
CurrentDomainReflectionOnlyAssemblyResolve
 Standard resolver function used by Rhino in reflection-only context. This is added to the Current ReflectionOnlyAssemblyResolve.
Top
See Also
Reference
AssemblyResolver Class
Rhino.Runtime Namespace