RhinoCommon API
Surface Properties
The Surface type exposes the following members.
Properties
Name | Description
IsSolid
 Gets a values indicating whether a surface is solid.
IsSubDFriendly
 Returns true if the surface is a non-rational, uniform, natural or periodic, cubic NURBS surface. Otherwise, false is returned.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace