RhinoCommon API
FilletSurfaceResults Properties
The Brep.FilletSurfaceResults type exposes the following members.
Properties
Name | Description
Face0
 The first face used as input for the fillet surface generation
Face1
 The second face used as input for the fillet surface generation
Fillets
 The fillet surfaces created between the first and second face
OutBreps0
 If the first input face was trimmed, the trimmed results are returned here
OutBreps1
 If the second input face was trimmed, the trimmed results are returned here
Top
See Also
Reference
Brep.FilletSurfaceResults Class
Rhino.Geometry Namespace