RhinoCommon API
DimStyleTable Properties
The DimStyleTable type exposes the following members.
Properties
Name | Description
BuiltInStyles
 Creates an array of default DimensionStyle objects
ComponentType
 Returns DimStyle.
 (Overrides CommonComponentTable<T>.ComponentType.)
Current
 Returns an instance of the current DimensionStyle.
CurrentDimensionStyle |  Obsolete.
 Do not use. Use the Current property.
CurrentId
CurrentIndex
Item
Top
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace