RhinoCommon API
CustomUndoEventArgs Properties
The CustomUndoEventArgs type exposes the following members.
Properties
Name | Description
ActionDescription
CommandId
CreatedByRedo
Document
Tag
UndoSerialNumber
Top
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace