RhinoCommon API
Cone Properties
The Cone type exposes the following members.
Properties
Name | Description
ApexPoint
Point at tip of the cone.
Axis
Unit vector axis of cone.
BasePoint
Center of base circle.
Height
 Gets or sets the height of the circular right cone.
IsValid
 true if plane is valid, height is not zero and radius is not zero.
Plane
 Gets or sets the base plane of the cone. The apex of the cone is at the plane's origin.
Radius
 Gets or sets the radius of the cone.
Unset
 Gets an invalid Cone.
Top
See Also
Reference
Cone Structure
Rhino.Geometry Namespace