RhinoCommon API
PlaneSurface Properties
The PlaneSurface type exposes the following members.
Properties
Name | Description
Plane
 Gets or sets the plane surface's plane.
Top
See Also
Reference
PlaneSurface Class
Rhino.Geometry Namespace