RhinoCommon API
ClassArrayString Properties
The ClassArrayString type exposes the following members.
Properties
Name | Description
Count
 Gets the number of strings in this array.
Top
See Also
Reference
ClassArrayString Class
Rhino.Runtime.InteropWrappers Namespace