RhinoCommon API
File3dmPlugInData Properties
The File3dmPlugInData type exposes the following members.
Properties
Name | Description
PlugInId
 Gets the id of the plug-in that is associated with this custom data.
Top
See Also
Reference
File3dmPlugInData Class
Rhino.FileIO Namespace