RhinoCommon API
ToolbarFile Properties
The ToolbarFile type exposes the following members.
Properties
Name | Description
GroupCount
 Get the number of toolbar groups in the toolbar file.
Id
 Gets the id of the toolbar file.
Name
 Gets the name, or alias, of the toolbar file.
Path
 Gets the full path to the toolbar file.
ToolbarCount
 Get the number of toolbars in the toolbar file.
Top
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace