RhinoCommon API
RenderMeshes Properties
The RenderMeshes type exposes the following members.
Properties
Name | Description
Document
 The document with which this IRenderMeshes object is associated.
Hash
 The running hash for these render meshes.
InstanceCount
 The number of instance objects in this collection.
ObjectId
 The ObjectId with which this IRenderMeshes object is associated.
Top
See Also
Reference
RenderMeshes Class
Rhino.Render.CustomRenderMeshes Namespace