RhinoCommon API
NotificationButtonClickedArgs Properties
The NotificationButtonClickedArgs type exposes the following members.
Properties
Name | Description
ButtonClicked
 The button that was clicked.
Notification
 The notification whose button was clicked.
Top
See Also
Reference
NotificationButtonClickedArgs Class
Rhino.Runtime.Notifications Namespace