RhinoCommon API
SimpleArrayGuidPointer Properties
The SimpleArrayGuidPointer type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of elements in this array.
Item
 Get the Guid at index
Top
See Also
Reference
SimpleArrayGuidPointer Class
Rhino.Runtime.InteropWrappers Namespace