RhinoCommon API
CommandStyleAttribute Properties
The CommandStyleAttribute type exposes the following members.
Properties
Name | Description
Styles
 Gets the associated style.
Top
See Also
Reference
CommandStyleAttribute Class
Rhino.Commands Namespace