RhinoCommon API
FileIgsWriteOptions Properties
The FileIgsWriteOptions type exposes the following members.
Properties
Name | Description
Author
CatiaTolsize
CatiaVersion
ClampCurveEndKnots
TRUE means all periodic NURBS will have their end knots clamped.
ClampSurfaceEndKnots
CompositeCurvesAsSingleBsplines
CurveMaxDegree
d >= 3 means all NURBS curves with degree > d be fit with degree d non-rational cubics.
DoublesUseE
Use "E" instead of the correct "D" for double scientific notation to get around IGES bug in FastShip.
EolType
IGES files are ASCII files. You need to specify the flavor of the ASCII end of line marker.Possibilities are: TL_LF: line feed (unix) TL_CRLF: carriage return, line feed (Microsoft) TL_CR: carriage return (Apple)
FitRationalCurves
true means all rational NURBS will be fit with non-rational cubics.
FitRationalSurfaces
true means non-conic rational surfaces will be fit with non-rational surfaces
FlagDependentCurvesAs03
FlagDependentSurfacesAs03
ForceBezierKnotsOnCurves
ForceBezierKnotsOnSurfaces
true means all NURBS surfaces will have their internal knots set to full multiplicity.
ForceTrimmedSurfaces
true means all surfaces will be exported as 143 or 144s CATIA may like this better.
HideDependentObjects
IgesStringType
IgesVersion
Version of IGES spec to write
MaxSurfaceDegree
MeshType
NotesInStartSection
NoZerosInTSection
The GridTool program used at NASA Langly cannot read IGES files that have leading zeros in the T section.
Organization
PointType
PolySurfaceType
Receiver
RenderColorAsIgesColor
Scale
(model space units)/(real world units) For example, if unit_system = TL_INCHES and 1 model space unit = 8 inches, then scale = 0.125.Note that model space units are stored in the IGES file.
Sender
SimplifyCurves
TRUE means NURBS that are lines or arcs will be written as lines or arcs instead of 126's
SimplifySurfaces
true means that NURBS surfaces that are ruled surfaces or surfaces of revolution will be written as ruled surfaces or surfaces of revolution.
SolidType
SplitBiPolarSurfaces
SplitClosedSurfaces
SurfaceType
Tolerance
In model space units specified above
Units
UseParentLabelOnCurves
copy parent label to dependent curves
UseParentLabelOnSurfaces
copy parent label to dependent srfs
WriteNonPlanarUnitNormal
true means the UnitNormal will be written regardless, even if the curve is non planar
Top
See Also
Reference
FileIgsWriteOptions Class
Rhino.FileIO Namespace