RhinoCommon API
MappingChannelCollection Properties
The MappingChannelCollection type exposes the following members.
Properties
Name | Description
Channels
 Enumerate all available channels in this mapping
Count
 Get count of MappingChannels in this collection
Item
 Get MappingChannel on index
SingleMapping
Top
See Also
Reference
MappingChannelCollection Class
Rhino.Render.ChangeQueue Namespace