RhinoCommon API
FloatField Properties
The FloatField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
FloatField Class
Rhino.Render.Fields Namespace