RhinoCommon API
PreviewLighting Properties
The PreviewLighting type exposes the following members.
Properties
Name | Description
CppPointer
 CppPointer for PreivewLighting
Top
See Also
Reference
PreviewLighting Class
Rhino.Render Namespace