RhinoCommon API
ThicknessAnalysisSettingsState Properties
The ThicknessAnalysisSettingsState type exposes the following members.
Properties
Name | Description
DistanceRange
 The distance range.
ShowIsoCurves
 Get or sets the display of surface isocurves.
Top
See Also
Reference
ThicknessAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace