RhinoCommon API
SubDSurfaceInterpolator Properties
The SubDSurfaceInterpolator type exposes the following members.
Properties
Name | Description
ContextId
 The context assigned id. This id is provided for applications using ON_SubDSurfaceInterpolator. It is not inspected or used in any part of the interpolation setup or calculations.
MaximumRecommendedInterpolatedVertexCount
 Interpolation requires building a solver. We estimate that this solver will work in reasonnable time if the number of interplolated vertices is smaller than MaximumInterpolatedVertexCount. However, given sufficient time, memory, and CPU resources, the code will work with any value. In version 8.0, this value is 1000.
Top
See Also
Reference
SubDSurfaceInterpolator Class
Rhino.Geometry Namespace