RhinoCommon API
DirectionGripUserInterfaceObject Properties
The DirectionGripUserInterfaceObject type exposes the following members.
Properties
Name | Description
ArrowRadius
 Size of direction end shape
ArrowShape
 Shape used for end of direction line
DirectionLineLength
 Length of direction line in pixel units
GripDirection
 Constrained direction of grip
GripPointVisible
 Is the grip point itself drawn
OneWay
 Is the grip a single direction grip
Top
See Also
Reference
DirectionGripUserInterfaceObject Class
Rhino.UI Namespace