RhinoCommon API
NamedPositionTable Properties
The NamedPositionTable type exposes the following members.
Properties
Name | Description
Count
Number of Named Positions in the table.
Document
Document that owns this table.
Ids
Array of Named Position Guids.
Names
Array of Named Position names.
Top
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace