RhinoCommon API
ContentUuids Properties
The ContentUuids type exposes the following members.
Properties
Name | Description
AddTextureType
AdvancedDotTextureType
BasicEnvironmentCCI
BasicEnvironmentType
BasicMaterialCCI
BasicMaterialType
BitmapTextureType
BlendMaterialCCI
BlendMaterialType
BlendTextureType
CompositeMaterialCCI
CompositeMaterialType
CrossHatchBumpTexture
CubeMapTextureType
DefaultEnvironmentInstance
DefaultMaterialInstance
DisplayAttributeMaterialType
DotBumpTexture
DoubleSidedMaterialType
EmissionMaterialType
ExposureTextureType
EXRTextureType
FBmTextureType
GemMaterialType
GlassMaterialType
GradientTextureType
GraniteTextureType
GridTextureType
GritBumpTexture
HatchBumpTexture
HDRTextureType
LeatherBumpTexture
MarbleTextureType
MaskTextureType
MetalMaterialType
MultiplyTextureType
NoiseTextureType
PaintMaterialType
PerlinMarbleTextureType
PerturbingTextureType
PhysicallyBasedMaterialType
PhysicalSkyTextureType
PictureMaterialType
PlasterMaterialType
PlasticMaterialType
ProjectionChangerTextureType
RealtimeDisplayMaterialType
ResampleTextureType
SimpleBitmapTextureType
SingleColorTextureType
SpeckleBumpTexture
StuccoTextureType
Texture2DCheckerTextureType
Texture3DCheckerTextureType
TextureAdjustmentTextureType
TileTextureType
TurbulenceTextureType
V8BlendMaterialType
 Rhino V8 Blend material type Guid
WavesTextureType
WoodBumpTexture
WoodTextureType
Top
See Also
Reference
ContentUuids Class
Rhino.Render Namespace