RhinoCommon API
FileGtsWriteOptions Properties
The FileGtsWriteOptions type exposes the following members.
Properties
Name | Description
MeshingParameters
Top
See Also
Reference
FileGtsWriteOptions Class
Rhino.FileIO Namespace