RhinoCommon API
Font Properties
The Font type exposes the following members.
Properties
Name | Description
AscentOfCapital
 The font's typographic capital height, in the design units reported by UnitsPerEm. This is the metric a "text height" is measured against, so text of height h renders its capitals h tall. Zero when the font has no usable metrics.
Bold
Description
 Returns a long description that includes family, face, weight, stretch and style information. Generally not useful for finding matching fonts.
EnglishFaceName
 Returns English Face name
EnglishFamilyName
EnglishQuartetName
FaceName
 Returns Face name
FamilyName
FamilyPlusFaceName
 Returns concatenated Family and Face names
IsEngravingFont
IsGeometricToleranceFont
IsInstalled
Is this font installed on the system
IsSimulated
IsSingleStrokeFont
IsSymbolFont
Italic
LogfontName
 Returns Windows LOGFONT Face name
PointSize
PostScriptName
 Returns the Font PostScriptName - "Apple font name"
QuartetName
RichTextFontName
 Returns the Font RichTextFontName used in RTF strings: {\\fonttbl...{\\fN RichTextFontName;}...}
Stretch
Strikeout
Style
Underlined
UnitsPerEm
 The number of design units per em in this font's normalized metrics. Together with AscentOfCapital this converts between an em size - the "font size" used by CSS, SVG, PDF and most page layout - and the height of a capital letter, which is what Rhino means by a text height. Zero when the font has no usable metrics.
Weight
Top
See Also
Reference
Font Class
Rhino.DocObjects Namespace