RhinoCommon API
DecalCreateParams Properties
The DecalCreateParams type exposes the following members.
Properties
Name | Description
DecalMapping
DecalProjection
EndLatitude
EndLongitude
Height
MapToInside
MaxU
MaxV
MinU
MinV
Origin
Radius
StartLatitude
StartLongitude
TextureInstanceId
Transparency
VectorAcross
VectorUp
Top
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace