RhinoCommon API
PreviewBackground Properties
The PreviewBackground type exposes the following members.
Properties
Name | Description
CppPointer
 CppPointer for PreivewLighting
Top
See Also
Reference
PreviewBackground Class
Rhino.Render Namespace