RhinoCommon API
LightTable Properties
The LightTable type exposes the following members.
Properties
Name | Description
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of lights in the light table. Does not include Sun or Skylight.
 (Overrides CommonComponentTable<T>.Count.)
DefaultLight
 Gets the default light that Rhino uses when no other lights illuminate the scene.
Document
Document that owns this light table.
Item
Skylight
Sun
 Gets the Sun instance that is applied to the document.
If the RDK is loaded, an instance is always returned.
Top
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace