RhinoCommon API
PageSettings Properties
The PageSettings type exposes the following members.
Properties
Name | Description
BottomMarginMillimeters
Bottom margin in millimeters.
HeightMillimeters
Paper height in millimeters.
LeftMarginMillimeters
Left margin in millimeters.
PageNumber
The page number of this layout.
PrinterName
Name of the printer this layout targets, if any.
RightMarginMillimeters
Right margin in millimeters.
TopMarginMillimeters
Top margin in millimeters.
WidthMillimeters
Paper width in millimeters.
Top
See Also
Reference
PageSettings Class
Rhino.DocObjects Namespace