RhinoCommon API
FileRawWriteOptions Properties
The FileRawWriteOptions type exposes the following members.
Properties
Name | Description
MeshingParameters
Top
See Also
Reference
FileRawWriteOptions Class
Rhino.FileIO Namespace