RhinoCommon API
PageViewGroup Properties
The PageViewGroup type exposes the following members.
Properties
Name | Description
ComponentStatus
 Gets or sets the status of the page view group.
 (Overrides ModelComponent.ComponentStatus.)
ComponentType
 Returns Group.
 (Overrides ModelComponent.ComponentType.)
Description
 Gets and sets a brief description of the page view group.
IsExpanded
 Gets or sets the expanded state of the page view group.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
MemberCount
 Get the number of page views that are members of this page view group.
Name
Gets or sets the name of this page view group.
 (Overrides ModelComponent.Name.)
SortIndex
 Gets the runtime index used to sort page view groups.
UserStringCount
 Gets the amount of user strings.
Top
See Also
Reference
PageViewGroup Class
Rhino.DocObjects Namespace