RhinoCommon API
FileAiWriteOptions Properties
The FileAiWriteOptions type exposes the following members.
Properties
Name | Description
AIScale
AiUnits
ExportHatchesAsSolidFills
ExportViewBoundary
OrderLayers
PreserveModelScale
RhinoScale
UseCMYK
Top
See Also
Reference
FileAiWriteOptions Class
Rhino.FileIO Namespace