RhinoCommon API
File3dmShutLining Properties
The File3dmShutLining type exposes the following members.
Properties
Name | Description
AutoUpdate
 Specifies whether the shut-lining automatically updates or not.
Faceted
 Specifies whether the shut-lining is faceted or not.
ForceUpdate
 Specifies whether updating is forced or not.
On
 Specifies whether shut-lining is enabled or not.
Top
See Also
Reference
File3dmShutLining Class
Rhino.FileIO Namespace