RhinoCommon API
UnknownUserDataEventArgs Properties
The PlugIn.UnknownUserDataEventArgs type exposes the following members.
Properties
Name | Description
Document
PlugInId
Top
See Also
Reference
PlugIn.UnknownUserDataEventArgs Class
Rhino.PlugIns Namespace