RhinoCommon API
File3dsReadOptions Properties
The File3dsReadOptions type exposes the following members.
Properties
Name | Description
ImportCameras
ImportLights
Unweld
UnweldAngle
Top
See Also
Reference
File3dsReadOptions Class
Rhino.FileIO Namespace