RhinoCommon API
SubDDisplayParameters Properties
The SubDDisplayParameters type exposes the following members.
Properties
Name | Description
AdaptiveDisplayMeshQuadMaximum
 When the SubD display density is adaptive (default), AdaptiveMeshQuadMaximum specifies the approximate number of display mesh quads to permit before reducing the SubD display mesh density.
DisplayDensityIsAbsolute
 True if the SubD display density setting is absolute.
DisplayDensityIsAdaptive
 True if the SubD display density setting is adaptive and approximate display mesh quad count is capped at SubDDisplayParameters::AdaptiveDisplayMeshQuadMaximum.
MeshLocation
 The MeshLocation property determines if the mesh is on the SubD's control net or the SubD's surface.
Top
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace