RhinoCommon API
Command Properties
The Command type exposes the following members.
Properties
Name | Description
CommandContextHelpUrl
 Gets the URL of the command contextual help. This is usually a location of a local CHM file.
The default implementation return an empty string.
EnglishName
 Gets the name of the command. This method is abstract.
HistoryReplayOnObjectAttributeChange
 By default, object attribute changes do not trigger history replay. Set this property to true, typically in the command's constructor, if you want objects created with this command to trigger history replay when their attributes change.
Id
 Gets the unique ID of this command. It is best to use a Guid attribute for each custom derived command class since this will keep the id consistent between sessions of Rhino GuidAttribute
LastCommandId
 Gets the ID of the last commands.
LastCommandResult
 Gets the result code of the last command.
LocalName
 Gets the local name of the command.
PlugIn
 Gets the plug-in where this commands is placed.
Settings
 Gets the settings of the command.
Top
See Also
Reference
Command Class
Rhino.Commands Namespace