RhinoCommon API
XAccess Properties
The Point3dList.XAccess type exposes the following members.
Properties
Name | Description
Item
 Gets or sets the x-coordinate of the specified point.
Top
See Also
Reference
Point3dList.XAccess Class
Rhino.Collections Namespace