RhinoCommon API
OpenGLSettings Properties
The OpenGLSettings type exposes the following members.
Properties
Name | Description
AntialiasLevel
Gets or sets the anti-alias level used by OpenGL viewports
Top
See Also
Reference
OpenGLSettings Class
Rhino.ApplicationSettings Namespace