RhinoCommon API
CurveBooleanRegions Properties
The CurveBooleanRegions type exposes the following members.
Properties
Name | Description
PlanarCurveCount
 Returns number of planar curves that were calculated by Curve.CreateBooleanRegions.
PointCount
 If this object were created using the Curve.CreateBooleanRegions override that accepts a collection of points as input, then this value will be equal to the length of the points collection.
RegionCount
 Returns the number of curve regions. A curve region is a collection of curves that bound a single connected region of the plane.
Top
See Also
Reference
CurveBooleanRegions Class
Rhino.Geometry Namespace