RhinoCommon API
PreviewAppearance Properties
The PreviewAppearance type exposes the following members.
Properties
Name | Description
CppPointer
 Previewappearances c++ pointer
MetaData
 Previewappearance MetaData
Scale
 Size - used in the UI. Always meters.
SceneScale
 Scene size - the actual size that is rendered
Top
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace