RhinoCommon API
FileTxtReadOptions Properties
The FileTxtReadOptions type exposes the following members.
Properties
Name | Description
CreatePointCloud
Delimiter
DelimiterCharacter
Top
See Also
Reference
FileTxtReadOptions Class
Rhino.FileIO Namespace