RhinoCommon API
StringWrapper Properties
The StringWrapper type exposes the following members.
Properties
Name | Description
ConstPointer
 Gets the constant pointer (constant ON_wString*).
NonConstPointer
 Gets the non-constant pointer (ON_wString*).
Top
See Also
Reference
StringWrapper Class
Rhino.Runtime.InteropWrappers Namespace