RhinoCommon API
BoundingBox Properties
The BoundingBox type exposes the following members.
Properties
Name | Description
Area
 Gets the area of this BoundingBox.
Center
 Gets the point in the center of the bounding box.
Diagonal
 Gets the diagonal vector of this BoundingBox. The diagonal connects the Min and Max points.
Empty
 Gets an [Empty] bounding box. An Empty box is an invalid structure that has negative width.
IsValid
 Gets a value that indicates whether or not this bounding box is valid. Empty boxes are not valid, and neither are boxes with unset points.
Max
 Gets or sets the point in the maximal corner.
Min
 Gets or sets the point in the minimal corner.
Unset
 Gets a bounding box that has Unset coordinates for Min and Max.
Volume
 Gets the volume of this BoundingBox.
Top
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace