RhinoCommon API
NamedColorList Properties
The NamedColorList type exposes the following members.
Properties
Name | Description
Default
 Get the Rhino applications named color list.
Name
 The name of the color list, which may be displayed to the user.
Top
See Also
Reference
NamedColorList Class
Rhino.UI Namespace