RhinoCommon API
GroundPlane Properties
The GroundPlane type exposes the following members.
Properties
Name | Description
Altitude
 Height above world XY plane in model units. Auto-altitude is computed if enabled.
AutoAltitude
 Determines whether the ground plane is fixed by the Altitude property, or whether it is automatically placed at the lowest point in the model.
Enabled
 Determines whether the document ground plane is enabled.
MaterialInstanceId
 Id of material in material table for this ground plane.
ShadowOnly
 Determines whether the ground plane shows the material assigned, or whether it is transparent, but captures shadows.
ShowUnderside
 If this is off, the ground plane will not be visible when seen from below.
TextureOffset
 Texture mapping offset in world units.
TextureOffsetLocked
 Texture offset locked.
TextureRotation
 Texture mapping rotation around world origin + offset in degrees.
TextureSize
 Texture mapping single UV span size in world units.
TextureSizeLocked
 Texture size locked.
Top
See Also
Reference
GroundPlane Class
Rhino.Render Namespace