RhinoCommon API
SimpleArrayUint Properties
The SimpleArrayUint type exposes the following members.
Properties
Name | Description
Count
 Gets the number of elements in this array.
UnsignedCount
 Gets the number of elements in this array.
Top
See Also
Reference
SimpleArrayUint Class
Rhino.Runtime.InteropWrappers Namespace