RhinoCommon API
ParametersNames Properties
The PhysicallyBasedMaterial.ParametersNames type exposes the following members.
Properties
Name | Description
AmbientOcclusion |  Obsolete.
Anisotropic |  Obsolete.
AnisotropicRotation |  Obsolete.
BaseColor |  Obsolete.
BRDF |  Obsolete.
Bump |  Obsolete.
Clearcoat |  Obsolete.
ClearcoatBump |  Obsolete.
ClearcoatRoughness |  Obsolete.
Displacement |  Obsolete.
Emission |  Obsolete.
Metallic |  Obsolete.
Normal |  Obsolete.
Opacity |  Obsolete.
OpacityIor |  Obsolete.
OpacityRoughness |  Obsolete.
Roughness |  Obsolete.
Sheen |  Obsolete.
SheenTint |  Obsolete.
Smudge |  Obsolete.
Specular |  Obsolete.
SpecularTint |  Obsolete.
Subsurface |  Obsolete.
SubsurfaceScatteringColor |  Obsolete.
SubsurfaceScatteringRadius |  Obsolete.
Top
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace