RhinoCommon API
LightTableEventArgs Properties
The LightTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
LightIndex
NewState
OldState
Top
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace