RhinoCommon API
RuntimeDocumentDataTable Properties
The RuntimeDocumentDataTable type exposes the following members.
Properties
Name | Description
Document
Top
See Also
Reference
RuntimeDocumentDataTable Class
Rhino.DocObjects.Tables Namespace