RhinoCommon API
PreviewRenderedEventArgs Properties
The PreviewRenderedEventArgs type exposes the following members.
Properties
Name | Description
Bitmap
 The Bitmap of the rendered preview
PreviewJobSignature
 The Preview Job Signature associated with the rendered preview
Quality
 The Bitmap of the rendered preview
Top
See Also
Reference
PreviewRenderedEventArgs Class
Rhino.Render Namespace