RhinoCommon API
FileObjWriteOptions Properties
The FileObjWriteOptions type exposes the following members.
Properties
Name | Description
ActualFilePathOnMac
CreateNgons |  Obsolete.
 Setting to enable/disable the creation of ngons for the output
CullUnnecessaryVertexesInNgons
 Setting to determine whether interior collinear vertexes are part of the ngon.
EolType
ExportAsTriangles
 Enable/disable export of faces as triangles.
ExportGroupNameLayerNames
 Setting to determine whether object, group or layer names will become "g"s in the OBJ output file
ExportMaterialDefinitions
 Setting to write an .mtl file and "usemtl"s in the obj file
ExportNormals
 Enable/disable export of vertex normals, if they exist.
ExportObjectNames
 Setting to determine what object names in Rhino will become in the OBJ output file
ExportOpenMeshes
 Enable/Disable bailing when an open mesh is encountered.
ExportTcs
 Enable/disable export of texture coordinates, if they exist.
ExportVcs
 Enable/disable export of vertex colors, if they exist.
IncludeUnweldedEdgesInNgons
 Setting to determine whether unwelded edges are ignored in the creation of an ngon.
MapZtoY
 Setting to transform Rhino's Z axis to OBJ's Y axis
MergeNestedGroupingNames
 Setting to merge nested layer or group names into a single OBJ group name
MeshParameters
 Mesh parameters to use when meshing geometry that is not already a mesh.
MeshType
MinNgonFaceCount
 Minimum number of faces to consider creation of ngon
NgonMode
ObjectType
PolylineType
SignificantDigits
 Number of significant digits to write out for floating point numbers
SortObjGroups
 Setting to enable/disable sorting of OBJ groups
SubDMeshType
SubDSurfaceMeshingDensity
 Determines how coarse the mesh output will be when surface meshing subd objects See comments for ON_SubDDisplayParameters in opennurbs_mesh.h for details regarding numbers used.
TrimCurveType
 trimming curve option
UnderbarMaterialNames
 Enable/disable replacing white space with under-bars in material names.
UseDisplayColorForMaterial
 Setting to display color as material when material index for object is -1.
UseRelativeIndexing
 Determines whether to use relative indexing. TRUE = use relative (negative) indexing FALSE = use absolute (positive) indexing
UseRenderMeshes
 Use existing or generate render meshes instead of calling RhinoObject.MeshObjects.
UseSimpleDialog
 Determines whether to use the simple or detailed meshing dialog.
VcsFormat
 Export vertex colors as 0 == floats (0.0-1.0) or 1 == ints (0-255)
WrapLongLines
 Setting to enable/disable line wrapping with "\"s
Top
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace