RhinoCommon API
FilePdfEventArgs Properties
The FilePdfEventArgs type exposes the following members.
Properties
Name | Description
Pdf
 The document that is about to be written
Top
See Also
Reference
FilePdfEventArgs Class
Rhino.FileIO Namespace