RhinoCommon API
MouseCallbackEventArgs Properties
The MouseCallbackEventArgs type exposes the following members.
Properties
Name | Description
CtrlKeyDown
MouseButton
ShiftKeyDown
View
ViewportPoint
Top
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace