RhinoCommon API
CommonComponentTable<T> Properties
The CommonComponentTable<T> generic type exposes the following members.
Properties
Name | Description
ComponentType
 Returns the actual component type of a table.
Count
 Returns the count of all items, including deleted ones.
Top
See Also
Reference
CommonComponentTable<T> Class
Rhino.FileIO Namespace