RhinoCommon API
OptionInteger Properties
The OptionInteger type exposes the following members.
Properties
Name | Description
CurrentValue
InitialValue
Top
See Also
Reference
OptionInteger Class
Rhino.Input.Custom Namespace