RhinoCommon API
FileAmfWriteOptions Properties
The FileAmfWriteOptions type exposes the following members.
Properties
Name | Description
MeshingParameters
Top
See Also
Reference
FileAmfWriteOptions Class
Rhino.FileIO Namespace