RhinoCommon API
ZebraAnalysisSettings Properties
The ZebraAnalysisSettings type exposes the following members.
Properties
Name | Description
ShowIsoCurves
 Get or sets the display of surface isocurves.
StripeColor
 Gets or sets the stripe color.
StripeThickness
 Gets or sets the stripe thickness, where 0 = thinnest and 6 = thickest.
VerticalStripes
 Set to true for vertical stripes, or false for horizontal stripes.
Top
See Also
Reference
ZebraAnalysisSettings Class
Rhino.ApplicationSettings Namespace