RhinoCommon API
ColorStop Properties
The ColorStop type exposes the following members.
Properties
Name | Description
Color
Position
 Parameter that Color is defined at
Top
See Also
Reference
ColorStop Structure
Rhino.Display Namespace