RhinoCommon API
NeverRepeatList Properties
The NeverRepeatList type exposes the following members.
Properties
Name | Description
UseNeverRepeatList
 Only use the list if somebody modifies it via CRhinoAppSettings::SetDontRepeatCommands(). Return value of true means CRhinoCommand don't repeat flags will be ignored and the m_dont_repeat_list will be used instead. false means the individual CRhinoCommands will determine if they are repeatable.
Top
See Also
Reference
NeverRepeatList Class
Rhino.ApplicationSettings Namespace