RhinoCommon API
DracoCompression Properties
The DracoCompression type exposes the following members.
Properties
Name | Description
NormalAttributePosition
 The attribute position for normals when compressed
TextureCoordinatesAttributePosition
 The attribute position for texture coordinates when compressed
VertexAttributePosition
 The attribute position for vertices when compressed
VertexColorAttributePosition
 The attribute position for vertex colors when compressed
Top
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace