RhinoCommon API
SweepTwoRail Properties
The SweepTwoRail type exposes the following members.
Properties
Name | Description
AngleToleranceRadians
 Gets or sets the angle tolerance in radians.
AutoAdjust
 Set to true to have shape curves adjusted, sorted, and matched automatically. This will produce results comparable to Rhino's Sweep2 command. Set to false to not have shape curves adjusted, sorted, and matched automatically.
ClosedSweep
 If the input rails are closed, ClosedSweep determines if the swept Breps will also be closed.
MaintainHeight
 Removes the association between the height scaling from the width scaling.
SweepTolerance
 Gets or sets the sweeping tolerance.
UseLegacySweeper
 Set to true if you want to use the legacy, low-level sweeper found in earlier versions of Rhino.
Top
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace