RhinoCommon API
WorksessionFileLayerValues Properties
The WorksessionFileLayerValues type exposes the following members.
Properties
Name | Description
Color
Gets or sets the layer color.
Locked
Gets or sets whether the layer is locked.
Visible
Gets or sets whether the layer is visible.
Top
See Also
Reference
WorksessionFileLayerValues Class
Rhino.FileIO Namespace