RhinoCommon API
MeshCurvatureStats Properties
The MeshCurvatureStats type exposes the following members.
Properties
Name | Description
Average
 Get the average of "finite" values.
AverageDeviation
 Get the average deviation of "finite" values.
Count
 Gets the number of "finite" values.
CurvatureStyle
 Gets the curvature style of the curvature statistics.
InfiniteCount
 Gets the number of "infinite" values.
Infinity
 Curvature values greater than or equal to this are considered infinite and not used to compute the average of "finite" values or the average deviation of "finite" values.
Mode
 Get the mode of "finite" values.
Range
 Gets the minumum and maximum curvature based on the value of CurvatureStyle: If CurvatureStyle.GaussianCurvature, the min Gaussian curvature and the max Gaussian curvature. If CurvatureStyle.MeanCurvature, the min unsigned mean curvature and the max unsigned mean curvature. If CurvatureStyle.MinimumCurvature, the min maximum unsigned radius of curvature and the max maximum unsigned radius of curvature. If CurvatureStyle.MaximumCurvature, the min minimum unsigned radius of curvature and the the max minimum unsigned radius of curvature.
Top
See Also
Reference
MeshCurvatureStats Class
Rhino.Geometry Namespace