RhinoCommon API
HatchLine Properties
The HatchLine type exposes the following members.
Properties
Name | Description
Angle
 Gets and sets the angle, in radians, of the hatch line. The angle is measured counter-clockwise from the x-axis.
BasePoint
 Get and sets this line's 2d base point.
DashCount
 Gets the number of dashes + gaps in this line.
GetDashes
 Gets all of the dashes.
IsValid
 Verifies a hatch line is valid.
Offset
 Get and sets this line's 2d offset for line repetitions. Offset.X is shift parallel to line. Offset.Y is spacing perpendicular to line.
PatternLength
 Get the total length of a pattern repeat.
Top
See Also
Reference
HatchLine Class
Rhino.DocObjects Namespace