RhinoCommon API
RenderPrimitive Properties
The RenderPrimitive type exposes the following members.
Properties
Name | Description
BoundingBox
 The bounding box for this primitive.
InstanceTransform
 Instance reference transform or Identity if not an instance reference.
PrimitiveType
 Call this before extracting meshes if you support render primitives to get the RenderPrimitiveType of this mesh then call the associated TryGetSphere(Sphere), TryGetPlane(PlaneSurface), TryGetCone(Cone, Plane), or TryGetBox(Box) method. Calling the Mesh() property will mesh the primitive and return a mesh always.
RenderMaterial
 The RenderMaterial associated with this mesh or null if there is not one.
RhinoObject
 The Rhino object associated with this render primitive.
Top
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace