RhinoCommon API
BezierSurface Properties
The BezierSurface type exposes the following members.
Properties
Name | Description
Dimension
Dimension of Bezier
IsRational
 Gets a value indicating whether or not the surface is rational. Rational surfaces have control-points with custom weights.
IsValid
Tests an object to see if it is valid.
Top
See Also
Reference
BezierSurface Class
Rhino.Geometry Namespace