RhinoCommon API
MaterialRefs Properties
The MaterialRefs type exposes the following members.
Properties
Name | Description
Count
 Gets the number of elements contained in this dictionary
IsReadOnly
 IDictionary required property, always returns false for this dictionary.
Item
 Gets or sets the element with the specified plug-in Id.
Keys
 Gets an ICollection containing the plug-in Id's in this dictionary.
Values
 Gets an ICollection containing the MaterialRef objects in this dictionary.
Top
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace