RhinoCommon API
RenderMeshProvider Properties
The RenderMeshProvider type exposes the following members.
Properties
Name | Description
Name
 The localized name of the provider for UI display.
NonObjectIds
 A provider may optionally return a collection of non-object Ids that it will provide custom render primitives for. An example of this is Grasshopper, which which will typically return a collection of the Ids of each CustomPreview component.
ProviderId
 The localized name of the provider for UI display.
Top
See Also
Reference
RenderMeshProvider Class
Rhino.Render.CustomRenderMeshes Namespace