RhinoCommon API
SectionStyleTable Properties
The SectionStyleTable type exposes the following members.
Properties
Name | Description
ActiveCount
 Returns number of section styles in the table, excluding deleted section styles.
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
 Returns number of section styles in the section style table, including deleted section styles.
 This count also spans table slots emptied by a purge, so it can be larger than the number of section styles that are actually there. See the remarks on the indexer.
Document
 Document that owns this table.
Item
 Conceptually, the section style table is an array of section styles. The operator[] can be used to get individual section styles. A section style is either active or deleted and this state is reported by SectionStyle.IsDeleted.
Top
See Also
Reference
SectionStyleTable Class
Rhino.DocObjects.Tables Namespace