RhinoCommon API
MouseState Properties
The MouseState type exposes the following members.
Properties
Name | Description
Button
 Which button or buttons are currently pressed
DeviceLocation
 Where the mouse is, in device pixels of the surface this event came from.
DpiScale
 Device pixels per logical pixel for the surface this event came from. 1.0 when that is not known.
FrustumLine
 Line in frustum that the active mouse position covers
Location
 Where the mouse is, in logical pixels of the surface this event came from. This is the coordinate system on screen controls are laid out in, so it is the one to hit test against.
View
 View that is being used mouse tests
Top
See Also
Reference
MouseState Class
Rhino.UI Namespace