RhinoCommon API
GuidField Properties
The GuidField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
GuidField Class
Rhino.Render.Fields Namespace