RhinoCommon API
DirectionAnalysisSettingsState Properties
The DirectionAnalysisSettingsState type exposes the following members.
Properties
Name | Description
Color
 Gets or sets a color used to display the direction.
Direction
 Gets or sets whether to display the direction.
U
 Gets or sets whether to display the U dir.
V
 Gets or sets whether to display the V dir.
Top
See Also
Reference
DirectionAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace