RhinoCommon API
BoolField Properties
The BoolField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
BoolField Class
Rhino.Render.Fields Namespace