RhinoCommon API
ObjectGripsIds Properties
The ObjectGripsIds type exposes the following members.
Properties
Name | Description
CurveEditPoints
A grip at every Greville point of a curve. EditPtOn turns these on.
Default
 The object's own control points - what the PointsOn command turns on, and what differs from one object type to the next.
SubDEditPoints
A grip at every surface point of a SubD. EditPtOn turns these on.
Top
See Also
Reference
ObjectGripsIds Class
Rhino.DocObjects Namespace