RhinoCommon API
DraftAngleAnalysisSettings Properties
The DraftAngleAnalysisSettings type exposes the following members.
Properties
Name | Description
AngleRange
 The angle range.
ShowIsoCurves
 Show isoparametric curves.
UpDirection
 The up direction.
Top
See Also
Reference
DraftAngleAnalysisSettings Class
Rhino.ApplicationSettings Namespace