RhinoCommon API
CurvatureGraphSettingsState Properties
The CurvatureGraphSettingsState type exposes the following members.
Properties
Name | Description
CurveHairColor
 Gets or sets the curve hair color.
HairDensity
 Gets or sets the hair density.
HairScale
 Gets or sets the hair scale.
SampleDensity
 Gets or sets the sample density.
SrfUHair
 Gets or sets the whether to show surface U hairs
SrfVHair
 Gets or sets the whether to show surface V hairs
SurfaceUHairColor
 Gets or sets the surface U hair color.
SurfaceVHairColor
 Gets or sets the surface V hair color.
Top
See Also
Reference
CurvatureGraphSettingsState Class
Rhino.ApplicationSettings Namespace