RhinoCommon API
MarkupTable Properties
The MarkupTable type exposes the following members.
Properties
Name | Description
ActiveCount
 Returns number of markups in the table, excluding deleted markups.
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
 Returns number of markups in the table, including deleted markups.
Document
Document that owns this table.
Item
 Conceptually, the markup table is an array of markups. The operator[] can be used to get individual markups. A markup is either active or deleted and this state is reported by Markup.IsDeleted.
Top
See Also
Reference
MarkupTable Class
Rhino.DocObjects.Tables Namespace