RhinoCommon API
SimpleArrayByte Properties
The SimpleArrayByte type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of elements in this array.
Top
See Also
Reference
SimpleArrayByte Class
Rhino.Runtime.InteropWrappers Namespace