RhinoCommon API
SimpleArrayPoint3d Properties
The SimpleArrayPoint3d type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of points in this array.
Top
See Also
Reference
SimpleArrayPoint3d Class
Rhino.Runtime.InteropWrappers Namespace