RhinoCommon API
SubDVertexList Properties
The SubDVertexList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of SubD vertices.
First
 First vertex in this linked list of vertices
Top
See Also
Reference
SubDVertexList Class
Rhino.Geometry.Collections Namespace