RhinoCommon API
PageViewGroupTableEventArgs Properties
The PageViewGroupTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
NewState
OldState
PageViewGroupIndex
Top
See Also
Reference
PageViewGroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace