RhinoCommon API
FileGHSReadOptions Properties
The FileGHSReadOptions type exposes the following members.
Properties
Name | Description
AttachGhsData
RemoveColinearPoints
ViewType
Top
See Also
Reference
FileGHSReadOptions Class
Rhino.FileIO Namespace