RhinoCommon API
CustomRenderMeshProvider Properties
The CustomRenderMeshProvider type exposes the following members.
Properties
Name | Description
CurvePipingId
DisplacementId
EdgeSofteningId
Name
 The name of the provider for UI display.
ShutLiningId
ThickeningId
Top
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace