RhinoCommon API
CachedTextureCoordinates Properties
The CachedTextureCoordinates type exposes the following members.
Properties
Name | Description
Count
 Number of cached coordinates.
Dim
 Coordinate dimension: 2 = UV, 3 = UVW
IsReadOnly
 This collection is always read-only
Item
 Gets the element at the specified index. Never call the set method, it will always throw a NotSupportedException because this list is read-only.
MappingId
 The texture mapping Id.
Top
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace