RhinoCommon API
DisplayMaterial Properties
The DisplayMaterial type exposes the following members.
Properties
Name | Description
BackDiffuse
 Gets or sets the Diffuse color of the back side of the Material. The alpha component of the color will be ignored.
BackEmission
 Gets or sets the Emissive color of the back side of the Material. The alpha component of the color will be ignored.
BackShine
 Gets or sets the shine factor of the back side of the material (0.0 to 1.0)
BackSpecular
 Gets or sets the Specular color of the back side of the Material. The alpha component of the color will be ignored.
BackTransparency
 Gets or sets the transparency of the back side material (0.0 = opaque to 1.0 = transparent)
Diffuse
 Gets or sets the Diffuse color of the Material. The alpha component of the color will be ignored.
Emission
 Gets or sets the Emissive color of the Material. The alpha component of the color will be ignored.
IsTwoSided
Shine
 Gets or sets the shine factor of the material (0.0 to 1.0)
Specular
 Gets or sets the Specular color of the Material. The alpha component of the color will be ignored.
Transparency
 Gets or sets the transparency of the material (0.0 = opaque to 1.0 = transparent)
Top
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace