RhinoCommon API
PreviewSceneServer Properties
The PreviewSceneServer type exposes the following members.
Properties
Name | Description
CppPointer
 The CppPointer of PreviewSceneServer
Top
See Also
Reference
PreviewSceneServer Class
Rhino.Render Namespace