RhinoCommon API
UserInterfaceRadioButton Properties
The UserInterfaceRadioButton type exposes the following members.
Properties
Name | Description
Checked
 Is this the button that is on in its group? Turning a button on turns off every other button in its group. Setting this does not raise CheckedChanged; that is only for a state the user changed.
CheckedButtonInGroup
 The button in this button's group that is on, which can be this button, or null when nothing in the group has been turned on yet. The buttons have to have been added to a document for this to find anything, since it is the native side that keeps track of a group.
Group
 Which set of radio buttons this one belongs to. The default is 0. Two sets of radio buttons in the same container need different group numbers or they will turn each other off.
Top
See Also
Reference
UserInterfaceRadioButton Class
Rhino.UI Namespace