RhinoCommon API
Brep Properties
The Brep type exposes the following members.
Properties
Name | Description
Curves2D
 Parameter space trimming curves (used by trims)
Curves3D
 Pointers to 3d curves (used by edges)
Edges
 Gets the brep edges list accessor.
Faces
 Gets the brep faces list accessor.
HasRegionTopology
 Returns true if the Brep has region topology information, false otherwise.
IsManifold
 Gets a value indicating whether or not the Brep is manifold. Non manifold breps have at least one edge that is shared among three or more faces.
IsSolid
 Determines whether this brep is a solid, or a closed oriented manifold.
IsSurface
 Returns true if the Brep has a single face and that face is geometrically the same as the underlying surface. I.e., the face has trivial trimming.
In this case, the surface is the first face surface. The flag Brep.Faces[0].OrientationIsReversed records the correspondence between the surface's natural parametric orientation and the orientation of the Brep.
trivial trimming here means that there is only one loop curve in the brep and that loop curve is the same as the underlying surface boundary.
Loops
 Gets the brep loop list accessor.
SolidOrientation
 Gets the solid orientation state of this Brep.
Surfaces
 Parametric surfaces used by faces
Trims
 Gets the brep trims list accessor.
Vertices
 Gets the brep vertices list accessor.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace