RhinoCommon API
PackageManagerSettings Properties
The PackageManagerSettings type exposes the following members.
Properties
Name | Description
Sources
 semicolon separated list of paths/urls that the package manager uses for sources
Top
See Also
Reference
PackageManagerSettings Class
Rhino.ApplicationSettings Namespace