RhinoCommon API
CurveConstraint Properties
The Brep.CurveConstraint type exposes the following members.
Properties
Name | Description
Curve
 The constraint curve
Top
See Also
Reference
Brep.CurveConstraint Class
Rhino.Geometry Namespace