RhinoCommon API
RenderChannels Properties
The RenderChannels type exposes the following members.
Properties
Name | Description
CustomList
Mode
Top
See Also
Reference
RenderChannels Class
Rhino.Render Namespace