RhinoCommon API
TimeZone Properties
The TimeZone type exposes the following members.
Properties
Name | Description
Hours
 Gets hours of a time zone.
Latitude
 Returns the latitude of a major city nearby
Longitude
 Returns the Longitude of a major city nearby
Name
 Gets name of a time zone.
Top
See Also
Reference
TimeZone Class
Rhino.Render Namespace