RhinoCommon API
FileLwoWriteOptions Properties
The FileLwoWriteOptions type exposes the following members.
Properties
Name | Description
MeshingParameters
WriteVersion6
Top
See Also
Reference
FileLwoWriteOptions Class
Rhino.FileIO Namespace