RhinoCommon API
GetEllipsoid Properties
The GetEllipsoid type exposes the following members.
Properties
Name | Description
FirstPoint
 Returns the first point. If in "from foci" mode, then this is the first foci point.
IsModeFromFoci
 Indicates the ellipsoid was created from foci.
MarkFoci
 Indicates the user wants the ellipsoid foci marked with point objects.
Plane
 The plane the ellipsoid was created in.
SecondPoint
 Returns the second point. If in "from foci" mode, then this is the second foci point.
Top
See Also
Reference
GetEllipsoid Class
Rhino.Input.Custom Namespace