RhinoCommon API
MeshVertexList Properties
The MeshVertexList type exposes the following members.
Properties
Name | Description
Capacity
 Gets or sets the total number of vertices the internal data structure can hold without resizing.
Count
 Gets or sets the number of mesh vertices.
Item
 Gets or sets the vertex at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
UseDoublePrecisionVertices
 Set to true if the vertices should be stored in double precision
Top
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace