RhinoCommon API
ClippingPlane Properties
The ClippingPlane type exposes the following members.
Properties
Name | Description
Attributes
 Get the ClippingPlaneObject for this clipping plane
ClipViewports
 Get an array of RhinoViewports this clipping plane is supposed to clip.
Id
 Get Guid for this clipping plane
IsEnabled
 True if clipping plane is enabled
Plane
 Get the plane that represents this clipping plane
ViewIds
 Get list of Viewport IDs this clipping plane is supposed to clip.
Top
See Also
Reference
ClippingPlane Class
Rhino.Render.ChangeQueue Namespace