RhinoCommon API
FileEpsReadOptions Properties
The FileEpsReadOptions type exposes the following members.
Properties
Name | Description
EpsScale
EpsUnits
PreserveModelScale
RhinoScale
Top
See Also
Reference
FileEpsReadOptions Class
Rhino.FileIO Namespace