RhinoCommon API
AnnotationObjectBase Properties
The AnnotationObjectBase type exposes the following members.
Properties
Name | Description
AnnotationGeometry
 Get the annotation base geometry for this object
DisplayText
 Gets the text that is displayed to users.
HasMeasurableTextFields
 Test if the text in the annotation object contains fields that involve length, area, or volume measurements
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Top
See Also
Reference
AnnotationObjectBase Class
Rhino.DocObjects Namespace