RhinoCommon API
EndAnalysisSettingsState Properties
The EndAnalysisSettingsState type exposes the following members.
Properties
Name | Description
ClosedSeams
 Gets or sets whether to display the closed curve seam points.
Color
 Gets or sets a color used to display the points.
OpenEnds
 Gets or sets whether to display the open curve end points.
OpenStarts
 Gets or sets whether to display the open curve start points.
PolycurveJoints
 Gets or sets whether to display the polycurve joint points.
Top
See Also
Reference
EndAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace