RhinoCommon API
ParticleSystem Properties
The ParticleSystem type exposes the following members.
Properties
Name | Description
BoundingBox
DisplaySizesInWorldUnits
DrawRequiresDepthSorting
Top
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace