RhinoCommon API
Point3f Properties
The Point3f type exposes the following members.
Properties
Name | Description
IsValid
 Each coordinate of the point must pass the IsValidSingle(Single) test.
Origin
 Gets the value of a point at location 0,0,0.
Unset
 Gets the value of a point at location RhinoMath.UnsetValue,RhinoMath.UnsetValue,RhinoMath.UnsetValue.
X
 Gets or sets the X (first) component of the vector.
Y
 Gets or sets the Y (second) component of the vector.
Z
 Gets or sets the Z (third) component of the vector.
Top
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace