RhinoCommon API
LicenseLease Properties
The LicenseLease type exposes the following members.
Properties
Name | Description
Expiration
 The date when this lease will expire
GroupId
 ID of Rhino Accounts group that this lease came from
GroupName
 Name of Rhino Accounts group that this lease came from
IssuedAt
 The date this lease was issued
LeaseId
 The ID of this lease.
ProductEdition
 Edition of product that this lease is issued to. For example, "Commercial" or "Beta"
ProductId
 The ID of the product that this lease is issued to
ProductTitle
 Title of product that this lease is issued to. For example, "Rhino 6"
ProductVersion
 Version of product that this lease is issued to. For example, "6.0"
RenewableUntil
 The date when the license in the cloud zoo entity will expire, if any
UserId
 ID of Rhino Accounts user that was logged in when this lease was obtained
UserName
 Name of Rhino Accounts user that was logged in when this lease was obtained
Top
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace