RhinoCommon API
FilePlyReadOptions Properties
The FilePlyReadOptions type exposes the following members.
Properties
Name | Description
PLYModelUnits
Top
See Also
Reference
FilePlyReadOptions Class
Rhino.FileIO Namespace