RhinoCommon API
FileX3dvWriteOptions Properties
The FileX3dvWriteOptions type exposes the following members.
Properties
Name | Description
ExportTextureCoordinates
ExportVertexColors
ExportVertexNormals
MeshingParameters
Top
See Also
Reference
FileX3dvWriteOptions Class
Rhino.FileIO Namespace