RhinoCommon API
DisplayBitmapDrawList Properties
The DisplayBitmapDrawList type exposes the following members.
Properties
Name | Description
BoundingBox
MaximumCachedSortLists
 Maximum number of cached sort order index lists stored on this class. Default is 10, but depending on the number of points in this list you may get better performance by setting this value to a certain percentage of the point count.
SortAngleTolerance
 Angle in radians used to determine if an index list is "parallel enough" to a viewports camera angle. Default is 0.0873 radians (5 degrees)
Top
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace