RhinoCommon API
SimpleArrayPlane Properties
The SimpleArrayPlane type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of lines in this array.
Top
See Also
Reference
SimpleArrayPlane Class
Rhino.Runtime.InteropWrappers Namespace