RhinoCommon API
GumballAppearanceSettings Properties
The GumballAppearanceSettings type exposes the following members.
Properties
Name | Description
ArcThickness
in pixels.
ArrowHeadLength
in pixels.
ArrowHeadWidth
in pixels.
AxisThickness
in pixels.
ColorMenuButton
ColorX
Default is Red.
ColorY
Default is Green.
ColorZ
Default is Blue.
FreeTranslate
 When FreeTranslate is 1, the center translation control can be dragged in any direction and moves the object the gumball controls. When FreeTranslate is 2, the center translation control can be dragged in any direction and moves the object the gumball itself. The default value is 2.
MenuDistance
Distance of menu ball from center.
MenuEnabled
 When MenuEnabled is true, the menu "button" is drawn on the gumball. The default setting is true.
MenuSize
Radius of menu circle.
PlanarTranslationGripCorner
in pixels.
PlanarTranslationGripSize
in pixels.
Radius
in pixels.
RelocateEnabled
 When RelocateEnabled is true, the user can reposition the gumball by tapping the control key while dragging. Once the repostion drag is terminated by releasing the/ mouse button, ordinary editing resumes. The default setting is true.
RotateXEnabled
 When RotateX is true, the X rotation control is available. The default setting is true.
RotateYEnabled
 When RotateY is true, the Y rotation control is available. The default setting is true.
RotateZEnabled
 When RotateZ is true, the Z rotation control is available. The default setting is true.
ScaleGripSize
in pixels.
ScaleXEnabled
 When ScaleXEnabled is true, the X scale control is available. The default setting is true.
ScaleYEnabled
 When ScaleYEnabled is true, the Y scale control is available. The default setting is true.
ScaleZEnabled
 When ScaleZEnabled is true, the Z scale control is available. The default setting is true.
TranslateXEnabled
 TranslateXEnabled is true, the X axis translation control is available. The default setting is true.
TranslateXYEnabled
 When TranslateXY is true, the XY plane translation control is available in appropriate views. The default setting is true.
TranslateYEnabled
 TranslateYEnabled is true, the Y axis translation control is available. The default setting is true.
TranslateYZEnabled
 When TranslateYZ is true, the YZ plane translation control is available in appropriate views. The default setting is true.
TranslateZEnabled
 TranslateZEnabled is true, the Z axis translation control is available. The default setting is true.
TranslateZXEnabled
 When TranslateZX is true, the ZX plane translation control is available in appropriate views. The default setting is true.
Top
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace