RhinoCommon API
TextureMappingEventArgs Properties
The RhinoDoc.TextureMappingEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
NewMapping
OldMapping
Top
See Also
Reference
RhinoDoc.TextureMappingEventArgs Class
Rhino Namespace