RhinoCommon API
DoubleField Properties
The DoubleField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
DoubleField Class
Rhino.Render.Fields Namespace