RhinoCommon API
RhinoView Properties
The RhinoView type exposes the following members.
Properties
Name | Description
ActiveViewport
 The ActiveViewport is the same as the MainViewport for standard RhinoViews. In a RhinoPageView, the active viewport may be the RhinoViewport of a child detail object. Most of the time, you will use ActiveViewport unless you explicitly need to work with the main viewport.
ActiveViewportID
 Returns viewport ID for the active viewport. Faster than ActiveViewport function when working with page views.
Bounds
 Gets the size and location of the view including its non-client elements, in pixels, relative to the parent control.
ClientRectangle
 Gets the rectangle that represents the client area of the view.
DisplayPipeline
 Gets the display pipeline used for this view.
Document
EnableDrawing
 Gets or sets the 'drawing enabled' flag. By default, drawing is enabled.
There are some rare situations where scripts want to disable drawing for a while.
Floating
 Floating state of RhinoView. if true, then the view will be in a floating frame window. Otherwise the view will be embedded in the main frame.
Handle
 Gets the window handle that this view is bound to.
InDynamicViewChange
 true if the view is being dynamically changed by mouse moves, arrow keys, trackballs, etc.
MainViewport
 A RhinoView contains a "main viewport" that fills the entire view client window. RhinoPageViews may also contain nested child RhinoViewports for implementing detail viewports. The MainViewport will always return this RhinoView's m_vp.
Maximized
RealtimeDisplayMode
 Gets the RealtimeDisplayMode active for this view. null if the view doesn't have a RealtimeDisplayMode set.
RuntimeSerialNumber
ScreenRectangle
 Gets the rectangle that represents the client area of the view in screen coordinates.
Size
 Gets or sets the size of the view
TitleVisible
 Visibility of the viewport title window.
Top
See Also
Reference
RhinoView Class
Rhino.Display Namespace