RhinoCommon API
File3dmDimStyleTable Properties
The File3dmDimStyleTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns DimStyle.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
See Also
Reference
File3dmDimStyleTable Class
Rhino.FileIO Namespace