RhinoCommon API
RefinementSettings Properties
The RefinementSettings type exposes the following members.
Properties
Name | Description
ContinueRequest
 A token to request computation termination.
HasPull
 Gets a value indicating whether this subdivision should create a result on a specific surface.
Level
 The level of subdivision to achieve.
NakedEdgeMode
 Set this property to define how naked edges should be treated.
Top
See Also
Reference
RefinementSettings Class
Rhino.Geometry.MeshRefinements Namespace