RhinoCommon API
FileCsvWriteOptions Properties
The FileCsvWriteOptions type exposes the following members.
Properties
Name | Description
Area
AreaCentroid
AreaMoments
AttributesKeys
User text
AttributesTexts
CumulativeMassProperties
GroupIndexes
GroupName
Group information
Header
General
LayerColor
LayerHierarchy
LayerIndex
LayerName
Layer information
Length
Mass properties
ObjectColor
ObjectDescription
ObjectID
ObjectKeys
ObjectMaterial
ObjectName
Object information
ObjectsTexts
Perimeter
SurroundPointsWithDoubleQuotes
Volume
VolumeCentroid
VolumeMoments
Top
See Also
Reference
FileCsvWriteOptions Class
Rhino.FileIO Namespace