RhinoCommon API
StretchSpaceMorph Properties
The StretchSpaceMorph type exposes the following members.
Properties
Name | Description
IsValid
 Returns true if the space morph definition is valid, false otherwise.
Top
See Also
Reference
StretchSpaceMorph Class
Rhino.Geometry.Morphs Namespace