RhinoCommon API
PostEffectData Properties
The PostEffectData type exposes the following members.
Properties
Name | Description
Collection
Id
 Returns the unique id of this post effect.
LocalName
 Returns the localized name of this post effect.
On
 The 'on' state of this post effect.
Shown
 The 'shown' state of this post effect.
Type
 Returns the type of this post effect.
Top
See Also
Reference
PostEffectData Class
Rhino.Render.PostEffects Namespace