RhinoCommon API
UnitsChangedWithScalingEventArgs Properties
The UnitsChangedWithScalingEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document for this event. This field might be null.
DocumentSerialNumber
 Gets the uniques document serial number for this event.
Scale
 The scale factor.
Top
See Also
Reference
UnitsChangedWithScalingEventArgs Class
Rhino Namespace