RhinoCommon API
MeshVertexColorList Properties
The MeshVertexColorList type exposes the following members.
Properties
Name | Description
Capacity
 Gets or sets the total number of vertex colors the internal data structure can hold without resizing.
Count
 Gets or sets the number of mesh colors.
Item
 Gets or sets the vertex color at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Tag
 Gets or sets a mapping information for the mesh associated with these vertex colors.
Top
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace