RhinoCommon API
File3dmViewTable Properties
The File3dmViewTable type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of items in the table.
Item
 Gets the view info at an index. The set method always throws NotSupportedException.
Top
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace