RhinoCommon API
GetTruncatedCone Properties
The GetTruncatedCone type exposes the following members.
Properties
Name | Description
AroundDirectionMinimumCount
 The minimum number of faces in the around direction.
Cap
 Gets or sets whether or not the output should be capped.
CylinderConstraint
 State of the cone/cylinder constraint option. When the cone/cylinder option is selected, the circle is being made as a base for a cone/cylinder. By default the vertical cone/cylinder option not available but is not selected. By default the "Vertical" option applies to VerticalCircle.
DefaultSize
 Default radius or diameter (based on InDiameterMode)
Height
 Height of truncated cone.
InDiameterMode
 Determines if the "size" value is representing a radius or diameter
SecondRadius
 Radius of second circle.
VerticalDirectionMinimumCount
 The minimum number of faces in the vertical direction.
Top
See Also
Reference
GetTruncatedCone Class
Rhino.Input.Custom Namespace