RhinoCommon API
Pen Properties
The ViewCaptureWriter.Pen type exposes the following members.
Properties
Name | Description
Cap
Color
Join
Pattern
Width
Top
See Also
Reference
ViewCaptureWriter.Pen Class
Rhino.Runtime Namespace