RhinoCommon API
PurgeStatistics Properties
The PurgeStatistics type exposes the following members.
Properties
Name | Description
TotalPurgedCount
 The total number of table objects that were purged.
Top
See Also
Reference
PurgeStatistics Class
Rhino Namespace