RhinoCommon API
HistoryRecord Properties
The HistoryRecord type exposes the following members.
Properties
Name | Description
CopyOnReplaceObject
 When an object is replaced and the old object has a history record with this field set, the history record is copied and attached to the new object. That allows a descendant object to continue the history linkage after it is edited.
Handle
 Wrapped native C++ pointer to CRhinoHistory instance
Top
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace