RhinoCommon API
RenderContentType Properties
The RenderContentType type exposes the following members.
Properties
Name | Description
Id
 Returns the type identifier associated with this type.
InternalName
 Returns the internal name identifier associated with this type.
PlugInId
RenderEngineId
Top
See Also
Reference
RenderContentType Class
Rhino.Render Namespace