RhinoCommon API
DocumentOpenEventArgs Properties
The DocumentOpenEventArgs type exposes the following members.
Properties
Name | Description
FileName
 Name of file being opened.
Merge
 true if file is being merged into the current document. This occurs during the "Import" command.
Reference
 true if file is opened as a reference file.
Top
See Also
Reference
DocumentOpenEventArgs Class
Rhino Namespace