RhinoCommon API
SimpleArrayBinaryArchiveReader Properties
The SimpleArrayBinaryArchiveReader type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of elements in this array.
Top
See Also
Reference
SimpleArrayBinaryArchiveReader Class
Rhino.Runtime.InteropWrappers Namespace