RhinoCommon API
PersistentSettings Properties
The PersistentSettings type exposes the following members.
Properties
Name | Description
ChildKeys
 Gets a collection containing the keys in the settings dictionary.
HiddenFromUserInterface
 If false then values will appear in the EditOptions window
Keys
 Gets a collection containing the keys in the settings dictionary.
RhinoAppSettings
StringListRootKey
 Adding this string to a string list when calling SetStringList will cause the ProgramData setting to get inserted at that location in the list.
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace