RhinoCommon API
Mesh Properties
The Mesh type exposes the following members.
Properties
Name | Description
Attributes
 Get object attributes of object associated to this mesh. This will be possible only after returning true from ChangeQueue.ProvideOriginalObject()
Mapping
 Get the mapping for this mesh.
Mappings
 Get the mapping channels for this mesh
Object
 Get a copy of the original RhinoObject this Mesh is created from. Possible only after return true from ChangeQueue.ProvideOriginalObject(). Access this only with a using(var o = mesh.Object) {} construct. Note that the object is free floating, i.e. not part of a document.
OcsTransform
 OCS Transform for the MeshInstance - this is the Object Coordinate System texture mapping transformation set in the texture mapping properties dialog. (identity means no OCS, potentially just simple WCS/WCS Box)
SingleMapping |  Obsolete.
 Get texture mapping info as single mapping
SingleMesh
 Get the single mesh.
Top
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace