RhinoCommon API
MeshNgonList Properties
The MeshNgonList type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of mesh ngons.
Item
 Returns the mesh ngon at the given index.
UnsignedCount
 Gets or sets the number of mesh ngons.
Top
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace