RhinoCommon API
Defaults Properties
The HatchPattern.Defaults type exposes the following members.
Properties
Name | Description
Dash
Grid
Grid60
Hatch1
Hatch2
Hatch3
Plus
Solid
Squares
Top
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace