RhinoCommon API
GetCylinder Properties
The GetCylinder type exposes the following members.
Properties
Name | Description
AroundDirectionMinimumCount
 The minimum number of faces in the around direction.
BothSidesOption
 Determine if the "both sides" option is enabled
Cap
 Gets or sets whether or not the output should be capped.
CylinderConstraint
 State of the cone/cylinder constraint option. When the cone/cylinder option is selected, the circle is being made as a base for a cone/cylinder. By default the vertical cone/cylinder option not available but is not selected. By default the "Vertical" option applies to VerticalCircle.
DefaultSize
 Default radius or diameter (based on InDiameterMode)
Height
 Height of cylinder
InDiameterMode
 Determines if the "size" value is representing a radius or diameter
VerticalDirectionMinimumCount
 The minimum number of faces in the vertical direction.
Top
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace