RhinoCommon API
ConstructionPlaneGridDefaults Properties
The ConstructionPlaneGridDefaults type exposes the following members.
Properties
Name | Description
GridLineCount
Number of grid lines in each direction
GridSpacing
Distance between grid lines
GridThickFrequency
 This line frequency. 0: none, 1: all lines are thick, 2: every other is thick, ...
ShowGrid
Show the grid
ShowGridAxes
Show the grid axes
ShowWorldAxes
Show the world axes icon in the corner
SnapSpacing
 When grid snap is enabled, the distance between snap points. Typically this is the same distance as grid spacing
Top
See Also
Reference
ConstructionPlaneGridDefaults Class
Rhino.DocObjects Namespace