RhinoCommon API
ViewEnableDrawingEventArgs Properties
The ViewEnableDrawingEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the Rhino document.
DocumentSerialNumber
 The serial number of the Rhino document.
DrawingEnabled
 True if drawing is enabled, false otherwise.
Top
See Also
Reference
ViewEnableDrawingEventArgs Class
Rhino.Display Namespace