RhinoCommon API
UserInterfaceSlider Properties
The UserInterfaceSlider type exposes the following members.
Properties
Name | Description
AllowValueAfterRangeEnd
 Set to true if you want to allow dragging of the slider grip after the end of the defined range.
AllowValueBeforeRangeStart
 Set to true if you want to allow dragging of the slider grip before the start of the defined range.
DigitPrecision
 Number of digits of precision for the slider. If you want the slider to only represent integer values, set the Digits value to 0.
DisplayValue
 Should the slider display the current value as text on the screen
HorizontalOrientation
Range
 The range of acceptable values for the slider
Value
 Current value that the slider represents
Top
See Also
Reference
UserInterfaceSlider Class
Rhino.UI Namespace