RhinoCommon API
Particle Properties
The Particle type exposes the following members.
Properties
Name | Description
Color
DisplayBitmapIndex
Index
 Index in ParentSystem for this Particle. Can change when the particle system is modified.
Location
3d Location of the Particle.
ParentSystem
 Gets the parent particle system of this particle.
Size
Top
See Also
Reference
Particle Class
Rhino.Geometry Namespace