RhinoCommon API
FileSwReadOptions Properties
The FileSwReadOptions type exposes the following members.
Properties
Name | Description
ImportConstructionGeometry
ImportPartsAsBlocks
RotateYtoZ
Top
See Also
Reference
FileSwReadOptions Class
Rhino.FileIO Namespace