RhinoCommon API
SimpleArrayLinetypePointer Properties
The SimpleArrayLinetypePointer type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of linetypes in this array.
Top
See Also
Reference
SimpleArrayLinetypePointer Class
Rhino.Runtime.InteropWrappers Namespace