RhinoCommon API
DrawObjectEventArgs Properties
The DrawObjectEventArgs type exposes the following members.
Properties
Name | Description
DrawObject
RhinoObject
Top
See Also
Reference
DrawObjectEventArgs Class
Rhino.Display Namespace