RhinoCommon API
PlugInDescriptionAttribute Properties
The PlugInDescriptionAttribute type exposes the following members.
Properties
Name | Description
DescriptionType
Value
Top
See Also
Reference
PlugInDescriptionAttribute Class
Rhino.PlugIns Namespace