RhinoCommon API
ImageAdjust Properties
The RenderWindow.ImageAdjust type exposes the following members.
Properties
Name | Description
Dither
 Set the Dithering method to use when adjusting the RenderWindow content.
Gamma
 Set the gamma value. The inverse of this will be used to apply gamma correction to the RenderWindow RGBA channel when necessary.
Top
See Also
Reference
RenderWindow.ImageAdjust Class
Rhino.Render Namespace