RhinoCommon API
RhinoDeselectAllObjectsEventArgs Properties
The RhinoDeselectAllObjectsEventArgs type exposes the following members.
Properties
Name | Description
Document
ObjectCount
Top
See Also
Reference
RhinoDeselectAllObjectsEventArgs Class
Rhino.DocObjects Namespace