RhinoCommon API
File3dmGroupTable Properties
The File3dmGroupTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns Group.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
See Also
Reference
File3dmGroupTable Class
Rhino.FileIO Namespace