RhinoCommon API
ZooClientParameters Properties
The ZooClientParameters type exposes the following members.
Properties
Name | Description
Capabilities
 LicenseCapabilities flags that set options for how licenses can be obtained for this product
LicenseEntryTextMask
 Text mask in the form @"RH4A-AAAA-AAAA-AAAA-AAAA-AAAA" that informs the user what numbers they are looking for
LicenseGuid
 Guid used by ZooClient to identify the license saved by ZooClient. This differs from ProductGuid because different versions of a plug-in with the same Plug-in ID may need different licenses.
OnLeaseChanged
 Delegate called by ZooClient when a cloud zoo lease is changed
ParentWindow
 Parent window assigned to any licensing dialogs that appear. If null, the Rhino main window is used.
ProductBuildType
 Product build type. Must be one of LicenseBuildType values.
ProductGuid
 Guid used by ZooClient to identify the plug-in requesting a license from ZooClient. This Guid may be used by different versions of the plug-in. If different licenses are used by different versions of the plug-in, the plug-in must also specify a LicenseGuid.
ProductPath
 Path to the application calling ZooClient
ProductTitle
 Title of the product, "Rhinoceros 6" for example.
SelectedLicenseType
 License type selected by default when user is prompted to enter a license key
Top
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace