RhinoCommon API
MeshProviderIds Properties
The MeshProviderIds type exposes the following members.
Properties
Name | Description
CurvePiping
Displacement
EdgeSoftening
Shutlining
Thickening
Top
See Also
Reference
MeshProviderIds Class
Rhino.Render.CustomRenderMeshes Namespace