RhinoCommon API
File3dmStringTable Properties
The File3dmStringTable type exposes the following members.
Properties
Name | Description
Count
 Returns the number of document strings in the 3dm file.
DocumentUserTextCount
 Returns the number of Section/Entry-style key values.
Top
See Also
Reference
File3dmStringTable Class
Rhino.FileIO Namespace