RhinoCommon API
Toolbar Properties
The Toolbar type exposes the following members.
Properties
Name | Description
BitmapSize
 Gets and sets the size of the toolbar image.
Id
 Gets the id of the toolbar.
Name
 Gets the name of the toolbar.
TabSize
 Gets and sets the size of the toolbar tab.
Top
See Also
Reference
Toolbar Class
Rhino.UI Namespace