RhinoCommon API
GripStatus Properties
The GripStatus type exposes the following members.
Properties
Name | Description
Culled
Visible
Top
See Also
Reference
GripStatus Class
Rhino.DocObjects.Custom Namespace