RhinoCommon API
Arc Properties
The Arc type exposes the following members.
Properties
Name | Description
Angle
 Gets or sets the sweep -or subtended- angle (in Radians) for this arc segment. Setting this property only alters the EndAngle property such that Angle = EndAngle - StartAngle.
AngleDegrees
 Gets or sets the sweep -or subtended- angle (in Degrees) for this arc segment.
AngleDomain
 Gets or sets the angle domain (in Radians) of this arc.
Center
 Gets or sets the center point for this arc.
Circumference
 Gets the circumference of the circle that is coincident with this arc.
Diameter
 Gets or sets the Diameter of this arc.
EndAngle
 Gets or sets the end angle (in Radians) for this arc segment.
EndAngleDegrees
 Gets or sets the end angle (in Degrees) for this arc segment.
EndPoint
 Gets the end point of the arc.
IsCircle
 Gets a value indicating whether or not this arc is a complete circle.
IsValid
 Gets a value indicating whether or not this arc is valid. Detail: Radius>0 and 0<AngleRadians()<=2*Math.Pi.
Length
 Gets the length of the arc. (Length = Radius * (subtended angle in radians)).
MidPoint
 Gets the mid-point of the arc.
Plane
 Gets or sets the plane in which this arc lies.
Radius
 Gets or sets the radius of this arc.
StartAngle
 Gets or sets the start angle (in Radians) for this arc segment.
StartAngleDegrees
 Gets or sets the start angle (in Degrees) for this arc segment.
StartPoint
 Gets the start point of the arc.
Unset
 Gets an Arc with Unset components.
Top
See Also
Reference
Arc Structure
Rhino.Geometry Namespace