RhinoCommon API
File3dmPlugInDataTable Properties
The File3dmPlugInDataTable type exposes the following members.
Properties
Name | Description
Count
 Gets the number of File3dmPlugInData objects in this table.
Item
 Gets the File3dmPlugInData object at the given index.
Top
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace