RhinoCommon API
Extrusion Properties
The Extrusion type exposes the following members.
Properties
Name | Description
CapCount
 Gets the amount of capping surfaces.
IsCappedAtBottom
 Gets a value indicating whether the surface that fills the bottom profile is existing.
IsCappedAtTop
 Gets a value indicating whether the surface that fills the top profile is existing.
IsMiteredAtEnd
 Gets a value indicating whether a miter plane at the end is defined.
IsMiteredAtStart
 Returns a value indicating whether a miter plane at start is defined.
IsSolid
 Gets a value indicating whether there is no gap among all surfaces constructing this object.
 (Overrides Surface.IsSolid.)
MiterPlaneNormalAtEnd
 Gets or sets the normal of the miter plane at the end in profile coordinates. In profile coordinates, 0,0,1 always maps to the extrusion axis
MiterPlaneNormalAtStart
 Gets or sets the normal of the miter plane at the start in profile coordinates. In profile coordinates, 0,0,1 always maps to the extrusion axis
PathEnd
 Gets the end point of the path.
PathStart
 Gets the start point of the path.
PathTangent
 Gets the up vector of the path.
ProfileCount
 Gets the amount of profile curves.
Top
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace