RhinoCommon API
Torus Properties
The Torus type exposes the following members.
Properties
Name | Description
IsValid
 Gets a value indicating whether this torus is valid.
MajorRadius
 Gets or sets the radius of the circle that lies at the heart of the torus.
MinorRadius
 Gets or sets the radius of the torus section.
Plane
 Gets or sets the plane for the torus large circle.
Unset
 Gets an invalid Torus.
Top
See Also
Reference
Torus Structure
Rhino.Geometry Namespace