RhinoCommon API
RenderContentEventArgs Properties
The RenderContentEventArgs type exposes the following members.
Properties
Name | Description
Content
Document
EnvironmentUsage |  Obsolete.
 Meaningful for CurrentEnvironmentChanged event. Will be one of Background, ReflectionAndRefraction or Skylighting.
EnvironmentUsageEx
 Meaningful for CurrentEnvironmentChanged event. Will be one of Background, Reflection or Skylighting.
Reason
 Not when used in CurrentEnvironmentChanged (defaults to None).
Top
See Also
Reference
RenderContentEventArgs Class
Rhino.Render Namespace