RhinoCommon API
AnimationProperties Properties
The AnimationProperties type exposes the following members.
Properties
Name | Description
AnimationName
 Gets or sets the name of the animation sequence.
CameraPathId
 Gets or sets the object ID of the camera path.
CameraPoints
 Gets or sets points of the camera path.
CaptureMethod
 Gets or sets the capture method of the animation which is either preview or full.
CaptureType
 Gets or sets the capture type of the animation.
CurrentFrame
 Gets or sets the current frame during animation record.
Dates
 Gets or sets the dates that are calculated for seasonal/one day sun animations.
DaysBetweenFrames
 Gets or sets the days between captured frames for seasonal sun animation.
DisplayMode
 Gets or sets the ID of the view display mode (wireframe, shaded...).
EndDay
 Gets or sets the end day for seasonal day sun animation in the range 1 to 31.
EndHour
 Gets or sets the end hour for one day sun animation in the range 0 to 23.
EndMinutes
 Gets or sets the end minutes for one day sun animation in the range 0 to 59.
EndMonth
 Gets or sets the end month for seasonal day sun animation in the range 1 to 12.
EndSeconds
 Gets or sets the end seconds for one day sun animation in the range 0 to 59.
EndYear
 Gets or sets the end year for seasonal day sun animation in the range 1800 to 2199.
FileExtension
 Gets or sets the file extension of the saved frames created by the animation.
FolderName
 Gets or sets the location for the saved frames.
FrameCount
 Gets or sets the number of frames to be captured.
HtmlFileName
 Gets or sets the HTML file name. This property is the same as AnimationName.
HtmlFullPath
 Return HTML file path consisting of FolderName and HtmlFileName. To change this set FolderName and HtmlFileName.
Images
 Gets or sets the full path to the saved frames of an animation.
Latitude
 Gets or sets the latitude for sun animations in the range of -90 to +90.
LightIndex
 Internal value used while previewing animation.
Longitude
 Gets or sets the longitude for sun animations in the range of -180 to +180.
MinutesBetweenFrames
 Gets or sets the minutes between captured frames for one day sun animation.
NorthAngle
 Gets or sets the world angle corresponding to North in degrees. This angle is zero along the x-axis and increases anticlockwise.
RenderFull
 Gets or sets a value indicating whether to capture a frame in rendered mode.
RenderPreview
 Gets or sets a value indicating whether to capture a frame in preview rendered mode.
StartDay
 Gets or sets the start day for seasonal/one day sun animation in the range 1 to 31.
StartHour
 Gets or sets the start hour for seasonal/one day sun animation in the range 0 to 23.
StartMinutes
 Gets or sets the start minutes for seasonal/one day sun animation in the range 0 to 59.
StartMonth
 Gets or sets the start month for seasonal/one day sun animation in the range 1 to 12.
StartSeconds
 Gets or sets the start seconds for seasonal/one day sun animation in the range 0 to 59.
StartYear
 Gets or sets the start year for seasonal/one day sun animation in the range 1800 to 2199.
TargetPathId
 Gets or sets the object ID of the target path.
TargetPoints
 Gets or sets points of the target path.
ViewportName
 Gets or sets the viewport that will be captured.
Top
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace