RhinoCommon API
BrepTrim Properties
The BrepTrim type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this trim.
Edge
 Brep edge this trim belongs to. This will be null for singular trims
EndVertex
 BrepVertex at end of trim
Face
 Brep face this trim belongs to
IsoStatus
Loop
 Loop that this trim belongs to
StartVertex
 BrepVertex at start of trim
TrimCurve
 Gets the Brep.Curves2D 2d curve geometry used by this trim, or null.
TrimCurveIndex
 Gets the Brep.Curves2D 2d curve index of the 2d curve geometry used by this trim, or -1.
TrimIndex
 Gets the index of this trim in the Brep.Trims collection.
TrimType
Type of trim
Top
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace