RhinoCommon API
SimpleArrayVector3d Properties
The SimpleArrayVector3d type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of vectors in this array.
Top
See Also
Reference
SimpleArrayVector3d Class
Rhino.Runtime.InteropWrappers Namespace