RhinoCommon API
Interval Properties
The Interval type exposes the following members.
Properties
Name | Description
IsDecreasing
 Returns true if T[0] > T[1].
IsIncreasing
 Returns true if T0 < T1.
IsSingleton
 Returns true if T0 == T1 != ON.UnsetValue.
IsValid
 Gets a value indicating whether or not this Interval is valid. Valid intervals must contain valid numbers.
Item
 Gets or sets the indexed bound of this Interval.
Length
 Gets the signed length of the numeric range. If the interval is decreasing, a negative length will be returned.
Max
 Gets the larger of T0 and T1.
Mid
 Gets the average of T0 and T1.
Min
 Gets the smaller of T0 and T1.
T0
 Gets or sets the lower bound of the Interval.
T1
 Gets or sets the upper bound of the Interval.
Unset
 Gets an Interval whose limits are RhinoMath.UnsetValue.
ZeroToOne
 Gets an Interval whose limits are 0.0 and 1.0.
ZeroToTwoPi
 Gets an Interval whose limits are 0.0 and 2*Pi.
Top
See Also
Reference
Interval Structure
Rhino.Geometry Namespace