RhinoCommon API
ObjectPropertiesPageCollection Properties
The ObjectPropertiesPageCollection type exposes the following members.
Properties
Name | Description
Document
 Document associated with the Rhino properties panel.
DocumentRuntimeSerialNumber
 Document associated with the Rhino properties panel.
Top
See Also
Reference
ObjectPropertiesPageCollection Class
Rhino.UI Namespace