RhinoCommon API
PageViewGroupTable Properties
The PageViewGroupTable type exposes the following members.
Properties
Name | Description
ActiveCount
 Returns number of page view groups in the table, excluding deleted page view groups.
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
 Returns number of page view groups in the table, including deleted page view groups.
 (Overrides CommonComponentTable<T>.Count.)
Document
Document that owns this table.
Item
 Conceptually, the page view group table is an array of page view groups. The operator[] can be used to get individual page view group. A page view group is either active or deleted and this state is reported by PageViewGroup.IsDeleted.
Top
See Also
Reference
PageViewGroupTable Class
Rhino.DocObjects.Tables Namespace