RhinoCommon API
UserDataListEnumerator Properties
The UserDataListEnumerator type exposes the following members.
Properties
Name | Description
Current
 Get current UserData on the enumerator.
Top
See Also
Reference
UserDataListEnumerator Class
Rhino.DocObjects.Custom Namespace