RhinoCommon API
SelectionFilterSettings Properties
The SelectionFilterSettings type exposes the following members.
Properties
Name | Description
Enabled
 Enables or disables the global object selection filter.
GlobalGeometryFilter
 The global geometry type filter controls which types of geometry will be filtered. Note, the filter can be a bitwise combination of multiple object types.
OneShotGeometryFilter
 The one-shot geometry type filter controls which types of geometry will be filtered for one selection. Note, the filter can be a bitwise combination of multiple object types.
SubObjectSelect
 Enables or disabled sub-object selection.
Top
See Also
Reference
SelectionFilterSettings Class
Rhino.ApplicationSettings Namespace