RhinoCommon API
TextDot Properties
The TextDot type exposes the following members.
Properties
Name | Description
FontFace
Font face used for displaying the dot
FontHeight
 Height of font used for displaying the dot
Point
 Gets or sets the position of the text dot.
SecondaryText
 Gets or sets the secondary text of the text dot.
Text
 Gets or sets the primary text of the text dot.
Top
See Also
Reference
TextDot Class
Rhino.Geometry Namespace