RhinoCommon API
FileX_TWriteOptions Properties
The FileX_TWriteOptions type exposes the following members.
Properties
Name | Description
Type
 Get and set the type of the x_t file being written.
Top
See Also
Reference
FileX_TWriteOptions Class
Rhino.FileIO Namespace