RhinoCommon API
SimpleArrayGuid Properties
The SimpleArrayGuid type exposes the following members.
Properties
Name | Description
Capacity
 The capacity for the array
Count
 Gets the amount of elements in this array.
Item
 Get the Guid at index
Top
See Also
Reference
SimpleArrayGuid Class
Rhino.Runtime.InteropWrappers Namespace