RhinoCommon API
Transform2d Properties
The Transform2d type exposes the following members.
Properties
Name | Description
Determinant
 The determinant of the 2x2 linear part of this matrix. Because the bottom row is (0,0,1) this is also the signed area scale factor of the transformation. A negative determinant means the transformation reverses orientation.
Identity
 Gets a new identity transform matrix. An identity matrix defines no transformation.
IsIdentity
Return true if this Transform2d is the identity transform.
IsTranslation
 True if this transform is a pure translation, that is the linear part is the 2x2 identity.
IsValid
 Gets a value indicating whether or not this Transform2d is a valid matrix. A valid transform matrix is not allowed to have any invalid numbers.
IsZeroTransformation
 True if every value is 0. This transformation maps every point to (0,0).
Item
 Gets or sets the matrix value at the given row and column indices.
M00
Gets or sets this[0,0].
M01
Gets or sets this[0,1].
M02
Gets or sets this[0,2], the X translation.
M10
Gets or sets this[1,0].
M11
Gets or sets this[1,1].
M12
Gets or sets this[1,2], the Y translation.
Nan
 Gets a transform matrix in which every value is not-a-number. The static constructors return this when they are given invalid input.
Unset
 Gets a transform matrix filled with RhinoMath.UnsetValue.
ZeroTransformation
 Gets a transform matrix in which every value is zero. This transformation maps every point to (0,0).
Top
See Also
Reference
Transform2d Structure
Rhino.Geometry Namespace