RhinoCommon API
CreatePreviewEventArgs Properties
The CreatePreviewEventArgs type exposes the following members.
Properties
Name | Description
Cancel
 Get set by Rhino if the preview generation should be canceled for this
ContentKind
 Description of content that preview is being generated for.
ContentTypeId
 The class Id of content that preview is being generated for.
Environment
 The environment that the previewed object is rendered in.
Id
Unique Id for this scene.
Lights
Objects
PreviewContent |  Obsolete.
 Obsolete, will return always null
PreviewImage
 Initially null. If this image is set, then this image will be used for the preview. If never set, the default internal simulation preview will be used.
PreviewImageSize
 Pixel size of the image that is being requested for the preview scene
PreviewNotifier
Quality
 Quality of the preview image that is being requested for the preview scene
Reason
 Reason the preview is getting generated
Viewport
Top
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace