RhinoCommon API
Point3dList Properties
The Point3dList type exposes the following members.
Properties
Name | Description
BoundingBox
 Even though this is a property, it is not a "fast" calculation. Every point is evaluated in order to get the bounding box of the list.
X
 Returns an indexer with all X coordinates in this list.
Y
 Returns an indexer with all Y coordinates in this list.
Z
 Returns an indexer with all Z coordinates in this list.
Top
See Also
Reference
Point3dList Class
Rhino.Collections Namespace