RhinoCommon API
RenderPropertyChangedEvent Properties
The RenderPropertyChangedEvent type exposes the following members.
Properties
Name | Description
Context
 Optional argument which may specify the property being modified.
Document
 The document triggering the event.
Top
See Also
Reference
RenderPropertyChangedEvent Class
Rhino.Render Namespace