RhinoCommon API
Utilities Properties
The Utilities type exposes the following members.
Properties
Name | Description
DefaultRenderPlugInId
 Get the plug-in Id for the default render plug-in
ShowIncompatibleEnvironments
 Specifies whether incompatible content should be shown in the corresponding editor.
ShowIncompatibleMaterials
 Specifies whether incompatible content should be shown in the corresponding editor.
ShowIncompatibleTextures
 Specifies whether incompatible content should be shown in the corresponding editor.
Top
See Also
Reference
Utilities Class
Rhino.Render Namespace