RhinoCommon API
ViewInfo Properties
The ViewInfo type exposes the following members.
Properties
Name | Description
ClippingPlanesIds
 Returns a list of clipping plane Ids associated with this view.
DisplayModeId
 The id of the display mode this view opens in - wireframe, shaded, rendered, or any custom display mode. DisplayModeDescription holds the standard ids. A nil id means the view has no display mode of its own and opens in wireframe, which is what every template generated without this property did.
FocalBlurAperture
 Gets or sets the Focal blur aperture of the active viewport
FocalBlurDistance
 Gets or sets the Focal blur distance of the active viewport
FocalBlurJitter
 Gets or sets the Focal blur jitter of the active viewport
FocalBlurMode
 Gets or sets the Focal blur mode of the active viewport
FocalBlurSampleCount
 Gets or sets the Focal blur sample count of the active viewport
LockedProjection
Whether the view's projection is locked against changes.
Maximized
 Gets or sets whether the view window is maximized in the frame window. Together with the window position (see GetWindowPosition(Double, Double, Double, Double)) this is stored in the 3dm file and controls the viewport layout when the file is opened.
Name
 Gets or sets the name of the view.
NamedViewId
 Returns a unique id if this is a named view otherwise an empty Guid.
RenderingSize
The pixel size this view renders at.
SectionBehavior
 How a view will interact with clipping planes
ShowConstructionAxes
Whether the construction plane x and y axes are drawn in this view.
ShowConstructionGrid
Whether the construction plane grid is drawn in this view.
ShowConstructionZAxis
Whether the construction plane z axis is drawn in this view.
ShowWallpaperInGrayScale
 True if wallpaper (if any) is to be shown in gray scale in this view.
ShowWorldAxes
Whether the world axes icon is drawn in the corner of this view.
Viewport
 Gets the viewport, or viewing frustum, associated with this view.
ViewType
 Whether this view is a model view, a layout page, a nested (detail) view, or one of the special editor views. A page view must be an orthographic top view; see PageSettings for its paper size.
WallpaperFilename
 Get filename for wallpaper set to this view, if any.
WallpaperHidden
 True if wallpaper (if any) is to be hidden from this view.
Top
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace