RhinoCommon API
LinearWorkflow Properties
The LinearWorkflow type exposes the following members.
Properties
Name | Description
Hash
 Linear workflow hash.
PostProcessFrameBuffer
 Linear workflow post-process frame buffer enabled state.
PostProcessGamma
 Linear workflow post-process gamma value.
PostProcessGammaOn
 Linear workflow post-process gamma enabled state.
PostProcessGammaReciprocal
 Reciprocal of linear workflow post-process gamma value.
PreProcessColors
 Linear workflow pre-process colors enabled state.
PreProcessGamma
 Linear workflow pre-process gamma value. This is currently the same as the post-process gamma value.
PreProcessTextures
 Linear workflow pre-process textures enabled state.
Top
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace