RhinoCommon API
SnapshotTable Properties
The SnapshotTable type exposes the following members.
Properties
Name | Description
Document
Document that owns this table.
Names
Array of Snapshot names.
Top
See Also
Reference
SnapshotTable Class
Rhino.DocObjects.Tables Namespace