RhinoCommon API
FileDgnReadOptions Properties
The FileDgnReadOptions type exposes the following members.
Properties
Name | Description
GroupCellHeaders
ImportUnreferencedBlocks
ImportUnreferencedLayers
ImportUnreferencedLineStyles
ImportViews
Top
See Also
Reference
FileDgnReadOptions Class
Rhino.FileIO Namespace