RhinoCommon API
RhinoSettings Properties
The RhinoSettings type exposes the following members.
Properties
Name | Description
CppPointer
CustomImageSizeIsPreset
Top
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace