RhinoCommon API
FlowSpaceMorph Properties
The FlowSpaceMorph type exposes the following members.
Properties
Name | Description
IsValid
 Returns true if the space morph definition is valid, false otherwise.
Top
See Also
Reference
FlowSpaceMorph Class
Rhino.Geometry.Morphs Namespace