RhinoCommon API
PythonScript Properties
The PythonScript type exposes the following members.
Properties
Name | Description
ContextId
 Gets or sets a context unique identified.
Output
 Gets or sets the Python script "print()" target.
By default string output goes to the Rhino.RhinoApp.Write function. Set Output if you want to redirect the output from python to a different function while this script executes.
ScriptContextCommand
 Command associated with this script. Used for localiation
ScriptContextDoc
 object set to variable held in scriptcontext.doc.
SearchPaths
 Get/Set additional search paths used by the python interpreter
Top
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace