RhinoCommon API
GetTorus Properties
The GetTorus type exposes the following members.
Properties
Name | Description
AroundDirectionCount
 The number of faces in the around direction.
AroundDirectionMinimumCount
 The minimum number of faces in the around direction.
DefaultSize
 Default radius or diameter (based on InDiameterMode)
FixInnerRadius
 Second radius option. The first radius chosen sets the inner dimension of the torus and the second radius is constrained to be outside of the first radius.
InDiameterMode
 Determines if the "size" value is representing a radius or diameter
InSecondDiameterMode
 Second radius option. Determines if the second "size" value is representing a radius or diameter
PromptForMeshDensity
 Set true if you are prompting for a mesh or subd torus.
SecondSize
 Second radius or diameter (based on InSecondDiameterMode)
VerticalDirectionCount
 The number of faces in the vertical direction.
VerticalDirectionMinimumCount
 The minimum number of faces in the vertical direction.
Top
See Also
Reference
GetTorus Class
Rhino.Input.Custom Namespace