RhinoCommon API
SubDVertex Properties
The SubDVertex type exposes the following members.
Properties
Name | Description
ControlNetPoint
 Location of the "control net" point that this SubDVertex represents
EdgeCount
 Number of edges for this vertex
Edges
 All edges that this vertex is part of
FaceCount
 Number of faces for this vertex
Next
 Next vertex in linked list of vertices on this level
Previous
 Previous vertex in linked list of vertices on this level
Tag
 identifies the type of subdivision vertex
Top
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace