RhinoCommon API
ColorCMYK Properties
The ColorCMYK type exposes the following members.
Properties
Name | Description
A
 Gets or sets the Alpha channel value. Alpha channels are limited to the 0~1 range.
C
 Gets or sets the Cyan channel value. Cyan channels are limited to the 0~1 range.
K
 Gets or sets the Key channel value. Key channels are limited to the 0~1 range.
M
 Gets or sets the Magenta channel value. Magenta channels are limited to the 0~1 range.
Y
 Gets or sets the Yellow channel value. Yellow channels are limited to the 0~1 range.
Top
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace