RhinoCommon API
NamedColor Properties
The NamedColor type exposes the following members.
Properties
Name | Description
Color
 Gets the color for this entry.
Name
 Gets the name of this color to show to the user.
Top
See Also
Reference
NamedColor Class
Rhino.UI Namespace