RhinoCommon API
HiddenLineDrawingPoint Properties
The HiddenLineDrawingPoint type exposes the following members.
Properties
Name | Description
ClippingPlaneIndex
 Index into HiddenLineDrawing.ClippingPlanes when SilhouetteType == SilhouetteType.SectionCut.
Index
 Index of this object in HiddenLineDrawing.Points.
Location
 Returns the location of this object in HiddenLineDrawing coordinates.
PointVisibility
 Returns the point's visibility
SourceObject
 Return the source object that this point came from.
SourceObjectComponentIndex
 Component of source object part that generated this curve.
Top
See Also
Reference
HiddenLineDrawingPoint Class
Rhino.Geometry Namespace