RhinoCommon API
ThicknessAnalysisSettings Properties
The ThicknessAnalysisSettings type exposes the following members.
Properties
Name | Description
DistanceRange
 The distance range.
ShowIsoCurves
 Get or sets the display of surface isocurves.
Top
See Also
Reference
ThicknessAnalysisSettings Class
Rhino.ApplicationSettings Namespace