RhinoCommon API
File3dm Properties
The File3dm type exposes the following members.
Properties
Name | Description
AllDimStyles
 Dimension Styles in this file.
AllGroups
 Groups in this file.
AllHatchPatterns
 Hatch patterns in this file.
AllInstanceDefinitions
 Instance definitions in this file
AllLayers
 Layers in this file.
AllLinetypes
 Linetypes in this file.
AllMaterials
 Materials in this file.
AllNamedConstructionPlanes
 Named construction planes in this file.
AllNamedViews
 Named views in this file.
AllViews
 Views that represent the RhinoViews which are displayed when Rhino loads this file.
ApplicationDetails
 Gets or sets details for the application that wrote this file.
ApplicationName
 Gets or sets the name of the application that wrote this file.
ApplicationUrl
 Gets or sets a URL for the application that wrote this file.
ArchiveVersion
 Gets the 3dm file archive version.
Created
 Get the DateTime that this file was originally created. If the value is not set in the 3dm file, then DateTime.MinValue is returned
CreatedBy
 Gets a string that names the user who created the file.
DimStyles |  Obsolete.
 Dimension Styles in this file.
EarthAnchorPoint
 If set, this is the model's location on the earth. This information is used when the model is used with GIS information.
EmbeddedFiles
 The embedded files in this file.
HatchPatterns |  Obsolete.
 Hatch patterns in this file
InstanceDefinitions |  Obsolete.
 Instance definitions in this file.
LastEdited
 Get the DateTime that this file was last edited. If the value is not set in the 3dm file, then DateTime.MinValue is returned
LastEditedBy
 Gets a string that names the user who last edited the file.
Layers |  Obsolete.
 Layers in this file.
Linetypes |  Obsolete.
 Linetypes in this file.
Manifest
 Retrieves the manifest with all object descriptions in this file.
Materials |  Obsolete.
 Materials in this file.
NamedConstructionPlanes
 Named construction planes in this file.
NamedViews
 Named views in this file.
Notes
 Gets or sets the model notes.
Objects
 Gets access to the File3dmObjectTable class associated with this file, which contains all objects.
PlugInData
 Custom plug-in data in this file. This data is not attached to any geometry or attributes
RenderEnvironments
 The render environments in this file.
RenderMaterials
 The render materials in this file.
RenderTextures
 The render textures in this file.
Revision
 Gets or sets the revision number.
Settings
 Settings include tolerance, and unit system, and defaults used for creating views and objects.
StartSectionComments
 Gets or sets the start section comments, which are the comments with which the 3dm file begins.
Strings
 Document user strings in this file
Views
 Views that represent the RhinoViews which are displayed when Rhino loads this file.
Top
See Also
Reference
File3dm Class
Rhino.FileIO Namespace