RhinoCommon API
TransformObjectList Properties
The TransformObjectList type exposes the following members.
Properties
Name | Description
Count
 Number of elements in this list
DisplayFeedbackEnabled
GripCount
 Number of elements in grip list
GripOwnerCount
 Number of elements in grip owner list
Top
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace