RhinoCommon API
File3dmEmbeddedFile Properties
The File3dmEmbeddedFile type exposes the following members.
Properties
Name | Description
ComponentType
 Returns EmbeddedFile.
 (Overrides ModelComponent.ComponentType.)
CompressedLength
 The number of bytes this file occupies in the archive. Returns zero when the embedded file was not loaded from an archive (e.g. when it was loaded from a local file or buffer).
Filename
the fully-qualified filename of the embedded file. This filename may or may not refer to a local file depending on the way the embedded file was loaded. For example, if it was loaded from an archive, the filename could be that of a file on a different computer.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Top
See Also
Reference
File3dmEmbeddedFile Class
Rhino.FileIO Namespace