RhinoCommon API
MeshTopologyVertexList Properties
The MeshTopologyVertexList type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of mesh topology vertices.
Item
 Gets or sets the vertex at the given index. Setting a location adjusts all vertices in the mesh's vertex list that are defined by this topological vertex The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace