RhinoCommon API
NurbsCurve Properties
The NurbsCurve type exposes the following members.
Properties
Name | Description
HasBezierSpans
 Returns true if the NURBS curve has Bezier spans (all distinct knots have multiplicity = degree)
IsRational
 Gets a value indicating whether or not the curve is rational. Rational curves have control-points with custom weights.
Knots
 Gets access to the knots (or "knot vector") of this NURBS curve.
Order
 Gets the order of the curve. Order = Degree + 1.
Points
 Gets access to the control points of this NURBS curve.
Top
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace