RhinoCommon API
RenderMaterial Properties
The RenderMaterial type exposes the following members.
Properties
Name | Description
DefaultPreviewBackgroundType
 Set or get the default scene background for the image that appears in preview panes
DefaultPreviewGeometryType
 Set or get the default geometry that appears in preview panes
DefaultPreviewSize
 The default preview geometry size
GemMaterialGuid
GlassMaterialGuid
MetalMaterialGuid
PaintMaterialGuid
PictureMaterialGuid
PlasterMaterialGuid
PlasticMaterialGuid
SmellsLikeGem
SmellsLikeGlass
SmellsLikeMetal
SmellsLikePaint
SmellsLikePlaster
SmellsLikePlastic
SmellsLikeTexturedGem
SmellsLikeTexturedGlass
SmellsLikeTexturedMetal
SmellsLikeTexturedPaint
SmellsLikeTexturedPlaster
SmellsLikeTexturedPlastic
Top
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace