RhinoCommon API
Symbols Properties
The Symbols type exposes the following members.
Properties
Name | Description
DegreeSymbol
 Degree symbol used for angles
DiameterSymbol
 Diameter symbol
PlusMinusSymbol
 Plus-Minus tolerance symbol
RadiusSymbol
 Radius symbol
Top
See Also
Reference
Symbols Class
Rhino Namespace