RhinoCommon API
Texture Properties
The Texture type exposes the following members.
Properties
Name | Description
ApplyUvwTransform
 If true then the UVW transform is applied to the texture otherwise the UVW transform is ignored.
Enabled
 If the texture is enabled then it will be visible in the rendered display otherwise it will not.
FileName
 Gets or sets a file name that is used by this texture.
NOTE: We are moving away from string-based FileName, and suggest the usage of the new FileReference class.
Also, this filename may well not be a path that makes sense on a user's computer because it was a path initially set on a different user's computer. If you want to get a workable path for this user, use the BitmapTable.Find function using this property.
FileReference
 Gets or sets a copy of the file reference that is used by this texture.
Remarks
After the get or the set method complete, you own the copy you received or passed in, and can Dispose() of it.
Id
 Gets the globally unique identifier of this texture.
MagFilter
 The MagFilter setting controls how the color of the image pixel is calculated when the image pixel corresponds to a fraction of a texture bitmap pixel.
MappingChannelId
MinFilter
 The MinFilter setting controls how the color of the image pixel is calculated when the image pixel corresponds to multiple texture bitmap pixels.
Offset
 Helper for access to the offset value encoded in UvwTransform
ProjectionMode
 How texture is projected onto geometry
Repeat
 Helper for access to the repeat value encoded in UvwTransform
Rotation
 Helper for access to the rotation value encoded in UvwTransform
TextureCombineMode
 Determines how this texture is combined with others in a material's texture list.
TextureType
 Controls how the pixels in the bitmap are interpreted
TreatAsLinear
 If false, the texture color values should be correctly by the linear workflow pre-process gamma value (in the document) if linear workflow is on. Otherwise, if the values is true, the values should be used raw from the texture.
UvwTransform
 Transform to be applied to each instance of this texture if ApplyUvw is true
WcsBoxProjected
 Is true if this texture uses world coordinate system (WCS) box projection for texture mapping. Notice: If this texture is used by an object that has an object coordinate system (OCS) frame defined on a mapping channel then that OCS frame is used instead of the WCS.
WcsProjected
 Is true if this texture uses world coordinate system (WCS) projection for texture mapping. Notice: If this texture is used by an object that has an object coordinate system (OCS) frame defined on a mapping channel then that OCS frame is used instead of the WCS.
WrapU
 Texture wrapping mode in the U direction
WrapV
 Texture wrapping mode in the V direction
WrapW
 Texture wrapping mode in the W direction
Top
See Also
Reference
Texture Class
Rhino.DocObjects Namespace