RhinoCommon API
CurvatureAnalysisSettingsState Properties
The CurvatureAnalysisSettingsState type exposes the following members.
Properties
Name | Description
GaussRange
 Gets or sets the Gaussian curvature range.
MaxRadiusRange
 Gets or sets the Maximum Radius curvature range.
MeanRange
 Gets or sets the Mean curvature range.
MinRadiusRange
 Gets or sets the Minimum Radius curvature range.
ShowIsoCurves
 Gets or sets whether to show isocurves.
Style
 Gets or sets the curvature analysis style.
Top
See Also
Reference
CurvatureAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace