RhinoCommon API
DigitizerPlugIn Properties
The DigitizerPlugIn type exposes the following members.
Properties
Name | Description
DigitizerUnitSystem
 Unit system of the points the digitizer passes to SendPoint(). Rhino uses this value when it calibrates a digitizer. This unit system must be not change.
PointTolerance
 The point tolerance is the distance the digitizer must move (in digitizer coordinates) for a new point to be considered real rather than noise. Small desktop digitizer arms have values like 0.001 inches and 0.01 millimeters. This value should never be smaller than the accuracy of the digitizing device.
Top
See Also
Reference
DigitizerPlugIn Class
Rhino.PlugIns Namespace