RhinoCommon API
SectionStyleTableEventArgs Properties
The SectionStyleTableEventArgs type exposes the following members.
Properties
Name | Description
Document
 The Rhino document.
EventType
 The event type.
Index
 The index of the section style.
NewState
 The section style.
OldState
 The old or previous section style.
Top
See Also
Reference
SectionStyleTableEventArgs Class
Rhino.DocObjects.Tables Namespace