RhinoCommon API
LengthUnit Properties
The LengthUnit type exposes the following members.
Properties
Name | Description
DisplayName
Upper case plural localized unit name.
DisplaySymbol
 Lower case singular localized unit symbol.
Name
Non localized lower case plural unit name.
Symbol
Non localized unit symbol string.
Top
See Also
Reference
LengthUnit Structure
Rhino Namespace