RhinoCommon API
NullField Properties
The NullField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
NullField Class
Rhino.Render.Fields Namespace