RhinoCommon API
DisplayAttributeMaterial Properties
The DisplayAttributeMaterial type exposes the following members.
Properties
Name | Description
Diffuse
 Diffuse color.
DisableLighting
 When true the material is drawn at full diffuse color, ignoring the scene lights.
Emission
 Emission color.
FlatShaded
 Shades with no smoothing, so the individual render mesh faces are visible.
IndexOfRefraction
 Index of refraction.
Luminosity
 Luminosity.
OverrideObjectColor
 Objects acquire color from render materials.
OverrideObjectReflectivity
 Objects acquire reflectivity from render materials.
OverrideObjectTransparency
 Objects acquire transparency from render materials.
Reflectivity
 Reflectivity, 0.0 to 1.0.
Shine
 Shine, 0 to MaxShine.
ShineIntensity
 Shine intensity.
Transparency
 Transparency, 0.0 opaque to 1.0 transparent.
Top
See Also
Reference
DisplayAttributeMaterial Class
Rhino.Display Namespace