RhinoCommon API
ClassIdAttribute Properties
The ClassIdAttribute type exposes the following members.
Properties
Name | Description
Id
 Gets the associated style.
Top
See Also
Reference
ClassIdAttribute Class
Rhino.DocObjects.Custom Namespace