RhinoCommon API
BrepTrimList Properties
The BrepTrimList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of brep trims.
Item
 Gets the BrepTrim at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
BrepTrimList Class
Rhino.Geometry.Collections Namespace