RhinoCommon API
LayerTableEventArgs Properties
The LayerTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
LayerIndex
NewState
OldState
Top
See Also
Reference
LayerTableEventArgs Class
Rhino.DocObjects.Tables Namespace