RhinoCommon API
SubDFaceList Properties
The SubDFaceList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of SubD faces.
HasPerFaceColors
 True if one or more faces on the active level have per face color overrides.
Top
See Also
Reference
SubDFaceList Class
Rhino.Geometry.Collections Namespace