RhinoCommon API
RenderContentTableEventArgs Properties
The RhinoDoc.RenderContentTableEventArgs type exposes the following members.
Properties
Name | Description
Document
 Document the table belongs to
EventType
 Event type
Top
See Also
Reference
RhinoDoc.RenderContentTableEventArgs Class
Rhino Namespace