RhinoCommon API
FileGltfWriteOptions Properties
The FileGltfWriteOptions type exposes the following members.
Properties
Name | Description
CullBackfaces
 Setting that determines whether or not the meshes in the glTF will be rendered with or without backface culling. Known as DoubleSided in the glTF specification.
DracoCompressionLevel
 The level of compression used by draco in the range of 1 to 10 inclusive.
DracoQuantizationBitsNormal
 The number of bits used when quantizing mesh normals in the range of 8 to 32 inclusive
DracoQuantizationBitsPosition
 The number of bits used when quantizing mesh vertex positions in the range of 8 to 32 inclusive
DracoQuantizationBitsTextureCoordinate
 The number of bits used when quantizing mesh texture coordinates in the range of 8 to 32 inclusive
ExportLayers
 glTF uses a scene hierarchy structure where nodes are organized in a parent-child relationship. This setting enables/disables the writing of empty nodes with the same names as layers and places exported objects a children of the corresponding layer node.
ExportMaterials
 Setting to determine whether or not materials are written to the glTF file
ExportOpenMeshes
 Enable/disable the exporting of open meshes
ExportTextureCoordinates
 Enable/disable the exporting of texture coordinates
ExportVertexColors
 Enable/disable the export of vertex colors
ExportVertexNormals
 Enable/disable the exporting of vertex normals
MapZToY
 Setting to transform Rhino's Z axis to glTF's Y axis
MeshParameters
 Mesh parameters to use when meshing geometry that is not already a mesh. Only used when UseRenderMeshes is disabled.
SubDMeshType
 The mesh type for exported SubDs
SubDSurfaceMeshingDensity
 Determines how coarse the mesh output will be when surface meshing subd objects See comments for ON_SubDDisplayParameters in opennurbs_mesh.h for details regarding numbers used.
UseDisplayColorForUnsetMaterials
 Setting to display color as material when material index for object is -1.
UseDracoCompression
 Enable/disable the use of Draco mesh compression in the glTF file
UseRenderMeshes
 When enabled the meshes already generated for rendering the objects are exported. When disabled the objects are meshed for export using MeshParameters.
Top
See Also
Reference
FileGltfWriteOptions Class
Rhino.FileIO Namespace