RhinoCommon API
FileUsdWriteOptions Properties
The FileUsdWriteOptions type exposes the following members.
Properties
Name | Description
BlockHandling
 Including blocks inside the file will result in a larger file size and data duplication
DefaultLayer
 The root prim for the USD File
ForceMeshes
 Forces all geometry to be represented as meshes
IncludeUserStrings
 Includes user strings in prim data
MeshingParameters
 Leaving this empty will not insert a Prim
ModelName
 A given model name will add a prim between the root prim and the start of the models data. Leaving this empty will not insert a Prim
Top
See Also
Reference
FileUsdWriteOptions Class
Rhino.FileIO Namespace