RhinoCommon API
ModelComponent Properties
The ModelComponent type exposes the following members.
Properties
Name | Description
ComponentStatus
 Gets or sets the component status of the model component.
ComponentType
 Gets the ModelComponentType for this object. Useful in switch statements.
DeletedName
 Gets the name of a component that is deleted.
HasId
 Returns a value indicating whether the component has an ID.
HasIndex
 Returns a value indicating whether the component has an Index.
HasName
 Returns a value indicating whether the component has a Name.
Id
 Gets or sets the ID of the current instance.
IdIsLocked
 Returns a value indicating whether the component ID is already locked.
Index
 Gets or sets the model component index attribute.
IndexIsLocked
 Returns a value indicating whether the component Index is already locked.
InstanceDefinitionModelSerialNumber
 When a component is in a model as part of the information required for a linked instance definition, this value identifies the linked instance definition reference model.
IsComponentStatusLocked
 The component status itself can be locked. This returns an indication.
IsDeleted
 true if the component is deleted. Deleted components are kept by the document for undo purposes.
IsReference
 Gets a value indicting whether this component is a referenced component. Referenced components are part of referenced documents.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
ON_DimStyle::DefaultMillimeterArchitecture
ModelSerialNumber
 A value identifying the model that manages this component.
Name
 Gets or sets the name
NameIsLocked
 Returns a value indicating whether the component Name is already locked.
NamePathSeparator
 Returns the string "::". This is the string Rhino uses in layer full path names to separate the names of individual layers.
ReferenceModelSerialNumber
 When a component is in a model for reference, this value identifies the reference model.
Top
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace