RhinoCommon API
ViewCaptureSettings Properties
The ViewCaptureSettings type exposes the following members.
Properties
Name | Description
ApplyDisplayModeThicknessScales
 Should curves and edges have their thicknesses scaled based the on the display mode settings for a view being captured (default is false)
ArrowheadSizeMillimeters
 Arrowhead size in millimeters.
CropRectangle
 Actual area of output rectangle that view capture is sent to.
DefaultPrintWidthMillimeters
 Line thickness, in millimeters, used to print objects with no defined thickness.
Document
DrawAxis
DrawBackground
DrawBackgroundBitmap
DrawClippingPlanes
DrawGrid
DrawLights
DrawLockedObjects
DrawMargins
DrawRectangle
 Rectangle where drawing is confined to on MediaSize
DrawSelectedObjectsOnly
DrawWallpaper
FooterText
 Text drawn at the bottom of the output
HeaderText
 Text drawn at the top of the output
HorizontalScale
 Horizontal stretch to be applied to output. Useful for calibrating printers
IsScaleToFit
 Returns true if the model has been scaled to fit.
IsValid
LinetypeWidthUnitsArePageLengths
MatchLinetypePatternDefinition
 Default is true. Linetype scales are normally generated right before printing/view capture in order to get linetypes to print to the same lengths as defined. If false, the linetypes are not scaled and the current pattern lengths as seen on the screen as used.
MediaSize
 Total size of the image or page in dots
ModelScaleType
OffsetAnchor
OutputColor
PointSizeMillimeters
 Size of point objects in millimeters. if scale <= 0 the size is minimized so points are always drawn as small as possible
RasterMode
Resolution
Capture "density" in dots per inch.
TextDotPointSize
 Font point size use for printing text dots. The default value is 10.0. This has morphed into a scale setting as individual text dots have their own sizes. A value of 20 will print dots at double of their size setting while a value of 10 will print with no scaling applied.
UsePrintWidths
VerticalScale
 Vertical stretch to be applied to output. Useful for calibrating printers
ViewArea
 How the RhinoViewport is mapped to the output rectangle
WireThicknessScale
 Scaling factor to apply to object print widths (typically 1.0). This is helpful when printing something at 1/2 scale and having all of the curves print 1/2 as thick.
Top
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace