RhinoCommon API
NamedConstructionPlaneTable Properties
The NamedConstructionPlaneTable type exposes the following members.
Properties
Name | Description
Count
Number of construction planes in the table.
Document
Gets the document that owns this table.
Item
 Conceptually, the named construction plane table is an array of ConstructionPlanes and their associated names. The operator[] can be used to get individual ConstructionPlanes.
Top
See Also
Reference
NamedConstructionPlaneTable Class
Rhino.DocObjects.Tables Namespace