RhinoCommon API
CorruptGeometryException Properties
The CorruptGeometryException type exposes the following members.
Properties
Name | Description
CommonObject
 Corrupt geometry .NET class
Pointer
 pointer to base geometry (ON_Object*)
Top
See Also
Reference
CorruptGeometryException Class
Rhino.Runtime Namespace