RhinoCommon API
FileXamlWriteOptions Properties
The FileXamlWriteOptions type exposes the following members.
Properties
Name | Description
AddRotationAnimation
AddRotationScrollbars
AnimationAxis
MeshingParameters
UseExistingRenderMeshes
 If render meshes exist they will be used. Otherwise they are created on the fly using the current render settings of the document.
UseOriginForRotationCenter
Top
See Also
Reference
FileXamlWriteOptions Class
Rhino.FileIO Namespace