RhinoCommon API
EdgeAnalysisSettings Properties
The EdgeAnalysisSettings type exposes the following members.
Properties
Name | Description
ShowEdgeColor
Gets or sets a color used to enhance display edges in commands like _ShowEdges and _ShowNakedEdges.
ShowEdges
 Gets or sets a value referring to the group of edges that are targeted.
0 = all.
1 = naked.
2 = non-manifold.
Top
See Also
Reference
EdgeAnalysisSettings Class
Rhino.ApplicationSettings Namespace