RhinoCommon API
File3dmDisplacement Properties
The File3dmDisplacement type exposes the following members.
Properties
Name | Description
BlackPoint
 Specifies the amount of displacement for the black color in the texture.
Fairing
 Specifies the number of steps for the fairing process. Fairing straightens rough feature edges.
FairingOn
 Specifies whether or not to perform a fairing step. Fairing straightens rough feature edges.
FinalMaxFaces
 Specifies how many faces the reduction post process should target.
FinalMaxFacesOn
 Specifies whether to perform a mesh reduction as a post process to simplify the result of displacement.
InitialQuality
 Specifies how densely the object is initially subdivided. The lower the value, the higher the resolution of the displaced mesh.
MappingChannel
 Specifies which texture mapping channel is used for the displacement texture.
MeshMemoryLimit
 Specifies in megabytes how much memory can be allocated for use by the displacement mesh.
On
 Specifies whether the displacement feature is enabled or not.
PostWeldAngle
 Specifies the maximum angle between face normals of adjacent faces that will get welded together.
RefineSensitivity
 Specifies how sensitive the divider for contrasts is on the displacement texture. Specify 1 to split all mesh edges on each refine step. Specify 0.99 to make even slight contrasts on the displacement texture cause edges to be split. Specifying 0.01 only splits edges where heavy contrast exists.
RefineSteps
 Specifies the number of refinement passes
SweepResolutionFormula
 Specifies which formula is used to calculate sweep resolution from initial quality.
TextureId
 Specifies which texture is used for computing the displacement amount.
WhitePoint
 Specifies the amount of displacement for the white color in the texture.
Top
See Also
Reference
File3dmDisplacement Class
Rhino.FileIO Namespace