RhinoCommon API
RenderSettings Properties
The RenderSettings type exposes the following members.
Properties
Name | Description
AmbientLight
 Gets or sets the ambient light color used in rendering.
AntialiasLevel
 Gets or sets anti-alias level, used for render quality
BackgroundColorBottom
 Gets or sets the background bottom color used in rendering.
BackgroundColorTop
 Gets or sets the background top color used in rendering.
Sets also the background color if a solid background color is set.
BackgroundStyle
 How the viewport's background should be filled.
DepthCue
 Gets or sets a value indicating whether to render using depth cues.
These are clues to help the perception of position and orientation of objects in the image.
Dithering
 If this object is associated with a document, this gets the document dithering. If this object is associated with a File3dm, this gets the File3dm's dithering. Otherwise it gets a 'free-floating' dithering object.
FlatShade
 Gets or sets a value indicating whether to render using flat shading.
GroundPlane
 If this object is associated with a document, this gets the document ground plane. If this object is associated with a File3dm, this gets the File3dm's ground plane. Otherwise it gets a 'free-floating' ground plane object.
ImageDpi
 Number of dots/inch (dots=pixels) to use when printing and saving bitmaps. The default is 72.0 dots/inch.
ImageSize
 Gets or sets a value indicating the size of the rendering result if UseViewportSize is set to false. If UseViewportSize is set to true, then this value is ignored.
ImageUnitSystem
 unit system to use when converting image pixel size and DPI information into a print size. Default = inches
LinearWorkflow
 If this object is associated with a document, this gets the document linear workflow. If this object is associated with a File3dm, this gets the File3dm's linear workflow. Otherwise it gets a 'free-floating' linear workflow object.
NamedView
 Get or set the given named view
PostEffects
 If this object is associated with a document, this gets the document post effect data collection. If this object is associated with a File3dm, this gets the File3dm's post effect data collection. Otherwise it gets a 'free-floating' post effect data collection object.
RenderAnnotations
 Gets or sets a value indicating whether to instruct the rendering engine to show annotations, such as linear dimensions or angular dimensions.
RenderBackfaces
 Gets or sets a value indicating whether to render back faces.
RenderChannels
 If this object is associated with a document, this gets the document render channels. Otherwise it gets a 'free-floating' render channels object.
RenderCurves
 Gets or sets a value indicating whether to instruct the rendering engine to show curves.
RenderIsoparams
 Gets or sets a value indicating whether to instruct the rendering engine to show isocurves.
RenderMeshEdges
 Gets or sets a value indicating whether to instruct the rendering engine to show mesh edges.
RenderPoints
 Gets or sets a value indicating whether to instruct the rendering engine to show points.
RenderSource
 Gets or sets the render source RenderSettings.RenderingSources enumeration.
SafeFrame
 If this object is associated with a document, this gets the document safe-frame. If this object is associated with a File3dm, this gets the File3dm's safe-frame. Otherwise it gets a 'free-floating' safe-frame object.
ScaleBackgroundToFit
 Gets or sets a value indicating whether to scale the wallpaper in the background or not. This is meaningful only if the viewport has a wallpaper and render settings are set to render Wallpaper into the background.
ShadowmapLevel
 0=none, 1=normal, 2=best.
Skylight
 If this object is associated with a document, this gets the document skylight. If this object is associated with a File3dm, this gets the File3dm's skylight. Otherwise it gets a 'free-floating' skylight object.
Snapshot
 Set or get the given snapshot view
SpecificViewport
 Set or get the given specific viewport
Sun
 If this object is associated with a document, this gets the document sun. If this object is associated with a File3dm, this gets the File3dm's sun. Otherwise it gets a 'free-floating' sun object.
TransparentBackground
 Gets or sets whether rendering should be done with transparent background.
UseHiddenLights
 Gets or sets a value indicating whether to render using lights that are on layers that are off.
UseViewportSize
 Gets or sets a value indicating whether to use the resolution of the viewport being rendered or ImageSize when rendering
Top
See Also
Reference
RenderSettings Class
Rhino.Render Namespace