RhinoCommon API
BrepRegion Properties
The BrepRegion type exposes the following members.
Properties
Name | Description
BoundingBox
Gets the region bounding box.
Brep
Gets a reference to the Brep this region belongs to.
Index
Gets the index of region in the RegionTopology array.
IsFinite
 Gets a value indicating whether this region is finite.
Top
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace