RhinoCommon API
SubDFace Properties
The SubDFace type exposes the following members.
Properties
Name | Description
ControlNetCenterFrame
 The face's control net center frame is a plane with normal equal to ControlNetCenterNormal and origin equal to ControlNetCenterPoint. The x and y axes of the frame have no predictable relationship to the face or SubD control net topology.
ControlNetCenterNormal
 When the face's control net polygon is planar, the face's control net normal is a unit vector perpendicular to the plane that points outwards. If the control net polygon is not planar, the control net normal is control net normal is a unit vector that is the average of the control polygon's corner normals.
ControlNetCenterPoint
 The face's control net center point is the average of the face's vertex control net points. This is the same point as the face's subdivision point.
EdgeCount
 Number of edges for this face. Note that EdgeCount is always the same as VertexCount. Two properties are provided simply for clarity.
LimitSurfaceCenterPoint
 Get the limit surface point location at the center of the face
PerFaceColor
 If per-face color is "Empty", then this face does not have a custom color
SurfaceCenterFrame
 Get the limit surface tangent plane at the center of the face. The plane's origin is the point on the limit surface at the center of the face. The plane's z axis is the limit surface normal vector at the center of the face.
SurfaceCenterNormal
 Get the limit surface normal vector at the center of the face.
VertexCount
 Number of vertices for this face. Note that EdgeCount is always the same as VertexCount. Two properties are provided simply for clarity.
Top
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace