RhinoCommon API
Box Properties
The Box type exposes the following members.
Properties
Name | Description
Area
 Gets the total surface area of this box, or UnsetValue for an invalid box.
BoundingBox
 Gets the world axis aligned Bounding box for this oriented box.
Center
 Gets the point that is in the center of the box.
Empty
 Empty Box. Empty boxes are considered to be invalid.
IsValid
 Gets the validity of this Box. Boxes are invalid when the base plane or any of the dimension intervals are invalid or decreasing.
Plane
 Gets or sets the orientation plane for this Box.
Unset
 Gets a Box whose base plane and axis dimensions are all Unset.
Volume
 Gets the total volume of this box, or UnsetValue for an invalid box.
X
 Gets or sets the Interval that describes the dimension of the Box along the orientation plane X-Axis. Otherwise known as the Width of the Box.
Y
 Gets or sets the Interval that describes the dimension of the Box along the orientation plane Y-Axis. Otherwise known as the Depth of the Box.
Z
 Gets or sets the Interval that describes the dimension of the Box along the orientation plane Z-Axis. Otherwise known as the Height of the Box.
Top
See Also
Reference
Box Structure
Rhino.Geometry Namespace