RhinoCommon API
TransformField Properties
The TransformField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
TransformField Class
Rhino.Render.Fields Namespace