RhinoCommon API
SubDEdgeList Properties
The SubDEdgeList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of SubD edges.
Top
See Also
Reference
SubDEdgeList Class
Rhino.Geometry.Collections Namespace