RhinoCommon API
RenderEnvironment Properties
The RenderEnvironment type exposes the following members.
Properties
Name | Description
CurrentEnvironment |  Obsolete.
TextureChildSlotName
Top
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace