RhinoCommon API
FileSvgReadOptions Properties
The FileSvgReadOptions type exposes the following members.
Properties
Name | Description
GroupMultiCurvePaths
ImportFilledObjectAs
RetainGrouping
Top
See Also
Reference
FileSvgReadOptions Class
Rhino.FileIO Namespace