RhinoCommon API
DateTimeField Properties
The DateTimeField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
DateTimeField Class
Rhino.Render.Fields Namespace