RhinoCommon API
SoftTransformSettings Properties
The SoftTransformSettings type exposes the following members.
Properties
Name | Description
CvCountU
 Controls the number of control vertices affected by soft transform for surfaces in the U direction.
CvCountV
 Controls the number of control vertices affected by soft transform for surfaces in the V direction.
Enabled
 When enabled other unselected components on an object will be moved during a transformation within the specified radius according to the falloff shape.
FalloffColor
 Controls the color used to shade meshes and edges when an object is affected by soft transform.
MeasureDistanceAlong
 When true the distance for components affected by soft transform is calculated along the object. Otherwise world distance is used.
Radius
 The radius of effect for soft transform. Other components on the object this distance and closer to selected components will be transformed.
Shape
 The shape of the falloff curve. 0 = Smooth 1 = Linear 2 = Round 3 = Sharp
ShowConstraintWidgets
 Enables or disables constraint widgets on the edges of surfaces when points are on.
Top
See Also
Reference
SoftTransformSettings Class
Rhino.ApplicationSettings Namespace