RhinoCommon API
Skylight Properties
The Skylight type exposes the following members.
Properties
Name | Description
CustomEnvironment |  Obsolete.
CustomEnvironmentOn |  Obsolete.
Enabled
ShadowIntensity
 ShadowIntensity is currently unused.
Top
See Also
Reference
Skylight Class
Rhino.Render Namespace