RhinoCommon API
SporphSpaceMorph Properties
The SporphSpaceMorph type exposes the following members.
Properties
Name | Description
ConstrainNormal
 Specifies how the normal direction of the base surface is mapped onto the target surface. To use the target surface normal, set to Unset.
IsValid
 Returns true if the space morph definition is valid, false otherwise.
Top
See Also
Reference
SporphSpaceMorph Class
Rhino.Geometry.Morphs Namespace