RhinoCommon API
PreviewGeometry Properties
The PreviewGeometry type exposes the following members.
Properties
Name | Description
CppPointer
 CppPointer for PreviewGeometry
Top
See Also
Reference
PreviewGeometry Class
Rhino.Render Namespace