RhinoCommon API
Text3d Properties
The Text3d type exposes the following members.
Properties
Name | Description
Bold
 Gets or sets whether this Text3d object will be drawn in Bold.
BoundingBox
 Gets the bounding box for this Text3d object.
FontFace
 Gets or sets the FontFace name.
Height
 Gets or sets the height (in units) of this Text3d object. The height should be a positive number larger than zero.
HorizontalAlignment
 Horizontal alignment that this Text3d is drawn with
Italic
 Gets or sets whether this Text3d object will be drawn in Italics.
Text
 Gets or sets the text string for this Text3d object.
TextPlane
 Gets or sets the 3D aligned plane for this Text3d object.
VerticalAlignment
 Vertical alignment that this Text3d is drawn with
Top
See Also
Reference
Text3d Class
Rhino.Display Namespace