RhinoCommon API
CurveSegment Properties
The CurveSegment type exposes the following members.
Properties
Name | Description
Index
 The index of the curve used by this boundary element.
Reversed
 True if this piece of the curve should be reversed.
SubDomain
 The sub-domain of the curve used by this boundary element.
Top
See Also
Reference
CurveSegment Structure
Rhino.Runtime.InteropWrappers Namespace