RhinoCommon API
MaterialTableEventArgs Properties
The MaterialTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
Index
OldSettings
Top
See Also
Reference
MaterialTableEventArgs Class
Rhino.DocObjects.Tables Namespace