RhinoCommon API
StringField Properties
The StringField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
See Also
Reference
StringField Class
Rhino.Render.Fields Namespace