RhinoCommon API
GetArc Properties
The GetArc type exposes the following members.
Properties
Name | Description
AllowDeformable
 Allow for deformable options
DefaultRadius
 Default radius used for start and end radius
Deformable
 Is the deformable option set
DeformableDegree
DeformablePointCount
UseActiveLayerLinetypeForCurves
Top
See Also
Reference
GetArc Class
Rhino.Input.Custom Namespace