RhinoCommon API
RenderContentChangedEventArgs Properties
The RenderContentChangedEventArgs type exposes the following members.
Properties
Name | Description
ChangeContext
OldContent
Top
See Also
Reference
RenderContentChangedEventArgs Class
Rhino.Render Namespace