RhinoCommon API
UndoRedoEventArgs Properties
The UndoRedoEventArgs type exposes the following members.
Properties
Name | Description
CommandId
 The id of the Rhino command. This can be Guid.Empty.
DocumentSerialNumber
 The document runtime serial number.
IsBeforeBeginRecording
IsBeforeEndRecording
IsBeginRecording
IsBeginRedo
IsBeginUndo
IsEndRecording
IsEndRedo
IsEndUndo
IsPurgeRecord
UndoSerialNumber
 The undo record serial number.
Top
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace