RhinoCommon API
SubDComponent Properties
The SubDComponent type exposes the following members.
Properties
Name | Description
ComponentDirection
 True when this component is referenced with the reverse of its natural orientation. This is always false for vertices, and for edges and faces obtained directly from the parent SubD; it is only set on components reached through an oriented reference, such as the face on a given side of an oriented edge.
Id
 Unique id within the parent SubD for this item
IsDamaged
 Returns true if the SubD component is damaged.
IsDeleted
 Returns true if the SubD component is deleted.
IsHidden
 Returns true if the SubD component is hidden.
IsHighlighted
 Returns true if the SubD component is highlighted.
IsLocked
 Returns true if the SubD component is locked.
IsSelected
 Returns true if the SubD component is selected.
ParentSubD
 SubD that this component belongs to
Top
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace