RhinoCommon API
PersistentSettingsEventArgs Properties
The PersistentSettingsEventArgs type exposes the following members.
Properties
Name | Description
Cancel
Top
See Also
Reference
PersistentSettingsEventArgs Class
Rhino Namespace