RhinoCommon API
SimpleArrayIntPtr Properties
The SimpleArrayIntPtr type exposes the following members.
Properties
Name | Description
Count
 Gets the number of elements in this array.
Top
See Also
Reference
SimpleArrayIntPtr Class
Rhino.Runtime.InteropWrappers Namespace