RhinoCommon API
GumballDisplayConduit Properties
The GumballDisplayConduit type exposes the following members.
Properties
Name | Description
BaseGumball
Starting location.
Enabled
Gumball
GumballTransform
 The gumball transformation is the transformation calculated by comparing the current gumball to the starting BaseGumball.
InRelocate
PickResult
The initial mouse down event sets PickResult.
PreTransform
 The pre-transform is a transformation that needs to be applied before the gumball transformation.
TotalTransform
 The total transformation is GumballTransform * PreTransform.
Top
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace