RhinoCommon API
TextDotUserInterfaceObject Properties
The TextDotUserInterfaceObject type exposes the following members.
Properties
Name | Description
DotBackgroundColor
 Text dot background color
DotBorderColor
 Text dot border color
MouseOverTextHeight
 Font height used when the mouse is over the dot. The default behavior is to grow the dot a small amount when the mouse is over to help the user know that the dot is acts as a user interface object
Text
 Text content for grip
TextColor
 Text color used for dot text
TextHeight
 Font height for text
Top
See Also
Reference
TextDotUserInterfaceObject Class
Rhino.UI Namespace