RhinoCommon API
WorksessionFileChangedEventArgs Properties
The RhinoDoc.WorksessionFileChangedEventArgs type exposes the following members.
Properties
Name | Description
ChangeKind
Whether the model was attached or detached.
Document
Document the worksession belongs to.
FilePath
Full path of the .3dm file being attached or detached.
WorksessionModelRuntimeSerialNumber
 Runtime serial number of the worksession reference model being attached or detached. Not persistent across sessions.
Top
See Also
Reference
RhinoDoc.WorksessionFileChangedEventArgs Class
Rhino Namespace