RhinoCommon API
StdVectorGuid Properties
The StdVectorGuid type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of elements in this vector.
Item
 Get the Guid at index
Top
See Also
Reference
StdVectorGuid Class
Rhino.Runtime.InteropWrappers Namespace