RhinoCommon API
ComponentFunctionInfo Properties
The ComponentFunctionInfo type exposes the following members.
Properties
Name | Description
ComponentGuid
 The unique identifier of the Grasshopper component. It is the original developer's responsibility to ensure that this ID is unique.
Delegate
 Returns a delegate that can be directly invoked using a list of arguments. This flattens trees.
DelegateNoWarnings
 Returns a delegate that can be directly invoked using a list of arguments. This flattens trees.
DelegateTree
 Returns a delegate that can be directly invoked using a list of arguments. This considers trees and simplifies single-output components.
DelegateTreeNoWarnings
 Returns a delegate that can be directly invoked using a list of arguments. This considers trees and simplifies single-output components.
Description
 The function description.
FullName
 Returns the name of the component prefixed by, if existing, the namespace.
FullScriptingName
 Shows the full name of the component, including optional periods. Removes spaces and common operator signs.
InputDescriptions
 The function input parameter descriptions.
InputNames
 The function input parameter names.
InputsOptional
 Indications for each function input parameter whether it is optional.
InputTypeNames
 The function input type names.
IsDefault
 Determines if the component is a default one.
Name
 The function name.
Namespace
 The function namespace.
OutputDescriptions
 Grasshopper returns several items in general. This property returns the output descriptions.
OutputNames
 Grasshopper returns several items in general. This property returns the output names.
OutputTypeNames
 Grasshopper returns several items in general. This property returns the output type names.
Top
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace