RhinoCommon API
Intersection Properties
The Intersection type exposes the following members.
Properties
Name | Description
MeshIntersectionsTolerancesCoefficient
Offers a requested adjustment coefficient for mesh-mesh intersections tolerances. The value can be used to multiply the document absolute tolerance.
This is only a UI value; it is up to developer to honor (or not) this request, depending on application needs.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace