RhinoCommon API
MeshUnwrapper Properties
The MeshUnwrapper type exposes the following members.
Properties
Name | Description
SymmetryPlane
 Symmetry plane. Unwrapper tries to keep unwrap result symmetric to this plane.
Top
See Also
Reference
MeshUnwrapper Class
Rhino.Geometry Namespace