RhinoCommon API
City Properties
The City type exposes the following members.
Properties
Name | Description
Latitude
 Gets latitude of city.
Longitude
 Gets longitude of city.
Name
 Gets name of city.
TimeZone
 Gets time zone of city.
Top
See Also
Reference
City Class
Rhino.Render Namespace