RhinoCommon API
WorksessionFileLayerOverride Properties
The WorksessionFileLayerOverride type exposes the following members.
Properties
Name | Description
LayerId
Gets or sets the id of the layer in the reference model file.
Top
See Also
Reference
WorksessionFileLayerOverride Class
Rhino.FileIO Namespace