RhinoCommon API
BrepEdgeFilletDistance Properties
The BrepEdgeFilletDistance type exposes the following members.
Properties
Name | Description
EdgeParameter
 The parameter along the BrepEdge where to apply a fillet distance (radius)
FilletDistance
 Distance to fillet
Top
See Also
Reference
BrepEdgeFilletDistance Class
Rhino.Geometry Namespace