RhinoCommon API
FileStpReadOptions Properties
The FileStpReadOptions type exposes the following members.
Properties
Name | Description
JoinSurfaces
LimitFaces
MaxFaceCount
Top
See Also
Reference
FileStpReadOptions Class
Rhino.FileIO Namespace