RhinoCommon API
OptionString Properties
The OptionString type exposes the following members.
Properties
Name | Description
CurrentValue
 Gets and sets the current value of the option.
InitialValue
 Gets the initial value of the option.
Top
See Also
Reference
OptionString Class
Rhino.Input.Custom Namespace