RhinoCommon API
ArchivableDictionary Properties
The ArchivableDictionary type exposes the following members.
Properties
Name | Description
ChangeSerialNumber
 Retrieve current change serial number. This is a number that gets increased each time a datum is set or changed.
Count
 Gets the number of key/value pairs contained in the dictionary.
Item
 Gets the value associated with the specified key.
Keys
Gets all entry names or keys.
Name
 Gets or sets the name string of this ArchivableDictionary.
ParentUserData
 If this dictionary is part of user-data (or is a UserDictionary), then this is the parent user data. null if this dictionary is not part of user-data
Values
Gets all values in this dictionary.
Version
 Gets or sets the version of this ArchivableDictionary.
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace