RhinoCommon API
VariationalPatchSettings Properties
The Brep.VariationalPatchSettings type exposes the following members.
Properties
Name | Description
AngleToleranceRadians
 Tolerance for normal (G1) constraints
Bending
 Bending to apply (default 0.3)
CurvatureRelativeTolerance
 Relative curvature (G2) tolerance between curvature values that are both not smaller than CurvatureZeroTolerance.
CurvatureZeroTolerance
 Curvature value considered to be zero.
DegreeU
 Surface degree in U-direction
DegreeV
 Surface degree in V-direction
Domain
 The domain creation option
InitialSurface
 The initial surface to use (default: null). The initial surface may not be rational.
InternalTolerance
 Tolerance for positional (G0int) constraints on internal curves
MaxRefinements
 The maximum number of refinements to apply (default 5).
PreserveEdges
 When an initial surface has been set, use PreserveEdges to fix the surface boundary.
RocBending
 Rate-of-change in bending to apply (default 0.7)
SpanCountU
 Number of spans in U-direction
SpanCountV
 Number of spans in V-direction
Stretching
 Stretching to apply (default 0, better not change)
Tolerance
 Tolerance for positional (G0) constraints on edges
UVRotation
 The rotation angle of the UV domain
Top
See Also
Reference
Brep.VariationalPatchSettings Class
Rhino.Geometry Namespace