RhinoCommon API
GetPointMouseEventArgs Properties
The GetPointMouseEventArgs type exposes the following members.
Properties
Name | Description
ControlKeyDown
LeftButtonDown
MiddleButtonDown
Point
RightButtonDown
ShiftKeyDown
Source
Viewport
WindowPoint
Top
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace