RhinoCommon API
GumballObject Properties
The GumballObject type exposes the following members.
Properties
Name | Description
Frame
Top
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace