RhinoCommon API
ChannelGPU Properties
The RenderWindow.ChannelGPU type exposes the following members.
Properties
Name | Description
DisplayTechnology
 Return the type of API used for this channel's texture handle.
Top
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace