RhinoCommon API
GripObject Properties
The GripObject type exposes the following members.
Properties
Name | Description
CurrentLocation
Index |  (Overrides ModelComponent.Index.)
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Moved
 true if the grip has moved from OriginalLocation.
OriginalLocation
Owner
 The object these grips belong to.
OwnerId
SubDComponentId
 Id of the SubD component this grip is on, or 0 when the grip names no SubD component.
Weight
 The weight of a NURBS control point grip or RhinoMath.UnsetValue if the grip is not a NURBS control point grip.
Top
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace