RhinoCommon API
SubD Properties
The SubD type exposes the following members.
Properties
Name | Description
Edges
 All edges in this SubD
Empty
 Get a new, empty SubD object.
ErrorCount
 The number of errors the SubD code has trapped since the process started.
 This is a diagnostic counter, not a per-SubD property. Sample it before and after an operation to find out whether that operation hit an internal error, which usually means the SubD is not valid.
Faces
 All faces in this SubD
IsSolid
 Test SubD to see if the active level is a solid. A "solid" is a closed oriented manifold, or a closed oriented manifold.
TextureCoordinateType
 Gets the texture cordinate type.
Vertices
 All vertices in this SubD
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace