RhinoCommon API
InitFramebufferEventArgs Properties
The RealtimeDisplayMode.InitFramebufferEventArgs type exposes the following members.
Properties
Name | Description
Pipeline
Top
See Also
Reference
RealtimeDisplayMode.InitFramebufferEventArgs Class
Rhino.Render Namespace