RhinoCommon API
MeshPrincipalCurvatureList Properties
The MeshPrincipalCurvatureList type exposes the following members.
Properties
Name | Description
Capacity
 Gets or sets the total number of principal curvatures the internal data structure can hold without resizing.
Count
 Gets or sets the number of principal curvatures.
Item
 Gets or sets the principal curvature at the given index.
Top
See Also
Reference
MeshPrincipalCurvatureList Class
Rhino.Geometry.Collections Namespace