RhinoCommon API
OrdinateDimension Properties
The OrdinateDimension type exposes the following members.
Properties
Name | Description
DefPoint
Direction
 Gets or sets the measured direction.
KinkOffset1
KinkOffset2
KinkPoint1
KinkPoint2
LeaderPoint
Top
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace