RhinoCommon API
PanelEventArgs Properties
The PanelEventArgs type exposes the following members.
Properties
Name | Description
Document
DocumentSerialNumber
PanelId
 Class Id for panel being shown or hidden
Top
See Also
Reference
PanelEventArgs Class
Rhino.UI Namespace