RhinoCommon API
LineCurve Properties
The LineCurve type exposes the following members.
Properties
Name | Description
Line
 Gets or sets the Line value inside this curve.
Top
See Also
Reference
LineCurve Class
Rhino.Geometry Namespace