RhinoCommon API
Notification Properties
The Notification type exposes the following members.
Properties
Name | Description
AllowedAssemblies
 The assemblies that can modify this instance.
AlternateButtonTitle
 The localized title of the Alternate button.
ButtonClicked
 An Action that will be invoked whenever a button for the notification is clicked or the notification is closed.
CancelButtonTitle
 The localized title of the Cancel button.
ConfirmButtonTitle
 The localized title of the Confirm button.
DateUpdated
 The date the notification was last modified.
Description
 The description of the notification. The description is displayed in the Notifications panel in Rhino.
Item
 Gets or sets metadata for this instance.
Message
 The message of the notification. The message is shown only when the instance is displayed modally. It should contain details about the notification.
MetadataCopy
 A copy of all the metadata for this class.
SeverityLevel
 The severity of the notification. Changing the severity of the notification may change the way Rhino chooses to display the Notifications panel.
ShowEventId
 A field used by Rhino for displaying notifications. Not intended for public use.
Title
 The title of the notification. The title is displayed when the notification is displayed modally in Rhino.
Top
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace