RhinoCommon API
Markup Properties
The Markup type exposes the following members.
Properties
Name | Description
Bitmap
Comments
ComponentType
 Returns Markup.
 (Overrides ModelComponent.ComponentType.)
Created
CreatedBy
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
IsUnset
Returns true if the markup is unset.
Modified
ModifiedBy
Name |  (Overrides ModelComponent.Name.)
Top
See Also
Reference
Markup Class
Rhino.DocObjects Namespace