RhinoCommon API
ObjRef Properties
The ObjRef type exposes the following members.
Properties
Name | Description
Document
 Gets the document that owns this object reference.
GeometryComponentIndex
 Gets the component index of the referenced (sub) geometry. Some objects have sub-objects that are valid pieces of geometry. For example, breps have edges and faces that are valid curves and surfaces. Each sub-object has a component index that is > 0. The parent geometry has a component index = -1.
ObjectId
Returns the id of the referenced Rhino object.
RuntimeSerialNumber
 If > 0, then this is the value of a Rhino object's serial number field. The serial number is used instead of the pointer to prevent crashes in cases when the RhinoObject is deleted but an ObjRef continues to reference the Rhino object. The value of RuntimeSerialNumber is not saved in archives because it generally changes if you save and reload an archive.
Top
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace