RhinoCommon API
PageViewSpaceChangeEventArgs Properties
The PageViewSpaceChangeEventArgs type exposes the following members.
Properties
Name | Description
NewActiveDetailId
 The id of the detail object was set active. Note, if this id is equal to Guid.Empty, then the active detail object is the page view itself.
OldActiveDetailId
 The id of the previously active detail object. Note, if this id is equal to Guid.Empty, then the active detail object was the page view itself.
PageView
 The page view on which a different detail object was set active.
Top
See Also
Reference
PageViewSpaceChangeEventArgs Class
Rhino.Display Namespace