RhinoCommon API
SimpleArrayExtrusionPointer Properties
The SimpleArrayExtrusionPointer type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of Extrusions in this array.
Top
See Also
Reference
SimpleArrayExtrusionPointer Class
Rhino.Runtime.InteropWrappers Namespace