RhinoCommon API
DracoCompressionOptions Properties
The DracoCompressionOptions type exposes the following members.
Properties
Name | Description
CompressionLevel
 Compression level. 0 if fastest, but least compression. 10 is slowest, but best compression
NormalQuantizationBits
 Sets the quantization compression options for normal values. The values will be quantized in a box defined by the maximum extent of the values. I.e., the actual precision of this option depends on the scale of the attribute values.
PositionQuantizationBits
 Sets the quantization compression options for position values. The values will be quantized in a box defined by the maximum extent of the values. I.e., the actual precision of this option depends on the scale of the attribute values.
TextureCoordintateQuantizationBits
 Sets the quantization compression options for texture coordinate values. The values will be quantized in a box defined by the maximum extent of the values. I.e., the actual precision of this option depends on the scale of the attribute values.
Top
See Also
Reference
DracoCompressionOptions Class
Rhino.FileIO Namespace