RhinoCommon API
SelCommand Properties
The SelCommand type exposes the following members.
Properties
Name | Description
BeQuiet
TestGrips
TestLights
Top
See Also
Reference
SelCommand Class
Rhino.Commands Namespace