RhinoCommon API
GrasshopperDisplayMaterial Properties
The GrasshopperDisplayMaterial type exposes the following members.
Properties
Name | Description
Desaturation
 Gets or sets how far the shaded colour is blended towards greyscale, as a fraction from 0 to 1: 0 leaves the colour untouched, 1 is fully greyscale, and values in between blend linearly. Default: 0.
Diffuse
 Gets or sets the diffuse colour — the colour reached in the brightest areas of the shading. The alpha channel is opacity, following the usual Color convention: A=255 is fully opaque and A=0 fully transparent. Note this differs from Diffuse, which ignores alpha. Default: opaque white.
ShadeFalseColor
 Gets or sets whether a mesh's vertex colours are shaded. Has no effect on a mesh that has no vertex colours. Default: false.
Stippling
 Gets or sets whether an 8x8 Bayer stipple (dither) mask is applied. Default: false.
StipplingAmount
 Gets or sets how much of the stipple pattern is turned off, as a fraction from 0 to 1 (used only when Stippling is true). Default: 0.
StripeContrast
 Gets or sets the stripe contrast (used only when Striping is true). The effective range is 0..0.9; higher values are clamped, and 0 means no visible striping. Default: 1.0.
StripeWidth
 Gets or sets the width of one stripe band in screen-space pixels (used only when Striping is true). Stripes run along the screen diagonal and the light/dark pattern repeats every 2 × StripeWidth pixels; values below 1 are treated as 1. This is a pixel-space overlay — it does not scale with zoom or model units. Default: 0.
Striping
 Gets or sets whether the G2 striping overlay is applied. Default: false.
Top
See Also
Reference
GrasshopperDisplayMaterial Class
Rhino.Display Namespace