RhinoCommon API
RenderPlugIn Properties
The RenderPlugIn type exposes the following members.
Properties
Name | Description
InitialChannelToDisplay
PerferBasicContent
 Set to true if you would like Rhino to quickly create a basic render content in response to 'Create New' commands. Set to false if you would prefer Rhino to display the render content chooser dialog.
SupportedChannels
 Override to communicate that the renderer supports more channels beside the default channels RGBA, Depth, Normal, Albedo. See RenderWindow.StandardChannels. RenderWindow.ChannelId can be used to get the GUIDs for the channels to support
SupportsEditProperties
 Override this property and return true if your plug-in supports decals and overrides ShowDecalProperties(List<NamedValue>)
Top
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace