RhinoCommon API
Vector2f Properties
The Vector2f type exposes the following members.
Properties
Name | Description
IsUnitVector
 Gets a value indicating whether or not this is a unit vector. A unit vector has length 1.
IsValid
 Returns an indication regarding the validity of this vector.
IsZero
 Gets a value indicating whether the X, Y, and Z values are all equal to 0.0.
Length
 Computes the length (or magnitude, or size) of this vector. This is an application of Pythagoras' theorem. If this vector is invalid, its length is considered 0.
SquareLength
 Returns the square of the length of this vector. This method does not check for the validity of its inputs.
Unset
 Gets the value of the vector with each component set to RhinoMath.UnsetValue.
X
 Gets or sets the X (first) component of this vector.
XAxis
 Gets the value of the vector with components 1,0.
Y
 Gets or sets the Y (second) component of this vector.
YAxis
 Gets the value of the vector with components 0,1.
Zero
 Gets the value of the vector with components 0,0.
Top
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace