RhinoCommon API
ClassArrayOnObjRef Properties
The ClassArrayOnObjRef type exposes the following members.
Properties
Name | Description
Count
 Gets the number of ObjRef instances in this array.
Top
See Also
Reference
ClassArrayOnObjRef Class
Rhino.Runtime.InteropWrappers Namespace