RhinoCommon API
BrepCurveList Properties
The BrepCurveList type exposes the following members.
Properties
Name | Description
Count
Gets the number of curves in this list.
Item
 Gets the Curve at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
BrepCurveList Class
Rhino.Geometry.Collections Namespace