RhinoCommon API
Interpolator Properties
The Interpolator type exposes the following members.
Properties
Name | Description
Cyclical
 Gets or sets a value indicating whether or not the values inside this Interpolator are to be treated as cyclical (i.e. circular).
Top
See Also
Reference
Interpolator Class
Rhino.Geometry Namespace