RhinoCommon API
RenderContentManager Properties
The RenderContentManager type exposes the following members.
Properties
Name | Description
UserRenderContentPath
 Get the path to: Windows: C:\Users\user\AppData\Roaming\McNeel\Rhinoceros\6.0\Localization\en-US\Render Content macOS: ~/Library/Application Support/McNeel/Rhinoceros/6.0/Render Content If a CustomLibraryPath is set, this is returned
Top
See Also
Reference
RenderContentManager Class
Rhino.Render Namespace