RhinoCommon API
SceneServerData Properties
The SceneServerData type exposes the following members.
Properties
Name | Description
CppPointer
 The CppPointer of SceneServerData
Top
See Also
Reference
SceneServerData Class
Rhino.Render Namespace