RhinoCommon API
FilePdfReadOptions Properties
The FilePdfReadOptions type exposes the following members.
Properties
Name | Description
ImportFillsAsHatches
LoadText
PDFScale
PdfUnits
PreserveModelScale
RhinoScale
Top
See Also
Reference
FilePdfReadOptions Class
Rhino.FileIO Namespace