RhinoCommon API
MeshThicknessMeasurement Properties
The MeshThicknessMeasurement type exposes the following members.
Properties
Name | Description
MeshIndex
 Gets the index of the mesh associated with this thickness measurement.
OppositePoint
 Gets the point opposite to the measurement point.
Point
 Gets the location of the thickness measurement.
Thickness
 Gets the local thickness of the mesh.
VertexIndex
 Gets the index of the vertex associated with this thickness measurement.
Top
See Also
Reference
MeshThicknessMeasurement Structure
Rhino.Geometry Namespace