RhinoCommon API
PostEffectPipeline Properties
The PostEffectPipeline type exposes the following members.
Properties
Name | Description
GPUAllowed
 Post effect authors should check that GPU use is allowed before using the GPU in a post effect.
IsRendering
 IsRendering
RenderingId
 Return a UUID that uniquely identifies the rendering being processed.
Top
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace