RhinoCommon API
DisplayModeDescription Properties
The DisplayModeDescription type exposes the following members.
Properties
Name | Description
AllowObjectAssignment
AmbientOcclusionId
ArtisticId
DisplayAttributes
EnglishName
GhostedId
Id
InMenu
LocalName
MonochromeId
PenId
PipelineLocked
RaytracedId
RenderedId
RenderedShadowsId
ShadedId
ShadedPipelineRequired
SupportsShadeCommand
SupportsShading
TechId
WireframeId
WireframePipelineRequired
XRayId
Top
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace