RhinoCommon API
RhinoDocObserverArgs Properties
The RhinoDocObserverArgs type exposes the following members.
Properties
Name | Description
Doc
 Document
RuntimeSerialNumber
 Document runtime serial number, will be different across Rhino sessions.
Top
See Also
Reference
RhinoDocObserverArgs Class
Rhino Namespace