RhinoCommon API
PersistentSettingsEventArgs<T> Properties
The PersistentSettingsEventArgs<T> generic type exposes the following members.
Properties
Name | Description
CurrentValue
NewValue
Top
See Also
Reference
PersistentSettingsEventArgs<T> Class
Rhino Namespace