RhinoCommon API
MarkupViewChangedEventArgs Properties
The MarkupViewChangedEventArgs type exposes the following members.
Properties
Name | Description
Document
The Rhino document.
Index
 The table index of the markup being viewed or edited, or -1 if none (for example when leaving markup mode or while creating a new markup).
Mode
The markup mode the document is now in.
Top
See Also
Reference
MarkupViewChangedEventArgs Class
Rhino.DocObjects.Tables Namespace