RhinoCommon API
SubDEdge Properties
The SubDEdge type exposes the following members.
Properties
Name | Description
ControlNetLine
 Line representing the control net end points.
FaceCount
Number of faces for this edge.
IsSharp
 Gets true if this edge is smooth and has a nonzero sharpness. A crease edge is not a sharp edge.
RelativeFaceLeft
 The face on the left of this edge, with respect to the direction this edge is referenced with. Null for a boundary edge with no face on that side, and for a nonmanifold edge.
RelativeFaceRight
 The face on the right of this edge, with respect to the direction this edge is referenced with.
RelativeVertexFrom
 The vertex this edge starts at, taking ComponentDirection into account. This is VertexFrom for an edge in its natural orientation and VertexTo for a reversed one.
RelativeVertexTo
 The vertex this edge ends at, taking ComponentDirection into account.
Sharpness
 Gets or sets the sharpness of this edge.
 The getter reports Crease for a crease edge; use GetSharpness(false) to get Smooth for creases instead.
Tag
 identifies the type of subdivision edge.
VertexFrom
 Start vertex for this edge.
VertexTo
 End vertex for this edge.
Top
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace