RhinoCommon API
BrepLoopList Properties
The BrepLoopList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of brep loops.
Item
 Gets the BrepLoop at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
BrepLoopList Class
Rhino.Geometry.Collections Namespace