RhinoCommon API
UserDictionary Properties
The UserDictionary type exposes the following members.
Properties
Name | Description
Description
 Gets the text "RhinoCommon UserDictionary".
 (Overrides UserData.Description.)
Dictionary
 Gets the dictionary that is associated with this class.
This dictionary is unique.
ShouldWrite
 Writes this entity if the count is larger than 0.
 (Overrides UserData.ShouldWrite.)
Top
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace