RhinoCommon API
GetObject Properties
The GetObject type exposes the following members.
Properties
Name | Description
AlreadySelectedObjectSelect
 Allow selecting objects that are already selected. By default, GetObjects() disallows selection of objects that are already selected to avoid putting the same object in the selection set more than once. Calling EnableAlreadySelectedObjectSelect = true overrides that restriction and allows selected objects to be selected and returned by GetObjects. This is useful because, coupled with the return immediately mode of GetObjects(1, -1), it is possible to select a selected object to deselect when the selected objects are being managed outside GetObjects() as in the case of CRhinoPolyEdge::GetEdge().
BottomObjectPreference
 By default, if a call to Input is permitted to select different parts of the same object, like a polysurface, a surface and an edge, then the top-most object is preferred. (polysurface beats face beats edge). If you want the bottom most object to be preferred, then call EnableBottomObjectPreference = true before calling GetObjects().
ChooseOneQuestion
 By default, if a call to Input is permitted to select different parts of the same object, like a polysurface and an edge of that polysurface, then the top-most object is automatically selected. If you want the choose-one-object mechanism to include pop up in these cases, then call EnableChooseOneQuestion = true before calling GetObjects().
DeselectAllBeforePostSelect
 true if pre-selected input will be deselected before post-selection begins when no pre-selected input is valid.
GeometryAttributeFilter
 The geometry attribute filter provides a secondary filter that can be used to restrict which objects can be selected. Control of the type of geometry (points, curves, surfaces, meshes, etc.) is provided by GetObject.SetGeometryFilter. The geometry attribute filter is used to require the selected geometry to have certain attributes (open, closed, etc.). The default attribute filter permits selection of all types of geometry.
GeometryFilter
 The geometry type filter controls which types of geometry (points, curves, surfaces, meshes, etc.) can be selected. The default geometry type filter permits selection of all types of geometry. NOTE: the filter can be a bitwise combination of multiple ObjectTypes.
GroupSelect
 By default, groups are ignored in GetObject. If you want your call to GetObjects() to select every object in a group that has any objects selected, then enable group selection.
InactiveDetailPickEnabled
 By default, objects in inactive details are not permitted to be picked. In a few rare cases this is used (ex. picking circles during DimRadius)
LockedObjectSelect
 By default, locked objects cannot be selected. If you do want to be able to select locked objects, then call LockedObjectSelect=true.
ObjectCount
 Gets the number of objects that were selected.
ObjectsWerePreselected
OneByOnePostSelect
 In one-by-one post selection, the user is forced to select objects by post picking them one at a time.
ProxyBrepFromSubD
 If a subd (or a subd component) cannot be selected, but a brep (or brep component) can be selected, then automatically create and use a proxy brep.
ReferenceObjectSelect
 By default, reference objects can be selected. If you do not want to be able to select reference objects, then call EnableReferenceObjectSelect=false.
SerialNumber
 Each instance of GetObject has a unique runtime serial number that is used to identify object selection events associated with that instance.
SubObjectSelect
 By default, GetObject.Input will permit a user to select sub-objects (like a curve in a b-rep or a curve in a group). If you only want the user to select "top" level objects, then call EnableSubObjectSelect = false.
Top
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace