RhinoCommon API
Matrix Properties
The Matrix type exposes the following members.
Properties
Name | Description
ColumnCount
 Gets the amount of columns.
IsColumnOrthogonal
 Gets a value indicating whether the matrix is column orthogonal.
IsColumnOrthoNormal
 Gets a value indicating whether the matrix is column orthonormal.
IsRowOrthogonal
 Gets a value indicating whether the matrix is row orthogonal.
IsRowOrthoNormal
 Gets a value indicating whether the matrix is row orthonormal.
IsSquare
 Gets a value indicating whether this matrix has the same number of rows and columns. 0x0 matrices are not considered square.
IsValid
 Gets a value indicating whether this matrix is valid.
Item
 Gets or sets the matrix value at the given row and column indices.
RowCount
 Gets the amount of rows.
Top
See Also
Reference
Matrix Class
Rhino.Geometry Namespace