RhinoCommon API
SimpleArrayBrepPointer Properties
The SimpleArrayBrepPointer type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of breps in this array.
Top
See Also
Reference
SimpleArrayBrepPointer Class
Rhino.Runtime.InteropWrappers Namespace