RhinoCommon API
FileLwoReadOptions Properties
The FileLwoReadOptions type exposes the following members.
Properties
Name | Description
Unweld
UnweldAngle
Top
See Also
Reference
FileLwoReadOptions Class
Rhino.FileIO Namespace