RhinoCommon API
File3dmInstanceDefinitionTable Properties
The File3dmInstanceDefinitionTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns InstanceDefinition.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
See Also
Reference
File3dmInstanceDefinitionTable Class
Rhino.FileIO Namespace