RhinoCommon API
MeshTopologyEdgeList Properties
The MeshTopologyEdgeList type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of edges in this list.
Top
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace