RhinoCommon API
Environment Properties
The Environment type exposes the following members.
Properties
Name | Description
BackgroundColor
Return Value
Type:
The background color.
BackgroundImage
Return Value
Type:
The background image texture.
BackgroundProjection
Return Value
Type:
The background projection.
Top
See Also
Reference
Environment Class
Rhino.DocObjects Namespace