RhinoCommon API
RenderPlugInInfo Properties
The RenderPlugInInfo type exposes the following members.
Properties
Name | Description
Name
PlugInId
Top
See Also
Reference
RenderPlugInInfo Class
Rhino.Render Namespace