RhinoCommon API
RadialDimension Properties
The RadialDimension type exposes the following members.
Properties
Name | Description
AnnotationType
CenterPoint
DimlinePoint
IsDiameterDimension
 Gets a value indicating whether the value refers to the diameter, rather than the radius.
KneePoint
LeaderArrowBlockId
LeaderArrowSize
LeaderArrowType
LeaderCurveStyle
LeaderTextHorizontalAlignment
 Gets or sets the horizontal alignment of the radial dimension's text
RadiusPoint
TextAngleType |  (Overrides Dimension.TextAngleType.)
TextLocation |  (Overrides Dimension.TextLocation.)
TextOrientation |  (Overrides Dimension.TextOrientation.)
Top
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace