RhinoCommon API
GetColorEventArgs Properties
The GetColorEventArgs type exposes the following members.
Properties
Name | Description
IncludeButtonColors
InputColor
SelectedColor
Title
Top
See Also
Reference
GetColorEventArgs Class
Rhino.UI Namespace