RhinoCommon API
PrintedPageDefinition Properties
The PrintedPageDefinition type exposes the following members.
Properties
Name | Description
Description
 Name of the page
Height
 Height of the page in Units
Units
 Unit system for the width and height of the page
Width
 Width of the page in Units
Top
See Also
Reference
PrintedPageDefinition Class
Rhino Namespace