RhinoCommon API
SubDEdgeChain Properties
The SubDEdgeChain type exposes the following members.
Properties
Name | Description
EdgeCount
 The number of edges in this chain.
Edges
 The edges of this chain, in order.
IsClosedLoop
 True when the chain closes back on itself.
ParentSubD
 The SubD this chain runs through.
Top
See Also
Reference
SubDEdgeChain Class
Rhino.Geometry Namespace