RhinoCommon API
File3dmLinetypeTable Properties
The File3dmLinetypeTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns LinePattern.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
See Also
Reference
File3dmLinetypeTable Class
Rhino.FileIO Namespace