RhinoCommon API
InstanceDefinitionTable Properties
The InstanceDefinitionTable type exposes the following members.
Properties
Name | Description
ActiveCount
 Number of items in the instance definitions table, excluding deleted definitions.
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of items in the instance definitions table.
 (Overrides CommonComponentTable<T>.Count.)
Document
Document that owns this table.
Item
 Conceptually, the InstanceDefinition table is an array of Instance definitions. The operator[] can be used to get individual instance definition. An instance definition is either active or deleted and this state is reported by IsDeleted or will be null if it has been purged from the document.
Top
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace