RhinoCommon API
PhysicallyBased Properties
The PhysicallyBased type exposes the following members.
Properties
Name | Description
Alpha
AmbientOcclusion
Anisotropic
AnisotropicRotation
BaseColor
BRDF
Bump
Clearcoat
ClearcoatBump
ClearcoatRoughness
Displacement
Emission
Metallic
Opacity
OpacityIor
OpacityRoughness
Roughness
Sheen
SheenTint
Specular
SpecularTint
Subsurface
SubsurfaceScatteringColor
SubsurfaceScatteringRadius
Top
See Also
Reference
PhysicallyBased Class
Rhino.Render.ParameterNames Namespace