RhinoCommon API
Channel Properties
The RenderWindow.Channel type exposes the following members.
Properties
Name | Description
Height
 Return the channel height.
Id
 Return the channel id.
Width
 Return the channel width.
Top
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace