RhinoCommon API
LicenseStateChangedEventArgs Properties
The LicenseStateChangedEventArgs type exposes the following members.
Properties
Name | Description
CallingRhinoCommonAllowed
 true if RhinoCommon calls will never raise Rhino.Runtime.NotLicensedException. false otherwise
Top
See Also
Reference
LicenseStateChangedEventArgs Class
Rhino.Runtime Namespace