RhinoCommon API
Curve Properties
The Curve type exposes the following members.
Properties
Name | Description
Degree
 Gets the maximum algebraic degree of any span or a good estimate if curve spans are not algebraic.
Dimension
 Gets the dimension of the object.
The dimension is typically three. For parameter space trimming curves the dimension is two. In rare cases the dimension can be one or greater than three.
Domain
 Gets or sets the domain of the curve.
IsClosed
 Gets a value indicating whether or not this curve is a closed curve.
IsPeriodic
 Gets a value indicating whether or not this curve is considered to be Periodic.
IsSubDFriendly
 Returns true if the curve is a cubic, non-rational, uniform NURBS curve that is either periodic or has natural end conditions. Otherwise, false is returned.
PointAtEnd
 Evaluates point at the end of the curve.
PointAtMid
 Evaluates point at the middle, or mid, of the curve.
PointAtStart
 Evaluates point at the start of the curve.
SpanCount
 Gets the number of non-empty smooth (c-infinity) spans in the curve.
TangentAtEnd
Evaluate unit tangent vector at the end of the curve.
TangentAtStart
Evaluates the unit tangent vector at the start of the curve.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace