RhinoCommon API
GeneralSettingsState Properties
The GeneralSettingsState type exposes the following members.
Properties
Name | Description
AutoUpdateCommandHelp
 Gets or sets the command help dialog auto-update feature.
ContextMenuDelay
 Gets or sets the time to wait before permitting context menu display.
EnableContextMenu
 true if right mouse down + delay will pop up context menu on a mouse up if no move happens.
MaximumPopupMenuLines
 Gets or sets the maximum number of popup menu lines.
MaximumUndoMemoryMb
 Gets or sets the minimum undo memory Mb.
Undo records will be purged if there are more than MinimumUndoSteps and they use more than MaximumUndoMemoryMb.
MiddleMouseMacro
 Gets or sets the toolbar to popup when the middle mouse is clicked on a view, this value is only used when MiddleMouseMode is set to PopupToolbar.
MiddleMouseMode
 Gets or sets what happens when the user clicks the middle mouse.
MiddleMousePopupToolbar
 Gets or sets the toolbar to popup when the middle mouse is clicked on a view, this value is only used when MiddleMouseMode is set to PopupToolbar.
MinimumUndoSteps
 Gets or sets the minimum undo steps.
Undo records will be purged if there are more than MinimumUndoSteps and they use more than MaximumUndoMemoryMb.
MouseSelectMode
 Gets or sets the current selection mode.
NewObjectIsoparmCount
 Gets or sets the number of isoparm curves to show on new objects.
Top
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace