RhinoCommon API
FileDstReadOptions Properties
The FileDstReadOptions type exposes the following members.
Properties
Name | Description
ImportJumps
Top
See Also
Reference
FileDstReadOptions Class
Rhino.FileIO Namespace