RhinoCommon API
InstanceAttributeField Properties
The TextFields.InstanceAttributeField type exposes the following members.
Properties
Name | Description
DefaultValue
 Default value used when inserting a block
Key
 Attribute key
Prompt
 Prompt displayed by the UI when inserting a block
Top
See Also
Reference
TextFields.InstanceAttributeField Class
Rhino.Runtime Namespace