RhinoCommon API
SweepOneRail Properties
The SweepOneRail type exposes the following members.
Properties
Name | Description
AngleToleranceRadians
ClosedSweep
 If the input rail is closed, ClosedSweep determines if the swept breps will also be closed.
GlobalShapeBlending
 If true, the sweep is linearly blended from one end to the other, creating sweeps that taper from one cross-section curve to the other. If false, the sweep stays constant at the ends and changes more rapidly in the middle.
IsFreeform
IsRoadlike
IsRoadlikeFront
IsRoadlikeTop
IsRoadlineRight
MiterType
 0: don't miter, 1: intersect surfaces and trim sweeps, 2: rotate shapes at kinks and don't trim.
SweepTolerance
Top
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace