RhinoCommon API
UndoRecordEntry Properties
The UndoRecordEntry type exposes the following members.
Properties
Name | Description
Description
 The name of the command that created the undoable events, or a description of what created them when they did not happen in a command.
SerialNumber
 The runtime serial number Rhino assigned to this undo event.
Top
See Also
Reference
UndoRecordEntry Class
Rhino Namespace