RhinoCommon API
UserInterfaceTextBox Properties
The UserInterfaceTextBox type exposes the following members.
Properties
Name | Description
BorderColor
 Color of the outline around the box. Color.Empty, the default, means use the standard color for the theme that is in use. The outline is drawn thicker and brighter while the box has keyboard focus, whatever color it is given.
CaretPosition
 Where the insertion point sits, as a count of characters from the start of the text. Setting it clamps to the length of the text.
MaximumLength
 Most characters the text will hold. 0, the default, means no limit.
PlaceholderText
 Text drawn, dimmed, when the box is empty and does not have focus
ReadOnly
 A read only text box can take focus and be scrolled through, but typing does not change it. False by default.
Text
 What the box holds. Unlike the other controls, this is something the user changes, so reading it asks the box itself what is in it.
 (Overrides UserInterfaceControl.Text.)
Top
See Also
Reference
UserInterfaceTextBox Class
Rhino.UI Namespace