RhinoCommon API
ControlPoint Properties
The ControlPoint type exposes the following members.
Properties
Name | Description
Location
 Gets or sets world 3-D, or Euclidean location of the control point.
Unset
 Gets the predefined, unset control point.
Weight
 Gets or sets the weight of this control point.
X
 Gets or sets the X coordinate of the control point.
Y
 Gets or sets the Y coordinate of the control point.
Z
 Gets or sets the Z coordinate of the control point.
Top
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace