RhinoCommon API
Namespaces
Namespaces
Namespace | Description
Rhino
Contains commonly-used value types and classes used in Rhino.
Base namespace where we put classes that we couldn't figure out any good spot to put them.
Rhino.ApplicationSettings
Static settings global to the entire Rhino application
Static settings global to the entire Rhino application
Rhino.Collections
Rhino.Commands
Rhino.Display
Rhino.DocObjects
 The DocObjects namespace contains types that correspond to geometry that is found in a document.
Generally, these types reference an attribute and have a distinctive ID.
Rhino.DocObjects.Custom
Rhino.DocObjects.SnapShots
Rhino.DocObjects.Tables
Rhino.FileIO
Rhino.Geometry
 The Geometry namespace contains geometric types used in Rhino.
Examples are lines, curves, meshes and boundary representations.
Rhino.Geometry.Collections
Rhino.Geometry.Intersect
Rhino.Geometry.MeshRefinements
Rhino.Geometry.Morphs
Rhino.Input
Classes related to getting user input for things like points, objects, and numbers
Classes related to getting user input for things like points, objects, and numbers
Rhino.Input.Custom
Rhino.NodeInCode
Rhino.Notifications
Rhino.PlugIns
Rhino.Render
Rhino.Render.ChangeQueue
Rhino.Render.ChildSlotNames
Rhino.Render.CustomRenderMeshes
Rhino.Render.DataSources
Rhino.Render.Fields
Rhino.Render.ParameterNames
Rhino.Render.PostEffects
Rhino.Render.UI
Rhino.Runtime
Rhino.Runtime.InProcess
Rhino.Runtime.InteropWrappers
Rhino.Runtime.Notifications
Rhino.Runtime.RhinoAccounts
Rhino.UI
Rhino.UI.Controls
Rhino.UI.Controls.DataSource
Rhino.UI.Controls.ThumbnailUI
Rhino.UI.Gumball