RhinoCommon API
TransformObjectList Class
 A collection of Rhino object, grip objects, and the Rhino objects that owns the grips. Used by the TransformCommand and GetTransform classes.
Inheritance Hierarchy
System.Object
 Rhino.Collections.TransformObjectList
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class TransformObjectList : IDisposable
Public Class TransformObjectList
	Implements IDisposable
The TransformObjectList type exposes the following members.
Constructors
Name | Description
TransformObjectList
Initializes a new instance of the TransformObjectList class
Top
Properties
Name | Description
Count
 Number of elements in this list
DisplayFeedbackEnabled
GripCount
 Number of elements in grip list
GripOwnerCount
 Number of elements in grip owner list
Top
Methods
Name | Description
Add(ObjRef)
 Add an ObjRef to this list. Use this to add polyedges so the references are properly counted
Add(RhinoObject)
 Add a RhinoObject to this list
AddObjects
 Add objects to list with a GetObject
Clear
 Remove all elements from this list
Dispose()
Releases all resources used by the TransformObjectList
Dispose(Boolean)
Releases the unmanaged resources used by the TransformObjectList and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
GetBoundingBox
 Gets the bounding box of all of the objects that this list contains.
GripArray
 Gets access to the internal GripObject array of the TransformObjectList object.
GripOwnerArray
 Gets access to the internal GripOwner array of the TransformObjectList object.
ObjectArray
 Gets access to the internal RhinoObject array of the TransformObjectList object.
UpdateDisplayFeedbackTransform
Top
See Also
Reference
Rhino.Collections Namespace