RhinoCommon API
Aligner Class
 Moves vertices of different kinds of geometry onto one another, within a distance.
See the
_AlignVertices
 Rhino command for more information.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Aligner
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static class Aligner
Public NotInheritable Class Aligner
The Aligner type exposes the following members.
Methods
Name | Description
AlignVertices(IEnumerable<GeometryBase>, Double, Boolean, Boolean)
 Moves vertices that lie within the specified distance of one another onto the same location.
This is helpful to close the seams between separate pieces of geometry.
All vertices are considered, not only those on naked edges, unless onlyNaked says otherwise.
See the
_AlignVertices
 Rhino command for more information.
AlignVertices(IEnumerable<GeometryBase>, Double, Boolean, Boolean, IEnumerable<IEnumerable<Boolean>>)
 Moves vertices that lie within the specified distance of one another onto the same location.
This is helpful to close the seams between separate pieces of geometry.
See the
_AlignVertices
 Rhino command for more information.
SuggestDistance
 Suggests a distance for AlignVertices(IEnumerable<GeometryBase>, Double, Boolean, Boolean) from the geometry itself, so the gaps do not have to be measured first.
A vertex whose nearest neighbour of all belongs to another object was meant to be shared with it. The largest of those gaps closes every one of them, and is smaller than the spacing each object has of its own at those places.
SupportsGeometry
 Tests whether a piece of geometry can have its vertices aligned.
Meshes, SubDs, point clouds and degree 1 curves are supported.
Top
See Also
Reference
Rhino.Geometry Namespace