RhinoCommon API
SubDCreationOptions.TextureCoordinateOption Enumeration
 Specifies how texture coordinate information is transferred from the mesh to the SubD.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextureCoordinateOption
Public Enumeration TextureCoordinateOption
Members
Member name | Value | Description
Unset | 0 | The option is not set.
None | 1 | No texture coordianate information is transferred from the mesh.
Automatic | 2 |  If the mesh has a mapping, then TextureCoordinatesOption::CopyMapping is used. Otherwise if the mesh has texture coordinates, then TextureCoordinatesOption::CopyCoordinates is used. Otherwise TextureCoordinatesOption::Packed is used.
Packed | 3 |  No texture coordianate information is transferred from the mesh. The SubD faces are packed.
CopyMapping | 4 | Texture coordinates mapping information is copied from the mesh. Generally this is the best choice because common mappings, like planar, will appear as most people expect on the SubD.
CopyCoordinates | 5 |  If a mesh has custom texture coordinates, the custom texture coordinates are transferred to the SubD. This requires more memory resources, slows subdivision evaluation, often produces unattractive results on n-gons, and distorts the texture when comes from a common mapping technique, like planar. This option may be useful when the mesh contains only triangles and quads and the custom texture coordinates are of high quality.
See Also
Reference
Rhino.Geometry Namespace