RhinoCommon API
KeyboardShortcut Class
 A shortcut is a key plus modifier combination that executes a macro
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.KeyboardShortcut
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class KeyboardShortcut
Public Class KeyboardShortcut
The KeyboardShortcut type exposes the following members.
Constructors
Name | Description
KeyboardShortcut
Initializes a new instance of the KeyboardShortcut class
Top
Properties
Name | Description
Key
Key used for shortcut
Macro
Macro to execute when key plus modifier are pressed
Modifier
Modifier key used for shortcut
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace