RhinoCommon API
PostEffectExecutionControl Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffectExecutionControl"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.PostEffectExecutionControl
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class PostEffectExecutionControl : IDisposable
Public MustInherit Class PostEffectExecutionControl
	Implements IDisposable
The PostEffectExecutionControl type exposes the following members.
Constructors
Name | Description
PostEffectExecutionControl
Initializes a new instance of the PostEffectExecutionControl class
Top
Methods
Name | Description
Detach
Dispose()
Releases all resources used by the PostEffectExecutionControl
Dispose(Boolean)
Releases the unmanaged resources used by the PostEffectExecutionControl and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
ReadyToExecutePostEffect
Top
See Also
Reference
Rhino.Render.PostEffects Namespace