RhinoCommon API
SubD Class
 Subdivision surface
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.SubD
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class SubD : GeometryBase
<SerializableAttribute>
Public Class SubD
	Inherits GeometryBase
The SubD type exposes the following members.
Constructors
Name | Description
SubD()
 Create a new instance of SubD geometry
SubD(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
Edges
 All edges in this SubD
Empty
 Get a new, empty SubD object.
ErrorCount
 The number of errors the SubD code has trapped since the process started.
 This is a diagnostic counter, not a per-SubD property. Sample it before and after an operation to find out whether that operation hit an internal error, which usually means the SubD is not valid.
Faces
 All faces in this SubD
IsSolid
 Test SubD to see if the active level is a solid. A "solid" is a closed oriented manifold, or a closed oriented manifold.
TextureCoordinateType
 Gets the texture cordinate type.
Vertices
 All vertices in this SubD
Top
Methods
Name | Description
ClearEdgeSharpness
 Converts every sharp edge in this SubD to a smooth edge.
ClearEvaluationCache
 Clear all cached evaluation information (meshes, surface points, bounding boxes, ...) that depends on edge tags, vertex tags, and the location of vertex control points.
ClosestPoint(Point3d)
 Gets the point on this SubD's surface that is closest to a test point.
ClosestPoint(Point3d, Point3d, SubDComponentParameter)
 Gets the point on this SubD's surface that is closest to a test point.
ClosestPoint(Point3d, Point3d, SubDComponentParameter, Double)
 Gets the point on this SubD's surface that is closest to a test point.
ClosestPoints
 Gets the points on this SubD's surface that are closest to each of a list of test points. This is faster than calling ClosestPoint(Point3d, Point3d, SubDComponentParameter) in a loop because the spatial index over the surface is built once.
ComponentFromComponentIndex
 Returns a SubDComponent, either a SubDEdge, SubDFace, or SubDVertex, from a component index.
CopyEvaluationCache
 Expert function that copies cached evaluations of component subdivision points and limit surface information from src to this. Typically this is done for performance critical situations like control point editing: - Copy a SubD to be modified (this does not copy the evaluation cache) - Copy the evaluation cache from the unmodified SubD - Modify the SubD copy - Update the surface mesh cache so that only the modified parts are recalculated - Display, meshing, bounding boxes on the modified SubD are now available
CreateFromCylinder
 Creates a SubD form of a cylinder.
CreateFromLoft
 Creates a SubD lofted through shape curves.
CreateFromMesh(Mesh)
 Create a new SubD from a mesh.
CreateFromMesh(Mesh, SubDCreationOptions)
 Create a new SubD from a mesh.
CreateFromSurface
 Create a SubD that approximates the surface. If the surface is a SubD friendly NURBS surface and withCorners is true, then the SubD and input surface will have the same geometry.
CreateFromSweep(NurbsCurve, NurbsCurve, IEnumerable<NurbsCurve>, Boolean, Boolean)
 Fits a SubD through a series of profile curves that define the SubD cross-sections and two curves that defines SubD edges.
CreateFromSweep(NurbsCurve, IEnumerable<NurbsCurve>, Boolean, Boolean, Boolean, Vector3d)
 Fits a SubD through a series of profile curves that define the SubD cross-sections and one curve that defines a SubD edge.
CreateGlobeSphere
 Creates a SubD sphere made from polar triangle fans and bands of quads. The result resembles a globe with triangle fans at the poles and the edges forming latitude parallels and longitude meridians.
CreateIcosahedron
 Creates a SubD sphere based on an icosohedron (20 triangular faces and 5 valent vertices). This is a goofy topology for a Catmull-Clark subdivision surface (all triangles, all vertices have 5 edges). You may want to consider using the much behaved result from CreateSubDQuadSphere(sphere, vertexLocation, 1) or even the result from CreateSubDGlobeSphere().
CreateQuadSphere
 Creates a SubD sphere made from quad faces.
CreateSubDBox(Box, Double, UInt32, UInt32, UInt32)
 Creates a SubD box from a Box.
CreateSubDBox(IEnumerable<Point3d>, Double, UInt32, UInt32, UInt32)
 Creates a SubD box.
CreateTriSphere
 Creates a SubD sphere made from triangular faces. This is a goofy topology for a Catmull-Clark subdivision surface (all triangles and all vertices have 5 or 6 edges). You may want to consider using the much behaved result from CreateSubDQuadSphere() or even the result from CreateSubDGlobeSphere().
DeleteComponents(IEnumerable<SubDComponent>)
 Deletes components from this SubD, leaving the edges that bounded any deleted face unmarked. See DeleteComponents(IEnumerable<SubDComponent>, Boolean).
DeleteComponents(IEnumerable<ComponentIndex>, Boolean)
 Deletes components from this SubD, identified by component index.
DeleteComponents(IEnumerable<SubDComponent>, Boolean)
 Deletes components from this SubD.
 Deleting a vertex deletes every edge and face attached to it. Deleting an edge deletes every face attached to it. Deleting a face deletes only that face.
Dispose(Boolean)
 Deletes the underlying native pointer during a Dispose call or GC collection
 (Overrides GeometryBase.Dispose(Boolean).)
DissolveOrDeleteComponents(IEnumerable<ComponentIndex>)
 Dissolves or deletes components, identified by component index. See DissolveOrDeleteComponents(IEnumerable<SubDComponent>).
DissolveOrDeleteComponents(IEnumerable<SubDComponent>)
 Dissolves the given edges and vertices, merging the faces around them, and deletes the given faces.
 This is the difference between removing an edge between two quads to get one bigger face, and removing the two quads to leave a hole. Use DeleteComponents(IEnumerable<SubDComponent>, Boolean) when a hole is what you want.
DuplicateEdgeCurves()
 Gets Nurbs form of all edges in this SubD, with clamped knots. NB: Does not update the SubD evaluation cache before getting the edges.
DuplicateEdgeCurves(Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Gets Nurbs form of edges in this SubD. NB: Does not update the SubD evaluation cache before getting the edges.
Evaluate(SubDComponentParameter, Point3d)
 Evaluates the location of a point on this SubD's surface.
Evaluate(SubDComponentParameter, Point3d, Vector3d)
 Evaluates the location and unit normal of a point on this SubD's surface.
Evaluate(SubDComponentParameter, Point3d, Vector3d, Vector3d, Vector3d)
 Evaluates the location, first derivatives and unit normal of a point on this SubD's surface.
EvaluateCurvature(SubDComponentParameter, SurfaceCurvature)
 Evaluates the curvature of a point on this SubD's surface.
EvaluateCurvature(SubDComponentParameter, SubD.ExtraordinaryVertexCurvature, SurfaceCurvature)
 Evaluates the curvature of a point on this SubD's surface, choosing what to report exactly on an extraordinary vertex.
EvaluateCurvature(SubDComponentParameter, Point3d, Vector3d, Double, Double)
 Evaluates the principal curvatures of a point on this SubD's surface.
Flip
 Reverses the orientation of all SubD normals.
InterpolateSurfacePoints(Point3d[])
 Modifies the SubD so that the SubD vertex limit surface points are equal to surface_points[]
InterpolateSurfacePoints(UInt32[], Point3d[])
 Modifies the SubD so that the SubD vertex limit surface points of the listed vertices are equal to surface_points[].
JoinSubDs(IEnumerable<SubD>, Double, Boolean)
 Joins an enumeration of SubDs to form as few as possible resulting SubDs. There may be more than one SubD in the result array.
JoinSubDs(IEnumerable<SubD>, Double, Boolean, Boolean)
 Joins an enumeration of SubDs to form as few as possible resulting SubDs. There may be more than one SubD in the result array.
MergeAllCoplanarFaces(Double)
 Merges adjacent coplanar faces into single faces.
MergeAllCoplanarFaces(Double, Double)
 Merges adjacent coplanar faces into single faces.
NonConstOperation
 Destroy cache handle
 (Overrides GeometryBase.NonConstOperation().)
Offset
 Makes a new SubD with vertices offset at distance in the direction of the control net vertex normals. Optionally, based on the value of solidify, adds the input SubD and a ribbon of faces along any naked edges.
OnSwitchToNonConst
 Called when this object switches from being considered "owned by the document" to being an independent instance.
 (Overrides GeometryBase.OnSwitchToNonConst().)
PackFaces
 Resets the SubD to the default face packing if adding creases or deleting faces breaks the quad grids. It does not change the topology or geometry of the SubD. SubD face packs always stop at creases.
SetEdgeSharpness(IEnumerable<SubDEdge>, SubDEdgeSharpness, Boolean)
 Sets the sharpness of a list of edges.
SetEdgeSharpness(IEnumerable<SubDEdge>, IEnumerable<SubDEdgeSharpness>, Boolean)
 Sets the sharpness of a list of edges, one sharpness per edge.
 Use this with CreateEdgeChainSharpness(Interval, Int32) to give a chain of edges a sharpness that varies evenly along it.
SetEdgeSharpness(IEnumerable<Int32>, SubDEdgeSharpness, Boolean)
 Sets the sharpness of a list of edges, identified by their ids.
SetVertexSurfacePoint
 Set the location of a single vertex surface point. This function is not suitable for setting the locations of multiple vertex surface points that are topologically near to each other.
SharpEdgeCount()
 Gets the number of sharp edges in this SubD. See IsSharp for what makes an edge sharp.
SharpEdgeCount(SubDEdgeSharpness)
 Gets the number of sharp edges in this SubD, and the range of sharpness values used.
Subdivide()
 Apply the Catmull-Clark subdivision algorithm and save the results in this SubD.
Subdivide(IEnumerable<Int32>)
 Apply the Catmull-Clark subdivision algorithm and save the results in this SubD.
Subdivide(Int32)
 Apply the Catmull-Clark subdivision algorithm and save the results in this SubD.
SurfaceMeshCacheExists
 Checks that a surface mesh evaluation cache exists, and that it has the required options. This cache is used by - SurfacePoint(), - ToNurbsCurve(Boolean), and - CreateFromSubD(SubD, Int32).
ToBrep()
 Create a Brep based on this SubD geometry, based on SubDToBrepOptions.Default options.
ToBrep(SubDToBrepOptions)
 Create a Brep based on this SubD geometry.
TransformComponents
 Transforms an enumerable of SubD components.
UpdateAllTagsAndSectorCoefficients
 Updates vertex tag, edge tag, and edge coefficient values on the active level. After completing custom editing operations that modify the topology of the SubD control net or changing values of vertex or edge tags, the tag and sector coefficients information on nearby components in the edited areas need to be updated.
UpdateSurfaceMeshCache
 Updates limit surface information returned by - SurfacePoint(), - ToNurbsCurve(Boolean), and - CreateFromSubD(SubD, Int32). The density of the mesh cache is Default().
Top
See Also
Reference
Rhino.Geometry Namespace