RhinoCommon API
ViewportType Enumeration
[Missing <summary> documentation for "T:Rhino.Display.ViewportType"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum ViewportType
Public Enumeration ViewportType
Members
Member name | Value | Description
StandardModelingViewport | 0
PageViewMainViewport | 1
DetailViewport | 2
UVEditorViewport | 3
BlockEditorViewport | 4
See Also
Reference
Rhino.Display Namespace