RhinoCommon API
RenderContentType Class
 Represents one of the render content types registered with Rhino.
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderContentType
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderContentType : IDisposable
Public Class RenderContentType
	Implements IDisposable
The RenderContentType type exposes the following members.
Constructors
Name | Description
RenderContentType
Initializes a new instance of the RenderContentType class
Top
Properties
Name | Description
Id
 Returns the type identifier associated with this type.
InternalName
 Returns the internal name identifier associated with this type.
PlugInId
RenderEngineId
Top
Methods
Name | Description
Dispose()
Releases all resources used by the RenderContentType
Dispose(Boolean)
Releases the unmanaged resources used by the RenderContentType and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
GetAllAvailableTypes
 Gets an array of all available render content types registered with Rhino.
NewContentFromTypeId(Guid)
 Create a new content specified by the Guid. This function can be used to create temporary content, as it calls ::RhRdkContentFactories().NewContentFromType().
NewContentFromTypeId(Guid, RhinoDoc)
NewRenderContent
 Returns a new instance of the render content of this type. This content can be added to a persistent list.
Top
See Also
Reference
Rhino.Render Namespace