RhinoCommon API
ThumbnailViewModelFactory Class
Note: This API is now obsolete.
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.ThumbnailViewModelFactory"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.FactoryBase
 Rhino.UI.Controls.InternalRdkViewModelFactory
 Rhino.UI.Controls.ThumbnailUI.ThumbnailViewModelFactory
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("ThumbnailViewModelFactory is obsolete", false)]
public class ThumbnailViewModelFactory : InternalRdkViewModelFactory
<ObsoleteAttribute("ThumbnailViewModelFactory is obsolete", false)>
Public Class ThumbnailViewModelFactory
	Inherits InternalRdkViewModelFactory
The ThumbnailViewModelFactory type exposes the following members.
Constructors
Name | Description
ThumbnailViewModelFactory
Initializes a new instance of the ThumbnailViewModelFactory class
Top
Methods
Name | Description
Get |  (Overrides FactoryBase.Get(Guid).)
Top
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace