RhinoCommon API
MouseSelectMode Enumeration
 Defines enumerated constant values to indicate a particular window selection mode.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum MouseSelectMode
Public Enumeration MouseSelectMode
Members
Member name | Value | Description
Crossing | 0 | Anything that crosses this window will be selected.
Window | 1 | Anything that is inside this window will be selected.
Combo | 2 | Drag a rectangle from left to right for window select. Drag a rectangle from right to left for crossing select.
See Also
Reference
Rhino.ApplicationSettings Namespace