RhinoCommon API
FileAmfWriteOptions Class
 Options for writing a amf file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileAmfWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileAmfWriteOptions
Public Class FileAmfWriteOptions
The FileAmfWriteOptions type exposes the following members.
Constructors
Name | Description
FileAmfWriteOptions
Initializes a new instance of the FileAmfWriteOptions class
Top
Properties
Name | Description
MeshingParameters
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace