RhinoCommon API
UserInterfaceTextBox Class
 A single line text box. Click it to give it keyboard focus, then type. The characters go into the box instead of to the command line for as long as it has focus; Enter commits what was typed, Escape puts back the text the box started with, and both give the focus back to the viewport.
Inheritance Hierarchy
System.Object
 Rhino.UI.UserInterfaceObjectBase
 Rhino.UI.UserInterfaceControl
 Rhino.UI.UserInterfaceTextBox
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class UserInterfaceTextBox : UserInterfaceControl
Public Class UserInterfaceTextBox
	Inherits UserInterfaceControl
The UserInterfaceTextBox type exposes the following members.
Constructors
Name | Description
UserInterfaceTextBox()
Initializes a new instance of the UserInterfaceTextBox class
UserInterfaceTextBox(String)
Initializes a new instance of the UserInterfaceTextBox class
Top
Properties
Name | Description
BorderColor
 Color of the outline around the box. Color.Empty, the default, means use the standard color for the theme that is in use. The outline is drawn thicker and brighter while the box has keyboard focus, whatever color it is given.
CaretPosition
 Where the insertion point sits, as a count of characters from the start of the text. Setting it clamps to the length of the text.
MaximumLength
 Most characters the text will hold. 0, the default, means no limit.
PlaceholderText
 Text drawn, dimmed, when the box is empty and does not have focus
ReadOnly
 A read only text box can take focus and be scrolled through, but typing does not change it. False by default.
Text
 What the box holds. Unlike the other controls, this is something the user changes, so reading it asks the box itself what is in it.
 (Overrides UserInterfaceControl.Text.)
Top
Methods
Name | Description
OnEditCanceled
 Called when Escape is pressed. The text has already been put back to what it was when the box took focus. The default implementation raises the EditCanceled event.
OnKeyboardFocusChanged
 Called when the box gains or loses keyboard focus. Read HasKeyboardFocus to find out which. The default implementation raises the KeyboardFocusChanged event.
OnTextChanged
 Called every time the text changes, once per keystroke. The default implementation raises the TextChanged event.
OnTextCommitted
 Called when Enter is pressed, and when the box loses focus with the text changed from what it started with. This is where you do something about the new text. The default implementation raises the TextCommitted event.
TakeKeyboardFocus
 Give this text box keyboard focus, as clicking it does
Top
Events
Name | Description
EditCanceled
 Event triggered when Escape puts back the text the box started with
KeyboardFocusChanged
 Event triggered when the box gains or loses keyboard focus
TextChanged
 Event triggered every time the text changes, once per keystroke
TextCommitted
 Event triggered when what was typed is committed, by Enter or by the box losing focus with the text changed
Top
See Also
Reference
Rhino.UI Namespace