RhinoCommon API
Utilities Class
[Missing <summary> documentation for "T:Rhino.Render.Utilities"]
Inheritance Hierarchy
System.Object
 Rhino.Render.Utilities
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class Utilities
Public NotInheritable Class Utilities
The Utilities type exposes the following members.
Properties
Name | Description
DefaultRenderPlugInId
 Get the plug-in Id for the default render plug-in
ShowIncompatibleEnvironments
 Specifies whether incompatible content should be shown in the corresponding editor.
ShowIncompatibleMaterials
 Specifies whether incompatible content should be shown in the corresponding editor.
ShowIncompatibleTextures
 Specifies whether incompatible content should be shown in the corresponding editor.
Top
Methods
Name | Description
ChangeContentType
 Changes the type of a content. This deletes the content and creates a replacement of the specified type allowing the caller to decide about harvesting.
ExpandEnvVarsInFileName
FindFile(RhinoDoc, String)
 Finds a file and also handles network shares.
Remarks
This is a replacement for CRhinoFileUtilities::FindFile().
FindFile(RhinoDoc, String, Boolean)
 Finds a file and also handles network shares.
Remarks
This is a replacement for CRhinoFileUtilities::FindFile().
GetUnpackedFilesCacheFolder
 Gets a folder associated with the document for unpacking textures to
IsCachedTextureFileInUse
 Determines if any texture in any persistent content list is using the specified file name for caching.
LoadPersistentRenderContentFromFile
 Loads a content from a library file and adds it to the persistent content list of a particular document.
MoveWindow
PromptForSaveImageFileParameters
 Prompts the user for a save file name and the width, height and depth of an image to be saved.
SafeFrameEnabled
 Queries whether or not the Safe Frame is visible.
SetDefaultRenderPlugIn
 Set default render application
ShowContentChooser(Guid, Guid, RenderContentKind, Guid, RenderContent.ShowContentChooserFlags, RhinoDoc) |  Obsolete.
 Shows the Content New / Existing Browser to allow the user to select a new or existing content.
ShowContentChooser(RhinoDoc, Guid, Guid, RenderContentKind, RenderContent.ShowContentChooserFlags, String, IEnumerable<String>, IEnumerable<Guid>, Guid[]) |  Obsolete.
 Shows the Content New / Existing Browser to allow the user to select a new or existing content.
ShowContentChooser(RhinoDoc, Guid, Guid, RenderContentKind, Utilities.ContentChooserFlags, String, IEnumerable<String>, IEnumerable<Guid>, Guid[]) |  Obsolete.
 Shows the Content New / Existing Browser to allow the user to select a new or existing content, or multiple contents.
ShowContentNewExistingBrowser
 Shows the Content New / Existing Browser to allow the user to select a new or existing content, or multiple contents.
ShowIORMenu
 Display and track the context menu.
Top
See Also
Reference
Rhino.Render Namespace