RhinoCommon API
SubDChainType Enumeration
 SubD::ChainType specifies what edge and vertex tag tests are used when creating edge chains.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SubDChainType
Public Enumeration SubDChainType
Members
Member name | Value | Description
Unset | 0 |  Unset.
MixedTag | 1 |  All types of edges and vertices can be in the chain.
EqualEdgeTag | 2 |  Every edge in an edge chain has the same smooth/crease property.
EqualEdgeAndVertexTag | 3 |  Every edge in an edge chain has the same smooth/crease edge tag and interior vertices have the corresponding smooth/crease vertex tag.
EqualEdgeTagAndOrdinary | 4 |  Every edge in an edge chain has the same smooth/crease property and every edge has the same number of faces. If the edges have 1 face, then interior vertices have valence = 3. If the edges have 2 faces, then interior vertices have valence = 4.
EqualEdgeAndVertexTagAndOrdinary | 5 |  Every edge in an edge chain has the same smooth/crease edge tag, every edge has the same number of faces, and interior vertices have the corresponding smooth/crease vertex tag. If the edges have 1 face, then interior vertices have valence = 3. If the edges have 2 faces, then interior vertices have valence = 4.
See Also
Reference
Rhino.Geometry Namespace