RhinoCommon API
DisplayPipelineAttributes.GroundPlaneUsages Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.GroundPlaneUsages"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public enum GroundPlaneUsages
Public Enumeration GroundPlaneUsages
Members
Member name | Value | Description
ByDocument | 0
Custom | 1
See Also
Reference
Rhino.Display Namespace