RhinoCommon API
InstanceReferenceGeometry Class
 Represents a reference to the geometry in a block definition.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.InstanceReferenceGeometry
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class InstanceReferenceGeometry : GeometryBase
<SerializableAttribute>
Public Class InstanceReferenceGeometry
	Inherits GeometryBase
The InstanceReferenceGeometry type exposes the following members.
Constructors
Name | Description
InstanceReferenceGeometry(Guid, Transform)
 Constructor used when creating nested instance references.
InstanceReferenceGeometry(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
ParentIdefId
 The unique id for the parent instance definition of this instance reference.
Xform
Transformation for this reference.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace