RhinoCommon API
HiddenLineDrawingPoint.Visibility Enumeration
 The different types of HiddenLineObjectPoint visibility
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public enum Visibility
Public Enumeration Visibility
Members
Member name | Value | Description
Unset | 0 |  Unset value
Visible | 1 |  Visible
Hidden | 2 |  Hidden
Duplicate | 3 |  Duplicate
See Also
Reference
Rhino.Geometry Namespace