RhinoCommon API
SurfaceObject Class
 Represents a surface in a document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.SurfaceObject
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SurfaceObject : RhinoObject
Public Class SurfaceObject
	Inherits RhinoObject
The SurfaceObject type exposes the following members.
Properties
Name | Description
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
SurfaceGeometry
 Gets the surface geometry linked with this object.
Top
Methods
Name | Description
DuplicateSurfaceGeometry
 Constructs a new deep copy of the surface geometry.
Top
See Also
Reference
Rhino.DocObjects Namespace