RhinoCommon API
FilePdfEventArgs Class
 Used for events that are fired while constructing/saving a PDF
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.FileIO.FilePdfEventArgs
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FilePdfEventArgs : EventArgs
Public Class FilePdfEventArgs
	Inherits EventArgs
The FilePdfEventArgs type exposes the following members.
Properties
Name | Description
Pdf
 The document that is about to be written
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace