RhinoCommon API
SimulatedTexture.ProjectionModes Enumeration
[Missing <summary> documentation for "T:Rhino.Render.SimulatedTexture.ProjectionModes"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public enum ProjectionModes
Public Enumeration ProjectionModes
Members
Member name | Value | Description
MappingChannel | 0
View | 1
Wcs | 2
Emap | 3
WcsBox | 4
Screen | 5
See Also
Reference
Rhino.Render Namespace