RhinoCommon API
InitFrameBufferEventArgs Class
[Missing <summary> documentation for "T:Rhino.Display.InitFrameBufferEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.InitFrameBufferEventArgs
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class InitFrameBufferEventArgs : EventArgs
Public Class InitFrameBufferEventArgs
	Inherits EventArgs
The InitFrameBufferEventArgs type exposes the following members.
Methods
Name | Description
SetFill(Color)
SetFill(Color, Color)
SetFill(Color, Color, Color, Color)
Top
See Also
Reference
Rhino.Display Namespace