RhinoCommon API
RhinoPlotWidthType Enumeration
 Supported plot width special types
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RhinoPlotWidthType
Public Enumeration RhinoPlotWidthType
Members
Member name | Value | Description
ByLayer | 0 |  Plot width from layer
ByParent | 1 |  Plot width from parent object
Hairline | 2 |  System hairline plot width
Default | 3 |  Use default plot width
None | 4 |  Don't print
Varies | 5 |  Multiple objects selected with different types/widths
Width | 6 |  Standard or custom width
See Also
Reference
Rhino.UI Namespace