RhinoCommon API
CustomRenderSaveFileTypes.SaveFileHandler Delegate
 Called when a user chooses to save a rendered scene as this custom file type.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate bool SaveFileHandler(
	string fileName,
	bool includeAlpha,
	RenderWindow renderWindow
)
Public Delegate Function SaveFileHandler (
	fileName As String,
	includeAlpha As Boolean,
	renderWindow As RenderWindow
) As Boolean
Parameters
fileName
Type: System.String
 Name of the file to write.
includeAlpha
Type: System.Boolean
 Only meaningful if the custom file type optionally supports alpha channel.
renderWindow
Type: Rhino.Render.RenderWindow
 The RenderWindow to save.
Return Value
Type: Boolean
 Return true if the file was written successfully otherwise return false.
See Also
Reference
Rhino.PlugIns Namespace