RhinoCommon API
DisplayPipelineAttributes.LightingSchema Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.LightingSchema"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.4
Syntax
public enum LightingSchema
Public Enumeration LightingSchema
Members
Member name | Value | Description
None | 0
DefaultLighting | 1
SceneLighting | 2
CustomLighting | 3
AmbientOcclusion | 4
See Also
Reference
Rhino.Display Namespace