RhinoCommon API
MeshCageMorph Class
 Morph used by MeshCageMorph command
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SpaceMorph
 Rhino.Geometry.Morphs.MeshCageMorph
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MeshCageMorph : SpaceMorph,
	IDisposable
Public Class MeshCageMorph
	Inherits SpaceMorph
	Implements IDisposable
The MeshCageMorph type exposes the following members.
Constructors
Name | Description
MeshCageMorph
Constructs a mesh cage morph
Top
Properties
Name | Description
IsValid
Returns true if the space morph definition is valid, false otherwise.
Top
Methods
Name | Description
Dispose()
Actively reclaims unmanaged resources that this instance uses
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
MorphPoint
Morphs an Euclidean point.
 (Overrides SpaceMorph.MorphPoint(Point3d).)
Top
See Also
Reference
Rhino.Geometry.Morphs Namespace