RhinoCommon API
SubDFromSurfaceMethods Enumeration
 ON_SubDFromSurfaceParameters::Method are ways to create a SubD from a surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SubDFromSurfaceMethods
Public Enumeration SubDFromSurfaceMethods
Members
Member name | Value | Description
Unset | 0 |  Used to indicate the method is not set.
SubDFriendlyFit | 1 |  The surface is approximated with a SubD friendly NURBS surface and the SubD is created to match the subd friendly nurbs surface. If the input surface is a subd friendly NURBS surface, the subd and surface have the same geometry.
FromNurbsControlNet | 2 |  The surface is converted to a NURBS surface and then a subd with one face per NURBS bispan is created by using an appropriate subset of the NURBS surface control net. If the input surface is a subd friendly NURBS surface, the subd and surface have the same geometry.
See Also
Reference
Rhino.Geometry Namespace