RhinoCommon API
CurveSimplifyOptions Enumeration
 Enumerates the options to use when simplifying a curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[FlagsAttribute]
public enum CurveSimplifyOptions
<FlagsAttribute>
Public Enumeration CurveSimplifyOptions
Members
Member name | Value | Description
None | 0 |  No option is specified.
SplitAtFullyMultipleKnots | 1 |  Split NurbsCurves at fully multiple knots. Effectively turning single NURBS segments with kinks into multiple segments.
RebuildLines | 2 |  Replace linear segments with LineCurves.
RebuildArcs | 4 |  Replace partially circular segments with ArcCurves.
RebuildRationals | 8 |  Replace rational NURBS curve with constant weights with an equivalent non-rational NurbsCurve.
AdjustG1 | 16 |  Adjust segments that are G1 to each other. Segments might only be G1 within tolerance. This can affect downstream operations, such as offsetting. So, if G1 within tolerance, adjust segments so to be exactly G1.
Merge | 32 |  Merge adjacent co-linear lines or co-circular arcs or combine consecutive line segments into a polyline.
All | 63 |  Implies all of the simplification functions will be used.
See Also
Reference
Rhino.Geometry Namespace