RhinoCommon API
SimulatedTexture Class
[Missing <summary> documentation for "T:Rhino.Render.SimulatedTexture"]
Inheritance Hierarchy
System.Object
 Rhino.Render.SimulatedTexture
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimulatedTexture : IDisposable
Public Class SimulatedTexture
	Implements IDisposable
The SimulatedTexture type exposes the following members.
Constructors
Name | Description
SimulatedTexture() |  Obsolete.
Initializes a new instance of the SimulatedTexture class
SimulatedTexture(RhinoDoc)
Initializes a new instance of the SimulatedTexture class
SimulatedTexture(Texture) |  Obsolete.
Initializes a new instance of the SimulatedTexture class
SimulatedTexture(RhinoDoc, Texture)
Initializes a new instance of the SimulatedTexture class
Top
Properties
Name | Description
BitmapSize
Filename
Filtered
HasTransparentColor
LocalMappingTransform
MappingChannel
Offset
OriginalFilename
ProjectionMode
Repeat
Repeating
Rotation
TransparentColor
TransparentColorSensitivity
Top
Methods
Name | Description
ConstPointer
Dispose()
Releases all resources used by the SimulatedTexture
Dispose(Boolean)
Releases the unmanaged resources used by the SimulatedTexture and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
MetersToUnits(Double) |  Obsolete.
MetersToUnits(RhinoDoc, Double)
SetMappingChannelAndProjectionMode
Texture
UnitsToMeters(Double) |  Obsolete.
UnitsToMeters(RhinoDoc, Double)
Top
See Also
Reference
Rhino.Render Namespace