RhinoCommon API
DirectionAnalysisSettings Class
 Contains static methods and properties to modify the visibility of edges in edge-related commands.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.DirectionAnalysisSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class DirectionAnalysisSettings
Public NotInheritable Class DirectionAnalysisSettings
The DirectionAnalysisSettings type exposes the following members.
Properties
Name | Description
Color
Gets or sets a color used to show curve or surface direction.
Direction
 Gets or sets whether to display the direction.
U
 Gets or sets whether to display the U dir.
V
 Gets or sets whether to display the V dir.
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace