RhinoCommon API
PostEffectJobChannels Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffectJobChannels"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.PostEffectJobChannels
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PostEffectJobChannels : IDisposable
Public Class PostEffectJobChannels
	Implements IDisposable
The PostEffectJobChannels type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the PostEffectJobChannels
Finalize |  (Overrides Object.Finalize().)
GetChannel
Top
See Also
Reference
Rhino.Render.PostEffects Namespace