RhinoCommon API
StatusBar Class
 Contains static methods to control the application status bar.
Inheritance Hierarchy
System.Object
 Rhino.UI.StatusBar
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class StatusBar
Public NotInheritable Class StatusBar
The StatusBar type exposes the following members.
Methods
Name | Description
ClearMessagePane
 Removes the message from the message pane.
HideProgressMeter()
 Ends, or hides, Rhino's status bar progress meter.
HideProgressMeter(UInt32)
 Ends, or hides, Rhino's status bar progress meter.
SetDistancePane
 Sets the distance pane to a distance value.
SetMessagePane
 Sets the message pane to a message.
SetNumberPane
 Sets the number pane to a number value
SetPointPane
 Sets the point pane to a point value.
ShowProgressMeter(Int32, Int32, String, Boolean, Boolean)
 Starts, or shows, Rhino's status bar progress meter.
ShowProgressMeter(UInt32, Int32, Int32, String, Boolean, Boolean)
 Starts, or shows, Rhino's status bar progress meter.
UpdateProgressMeter(Int32, Boolean)
 Sets the current position of Rhino's status bar progress meter.
UpdateProgressMeter(String, Int32, Boolean)
 Sets the label and current position of Rhino's status bar progress meter.
UpdateProgressMeter(UInt32, Int32, Boolean)
 Sets the current position of Rhino's status bar progress meter.
UpdateProgressMeter(UInt32, String, Int32, Boolean)
 Sets the label and current position of Rhino's status bar progress meter.
Top
See Also
Reference
Rhino.UI Namespace