RhinoCommon API
Decal Class
 Represents a decal, or a picture that can be moved on an object.
Inheritance Hierarchy
System.Object
 Rhino.Render.Decal
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Decal : IDisposable
Public Class Decal
	Implements IDisposable
The Decal type exposes the following members.
Properties
Name | Description
CRC
 The decal CRC identifies a decal by its state. Multiple decals which would be exactly the same would have the same CRC and are culled from the system. If you store this value with the intention of using it to find the decal again later, you must update your stored value whenever the decal state changes. You can detect when a decal changes by watching for the legacy OnUserDataTransformed event or the newer custom event uuidEventDecalUserDataTransformed.
DecalMapping |  Obsolete.
 Gets the decal's mapping.
DecalProjection |  Obsolete.
 Gets the decal's projection. Used only when mapping is planar.
EndLatitude
 Gets the end angle of the decal's arc of latitude or 'horizontal sweep'. This is actually a LONGITUDINAL angle. Only used when mapping is cylindrical or spherical. This is deprecated in favor of HorzSweep().
EndLongitude
 Gets the end angle of the decal's arc of longitude or 'vertical sweep'. This is actually a LATITUDINAL angle. Only used when mapping is spherical.
Height
 Gets the height of the decal. Only used when mapping is cylindrical.
IsVisible
 Gets the decal's visibility.
Mapping
 Gets the decal's mapping.
MapToInside
 Used only when mapping is cylindrical or spherical.
Origin
 Gets the origin of the decal in world space.
Projection
 Gets the decal's projection. Used only when mapping is planar.
Radius
 Gets the radius of the decal. Only used when mapping is cylindrical or spherical.
StartLatitude
 Gets the start angle of the decal's arc of latitude or 'horizontal sweep'. This is actually a LONGITUDINAL angle. Only used when mapping is cylindrical or spherical.
StartLongitude
 Gets the start angle of the decal's arc of longitude or 'vertical sweep'. This is actually a LATITUDINAL angle. Only used when mapping is spherical.
TextureInstanceId
 Gets the asset instance id for this decal. This is the instance id of a material or texture.
Transparency
 Gets the decal's transparency in the range 0 to 1.
VectorAcross
 Gets the vector across. For cylindrical and spherical mapping, the vector is unitized.
VectorUp
 For cylindrical and spherical mapping, the vector is unitized.
Top
Methods
Name | Description
ConstPointer
Create
CustomData()
 Gets decal custom data for the current renderer. See Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
CustomData(Guid)
 Gets decal custom data for a specified renderer. See Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
Dispose()
Releases all resources used by the Decal
Dispose(Boolean)
Releases the unmanaged resources used by the Decal and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
GetTextureMapping
 Gets the Texture Mapping of the decal.
GetUVBounds
 The UV bounds of the decal. Only used when mapping is UV.
HorzSweep
 Gets the angles of the decal's arc of 'horizontal sweep'. Replaces StartLatitude and EndLatitude.
NonConstPointer
SetHorzSweep
 Sets the angles of the decal's arc of 'horizontal sweep'.
SetUVBounds
 Sets the UV bounds of the decal. Only used when mapping is UV.
SetVertSweep
 Sets the angles of the decal's arc of 'vertical sweep'.
TextureRenderCRC(TextureRenderHashFlags) |  Obsolete.
 This method is deprecated in favor of TextureRenderHash below.
TextureRenderCRC(TextureRenderHashFlags, LinearWorkflow) |  Obsolete.
 This method is deprecated in favor of TextureRenderHash below.
TextureRenderHash(CrcRenderHashFlags) |  Obsolete.
 Get the texture render hash for the referenced texture using the specified CrcRenderHashFlags.
TextureRenderHash(CrcRenderHashFlags, LinearWorkflow) |  Obsolete.
 Get the texture render hash for the referenced texture using the specified CrcRenderHashFlags and linear workflow.
TryGetColor
 Blend a color with the decal color at a given point. Please note that this function is very slow so you should only use it if you're not overly concerned about performance. Also please note that this function is actually a 'blend' operation, not a true 'get' operation and is sensitive to the value passed into the colInOut parameter. The alpha value of colInOut is used as the blend amount where 0 means 'all decal RGB' and 1 means 'all colInOut RGB'. If you want to simply GET the decal color, you must pass 0 for colInOut alpha.
UVBounds
 The UV bounds of the decal. Only used when mapping is UV.
VertSweep
 Gets the angles of the decal's arc of 'vertical sweep'. Replaces StartLongitude and EndLongitude.
Top
See Also
Reference
Rhino.Render Namespace