RhinoCommon API
RuntimeEnvironment Enumeration
 ON::RuntimeEnvironment identifies a runtime environment (operating system). This value is saved in binary archives so appropriate adjustments to resources provided by runtime environments, like fonts, can be made when an archive created in one runtime environment is used in another.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RuntimeEnvironment
Public Enumeration RuntimeEnvironment
Members
Member name | Value | Description
Unset | 0 |  ON::RuntimeEnvironment::Unset indicates no runtime is set.
None | 1 |  ON::RuntimeEnvironment::None indicates no runtime. This is a different condition from ON::Runtime::Unset.
Windows | 2 |  ON::RuntimeEnvironment::Windows indicates some version of Microsoft Windows.
Apple | 3 |  ON::RuntimeEnvironment::Apple indicates some version of Apple OS X or iOS.
Android | 4 |  ON::RuntimeEnvironment::Android indicates some version of Google Android.
Linux | 5 |  ON::RuntimeEnvironment::Linux indicates some version of Linux.
WebAssembly | 6 |  ON::RuntimeEnvironment::WebAssembly indicates some version of WASM / WebAssembly.
See Also
Reference
Rhino Namespace