RhinoCommon API
CustomRenderContentAttribute Class
 Attributes for RenderContent
Inheritance Hierarchy
System.Object
 System.Attribute
 Rhino.Render.CustomRenderContentAttribute
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class CustomRenderContentAttribute : Attribute
Public NotInheritable Class CustomRenderContentAttribute
	Inherits Attribute
The CustomRenderContentAttribute type exposes the following members.
Constructors
Name | Description
CustomRenderContentAttribute(String, Boolean, String, Boolean, Boolean, Boolean)
Initializes a new instance of the CustomRenderContentAttribute class
CustomRenderContentAttribute(String, Boolean, String, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
Initializes a new instance of the CustomRenderContentAttribute class
Top
Properties
Name | Description
Category
ImageBased
IsBuiltIn
IsElevated
IsHdrCapable
IsLinear
IsNormalMap
IsPrivate
RenderEngineId
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace