RhinoCommon API
ConvertibleExtensions Class
 Extension methods for IConvertible that work when an object is a Variant.
Inheritance Hierarchy
System.Object
 Rhino.Render.ConvertibleExtensions
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class ConvertibleExtensions
<ExtensionAttribute>
Public NotInheritable Class ConvertibleExtensions
The ConvertibleExtensions type exposes the following members.
Methods
Name | Description
ToColor4f
ToVector2d
ToVector3d
Top
See Also
Reference
Rhino.Render Namespace