RhinoCommon API
DimensionStyle.TextFit Enumeration
 Text display position inside or outside extension lines
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextFit
Public Enumeration TextFit
Members
Member name | Value | Description
Auto | 0 |  Auto - Display inside when space permits
TextInside | 1 |  Force text inside extensions
TextRight | 2 |  Force text outside to the right of extensions
TextLeft | 3 |  Force text outside to the left of extensions
TextHintRight | 4 |  Move text outside to the right of extensions when it won't fit inside
TextHintLeft | 5 |  Move text outside to the left of extensions when it won't fit inside
See Also
Reference
Rhino.DocObjects Namespace