RhinoCommon API
FileUsd Class
 Support for writing USD file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileUsd
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileUsd
Public NotInheritable Class FileUsd
The FileUsd type exposes the following members.
Methods
Name | Description
Write
Write a USD file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace