RhinoCommon API
SubDComponent Class
 A part of SubD geometry. Common base class for vertices, faces, and edges
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDComponent
 Rhino.Geometry.SubDEdge
 Rhino.Geometry.SubDFace
 Rhino.Geometry.SubDVertex
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class SubDComponent : IEquatable<SubDComponent>
Public MustInherit Class SubDComponent
	Implements IEquatable(Of SubDComponent)
The SubDComponent type exposes the following members.
Properties
Name | Description
ComponentDirection
 True when this component is referenced with the reverse of its natural orientation. This is always false for vertices, and for edges and faces obtained directly from the parent SubD; it is only set on components reached through an oriented reference, such as the face on a given side of an oriented edge.
Id
 Unique id within the parent SubD for this item
IsDamaged
 Returns true if the SubD component is damaged.
IsDeleted
 Returns true if the SubD component is deleted.
IsHidden
 Returns true if the SubD component is hidden.
IsHighlighted
 Returns true if the SubD component is highlighted.
IsLocked
 Returns true if the SubD component is locked.
IsSelected
 Returns true if the SubD component is selected.
ParentSubD
 SubD that this component belongs to
Top
Methods
Name | Description
Equals(Object)
 Determines whether an object is a SubDComponent referring to the same component, with the same orientation, in the same SubD.
 (Overrides Object.Equals(Object).)
Equals(SubDComponent)
 Determines whether this component and another refer to the same component, with the same orientation, in the same SubD.
GetHashCode
 Gets a hash code for this component.
 (Overrides Object.GetHashCode().)
ReverseComponentDirection
 Flips ComponentDirection and returns this component, so it can be used inline where an oppositely oriented reference is wanted.
ToString
 Returns a string of the form "SubDEdge(+12)", naming the component type, the orientation it is referenced with, and its id.
 (Overrides Object.ToString().)
Top
Operators
Name | Description
Equality
 Determines whether two components refer to the same component, with the same orientation, in the same SubD.
Inequality
 Determines whether two components refer to different components, orientations, or SubDs.
Top
See Also
Reference
Rhino.Geometry Namespace