RhinoCommon API
CreaseEdges Enumeration
 Defines the way naked edges are handled.
 Namespace: Rhino.Geometry.MeshRefinements
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public enum CreaseEdges
Public Enumeration CreaseEdges
Members
Member name | Value | Description
NakedFixed | 0 |  Naked edges will not move or be modified.
NakedSmooth | 1 |  The naked edge will tend toward a spline.
CornerFixedOtherCreased | 2 |  Corners (2-sided vertices) will be fixed, while other naked vertices will tend toward a spline.
Auto | 3 |  Unwelded vertices become creases, and welded are smooth.
See Also
Reference
Rhino.Geometry.MeshRefinements Namespace