RhinoCommon API
DimensionStyle.ArrowFit Enumeration
 Arrow display position inside or outside extension lines
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ArrowFit
Public Enumeration ArrowFit
Members
Member name | Value | Description
Auto | 0 |  Auto - Display when space permits
ArrowsInside | 1 |  Force arrows inside extensions
ArrowsOutside | 2 |  Force arrows outside extensions
See Also
Reference
Rhino.DocObjects Namespace