RhinoCommon API
MeshDisplacementInfo Class
 Contains mesh displacement information.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.MeshDisplacementInfo
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MeshDisplacementInfo
Public Class MeshDisplacementInfo
The MeshDisplacementInfo type exposes the following members.
Constructors
Name | Description
MeshDisplacementInfo
 Constructs a displacement information instance with default values. Users of this class should not rely on default values to stay constant across service releases.
Top
Properties
Name | Description
Black
 Value considered lowest point in the displacement.
BlackMove
 The amount of displacement for the black color in the texture.
ChannelNumber
 Mapping channel number for the displacement mapping.
FaceLimit
 Runs a mesh reduction as a post process o simplify the result of displacement to meet the specified number of faces.
FairingAmount
 Straightens rough feature edges. The value specifies the number of passes.
InstanceTransform
 Instance transformation of the mesh.
Mapping
 The texture mapping of the mesh.
MappingTransform
 Texture mapping transform.
MemoryLimit
 Specifies how much memory can be allocated for use by the displacement mesh. Value in megabytes.
PostWeldAngle
 Specifies the maximum angle between face normals of adjacent faces that will get welded together.
RefineSensitivity
Specifies how sensitive the divider for contrasts is on the displacement texture.
Specify 1 to split all mesh edges on each refine step.
Specify 0.99 to make even slight contrasts on the displacement texture cause edges to be split.
Specifying 0.01 only splits edges where heavy contrast exists.
RefineStepCount
 Specifies the number of refinement passes.
SweepPitch
 Specifies how densely the object is initially subdivided. The lower the value, the higher the resolution of the displaced mesh.
Texture
 The texture used as displacement.
White
 Value considered highest point of the displacement texture.
WhiteMove
 The amount of displacement for the white color in the texture.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace