RhinoCommon API
PersistentSettingsEventArgs<T> Class
 Represents the persistent settings modification event arguments.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.PersistentSettingsEventArgs
 Rhino.PersistentSettingsEventArgs<T>
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PersistentSettingsEventArgs<T> : PersistentSettingsEventArgs
Public Class PersistentSettingsEventArgs(Of T)
	Inherits PersistentSettingsEventArgs
Type Parameters
T
The type of the current and new setting that is being modified.
The PersistentSettingsEventArgs<T> type exposes the following members.
Constructors
Name | Description
PersistentSettingsEventArgs<T>
Initializes a new instance of the PersistentSettingsEventArgs<T> class
Top
Properties
Name | Description
CurrentValue
NewValue
Top
Methods
Name | Description
Top
See Also
Reference
Rhino Namespace