RhinoCommon API
PaintColor Enumeration
 Contains enumerated constant values to represent logical colors associated with elements of the user interface.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum PaintColor
Public Enumeration PaintColor
Members
Member name | Value | Description
NormalStart | 0 | Gradient start for active toolbar tab and non-client area of Rhino.
NormalEnd | 1 | Gradient end for active toolbar tab and non-client area of Rhino.
NormalBorder | 2 | Edge color used for grippers, toolbar border, resize bars, status bar pane borders.
HotStart | 3 | Gradient start for inactive toolbar tab.
HotEnd | 4 | Gradient end for inactive toolbar tab.
HotBorder | 5 | Inactive toolbar tab border.
PressedStart | 6 | Pressed gradient start.
PressedEnd | 7 | Pressed gradient end.
PressedBorder | 8 | Pressed border.
TextEnabled | 9 | Toolbar tab text and status bar text.
TextDisabled | 10 | Disabled text color.
MouseOverControlStart | 11 | Color for hovering gradient start.
MouseOverControlEnd | 12 | Color for hovering gradient end.
MouseOverControlBorder | 13 | Color for hovering border.
ActiveCaption | 14 | Active floating window non-client area
InactiveCaption | 15 | Inactive floating window non-client area
PanelBackground | 16 | Background color of panels
ActiveViewportTitle | 17 | Active viewport title.
InactiveViewportTitle | 18 | Inactive viewport title.
ModifiedValueControlColor | 19 | Modified property value label text color
EditBoxBackground | 20 | Background fill for input elements (edit box, checkbox)
GridLinesOnPanelBackground | 21 | Grid lines on panel background color
GridLinesOnEditBoxBackground | 22 | Grid lines on edit box background color
InactiveTabBackground | 23 | Fill for inactive tabs
See Also
Reference
Rhino.ApplicationSettings Namespace