RhinoCommon API
ContentUndoBlocker Class
[Missing <summary> documentation for "T:Rhino.Render.ContentUndoBlocker"]
Inheritance Hierarchy
System.Object
 Rhino.Render.ContentUndoBlocker
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ContentUndoBlocker : IDisposable
Public Class ContentUndoBlocker
	Implements IDisposable
The ContentUndoBlocker type exposes the following members.
Constructors
Name | Description
ContentUndoBlocker
 Constructs a ContentUndoBlocker object inside a using block to block undo when modifying a RenderContent while a ContentUndoHelper is active. Alternatively - create the ContentUndoBlocker and explicitly call Dispose when you are done.
Top
Methods
Name | Description
Dispose()
Releases all resources used by the ContentUndoBlocker
Dispose(Boolean)
Releases the unmanaged resources used by the ContentUndoBlocker and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render Namespace