RhinoCommon API
LocalizeStringPair Class
Pair of strings used for localization.
Inheritance Hierarchy
System.Object
 Rhino.UI.LocalizeStringPair
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class LocalizeStringPair
Public NotInheritable Class LocalizeStringPair
The LocalizeStringPair type exposes the following members.
Constructors
Name | Description
LocalizeStringPair
Initializes a new instance of the LocalizeStringPair class
Top
Properties
Name | Description
English
Local
Top
Methods
Name | Description
ToString |  (Overrides Object.ToString().)
Top
Operators
Name | Description
Implicit(LocalizeStringPair to String)
Top
See Also
Reference
Rhino.UI Namespace