RhinoCommon API
File3dmNamedConstructionPlanes Class
 Provides access to named construction planes in the 3dm file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmNamedConstructionPlanes
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmNamedConstructionPlanes : IList<ConstructionPlane>,
	ICollection<ConstructionPlane>, IEnumerable<ConstructionPlane>, IEnumerable
Public Class File3dmNamedConstructionPlanes
	Implements IList(Of ConstructionPlane), ICollection(Of ConstructionPlane),
	IEnumerable(Of ConstructionPlane), IEnumerable
The File3dmNamedConstructionPlanes type exposes the following members.
Properties
Name | Description
Count
 Number of named construction planes in the table.
Item
 Gets the named construction plane at an index.
Top
Methods
Name | Description
Add(ConstructionPlane)
 Adds a named construction plane to the table.
Add(String, Plane)
 Adds a named construction plane to the table.
Clear
 Removes all named construction planes from the table.
Contains
 Returns an indication of the presence of a named construction plane in the table.
CopyTo
 Copies the content of the table to an array.
Delete(ConstructionPlane)
 Deletes a named construction plane from the table.
Delete(Int32)
 Remove a named construction plane from the table.
FindName
 Finds a named construction plane given its name.
GetEnumerator
 Gets an enumerator that yields all construction planes in this collection.
IndexOf
 Returns the index of a named construction plane.
Top
See Also
Reference
Rhino.FileIO Namespace