RhinoCommon API
ExpandableContentUI Class
 This class extends ContentUI to represent the default user interface which the RDK provides for a content.This is the UI created by the default implementation of CRhRdkCoreContent::CreateUI(). The main feature of this implementation is a 'holder' containing one or more expandable 'sections' (AKA 'roll-ups').
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.ContentUI
 Rhino.UI.Controls.ExpandableContentUI
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ExpandableContentUI : ContentUI,
	IDisposable
Public Class ExpandableContentUI
	Inherits ContentUI
	Implements IDisposable
The ExpandableContentUI type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
AddSection(ICollapsibleSection)
 Add a section to the UI. Called \e before Create(). A generic controller is attached.
AddSection(ICollapsibleSection, IRdkViewModel)
 Add a section to the UI with a custom controller. Called \e before Create().
Top
Fields
Name | Description
Top
See Also
Reference
Rhino.UI.Controls Namespace