RhinoCommon API
FileImportPlugIn Class
 Rhino plug-in that imports data from other file formats into Rhino; can support more that one format.
Inheritance Hierarchy
System.Object
 Rhino.PlugIns.PlugIn
 Rhino.PlugIns.FileImportPlugIn
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class FileImportPlugIn : PlugIn
Public MustInherit Class FileImportPlugIn
	Inherits PlugIn
The FileImportPlugIn type exposes the following members.
Constructors
Name | Description
FileImportPlugIn
Initializes a new instance of the FileImportPlugIn class
Top
Properties
Name | Description
Top
Methods
Name | Description
AddFileTypes
DisplayOptionsDialog
MakeReferenceTableName(String) |  Obsolete.
MakeReferenceTableName(RhinoDoc, String)
ReadFile
Top
Events
Name | Description
Top
See Also
Reference
Rhino.PlugIns Namespace