RhinoCommon API
DisplayPipelineAttributes.SurfaceEdgeColorUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeColorUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public enum SurfaceEdgeColorUse
Public Enumeration SurfaceEdgeColorUse
Members
Member name | Value | Description
ObjectColor | 0
IsocurveColor | 1
SingleColorForAll | 2
See Also
Reference
Rhino.Display Namespace