RhinoCommon API
RuiUpdateUi.UpdateMenuItemEventHandler Delegate
Menu item update delegate
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void UpdateMenuItemEventHandler(
	Object sender,
	RuiUpdateUi cmdui
)
Public Delegate Sub UpdateMenuItemEventHandler (
	sender As Object,
	cmdui As RuiUpdateUi
)
Parameters
sender
Type: System.Object
Unused, null
cmdui
Type: Rhino.UI.RuiUpdateUi
Used to identify the menu item and modify its state
Return Value
Type:
See Also
Reference
Rhino.UI Namespace