RhinoCommon API
LayerTable.LayerType Enumeration
 Layer types created by .
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public enum LayerType
Public Enumeration LayerType
Members
Member name | Value | Description
NormalLayer | 0 |  Normal ordinary layer.
LinkedInstanceDefinitionParentLayer | 2 |  Linked instance definition "filename.3dm" parent layer of the instance definition's layer tree.
WorkSessionParentLayer | 4 |  Worksession reference model "filename.3dm" parent layer of the reference model's layer tree.
See Also
Reference
Rhino.DocObjects.Tables Namespace
LayerTable.CreateLayer(Layer, LayerTable.LayerType, UInt32, UInt32)