RhinoCommon API
LicenseIdAttribute Class
[Missing <summary> documentation for "T:Rhino.PlugIns.LicenseIdAttribute"]
Inheritance Hierarchy
System.Object
 System.Attribute
 Rhino.PlugIns.LicenseIdAttribute
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class LicenseIdAttribute : Attribute
Public NotInheritable Class LicenseIdAttribute
	Inherits Attribute
The LicenseIdAttribute type exposes the following members.
Constructors
Name | Description
LicenseIdAttribute
Initializes a new instance of the LicenseIdAttribute class
Top
Properties
Name | Description
Value
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.PlugIns Namespace