RhinoCommon API
Delegates Class
[Missing <summary> documentation for "T:Rhino.UI.Controls.Delegates"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.Delegates
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Delegates
Public Class Delegates
The Delegates type exposes the following members.
Constructors
Name | Description
Delegates
Initializes a new instance of the Delegates class
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI.Controls Namespace