RhinoCommon API
BrepRegionFaceSide Class
 Represents a side of a BrepRegion entity.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.BrepRegionFaceSide
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class BrepRegionFaceSide : CommonObject
Public Class BrepRegionFaceSide
	Inherits CommonObject
The BrepRegionFaceSide type exposes the following members.
Properties
Name | Description
Brep
 The brep this side belongs to.
Face
Gets the face this side belongs to.
Region
 The region this side belongs to.
SurfaceNormalPointsIntoRegion
 Gets true if BrepFace's surface normal points into region; false otherwise.
Top
Methods
Name | Description
NonConstOperation
 (Overrides CommonObject.NonConstOperation().)
Top
See Also
Reference
Rhino.Geometry Namespace