RhinoCommon API
FileDwgWriteOptions.ExportArcMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileDwgWriteOptions.ExportArcMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum ExportArcMode
Public Enumeration ExportArcMode
Members
Member name | Value | Description
Lines | 0
Arcs | 1
Polybulges | 2
Polylines | 3
Splines | 4
ThreeDPolylines | 5
See Also
Reference
Rhino.FileIO Namespace