RhinoCommon API
File3dmEdgeSoftening Class
 Represents the edge softening attached to file3dm object attributes.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmEdgeSoftening
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmEdgeSoftening
Public Class File3dmEdgeSoftening
The File3dmEdgeSoftening type exposes the following members.
Properties
Name | Description
Chamfer
 Specifies whether to chamfer the edges.
EdgeAngleThreshold
 Threshold angle (in degrees) which controls whether an edge is softened or not. The angle refers to the angles between the adjacent faces of an edge.
Faceted
 Specifies whether the edges are faceted.
ForceSoftening
 Specifies whether to soften edges despite too large a radius.
On
 Specifies whether edge softening is enabled or not.
Softening
 The softening radius.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace