RhinoCommon API
SelectionFilterSettings Class
 Selection filter settings restrict any selection mode (SelWindow, SelCrossing, SelAll, etc.) to specified object types. Note, selection filter settings are not persistent.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.SelectionFilterSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class SelectionFilterSettings
Public NotInheritable Class SelectionFilterSettings
The SelectionFilterSettings type exposes the following members.
Properties
Name | Description
Enabled
 Enables or disables the global object selection filter.
GlobalGeometryFilter
 The global geometry type filter controls which types of geometry will be filtered. Note, the filter can be a bitwise combination of multiple object types.
OneShotGeometryFilter
 The one-shot geometry type filter controls which types of geometry will be filtered for one selection. Note, the filter can be a bitwise combination of multiple object types.
SubObjectSelect
 Enables or disabled sub-object selection.
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
RestoreDefaults
 Commits the default settings as the current settings.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace