RhinoCommon API
FileX_TWriteOptions Class
 Options used when writing a X_T file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileX_TWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileX_TWriteOptions
Public Class FileX_TWriteOptions
The FileX_TWriteOptions type exposes the following members.
Constructors
Name | Description
FileX_TWriteOptions
Initializes a new instance of the FileX_TWriteOptions class
Top
Properties
Name | Description
Type
 Get and set the type of the x_t file being written.
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace