RhinoCommon API
PixelBuffer Class
[Missing <summary> documentation for "T:Rhino.Render.PixelBuffer"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PixelBuffer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PixelBuffer
Public Class PixelBuffer
The PixelBuffer type exposes the following members.
Constructors
Name | Description
PixelBuffer
 Create a new PixelBuffer pointing to the (unmanaged) pixel data buffer behind IntPtr
Top
Properties
Name | Description
Buffer
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace