RhinoCommon API
DisplayPipelineAttributes.SubDThicknessUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.SubDThicknessUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public enum SubDThicknessUse
Public Enumeration SubDThicknessUse
Members
Member name | Value | Description
ObjectWidth | 0
Pixels | 1
See Also
Reference
Rhino.Display Namespace