RhinoCommon API
SelCommand Class
 For adding nestable whole object and subobject selection commands, derive your command from SelCommand and override the abstract SelFilter and virtual SelSubObjectFilter functions.
Inheritance Hierarchy
System.Object
 Rhino.Commands.Command
 Rhino.Commands.SelCommand
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class SelCommand : Command
Public MustInherit Class SelCommand
	Inherits Command
The SelCommand type exposes the following members.
Constructors
Name | Description
SelCommand
Initializes a new instance of the SelCommand class
Top
Properties
Name | Description
BeQuiet
TestGrips
TestLights
Top
Methods
Name | Description
RunCommand |  (Overrides Command.RunCommand(RhinoDoc, RunMode).)
SelFilter
 Override this abstract function and return true if object should be selected.
SelSubObjectFilter
 To select subobjects, override this virtual function, add component indices of the subobjects that should get selected to indicesToSelect list and return true. This is called only if the SelFilter returns false and the whole object does not get selected.
Top
See Also
Reference
Rhino.Commands Namespace