RhinoCommon API
IntersectingMeshPair Structure
 Two meshes that intersect, as reported by MeshMeshPredicate(IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Boolean, IntersectingMeshPair[], TextLog, CancellationToken), with one face of each that intersect.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public readonly struct IntersectingMeshPair
Public Structure IntersectingMeshPair
The IntersectingMeshPair type exposes the following members.
Constructors
Name | Description
IntersectingMeshPair
 Initializes a new instance of IntersectingMeshPair.
Top
Properties
Name | Description
FaceIndexA
 The index of a face of the first mesh that intersects FaceIndexB, or -1 if it could not be determined.
FaceIndexB
 The index of a face of the second mesh that intersects FaceIndexA, or -1 if it could not be determined.
MeshIndexA
 The index of the first mesh, in meshesA.
MeshIndexB
 The index of the second mesh, in meshesB, or in meshesA when meshesB is null.
Top
Methods
Name | Description
Deconstruct
 Deconstructs this pair, so that it can be written as var (meshIndexA, meshIndexB, _, _) = pair;.
Top
See Also
Reference
Rhino.Geometry.Intersect Namespace