RhinoCommon API
PageViewGroupTableEventArgs Class
 PageViewGroupTable event arguments
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.Tables.PageViewGroupTableEventArgs
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public class PageViewGroupTableEventArgs : EventArgs
Public Class PageViewGroupTableEventArgs
	Inherits EventArgs
The PageViewGroupTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
NewState
OldState
PageViewGroupIndex
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace