RhinoCommon API
ShowMessageMode Enumeration
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageMode"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum ShowMessageMode
Public Enumeration ShowMessageMode
Members
Member name | Value | Description
ApplicationModal | 0
SystemModal | 4096
TaskModal | 8192
See Also
Reference
Rhino.UI Namespace