RhinoCommon API
UnitSystem Enumeration
 ON::LengthUnitSystem identifies a length unit system United States customary length units references: http://www.nist.gov/pml/wmd/metric/upload/frn-59-5442-1959.pdf http://en.wikipedia.org/wiki/United_States_customary_units http://en.wikipedia.org/wiki/International_yard_and_pound
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum UnitSystem
Public Enumeration UnitSystem
Members
Member name | Value | Description
None | 0 |  ON::LengthUnitSystem::None indicates no length unit system. The scale factor when converting between a specified unit system and None is always 1.0. ON::LengthUnitSystem::None is used as a unit system for models and instance definitions that should be imported or referenced with no scaling applied.
Angstroms | 12 |  1 angstroms = 1.0e-10 meters
Nanometers | 13 |  1 nanometer = 1.0e-9 meters
Microns | 1 |  1 micron = 1.0e-6 meters
Millimeters | 2 |  1 millimeter = 1.0e-3 meters
Centimeters | 3 |  1 centimeter = 1.0e-2 meters
Decimeters | 14 |  1 decimeter = 1.0e-1 meters
Meters | 4 |  SI meter length unit
Dekameters | 15 |  1 dekameter = 1.0e+1 meters
Hectometers | 16 |  1 hectometer = 1.0e+2 meters
Kilometers | 5 |  1 kilometer = 1.0e+3 meters
Megameters | 17 |  1 megameter = 1.0e+6 meters
Gigameters | 18 |  1 gigameter = 1.0e+9 meters
Microinches | 6 |  1 microinches = 2.54e-8 meters = 1.0e-6 inches
Mils | 7 |  1 mil = 2.54e-5 meters = 0.001 inches
Inches | 8 |  1 inch = 0.0254 meters = 1/12 foot
Feet | 9 |  1 foot = 0.3048 meters (12 inches)
Yards | 19 |  1 foot = 0.3048 meters = 12 inches
Miles | 10 |  1 US statute mile = 1609.344 meters = 5280 feet
PrinterPoints | 20 |  1 printer point = 1/72 inch
PrinterPicas | 21 |  1 printer pica = 1/6 inch
NauticalMiles | 22 |  1 nautical mile = 1852 meters Approximately 1 minute of arc on a terrestrial great circle. Reference: http://en.wikipedia.org/wiki/Nautical_mile
AstronomicalUnits | 23 |  1 astronomical unit = 1.4959787e+11 meters An astronomical unit (au) is the mean distance from the center of the earth to the center of the sun. References: http://en.wikipedia.org/wiki/Astronomical_unit (1.4959787e+11 meters) http://units.nist.gov/Pubs/SP811/appenB9.htm (1.495979e+11 meters)
LightYears | 24 |  1 light year = 9.4607304725808e+15 meters A light year is the distance light travels in one Julian year. The speed of light is exactly 299792458 meters/second. A Julian year is exactly 365.25 * 86400 seconds and is approximately the time it takes for one earth orbit. References: http://en.wikipedia.org/wiki/Light_year (9.4607304725808e+15 meters) http://units.nist.gov/Pubs/SP811/appenB9.htm (9.46073e+15 meters)
Parsecs | 25 |  1 parsec = 3.08567758e+16 meters References: http://en.wikipedia.org/wiki/Parsec (3.08567758e+16 meters) http://units.nist.gov/Pubs/SP811/appenB9.htm (3.085678e+16)
CustomUnits | 11 |  The name of a custom unit and the conversion to meters are saved in the ON_UnitSystem class.
Unset | 255 |  The ON::LengthUnitSystem::Unset is used to indicate no unit system is set. This is a different condition from ON::LengthUnitSystem::None.
See Also
Reference
Rhino Namespace