RhinoCommon API
CollapsibleSectionImpl.Factory Class
[Missing <summary> documentation for "T:Rhino.UI.Controls.CollapsibleSectionImpl.Factory"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.FactoryBase
 Rhino.UI.Controls.CollapsibleSectionImpl.Factory
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Factory : FactoryBase
Public Class Factory
	Inherits FactoryBase
The CollapsibleSectionImpl.Factory type exposes the following members.
Constructors
Name | Description
CollapsibleSectionImpl.Factory
Initializes a new instance of the CollapsibleSectionImpl.Factory class
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI.Controls Namespace