RhinoCommon API
CurvatureGraphSettingsState Class
 Represents a snapshot of CurvatureGraphSettings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.CurvatureGraphSettingsState
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public class CurvatureGraphSettingsState
Public Class CurvatureGraphSettingsState
The CurvatureGraphSettingsState type exposes the following members.
Properties
Name | Description
CurveHairColor
 Gets or sets the curve hair color.
HairDensity
 Gets or sets the hair density.
HairScale
 Gets or sets the hair scale.
SampleDensity
 Gets or sets the sample density.
SrfUHair
 Gets or sets the whether to show surface U hairs
SrfVHair
 Gets or sets the whether to show surface V hairs
SurfaceUHairColor
 Gets or sets the surface U hair color.
SurfaceVHairColor
 Gets or sets the surface V hair color.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace