RhinoCommon API
FileTxt Class
 Support for writing Txt (points) file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileTxt
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileTxt
Public NotInheritable Class FileTxt
The FileTxt type exposes the following members.
Methods
Name | Description
Read
Read a Txt file into a RhinoDoc
Write
Write a Txt file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace