RhinoCommon API
DraftAngleAnalysisSettings Class
[Missing <summary> documentation for "T:Rhino.ApplicationSettings.DraftAngleAnalysisSettings"]
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.DraftAngleAnalysisSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class DraftAngleAnalysisSettings
Public NotInheritable Class DraftAngleAnalysisSettings
The DraftAngleAnalysisSettings type exposes the following members.
Properties
Name | Description
AngleRange
 The angle range.
ShowIsoCurves
 Show isoparametric curves.
UpDirection
 The up direction.
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
RestoreDefaults
 Commits the default settings as the current settings.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace