RhinoCommon API
FontQuartet Class
[Missing <summary> documentation for "T:Rhino.DocObjects.FontQuartet"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.FontQuartet
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FontQuartet
Public Class FontQuartet
The FontQuartet type exposes the following members.
Constructors
Name | Description
FontQuartet
Initializes a new instance of the FontQuartet class
Top
Properties
Name | Description
HasBoldFont
HasBoldItalicFont
HasItalicFont
HasRegularFont
QuartetName
Top
Methods
Name | Description
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
Rhino.DocObjects Namespace