RhinoCommon API
FileIgsWriteOptions.MaxDegreeMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileIgsWriteOptions.MaxDegreeMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum MaxDegreeMode
Public Enumeration MaxDegreeMode
Members
Member name | Value | Description
MdNoLimit | 0
Md3 | 3
Md5 | 5
See Also
Reference
Rhino.FileIO Namespace