RhinoCommon API
FilePdf Class
 Support for PDF file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FilePdf
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class FilePdf
Public MustInherit Class FilePdf
The FilePdf type exposes the following members.
Constructors
Name | Description
FilePdf
Initializes a new instance of the FilePdf class
Top
Properties
Name | Description
LayersAsOptionalContentGroups
 Add layers as "optional content groups" to the PDF. This is the visible layer tree available in PDF viewers
Top
Methods
Name | Description
AddPage(ViewCaptureSettings)
 Add a new page to this document and draw a viewport into it based on provided ViewCaptureSettings
AddPage(Int32, Int32, Int32)
 Add a blank page to this document
Create
 Create a new instance of a FilePdf class
DrawBitmap
 Draw a bitmap
DrawLine
 Draw a line
DrawPolyline
 Draw a polyline path
DrawText
 Draw text on a page
FirePreWriteEvent
 Called by the framework to fire a PreWrite event
GetCustomPages
 Get a list of custom PDF page definitions defined by the user
PdfDocumentImplementation
 Get actual implementation of PdfDocument class
Read
Read a PDF file into a RhinoDoc
SetCustomPages
 Set the list of custom PDF page definitions
Write(Stream)
 Write PDF to a stream
Write(String)
 Write PDF to a file
Top
Events
Name | Description
PreWrite
 Fired immediately before a PDF is written
Top
See Also
Reference
Rhino.FileIO Namespace