RhinoCommon API
PostEffectData Class
 This is a wrapper around the data ('on', 'shown', 'state' parameters, etc.) of a post effect.
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.PostEffectData
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public class PostEffectData : IDisposable
Public Class PostEffectData
	Implements IDisposable
The PostEffectData type exposes the following members.
Properties
Name | Description
Collection
Id
 Returns the unique id of this post effect.
LocalName
 Returns the localized name of this post effect.
On
 The 'on' state of this post effect.
Shown
 The 'shown' state of this post effect.
Type
 Returns the type of this post effect.
Top
Methods
Name | Description
DataCRC
 Get a CRC representing the state of the entire post effect.
Dispose()
Releases all resources used by the PostEffectData
Dispose(Boolean)
Releases the unmanaged resources used by the PostEffectData and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
GetParameter
 Get an arbitrary parameter from this post effect by its name. If the parameter is not known to the post effect, the method will fail. Returns a variant object if successful or null on failure.
SetParameter
 Set an arbitrary parameter to the post effect by its name. If the parameter is not known to the post effect, the method will fail. Returns true if successful or false on failure.
Top
See Also
Reference
Rhino.Render.PostEffects Namespace