RhinoCommon API
PreviewRenderedEventArgs Class
 PreviewRenderedEventArgs is raised when a content preview has been rendered
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.PreviewRenderedEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PreviewRenderedEventArgs : EventArgs
Public Class PreviewRenderedEventArgs
	Inherits EventArgs
The PreviewRenderedEventArgs type exposes the following members.
Constructors
Name | Description
PreviewRenderedEventArgs
Initializes a new instance of the PreviewRenderedEventArgs class
Top
Properties
Name | Description
Bitmap
 The Bitmap of the rendered preview
PreviewJobSignature
 The Preview Job Signature associated with the rendered preview
Quality
 The Bitmap of the rendered preview
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace