RhinoCommon API
RenderMaterial.AssignToSubFaceChoices Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderMaterial.AssignToSubFaceChoices"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public enum AssignToSubFaceChoices
Public Enumeration AssignToSubFaceChoices
Members
Member name | Value | Description
Keep | 0 | Keep any existing sub-face assignments.
Remove | 1 | Remove any existing sub-face assignments first.
Ask | 2 | Ask the user what to do.
See Also
Reference
Rhino.Render Namespace