RhinoCommon API
EndAnalysisSettingsState Class
Represents a snapshot of EndAnalysisSettings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.EndAnalysisSettingsState
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class EndAnalysisSettingsState
Public Class EndAnalysisSettingsState
The EndAnalysisSettingsState type exposes the following members.
Properties
Name | Description
ClosedSeams
 Gets or sets whether to display the closed curve seam points.
Color
 Gets or sets a color used to display the points.
OpenEnds
 Gets or sets whether to display the open curve end points.
OpenStarts
 Gets or sets whether to display the open curve start points.
PolycurveJoints
 Gets or sets whether to display the polycurve joint points.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace