RhinoCommon API
RenderSettings.EnvironmentUsage Enumeration
 The usage of a render environment.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum EnvironmentUsage
Public Enumeration EnvironmentUsage
Members
Member name | Value | Description
Background | 0 |  Specifies the 360 background environment.
Reflection | 1 |  Specifies the custom reflective environment. Also used for refraction.
Skylighting | 2 |  Specifies the custom skylighting environment.
See Also
Reference
Rhino.Render Namespace