RhinoCommon API
Arrowhead Class
 Arrowhead used by annotation
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Arrowhead
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Arrowhead
Public Class Arrowhead
The Arrowhead type exposes the following members.
Constructors
Name | Description
Arrowhead()
 Constructor
Arrowhead(DimensionStyle.ArrowType, Guid)
 Constructor
Top
Properties
Name | Description
ArrowType
 Type of arrowhead used by annotation
BlockId
 Id of block used for user-defined arrowhead
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace