RhinoCommon API
FileSettings Class
 Contains static methods and properties relating Rhino files.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.FileSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileSettings
Public NotInheritable Class FileSettings
The FileSettings type exposes the following members.
Properties
Name | Description
AutoSaveEnabled
Enables or disables Rhino's automatic file saving mechanism.
AutoSaveFile
the file name used by Rhino's automatic file saving mechanism.
AutoSaveInterval
how often the document will be saved when Rhino's automatic file saving mechanism is enabled.
AutoSaveMeshes
save render and display meshes in autosave file.
BackupFileFolder
Returns or sets the location of Rhino's backup files.
ClipboardCopyToPreviousRhinoVersion
 Gets or sets a value that decides if copies to the clipboard are performed in both the current and previous Rhino clipboard formats. This means you will double the size of what is saved in the clipboard but will be able to copy from the current to the previous version using the clipboard.
ClipboardOnExit
 Gets or sets a value that determines what to do with clipboard data on exit.
CreateBackupFiles
Gets or sets a value that controls the creation of backup files.
CreateOtherBackupFiles
Gets or sets a value that controls the creation of other types of backup files.
DefaultRuiFile
 Gets the path to the default RUI file.
ExecutableFolder
Returns the directory where the main Rhino executable is located.
FileLockingEnabled
Ensure that only one person at a time can have a file open for saving.
FileLockingOpenWarning
Gets or sets whether to display the information dialog which identifies computer files.
HelpFilePath
 Gets the Rhino help file path.
InstallFolder
Returns Rhino's installation folder.
LocalProfileDataFolder
 Get full path to a Rhino specific sub-folder under the per-user Local (non-roaming) Profile folder. This is the folder where user-specific data is stored. On Windows 7, 8, usually someplace like: "C:\Users\[USERNAME]\AppData\Local\McNeel\Rhinoceros\[VERSION_NUMBER]\"
PrefillExportFileName
 Gets or sets a value that controls whether the Export command fills in the file name. When enabled, the file dialog starts out with the model's name in the last used export folder, made unique with a number suffix if that file already exists. When disabled, the file name starts out empty.
SaveViewChanges
true for users who consider view changes a document change.
SearchPathCount
 Gets the amount of search paths that are currently defined.
TemplateFile
Returns or sets the location of Rhino's template file.
TemplateFolder
Returns or sets the location of Rhino's template files.
WorkingFolder
 Returns or sets Rhino's working directory, or folder. The working folder is the default folder for all file operations.
Top
Methods
Name | Description
AddSearchPath
 Adds a new imagePath to Rhino's search imagePath list. See "Options Files settings" in the Rhino help file for more details.
AutoSaveBeforeCommands
Input list of commands that force AutoSave prior to running.
DefaultTemplateFolderForLanguageID
 Returns the default template folder for a given language id.
DeleteSearchPath
 Removes an existing imagePath from Rhino's search imagePath list. See "Options Files settings" in the Rhino help file for more details.
FindFile
 Searches for a file using Rhino's search imagePath. Rhino will look for a file in the following locations: 1. The current document's folder. 2. Folder's specified in Options dialog, File tab. 3. Rhino's System folders.
GetCurrentState
 Returns the current state.
GetDataFolder
 Gets the data folder for machine or current user.
GetDefaultState
 Returns the default state.
GetSearchPaths
 Returns all of the imagePath items in Rhino's search imagePath list. See "Options Files settings" in the Rhino help file for more details.
RecentlyOpenedFiles
 Returns a list of recently opened files. Note that this function does not check to make sure that these files still exist.
SetAutoSaveBeforeCommands
Set list of commands that force AutoSave prior to running.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace