RhinoCommon API
PostEffectHistograms Enumeration
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffectHistograms"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[FlagsAttribute]
public enum PostEffectHistograms
<FlagsAttribute>
Public Enumeration PostEffectHistograms
Members
Member name | Value | Description
None | 0
BeforeEarlyEffects | 1
BeforeToneMapping | 2
AfterToneMapping | 4
AfterLateEffects | 8
All | 15
ToneMappingDisplay | 6
AfterEarlyEffects | 2
BeforeLateEffects | 4
See Also
Reference
Rhino.Render.PostEffects Namespace