RhinoCommon API
FileSW Class
[Missing <summary> documentation for "T:Rhino.FileIO.FileSW"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileSW
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileSW
Public NotInheritable Class FileSW
The FileSW type exposes the following members.
Methods
Name | Description
Read
Read a .sldprt or .sldasm file into a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace