RhinoCommon API
EarthAnchorPoint Class
 Contains information about the model's position in latitude, longitude, and elevation for GIS mapping applications.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.EarthAnchorPoint
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class EarthAnchorPoint : IDisposable
Public Class EarthAnchorPoint
	Implements IDisposable
The EarthAnchorPoint type exposes the following members.
Constructors
Name | Description
EarthAnchorPoint
 Initializes a new instance of the EarthAnchorPoint class.
Top
Properties
Name | Description
Description
 Gets or sets the long form of the identifying information about this location.
EarthBasepointElevation
 Gets or sets the point elevation on earth, in meters.
EarthBasepointElevationCoordinateSystem
 Gets or sets a value indicating the zero level convention relating to a location on Earth.
EarthBasepointLatitude
 Gets or sets a point latitude on earth, in degrees. +90 = north pole, 0 = equator, -90 = south pole.
EarthBasepointLongitude
 Gets or sets the point longitude on earth, in degrees.
KMLOrientationHeadingAngleDegrees
 Gets Keyhole Markup Language (KML) orientation heading angle in degrees.
KMLOrientationHeadingAngleRadians
 Gets Keyhole Markup Language (KML) orientation heading angle in radians.
KMLOrientationRollAngleDegrees
 Gets Keyhole Markup Language (KML) orientation roll angle in degrees.
KMLOrientationRollAngleRadians
 Gets Keyhole Markup Language (KML) orientation roll angle in degrees.
KMLOrientationTiltAngleDegrees
 Gets Keyhole Markup Language (KML) orientation tilt angle in degrees.
KMLOrientationTiltAngleRadians
 Gets Keyhole Markup Language (KML) orientation tilt angle in degrees.
ModelBasePoint
Corresponding model point in model coordinates.
ModelEast
Earth directions in model coordinates.
ModelNorth
Earth directions in model coordinates.
Name
 Gets or sets the short form of the identifying information about this location.
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
EarthLocationIsSet
 Checks if the earth location is set or not.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetEarthAnchorPlane
 Returns the earth anchor plane
GetModelCompass
 Returns a plane in model coordinates whose X axis points East, Y axis points North and Z axis points Up. The origin is set to ModelBasepoint.
GetModelToEarthTransform(LengthUnit)
 Gets a transformation from model coordinates to earth coordinates. This transformation assumes the model is small enough that the curvature of the earth can be ignored.
GetModelToEarthTransform(UnitSystem) |  Obsolete.
 Gets a transformation from model coordinates to earth coordinates. This transformation assumes the model is small enough that the curvature of the earth can be ignored.
ModelLocationIsSet
 Checks if the model location is set or not.
Top
See Also
Reference
Rhino.DocObjects Namespace