RhinoCommon API
Mode Enumeration
 Contains enumerated constant values to represent Rhino's Runtime Mode.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum Mode
Public Enumeration Mode
Members
Member name | Value | Description
NormalMode | 0 | Running with a commercial, educational, or evaluation license ke
ViewerMode | 1 | Running as a viewer
BetaMode | 2 | Running as a Beta product
InvalidMode | 100 | Invalid mode; this is an error condition
See Also
Reference
Rhino.Runtime Namespace