RhinoCommon API
FileObjWriteOptions.PolylineExportType Enumeration
 Determines how polylines will be written to the file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum PolylineExportType
Public Enumeration PolylineExportType
Members
Member name | Value | Description
Bspline | 0 |  Polyline is exported as a degree 1 Bspline (this has been the historical method)
Single | 1 |  Polyline is exported as a single OBJ "l" object with multiple indices to "v" objects
Multiple | 2 |  Polyline is exported as multiple OBJ "l" objects, each with 2 indices to "v" objects
See Also
Reference
Rhino.FileIO Namespace