RhinoCommon API
RenderPipeline.RenderReturnCode Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderPipeline.RenderReturnCode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum RenderReturnCode
Public Enumeration RenderReturnCode
Members
Member name | Value | Description
Ok | 0
EmptyScene | 1
Cancel | 2
NoActiveView | 3
OnPreCreateWindow | 4
NoFrameWndPointer | 5
ErrorCreatingWindow | 6
ErrorStartingRender | 7
EnterModalLoop | 8
ExitModalLoop | 9
ExitRhino | 10
InternalError | 11
See Also
Reference
Rhino.Render Namespace