RhinoCommon API
RealtimeDisplayMode.HudMaxPassesChangedEventArgs Class
[Missing <summary> documentation for "T:Rhino.Render.RealtimeDisplayMode.HudMaxPassesChangedEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RealtimeDisplayMode.HudMaxPassesChangedEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class HudMaxPassesChangedEventArgs : EventArgs
Public Class HudMaxPassesChangedEventArgs
	Inherits EventArgs
The RealtimeDisplayMode.HudMaxPassesChangedEventArgs type exposes the following members.
Constructors
Name | Description
RealtimeDisplayMode.HudMaxPassesChangedEventArgs
Initializes a new instance of the RealtimeDisplayMode.HudMaxPassesChangedEventArgs class
Top
Properties
Name | Description
MaxPasses
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace