RhinoCommon API
Notification.Severity Enumeration
 Determines the severity of a notification.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum Severity
Public Enumeration Severity
Members
Member name | Value | Description
Debug | 0 |  Least serious.
Info | 1 |  Not serious.
Warning | 2 |  Important.
Serious | 3 |  Very important.
Critical | 4 |  Extremely important.
See Also
Reference
Rhino.Runtime.Notifications Namespace