RhinoCommon API
Panels.FloatPanelMode Enumeration
 Used by the FloatPanel method to determine if the floating panel should be shown or hidden.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public enum FloatPanelMode
Public Enumeration FloatPanelMode
Members
Member name | Value | Description
Show | 0 |  Show the floating panel
Hide | 1 |  Hide the floating panel
Toggle | 2 |  Toggle the visibility state
See Also
Reference
Rhino.UI Namespace