RhinoCommon API
SectionBackgroundFillMode Enumeration
 Defines how a background fill is applied to a section
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SectionBackgroundFillMode
Public Enumeration SectionBackgroundFillMode
Members
Member name | Value | Description
None | 0 |  Do not fill in the background of a section
Viewport | 1 |  Use the current display mode settings to determine how to apply a fill. Wireframe will not fill while shaded and rendered will fill using colors and materials matching how the object is drawn.
SolidColor | 2 |  Use a solid color for a background fill. If BackgroundFillColor is set on this section style, then that color will be used. Otherwise, the item's color that this section style is associated will be used
See Also
Reference
Rhino.DocObjects Namespace