RhinoCommon API
FileDst Class
 Support for writing dst file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileDst
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileDst
Public NotInheritable Class FileDst
The FileDst type exposes the following members.
Methods
Name | Description
Read
Read a dst file into a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace