RhinoCommon API
SubDCreationOptions.InteriorCreaseOption Enumeration
 Specifies the test used to determine when an interior mesh edge generates an interior SubD creased edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum InteriorCreaseOption
Public Enumeration InteriorCreaseOption
Members
Member name | Value | Description
Unset | 0 | The interior crease test is not defined.
None | 1 | No interior creases.
AtMeshDoubleEdge | 2 | An interior mesh double edge will create an interior SubD creased edge. An interior mesh double edge occurs when the sides of two mesh faces have have distinct vertex indices and identical vertex locations.
See Also
Reference
Rhino.Geometry Namespace