RhinoCommon API
SubDAutomaticMeshToSubDContext Enumeration
 ON_SubD::AutomaticMeshToSubDContext identifies a context where meshes can automatically be converted to subds.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SubDAutomaticMeshToSubDContext
Public Enumeration SubDAutomaticMeshToSubDContext
Members
Member name | Value | Description
Unset | 0 |  Indicates the context has not been initialized.
Rhino5BoxModeTSpline | 1 |  A mesh in a Rhino 5 3dm file that is a representation of a box mode T-spline. By default, these meshes are automatically converted to subds.
FBXMeshWithDivisionLevels | 2 |  A mesh in an FBX file that has nonzero values for either preview division levels or render division levels. Some FBX files created by Maya save subdivision objects as meshes with nonzero division level values. By default, FBX division levels are ignored.
See Also
Reference
Rhino.Geometry Namespace