RhinoCommon API
File3dmObject Class
 Used to store geometry table object definition and attributes in a File3dm.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.FileIO.File3dmObject
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class File3dmObject : ModelComponent,
	IEquatable<File3dmObject>
Public NotInheritable Class File3dmObject
	Inherits ModelComponent
	Implements IEquatable(Of File3dmObject)
The File3dmObject type exposes the following members.
Properties
Name | Description
Attributes
 Gets the attributes that are linked with this document object.
ComponentType
 Returns ModelGeometry.
 (Overrides ModelComponent.ComponentType.)
Geometry
 Gets the geometry that is linked with this document object.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Name
 Gets or sets the Name of the object. Equivalent to this.Attributes.Name.
 (Overrides ModelComponent.Name.)
Top
Methods
Name | Description
Equals(File3dmObject)
 Verified that two File3dmObject items refer to the same object in a document.
Equals(Object)
 Verified that two objects refer to the same object in a document.
 (Overrides Object.Equals(Object).)
GetHashCode
 Provides an hash code for this item.
 (Overrides Object.GetHashCode().)
GetTextureMapping
 Gets the texture mapping from the File3dmObject object.
TryReadUserData
 Attempts to read a Rhino plug-in's custom userdata from the File3dmObject object.
Top
See Also
Reference
Rhino.FileIO Namespace