RhinoCommon API
PostEffectType Enumeration
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffectType"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum PostEffectType
Public Enumeration PostEffectType
Members
Member name | Value | Description
Early | 0
ToneMapping | 1
Late | 2
See Also
Reference
Rhino.Render.PostEffects Namespace