RhinoCommon API
Transform2d Structure
 Represents the values in a 2d affine transformation.
This is parallel to C++ ON_Xform2d.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public struct Transform2d : IComparable<Transform2d>,
	IEquatable<Transform2d>, ICloneable
<SerializableAttribute>
Public Structure Transform2d
	Implements IComparable(Of Transform2d), IEquatable(Of Transform2d),
	ICloneable
The Transform2d type exposes the following members.
Constructors
Name | Description
Transform2d(Double)
 Initializes a new transform matrix with a specified value along the diagonal.
Transform2d(Transform2d)
 Initializes a new transform matrix from another transform matrix.
Transform2d(Double, Double, Double, Double, Double, Double)
 Initializes a new transform matrix from its six values.
Top
Properties
Name | Description
Determinant
 The determinant of the 2x2 linear part of this matrix. Because the bottom row is (0,0,1) this is also the signed area scale factor of the transformation. A negative determinant means the transformation reverses orientation.
Identity
 Gets a new identity transform matrix. An identity matrix defines no transformation.
IsIdentity
Return true if this Transform2d is the identity transform.
IsTranslation
 True if this transform is a pure translation, that is the linear part is the 2x2 identity.
IsValid
 Gets a value indicating whether or not this Transform2d is a valid matrix. A valid transform matrix is not allowed to have any invalid numbers.
IsZeroTransformation
 True if every value is 0. This transformation maps every point to (0,0).
Item
 Gets or sets the matrix value at the given row and column indices.
M00
Gets or sets this[0,0].
M01
Gets or sets this[0,1].
M02
Gets or sets this[0,2], the X translation.
M10
Gets or sets this[1,0].
M11
Gets or sets this[1,1].
M12
Gets or sets this[1,2], the Y translation.
Nan
 Gets a transform matrix in which every value is not-a-number. The static constructors return this when they are given invalid input.
Unset
 Gets a transform matrix filled with RhinoMath.UnsetValue.
ZeroTransformation
 Gets a transform matrix in which every value is zero. This transformation maps every point to (0,0).
Top
Methods
Name | Description
Clone
 Returns a deep copy of the transform. For languages that treat structures as value types, this can be accomplished by a simple assignment.
CompareTo
 Compares this transform with another transform.
M00 has highest value, then M01, etc..
Equals(Object)
 Determines if another object is a Transform2d and its value equals this transform value.
 (Overrides ValueType.Equals(Object).)
Equals(Transform2d)
 Determines if another transform equals this transform value.
FromAffineElements(Double[])
 Creates a transform from an array of six coefficients in (a, b, c, d, tx, ty) order.
FromAffineElements(Single[])
 Creates a transform from an array of six coefficients in (a, b, c, d, tx, ty) order.
FromAffineElements(Double, Double, Double, Double, Double, Double)
 Creates a transform from the six coefficients used by the traditional 2d drawing APIs. See the remarks on ToAffineElements().
GetAffineElements
 Gets the six coefficients used by the traditional 2d drawing APIs. See the remarks on ToAffineElements().
GetHashCode
 Gets a non-unique hashing code for this transform.
 (Overrides ValueType.GetHashCode().)
Multiply
 Multiplies (combines) two transformations.
This is the same as the * operator between two transformations.
Rotation(Double)
 Constructs a new rotation transformation with the origin as the rotation center.
Rotation(Double, Point2d)
 Constructs a new rotation transformation with a specified rotation center.
Rotation(Double, Double, Point2d)
 Constructs a new rotation transformation from the sine and cosine of an angle and a specified rotation center.
Rotation(Vector2d, Vector2d, Point2d)
 Constructs the rotation that maps one direction onto another while fixing a rotation center.
Scale(Point2d, Double)
 Constructs a new uniform scaling transformation with a specified anchor point.
Scale(Point2d, Double, Double)
 Constructs a new non-uniform scaling transformation with a specified anchor point.
ToAffineElements
 Gets the six coefficients used by the traditional 2d drawing APIs as an array in (a, b, c, d, tx, ty) order.
ToString
 Returns a string representation of this transform.
 (Overrides ValueType.ToString().)
ToTransform
 Gets the 4x4 transformation that applies this 2d transformation to the x and y coordinates and leaves the z coordinate unchanged.
Translation(Vector2d)
 Constructs a new translation (move) transformation.
Translation(Double, Double)
 Constructs a new translation (move) transformation. Right column is (dx, dy).
TryGetInverse
 Attempts to get the inverse transform of this transform.
TryGetTransform2d(Transform, Transform2d)
 Attempts to get the 2d transformation defined by the x and y rows and columns of a 4x4 transformation. This succeeds when transform is affine and maps the world xy plane to itself.
TryGetTransform2d(Transform, Double, Transform2d)
 Attempts to get the 2d transformation defined by the x and y rows and columns of a 4x4 transformation. This succeeds when transform is affine and maps the world xy plane to itself.
Top
Operators
Name | Description
Equality
 Determines if two transformations are equal in value.
Inequality
 Determines if two transformations are different in value.
Multiply(Transform2d, Point2d)
 Multiplies a transformation by a point and gets a new point.
Multiply(Transform2d, Transform2d)
 Multiplies (combines) two transformations.
Multiply(Transform2d, Vector2d)
 Multiplies a transformation by a vector and gets a new vector.
Top
See Also
Reference
Rhino.Geometry Namespace