RhinoCommon API
Hatch Class
 Represents a hatch in planar boundary loop or loops. This is a 2d entity with a plane defining a local coordinate system. The loops, patterns, angles, etc are all in this local coordinate system. The Hatch object manages the plane and loop array Fill definitions are in the HatchPattern or class derived from HatchPattern Hatch has an index to get the pattern definition from the pattern table.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Hatch
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class Hatch : GeometryBase
<SerializableAttribute>
Public Class Hatch
	Inherits GeometryBase
The Hatch type exposes the following members.
Constructors
Name | Description
Hatch
 Protected constructor for internal use.
Top
Properties
Name | Description
BasePoint
 Gets or sets the hatch pattern base point
PatternIndex
 Gets or sets the index of the pattern in the document hatch pattern table.
PatternRotation
 Gets or sets the relative rotation of the pattern.
PatternScale
 Gets or sets the scaling factor of the pattern.
Plane
 Gets or sets the hatch plane
Top
Methods
Name | Description
Create(Curve, Int32, Double, Double) |  Obsolete.
 Constructs an array of hatches from one curve.
Create(IEnumerable<Curve>, Int32, Double, Double) |  Obsolete.
 Constructs an array of hatches from a set of curves.
Create(Curve, Int32, Double, Double, Double)
 Constructs an array of hatches from one curve.
Create(IEnumerable<Curve>, Int32, Double, Double, Double)
 Constructs an array of hatches from a set of curves.
Create(Plane, Curve, IEnumerable<Curve>, Int32, Double, Double)
 Create a hatch with a given set of outer and inner loops
CreateDisplayGeometry
 Generate geometry that would be used to draw the hatch with a given hatch pattern
CreateFromBrep
 Create a hatch from a planar face of a Brep
Explode
 Decomposes the hatch pattern into an array of geometry.
Get2dCurves
 Gets 2d curves that define the boundaries of the hatch
Get3dCurves
 Gets 3d curves that define the boundaries of the hatch
GetGradientFill
 Get gradient fill information for this hatch. If the "GradientType" for the fill is None, then this hatch doesn't have any gradient fill.
ScalePattern
 Scale the hatch's pattern
SetGradientFill
ToBrep
 Constructs a Brep representation of this hatch.
Top
See Also
Reference
Rhino.Geometry Namespace