RhinoCommon API
DimensionStyle.LengthDisplayFormat Enumeration
 Obsolete format for length display - use ON_DimStyle::DimensionLengthDisplay instead
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LengthDisplayFormat
Public Enumeration LengthDisplayFormat
Members
Member name | Value | Description
Decimal | 0 | Obsolete - use ON_DimStyle::DimensionLengthDisplay::ModelUnits.
Fractional | 1 | Obsolete - use ON_DimStyle::DimensionLengthDisplay::InchesFractional
FeetInches | 2 | Obsolete - use ON_DimStyle::DimensionLengthDisplay::FeetAndInches
FeetDecimalInches | 3 | Obsolete - use ON_DimStyle::DimensionLengthDisplay::FeetAndInches enum.
See Also
Reference
Rhino.DocObjects Namespace