RhinoCommon API
IRhRdkContentThumbnail Interface
Note: This API is now obsolete.
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnail"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("IRhRdkContentThumbnail is obsolete", false)]
public interface IRhRdkContentThumbnail : IRhRdkThumbnail
<ObsoleteAttribute("IRhRdkContentThumbnail is obsolete", false)>
Public Interface IRhRdkContentThumbnail
	Inherits IRhRdkThumbnail
The IRhRdkContentThumbnail type exposes the following members.
Methods
Name | Description
ChildContent
GroupId
TopLevelContent
Top
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace