RhinoCommon API
FontTable Class
Font tables store the list of fonts in a Rhino document.
Remarks
The FontTable is now just a wrapper around the DimStyles table.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.FontTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class FontTable : IEnumerable<Font>,
	IEnumerable
Public NotInheritable Class FontTable
	Implements IEnumerable(Of Font), IEnumerable
The FontTable type exposes the following members.
Properties
Name | Description
Count
Number of fonts in the table.
CurrentIndex
 At all times, there is a "current" font. Unless otherwise specified, new dimension objects are assigned to the current font. The current font is never deleted. Returns: Zero based font index of the current font.
Document
Document that owns this table.
Item
 Gets the font at a position.
Top
Methods
Name | Description
FindOrCreate(String, Boolean, Boolean)
 Get a DimensionStyle with the specified characteristics the settings other than face, bold and italic are copied from the current style
FindOrCreate(String, Boolean, Boolean, DimensionStyle)
 Get a DimensionStyle with the specified characteristics
GetEnumerator
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace