RhinoCommon API
NavisWorksVersion Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.NavisWorksVersion"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum NavisWorksVersion
Public Enumeration NavisWorksVersion
Members
Member name | Value | Description
Navisworks2016 | 0
Navisworks2026 | 1
NavisworksCache | 2
See Also
Reference
Rhino.FileIO Namespace