RhinoCommon API
PostEffect Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffect"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.PostEffect
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class PostEffect : IDisposable
Public MustInherit Class PostEffect
	Implements IDisposable
The PostEffect type exposes the following members.
Constructors
Name | Description
PostEffect
Initializes a new instance of the PostEffect class
Top
Properties
Name | Description
CanDisplayHelp
ExecuteWhileRenderingOption
Id
IsSelected
 Return true if the post effect is selected.
LocalName
On
PostEffectType
RequiredChannels
 The RDK calls this method to determine which channels a post effect requires. If a required channel is not available, the RDK will hide the post effect's UI and display explanatory text instead. Note: As a convenience, the default implementation adds IRhRdkRenderWindow::chanRGBA to the output array. Most post effects should be able to use this default with no need to override the method.
SerialNumber
Shown
Styles
Top
Methods
Name | Description
AddUISections
 Create each of your UI sections using 'new' and then call ui.AddSection() on them. RDK takes ownership of the sections.If your post effect does not need a UI, then your implementation of this method can be a no-op.
BeginChange
CanExecute
 Return true if the post effect can execute, else false. The base implementation checks if the post effect is 'On' and 'Shown'. Post effect authors can override this to include other criteria but cannot disable the base criteria.
Changed
DisplayHelp
 Displays the post effect's help page, if any.
Dispose()
Releases all resources used by the PostEffect
Dispose(Boolean)
Releases the unmanaged resources used by the PostEffect and optionally releases the managed resources
EndChange
Execute
 Execute the post effect.
Finalize |  (Overrides Object.Finalize().)
GetHashCode
 A CRC of the state of this post effect.
 (Overrides Object.GetHashCode().)
GetParam
 Get a parameter.
ReadFromDocumentDefaults |  Obsolete.
 Because post effects are now in the render settings, this function can no longer be called.
ReadState
 Read the state. If your post effect has no state, you must still return true for success.
RegisterPostEffect(PlugIn)
RegisterPostEffect(Assembly, Guid)
ResetToFactoryDefaults
 Reset the state to factory defaults.
SetParam
 Set a parameter.
WriteState
 Write the state. If your post effect has no state, you must still return true for success.
WriteToDocumentDefaults |  Obsolete.
 Because post effects are now in the render settings, this function can no longer be called.
Top
See Also
Reference
Rhino.Render.PostEffects Namespace