RhinoCommon API
ChooseOneObjectSettingsState Class
 Represents a snapshot of ChooseOneObjectSettings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.ChooseOneObjectSettingsState
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public class ChooseOneObjectSettingsState
Public Class ChooseOneObjectSettingsState
The ChooseOneObjectSettingsState type exposes the following members.
Properties
Name | Description
AutomaticResize
AutomaticResize
DynamicHighlight
DynamicHighlight
FollowCursor
FollowCursor
HighlightColor
HighlightColor
MaxAutoResizeItems
MaxAutoResizeItems
ShowAllOption
ShowAllOption
ShowObjectColor
ShowObjectColor
ShowObjectLayer
ShowObjectLayer
ShowObjectName
ShowObjectName
ShowObjectType
ShowObjectType
ShowObjectTypeDetails
ShowObjectTypeDetails
ShowTitlebarAndBorder
ShowTitlebarAndBorder
UseCustomColor
UseCustomColor
XOffset
XOffset
YOffset
YOffset
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace