RhinoCommon API
TextureProjectionModes Enumeration
 Enum describing how texture is projected onto geometry
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextureProjectionModes
Public Enumeration TextureProjectionModes
Members
Member name | Value | Description
Undefined | 0 | Not valid projection type
MappingChannel | 1 | Uses a texture mapping to generate texture coordinates
ScreenBased | 2 | Screen based
Wcs | 3 | World coordinate system projection
WcsBox | 4 | Box type world coordinate system projection
EnvironmentMapBox | 5 | Box type environment mapping
EnvironmentMapLightProbe | 6 | Light probe type environment mapping
EnvironmentMapSpherical | 7 | Spherical environment mapping
EnvironmentMapCube | 8 | Cube type environment mapping
EnvironmentMapVCrossCube | 9 | Vertical cross cube type environment mapping
EnvironmentMapHCrossCube | 10 | Horizontal cross type environment mapping
EnvironmentMapHemispherical | 11 | Hemispherical environment mapping
EnvironmentMapEmap | 12 | Emap type environment mapping
SurfaceParameterization | 13 | Surface parameterization
See Also
Reference
Rhino.DocObjects Namespace