RhinoCommon API
TextFields.InstanceAttributeField Class
[Missing <summary> documentation for "T:Rhino.Runtime.TextFields.InstanceAttributeField"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.TextFields.InstanceAttributeField
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class InstanceAttributeField
Public Class InstanceAttributeField
The TextFields.InstanceAttributeField type exposes the following members.
Constructors
Name | Description
TextFields.InstanceAttributeField
 Block attribute definition.
Top
Properties
Name | Description
DefaultValue
 Default value used when inserting a block
Key
 Attribute key
Prompt
 Prompt displayed by the UI when inserting a block
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Runtime Namespace