RhinoCommon API
OptionsDialogPage Class
[Missing <summary> documentation for "T:Rhino.UI.OptionsDialogPage"]
Inheritance Hierarchy
System.Object
 Rhino.UI.StackedDialogPage
 Rhino.UI.OptionsDialogPage
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class OptionsDialogPage : StackedDialogPage
Public MustInherit Class OptionsDialogPage
	Inherits StackedDialogPage
The OptionsDialogPage type exposes the following members.
Constructors
Name | Description
OptionsDialogPage
Initializes a new instance of the OptionsDialogPage class
Top
Properties
Name | Description
OptionsPageType
 17 March 2021 John Morse For internal use in determining the page type. RhinoMac uses this to ensure pages are sized properly when hosting them.
Top
Methods
Name | Description
RunScript
Top
See Also
Reference
Rhino.UI Namespace