RhinoCommon API
PreserveEnd Enumeration
 Preserves, or maintains, the shape of the opposite the one being edited.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.6
Syntax
public enum PreserveEnd
Public Enumeration PreserveEnd
Members
Member name | Value | Description
None | 0 |  No constraint.
Position | 1 |  Location only.
Tangency | 2 |  Position and curve direction.
Curvature | 3 |  Position, direction, and radius of curvature.
See Also
Reference
Rhino.Geometry Namespace