RhinoCommon API
RhinoHelp Class
 Provides access to the built in Rhino help system
Inheritance Hierarchy
System.Object
 Rhino.UI.RhinoHelp
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class RhinoHelp
Public NotInheritable Class RhinoHelp
The RhinoHelp type exposes the following members.
Methods
Name | Description
Show
 Call this method to display standard Rhino help
Top
See Also
Reference
Rhino.UI Namespace