RhinoCommon API
File3dmLinetypeTable Class
 Provides access to Linetypes in the 3dm file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<Linetype>
 Rhino.FileIO.File3dmCommonComponentTable<Linetype>
 Rhino.FileIO.File3dmLinetypeTable
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmLinetypeTable : File3dmCommonComponentTable<Linetype>,
	IList<Linetype>, ICollection<Linetype>, IEnumerable<Linetype>,
	IEnumerable
Public Class File3dmLinetypeTable
	Inherits File3dmCommonComponentTable(Of Linetype)
	Implements IList(Of Linetype), ICollection(Of Linetype),
	IEnumerable(Of Linetype), IEnumerable
The File3dmLinetypeTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns LinePattern.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
Methods
Name | Description
FindIndex
 Retrieves a Linetype object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds a Linetype given its name.
FindNameHash
 Finds a Linetype given its name hash.
Top
See Also
Reference
Rhino.FileIO Namespace