RhinoCommon API
RhinoAccoountsProgressInfo Class
 This class is designed to convey the progress of an asynchronous operation through .NET's IProgress<T> interface. It can be used by callers of such tasks to relay the tasks' progress, as well as useful metadata information that may be of interest.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.RhinoAccounts.RhinoAccoountsProgressInfo
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RhinoAccoountsProgressInfo
Public Class RhinoAccoountsProgressInfo
The RhinoAccoountsProgressInfo type exposes the following members.
Constructors
Name | Description
RhinoAccoountsProgressInfo
 Creates a new instance.
Top
Properties
Name | Description
Description
 A localized description of the state that may be shown to the user of the application.
Metadata
 Any metadata of interest that may be used by the caller of a task.
State
 The state to report.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace