RhinoCommon API
FileIgsWriteOptions.MeshesMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileIgsWriteOptions.MeshesMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum MeshesMode
Public Enumeration MeshesMode
Members
Member name | Value | Description
MeshNone | 0
Mesh10612 | 12
Mesh10613 | 13
See Also
Reference
Rhino.FileIO Namespace