RhinoCommon API
RhinoAccountsInvalidResponseException Class
 Exception thrown when the response returned by Rhino Accounts is not valid.
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.RhinoAccounts.RhinoAccountsException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsInvalidResponseException
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class RhinoAccountsInvalidResponseException : RhinoAccountsException
<SerializableAttribute>
Public Class RhinoAccountsInvalidResponseException
	Inherits RhinoAccountsException
The RhinoAccountsInvalidResponseException type exposes the following members.
Constructors
Name | Description
RhinoAccountsInvalidResponseException(Exception)
 Generates a new instance of the exception.
RhinoAccountsInvalidResponseException(String, Exception)
 Generates a new instance of the exception.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace