RhinoCommon API
TextureFilter Enumeration
 Determines how the color of the image pixel is calculated when the image pixel corresponds to multiple texture bitmap pixels.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public enum TextureFilter
Public Enumeration TextureFilter
Members
Member name | Value | Description
Nearest | 0 |  Nearest texture pixel is used.
Linear | 1 |  Weighted average of corresponding texture pixels.
See Also
Reference
Rhino.DocObjects Namespace