RhinoCommon API
ViewEnableDrawingEventArgs Class
 View enable drawing event argument.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.ViewEnableDrawingEventArgs
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public class ViewEnableDrawingEventArgs : EventArgs
Public Class ViewEnableDrawingEventArgs
	Inherits EventArgs
The ViewEnableDrawingEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the Rhino document.
DocumentSerialNumber
 The serial number of the Rhino document.
DrawingEnabled
 True if drawing is enabled, false otherwise.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace