RhinoCommon API
CircleCircleIntersection Enumeration
 Represents all possible cases of a Circle|Circle intersection event.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public enum CircleCircleIntersection
Public Enumeration CircleCircleIntersection
Members
Member name | Value | Description
None | 0 |  Circles do not intersect.
Single | 1 |  Circles touch at a one point.
Multiple | 2 |  Circles intersect at two points.
Overlap | 3 |  Circles are identical.
See Also
Reference
Rhino.Geometry.Intersect Namespace