RhinoCommon API
Font Class
Defines a format for text.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Font
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public sealed class Font : ISerializable
<SerializableAttribute>
Public NotInheritable Class Font
	Implements ISerializable
The Font type exposes the following members.
Constructors
Name | Description
Font(String)
Initializes a new instance of the Font class
Font(String, Font.FontWeight, Font.FontStyle, Boolean, Boolean)
Initializes a new instance of the Font class
Font(String, Font.FontWeight, Font.FontStyle, Font.FontStretch, Boolean, Boolean)
Initializes a new instance of the Font class
Top
Properties
Name | Description
AscentOfCapital
 The font's typographic capital height, in the design units reported by UnitsPerEm. This is the metric a "text height" is measured against, so text of height h renders its capitals h tall. Zero when the font has no usable metrics.
Bold
Description
 Returns a long description that includes family, face, weight, stretch and style information. Generally not useful for finding matching fonts.
EnglishFaceName
 Returns English Face name
EnglishFamilyName
EnglishQuartetName
FaceName
 Returns Face name
FamilyName
FamilyPlusFaceName
 Returns concatenated Family and Face names
IsEngravingFont
IsGeometricToleranceFont
IsInstalled
Is this font installed on the system
IsSimulated
IsSingleStrokeFont
IsSymbolFont
Italic
LogfontName
 Returns Windows LOGFONT Face name
PointSize
PostScriptName
 Returns the Font PostScriptName - "Apple font name"
QuartetName
RichTextFontName
 Returns the Font RichTextFontName used in RTF strings: {\\fonttbl...{\\fN RichTextFontName;}...}
Stretch
Strikeout
Style
Underlined
UnitsPerEm
 The number of design units per em in this font's normalized metrics. Together with AscentOfCapital this converts between an em size - the "font size" used by CSS, SVG, PDF and most page layout - and the height of a capital letter, which is what Rhino means by a text height. Zero when the font has no usable metrics.
Weight
Top
Methods
Name | Description
AvailableFontFaceNames
FromQuartetProperties
FromRichTextProperties
 Returns a font with the requested rich-text (family) name, preserving that name even when the font is not installed on the current machine. If an installed font matches it is returned; otherwise a "not on device" managed font that keeps the requested name is returned (rendered with a fallback quartet). Use this to author a font by name on a machine that does not have it installed: the Font constructor and FromQuartetProperties(String, Boolean, Boolean) both substitute the family in that case, losing the requested name when the file is written.
GetObjectData
 Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
GetSubstituteFont
 If this font is not installed on the system, try to find a substitute
InstalledFonts()
InstalledFonts(String)
InstalledFontsAsQuartets
Top
See Also
Reference
Rhino.DocObjects Namespace