RhinoCommon API
MarkupViewChangedEventArgs Class
 Markup view changed event arguments. Reports which markup, if any, a document is currently viewing or editing.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.Tables.MarkupViewChangedEventArgs
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public class MarkupViewChangedEventArgs : EventArgs
Public Class MarkupViewChangedEventArgs
	Inherits EventArgs
The MarkupViewChangedEventArgs type exposes the following members.
Properties
Name | Description
Document
The Rhino document.
Index
 The table index of the markup being viewed or edited, or -1 if none (for example when leaving markup mode or while creating a new markup).
Mode
The markup mode the document is now in.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace