RhinoCommon API
NamedColorList Class
 A list of color name/value pairs.
Inheritance Hierarchy
System.Object
 System.Collections.Generic.List<NamedColor>
 Rhino.UI.NamedColorList
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class NamedColorList : List<NamedColor>
Public Class NamedColorList
	Inherits List(Of NamedColor)
The NamedColorList type exposes the following members.
Constructors
Name | Description
NamedColorList(String)
 Initializes a new instance of the ColorList with the specified name.
NamedColorList(String, IEnumerable<NamedColor>)
 Initializes a new instance of the ColorList with the specified name and entries.
Top
Properties
Name | Description
Default
 Get the Rhino applications named color list.
Name
 The name of the color list, which may be displayed to the user.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace