RhinoCommon API
FileFbxReadOptions Class
 Options for reading a Fbx file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileFbxReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileFbxReadOptions
Public Class FileFbxReadOptions
The FileFbxReadOptions type exposes the following members.
Constructors
Name | Description
FileFbxReadOptions
Initializes a new instance of the FileFbxReadOptions class
Top
Properties
Name | Description
ImportCameras
ImportLights
ImportMeshesAsSubD
MapFbxYtoRhinoZ
Unweld
UnweldAngle
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace