RhinoCommon API
PanelIds Class
 Standard Rhino panel ids.
Inheritance Hierarchy
System.Object
 Rhino.UI.PanelIds
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class PanelIds
Public NotInheritable Class PanelIds
The PanelIds type exposes the following members.
Properties
Name | Description
BoxEdit
 Rhino BoxEdit panel.
ContextHelp
 Rhino Context-Sensitive Help panel.
Display
 Rhino Display Properties panel.
Environment
 Rhino Environment panel.
FileExplorer
 Rhino File Explorer panel.
GroundPlane
 Rhino Ground Plane panel.
Layers
 Rhino Layer panel.
Libraries
 Rhino Render Libraries panel.
LightManager
 Rhino Lights panel.
Materials
 Rhino Materials panel.
Notes
 Rhino Notes panel.
ObjectProperties
 Rhino Object Properties panel.
Rendering
 Rhino Rendering Properties panel.
Sun
 Rhino Sun panel.
Texture
 Rhino Texture panel.
Top
See Also
Reference
Rhino.UI Namespace