RhinoCommon API
StdVectorGuid Class
 Wrapper for std::vector<ON_UUID>. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.StdVectorGuid
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class StdVectorGuid : IDisposable
Public Class StdVectorGuid
	Implements IDisposable
The StdVectorGuid type exposes the following members.
Constructors
Name | Description
StdVectorGuid()
 Initializes a new StdVectorGuid class.
StdVectorGuid(IEnumerable<Guid>)
 Initializes a new StdVectorGuid class
Top
Properties
Name | Description
Count
 Gets the amount of elements in this vector.
Item
 Get the Guid at index
Top
Methods
Name | Description
Append
 Appends a new Guid at the end of this vector.
ConstPointer
 Gets the constant (immutable) pointer of this vector.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this vector.
ToArray
 Returns the managed counterpart of the unmanaged vector.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace