RhinoCommon API
Symbols Class
 Characters used for different 'drafting style' symbols
Inheritance Hierarchy
System.Object
 Rhino.Symbols
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class Symbols
Public NotInheritable Class Symbols
The Symbols type exposes the following members.
Properties
Name | Description
DegreeSymbol
 Degree symbol used for angles
DiameterSymbol
 Diameter symbol
PlusMinusSymbol
 Plus-Minus tolerance symbol
RadiusSymbol
 Radius symbol
Top
See Also
Reference
Rhino Namespace