RhinoCommon API
PageSettings Class
 The paper size and margins of a layout, in millimeters. Only meaningful for a view whose ViewType is PageView.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.PageSettings
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public class PageSettings
Public Class PageSettings
The PageSettings type exposes the following members.
Constructors
Name | Description
PageSettings
Initializes a new instance of the PageSettings class
Top
Properties
Name | Description
BottomMarginMillimeters
Bottom margin in millimeters.
HeightMillimeters
Paper height in millimeters.
LeftMarginMillimeters
Left margin in millimeters.
PageNumber
The page number of this layout.
PrinterName
Name of the printer this layout targets, if any.
RightMarginMillimeters
Right margin in millimeters.
TopMarginMillimeters
Top margin in millimeters.
WidthMillimeters
Paper width in millimeters.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace