RhinoCommon API
RenderContentChangeReason Enumeration
 Enumeration denoting type of change for attach or detach.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum RenderContentChangeReason
Public Enumeration RenderContentChangeReason
Members
Member name | Value | Description
None | 0 |  No attach or detach change
Attach | 1 |  Content is being attached by the RhinoDoc.AttachContent() or RenderContent.AttachChild() methods.
Detach | 2 |  Content is being detached by the RenderContent.DeleteContent() method.
ChangeAttach | 3 |  Content is being attached while changing.
ChangeDetach | 4 |  Content is being detached while changing.
AttachUndo | 5 |  Content is being attached during undo/redo
DetachUndo | 6 |  Content is being detached during undo/redo.
Open | 7 |  Content is being attached during open document
Delete | 8 |  Content is being detached during normal deletion.
See Also
Reference
Rhino.Render Namespace