RhinoCommon API
RealtimeDisplayMode.InitFramebufferEventArgs Class
[Missing <summary> documentation for "T:Rhino.Render.RealtimeDisplayMode.InitFramebufferEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RealtimeDisplayMode.InitFramebufferEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class InitFramebufferEventArgs : EventArgs
Public Class InitFramebufferEventArgs
	Inherits EventArgs
The RealtimeDisplayMode.InitFramebufferEventArgs type exposes the following members.
Constructors
Name | Description
RealtimeDisplayMode.InitFramebufferEventArgs
Initializes a new instance of the RealtimeDisplayMode.InitFramebufferEventArgs class
Top
Properties
Name | Description
Pipeline
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace