RhinoCommon API
Fonts Class
 Rhino.Rumtime.UI
Inheritance Hierarchy
System.Object
 Rhino.UI.Fonts
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Fonts
Public Class Fonts
The Fonts type exposes the following members.
Constructors
Name | Description
Fonts
Initializes a new instance of the Fonts class
Top
Properties
Name | Description
BoldHeadingFont
 Returns a font that is 1.2x NormalFont and Bold
HeadingFont
 Returns a font used for dialog headings. 1.2x the size of NormalFont.
NormalFont
 Returns the normal font used for dialog boxes and buttons.
SmallFont
 Returns a font use for small text in dialog boxes. 0.8x the size of NormalFont.
TitleFont
 Returns a font used for dialog titles. 2x the size of NormalFont, and bold.
Top
Methods
Name | Description
GetUiFont
 GetUiFont provides access to a set of unmanaged fonts used by Rhino.
Top
See Also
Reference
Rhino.UI Namespace