RhinoCommon API
CustomRenderMeshProviderAttribute Class
 Attributes for RenderMeshProvider
Inheritance Hierarchy
System.Object
 System.Attribute
 Rhino.Render.CustomRenderMeshes.CustomRenderMeshProviderAttribute
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class CustomRenderMeshProviderAttribute : Attribute
Public NotInheritable Class CustomRenderMeshProviderAttribute
	Inherits Attribute
The CustomRenderMeshProviderAttribute type exposes the following members.
Constructors
Name | Description
CustomRenderMeshProviderAttribute
 Constructor
Top
Properties
Name | Description
NonObjectIdsOnly
 If set to true, this will quickly return false for HasCustomRenderMeshes if the objectId is in the document.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render.CustomRenderMeshes Namespace