RhinoCommon API
IWindow Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.IWindow"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IWindow
Public Interface IWindow
The IWindow type exposes the following members.
Properties
Name | Description
Caption
Created
Enabled
Parent
Shown
Window
Top
Methods
Name | Description
Move
Top
See Also
Reference
Rhino.UI.Controls Namespace