RhinoCommon API
OsnapModes Enumeration
 Defines several bit masks for each of the OSnap that are defined.
Refer to the Rhino Help file for further information.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[FlagsAttribute]
public enum OsnapModes
<FlagsAttribute>
Public Enumeration OsnapModes
Members
Member name | Value | Description
None | 0 | No OSnap.
Near | 2 | Near OSnap.
Focus | 8 | Focus OSnap.
Center | 32 | Center OSnap.
Vertex | 64 | Vertex OSnap.
Knot | 128 | Knot OSnap.
Quadrant | 512 | Quadrant OSnap.
Midpoint | 2048 | Midpoint OSnap.
Intersection | 8192 | Intersection OSnap.
End | 131072 | End OSnap.
Perpendicular | 524288 | Perpendicular OSnap.
Tangent | 2097152 | Tangent OSnap.
Point | 134217728 | Point OSnap.
See Also
Reference
Rhino.ApplicationSettings Namespace