RhinoCommon API
SHA1OpenNURBS Class
 Provides the OpenNURBS implementation of SHA1.
This class is provided only with the purpose of hashing. It is not meant to be used for any cryptographic purpose.
Inheritance Hierarchy
System.Object
 System.Security.Cryptography.HashAlgorithm
 System.Security.Cryptography.SHA1
 Rhino.FileIO.SHA1OpenNURBS
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class SHA1OpenNURBS : SHA1
Public NotInheritable Class SHA1OpenNURBS
	Inherits SHA1
The SHA1OpenNURBS type exposes the following members.
Constructors
Name | Description
SHA1OpenNURBS
 Constructs a new instance of the SHA1 algorithm.
Top
Properties
Name | Description
Top
Methods
Name | Description
FileSystemPathHash
 Computes the SHA1 hash of a file system path, converted to UTF8.
These file system paths have identical values of FileSystemPathHash():
/x/y/z/name.ext
\x\y\z\name.ext
/x//y//z/name.ext
/x/y/a/b/c/../../../z/name.ext
/X/Y/Z/NAME.EXT (When ignoreCase is true)
Finalize
 Instructs the runtime to reclaim unmanaged resources if the developer forgot to call Dispose().
 (Overrides Object.Finalize().)
Initialize
 Resets this instance of the algorithm, so that it can be used again. It is not required to call this method after creation.
 (Overrides HashAlgorithm.Initialize().)
StringHash
 Computes the SHA1 hash of a string, converted to UTF8.
Top
See Also
Reference
Rhino.FileIO Namespace