RhinoCommon API
IDialogService Interface
[Missing <summary> documentation for "T:Rhino.UI.IDialogService"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IDialogService
Public Interface IDialogService
The IDialogService type exposes the following members.
Methods
Name | Description
ObjectToWindowHandle
ShowColorDialog
ShowMultiListBox
WrapAsIWin32Window
Top
See Also
Reference
Rhino.UI Namespace