RhinoCommon API
PointDisplayMode Enumeration
 Defines enumerated constant values for world coordinates and CPlane point display modes.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum PointDisplayMode
Public Enumeration PointDisplayMode
Members
Member name | Value | Description
WorldPoint | 0 | Points are displayed in world coordinates.
CplanePoint | 1 | Points are displayed in CPlane coordinates.
See Also
Reference
Rhino.ApplicationSettings Namespace