RhinoCommon API
LicenseChangedEventArgs Class
[Missing <summary> documentation for "T:Rhino.PlugIns.LicenseChangedEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.PlugIns.LicenseChangedEventArgs
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class LicenseChangedEventArgs : EventArgs
Public Class LicenseChangedEventArgs
	Inherits EventArgs
The LicenseChangedEventArgs type exposes the following members.
Constructors
Name | Description
LicenseChangedEventArgs
Initializes a new instance of the LicenseChangedEventArgs class
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.PlugIns Namespace