RhinoCommon API
VerifyLicenseKeyDelegate Delegate
 Called by Rhino to verify a license key. For details, see http://developer.rhino3d.com/guides/rhinocommon/rhinocommon-zoo-plugins/
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate ValidateResult VerifyLicenseKeyDelegate(
	string licenseKey,
	string validationCode,
	DateTime validationCodeInstallDate,
	bool gracePeriodExpired,
	out LicenseData licenseData
)
Public Delegate Function VerifyLicenseKeyDelegate (
	licenseKey As String,
	validationCode As String,
	validationCodeInstallDate As DateTime,
	gracePeriodExpired As Boolean,
	<OutAttribute> ByRef licenseData As LicenseData
) As ValidateResult
Parameters
licenseKey
Type: System.String
A license key string. Will be null if user clicks Evaluate.
validationCode
Type: System.String
An optional validation code, passed on a second call to ValidateProductKeyDelegate if the first call set LicenseData.RequiresOnlineValidation to true
validationCodeInstallDate
Type: System.DateTime
The date the validation code was saved
gracePeriodExpired
Type: System.Boolean
Whether the validation grace period has passed
licenseData
Type: Rhino.PlugIns.LicenseData
Output parameter where your delegate can set return data, such as error messages to display to the user.
Return Value
Type: ValidateResult
See Also
Reference
Rhino.PlugIns Namespace