RhinoCommon API
ContentUndoHelper Class
 Content undo helper to be used with "using {}" to enclose a block of changes.
Inheritance Hierarchy
System.Object
 Rhino.Render.ContentUndoHelper
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ContentUndoHelper : IDisposable
Public Class ContentUndoHelper
	Implements IDisposable
The ContentUndoHelper type exposes the following members.
Constructors
Name | Description
ContentUndoHelper(RhinoDoc)
 Constructs a ContentUndoHelper object inside a using block to handle undo when modifying a RenderContent or - alternatively - create the ContentUndoHelper and explicitly call Dispose when you are done.
ContentUndoHelper(RhinoDoc, String) |  Obsolete.
 DEPRECATED: Constructs a ContentUndoHelper object inside a using block to handle undo when modifying a RenderContent or - alternatively - create the ContentUndoHelper and explicitly call Dispose when you are done.
Top
Methods
Name | Description
AddContent
 Call this *after* adding a content. Undo will cause the content to be deleted.
Dispose()
Releases all resources used by the ContentUndoHelper
Dispose(Boolean)
Releases the unmanaged resources used by the ContentUndoHelper and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
ModifyContent
 Call this before modifying or deleting a content. Undo will cause the content to be restored.
TweakContent
 Call this before tweaking a single content parameter. Undo will cause the parameter to be restored.
Top
See Also
Reference
Rhino.Render Namespace