RhinoCommon API
Skylight Class
[Missing <summary> documentation for "T:Rhino.Render.Skylight"]
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.Skylight
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class Skylight : DocumentOrFreeFloatingBase,
	IDisposable
Public NotInheritable Class Skylight
	Inherits DocumentOrFreeFloatingBase
	Implements IDisposable
The Skylight type exposes the following members.
Constructors
Name | Description
Skylight()
 Create a utility object not associated with any document
Skylight(Skylight)
 Create a utility object not associated with any document from another object
Top
Properties
Name | Description
CustomEnvironment |  Obsolete.
CustomEnvironmentOn |  Obsolete.
Enabled
ShadowIntensity
 ShadowIntensity is currently unused.
Top
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Dispose
Releases all resources used by the Skylight
Finalize |  (Overrides FreeFloatingBase.Finalize().)
Top
Events
Name | Description
Changed
 This event is raised when a Skylight property value is changed.
Top
See Also
Reference
Rhino.Render Namespace