RhinoCommon API
DracoColorFormat Enumeration
 Color format for vertex colors
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.7
Syntax
public enum DracoColorFormat
Public Enumeration DracoColorFormat
Members
Member name | Value | Description
ARGB | 0 |  Alpha, Red, Green, Blue order
RGBA | 1 |  Red, Green, Blue, Alpha order
See Also
Reference
Rhino.FileIO Namespace