RhinoCommon API
IRhRdkPreviewSceneServer_eRotationType Enumeration
 c# version of IRhRdkPreviewSceneServer eRotationType enum
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum IRhRdkPreviewSceneServer_eRotationType
Public Enumeration IRhRdkPreviewSceneServer_eRotationType
Members
Member name | Value | Description
Camera | 0 | Camera
Object | 1 | Object
See Also
Reference
Rhino.Render Namespace