RhinoCommon API
DynamicObjectTransform Class
 ChangeQueue DynamicObject
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.DynamicObjectTransform
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DynamicObjectTransform
Public Class DynamicObjectTransform
The DynamicObjectTransform type exposes the following members.
Properties
Name | Description
MeshInstanceId
 Get the mesh instance id for this dynamic object.
Transform
 Transform for the DynamicObject
Top
Methods
Name | Description
ToString
 String representation of DynamicObject
 (Overrides Object.ToString().)
Top
See Also
Reference
Rhino.Render.ChangeQueue Namespace