RhinoCommon API
ZebraAnalysisSettingsState Class
 Represents a snapshot of ZebraAnalysisSettings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.ZebraAnalysisSettingsState
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public class ZebraAnalysisSettingsState
Public Class ZebraAnalysisSettingsState
The ZebraAnalysisSettingsState type exposes the following members.
Properties
Name | Description
ShowIsoCurves
 Get or sets the display of surface isocurves.
StripeColor
 Gets or sets the stripe color.
StripeThickness
 Gets or sets the stripe thickness, where 0 = thinnest and 6 = thickest.
VerticalStripes
 Set to true for vertical stripes, or false for horizontal stripes.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace