RhinoCommon API
MarkupMode Enumeration
 The markup mode a document is in. Reported by MarkupViewChanged.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum MarkupMode
Public Enumeration MarkupMode
Members
Member name | Value | Description
None | 0 | The document is not in markup mode.
Create | 1 | A new markup is being created.
View | 2 | An existing markup is being viewed.
Edit | 3 | An existing markup is being edited.
See Also
Reference
Rhino.DocObjects.Tables Namespace