RhinoCommon API
Modes Enumeration
[Missing <summary> documentation for "T:Rhino.Render.DataSources.Modes"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum Modes
Public Enumeration Modes
Members
Member name | Value | Description
Unset | 0
Grid | 1
List | 2
Tree | 3
See Also
Reference
Rhino.Render.DataSources Namespace