RhinoCommon API
ViewEventArgs Class
 View event arguments.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.ViewEventArgs
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public class ViewEventArgs : EventArgs
Public Class ViewEventArgs
	Inherits EventArgs
The ViewEventArgs type exposes the following members.
Properties
Name | Description
View
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace