RhinoCommon API
RotationGripUserInterfaceObject Class
 A point plus arc that represents a grip used for rotational dragging
Inheritance Hierarchy
System.Object
 Rhino.UI.UserInterfaceObjectBase
 Rhino.UI.GripUserInterfaceObject
 Rhino.UI.RotationGripUserInterfaceObject
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RotationGripUserInterfaceObject : GripUserInterfaceObject
Public Class RotationGripUserInterfaceObject
	Inherits GripUserInterfaceObject
The RotationGripUserInterfaceObject type exposes the following members.
Constructors
Name | Description
RotationGripUserInterfaceObject
 Create a rotation grip that is aligned to a plane with a defined radius in pixels
Top
Properties
Name | Description
GripPointVisible
 Is the grip point itself drawn
Top
Methods
Name | Description
ArcVisibleInViewport
 If the arc for a given viewport visible.
OnRotationDrag
 Called when dragging a rotation grip. Angle is the amount that the plane will be rotated when dragging
Top
See Also
Reference
Rhino.UI Namespace