RhinoCommon API
DisplayEngine Class
[Missing <summary> documentation for "T:Rhino.Display.DisplayEngine"]
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayEngine
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class DisplayEngine : IDisposable
Public MustInherit Class DisplayEngine
	Implements IDisposable
The DisplayEngine type exposes the following members.
Constructors
Name | Description
DisplayEngine
Initializes a new instance of the DisplayEngine class
Top
Methods
Name | Description
Dispose
Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Display Namespace