RhinoCommon API
SubDEdgeChain Class
 An ordered run of connected SubD edges.
 Consecutive edges in a chain share a vertex, and each edge carries the direction it is traversed with, so the chain has a start and an end even when the individual edges do not agree on orientation. Chains are what commands like Bridge, Loft and edge sharpening operate on.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDEdgeChain
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public sealed class SubDEdgeChain : IDisposable
Public NotInheritable Class SubDEdgeChain
	Implements IDisposable
The SubDEdgeChain type exposes the following members.
Constructors
Name | Description
SubDEdgeChain(SubD)
 Creates an empty chain in the given SubD.
SubDEdgeChain(SubD, SubDEdge)
 Creates a chain containing a single starting edge. Grow it with AddAllNeighbors(ChainDirection, SubDChainType) or AddOneNeighbor(ChainDirection, SubDChainType).
Top
Properties
Name | Description
EdgeCount
 The number of edges in this chain.
Edges
 The edges of this chain, in order.
IsClosedLoop
 True when the chain closes back on itself.
ParentSubD
 The SubD this chain runs through.
Top
Methods
Name | Description
AddAllNeighbors
 Extends the chain as far as it will go at one or both ends.
AddEdge
 Adds an edge to whichever end of the chain it connects to.
AddOneNeighbor
 Extends the chain by one edge at one or both ends.
Begin
 Clears the chain and restarts it from a single edge.
Clear
 Removes every edge from the chain.
Dispose
 Frees the unmanaged chain.
EdgeAt
 Gets the edge at the given position in the chain. The returned edge carries the direction the chain traverses it with, in ComponentDirection.
Finalize
 Finalizer.
 (Overrides Object.Finalize().)
IsConvexLoop
 True when the chain is a closed loop that is convex.
Reverse
 Reverses the direction of the chain.
SortEdgesIntoEdgeChains
 Sorts a set of edges into chains.
ToLoftCurve
 Gets a NURBS curve suitable for lofting SubDs, following this chain.
ToNurbsCurve
 Gets a NURBS curve on the SubD surface following this chain.
TrimToRange
 Trims the chain down to the run of edges between firstEdge and lastEdge, removing everything before firstEdge and everything after lastEdge.
VertexAt
 Gets the vertex at the given position along the chain. A chain of N edges has N+1 vertices, or N when it is a closed loop.
Top
Remarks
 A chain holds a reference to its SubD and does not keep it alive across edits that change the SubD topology; rebuild the chain after editing.
See Also
Reference
Rhino.Geometry Namespace