RhinoCommon API
MouseState Class
 Current mouse state when used in UserInterfaceObject virtual functions
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.UI.MouseState
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MouseState : EventArgs
Public Class MouseState
	Inherits EventArgs
The MouseState type exposes the following members.
Properties
Name | Description
Button
 Which button or buttons are currently pressed
DeviceLocation
 Where the mouse is, in device pixels of the surface this event came from.
DpiScale
 Device pixels per logical pixel for the surface this event came from. 1.0 when that is not known.
FrustumLine
 Line in frustum that the active mouse position covers
Location
 Where the mouse is, in logical pixels of the surface this event came from. This is the coordinate system on screen controls are laid out in, so it is the one to hit test against.
View
 View that is being used mouse tests
Top
Methods
Name | Description
IsMouseOver(Line)
 Test if the mouse is currently over a 3d line
IsMouseOver(Point3d)
 Test if the mouse is currently over a 3d location
IsMouseOver(Curve, Double)
 Test if the mouse is over a curve
Top
See Also
Reference
Rhino.UI Namespace