RhinoCommon API
StringParser Class
 Parse strings to numbers, distances and angles
Inheritance Hierarchy
System.Object
 Rhino.Input.StringParser
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class StringParser
Public Class StringParser
The StringParser type exposes the following members.
Constructors
Name | Description
StringParser
Initializes a new instance of the StringParser class
Top
Methods
Name | Description
ParseAngleExpession
ParseAngleExpressionDegrees
ParseAngleExpressionRadians
ParseLengthExpession(String, StringParserSettings, UnitSystem, Double)
 Parse a string for a length value. Expression can include complex expressions Simplest version of Length parsing
ParseLengthExpession(String, Int32, Int32, StringParserSettings, UnitSystem, Double, StringParserSettings, UnitSystem)
 Parse a string for a length value. Expression can include complex expressions Most complex version of length parsing
ParseNumber
 Parse a string expression to get a number
Top
See Also
Reference
Rhino.Input Namespace