RhinoCommon API
GroupTableEventType Enumeration
 Defines the types of group table events.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum GroupTableEventType
Public Enumeration GroupTableEventType
Members
Member name | Value | Description
Added | 0 |  A group was added.
Deleted | 1 |  A group was deleted.
Undeleted | 2 |  A group was undeleted.
Modified | 3 |  A group was modified.
Sorted | 4 |  The group table was sorted.
See Also
Reference
Rhino.DocObjects.Tables Namespace