RhinoCommon API
HostUtils.SendLogMessageToCloudDelegate Delegate
 Represents a reference to a method that will be called when an exception occurs.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void SendLogMessageToCloudDelegate(
	HostUtils.LogMessageType msg_type,
	string sClass,
	string sDesc,
	string sMessage
)
Public Delegate Sub SendLogMessageToCloudDelegate (
	msg_type As HostUtils.LogMessageType,
	sClass As String,
	sDesc As String,
	sMessage As String
)
Parameters
msg_type
Type: Rhino.Runtime.HostUtils.LogMessageType
The messag type
sClass
Type: System.String
The top level message type
sDesc
Type: System.String
Finer grained description of the message.
sMessage
Type: System.String
The message.
See Also
Reference
Rhino.Runtime Namespace