RhinoCommon API
PolylineCurve Class
 Represents the geometry of a set of linked line segments.
This is fundamentally a class that derives from Curve and internally contains a Polyline.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Curve
 Rhino.Geometry.PolylineCurve
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class PolylineCurve : Curve
<SerializableAttribute>
Public Class PolylineCurve
	Inherits Curve
The PolylineCurve type exposes the following members.
Constructors
Name | Description
PolylineCurve()
 Initializes a new empty polyline curve.
PolylineCurve(IEnumerable<Point3d>)
 Initializes a new polyline curve by copying its content from another set of points.
PolylineCurve(PolylineCurve)
 Initializes a new polyline curve by copying its content from another polyline curve.
PolylineCurve(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
PointCount
 Gets the number of points in this polyline.
Top
Methods
Name | Description
CreateConvexHull2d
 Attempts to create a closed PolylineCurve that is the anti-clockwise planar convex hull of the input points. In addition, the indices of the extremal points among the input points are returned in correct order. Possible duplicates among the input points are taken care of. The input pointsThe indices into the input points such that points[hullIndices[i]] = result[i]. Since the result is a closed polyline if successful, the start/end index is repeated at the beginning and end of the hullIndices.
Return Value
Type:
 The closed PolylineCurve encompassing the input points, or null if the input points were either too few, or were found to be collinear.
Parameter
 Gets a parameter at a specified index in the polyline curve.
Point
 Gets a point at a specified index in the polyline curve.
SetArcLengthParameterization
 Sets the polyline curve to use arc length parameterization for higher quality geometry.
SetParameter
 Sets a parameter at a specified index in the polyline curve.
SetPoint
 Sets a point at a specified index in the polyline curve.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The NURBS Curves segments do not have fully multiple interior knots.
 3. Rational NURBS curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent co-linear or co-circular segments are combined.
ToArray
 Returns the underlying Polyline points as an array.
ToPolyline()
 Returns the underlying Polyline, or points.
Top
See Also
Reference
Rhino.Geometry Namespace