RhinoCommon API
HatchPattern Class
[Missing <summary> documentation for "T:Rhino.DocObjects.HatchPattern"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.HatchPattern
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public sealed class HatchPattern : ModelComponent
<SerializableAttribute>
Public NotInheritable Class HatchPattern
	Inherits ModelComponent
The HatchPattern type exposes the following members.
Constructors
Name | Description
HatchPattern()
Initializes a new instance of the HatchPattern class
HatchPattern(HatchPattern)
Initializes a new instance of the HatchPattern class
Top
Properties
Name | Description
AlwaysModelDistances
 Hatchpattern patterns are typically interpreted as distances on the printed output when printing. In this case AlwaysModelDistances is false (default). When set to true, the hatch pattern will be interpreted as being in world distances.
ComponentType
 Returns HatchPattern.
 (Overrides ModelComponent.ComponentType.)
Description
 Gets and sets a short description of the pattern.
FillType
 Gets the pattern's fill type.
HatchLineCount
 Get the number of HatchLines in the pattern.
HatchLines
 Gets all the hatch lines.
Index
 Index in the hatch pattern table for this pattern. -1 if not in the table.
 (Overrides ModelComponent.Index.)
InUse
 Returns true if the hatch pattern is in use by a Rhino object, a layer, an instance definition, or a section style.
IsDeleted
 Deleted hatch patterns are kept in the runtime hatch pattern table so that undo will work with hatch patterns. Call IsDeleted to determine to determine if a hatch pattern is deleted.
 (Overrides ModelComponent.IsDeleted.)
IsReference
 Rhino allows multiple files to be viewed simultaneously. Hatch patterns in the document are "normal" or "reference". Reference hatch patterns are not saved.
 (Overrides ModelComponent.IsReference.)
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
PatternUnitSystem
 Hatchpattern patterns are typically defined as distances on the printed output when printing. In this case PatternUnitSystem is UnitSystem.None (default). When set to any other unit system, the hatch pattern will be scaled acordingly.
UserStringCount
 Gets the amount of user strings.
Top
Methods
Name | Description
AddHatchLine
 Add a HatchLine to the pattern.
CreatePreviewGeometry
 Creates preview line segments of the hatch pattern.
DeleteAllUserStrings
DeleteUserString
GetDefaultHatchPatterns
 Gets Rhino default hatch patterns. These patterns are not in the document hatch pattern table.
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
HatchLineAt
 Gets a HatchLine at an index.
ReadFromFile
 Reads hatch pattern definitions from a file.
RemoveAllHatchLines
 Remove all of the hatch line from the pattern.
RemoveHatchLine
 Remove a hatch line from the pattern.
SetHatchLines
 Set all of the hatch lines at once. Existing hatch lines are deleted.
SetUserString
 Attach a user string (key,value combination) to this geometry.
WriteToFile(String, HatchPattern)
 Writes a hatch pattern defintion to a file.
WriteToFile(String, IEnumerable<HatchPattern>)
 Writes one or more hatch pattern defintions to a file.
Top
See Also
Reference
Rhino.DocObjects Namespace