RhinoCommon API
RenderChannels.Modes Enumeration
 Mode.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum Modes
Public Enumeration Modes
Members
Member name | Value | Description
Automatic | 0 | Render-channels are managed automatically
Custom | 1 | Render-channels are specified by the user
See Also
Reference
Rhino.Render Namespace