RhinoCommon API
ObjectPropertiesPage Class
 Base class used to add object property user interface panels
Inheritance Hierarchy
System.Object
 Rhino.UI.ObjectPropertiesPage
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class ObjectPropertiesPage
Public MustInherit Class ObjectPropertiesPage
The ObjectPropertiesPage type exposes the following members.
Constructors
Name | Description
ObjectPropertiesPage
Initializes a new instance of the ObjectPropertiesPage class
Top
Properties
Name | Description
AllObjectsMustBeSupported
 Returns false which only requires a single item of SupportedTypes to be selected. Override if you wish to change the above behavior.
EnglishPageTitle
 English string used to describe this page
Icon |  Obsolete.
 (OBSOLETE - Override PageIcon instead) Icon to display in the object properties tab control
Index
 The page navigation control adds buttons in the order the pages are processed, override this method and return a sort index to move the button to the beginning of the list. By default this returns -1 which puts the button at the end of the list.
LocalPageTitle
 Localized page description string, returns the EnglishPageTitle by default.
PageControl
 The control that represents this page. Rhino Windows supports classes that implement the IWin32Windows interface, are derived from System.Windows.FrameworkElement or Eto.Forms.Control. Mac Rhino supports controls that are derived from NSview or Eto.Forms.Control.
PageIconEmbeddedResourceString
 Resource string for a embedded icon resource in the assembly containing the page instance. If this returns a valid resource and Rhino can load the icon the loaded icon will get used directly otherwise; the PageIcon method will get called.
PageType
 Override this and return the page you want to replace a specific object properties page.
SelectedObjects
 Return a list of Rhino objects to be processed by this object properties page
SupportedTypes
 Override to specify which objects this page supports
SupportsSubObjects
 If your object properties page supports sub-object selection, you should override this method and return true. This is ignored for view pages. The default implementation returns false.
Top
Methods
Name | Description
AnySelectedObject<T>()
 Return true if any of the selected objects match the given type
AnySelectedObject<T>(Boolean)
 Return true if any of the selected objects match the given type
GetSelectedObjects(ObjectType)
 Get selected objects that match a given filter
GetSelectedObjects<T>()
 Get selected objects of a given type
InitializeControls |  Obsolete.
 Called on the active page after the selected objects list has changed to notify the page to initialize its content to reflect the new object list.
ModifyPage
 Call this method when the page is ready to modify the selected objects list. Rhino will suspend UpdatePageNotfictaion, call the passed action then restore UpdatePageNotfictaion.
OnActivate
Called when this page is activated/deactivated.
OnCreateParent
 Called when the parent container is initially created.
OnHelp
 Called when the F1 key or help button is pressed, override to display plug-in specific help for this page.
OnSizeParent
 Called when the parent containers client rectangle size has changed and the PageControl has been resized.
PageIcon
 Icon to display in the object properties tab control. Will not get called if PageIconEmbeddedResourceString is overridden and provides a string for a successfully loaded icon resource.
RunScript(ObjectPropertiesPageEventArgs)
 This method is called when scripting the Rhino Properties command and choosing this page.
RunScript(RhinoDoc, RhinoObject[]) |  Obsolete.
 This method is called when scripting the Rhino Properties command and choosing this page.
ShouldDisplay(ObjectPropertiesPageEventArgs)
 Called when the selected objects list changes, return true if the object list contains one or more object the page can modify.
ShouldDisplay(RhinoObject) |  Obsolete.
 Called when the selected objects list changes, return true if the object list contains one or more object the page can modify.
UpdatePage
 Called on the active page after the selected objects list has changed to notify the page to initialize its content to reflect the new object list.
Top
See Also
Reference
Rhino.UI Namespace