RhinoCommon API
ControlPoint Structure
 Represents control point geometry with three-dimensional position and weight.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public struct ControlPoint : IEpsilonComparable<ControlPoint>,
	IEquatable<ControlPoint>
<SerializableAttribute>
Public Structure ControlPoint
	Implements IEpsilonComparable(Of ControlPoint), IEquatable(Of ControlPoint)
The ControlPoint type exposes the following members.
Constructors
Name | Description
ControlPoint(Point3d)
 Constructs a new world 3-D, or Euclidean, control point. The 4-D representation of this is (x, y, z, 1.0).
ControlPoint(Point4d)
 Constructs a new homogeneous control point, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
ControlPoint(Point3d, Double)
 Constructs a control point from a world 3-D, or Euclidean, location and a weight. The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
ControlPoint(Double, Double, Double)
 Constructs a new world 3-D, or Euclidean, control point. The 4-D representation is (x, y, z, 1.0).
ControlPoint(Double, Double, Double, Double)
 Constructs a new homogeneous control point, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
Top
Properties
Name | Description
Location
 Gets or sets world 3-D, or Euclidean location of the control point.
Unset
 Gets the predefined, unset control point.
Weight
 Gets or sets the weight of this control point.
X
 Gets or sets the X coordinate of the control point.
Y
 Gets or sets the Y coordinate of the control point.
Z
 Gets or sets the Z coordinate of the control point.
Top
Methods
Name | Description
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(ControlPoint)
 Determines if two points exactly match.
Top
See Also
Reference
Rhino.Geometry Namespace