RhinoCommon API
File3dmRenderMaterials Class
[Missing <summary> documentation for "T:Rhino.FileIO.File3dmRenderMaterials"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmRenderMaterials
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmRenderMaterials : IEnumerable<File3dmRenderMaterial>,
	IEnumerable
Public Class File3dmRenderMaterials
	Implements IEnumerable(Of File3dmRenderMaterial), IEnumerable
The File3dmRenderMaterials type exposes the following members.
Constructors
Name | Description
File3dmRenderMaterials
Initializes a new instance of the File3dmRenderMaterials class
Top
Methods
Name | Description
Find
 Finds a material by its id, if possible. Returns null on failure.
GetEnumerator
Top
See Also
Reference
Rhino.FileIO Namespace