RhinoCommon API
RdkSelectionNavigator Class
[Missing <summary> documentation for "T:Rhino.Render.DataSources.RdkSelectionNavigator"]
Inheritance Hierarchy
System.Object
 Rhino.Render.DataSources.RdkSelectionNavigator
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class RdkSelectionNavigator : IDisposable
Public NotInheritable Class RdkSelectionNavigator
	Implements IDisposable
The RdkSelectionNavigator type exposes the following members.
Constructors
Name | Description
RdkSelectionNavigator
Initializes a new instance of the RdkSelectionNavigator class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Add
 Add a selection of contents at the current position. Clears the navigator ahead of the current position.
CanGoBackwards
 Check the backwards status of the navigator
CanGoForwards
 Check the forwards status of the navigator
Clear
 Clear the navigator.
Dispose
Releases all resources used by the RdkSelectionNavigator
Finalize |  (Overrides Object.Finalize().)
GoBackwards
 Navigate backwards if possible
GoForwards
 Navigate forwards if possible
Top
See Also
Reference
Rhino.Render.DataSources Namespace