RhinoCommon API
Group Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Group"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.Group
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class Group : ModelComponent
Public NotInheritable Class Group
	Inherits ModelComponent
The Group type exposes the following members.
Properties
Name | Description
ComponentType
 Returns Group.
 (Overrides ModelComponent.ComponentType.)
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
UserStringCount
 Gets the amount of user strings.
Top
Methods
Name | Description
DeleteAllUserStrings
DeleteUserString
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
SetUserString
 Attach a user string (key,value combination) to this geometry.
Top
See Also
Reference
Rhino.DocObjects Namespace