RhinoCommon API
GeneralSettings Class
 Contains static methods and properties to give access to Rhinoceros settings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.GeneralSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class GeneralSettings
Public NotInheritable Class GeneralSettings
The GeneralSettings type exposes the following members.
Properties
Name | Description
AutoUpdateCommandHelp
 Command help dialog auto-update feature.
ContextMenuDelay
 Time to wait before permitting context menu display.
EnableContextMenu
 true if right mouse down + delay will pop up context menu on a mouse up if no move happens.
MaximumPopupMenuLines
 Gets or sets the maximum number of popup menu lines.
MaximumUndoMemoryMb
 Gets or sets the minimum undo memory Mb.
Undo records will be purged if there are more than MinimumUndoSteps and they use more than MaximumUndoMemoryMb.
MiddleMouseMacro
 Gets or sets the toolbar to popup when the middle mouse is clicked on a view, this value is only used when MiddleMouseMode is set to PopupToolbar.
MiddleMouseMode
 Gets or sets what happens when the user clicks the middle mouse.
MiddleMousePopupToolbar
 Gets or sets the toolbar to popup when the middle mouse is clicked on a view, this value is only used when MiddleMouseMode is set to PopupToolbar.
MinimumUndoSteps
 Gets or sets the minimum undo steps.
Undo records will be purged if there are more than MinimumUndoSteps and they use more than MaximumUndoMemoryMb.
MouseSelectMode
 Gets or sets the current selection mode.
NewObjectIsoparmCount
 Gets or sets the number of isoparm curves to show on new objects.
SplitCreasedSurfaces
 Should surfaces be split into polysurfaces with smooth faces. This setting is read-only.
UseExtrusions
 Should extrusion objects be created for things like cylinders
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings.
GetDefaultState
 Gets the factory settings.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace