RhinoCommon API
SimpleArrayExtrusionPointer Class
 Wrapper for a C++ ON_SimpleArray<ON_Extrusion*> or ON_SimpleArray<constant ON_Extrusion*> If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArrayExtrusionPointer : IDisposable
Public Class SimpleArrayExtrusionPointer
	Implements IDisposable
The SimpleArrayExtrusionPointer type exposes the following members.
Constructors
Name | Description
SimpleArrayExtrusionPointer
 Initializes a new SimpleArrayExtrusionPointer instance.
Top
Properties
Name | Description
Count
 Gets the amount of Extrusions in this array.
Top
Methods
Name | Description
Add
 Adds a extrusion to the list.
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
Releases the unmanaged resources used by the SimpleArrayExtrusionPointer and optionally releases the managed resources
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToNonConstArray
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace