RhinoCommon API
SurfaceDirectionIndicators Class
 Surface direction indicators can be drawn by a display pipeline.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SurfaceDirectionIndicators
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SurfaceDirectionIndicators : IDisposable
Public Class SurfaceDirectionIndicators
	Implements IDisposable
The SurfaceDirectionIndicators type exposes the following members.
Constructors
Name | Description
SurfaceDirectionIndicators(BrepFace)
 Construct for a Brep face.
SurfaceDirectionIndicators(Surface)
 Construct for a surface.
SurfaceDirectionIndicators(NurbsSurface, Point2d)
 Construct for a Nurbs surface.
Top
Properties
Name | Description
IsValid
 Returns true if this instance is valid. The geometry that was used to create may not have been garbage collected.
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Draw
 Draw the surface directions.
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Geometry Namespace