RhinoCommon API
ObjectSectionFillRule Enumeration
 For sectioning an object; the decision of when to generate hatches and fills.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum ObjectSectionFillRule
Public Enumeration ObjectSectionFillRule
Members
Member name | Value | Description
ClosedCurves | 0 | If a the section results in a closed curve, then generate a fill
SolidObjects | 1 | Only generate a fill for objects that are considered Solid
See Also
Reference
Rhino.DocObjects Namespace