RhinoCommon API
BitmapTable Class
 Stores the list of bitmaps in a Rhino document.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<BitmapEntry>
 Rhino.DocObjects.Tables.RhinoDocCommonTable<BitmapEntry>
 Rhino.DocObjects.Tables.BitmapTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class BitmapTable : RhinoDocCommonTable<BitmapEntry>,
	ICollection<BitmapEntry>, IEnumerable<BitmapEntry>, IEnumerable
Public NotInheritable Class BitmapTable
	Inherits RhinoDocCommonTable(Of BitmapEntry)
	Implements ICollection(Of BitmapEntry), IEnumerable(Of BitmapEntry),
	IEnumerable
The BitmapTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns Image.
 (Overrides CommonComponentTable<T>.ComponentType.)
Item
 Conceptually, the bitmap table is an array of bitmaps. The operator[] can be used to get individual bitmaps.
Top
Methods
Name | Description
AddBitmap
Adds a new bitmap with specified name to the bitmap table.
Delete
 Removes the bitmap from the table.
 (Overrides CommonComponentTable<T>.Delete(T).)
DeleteBitmap
Deletes a bitmap.
ExportToFile
Writes a bitmap to a file.
ExportToFiles
Exports all the bitmaps in the table to files.
Find
 This function first attempts to find the file with "name" on the disk. If it does find it, "fileName" is set to the full path of the file and the BitmapEntry returned will be null, even if there was a BitmapEntry with "name" in the bitmap table. If the function cannot find the file on the disk, it searches the bitmap table. If it finds it, the returned BitmapEntry entry will be the entry in the table with that name. Additionally, if "createFile" is true, and an entry is found, the file will be written to the disk and it's full path will be contained in "fileName".
FindIndex
 Retrieves a BitmapEntry object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace