RhinoCommon API
ViewCaptureWriter.VectorGradientProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.VectorGradientProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void VectorGradientProc(
	IntPtr pEngine,
	IntPtr pHatch,
	float strokeWidth,
	IntPtr pHatchPattern,
	int gradientCount,
	IntPtr colors,
	IntPtr stops,
	IntPtr points,
	int linearGradient,
	int boundaryColor,
	double effectiveHatchScale
)
Public Delegate Sub VectorGradientProc (
	pEngine As IntPtr,
	pHatch As IntPtr,
	strokeWidth As Single,
	pHatchPattern As IntPtr,
	gradientCount As Integer,
	colors As IntPtr,
	stops As IntPtr,
	points As IntPtr,
	linearGradient As Integer,
	boundaryColor As Integer,
	effectiveHatchScale As Double
)
Parameters
pEngine
Type: System.IntPtr
pHatch
Type: System.IntPtr
strokeWidth
Type: System.Single
pHatchPattern
Type: System.IntPtr
gradientCount
Type: System.Int32
colors
Type: System.IntPtr
stops
Type: System.IntPtr
points
Type: System.IntPtr
linearGradient
Type: System.Int32
boundaryColor
Type: System.Int32
effectiveHatchScale
Type: System.Double
See Also
Reference
Rhino.Runtime Namespace