RhinoCommon API
CollapsibleSectionImpl.CREATEHOSTFROMCPPPROC Delegate
[Missing <summary> documentation for "T:Rhino.UI.Controls.CollapsibleSectionImpl.CREATEHOSTFROMCPPPROC"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate IntPtr CREATEHOSTFROMCPPPROC(
	IntPtr client
)
Public Delegate Function CREATEHOSTFROMCPPPROC (
	client As IntPtr
) As IntPtr
Parameters
client
Type: System.IntPtr
Return Value
Type: IntPtr
See Also
Reference
Rhino.UI.Controls Namespace