RhinoCommon API
CreatePreviewEventArgs Class
Used in RenderPlugIn virtual CreatePreview function
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.CreatePreviewEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class CreatePreviewEventArgs : EventArgs
Public Class CreatePreviewEventArgs
	Inherits EventArgs
The CreatePreviewEventArgs type exposes the following members.
Properties
Name | Description
Cancel
 Get set by Rhino if the preview generation should be canceled for this
ContentKind
 Description of content that preview is being generated for.
ContentTypeId
 The class Id of content that preview is being generated for.
Environment
 The environment that the previewed object is rendered in.
Id
Unique Id for this scene.
Lights
Objects
PreviewContent |  Obsolete.
 Obsolete, will return always null
PreviewImage
 Initially null. If this image is set, then this image will be used for the preview. If never set, the default internal simulation preview will be used.
PreviewImageSize
 Pixel size of the image that is being requested for the preview scene
PreviewNotifier
Quality
 Quality of the preview image that is being requested for the preview scene
Reason
 Reason the preview is getting generated
Viewport
Top
Methods
Name | Description
SkipInitialisation
 Call this if you don't want the argument to handle data initialisation. This is for use with the ChangeQueue
Top
See Also
Reference
Rhino.Render Namespace