RhinoCommon API
IRhRdkThumbnailList_Modes Enumeration
Note: This API is now obsolete.
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Modes"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("IRhRdkThumbnailList_Modes is obsolete", false)]
public enum IRhRdkThumbnailList_Modes
<ObsoleteAttribute("IRhRdkThumbnailList_Modes is obsolete", false)>
Public Enumeration IRhRdkThumbnailList_Modes
Members
Member name | Value | Description
Grid | 0 | Big thumbnails like Explorer icon mode (default).
List | 1 | Small thumbnails and info on right like Explorer report mode.
Tree | 2 | Tree view mode.
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace