RhinoCommon API
Utilities.ContentNewExistingFlags Enumeration
[Missing <summary> documentation for "T:Rhino.Render.Utilities.ContentNewExistingFlags"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum ContentNewExistingFlags
Public Enumeration ContentNewExistingFlags
Members
Member name | Value | Description
None | 0 |  No flags; normal usage.
HideNewTab | 1 |  Hides the 'New' tab.
HideExistingTab | 2 |  Hides the 'Existing' tab.
MultipleSelection | 4 |  Enables multiple selection.
DisableImportButton | 16 |  Disables the import button.
HideCopyOrShare | 32 |  Hides the copy/share radio buttons.
See Also
Reference
Rhino.Render Namespace