RhinoCommon API
Centermark Class
Represents a center mark dimension.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Dimension
 Rhino.Geometry.Centermark
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class Centermark : Dimension
<SerializableAttribute>
Public Class Centermark
	Inherits Dimension
The Centermark type exposes the following members.
Constructors
Name | Description
Centermark()
 Constructs a new center mark dimension.
Centermark(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Centermark(Plane, Curve, Double)
 Constructs a new center mark dimension.
Centermark(Plane, Point3d, Double)
 Constructs a new center mark dimension.
Top
Properties
Name | Description
Radius
 Gets or sets the center mark's radius.
Top
Methods
Name | Description
AdjustFromPoints
 Update dimension geometry from point locations.
Create(DimensionStyle, Plane, Curve, Double)
Creates a new center mark dimension.
Create(DimensionStyle, Plane, Point3d, Double)
Creates a new center mark dimension.
Top
See Also
Reference
Rhino.Geometry Namespace