RhinoCommon API
ImageFileEvent Enumeration
[Missing <summary> documentation for "T:Rhino.Render.ImageFileEvent"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public enum ImageFileEvent
Public Enumeration ImageFileEvent
Members
Member name | Value | Description
Saved | 0 |  Render image file has been successfully written
Loaded | 1 |  Render image file has been successfully loaded
Deleted | 2 |  Render image file was just deleted
See Also
Reference
Rhino.Render Namespace