RhinoCommon API
Dialogs Class
[Missing <summary> documentation for "T:Rhino.UI.Dialogs"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Dialogs
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class Dialogs
Public NotInheritable Class Dialogs
The Dialogs type exposes the following members.
Methods
Name | Description
KillSplash
 Destroy the splash screen if it is being displayed.
SetCustomColorDialog
ShowAboutDialog
ShowCheckListBox
 Displays Rhino's check list box.
ShowColorDialog(Color)
 Display Rhino's color selection dialog.
ShowColorDialog(Color4f, Boolean)
 Displays the standard modal color picker dialog for floating point colors.
ShowColorDialog(Color, Boolean, String)
 Display Rhino's color selection dialog.
ShowColorDialog(IWin32Window, Color4f, Boolean) |  Obsolete.
 Displays the standard modal color picker dialog for floating point colors.
ShowColorDialog(Object, Color4f, Boolean)
 Displays the standard modal color picker dialog for floating point colors.
ShowColorDialog(Color, Boolean, String, NamedColorList)
 Display Rhino's color selection dialog.
ShowColorDialog(Object, Color4f, Boolean, Dialogs.OnColorChangedEvent)
 Displays the standard modal color picker dialog for floating point colors.
ShowColorDialog(Object, Color4f, Boolean, NamedColorList, Dialogs.OnColorChangedEvent)
 Displays the standard modal color picker dialog for floating point colors.
ShowComboListBox
 Displays Rhino's combo list box.
ShowContextMenu
 Creates an ETO ContextMenu from an array of strings. Use the modes array to enable/disable menu items
ShowEditBox
 Displays Rhino's string edit box.
ShowLayerMaterialDialog
 Show a modal dialog to edit the material in the layer specified in layerIndices.
ShowLineTypes(String, String, RhinoDoc)
 Displays Rhino's LineType list box.
ShowLineTypes(String, String, RhinoDoc, Guid)
ShowListBox(String, String, IList)
 Displays Rhino's list box.
ShowListBox(String, String, IList, Object)
 Displays Rhino's list box.
ShowMessage(String, String)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessage(String, String, ShowMessageButton, ShowMessageIcon)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessage(Object, String, String, ShowMessageButton, ShowMessageIcon, ShowMessageDefaultButton, ShowMessageOptions, ShowMessageMode)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowMultiListBox
 Displays Rhino's multiple selection list box.
ShowNumberBox(String, String, Double)
 Displays Rhino's number edit box.
ShowNumberBox(String, String, Double, Double, Double)
 Displays Rhino's number edit box.
ShowPrintWidths(String, String)
 Shows the print widths dialogs
ShowPrintWidths(String, String, Double)
 Shows the print widths dialogs
ShowPropertyListBox(String, String, List<KeyValuePair<String, String>>)
 Displays Rhino's property list box.
ShowPropertyListBox(String, String, IList, IList<String>)
 Displays Rhino's property list box.
ShowSelectLayerDialog
 Displays Rhino's single layer selection dialog.
ShowSelectLinetypeDialog
 Displays Rhino's single linetype selection dialog.
ShowSelectMultipleLayersDialog
ShowSunDialog
Show the modal sun dialog.
ShowTextDialog
 Display a text dialog similar to the dialog used for the "What" command.
Top
See Also
Reference
Rhino.UI Namespace