RhinoCommon API
DimStyleTableEventArgs Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.DimStyleTableEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.Tables.DimStyleTableEventArgs
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DimStyleTableEventArgs : EventArgs
Public Class DimStyleTableEventArgs
	Inherits EventArgs
The DimStyleTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
Index
NewState
OldState
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace