RhinoCommon API
FileEpsReadOptions Class
 Options for reading a AI file (old ai files, ps not pdf)
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileEpsReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileEpsReadOptions
Public Class FileEpsReadOptions
The FileEpsReadOptions type exposes the following members.
Constructors
Name | Description
FileEpsReadOptions
Initializes a new instance of the FileEpsReadOptions class
Top
Properties
Name | Description
EpsScale
EpsUnits
PreserveModelScale
RhinoScale
Top
Methods
Name | Description
ToDictionary
Top
See Also
Reference
Rhino.FileIO Namespace