RhinoCommon API
Panels Class
 Access to Rhino panels and register custom panels
Inheritance Hierarchy
System.Object
 Rhino.UI.Panels
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class Panels
Public NotInheritable Class Panels
The Panels type exposes the following members.
Properties
Name | Description
EtoPanelStyleName
 Style applied to Eto controls hosted by the Rhino.UI.Panels and Rhino.UI.ObjectProperties systems.
IconSize
 Gets the panel icon size in logical units.
IconSizeInPixels
 Gets the panel icon size in pixels.
ScaledIconSize
 Gets the panel icon size in pixels with DPI scaling applied.
Top
Methods
Name | Description
ChangePanelIcon(Type, Icon)
 Update the icon used for a panel tab.
ChangePanelIcon(Type, String)
 Update the icon used for a panel tab.
ClosePanel(Guid)
 Will close or hide the specified panel type, in Windows Rhino, if it is the only visible tab the tab dock bar will be closed as well. In Mac Rhino it will always close the modeless dialog hosting the panel.
ClosePanel(Type)
 Will close or hide the specified panel type, in Windows Rhino, if it is the only visible tab the tab dock bar will be closed as well. In Mac Rhino it will always close the modeless dialog hosting the panel.
ClosePanel(Guid, RhinoDoc)
 Will close or hide the specified panel type, in Windows Rhino, if it is the only visible tab the tab dock bar will be closed as well. In Mac Rhino it will always close the modeless dialog hosting the panel.
ClosePanel(Type, RhinoDoc)
 Will close or hide the specified panel type, in Windows Rhino, if it is the only visible tab the tab dock bar will be closed as well. In Mac Rhino it will always close the modeless dialog hosting the panel.
DockBarIdInUse
 For internal use, call this method to see if a dock bar Id is currently being used by any Rhino dock bar. Rhino
FloatPanel(Guid, Panels.FloatPanelMode)
 Mac support: Display the specified panel in a floating window on Mac, the floating window will only contain the specified panel. Windows support: On Windows this will show or hide the floating container containing the specified panel. If the tab is docked with other tabs it will be floated in a new container.
FloatPanel(Type, Panels.FloatPanelMode)
 Mac support: Display the specified panel in a floating window on Mac, the floating window will only contain the specified panel. Windows support: On Windows this will show or hide the floating container containing the specified panel. If the tab is docked with other tabs it will be floated in a new container.
GetOpenPanelIds
 Get a list of the currently open panel tabs in Windows Rhino, on Mac Rhino it will be a list of the currently visible modeless panel dialogs.
GetPanel(Guid) |  Obsolete.
 Will return an instance of a .Net panel if the panel has been displayed at least once. Panel instances are not created until a panel is displayed.
GetPanel(Guid, RhinoDoc)
 Will return an instance of a .Net panel if the panel has been displayed at least once. Panel instances are not created until a panel is displayed.
GetPanel(Guid, UInt32)
 Will return an instance of a .Net panel if the panel has been displayed at least once. Panel instances are not created until a panel is displayed.
GetPanel<T>() |  Obsolete.
 Return an instance of a .Net panel
GetPanel<T>(RhinoDoc)
 Return an instance of a .Net panel
GetPanel<T>(UInt32)
 Return an instance of a .Net panel
GetPanels(Guid, RhinoDoc)
 Gets the panels.
GetPanels(Guid, UInt32)
 Gets the panels.
GetPanels<T>(RhinoDoc)
GetPanels<T>(UInt32)
 Gets the panels.
IsHiding
 Check to see if reason is equal to any of the show events
IsPanelVisible(Guid)
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
IsPanelVisible(Type)
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
IsPanelVisible(Guid, Boolean)
 Check to see if a panel is currently visible, if isSelectedTab is true then the tab must be the active tab as well.
IsPanelVisible(Type, Boolean)
 Check to see if a panel is currently visible, if isSelectedTab is true then the tab must be the active tab as well.
IsShowing
 Check to see if reason is equal to any of the hide events
OnClosePanel
 Call this method to raise the Closed event
OnShowPanel
 Call this method to raise the Show event
OpenPanel(Guid)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
OpenPanel(Type)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
OpenPanel(Guid, Boolean)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
OpenPanel(Guid, Guid)
 In Mac Rhino this will just call the version of OpenPanel that takes a class type Id. In Windows Rhino this will look for a dock bar with the specified Id and open or move the specified panel to that dock bar.
OpenPanel(Guid, Type)
 In Mac Rhino this will just call the version of OpenPanel that takes a class type Id. In Windows Rhino this will look for a dock bar with the specified Id and open or move the specified panel to that dock bar.
OpenPanel(Type, Boolean)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
OpenPanel(Guid, Guid, Boolean)
 In Mac Rhino this will just call the version of OpenPanel that takes a class type Id. In Windows Rhino this will look for a dock bar with the specified Id and open or move the specified panel to that dock bar.
OpenPanel(Guid, Type, Boolean)
 In Mac Rhino this will just call the version of OpenPanel that takes a class type Id. In Windows Rhino this will look for a dock bar with the specified Id and open or move the specified panel to that dock bar.
OpenPanelAsSibling(Guid, Guid)
 In Mac Rhino this will currently just call OpenPanel, in Windows Rhino this will look for a dock bar which contains the sibling panel and add this panel to that dock bar as necessary, if the panel was in another dock bar it will be moved to this dock bar.
OpenPanelAsSibling(Guid, Guid, Boolean)
 In Mac Rhino this will currently just call OpenPanel, in Windows Rhino this will look for a dock bar which contains the sibling panel and add this panel to that dock bar as necessary, if the panel was in another dock bar it will be moved to this dock bar.
PanelDockBar(Guid)
 Will always return Guid.Empty in Mac Rhino. In Windows Rhino it will look for the dock bar which contains the specified panel class Id and return the dock bar Id.
PanelDockBar(Type)
 Will always return Guid.Empty in Mac Rhino. In Windows Rhino it will look for the dock bar which contains the specified panel class Id and return the dock bar Id.
PanelDockBars
 Will always return a empty array in Mac Rhino. In Windows Rhino it will look for any panel dock bars that contain the specified panel class Id and return the dock bar Id's.
RegisterPanel(PlugIn, Type, String, Icon)
 You typically register your panel class in your plug-in's OnLoad function. This will register your custom call with Rhino, Rhino will create an instance of your class the first time your panel is created and embed this instance of your class in a panel container.
RegisterPanel(PlugIn, Type, String, Icon, PanelType)
 Call once to register a panel type which will get dynamically created and embedded in a Rhino docking/floating location.
RegisterPanel(PlugIn, Type, String, Assembly, String, PanelType)
 You typically register your panel class in your plug-in's OnLoad function. This will register your custom call with Rhino, Rhino will create an instance of your class the first time your panel is created and embed this instance of your class in a panel container.
Top
Events
Name | Description
Closed
 This event is raised when a panel host is closed
Show
 This event is called when a panel is shown or hidden. This event will get raised multipThis times when the active document changes in Mac Rhino. It will called with show equal to false for the previous active document and with show equal to true for the current document. When the event is raised with show equal to false it only means the document instance of the panel is not visible it does not mean the panel host has been closed. If you need to know when the panel host closes then subscribe to the Closed event.
Top
See Also
Reference
Rhino.UI Namespace