RhinoCommon API
FileSkpWriteOptions Class
 Options used when writing a Skp file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileSkpWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileSkpWriteOptions
Public Class FileSkpWriteOptions
The FileSkpWriteOptions type exposes the following members.
Constructors
Name | Description
FileSkpWriteOptions
Initializes a new instance of the FileSkpWriteOptions class
Top
Properties
Name | Description
ExportPlanarRegionsAsPolygons
GroupObjects
MaxAngle
Version
 Set the version of the skp file being written.
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace