RhinoCommon API
SimpleArrayGuidPointer Class
 Wrapper for ON_SimpleArray<ON_UUID>. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArrayGuidPointer : IDisposable
Public Class SimpleArrayGuidPointer
	Implements IDisposable
The SimpleArrayGuidPointer type exposes the following members.
Constructors
Name | Description
SimpleArrayGuidPointer
 Initializes a new SimpleArrayGuidPointer class.
Top
Properties
Name | Description
Count
 Gets the amount of elements in this array.
Item
 Get the Guid at index
Top
Methods
Name | Description
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToArray
 Returns the managed counterpart of the unmanaged array.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace