RhinoCommon API
DimStyleTable Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.DimStyleTable"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<DimensionStyle>
 Rhino.DocObjects.Tables.RhinoDocCommonTable<DimensionStyle>
 Rhino.DocObjects.Tables.DimStyleTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class DimStyleTable : RhinoDocCommonTable<DimensionStyle>,
	ICollection<DimensionStyle>, IEnumerable<DimensionStyle>, IEnumerable
Public NotInheritable Class DimStyleTable
	Inherits RhinoDocCommonTable(Of DimensionStyle)
	Implements ICollection(Of DimensionStyle), IEnumerable(Of DimensionStyle),
	IEnumerable
The DimStyleTable type exposes the following members.
Properties
Name | Description
BuiltInStyles
 Creates an array of default DimensionStyle objects
ComponentType
 Returns DimStyle.
 (Overrides CommonComponentTable<T>.ComponentType.)
Current
 Returns an instance of the current DimensionStyle.
CurrentDimensionStyle |  Obsolete.
 Do not use. Use the Current property.
CurrentId
CurrentIndex
Item
Top
Methods
Name | Description
Add(String)
 Adds a new AnnotationStyle to the document. The new AnnotationStyle will be initialized with the current default AnnotationStyle properties.
Add(DimensionStyle, Boolean)
 Adds a new DimensionStyle to the document.
Add(String, Boolean)
 Adds a new AnnotationStyle to the document. The new AnnotationStyle will be initialized with the current default AnnotationStyle properties.
Delete(DimensionStyle)
 Removes an annotation style.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32, Boolean)
Find(Guid, Boolean)
Find(String, Boolean) |  Obsolete.
FindIndex
 Retrieves a DimensionStyle object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds the DimensionStyle with a given name and returns it. None is returned if no DimensionStyle is found.
FindRoot
GetEnumerator |  (Overrides CommonComponentTable<T>.GetEnumerator().)
GetUnusedStyleName()
 Get a unique name for a style that does not already exist in the DimStyle table
GetUnusedStyleName(String)
 Get a unique name for a dimension style that does not already exist in the DimStyle table
Modify(DimensionStyle, AnnotationBase)
Modify(DimensionStyle, Guid, Boolean)
Modifies dimension style settings.
Modify(DimensionStyle, Int32, Boolean)
Modifies dimension style settings.
PurgeUnused
 Purges any unused dimension styles.
SetCurrent
 Sets the Current property.
SetCurrentDimensionStyleIndex |  Obsolete.
 Do not use. Use the SetCurrent(Int32, Boolean) method.
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace