RhinoCommon API
UserInterfaceCheckBox Class
 Draws a check box with optional text beside it. Clicking anywhere on the control changes the state and raises the CheckedChanged event.
Inheritance Hierarchy
System.Object
 Rhino.UI.UserInterfaceObjectBase
 Rhino.UI.UserInterfaceControl
 Rhino.UI.UserInterfaceCheckBox
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class UserInterfaceCheckBox : UserInterfaceControl
Public Class UserInterfaceCheckBox
	Inherits UserInterfaceControl
The UserInterfaceCheckBox type exposes the following members.
Constructors
Name | Description
UserInterfaceCheckBox()
Initializes a new instance of the UserInterfaceCheckBox class
UserInterfaceCheckBox(String)
Initializes a new instance of the UserInterfaceCheckBox class
Top
Properties
Name | Description
Checked
 Convenience for the two state case. Checked is true when the state is On, and an indeterminate check box is not checked.
CheckState
 State of the check box. Setting the state does not raise CheckedChanged; that is only for a state the user changed by clicking.
Top
Methods
Name | Description
OnCheckedChanged
 Called after a click has changed the state. A click turns an indeterminate check box on. The default implementation raises the CheckedChanged event.
Top
Events
Name | Description
CheckedChanged
 Event triggered when a click changes the state of the check box
Top
See Also
Reference
Rhino.UI Namespace