RhinoCommon API
HermiteSurface Class
 Create an ON_NurbsSurface satisfying Hermite interpolation conditions at a grid of points.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.HermiteSurface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class HermiteSurface : IDisposable
Public Class HermiteSurface
	Implements IDisposable
The HermiteSurface type exposes the following members.
Constructors
Name | Description
HermiteSurface()
 Initializes a new HermiteSurface instance.
HermiteSurface(Int32, Int32)
 Initializes a new HermiteSurface instance.
Top
Properties
Name | Description
IsValid
 Returns true if the all of values in all of the internal data structures contain valid values, false otherwise.
UCount
 Gets the number of parameters in the "u" direction.
VCount
 Gets the number of parameters in the "v" direction.
Top
Methods
Name | Description
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
PointAt
 Gets the interpolation point at the u,v parameter location.
SetPointAt
 Sets the interpolation point at the u,v parameter location.
SetTwistAt
 Set the twist direction (mixed second partial derivative) to interpolate at the u,v parameter location.
SetUParameterAt
 Sets the "u" parameter at an index. These parameters are strictly increasing.
SetUTangentAt
 Set the "u" tangent direction (actually first derivative) to interpolate at the u,v parameter location.
SetVParameterAt
 Sets the "v" parameter at an index. These parameters are strictly increasing.
SetVTangentAt
 Set the "v" tangent direction (actually first derivative) to interpolate at the u,v parameter location.
ToNurbsSurface
 Constructs a NURBS surface satisfying the Hermite interpolation conditions.
TwistAt
 Get the twist direction (mixed second partial derivative) to interpolate at the u,v parameter location.
UParameterAt
 Gets the "u" parameter at an index. These parameters are strictly increasing.
UTangentAt
 Get the "u" tangent direction (actually first derivative) to interpolate at the u,v parameter location.
VParameterAt
 Gets the "v" parameter at an index. These parameters are strictly increasing.
VTangentAt
 Get the "v" tangent direction (actually first derivative) to interpolate at the u,v parameter location.
Top
See Also
Reference
Rhino.Geometry Namespace