RhinoCommon API
File3dmPlugInDetails Class
 Details about Rhino a Rhino plug-in that was loaded in the Rhino process when a 3dm file is saved
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmPlugInDetails
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmPlugInDetails
Public Class File3dmPlugInDetails
The File3dmPlugInDetails type exposes the following members.
Constructors
Name | Description
File3dmPlugInDetails
Initializes a new instance of the File3dmPlugInDetails class
Top
Properties
Name | Description
Filename
The plug-in's binary filename
Id
Plug-in Id
Name
Public facing name of the plug-in
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace