RhinoCommon API
UserDataListEnumerator Class
 Enumerator for UserDataList
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Custom.UserDataListEnumerator
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class UserDataListEnumerator : IEnumerator<UserData>,
	IDisposable, IEnumerator
Public Class UserDataListEnumerator
	Implements IEnumerator(Of UserData), IDisposable,
	IEnumerator
The UserDataListEnumerator type exposes the following members.
Constructors
Name | Description
UserDataListEnumerator
 Create new UserDataListEnumerator
Top
Properties
Name | Description
Current
 Get current UserData on the enumerator.
Top
Methods
Name | Description
Dispose
 Implement Dispose(). NOP.
MoveNext
 Advance enumerator to next UserData item.
Reset
 Reset the enumerator
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace