RhinoCommon API
RenderMaterial.BasicMaterialParameterNames Class
 Parameter names for use in GetNamedParameter and SetNamedParameter with basic materials.
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderMaterial.BasicMaterialParameterNames
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class BasicMaterialParameterNames
Public Class BasicMaterialParameterNames
The RenderMaterial.BasicMaterialParameterNames type exposes the following members.
Constructors
Name | Description
RenderMaterial.BasicMaterialParameterNames
Initializes a new instance of the RenderMaterial.BasicMaterialParameterNames class
Top
Methods
Name | Description
Top
Fields
Name | Description
Ambient
Diffuse
DisableLighting
Emission
FlamingoLibrary
Ior
Reflectivity
ReflectivityColor
Shine
Specular
Transparency
TransparencyColor
Top
See Also
Reference
Rhino.Render Namespace