RhinoCommon API
HatchLine Class
 Hatch lines are used by hatch pattern to specify the dashes and offset patterns of the lines.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.HatchLine
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public class HatchLine : IDisposable
Public Class HatchLine
	Implements IDisposable
The HatchLine type exposes the following members.
Constructors
Name | Description
HatchLine()
 Construts a new hatch line.
HatchLine(HatchLine)
 Construts a new hatch line.
Top
Properties
Name | Description
Angle
 Gets and sets the angle, in radians, of the hatch line. The angle is measured counter-clockwise from the x-axis.
BasePoint
 Get and sets this line's 2d base point.
DashCount
 Gets the number of dashes + gaps in this line.
GetDashes
 Gets all of the dashes.
IsValid
 Verifies a hatch line is valid.
Offset
 Get and sets this line's 2d offset for line repetitions. Offset.X is shift parallel to line. Offset.Y is spacing perpendicular to line.
PatternLength
 Get the total length of a pattern repeat.
Top
Methods
Name | Description
AppendDash
 Add a dash to the pattern.
DashAt
 Get the dash length at the specified index.
Dispose()
 Actively releases the unmanaged object.
Dispose(Boolean)
 Releases the unmanaged object.
Finalize
 Passively releases the unmanaged object.
 (Overrides Object.Finalize().)
SetDashes
 Sets a new dash array.
Top
Remarks
 Each line has the following information: Angle is the direction of the line counter-clockwise from the x-axis. The first line origin is at the base point. Each line repetition is offset from the previous line. Offset.X is parallel to the line and Offset.Y is perpendicular to the line. The base and offset values are rotated by the line's angle to produce a location in the hatch pattern's coordinate system. There can be gaps and dashes specified for drawing the line. If there are no dashes, the line is solid. Negative length dashes are gaps. Positive length dashes are drawn as line segments.
See Also
Reference
Rhino.DocObjects Namespace