RhinoCommon API
LinetypeTableEventType Enumeration
 LinetypeTable event types
Since: 8.0
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LinetypeTableEventType
Public Enumeration LinetypeTableEventType
Members
Member name | Value | Description
Added | 0 |  A linetype was added.
Deleted | 1 |  A linetype was deleted.
Undeleted | 2 |  A linetype was undeleted.
Modified | 3 |  A linetype was modified.
Sorted | 4 |  The linetype table was sorted.
Current | 5 |  The current linetype has changed.
See Also
Reference
Rhino.DocObjects.Tables Namespace