RhinoCommon API
File3dmCommonComponentTable<T> Class
 Provides a base table type that is shared among all File3dm tables.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<T>
 Rhino.FileIO.File3dmCommonComponentTable<T>
 More...
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class File3dmCommonComponentTable<T> : CommonComponentTable<T>,
	ICollection<T>, IEnumerable<T>, IEnumerable
where T : ModelComponent
Public MustInherit Class File3dmCommonComponentTable(Of T As ModelComponent)
	Inherits CommonComponentTable(Of T)
	Implements ICollection(Of T), IEnumerable(Of T),
	IEnumerable
Type Parameters
T
A model component.
The File3dmCommonComponentTable<T> type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Add
 Adds an item.
Delete(T)
 Flags a component as deleted.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32)
 Flags a component as deleted.
Dump
Prepares a text dump of object table.
Top
See Also
Reference
Rhino.FileIO Namespace
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<T>
 Rhino.FileIO.File3dmCommonComponentTable<T>
 Rhino.FileIO.File3dmDimStyleTable
 Rhino.FileIO.File3dmGroupTable
 Rhino.FileIO.File3dmHatchPatternTable
 Rhino.FileIO.File3dmInstanceDefinitionTable
 Rhino.FileIO.File3dmLayerTable
 Rhino.FileIO.File3dmLinetypeTable
 Rhino.FileIO.File3dmMaterialTable
 Rhino.FileIO.File3dmObjectTable