RhinoCommon API
FileTxtReadOptions.DelimiterMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileTxtReadOptions.DelimiterMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum DelimiterMode
Public Enumeration DelimiterMode
Members
Member name | Value | Description
Comma | 0
Semicolon | 1
Space | 2
Tab | 3
Other | 4
Automatic | 5
See Also
Reference
Rhino.FileIO Namespace