RhinoCommon API
RhinoAfterTransformObjectsEventArgs Class
 EventArgs passed to RhinoDoc.AfterTransform.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoAfterTransformObjectsEventArgs
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public class RhinoAfterTransformObjectsEventArgs : EventArgs
Public Class RhinoAfterTransformObjectsEventArgs
	Inherits EventArgs
The RhinoAfterTransformObjectsEventArgs type exposes the following members.
Properties
Name | Description
TransformEventId
 The transformation event id.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace