RhinoCommon API
Projection Enumeration
 When a mapping primitive, like a plane, sphere, box, or cylinder, is used, there are two projection options. If m_type = srfp_mapping, then m_projection is ignored.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public enum Projection
Public Enumeration Projection
Members
Member name | Value | Description
None | 0 |  None
ClosestPoint | 1 |  ClosestPoint: world xyz maps to the point on the mapping primitive that is closest to xyz. In this case, ON_TextureMapping::Evaluate ignores the vector argument.
Ray | 2 |  Ray: world xyz + world vector defines a world line. The world line is intersected with the mapping primitive and the intersection point that is closest to the world xyz point is used to calculate the mapping parameters.
See Also
Reference
Rhino.Render Namespace