RhinoCommon API
FileIgsWriteOptions.EolMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileIgsWriteOptions.EolMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum EolMode
Public Enumeration EolMode
Members
Member name | Value | Description
Crlf | 1
Cr | 2
Lf | 3
See Also
Reference
Rhino.FileIO Namespace