RhinoCommon API
BrepReplaceEdgeMethod Enumeration
 How a deleted edge is re-trimmed by ReplaceEdge(IEnumerable<Int32>, BrepReplaceEdgeMethod, Curve, Double). Equivalent to the options of the ReplaceEdge command.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum BrepReplaceEdgeMethod
Public Enumeration BrepReplaceEdgeMethod
Members
Member name | Value | Description
Line | 0 | Replace the edge with a straight line across the gap.
ExtendSideEdges | 1 | Extend the two adjacent edges until they meet.
Curve | 2 | Replace the edge with a supplied curve.
See Also
Reference
Rhino.Geometry Namespace