RhinoCommon API
DracoCompression Class
 Google Draco compression for mesh and point cloud data
Inheritance Hierarchy
System.Object
 Rhino.FileIO.DracoCompression
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DracoCompression : IDisposable
Public Class DracoCompression
	Implements IDisposable
The DracoCompression type exposes the following members.
Properties
Name | Description
NormalAttributePosition
 The attribute position for normals when compressed
TextureCoordinatesAttributePosition
 The attribute position for texture coordinates when compressed
VertexAttributePosition
 The attribute position for vertices when compressed
VertexColorAttributePosition
 The attribute position for vertex colors when compressed
Top
Methods
Name | Description
Compress(Mesh)
 Compress a mesh using default compression options.
Compress(PointCloud)
 Compress a point cloud
Compress(Mesh, DracoCompressionOptions)
 Compress a mesh
Compress(PointCloud, DracoCompressionOptions)
 Compress a point cloud
DecompressBase64String
 Decompress base64 encoded version of Draco data into either a mesh or point cloud
DecompressByteArray
 Decompress data into either a mesh or point cloud.
DecompressFile
 Read compressed data from disk and decompress to RhinoCommon geometry
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Finalizer for DracoCompression
 (Overrides Object.Finalize().)
ToBase64String
 Convert byte array of Draco compressed data into a base64 encoded string
ToByteArray
 Gets the Draco compressed data as a byte array
Write
 Write the compressed data to disk
Top
See Also
Reference
Rhino.FileIO Namespace