RhinoCommon API
MeshType Enumeration
 Defines enumerated values for various mesh types.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum MeshType
Public Enumeration MeshType
Members
Member name | Value | Description
Default | 0 |  The default mesh.
Render | 1 |  The render mesh.
Analysis | 2 |  The analysis mesh.
Preview | 3 |  The preview mesh.
Any | 4 |  Any mesh that is available.
See Also
Reference
Rhino.Geometry Namespace