RhinoCommon API
PersistentSettingsEventArgs Class
 Represents event data that is passed as state in persistent settings events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.PersistentSettingsEventArgs
 Rhino.PersistentSettingsEventArgs<T>
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class PersistentSettingsEventArgs : EventArgs
Public MustInherit Class PersistentSettingsEventArgs
	Inherits EventArgs
The PersistentSettingsEventArgs type exposes the following members.
Constructors
Name | Description
PersistentSettingsEventArgs
Initializes a new instance of the PersistentSettingsEventArgs class
Top
Properties
Name | Description
Cancel
Top
Methods
Name | Description
Top
See Also
Reference
Rhino Namespace