RhinoCommon API
ToolbarGroup Class
 Represents a toolbar group in a Rhino toolbar, or .RUI, file.
Inheritance Hierarchy
System.Object
 Rhino.UI.ToolbarGroup
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public sealed class ToolbarGroup
Public NotInheritable Class ToolbarGroup
The ToolbarGroup type exposes the following members.
Properties
Name | Description
Id
 Gets the id of the toolbar group.
IsDocked
 Returns true if the toolbar group is docked.
Name
 Gets the name of the toolbar group.
Visible
 Gets and sets a toolbar group's visibility.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace