RhinoCommon API
FileSat Class
 Support for writing Sat file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileSat
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileSat
Public NotInheritable Class FileSat
The FileSat type exposes the following members.
Methods
Name | Description
Write
Write a Sat file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace