RhinoCommon API
ObjectSectionAttributesSource Enumeration
 The source of sectioning attributes on an object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum ObjectSectionAttributesSource
Public Enumeration ObjectSectionAttributesSource
Members
Member name | Value | Description
FromLayer | 0 | Section attributes defined by object's layer
FromObject | 1 | Section attributes are specific to the object
FromParent | 2 | Section attributes defined by object's parent
FromSectioner | 3 | Section attributes defined by the cutting object
See Also
Reference
Rhino.DocObjects Namespace