RhinoCommon API
UserInterfaceControl Class
 User interface controls are in-viewport control that act similar to controls you would find in most GUI frameworks. These are 2d screen aligned controls like buttons, labels and sliders
Inheritance Hierarchy
System.Object
 Rhino.UI.UserInterfaceObjectBase
 Rhino.UI.UserInterfaceControl
 More...
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class UserInterfaceControl : UserInterfaceObjectBase
Public Class UserInterfaceControl
	Inherits UserInterfaceObjectBase
The UserInterfaceControl type exposes the following members.
Constructors
Name | Description
UserInterfaceControl
Initializes a new instance of the UserInterfaceControl class
Top
Properties
Name | Description
BackgroundColor
 Color the control is filled with: the face of a button, the track of a slider, the box of a check box or radio button, the field of a text box, the whole rectangle of a label, icon or grid. Color.Empty, the default, means the control chooses the color for the theme that is in use and follows the theme when it changes. Labels and icons draw no background when this is Color.Empty. A grid fills with the theme's panel color when it is a top level control, and draws no background when it is inside another control. UserInterfaceGrid.BackgroundOpacity makes the theme color see through, or turns the background off at 0.
HorizontalAlignment
Location
Size
Text
TextColor
 Color used to draw the text. Color.Empty, the default, means use the standard text color for the theme that is in use.
TextHeight
 Height of the text in logical pixels. A value of 0, the default, means use the standard control font height. Controls that draw no text ignore this setting.
TextHorizontalAlignment
 Where the text sits inside the control's rectangle. This is not the same as HorizontalAlignment, which is where the control sits inside its parent.
TextVerticalAlignment
 Where the text sits inside the control's rectangle. This is not the same as VerticalAlignment, which is where the control sits inside its parent.
TrackingPoint
 3d location that control "sticks" to if not null
VerticalAlignment
Top
Methods
Name | Description
ComputedRectangle
SetSvg
Top
See Also
Reference
Rhino.UI Namespace
Inheritance Hierarchy
System.Object
 Rhino.UI.UserInterfaceObjectBase
 Rhino.UI.UserInterfaceControl
 Rhino.UI.UserInterfaceButton
 Rhino.UI.UserInterfaceCheckBox
 Rhino.UI.UserInterfaceGrid
 Rhino.UI.UserInterfaceIcon
 Rhino.UI.UserInterfaceLabel
 Rhino.UI.UserInterfaceRadioButton
 Rhino.UI.UserInterfaceSlider
 Rhino.UI.UserInterfaceTextBox