RhinoCommon API
HostUtils.ExceptionReportDelegate Delegate
 Represents a reference to a method that will be called when an exception occurs.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void ExceptionReportDelegate(
	string source,
	Exception ex
)
Public Delegate Sub ExceptionReportDelegate (
	source As String,
	ex As Exception
)
Parameters
source
Type: System.String
An exception source text.
ex
Type: System.Exception
An exception.
See Also
Reference
Rhino.Runtime Namespace