RhinoCommon API
PanelType Enumeration
 Panel type
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public enum PanelType
Public Enumeration PanelType
Members
Member name | Value | Description
PerDoc | 0 |  Default panel type, creates a panel instance per document
System | 1 |  A System panel may appear in one or more container but the panel will be used for all open documents
See Also
Reference
Rhino.UI Namespace