RhinoCommon API
DimensionStyle.AngleDisplayFormat Enumeration
 Display format for angles
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum AngleDisplayFormat
Public Enumeration AngleDisplayFormat
Members
Member name | Value | Description
DecimalDegrees | 0 |  Decimal Degrees
DegMinSec | 1 |  Degrees Minutes Seconds
Radians | 2 |  Decimal Radians
Grads | 3 |  Decimal Gradians
See Also
Reference
Rhino.DocObjects Namespace