RhinoCommon API
it_strategy Enumeration
 Defines the collection type to iterate.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum it_strategy
Public Enumeration it_strategy
Members
Member name | Value | Description
ContentDataBase | 0 |  This type represents all the render contents in the database.
ContentSelection | 1 |  This type represents the selected render content collection.
See Also
Reference
Rhino.Render Namespace