RhinoCommon API
DisplayPointAttributes Class
[Missing <summary> documentation for "T:Rhino.Display.DisplayPointAttributes"]
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayPointAttributes
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DisplayPointAttributes
Public Class DisplayPointAttributes
The DisplayPointAttributes type exposes the following members.
Constructors
Name | Description
DisplayPointAttributes()
Initializes a new instance of the DisplayPointAttributes class
DisplayPointAttributes(DisplayPointAttributes)
Initializes a new instance of the DisplayPointAttributes class
Top
Properties
Name | Description
Diameter
FillColor
PointStyle
RotationRadians
SecondarySize
StrokeColor
StrokeWidth
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace