RhinoCommon API
FileVda Class
 Support for writing Igs file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileVda
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileVda
Public NotInheritable Class FileVda
The FileVda type exposes the following members.
Methods
Name | Description
Write
Write a Vda file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace