RhinoCommon API
ViewUserInterfaceTable Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.ViewUserInterfaceTable"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.ViewUserInterfaceTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class ViewUserInterfaceTable
Public NotInheritable Class ViewUserInterfaceTable
The ViewUserInterfaceTable type exposes the following members.
Properties
Name | Description
Document
Document that owns this object table.
Top
Methods
Name | Description
Add(UserInterfaceObjectBase)
Add(UserInterfaceObjectBase, Guid)
Find<T>
Remove(IEnumerable<UserInterfaceObjectBase>)
Remove(UserInterfaceObjectBase)
RemoveByGroupId
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace