RhinoCommon API
MeshIntersectionCache Class
 Provides a mechanism for lazily evaluating mesh data.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Intersect.MeshIntersectionCache
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public class MeshIntersectionCache : IDisposable
Public Class MeshIntersectionCache
	Implements IDisposable
The MeshIntersectionCache type exposes the following members.
Constructors
Name | Description
MeshIntersectionCache
 Provides a mechanism for lazily evaluating mesh data. The implementation is private and subject to change.
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 Disposes the mesh intersection cache.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Geometry.Intersect Namespace