RhinoCommon API
MeshNgonList Class
 Provides access to the ngons and ngon-related functionality of a Mesh. See also the Ngons property for Ngon functionality details.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.MeshNgonList
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MeshNgonList : IResizableList<MeshNgon>,
	IList<MeshNgon>, ICollection<MeshNgon>, IEnumerable<MeshNgon>,
	IEnumerable, IList, ICollection, IReadOnlyList<MeshNgon>,
	IReadOnlyCollection<MeshNgon>
Public Class MeshNgonList
	Implements IResizableList(Of MeshNgon), IList(Of MeshNgon),
	ICollection(Of MeshNgon), IEnumerable(Of MeshNgon), IEnumerable,
	IList, ICollection, IReadOnlyList(Of MeshNgon), IReadOnlyCollection(Of MeshNgon)
The MeshNgonList type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of mesh ngons.
Item
 Returns the mesh ngon at the given index.
UnsignedCount
 Gets or sets the number of mesh ngons.
Top
Methods
Name | Description
AddNgon
 Appends a new ngon to the end of the mesh ngon list.
AddNgons
 Appends a list of ngons to the end of the mesh ngon list.
AddPlanarNgons(Double)
 Add an ngon for each group of connected coplanar faces.
AddPlanarNgons(Double, Int32, Int32, Boolean)
 Add an ngon for each group of connected coplanar faces.
Clear
 Clears the Ngon list on the mesh.
GetEnumerator
 Gets an enumerator that yields all ngons in this collection.
GetNgon
 Returns the mesh ngon at the given index.
GetNgonBoundary
 Get a list of vertices that form the boundary of a face set. This is often use to get ngon boundaries.
GetNgonBoundingBox(Int32)
 Gets the bounding box of an ngon.
GetNgonBoundingBox(MeshNgon)
 Gets the bounding box of an ngon.
GetNgonCenter(Int32)
 Gets the center point of an ngon.
This the average of the corner points.
GetNgonCenter(MeshNgon)
 Gets the center point of an ngon.
This the average of the corner points.
GetNgonEdgeCount
 Gets the complete edge count of an ngon.
GetNgonOuterEdgeCount
 Gets the outer edge count of an ngon.
Insert
 Inserts a mesh ngon at a defined index in this list.
IsValid(Int32)
 Tests an ngon to see if the vertex and face references are valid and pass partial boundary validity checks.
IsValid(Int32, TextLog)
 Tests an ngon to see if the vertex and face references are valid and pass partial boundary validity checks.
NgonBoundaryVertexList
 Get an ngon's boundary points.
NgonHasHoles
 Determines whether a ngon has holes.
NgonIndexFromFaceIndex
 Returns the index of a mesh ngon the face belongs to.
Orientation
 Determine if the ngon's boundary orientation matches that of the set of faces it is made from.
RemoveAllNgons
 Removes all ngons from the mesh.
RemoveAt
 Removes an ngon from the mesh.
RemoveNgons
 Remove one or more ngons from the mesh.
ReverseOuterBoundary
 Reverse the order of the m_vi[] array for an ngon
SetNgon
 Set an ngon in this list.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace