RhinoCommon API
File3dmDimStyleTable Class
 Provides access to annotation styles in the 3dm file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<DimensionStyle>
 Rhino.FileIO.File3dmCommonComponentTable<DimensionStyle>
 Rhino.FileIO.File3dmDimStyleTable
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmDimStyleTable : File3dmCommonComponentTable<DimensionStyle>,
	IList<DimensionStyle>, ICollection<DimensionStyle>, IEnumerable<DimensionStyle>,
	IEnumerable
Public Class File3dmDimStyleTable
	Inherits File3dmCommonComponentTable(Of DimensionStyle)
	Implements IList(Of DimensionStyle), ICollection(Of DimensionStyle),
	IEnumerable(Of DimensionStyle), IEnumerable
The File3dmDimStyleTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns DimStyle.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
Methods
Name | Description
FindIndex
 Retrieves a DimensionStyle object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds a DimensionStyle given its name.
FindNameHash
 Finds a DimensionStyle given its name hash.
Top
See Also
Reference
Rhino.FileIO Namespace