RhinoCommon API
ColorRGBA Structure
 Represents a sRGBA (Red, Green, Blue, Alpha) color with double precision floating point channel.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public struct ColorRGBA : ISerializable, IFormattable,
	IComparable, IComparable<ColorRGBA>, IEquatable<ColorRGBA>,
	IEpsilonComparable<ColorRGBA>
<SerializableAttribute>
Public Structure ColorRGBA
	Implements ISerializable, IFormattable, IComparable, IComparable(Of ColorRGBA),
	IEquatable(Of ColorRGBA), IEpsilonComparable(Of ColorRGBA)
The ColorRGBA type exposes the following members.
Constructors
Name | Description
ColorRGBA(Color)
 Constructs a new instance of ColorRGBA that is equivalent to an ARGB color.
ColorRGBA(ColorRGBA)
Initializes a new instance of the ColorRGBA class
ColorRGBA(Int32)
 Constructs a new instance of ColorRGBA that is equivalent to an ARGB color.
ColorRGBA(ColorRGBA, Double)
Initializes a new instance of the ColorRGBA class
ColorRGBA(Double, Double, Double)
Initializes a new instance of the ColorRGBA class
ColorRGBA(Double, Double, Double, Double)
Initializes a new instance of the ColorRGBA class
Top
Properties
Name | Description
A
 Gets or sets the alpha channel value. Alpha channels are limited to a 0~1 range.
B
 Gets or sets the blue channel value. Blue channels are limited to a 0~1 range.
Black
Blue
G
 Gets or sets the green channel value. Green channels are limited to a 0~1 range.
Green
R
 Gets or sets the red channel value. Red channels are limited to a 0~1 range.
Red
White
Top
Methods
Name | Description
ApplyGamma
BlendTo
CompareTo
 Compares this ColorRGBA with another ColorRGBA.
Channels evaluation priority is first A, then R, then G, then B.
CreateFromArgb(Byte, Byte, Byte)
 Constructs a RGBA color from the specified 8-bit components (red, green, and blue) values. The alpha value is implicitly 1.0 (fully opaque).
CreateFromArgb(Byte, Byte, Byte, Byte)
 Constructs a RGBA color from the four ARGB components (alpha, red, green, and blue) values.
CreateFromCMYK
 Create the nearest RGBA equivalent of a CMYK color.
CreateFromHSL
 Constructs the nearest RGBA equivalent of an HSV color.
CreateFromHSV
 Constructs the nearest RGBA equivalent of an HSL color.
CreateFromLAB
 Create the nearest RGBA equivalent of a LAB color.
CreateFromLCH
 Create the nearest RGBA equivalent of a LCH color.
CreateFromXYZ
 Create the nearest RGBA equivalent of an XYZ color.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(ColorRGBA)
 Determines whether the specified ColorRGBA has the same values as the present color.
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToArgb
 Converts this color to a 32-bit ARGB value.
ToString() |  (Overrides ValueType.ToString().)
ToString(String, IFormatProvider)
Top
Operators
Name | Description
Equality
Explicit(ColorRGBA to Color)
 Converts a ColorRGBA in a Color.
Implicit(Color to ColorRGBA)
Inequality
Top
See Also
Reference
Rhino.Display Namespace