RhinoCommon API
CurveOffsetEndStyle Enumeration
 Defines enumerated values for all implemented end styles in curve offsets.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum CurveOffsetEndStyle
Public Enumeration CurveOffsetEndStyle
Members
Member name | Value | Description
None | 0 |  No closing segments are added.
Flat | 1 |  Straight-line segments are added between the curves.
Round | 2 |  Tangent arcs are added between the curves.
See Also
Reference
Rhino.Geometry Namespace