RhinoCommon API
Material Class
 Representation of a Material through the change queue
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.Material
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Material
Public Class Material
The Material type exposes the following members.
Properties
Name | Description
Id
 Get the material ID (crc)
MeshIndex |  Obsolete.
 Get mesh index
MeshInstanceId
 Get the material InstanceAncestry
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render.ChangeQueue Namespace