RhinoCommon API
LengthUnit Structure
 Represents a length unit.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public readonly struct LengthUnit : IEquatable<LengthUnit>,
	IComparable<LengthUnit>
Public Structure LengthUnit
	Implements IEquatable(Of LengthUnit), IComparable(Of LengthUnit)
The LengthUnit type exposes the following members.
Properties
Name | Description
DisplayName
Upper case plural localized unit name.
DisplaySymbol
 Lower case singular localized unit symbol.
Name
Non localized lower case plural unit name.
Symbol
Non localized unit symbol string.
Top
Methods
Name | Description
CompareTo
 Compares the current instance with another object of the same type and returns an integer that indicates whether the current instance precedes, follows, or occurs in the same position in the sort order as the other object.
Equals(LengthUnit)
 Indicates whether the current object is equal to another object of the same type.
Equals(Object)
 Indicates whether the current object is equal to another object of the same type.
 (Overrides ValueType.Equals(Object).)
FromCustomUnitSystem
 Creates a custom LengthUnit based on its size expressed on a known UnitSystem.
FromKnownUnitSystem
 Constructs a LengthUnit from a UnitSystem.
GetHashCode
 Returns the hash code for this instance.
 (Overrides ValueType.GetHashCode().)
IsCustom
 Determines whether the specified value is a custom unit.
IsKnownLengthUnit
 Determines whether the provided value is a known unit system.
IsKnownUnitSystem
 Determines whether the instance value is a known unit system.
IsNone
 Determines whether the specified value is None.
IsUnset
 Determines whether the specified value is Unset.
Scale
 Computes the scale factor for changing a measurement on different units.
Size
 Returns the size of this unit expressed on a different length unit.
ToUnitSystem(Double)
 Returns a UnitSystem equivalent to this instance and its size expressed on meters.
ToUnitSystem(Double, ISet<UnitSystem>)
 Returns the most similar UnitSystem to this instance available on unitSystems set.
Top
Operators
Name | Description
Equality
Equality operator.
GreaterThan
Greater than operator.
GreaterThanOrEqual
Greater than or equal operator.
Inequality
Inequality operator.
LessThan
Less than operator.
LessThanOrEqual
Less than or equal operator.
Top
Fields
Name | Description
Centimeters
1 millimeter = 1.0e-2 meters
Feet
1 foot = 0.3048 meters = 12 inches
Inches
1 inch = 0.0254 meters = 1/12 foot
Kilometers
1 kilometer = 1.0e+3 meters
Meters
SI meter length unit
Miles
1 yard = 1609.344 meters = 5280 feet
Millimeters
1 millimeter = 1.0e-3 meters
None
No unit
Unset
Unset unit
Yards
1 yard = 0.9144 meters = 3 feet
Top
See Also
Reference
Rhino Namespace