RhinoCommon API
BrepEdge Class
 Represents a single edge curve in a Brep object.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Curve
 Rhino.Geometry.CurveProxy
 Rhino.Geometry.BrepEdge
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class BrepEdge : CurveProxy
Public Class BrepEdge
	Inherits CurveProxy
The BrepEdge type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this edge.
EdgeCurve
 Get the brep.Curves3D[] 3d curve geometry used by this edge or null.
EdgeCurveIndex
 Get the brep.Curves3D[] index of the 3d curve geometry used by this edge or -1.
EdgeIndex
 Gets the index of this edge in the Brep.Edges collection.
EndVertex
 BrepVertex at end of edge
ProxyBrepSubDEdgeId
 If this edge is part of a brep created by SubD.ProxyBrep(), then the subd component id of the corresponding SubD edge is returned. Otherwise 0 is returned.
StartVertex
 BrepVertex at start of edge
Tolerance
 Gets or sets the accuracy of the edge curve (>=0.0 or RhinoMath.UnsetValue) A value of UnsetValue indicates that the tolerance should be computed. The maximum distance from the edge's 3d curve to any surface of a face that has this edge as a portion of its boundary must be <= this tolerance.
TrimCount
 Gets the number of trim-curves that use this edge.
Valence
 Gets the topological valency of this edge. The topological valency is defined by how many adjacent faces share this edge.
Top
Methods
Name | Description
AdjacentFaces
 Gets the indices of all the BrepFaces that use this edge.
ConcavityAt
 Determine the concavity of this edge at a specific parameter.
Get3dVectorsIntoFaces
 For each trim at this edge, find the 3d unit vector at the edge parameter in the trim's surface tangent plane, perpendicular to the edge, which points to the active side of the trim.
GetEdgeParameter
 Get corresponding edge parameter for given trim at given trim parameter.
IsSmoothManifoldEdge
 For a manifold, non-boundary edge, decides whether or not the two surfaces on either side meet smoothly.
SetEdgeCurve(Int32)
 Set 3d curve geometry used by a b-rep edge.
SetEdgeCurve(Int32, Interval)
 Set 3d curve geometry used by a b-rep edge.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The NURBS Curves segments do not have fully multiple interior knots.
 3. Rational NURBS curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent co-linear or co-circular segments are combined.
TrimIndices
 Gets the indices of all trims associated with this edge.
Top
See Also
Reference
Rhino.Geometry Namespace