RhinoCommon API
FileSvgReadOptions Class
 Options used when reading a Svg file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileSvgReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileSvgReadOptions
Public Class FileSvgReadOptions
The FileSvgReadOptions type exposes the following members.
Constructors
Name | Description
FileSvgReadOptions
Initializes a new instance of the FileSvgReadOptions class
Top
Properties
Name | Description
GroupMultiCurvePaths
ImportFilledObjectAs
RetainGrouping
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Import function
Top
See Also
Reference
Rhino.FileIO Namespace