RhinoCommon API
DisplayPipelineAttributes.SurfaceIsoColorUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.SurfaceIsoColorUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public enum SurfaceIsoColorUse
Public Enumeration SurfaceIsoColorUse
Members
Member name | Value | Description
ObjectColor | 0
SingleColorForAll | 1
SpecifiedUV | 2
See Also
Reference
Rhino.Display Namespace