RhinoCommon API
WriteFileResult Enumeration
[Missing <summary> documentation for "T:Rhino.PlugIns.WriteFileResult"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum WriteFileResult
Public Enumeration WriteFileResult
Members
Member name | Value | Description
Cancel | -1
Failure | 0
Success | 1
See Also
Reference
Rhino.PlugIns Namespace