RhinoCommon API
OpenGLSettingsState Class
 Represents a snapshot of OpenGLSettings
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.OpenGLSettingsState
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class OpenGLSettingsState
Public Class OpenGLSettingsState
The OpenGLSettingsState type exposes the following members.
Properties
Name | Description
AntialiasLevel
 AA level used in OpenGL viewports
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace