RhinoCommon API
BoundingBox Structure
 Represents the value of two points in a bounding box defined by the two extreme corner points.
This box is therefore aligned to the world X, Y and Z axes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public struct BoundingBox : ICloneable
<SerializableAttribute>
Public Structure BoundingBox
	Implements ICloneable
The BoundingBox type exposes the following members.
Constructors
Name | Description
BoundingBox(IEnumerable<Point3d>)
 Constructs a bounding box from a collection of points.
BoundingBox(IEnumerable<Point3d>, Transform)
 Constructs a bounding box from a collection of points.
BoundingBox(Point3d, Point3d)
 Constructs a new bounding box from two corner points.
BoundingBox(Double, Double, Double, Double, Double, Double)
 Constructs a bounding box from numeric extremes.
Top
Properties
Name | Description
Area
 Gets the area of this BoundingBox.
Center
 Gets the point in the center of the bounding box.
Diagonal
 Gets the diagonal vector of this BoundingBox. The diagonal connects the Min and Max points.
Empty
 Gets an [Empty] bounding box. An Empty box is an invalid structure that has negative width.
IsValid
 Gets a value that indicates whether or not this bounding box is valid. Empty boxes are not valid, and neither are boxes with unset points.
Max
 Gets or sets the point in the maximal corner.
Min
 Gets or sets the point in the minimal corner.
Unset
 Gets a bounding box that has Unset coordinates for Min and Max.
Volume
 Gets the volume of this BoundingBox.
Top
Methods
Name | Description
ClosestPoint(Point3d)
 Finds the closest point on or in the bounding box.
ClosestPoint(Point3d, Boolean)
 Finds the closest point on or in the bounding box.
Contains(BoundingBox)
 Determines whether this bounding box contains another bounding box.
This is the same as calling Contains(box,false).
Contains(Point3d)
 Tests a point for bounding box inclusion. This is the same as calling Contains(point, false)
Contains(BoundingBox, Boolean)
 Determines whether this bounding box contains another bounding box.
The user can choose how to treat bounding boxes with coincident surfaces.
Contains(Point3d, Boolean)
 Tests a point for BoundingBox inclusion.
Corner
 Gets one of the eight corners of the box.
FurthestPoint
 Finds the furthest point on the Box.
GetCorners
 Gets an array filled with the 8 corner points of this box.
See remarks for the return order.
GetEdges
 Gets an array of the 12 edges of this box.
Inflate(Double)
 Inflates the box with equal amounts in all directions. Inflating with negative amounts may result in decreasing boxes.
Invalid boxes can not be inflated.
Inflate(Double, Double, Double)
 Inflate the box with custom amounts in all directions. Inflating with negative amounts may result in decreasing boxes.
InValid boxes can not be inflated.
Intersection
 Computes the intersection of two bounding boxes.
IsDegenerate
 Determines whether a bounding box is degenerate (flat) in one or more directions.
IsDisjoint(BoundingBox)
 Determines whether this bounding box and another bounding box are disjoint, that is, whether they do not intersect.
This is the same as calling IsDisjoint(box, 0.0).
IsDisjoint(BoundingBox, Double)
 Determines whether this bounding box and another bounding box are disjoint, that is, whether they do not intersect, allowing a tolerance for the comparison.
MakeValid
 Ensures that the box is defined in an increasing fashion along X, Y and Z axes. If the Min or Max points are unset, this function will not change the box.
MaximumDistanceTo
 Finds the largest distance between this bounding box and a test point.
MinimumDistanceTo
 Finds the shortest distance between this bounding box and a test point.
PointAt
 Evaluates the bounding box with normalized parameters.
The box has idealized side length of 1x1x1.
ToBrep
 Constructs a Brep representation of this bounding box.
ToString
 Constructs the string representation of this aligned bounding box.
 (Overrides ValueType.ToString().)
Transform
 Updates this bounding box to be the smallest axis aligned bounding box that contains the transformed result of its 8 original corner points.
Union(BoundingBox)
 Updates this BoundingBox to represent the union of itself and another box.
Union(Point3d)
 Updates this BoundingBox to represent the union of itself and a point.
Union(BoundingBox, BoundingBox)
 Returns a new BoundingBox that represents the union of boxes a and b.
Union(BoundingBox, Point3d)
 Returns a new BoundingBox that represents the union of a bounding box and a point.
Top
See Also
Reference
Rhino.Geometry Namespace