RhinoCommon API
SimpleArrayBinaryArchiveReader Class
 Wrapper for ON_SimpleArray<ON_BinaryArchive>. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArrayBinaryArchiveReader : IDisposable
Public Class SimpleArrayBinaryArchiveReader
	Implements IDisposable
The SimpleArrayBinaryArchiveReader type exposes the following members.
Constructors
Name | Description
SimpleArrayBinaryArchiveReader()
 Initializes a new SimpleArrayBinaryArchiveReader class.
SimpleArrayBinaryArchiveReader(IntPtr)
 Initializes a new SimpleArrayBinaryArchiveReader class.
Top
Properties
Name | Description
Count
 Gets the amount of elements in this array.
Top
Methods
Name | Description
Add
 Adds a new BinaryArchiveReader at the end of this array.
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Get
 Get the BinaryArchiveReader at index.
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace