RhinoCommon API
FileUsdWriteOptions Class
 Options for writing a USD File (.usda, .usda, .usdz)
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileUsdWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileUsdWriteOptions
Public Class FileUsdWriteOptions
The FileUsdWriteOptions type exposes the following members.
Constructors
Name | Description
FileUsdWriteOptions
Initializes a new instance of the FileUsdWriteOptions class
Top
Properties
Name | Description
BlockHandling
 Including blocks inside the file will result in a larger file size and data duplication
DefaultLayer
 The root prim for the USD File
ForceMeshes
 Forces all geometry to be represented as meshes
IncludeUserStrings
 Includes user strings in prim data
MeshingParameters
 Leaving this empty will not insert a Prim
ModelName
 A given model name will add a prim between the root prim and the start of the models data. Leaving this empty will not insert a Prim
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to Export(String, ArchivableDictionary)
Top
See Also
Reference
Rhino.FileIO Namespace