RhinoCommon API
LicenseCapabilities Enumeration
 Controls the buttons that will appear on the license notification window that is displayed if a license for the requesting product is not found. Note, the "Close" button will always be displayed.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.5
Syntax
[FlagsAttribute]
public enum LicenseCapabilities
<FlagsAttribute>
Public Enumeration LicenseCapabilities
Members
Member name | Value | Description
NoCapabilities | 0 | Only the "Close" button will be displayed
CanBePurchased | 1 | Shows "Buy a license" button
CanBeSpecified | 2 | OBSOLETE: Shows ""Enter a license" and "Use a Zoo" buttons. Use SupportsStandalone | SupportsZoo instead.
CanBeEvaluated | 4 | Shows "Evaluate" button
EvaluationIsExpired | 8 | Shows "Evaluate" button disabled
SupportsRhinoAccounts | 16 | Supports getting a license from a Cloud Zoo / Rhino Account
SupportsStandalone | 32 | Supports single-computer licensing
SupportsZooPerUser | 64 | Supports getting a license from a Zoo server
SupportsZooPerCore | 128 | Supports getting a license from a Zoo server
SupportsLicenseDiscovery | 256 | Supports license discovery API flow
See Also
Reference
Rhino.PlugIns Namespace