RhinoCommon API
EventInfoArgs Class
[Missing <summary> documentation for "T:Rhino.UI.Controls.DataSource.EventInfoArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.UI.Controls.DataSource.EventInfoArgs
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class EventInfoArgs : EventArgs
Public Class EventInfoArgs
	Inherits EventArgs
The EventInfoArgs type exposes the following members.
Properties
Name | Description
DataType
EventInfoPtr
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI.Controls.DataSource Namespace