RhinoCommon API
NurbsCurveFitParameters.KinkSplit Enumeration
 The KinkSplit enum is used to determine how target curve kinks (abrupt changes in target or curvature) are handled during rebuilding.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum KinkSplit
Public Enumeration KinkSplit
Members
Member name | Value | Description
None | 0 |  All target curve kinks are ignored and rebuilt curves will be G2.
AtG1Changes | 1 |  The rebuilt curve is permitted have a tangent change at locations where the target curve has tangent changes. Curvature changes in the target curve are ignored.
AtLargeG2Changes | 2 |  The rebuilt curve is permitted have a tangent or curvature changes at locations where the target curve has a tangent or large curvature changes.
AtMediumG2Changes | 3 |  The rebuilt curve is permitted have a tangent or curvature changes at locations where the target curve has a tangent or medium curvature changes.
AtSmallG2Changes | 4 |  The rebuilt curve is permitted have a tangent or curvature changes at locations where the target curve has a tangent or small curvature changes. This option is the most sensitive to splitting at any tangent or curvature kink.
See Also
Reference
Rhino.Geometry Namespace