RhinoCommon API
GetCancel Class
[Missing <summary> documentation for "T:Rhino.Input.Custom.GetCancel"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetBaseClass
 Rhino.Input.Custom.GetCancel
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GetCancel : GetBaseClass
Public Class GetCancel
	Inherits GetBaseClass
The GetCancel type exposes the following members.
Constructors
Name | Description
GetCancel
Initializes a new instance of the GetCancel class
Top
Properties
Name | Description
Progress
ProgressMessage
ProgressReporting
Token
Top
Methods
Name | Description
Cancel
 Cancel all running tasks
Wait(Task, RhinoDoc)
 Awaits a particular task to finish.
Wait<TResult>(Task<TResult>, RhinoDoc)
 Awaits a particular task to finish.
WaitAll(IEnumerable<Task>, RhinoDoc)
 Awaits some tasks to finish.
WaitAll<TResult>(IEnumerable<Task<TResult>>, RhinoDoc)
 Awaits some tasks to finish.
Top
Events
Name | Description
TaskCompleted
Top
See Also
Reference
Rhino.Input.Custom Namespace