RhinoCommon API
IOpenIDConnectToken Interface
 This class represents an OpenIDConnect token issued from an OpenID provider. The token is immutable.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IOpenIDConnectToken
Public Interface IOpenIDConnectToken
The IOpenIDConnectToken type exposes the following members.
Properties
Name | Description
AdminGroups
 Returns all the groups the user is an admin of.
AllGroups
 Returns all the groups the user is a member of.
AtHash
 Access Token hash value. Its value is the base64url encoding of the left-most half of the hash of the octets of the ASCII representation of the access_token value, where the hash algorithm used is the hash algorithm used in the alg Header Parameter of the ID Token's JOSE Header. For instance, if the alg is RS256, hash the access_token value with SHA-256, then take the left-most 128 bits and base64url encode them. The at_hash value is a case sensitive string.
Aud
 The id of the client (the audience) this token is intended for.
AuthTime
 Time when the End-User authentication occurred
Emails
 All the emails belonging to the account the token represents.
EmailVerified
 true if all the emails in the account have been verified; false otherwise.
Exp
 The date the token expires.
Iat
 The date the token was issued.
IsExpired
 true if the token is expired; false otherwise.
Iss
 The id of the entity that issued the token.
IsUpdated
 true if the token has been updated; false otherwise.
Locale
 The local of the user this token represents. ISO 639-1 Alpha-2 [ISO639‑1] language code and an ISO 3166-1 Alpha-2 [ISO3166‑1] country code in, separated by a dash.
MemberGroups
 Returns all the groups the user is a member of, but not an admin or an owner.
Name
 The name of the user this token represents.
Nonce
 String value used to associate a Client session with an ID Token, and to mitigate replay attacks
OwnerGroups
 Returns all the groups the user is an owner of.
Phone
 The phone of the user this token represents.
Picture
 The url of a picture/avatar/icon of the user this token represents.
RawToken
 The raw OpenIDConnect token.
Sub
 The unique id for the subject this token represents.
UpdatedAt
 The last time the token was updated.
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace