RhinoCommon API
File3dmRenderMaterial Class
[Missing <summary> documentation for "T:Rhino.FileIO.File3dmRenderMaterial"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.FileIO.File3dmRenderContent
 Rhino.FileIO.File3dmRenderMaterial
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmRenderMaterial : File3dmRenderContent
Public Class File3dmRenderMaterial
	Inherits File3dmRenderContent
The File3dmRenderMaterial type exposes the following members.
Properties
Name | Description
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Top
Methods
Name | Description
ToMaterial
 Get a simulated material that approximates this material's appearance.
Top
See Also
Reference
Rhino.FileIO Namespace