RhinoCommon API
ControlHorizontalAlignment Enumeration
 Horizontal alignment settings for control with respect to it's parent
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum ControlHorizontalAlignment
Public Enumeration ControlHorizontalAlignment
Members
Member name | Value | Description
Left | 0
Center | 1
Right | 2
Stretch | 3
See Also
Reference
Rhino.UI Namespace