RhinoCommon API
NamedViewTable Class
 All named views in a rhino document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.NamedViewTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class NamedViewTable : IEnumerable<ViewInfo>,
	IEnumerable
Public NotInheritable Class NamedViewTable
	Implements IEnumerable(Of ViewInfo), IEnumerable
The NamedViewTable type exposes the following members.
Properties
Name | Description
Count
Number of named views in the table.
Document
Document that owns this table.
Item
 Conceptually, the named view table is an array of ViewInfo and their associated names. The indexing operator ([] in C#) can be used to get individual ViewInfo items.
Selection
 Returns the current selection in the Named Views panel. If more than one such panel is open, it will return the selection in the most recently opened panel.
Top
Methods
Name | Description
Add(ViewInfo)
Add(String, Guid)
 Adds named view to document which is based on an existing viewport.
Delete(Int32)
Remove named view from the document.
Delete(String)
Remove named view from the document.
FindByName
Finds a named view.
GetEnumerator
Rename(Int32, String)
 Renames a named view.
Rename(String, String)
 Renames a named view.
Restore(Int32, RhinoViewport)
 Sets the MainViewport of a standard RhinoView to a named views settings
Restore(Int32, RhinoView, Boolean) |  Obsolete.
Restore(Int32, RhinoViewport, Boolean) |  Obsolete.
RestoreAnimated(Int32, RhinoView, Boolean) |  Obsolete.
RestoreAnimated(Int32, RhinoViewport, Boolean) |  Obsolete.
RestoreAnimated(Int32, RhinoView, Boolean, Int32, Int32) |  Obsolete.
RestoreAnimated(Int32, RhinoViewport, Boolean, Int32, Int32) |  Obsolete.
RestoreAnimatedConstantSpeed
RestoreAnimatedConstantTime
RestoreWithAspectRatio
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace