RhinoCommon API
DisplayPointSet Class
[Missing <summary> documentation for "T:Rhino.Display.DisplayPointSet"]
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayPointSet
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DisplayPointSet : IDisposable
Public Class DisplayPointSet
	Implements IDisposable
The DisplayPointSet type exposes the following members.
Methods
Name | Description
Create
Dispose
Releases all resources used by the DisplayPointSet
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Display Namespace