RhinoCommon API
FileCdWriteOptions Class
 Options for writing a CD file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileCdWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileCdWriteOptions
Public Class FileCdWriteOptions
The FileCdWriteOptions type exposes the following members.
Constructors
Name | Description
FileCdWriteOptions
Initializes a new instance of the FileCdWriteOptions class
Top
Properties
Name | Description
MeshingParameters
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace