RhinoCommon API
GetEllipsoid Class
 Class provides user interface to define an ellipsoid.
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetEllipsoid
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public class GetEllipsoid : IDisposable
Public Class GetEllipsoid
	Implements IDisposable
The GetEllipsoid type exposes the following members.
Constructors
Name | Description
GetEllipsoid
Initializes a new instance of the GetEllipsoid class
Top
Properties
Name | Description
FirstPoint
 Returns the first point. If in "from foci" mode, then this is the first foci point.
IsModeFromFoci
 Indicates the ellipsoid was created from foci.
MarkFoci
 Indicates the user wants the ellipsoid foci marked with point objects.
Plane
 The plane the ellipsoid was created in.
SecondPoint
 Returns the second point. If in "from foci" mode, then this is the second foci point.
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Get
 Prompt for the getting of an ellipsoid.
GetMesh(Int32, Int32, Mesh)
 Prompt for the getting of a mesh ellipsoid.
GetMesh(Int32, Int32, Boolean, Mesh)
 Prompt for the getting of a mesh ellipsoid.
Top
See Also
Reference
Rhino.Input.Custom Namespace