RhinoCommon API
ViewCaptureWriter.VectorPathProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.VectorPathProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void VectorPathProc(
	int begin,
	IntPtr brush,
	IntPtr screenLine,
	IntPtr stops
)
Public Delegate Sub VectorPathProc (
	begin As Integer,
	brush As IntPtr,
	screenLine As IntPtr,
	stops As IntPtr
)
Parameters
begin
Type: System.Int32
brush
Type: System.IntPtr
screenLine
Type: System.IntPtr
stops
Type: System.IntPtr
See Also
Reference
Rhino.Runtime Namespace