RhinoCommon API
File3dmSettings Class
 General settings in a 3dm file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmSettings
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmSettings
Public Class File3dmSettings
The File3dmSettings type exposes the following members.
Properties
Name | Description
ActiveViewId
 The viewport id of the view that is active when the model is opened. When this is nil Rhino activates the first view in the view table.
AnalysisMeshingParameters
The meshing parameters used for analysis meshes (curvature, draft angle, ...).
CurrentColor
The colour new objects are created with.
CurrentDimensionStyleId
 The id of the dimension style new annotation uses. When this is nil Rhino falls back to the obsolete V5 index, which selects the first style in the table - so a template that leaves it nil can open with the wrong annotation style current.
CurrentHatchPatternId
The id of the current hatch pattern.
CurrentLayerId
The id of the layer new objects are created on.
CurrentLinePatternId
The id of the current line pattern (linetype).
CurrentPlotColor
The plot colour new objects are created with.
CurrentRenderMaterialId
The id of the current render material.
CurrentTextStyleId
The id of the current text style.
CurrentWireDensity
 The surface isocurve density new objects are created with. -1 draws no isocurves, 0 draws the surface edges only, and n > 0 draws n isocurves per span.
CustomRenderMeshingParameters
The meshing parameters stored as the model's custom render mesh settings.
GridDefaults
 The construction plane grid defaults new views inherit: grid and snap spacing, line counts, and whether the grid, its axes and the world axes icon are drawn.
InstanceDefinitionLinkUpdate
How instance definition links are updated when the model is opened.
LinetypeDisplayScale
The document-wide linetype pattern display scale.
MeshingParameters
 The meshing parameters Rhino uses to build render meshes for this model. Rhino derives the "Jagged & faster" / "Smooth & slower" choice from these when the model is opened, so a model that leaves them at the openNURBS default gets jagged render meshes.
ModelAbsoluteTolerance
Gets or sets the model space absolute tolerance.
ModelAngleToleranceDegrees
Gets or sets the model space angle tolerance.
ModelAngleToleranceRadians
Gets or sets the model space angle tolerance.
ModelBasepoint
 Gets or sets the model base point that is used when the file is read as an instance definition.
This point is mapped to the origin in the instance definition.
ModelDistanceDisplayMode
 Gets or sets the model space distance display mode (decimal, feet, or feet and inches).
ModelDistanceDisplayPrecision
 Gets or sets the model space distance display precision. In decimal mode this is the number of decimal places; in fractional modes the denominator is (1/2)^precision. Valid values are >= 0 and <= 7.
ModelRelativeTolerance
Gets or sets the model space relative tolerance.
ModelUnits
 Gets or sets the model length units, using LengthUnit value.
ModelUnitSystem
 Gets or sets the model unit system, using UnitSystem enumeration.
ModelUrl
 Gets or sets a Uniform Resource Locator (URL) direction for the model.
PageAbsoluteTolerance
Gets or sets the page space absolute tolerance.
PageAngleToleranceDegrees
Gets or sets the page space angle tolerance.
PageAngleToleranceRadians
Gets or sets the page space angle tolerance.
PageDistanceDisplayMode
 Gets or sets the page space distance display mode (decimal, feet, or feet and inches).
PageDistanceDisplayPrecision
 Gets or sets the page space distance display precision. In decimal mode this is the number of decimal places; in fractional modes the denominator is (1/2)^precision. Valid values are >= 0 and <= 7.
PageRelativeTolerance
Gets or sets the page space relative tolerance.
PageUnits
 Gets or sets the page length units, using LengthUnit value.
PageUnitSystem
 Gets or sets the page unit system, using UnitSystem enumeration.
RenderSettings
 Gets or sets the render settings.
SaveTextureBitmapsInFile
Whether texture bitmaps are embedded in the model when it is saved.
Top
Methods
Name | Description
LoadedPlugIns
 Information about the plug-ins loaded when the file was last saved
Top
See Also
Reference
Rhino.FileIO Namespace