RhinoCommon API
FileObjReadOptions.UseObjOsAs Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileObjReadOptions.UseObjOsAs"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.5
Syntax
public enum UseObjOsAs
Public Enumeration UseObjOsAs
Members
Member name | Value | Description
IgnoreObjObjects | 0 |  OBJ "o"s in the file are ignored
ObjObjectsAsLayers | 1 |  OBJ "o"s in the file will become Rhino layers
ObjObjectsAsGroups | 2 |  OBJ "o"s in the file will become Rhino groups
ObjObjectsAsObjects | 3 |  OBJ "o"s in the file will become Rhino objects
See Also
Reference
Rhino.FileIO Namespace