RhinoCommon API
WorksessionFile Class
 Reads and writes Rhino worksession (.rws) files. A worksession file lists models and a worksession's layer overrides. It does not contain any model content, and nothing here opens or checks the model files it lists.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.WorksessionFile
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public sealed class WorksessionFile : IDisposable
Public NotInheritable Class WorksessionFile
	Implements IDisposable
The WorksessionFile type exposes the following members.
Constructors
Name | Description
WorksessionFile()
Creates an empty worksession with no models.
WorksessionFile(WorksessionFile)
Creates a copy of another worksession.
Top
Properties
Name | Description
ActiveModelIndex
 Gets the index of the first active model, or -1 if there is no active model.
CurrentVersion
The worksession file version Rhino 5 and later write.
ModelCount
Gets the number of models.
Version
 Gets or sets the file version. Reading sets it to the version of the file that was read. Writing does not use it.
Top
Methods
Name | Description
AddModel
Adds a copy of a model to the end of the list.
ClearModels
Removes all of the models.
Dispose
Releases the native worksession.
Dump
 Describes the worksession: its version, and for each model its paths and saved layer settings. For each saved layer it gives its name and the settings Rhino uses.
Finalize
Releases the native worksession.
 (Overrides Object.Finalize().)
FromByteArray
Reads a worksession from the contents of a worksession file.
GetModel
Gets a copy of a model.
GetModels
Gets copies of all of the models.
Read
Reads a worksession file.
ReadFileVersion
 Reads only the version from the header of a worksession file.
RemoveModelAt
Removes a model.
SetModel
Replaces a model with a copy of another.
ToByteArray()
Writes the worksession as the contents of a version 5 .rws file.
ToByteArray(Int32)
Writes the worksession as the contents of a .rws file.
Write(String)
 Writes a version 5 worksession file.
Write(String, Int32)
Writes a worksession file.
Top
Remarks
 Rhino 4 wrote version 4 files. Rhino 5 and later write version 5. Both versions can be read and written. Models are exchanged by value: GetModel(Int32) returns a copy, and changes to it are kept only after SetModel(Int32, WorksessionFileModel).
See Also
Reference
Rhino.FileIO Namespace