RhinoCommon API
RenderContentSerializer.LoadMultipleFlags Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderContentSerializer.LoadMultipleFlags"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum LoadMultipleFlags
Public Enumeration LoadMultipleFlags
Members
Member name | Value | Description
Normal | 0
Preload | 1
See Also
Reference
Rhino.Render Namespace