RhinoCommon API
NameHash Class
 Contains information that is useful to uniquely identify an object name.
Remarks
This object is immutable.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.NameHash
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class NameHash : ICloneable, IEquatable<NameHash>
Public Class NameHash
	Implements ICloneable, IEquatable(Of NameHash)
The NameHash type exposes the following members.
Constructors
Name | Description
NameHash(NameHash)
 Constructs a copy of a content hash.
NameHash(String)
 Creates a new NameHash, representing a piece of text.
NameHash(String, Guid)
 Creates a new NameHash, representing a piece of text.
NameHash(String, Guid, ModelComponentType)
 Creates a new NameHash, representing a piece of text.
NameHash(String, Guid, Boolean)
 Creates a new NameHash, representing a piece of text.
Top
Properties
Name | Description
MappedCodePoints
 Gets the NameHash flags. In some cases = number of mapped code points.
ParentId
 Only useful if this participates in a tree structure, as with layers.
Sha1Hash
 Gets the 20-bytes long SHA-1 hash of ordinal minimum mapped Unicode (UTF-32) code points.
Top
Methods
Name | Description
Clone
 Creates a copy of this name hash. Because content hash is immutable, this can be used as a deep copy.
CreateFilePathHash
 Creates a new NameHash, representing the name of a file.
Equals(NameHash)
 Determines if another name hash has the same value.
Equals(Object)
 Determines if another object is a name hash with same value.
 (Overrides Object.Equals(Object).)
GetHashCode
 Gets an hash code for this name hash. Two equal content hashes have equal hash code. The other way around might not be true.
 (Overrides Object.GetHashCode().)
Top
Operators
Name | Description
Equality
 Determines if two NameHash instances are equal by value.
Inequality
 Determines if two NameHash instances are different by value.
Top
See Also
Reference
Rhino.FileIO Namespace