RhinoCommon API
NamedPositionTable Class
 All named positions in a rhino document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.NamedPositionTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class NamedPositionTable
Public NotInheritable Class NamedPositionTable
The NamedPositionTable type exposes the following members.
Properties
Name | Description
Count
Number of Named Positions in the table.
Document
Document that owns this table.
Ids
Array of Named Position Guids.
Names
Array of Named Position names.
Top
Methods
Name | Description
Append(Guid, IEnumerable<RhinoObject>)
Append objects to a Named Position.
Append(Guid, IEnumerable<Guid>)
Append objects to a Named Position.
Append(String, IEnumerable<RhinoObject>)
Append objects to a Named Position.
Append(String, IEnumerable<Guid>)
Append objects to a Named Position.
Delete(Guid)
Delete a Named Position.
Delete(String)
Delete a Named Position.
Id
Guid of a Named Position.
Name
Name of a Named Position.
ObjectIds(Guid)
Array of Rhino Object Guids related to a Named Position.
ObjectIds(String)
Array of Rhino Object Guids related to a Named Position.
Objects(Guid)
Array of Rhino Objects related to a Named Position.
Objects(String)
Array of Rhino Objects related to a Named Position.
ObjectXform(Guid, RhinoObject, Transform)
Retrieve the Transform of a Rhino Object relate to a Named Position.
ObjectXform(Guid, Guid, Transform)
Retrieve the Transform of a Rhino Object relate to a Named Position.
Rename(Guid, String)
Rename a Named Position.
Rename(String, String)
Rename a Named Position.
Restore(Guid)
Restore a Named Position.
Restore(String)
Restore a Named Position.
Save(String, IEnumerable<RhinoObject>)
Save a new Named Position.
Save(String, IEnumerable<Guid>)
Save a new Named Position.
Update(Guid)
 Updates a Named Position, effectively storing the current positions of the objects which the Named Position is tracking.
Update(String)
 Updates a Named Position, effectively storing the current positions of the objects which the Named Position is tracking.
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace