RhinoCommon API
Layer Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Layer"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.Layer
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public sealed class Layer : ModelComponent,
	IEquatable<Layer>
<SerializableAttribute>
Public NotInheritable Class Layer
	Inherits ModelComponent
	Implements IEquatable(Of Layer)
The Layer type exposes the following members.
Constructors
Name | Description
Layer
Initializes a new instance of the Layer class
Top
Properties
Name | Description
Color
 Gets or sets the display color for this layer.
ComponentStatus
 Gets or sets the status of the layer.
 (Overrides ModelComponent.ComponentStatus.)
ComponentType
 Returns Layer.
 (Overrides ModelComponent.ComponentType.)
Description
 Gets and sets a short description of the layer.
FullPath
 Gets the full path to this layer. The full path includes nesting information.
Id
 Gets or sets the ID of this layer object. You typically do not need to assign a custom ID.
 (Overrides ModelComponent.Id.)
IgesLevel
 Gets or sets the IGES level for this layer.
IsCurrent
 Returns true if the layer is the current layer.
IsDeleted
 Gets a value indicating whether this layer has been deleted and is currently in the Undo buffer.
 (Overrides ModelComponent.IsDeleted.)
IsExpanded
 Gets or sets a value indicating whether this layer is expanded in the Rhino Layer dialog.
IsLocked
 Gets or sets a value indicating the locked state of this layer.
IsReference
 Gets a value indicting whether this layer is a referenced layer. Referenced layers are part of referenced documents.
 (Overrides ModelComponent.IsReference.)
IsReferenceParentLayer
 Returns true if the layer is a parent layer of the layer tree from a linked instance definition or the layer tree from a worksession reference model.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
IsVisible
 Gets or sets the global visibility of this layer.
IsVisibleInUserInterface
 Return true if the layer is visible in user interfaces that display layers. Returns false if the layer not visible in user interfaces. This is a runtime property that does not persist in .3dm files. This property is also used by the Layers panel to filter layers.
LinetypeIndex
 Gets or sets the line-type index for this layer.
ModelIsVisible
 Gets or sets the model visiblity of this layer.
ModelPersistentVisibility
 Gets or sets the model persistent visibility of this layer. The persistent viability setting is used for layers whose visibility can be changed by a parent layer. In this case, when a parent layer is turned off, then child layers are also turned off. The persistent visibility setting determines what happens when the parent is turned on again.
Name
Gets or sets the name of this layer.
 (Overrides ModelComponent.Name.)
ParentLayerId
 Gets the ID of the parent layer. Layers can be organized in a hierarchical structure, in which case this returns the parent layer ID. If the layer has no parent, Guid.Empty will be returned.
PersistentVisibility
 Gets or sets the global persistent visibility setting for this layer.
PerViewportIsVisibleInNewDetails
 Gets and sets the initial per viewport visibility of this layer in newly created detail views.
PlotColor
 Gets or sets the plot color for this layer.
PlotWeight
 Gets or sets the weight of the plotting pen in millimeters. A weight of 0.0 indicates the "default" pen weight should be used. A weight of -1.0 indicates the layer should not be printed.
RenderMaterial
 Gets or sets the RenderMaterial for objects on this layer that have MaterialSource() == MaterialFromLayer. A null result indicates that no RenderMaterial has been assigned and the material created by the default Material constructor or the RenderMaterialIndex should be used.
RenderMaterialIndex
 Gets or sets the index of render material for objects on this layer that have MaterialSource() == MaterialFromLayer. A material index of -1 indicates no material has been assigned and the material created by the default Material constructor should be used.
SectionStyleIndex
 Gets or sets the section style index for this layer.
SortIndex
 Runtime index used to sort layers in layer dialog.
UserStringCount
 Gets the amount of user strings.
Top
Methods
Name | Description
CopyAttributesFrom
 Copy typical attributes from another layer
Default
 Sets layer to default settings.
DeleteAllUserStrings
DeleteModelVisible
 Remove any model visibility setting so the layer's global setting will be used for all viewports.
DeletePerViewportColor
 Remove any per viewport layer color setting so the layer's overall setting will be used for all viewports.
DeletePerViewportPlotColor
 Remove any per viewport layer plot color setting so the layer's overall setting will be used for all viewports.
DeletePerViewportPlotWeight
 Remove any per viewport layer plot weight setting so the layer's overall setting will be used for all viewports.
DeletePerViewportSettings
 Deletes per viewport layer settings.
DeletePerViewportVisible
 Remove any per viewport visibility setting so the layer's overall setting will be used for all viewports.
DeletePlotColor
 Removes the plot color for layer. The layer's color will be used for the plot color.
DeleteUserString
Equals(Layer)
Equals(Object) |  (Overrides Object.Equals(Object).)
GetChildren()
 Gets immediate children of this layer. Note that child layers may have their own children.
GetChildren(Boolean)
 Gets the children of this layer.
GetCustomSectionStyle
 Get an optional custom section style associated with these attributes.
GetDefaultLayerProperties
 Constructs a layer with the current default properties. The default layer properties are:
color = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerColor
line style = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerLineStyle
material index = -1
IGES level = -1
mode = NormalLayer
name = empty
layer index = 0 (ignored by AddLayer)
GetHashCode |  (Overrides Object.GetHashCode().)
GetLeafName(Layer)
 Get a layer name's "leaf" level name
GetLeafName(String)
 Get a layer name's "leaf" level name
GetParentName(Layer)
 Get a layer's "parent" path name
GetParentName(String)
 Get a layer's "parent" path name
GetPersistentLocking
 The persistent locking setting is used for layers that can be locked by a "parent" object. A common case is when a layer is a child layer (Layer.ParentI is not nil). In this case, when a parent layer is locked, then child layers are also locked. The persistent locking setting determines what happens when the parent is unlocked again.
GetPersistentVisibility
 The global persistent visibility setting is used for layers whose visibility can be changed by a "parent" object. A common case is when a layer is a child layer (ParentId is not nil). In this case, when a parent layer is turned off, then child layers are also turned off. The persistent visibility setting determines what happens when the parent is turned on again.
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
HasPerViewportSettings
 Verifies that a layer has per viewport settings.
HasSelectedObjects
 Returns true if the layer has one or more selected Rhino objects.
IsChildOf(Guid)
IsChildOf(Int32)
IsChildOf(Layer)
IsParentOf(Guid)
IsParentOf(Int32)
IsParentOf(Layer)
ParentLayer
 Returns parent of a layer.
PerViewportColor
 Gets the display color for this layer.
PerViewportIsVisible
 Gets the per viewport visibility of this layer.
PerViewportPersistentVisibility
 Gets the per layer persistent visibility. The persistent viability setting is used for layers whose visibility can be changed by a parent layer. In this case, when a parent layer is turned off, then child layers are also turned off. The persistent visibility setting determines what happens when the parent is turned on again.
PerViewportPlotColor
 Gets the plot color for this layer.
PerViewportPlotWeight
 Gets the plot weight, in millimeters, for this layer.
RemoveCustomSectionStyle
SetCustomSectionStyle
SetPersistentLocking
 Set the persistent locking setting for this layer
SetPersistentVisibility
 Set the global persistent visibility setting for this layer.
SetPerViewportColor
 Sets the display color for this layer.
SetPerViewportPersistentVisibility
 Sets the per layer persistent visibility. The persistent viability setting is used for layers whose visibility can be changed by a parent layer. In this case, when a parent layer is turned off, then child layers are also turned off. The persistent visibility setting determines what happens when the parent is turned on again.
SetPerViewportPlotColor
 Sets the plot color for this layer.
SetPerViewportPlotWeight
 Sets the plot weight, in millimeters, for this layer.
SetPerViewportVisible
 Controls layer visibility in specific viewports.
SetUserString
 Attach a user string (key,value combination) to this geometry.
ToString |  (Overrides ModelComponent.ToString().)
UnsetModelPersistentVisibility
 Remove any model persistent visibility setting from this layer.
UnsetPersistentLocking
 Remove any explicitly persistent locking settings from this layer
UnsetPersistentVisibility
 Remove any explicit persistent visibility setting from this layer
UnsetPerViewportPersistentVisibility
 Remove any per viewport persistent visibility setting so the layer's overall setting will be used for all viewports.
Top
Operators
Name | Description
Equality
Inequality
Top
See Also
Reference
Rhino.DocObjects Namespace