RhinoCommon API
RhinoAccountsAuthTokenMismatchException Class
 Exception thrown when the currently logged in user is different from the newly logged in user.
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.RhinoAccounts.RhinoAccountsException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsAuthTokenMismatchException
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class RhinoAccountsAuthTokenMismatchException : RhinoAccountsException
<SerializableAttribute>
Public Class RhinoAccountsAuthTokenMismatchException
	Inherits RhinoAccountsException
The RhinoAccountsAuthTokenMismatchException type exposes the following members.
Constructors
Name | Description
RhinoAccountsAuthTokenMismatchException(Exception)
 Generates a new instance of the exception.
RhinoAccountsAuthTokenMismatchException(String, Exception)
 Generates a new instance of the exception.
RhinoAccountsAuthTokenMismatchException(String, String, Exception)
 Generates a new instance of the exception.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace