RhinoCommon API
RenderMaterial.StandardChildSlots Enumeration
 Defines enumerated constant values for use in TextureChildSlotName(RenderMaterial.StandardChildSlots) method. NOTE WELL - these values cannot be changed. https://mcneel.myjetbrains.com/youtrack/issue/RH-57752
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public enum StandardChildSlots
Public Enumeration StandardChildSlots
Members
Member name | Value | Description
None | 0 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::None.
Diffuse | 100 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::Diffuse.
Transparency | 101 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::Transparency
Bump | 102 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::Bump
Environment | 103 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::Environment
PbrBaseColor | 100 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_base_color
PbrSubsurface | 104 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_subsurface
PbrSubSurfaceScattering | 105 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_subsurface_scattering_color
PbrSubsurfaceScatteringRadius | 106 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_subsurface_scattering_radius
PbrMetallic | 107 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_metallic
PbrSpecular | 108 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_specular
PbrSpecularTint | 109 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_specular_tint
PbrRoughness | 110 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_roughness
PbrAnisotropic | 111 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_anisotropic
PbrAnisotropicRotation | 112 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_anisotropic_rotation
PbrSheen | 113 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_sheen
PbrSheenTint | 114 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_sheen_tint
PbrClearcoat | 115 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_clearcoat
PbrClearcoatRoughness | 116 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_clearcoat_roughness
PbrOpacityIor | 117 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_opacity_ior
PbrOpacity | 101 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_opacity
PbrOpacityRoughness | 118 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_opacity_roughness
PbrEmission | 119 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_emission
PbrAmbientOcclusion | 120 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_ambient_occlusion
PbrDisplacement | 121 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_smudge
PbrClearcoatBump | 122 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_clearcoat_roughness
PbrAlpha | 123 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_alpha
BlendAmount | 124 |  CRhRdkMaterial::ChildSlotUsage::Blend_amount
See Also
Reference
Rhino.Render Namespace