RhinoCommon API
TexturedValue<T> Class
 Generic class to help holding on to related values. This can be used to get data from textured content fields with the HandleTexturedValue function.
Inheritance Hierarchy
System.Object
 Rhino.Render.TexturedValue<T>
 Rhino.Render.TexturedColor
 Rhino.Render.TexturedFloat
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public class TexturedValue<T>
Public Class TexturedValue(Of T)
Type Parameters
T
Color4f or float
The TexturedValue<T> type exposes the following members.
Constructors
Name | Description
TexturedValue<T>
Initializes a new instance of the TexturedValue<T> class
Top
Methods
Name | Description
Top
Fields
Name | Description
Amount
Name
On
Texture
Value
Top
See Also
Reference
Rhino.Render Namespace