RhinoCommon API
RealtimeDisplayModeClassInfo Class
 Class information obligatory for registering RealtimeDisplayMode implementations.
Inheritance Hierarchy
System.Object
 Rhino.Render.RealtimeDisplayModeClassInfo
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class RealtimeDisplayModeClassInfo
Public MustInherit Class RealtimeDisplayModeClassInfo
The RealtimeDisplayModeClassInfo type exposes the following members.
Constructors
Name | Description
RealtimeDisplayModeClassInfo
Initializes a new instance of the RealtimeDisplayModeClassInfo class
Top
Properties
Name | Description
DontRegisterAttributesOnStart
 Override and return true when you don't want your class info to cause display attributes to be registered with the system.
DrawOpenGl
 Return true if the RealtimeDisplayMode draws its result using OpenGL. RenderWindow usage will then be skipped.
GUID
 Get the RealtimeDisplayMode implementation GUID
Name
 Get human-facing class description for RealtimeDisplayMode implementation. This string might show up in the Rhino UI.
RealtimeDisplayModeType
 Get the type being registered.
RequiredDisplayTechnology
 Override to return the display techonology your DisplayMode requires for the viewport to be running in.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace