RhinoCommon API
Sizes Enumeration
[Missing <summary> documentation for "T:Rhino.Render.DataSources.Sizes"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum Sizes
Public Enumeration Sizes
Members
Member name | Value | Description
Unset | 0
Tiny | 1
Small | 2
Medium | 3
Large | 4
See Also
Reference
Rhino.Render.DataSources Namespace