RhinoCommon API
PersistentSettings Class
 A dictionary of SettingValue items.
Inheritance Hierarchy
System.Object
 Rhino.PersistentSettings
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class PersistentSettings : ISerializable
<SerializableAttribute>
Public Class PersistentSettings
	Implements ISerializable
The PersistentSettings type exposes the following members.
Constructors
Name | Description
PersistentSettings
Initializes a new instance of the PersistentSettings class
Top
Properties
Name | Description
ChildKeys
 Gets a collection containing the keys in the settings dictionary.
HiddenFromUserInterface
 If false then values will appear in the EditOptions window
Keys
 Gets a collection containing the keys in the settings dictionary.
RhinoAppSettings
StringListRootKey
 Adding this string to a string list when calling SetStringList will cause the ProgramData setting to get inserted at that location in the list.
Top
Methods
Name | Description
AddChild
 Call this method to add a new child key, if the key is exists then the existing key is returned otherwise a new empty PersistentSettings child key is added and the new settings are returned.
ClearChangedFlag
ContainsChangedValues
ContainsModifiedValues
DeleteChild
 Call this method to delete a child settings key.
DeleteItem
FromPlugInId
GetBool(String)
GetBool(String, Boolean)
GetBool(String, Boolean, IEnumerable<String>)
GetByte(String)
GetByte(String, Byte)
GetByte(String, Byte, IEnumerable<String>)
GetChar(String)
GetChar(String, Char)
GetChar(String, Char, IEnumerable<String>)
GetChild
 Call this method to get a nested settings PersistentSettings instance, will throw a KeyNotFoundException exception if the key does not exist.
GetColor(String)
GetColor(String, Color)
GetColor(String, Nullable<Color>)
GetColor(String, Color, IEnumerable<String>)
GetColor(String, Nullable<Color>, IEnumerable<String>)
GetDate(String)
GetDate(String, DateTime)
GetDate(String, DateTime, IEnumerable<String>)
GetDouble(String)
GetDouble(String, Double)
GetDouble(String, Double, IEnumerable<String>)
GetEnumValue<T>(T)
 Get a stored enumerated value, or return default value if not found
GetEnumValue<T>(String)
 Get a stored enumerated value using a custom key.
GetEnumValue<T>(String, T)
 Gets a stored enumerated value using a custom key, or return default value if not found.
GetGuid(String)
GetGuid(String, Guid)
GetGuid(String, Guid, IEnumerable<String>)
GetInteger(String)
GetInteger(String, Int32)
GetInteger(String, Int32, IEnumerable<String>)
GetInteger(String, Int32, Int32, Boolean)
GetInteger(String, Int32, Int32, Int32)
GetPoint(String)
GetPoint(String, Point)
GetPoint(String, Point, IEnumerable<String>)
GetPoint3d(String)
GetPoint3d(String, Point3d)
GetPoint3d(String, Point3d, IEnumerable<String>)
GetRectangle(String)
GetRectangle(String, Rectangle)
GetRectangle(String, Rectangle, IEnumerable<String>)
GetSettingIsHiddenFromUserInterface(String)
 Values read from all users settings files will be marked as read-only which will cause any future calls to Set... to fail.
GetSettingIsHiddenFromUserInterface(String, IEnumerable<String>)
 Values read from all users settings files will be marked as read-only which will cause any future calls to Set... to fail.
GetSettingIsReadOnly
 Values read from all users settings files will be marked as read-only which will cause any future calls to Set... to fail.
GetSettingType
 Gets the type of the last value passed to Set... or Get... for the specified setting.
GetSize(String)
GetSize(String, Size)
GetSize(String, Size, IEnumerable<String>)
GetString(String)
GetString(String, String)
GetString(String, String, IEnumerable<String>)
GetStringDictionary(String)
GetStringDictionary(String, KeyValuePair<String, String>[])
GetStringDictionary(String, KeyValuePair<String, String>[], IEnumerable<String>)
GetStringList(String)
GetStringList(String, String[])
GetStringList(String, String[], IEnumerable<String>)
GetUnsignedInteger(String)
GetUnsignedInteger(String, UInt32)
GetUnsignedInteger(String, UInt32, IEnumerable<String>)
GetValidator<T>
 Provides a way to find a ready-to-use validator for the PersistentSetting class for the given the key, or obtaining null.
HideSettingFromUserInterface
RegisterSettingsValidator<T>
 Sets a validator for a given key.
Note to implementers: T should be one of the supported types for the PersistentSettings class and should match the type associated with the key.
This method allows to use anonymous methods and lambda expressions.
SetBool
SetByte
SetChar
SetColor(String, Color)
SetColor(String, Nullable<Color>)
SetDate
SetDefault(String, Point3d)
SetDefault(String, Boolean)
SetDefault(String, Byte)
SetDefault(String, Char)
SetDefault(String, KeyValuePair<String, String>[])
SetDefault(String, DateTime)
SetDefault(String, Double)
SetDefault(String, Color)
SetDefault(String, Point)
SetDefault(String, Rectangle)
SetDefault(String, Size)
SetDefault(String, Guid)
SetDefault(String, Int32)
SetDefault(String, Nullable<Color>)
SetDefault(String, String)
SetDefault(String, String[])
SetDouble
SetEnumValue<T>(T)
 Set an enumerated value in the settings.
SetEnumValue<T>(String, T)
 Set an enumerated value in the settings using a custom key
SetGuid
SetInteger
SetPoint
SetPoint3d
SetRectangle
SetSize
SetString
SetStringDictionary
SetStringList
 Including a item with the value of StringListRootKey will cause the ProgramData value to get inserted at that location in the list when calling GetStringList.
SetUnsignedInteger
TryGetBool(String, Boolean)
TryGetBool(String, Boolean, IEnumerable<String>)
TryGetByte(String, Byte)
TryGetByte(String, Byte, IEnumerable<String>)
TryGetChar(String, Char)
TryGetChar(String, Char, IEnumerable<String>)
TryGetChild
 Call this method to get a nested settings PersistentSettings instance, will return true if the key exists and value was set otherwise; will return false and value will be set to null.
TryGetColor(String, Color)
TryGetColor(String, Nullable<Color>)
TryGetColor(String, Color, IEnumerable<String>)
TryGetColor(String, Nullable<Color>, IEnumerable<String>)
TryGetDate(String, DateTime)
TryGetDate(String, DateTime, IEnumerable<String>)
TryGetDefault(String, Point3d)
TryGetDefault(String, Boolean)
TryGetDefault(String, Byte)
TryGetDefault(String, Char)
TryGetDefault(String, DateTime)
TryGetDefault(String, Double)
TryGetDefault(String, Color)
TryGetDefault(String, Rectangle)
TryGetDefault(String, Size)
TryGetDefault(String, Int32)
TryGetDefault(String, String)
TryGetDefault(String, String[])
TryGetDouble(String, Double)
TryGetDouble(String, Double, IEnumerable<String>)
TryGetEnumValue<T>
 Attempt to get the stored value for an enumerated setting using a custom key. Note: the enumerated value ALWAYS gets assigned! Be sure to check for success of this method to prevent erroneous use of the value.
TryGetGuid(String, Guid)
TryGetGuid(String, Guid, IEnumerable<String>)
TryGetInteger(String, Int32)
TryGetInteger(String, Int32, IEnumerable<String>)
TryGetPoint(String, Point)
TryGetPoint(String, Point, IEnumerable<String>)
TryGetPoint3d(String, Point3d)
TryGetPoint3d(String, Point3d, IEnumerable<String>)
TryGetRectangle(String, Rectangle)
TryGetRectangle(String, Rectangle, IEnumerable<String>)
TryGetSettingIsHiddenFromUserInterface(String, Boolean)
 Values read from all users settings files will be marked as read-only which will cause any future calls to Set... to fail.
TryGetSettingIsHiddenFromUserInterface(String, Boolean, IEnumerable<String>)
 Values read from all users settings files will be marked as read-only which will cause any future calls to Set... to fail.
TryGetSettingIsReadOnly
 Values read from all users settings files will be marked as read-only which will cause any future calls to Set... to fail.
TryGetSettingType
 Get the type of the last value passed to Set... or Get... for the specified setting.
TryGetSize(String, Size)
TryGetSize(String, Size, IEnumerable<String>)
TryGetString(String, String)
TryGetString(String, String, IEnumerable<String>)
TryGetStringDictionary(String, KeyValuePair<String, String>[])
TryGetStringDictionary(String, KeyValuePair<String, String>[], IEnumerable<String>)
TryGetStringList(String, String[])
TryGetStringList(String, String[], IEnumerable<String>)
TryGetUnsignedInteger(String, UInt32)
TryGetUnsignedInteger(String, UInt32, IEnumerable<String>)
Top
See Also
Reference
Rhino Namespace