RhinoCommon API
TextureUvwWrapping Enumeration
 Defines Texture UVW wrapping modes
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public enum TextureUvwWrapping
Public Enumeration TextureUvwWrapping
Members
Member name | Value | Description
Repeat | 0 |  Repeat the texture
Clamp | 1 |  Clamp the texture
See Also
Reference
Rhino.DocObjects Namespace