RhinoCommon API
FileObjWriteOptions.NGons Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileObjWriteOptions.NGons"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum NGons
Public Enumeration NGons
Members
Member name | Value | Description
None | 0 |  Ngons will not be created, nor will they be exported if they already exist
Preserve | 1 |  If ngons already exist, they will be used as is, no ngons will be created
Create | 2 |  Ngons will be created, if possible, by calling Mesh.Ngons.AddPlanarNgons
See Also
Reference
Rhino.FileIO Namespace