RhinoCommon API
ICollapsibleSectionHolder2 Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.ICollapsibleSectionHolder2"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface ICollapsibleSectionHolder2
Public Interface ICollapsibleSectionHolder2
The ICollapsibleSectionHolder2 type exposes the following members.
Methods
Name | Description
EnableHeaderButton
SetFullHeightSection
ShowHeaderButton
Top
See Also
Reference
Rhino.UI.Controls Namespace