RhinoCommon API
RefitTrimKnotMode Enumeration
 The mode for adding kinots to the surface for fitting
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RefitTrimKnotMode
Public Enumeration RefitTrimKnotMode
Members
Member name | Value | Description
None | 0 |  No knots are added
UniformEntireSurface | 1 |  The entire surface is fit using uniform spacing with the specified number of knots
UniformPerSpan | 2 |  Each existing span is uniformly spaced with the specified number of knots
Custom | 3 |  The provided knot vector will be used
See Also
Reference
Rhino.Geometry Namespace