RhinoCommon API
Instance Class
 The core of the custom render primitive delivery system - and instance defines a single mesh. Each instance has a shared mesh and a transform, along with a material, mapping channels (at the mesh and instance level).
Inheritance Hierarchy
System.Object
 Rhino.Render.CustomRenderMeshes.Instance
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Instance : IDisposable
Public Class Instance
	Implements IDisposable
The Instance type exposes the following members.
Constructors
Name | Description
Instance
 Construct a new Instance object
Top
Properties
Name | Description
IsForcedMaterial
 The material for this instance should override any display mode materials.
IsRequestingPlugInDependent
 If this instance will change depending on the requesting plug-in.
IsViewDependent
 If this instance will change depending on the view direction.
Material
 The material for this instance.
Mesh
 Returns the mesh associated with this geometry. Note that this function will always return a mesh even if the type is not a mesh...so you can always call this function without checking the type to give you the mesh. It's more efficient to use the primitive directly of course...but if you don't support it...
Transform
 The transform for this instance. Transform the geometry by this to set its final location in world space.
Top
Methods
Name | Description
Dispose()
 Dispose method
Dispose(Boolean)
 Dispose method.
Finalize
 Finalizer to ensure correctly implemented dispose pattern.
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render.CustomRenderMeshes Namespace