RhinoCommon API
SweepMiter Enumeration
 Miter types for creating swept surfaces
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum SweepMiter
Public Enumeration SweepMiter
Members
Member name | Value | Description
None | 0 |  No mitering
Trimmed | 1 |  If the sweep creates a polysurface with kinks, the component surfaces will be trimmed.
Untrimmed | 2 |  If the sweep creates a polysurface with kinks, the component surfaces will be untrimmed.
See Also
Reference
Rhino.Geometry Namespace