RhinoCommon API
RhinoDocObserverArgs Class
 Arguments passed to IRhinoDocObserver methods.
Inheritance Hierarchy
System.Object
 Rhino.RhinoDocObserverArgs
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RhinoDocObserverArgs
Public Class RhinoDocObserverArgs
The RhinoDocObserverArgs type exposes the following members.
Constructors
Name | Description
RhinoDocObserverArgs
Initializes a new instance of the RhinoDocObserverArgs class
Top
Properties
Name | Description
Doc
 Document
RuntimeSerialNumber
 Document runtime serial number, will be different across Rhino sessions.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino Namespace