RhinoCommon API
DefinedViewportProjection Enumeration
Parallel and perspective projections that are "standard" in Rhino
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum DefinedViewportProjection
Public Enumeration DefinedViewportProjection
Members
Member name | Value | Description
None | 0
Top | 1
Bottom | 2
Left | 3
Right | 4
Front | 5
Back | 6
Perspective | 7
TwoPointPerspective | 8
ParallelReflected | 9
See Also
Reference
Rhino.Display Namespace