RhinoCommon API
File3dmMaterialTable Class
 Provides access to materials in the 3dm file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<Material>
 Rhino.FileIO.File3dmCommonComponentTable<Material>
 Rhino.FileIO.File3dmMaterialTable
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmMaterialTable : File3dmCommonComponentTable<Material>,
	IList<Material>, ICollection<Material>, IEnumerable<Material>,
	IEnumerable
Public Class File3dmMaterialTable
	Inherits File3dmCommonComponentTable(Of Material)
	Implements IList(Of Material), ICollection(Of Material),
	IEnumerable(Of Material), IEnumerable
The File3dmMaterialTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns RenderMaterial.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
Methods
Name | Description
AddMaterial
 Adds a material to the model material table
FindIndex
 Retrieves a material based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
Top
See Also
Reference
Rhino.FileIO Namespace