RhinoCommon API
ViewCaptureWriter.PointType Enumeration
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.PointType"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum PointType
Public Enumeration PointType
Members
Member name | Value | Description
Move | 0
Line | 1
CubicBezier | 2
Close | 3
Arc | 4
See Also
Reference
Rhino.Runtime Namespace