RhinoCommon API
SuspendCollectionChangedEventHandler<T> Class
 Using this on a subscribed event handler for the given TrulyObservableOrderedSet<T> will suspend notifications to the specified handler until SuspendCollectionChangedEventHandler<T> is disposed.
Inheritance Hierarchy
System.Object
 Rhino.Notifications.SuspendCollectionChangedEventHandler<T>
 Namespace: Rhino.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SuspendCollectionChangedEventHandler<T> : IDisposable
where T : INotifyPropertyChanged, IAssemblyRestrictedObject
Public Class SuspendCollectionChangedEventHandler(Of T As {INotifyPropertyChanged, IAssemblyRestrictedObject})
	Implements IDisposable
Type Parameters
T
The SuspendCollectionChangedEventHandler<T> type exposes the following members.
Constructors
Name | Description
SuspendCollectionChangedEventHandler<T>
 Constructor. Notifications from the set to the handler are suspended until this object is disposed.
Top
Methods
Name | Description
Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
Top
See Also
Reference
Rhino.Notifications Namespace