RhinoCommon API
OptionString Class
 RhinoGet string option helper
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.OptionString
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public class OptionString : IDisposable
Public Class OptionString
	Implements IDisposable
The OptionString type exposes the following members.
Constructors
Name | Description
OptionString(String)
 Constructs the option object.
OptionString(String, Boolean)
 Constructs the option object.
Top
Properties
Name | Description
CurrentValue
 Gets and sets the current value of the option.
InitialValue
 Gets the initial value of the option.
Top
Methods
Name | Description
Dispose()
Releases all resources used by the OptionString
Dispose(Boolean)
Releases the unmanaged resources used by the OptionString and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Input.Custom Namespace