RhinoCommon API
RebuildCurveIntensity Enumeration
 RebuildCurveIntensity used used to specify rebuild smoothing and uniformity intensities.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum RebuildCurveIntensity
Public Enumeration RebuildCurveIntensity
Members
Member name | Value | Description
None | 0
Low | 1
Moderate | 2
Medium | 3
High | 4
Extreme | 5
See Also
Reference
Rhino.Geometry Namespace