RhinoCommon API
File3dmHatchPatternTable Class
 Provides access to hatch pattern definitions in the 3dm file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<HatchPattern>
 Rhino.FileIO.File3dmCommonComponentTable<HatchPattern>
 Rhino.FileIO.File3dmHatchPatternTable
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmHatchPatternTable : File3dmCommonComponentTable<HatchPattern>,
	IList<HatchPattern>, ICollection<HatchPattern>, IEnumerable<HatchPattern>,
	IEnumerable
Public Class File3dmHatchPatternTable
	Inherits File3dmCommonComponentTable(Of HatchPattern)
	Implements IList(Of HatchPattern), ICollection(Of HatchPattern),
	IEnumerable(Of HatchPattern), IEnumerable
The File3dmHatchPatternTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns HatchPattern.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
Methods
Name | Description
FindIndex
 Retrieves a HatchPattern object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds a HatchPattern given its name.
FindNameHash
 Finds a HatchPattern given its name hash.
Top
See Also
Reference
Rhino.FileIO Namespace