RhinoCommon API
WorksessionFileLayerValues Class
 Layer settings saved in a Rhino worksession (.rws) file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.WorksessionFileLayerValues
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public sealed class WorksessionFileLayerValues : IDisposable
Public NotInheritable Class WorksessionFileLayerValues
	Implements IDisposable
The WorksessionFileLayerValues type exposes the following members.
Constructors
Name | Description
WorksessionFileLayerValues()
Creates layer settings with the defaults: visible, unlocked and black.
WorksessionFileLayerValues(WorksessionFileLayerValues)
Creates a copy of other layer settings.
Top
Properties
Name | Description
Color
Gets or sets the layer color.
Locked
Gets or sets whether the layer is locked.
Visible
Gets or sets whether the layer is visible.
Top
Methods
Name | Description
Dispose
Releases the native layer settings.
Finalize
Releases the native layer settings.
 (Overrides Object.Finalize().)
GetLayer
 Gets a copy of the rest of the layer's settings, saved by Rhino 9 and later. Reading an older file leaves this set to a default layer.
SetLayer
Replaces the layer settings with a copy of layer.
Top
See Also
Reference
Rhino.FileIO Namespace