RhinoCommon API
IPanel Interface
 Implement this interface when you want to be notified of when a panel is shown, hidden or closed.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IPanel
Public Interface IPanel
The IPanel type exposes the following members.
Methods
Name | Description
PanelClosing
PanelHidden
PanelShown
Top
See Also
Reference
Rhino.UI Namespace