RhinoCommon API
RdkUndoRecord Class
 RdkUndoRecord class
Inheritance Hierarchy
System.Object
 Rhino.Render.RdkUndoRecord
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class RdkUndoRecord : IDisposable
Public NotInheritable Class RdkUndoRecord
	Implements IDisposable
The RdkUndoRecord type exposes the following members.
Constructors
Name | Description
RdkUndoRecord
 Constructor for RdkUndoRecord
Top
Methods
Name | Description
Dispose
 Dispose for RdkUndoRecord
Finalize
 Destructor for RdkUndoRecord
 (Overrides Object.Finalize().)
SetDescription
 Set description for RdkUndoRecord
Top
See Also
Reference
Rhino.Render Namespace