RhinoCommon API
MeshObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.MeshObject"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.MeshObject
 Rhino.DocObjects.Custom.CustomMeshObject
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MeshObject : RhinoObject
Public Class MeshObject
	Inherits RhinoObject
The MeshObject type exposes the following members.
Properties
Name | Description
IsCustomObject
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
MeshGeometry
Top
Methods
Name | Description
CheckMeshes
 Examines mesh objects and logs a description of what it finds right or wrong. The various properties the function checks for are described in MeshCheckParameters.
DuplicateMeshGeometry
SetMesh
 Only for developers who are defining custom subclasses of MeshObject. Directly sets the internal mesh geometry for this object. Note that this function does not work with Rhino's "undo".
Top
See Also
Reference
Rhino.DocObjects Namespace