RhinoCommon API
FileNwd Class
 Support for writing Nwd file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileNwd
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileNwd
Public NotInheritable Class FileNwd
The FileNwd type exposes the following members.
Methods
Name | Description
Write
Write a nwd file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace