RhinoCommon API
HistorySettings Class
 Provides static (Shared in Vb.Net) properties to modify Rhino History settings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.HistorySettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class HistorySettings
Public NotInheritable Class HistorySettings
The HistorySettings type exposes the following members.
Properties
Name | Description
BrokenRecordWarningEnabled
 Displays a warning dialog when an action is taken that breaks the link between the output and input objects.
ObjectLockingEnabled
 When history object locking is enabled, objects with history on them act as if they were locked and the only way to modify these objects is to edit their inputs.
RecordingEnabled
 When history recording is enabled, new objects keep a record of how they were constructed so that they can be updated if an input object changes.
RecordNextCommand
 Enable history recording until the end of the next command
UpdateEnabled
 When history update is enabled, dependent objects are automatically updated when an antecedent is modified.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace