RhinoCommon API
RenderMeshProviderProgress Class
 Expresses the progress of a custom render mesh provider.
Inheritance Hierarchy
System.Object
 Rhino.Render.CustomRenderMeshes.RenderMeshProviderProgress
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderMeshProviderProgress
Public Class RenderMeshProviderProgress
The RenderMeshProviderProgress type exposes the following members.
Constructors
Name | Description
RenderMeshProviderProgress
Initializes a new instance of the RenderMeshProviderProgress class
Top
Properties
Name | Description
Amount
 The amount of progress towards the target
IsComplete
 true if complete, otherwise false.
ProviderId
 The Id of the RenderMeshProvider that this report came from.
Target
 Target progress
Text
 Return a textural progress report
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render.CustomRenderMeshes Namespace