RhinoCommon API
MouseButton Enumeration
[Missing <summary> documentation for "T:Rhino.UI.MouseButton"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[FlagsAttribute]
public enum MouseButton
<FlagsAttribute>
Public Enumeration MouseButton
Members
Member name | Value | Description
None | 0
Left | 1
Right | 2
Middle | 4
See Also
Reference
Rhino.UI Namespace