RhinoCommon API
FileLwoWriteOptions Class
 Options for writing a Lwo file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileLwoWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileLwoWriteOptions
Public Class FileLwoWriteOptions
The FileLwoWriteOptions type exposes the following members.
Constructors
Name | Description
FileLwoWriteOptions
Initializes a new instance of the FileLwoWriteOptions class
Top
Properties
Name | Description
MeshingParameters
WriteVersion6
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace