RhinoCommon API
RhinoAccountsException Class
 Base exception for all Rhino Accounts operations.
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.RhinoAccounts.RhinoAccountsException
 More...
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class RhinoAccountsException : Exception
<SerializableAttribute>
Public Class RhinoAccountsException
	Inherits Exception
The RhinoAccountsException type exposes the following members.
Constructors
Name | Description
RhinoAccountsException(Exception)
 Generates a new instance of the exception.
RhinoAccountsException(String, Exception)
 Generates a new instance of the exception.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.RhinoAccounts.RhinoAccountsException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsAuthTokenMismatchException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsCannotListenException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsInvalidResponseException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsInvalidStateException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsInvalidTokenException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsOperationInProgressException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsProxyException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsServerException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsServerNotReachableException