RhinoCommon API
File3dmGroupTable Class
 Provides access to groups in the 3dm file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<Group>
 Rhino.FileIO.File3dmCommonComponentTable<Group>
 Rhino.FileIO.File3dmGroupTable
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmGroupTable : File3dmCommonComponentTable<Group>,
	IList<Group>, ICollection<Group>, IEnumerable<Group>,
	IEnumerable
Public Class File3dmGroupTable
	Inherits File3dmCommonComponentTable(Of Group)
	Implements IList(Of Group), ICollection(Of Group),
	IEnumerable(Of Group), IEnumerable
The File3dmGroupTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns Group.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
Methods
Name | Description
AddGroup
 Adds a new empty group to the group table.
FindIndex
 Retrieves a Group object based on an index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds a Group given its name.
FindNameHash
 Finds a Group given its name hash.
GroupMembers
 Gets an array of all of the objects in a group.
Top
See Also
Reference
Rhino.FileIO Namespace