RhinoCommon API
MeshTopologyVertexList Class
 Provides access to the mesh topology vertices of a mesh. Topology vertices are sets of vertices in the MeshVertexList that can topologically be considered the same vertex.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.MeshTopologyVertexList
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MeshTopologyVertexList : IEnumerable<Point3f>,
	IEnumerable, IList<Point3f>, ICollection<Point3f>,
	IList, ICollection, IReadOnlyList<Point3f>, IReadOnlyCollection<Point3f>
Public Class MeshTopologyVertexList
	Implements IEnumerable(Of Point3f), IEnumerable,
	IList(Of Point3f), ICollection(Of Point3f), IList,
	ICollection, IReadOnlyList(Of Point3f), IReadOnlyCollection(Of Point3f)
The MeshTopologyVertexList type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of mesh topology vertices.
Item
 Gets or sets the vertex at the given index. Setting a location adjusts all vertices in the mesh's vertex list that are defined by this topological vertex The index must be valid or an IndexOutOfRangeException will be thrown.
Top
Methods
Name | Description
ConnectedEdge
 Gets a particular edge that is connected to a topological vertex.
Call TopologyVertices.SortVertices before this if you are interested in ordered edges.
ConnectedEdges
 Gets all edges that are connected to a given vertex.
Call TopologyVertices.SortVertices before this if you are interested in ordered edges.
ConnectedEdgesCount
 Gets the count of edges that are connected to a given vertex.
ConnectedFaces
 Gets all faces that are connected to a given vertex.
ConnectedTopologyVertices(Int32)
 Gets all topological vertices that are connected to a given vertex.
ConnectedTopologyVertices(Int32, Boolean)
 Gets all topological vertices that are connected to a given vertex.
GetEnumerator
 Gets an enumerator that yields all topology vertices in this collection.
IndicesFromFace
 Returns TopologyVertexIndices for a given mesh face index.
IsHidden
 Returns true if the topological vertex is hidden. The mesh topology vertex is hidden if and only if all the ON_Mesh vertices it represents is hidden.
MeshVertexIndices
 Gets all indices of the mesh vertices that a given topology vertex represents.
SortEdges()
 Sorts the edge list for the mesh topology vertex list so that the edges are in radial order when you call ConnectedTopologyVertices. A non-manifold edge is treated as a boundary edge with respect to sorting. If any boundary or non-manifold edges end at the vertex, then the first edge will be a boundary or non-manifold edge.
SortEdges(Int32)
 Sorts the edge list for as single mesh topology vertex so that the edges are in radial order when you call ConnectedTopologyVertices. A non-manifold edge is treated as a boundary edge with respect to sorting. If any boundary or non-manifold edges end at the vertex, then the first edge will be a boundary or non-manifold edge.
TopologyVertexIndex
 Gets the topology vertex index for an existing mesh vertex in the mesh's VertexList.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace