RhinoCommon API
CurveObject Class
 A Rhino Object that represents curve geometry and attributes
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.CurveObject
 Rhino.DocObjects.Custom.CustomCurveObject
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class CurveObject : RhinoObject
Public Class CurveObject
	Inherits RhinoObject
The CurveObject type exposes the following members.
Properties
Name | Description
CurveGeometry
 Returns the underlying curve geometry.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Top
Methods
Name | Description
DuplicateCurveGeometry
 Returns a copy of the underlying curve geometry.
GetLinetypeSegments()
 Converts the linetype pattern of the curve into curve segments and points based on the active Rhino viewport.
GetLinetypeSegments(RhinoViewport)
 Converts the linetype pattern of the curve into curve segments and points based on the specified Rhino viewport.
Top
See Also
Reference
Rhino.DocObjects Namespace