RhinoCommon API
DocumentCollectedException Class
 Represents the error that happen when a class user attempts to execute a modifying operation on an object that has been added to a document.
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.DocumentCollectedException
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class DocumentCollectedException : Exception
<SerializableAttribute>
Public Class DocumentCollectedException
	Inherits Exception
The DocumentCollectedException type exposes the following members.
Constructors
Name | Description
DocumentCollectedException()
 Initializes a new instance of the document controlled exception class.
DocumentCollectedException(String)
 Initializes a new instance of the document collected exception class.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Runtime Namespace