RhinoCommon API
FileSkpWriteOptions.SketchUpVersion Enumeration
 SketchUp Versions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum SketchUpVersion
Public Enumeration SketchUpVersion
Members
Member name | Value | Description
SketchUp3 | 0
SketchUp4 | 1
SketchUp5 | 2
SketchUp6 | 3
SketchUp7 | 4
SketchUp8 | 5
SketchUp2013 | 6
SketchUp2014 | 7
SketchUp2015 | 8
SketchUp2016 | 9
SketchUp2017 | 10
SketchUp2018 | 11
SketchUp2019 | 12
SketchUp2020 | 13
SketchUp2021 | 14
See Also
Reference
Rhino.FileIO Namespace