RhinoCommon API
ThumbData Class
Note: This API is now obsolete.
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.ThumbData"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.ThumbnailUI.ThumbData
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("ThumbData is obsolete", false)]
public class ThumbData
<ObsoleteAttribute("ThumbData is obsolete", false)>
Public Class ThumbData
The ThumbData type exposes the following members.
Constructors
Name | Description
ThumbData
Initializes a new instance of the ThumbData class
Top
Properties
Name | Description
Children
Content
Id
Image
Intensity
InUse
InUseColor
Name
Parent
PreviewAppearance
Selected
Tags
TopLevel
Type
Top
Methods
Name | Description
GetPreviewHeigth
GetPreviewWidth
Top
Events
Name | Description
PropertyChanged
Top
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace