RhinoCommon API
DimensionStyle.ZeroSuppression Enumeration
 Marks leading and trailing zeros for removal.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ZeroSuppression
Public Enumeration ZeroSuppression
Members
Member name | Value | Description
None | 0 | No zero suppression.
SuppressLeading | 1 | Suppress leading zeros.
SuppressTrailing | 2 | Suppress trailing zeros.
SuppressLeadingAndTrailing | 3 | Suppress leading and trailing zeros.
SuppressZeroFeet | 4 | Suppress zero feet.
SuppressZeroInches | 8 | Suppress zero inches.
SuppressZeroFeetAndZeroInches | 12 | Suppress zero feet and zero inches.
See Also
Reference
Rhino.DocObjects Namespace