RhinoCommon API
FileCsvWriteOptions Class
 Options for writing a Csv file. Set any value you want included in the output to true. With the exception of Header and CumulativeMassProperties, all checked items apply to each and every object exported.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileCsvWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileCsvWriteOptions
Public Class FileCsvWriteOptions
The FileCsvWriteOptions type exposes the following members.
Constructors
Name | Description
FileCsvWriteOptions
Initializes a new instance of the FileCsvWriteOptions class
Top
Properties
Name | Description
Area
AreaCentroid
AreaMoments
AttributesKeys
User text
AttributesTexts
CumulativeMassProperties
GroupIndexes
GroupName
Group information
Header
General
LayerColor
LayerHierarchy
LayerIndex
LayerName
Layer information
Length
Mass properties
ObjectColor
ObjectDescription
ObjectID
ObjectKeys
ObjectMaterial
ObjectName
Object information
ObjectsTexts
Perimeter
SurroundPointsWithDoubleQuotes
Volume
VolumeCentroid
VolumeMoments
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace