RhinoCommon API
FileTxtReadOptions Class
 Options for writing a Txt file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileTxtReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileTxtReadOptions
Public Class FileTxtReadOptions
The FileTxtReadOptions type exposes the following members.
Constructors
Name | Description
FileTxtReadOptions
Initializes a new instance of the FileTxtReadOptions class
Top
Properties
Name | Description
CreatePointCloud
Delimiter
DelimiterCharacter
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace