RhinoCommon API
SectionStyleTable Class
 Section style table
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<SectionStyle>
 Rhino.DocObjects.Tables.RhinoDocCommonTable<SectionStyle>
 Rhino.DocObjects.Tables.SectionStyleTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public sealed class SectionStyleTable : RhinoDocCommonTable<SectionStyle>,
	ICollection<SectionStyle>, IEnumerable<SectionStyle>, IEnumerable
Public NotInheritable Class SectionStyleTable
	Inherits RhinoDocCommonTable(Of SectionStyle)
	Implements ICollection(Of SectionStyle), IEnumerable(Of SectionStyle),
	IEnumerable
The SectionStyleTable type exposes the following members.
Properties
Name | Description
ActiveCount
 Returns number of section styles in the table, excluding deleted section styles.
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
 Returns number of section styles in the section style table, including deleted section styles.
 This count also spans table slots emptied by a purge, so it can be larger than the number of section styles that are actually there. See the remarks on the indexer.
Document
 Document that owns this table.
Item
 Conceptually, the section style table is an array of section styles. The operator[] can be used to get individual section styles. A section style is either active or deleted and this state is reported by SectionStyle.IsDeleted.
Top
Methods
Name | Description
Add
 Adds a new section style with specified definition to the table.
AddReferenceSectionStyle
 Adds a reference section style that will not be saved in files.
Delete(SectionStyle)
 Deletes a section style.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(IEnumerable<Int32>, Boolean)
 Delete multiple section styles.
Delete(Int32, Boolean)
 Deletes a section style.
Delete(IEnumerable<Int32>, Boolean, Int32)
 Delete multiple section styles.
Find(String)
Finds the section style with a given name.
Find(Guid, Boolean)
Finds a section style with a matching ID.
FindIndex
 Retrieves a section style based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
Finds the section style with a given name.
GetEnumerator |  (Overrides CommonComponentTable<T>.GetEnumerator().)
GetUnusedSectionStyleName
 Gets unused section style name used as default when creating new section styles.
InUse
 Returns true if a section style is use by an object, layer, or instance definition.
Modify
Modify section style settings.
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace