RhinoCommon API
TextureMapping Class
 Represents a texture mapping.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.Render.TextureMapping
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class TextureMapping : ModelComponent
Public NotInheritable Class TextureMapping
	Inherits ModelComponent
The TextureMapping type exposes the following members.
Properties
Name | Description
Capped
 // The m_bCapped applies to planar, cylinder and box mappings. If m_bCapped is false, the cylinder or box is "infinite", if m_bCapped is true, they are finite. In planar mappings, m_bCapped=false means "the Z texture coordinate will always be 0.0" this is now the default behaviour in Rhino 5.0 - it's what users expect apparently.
ComponentType
 Returns TextureMapping.
 (Overrides ModelComponent.ComponentType.)
Id
 The unique Id for this texture mapping object.
 (Overrides ModelComponent.Id.)
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
MappingType
 Texture mapping type associated with this Mapping object.
NormalTransform
 For primitive based mappings, these transformations are used to map the world coordinate (x,y,z) point P and surface normal N before it is projected to the normalized mapping primitive. The surface normal transformation, m_Nxyz, is always calculated from m_Pxyz. It is a runtime setting that is not saved in 3dm files. If m_type is srfp_mapping, then m_Pxyz and m_Nxyz are ignored.
PrimativeTransform |  Obsolete.
 For primitive based mappings, these transformations are used to map the world coordinate (x,y,z) point P and surface normal N before it is projected to the normalized mapping primitive. The surface normal transformation, m_Nxyz, is always calculated from m_Pxyz. It is a runtime setting that is not saved in 3dm files. If m_type is srfp_mapping, then m_Pxyz and m_Nxyz are ignored.
PrimitiveTransform
 For primitive based mappings, these transformations are used to map the world coordinate (x,y,z) point P and surface normal N before it is projected to the normalized mapping primitive. The surface normal transformation, m_Nxyz, is always calculated from m_Pxyz. It is a runtime setting that is not saved in 3dm files. If m_type is srfp_mapping, then m_Pxyz and m_Nxyz are ignored.
Projection
 See Projection
TextureSpace
 See TextureSpace
UvwTransform
 Transform applied to mapping coordinate (u,v,w) to convert it into a texture coordinate.
Top
Methods
Name | Description
CreateBoxMapping
Create a box projection texture mapping.
CreateCustomMeshMapping
 Create custom mesh mapping
CreateCylinderMapping
Create a cylindrical projection texture mapping.
CreateOcsMapping
 Create a Ocs texture mapping. Note that OCS mappings must be placed on mapping channel ON_ObjectRenderingAttributes::OCSMappingChannelId() otherwise they will not work.
CreatePlaneMapping(Plane, Interval, Interval, Interval)
Create a planar UV projection texture mapping
CreatePlaneMapping(Plane, Interval, Interval, Interval, Boolean)
Create a planar projection texture mapping
CreateSphereMapping
 Create a spherical projection texture mapping.
CreateSurfaceParameterMapping
Create a mapping that will convert surface parameters into normalized(0,1)x(0,1) texture coordinates.
Decompose
 Gets the same decomposition of the texture mapping transforms as is used in the UI.
Evaluate(Point3d, Vector3d, Point3d)
 Evaluate the mapping to get a texture coordinate
Evaluate(Point3d, Vector3d, Point3d, Transform, Transform)
 Evaluate the mapping to get a texture coordinate
TryGetMappingBox(Plane, Interval, Interval, Interval)
 Get a box projection from the texture mapping.
TryGetMappingBox(Plane, Interval, Interval, Interval, Boolean)
 Get a box projection from the texture mapping, including capped information
TryGetMappingCylinder(Cylinder)
 Get a cylindrical projection parameters from this texture mapping.
TryGetMappingCylinder(Cylinder, Boolean)
 Get a cylindrical projection parameters from this texture mapping.
TryGetMappingMesh
 Get custom mapping mesh from this texture mapping.
TryGetMappingPlane(Plane, Interval, Interval, Interval)
 Get plane mapping parameters from this texture mapping.
TryGetMappingPlane(Plane, Interval, Interval, Interval, Boolean)
 Get plane mapping parameters from this texture mapping, including capping information
TryGetMappingSphere
 Get a spherical projection parameters from this texture mapping.
Top
See Also
Reference
Rhino.Render Namespace