RhinoCommon API
GripUserInterfaceObject Class
 A point style user interface widget that can be dragged in world space
Inheritance Hierarchy
System.Object
 Rhino.UI.UserInterfaceObjectBase
 Rhino.UI.GripUserInterfaceObject
 Rhino.UI.DirectionGripUserInterfaceObject
 Rhino.UI.RotationGripUserInterfaceObject
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GripUserInterfaceObject : UserInterfaceObjectBase
Public Class GripUserInterfaceObject
	Inherits UserInterfaceObjectBase
The GripUserInterfaceObject type exposes the following members.
Constructors
Name | Description
GripUserInterfaceObject()
Initializes a new instance of the GripUserInterfaceObject class
GripUserInterfaceObject(Point3d)
Initializes a new instance of the GripUserInterfaceObject class
Top
Properties
Name | Description
GripColor
GripFillColor
GripLocation
GripRadius
GripShape
GripShapeRotationRadians
GripStrokeWidth
ObjectSnapCursorsEnabled
ObjectSnapPermitted
OnObjectCursorsEnabled
Top
Methods
Name | Description
ClearSnapPoints
Constrain(Arc)
Constrain(Circle)
Constrain(Curve)
Constrain(Line)
OnDrag
SetSnapPoints
Top
See Also
Reference
Rhino.UI Namespace