RhinoCommon API
FileUdo Class
 Support for writing Moray UDO file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileUdo
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileUdo
Public NotInheritable Class FileUdo
The FileUdo type exposes the following members.
Methods
Name | Description
Write
Write a Moray UDO file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace