RhinoCommon API
CustomMeshObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.CustomMeshObject"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.MeshObject
 Rhino.DocObjects.Custom.CustomMeshObject
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class CustomMeshObject : MeshObject,
	IDisposable
Public MustInherit Class CustomMeshObject
	Inherits MeshObject
	Implements IDisposable
The CustomMeshObject type exposes the following members.
Constructors
Name | Description
CustomMeshObject()
Initializes a new instance of the CustomMeshObject class
CustomMeshObject(Mesh)
Initializes a new instance of the CustomMeshObject class
Top
Properties
Name | Description
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Top
Methods
Name | Description
Dispose()
Releases all resources used by the CustomMeshObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomMeshObject and optionally releases the managed resources
 (Overrides CommonObject.Dispose(Boolean).)
Finalize |  (Overrides CommonObject.Finalize().)
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace