RhinoCommon API
HiddenLineDrawingSegment.SideFill Enumeration
 When a silhouette is projected on the image plane (determined by the camera location or direction), and projects to a curve (not a point), the image area to the left or right of a projected silhouette curve is filled with either the surface or a void.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum SideFill
Public Enumeration SideFill
Members
Member name | Value | Description
SideUnset | 0 |  Unset
SideSurface | 1 |  Surface
SideVoid | 2 |  Void
OtherSurface | 3 |  Other Surface
See Also
Reference
Rhino.Geometry Namespace