RhinoCommon API
ExtensionMethods Class
[Missing <summary> documentation for "T:Rhino.Render.ExtensionMethods"]
Inheritance Hierarchy
System.Object
 Rhino.Render.ExtensionMethods
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class ExtensionMethods
<ExtensionAttribute>
Public NotInheritable Class ExtensionMethods
The ExtensionMethods type exposes the following members.
Methods
Name | Description
ToEnvironmentMappingMode
ToSimulatedEnvironmentMappingMode
ToSimulatedTextureProjectionMode
ToTextureProjectionMode
Top
See Also
Reference
Rhino.Render Namespace