RhinoCommon API
RhinoDoc.WorksessionFileChangedEventArgs Class
 Event arguments for WorksessionFileChanged. At the time of the notification, the document state already reflects the change: attached models' objects/layers are present, detached models' objects/layers have been purged.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.RhinoDoc.WorksessionFileChangedEventArgs
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class WorksessionFileChangedEventArgs : EventArgs
Public Class WorksessionFileChangedEventArgs
	Inherits EventArgs
The RhinoDoc.WorksessionFileChangedEventArgs type exposes the following members.
Properties
Name | Description
ChangeKind
Whether the model was attached or detached.
Document
Document the worksession belongs to.
FilePath
Full path of the .3dm file being attached or detached.
WorksessionModelRuntimeSerialNumber
 Runtime serial number of the worksession reference model being attached or detached. Not persistent across sessions.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino Namespace