RhinoCommon API
IRhinoDocObserver Interface
 Implement this interface if you are a modeless interface to aid in handling multiple document implementations
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IRhinoDocObserver
Public Interface IRhinoDocObserver
The IRhinoDocObserver type exposes the following members.
Methods
Name | Description
ActiveRhinoDocChanged
 In Windows Rhino this will mean a new document has been created or opened. In Mac Rhino this can mean the same thing as well it can indicate switching from one active open document to another.
RhinoDocClosed
 When a document is closed
Top
See Also
Reference
Rhino Namespace