RhinoCommon API
PreviewSceneQuality Enumeration
Quality levels when creating preview images
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public enum PreviewSceneQuality
Public Enumeration PreviewSceneQuality
Members
Member name | Value | Description
RealtimeQuick | 1 |  Obsolete. Very fast preview. Typically using the internal OpenGL preview generator.
RefineFirstPass | 1 |  Obsolete. Low quality rendering for quick preview.
RefineSecondPass | 2 |  Obsolete. Medium quality rendering for intermediate preview.
RefineThirdPass | 4 |  Obsolete. Full quality rendering (quality comes from user settings)
None | 0 |  No quality set.
Low | 1 |  Low quality rendering for quick preview.
Medium | 2 |  Medium quality rendering for intermediate preview.
IntermediateProgressive | 3 |  Intermediate update, always considered better quality than the previous IntermediateProgressive, but not as high as Full.
Full | 4 |  Full quality rendering (quality comes from user settings).
See Also
Reference
Rhino.Render Namespace