RhinoCommon API
DimensionObject Class
 Rhino Object that represents dimension geometry and attributes
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.AnnotationObjectBase
 Rhino.DocObjects.DimensionObject
 Rhino.DocObjects.AngularDimensionObject
 Rhino.DocObjects.CentermarkObject
 Rhino.DocObjects.LinearDimensionObject
 Rhino.DocObjects.OrdinateDimensionObject
 Rhino.DocObjects.RadialDimensionObject
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DimensionObject : AnnotationObjectBase
Public Class DimensionObject
	Inherits AnnotationObjectBase
The DimensionObject type exposes the following members.
Properties
Name | Description
DimensionStyle
 Gets the DimensionStyle associated with this OrdinateDimensionObject.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace