RhinoCommon API
Font.FontType Enumeration
 An enum that reports if the font face is available on the current device.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum FontType
Public Enumeration FontType
Members
Member name | Value | Description
Unset | 0 |  Not set.
ManagedFont | 1 |  In the managed font list.
InstalledFont | 2 |  In the installed font list.
See Also
Reference
Rhino.DocObjects Namespace