RhinoCommon API
UndoRecordEntry Class
 Represents a single entry in a document's undo or redo history.
Inheritance Hierarchy
System.Object
 Rhino.UndoRecordEntry
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class UndoRecordEntry
Public NotInheritable Class UndoRecordEntry
The UndoRecordEntry type exposes the following members.
Properties
Name | Description
Description
 The name of the command that created the undoable events, or a description of what created them when they did not happen in a command.
SerialNumber
 The runtime serial number Rhino assigned to this undo event.
Top
Methods
Name | Description
ToString
 Returns Description.
 (Overrides Object.ToString().)
Top
Remarks
 A document deletes its records as undo and redo are performed. An UndoRecordEntry is a snapshot of a record, so it remains usable after the document's history changes. Once the history has changed, the value of SerialNumber may no longer identify a record in that history.
See Also
Reference
Rhino Namespace
RhinoDoc.GetUndoRecords()
RhinoDoc.GetRedoRecords()