RhinoCommon API
File3dmPlugInDataTable Class
 Table of custom data provided by plug-ins
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmPlugInDataTable
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmPlugInDataTable : IEnumerable<File3dmPlugInData>,
	IEnumerable
Public Class File3dmPlugInDataTable
	Implements IEnumerable(Of File3dmPlugInData), IEnumerable
The File3dmPlugInDataTable type exposes the following members.
Properties
Name | Description
Count
 Gets the number of File3dmPlugInData objects in this table.
Item
 Gets the File3dmPlugInData object at the given index.
Top
Methods
Name | Description
Clear
 Remove all entries from this table.
Dump
Prepares a text dump of table.
GetEnumerator
 Gets the enumerator that visits any File3dmPlugInData in this table.
TryRead
 Attempts to read a Rhino plug-in's custom data from the File3dm file.
Top
See Also
Reference
Rhino.FileIO Namespace