RhinoCommon API
TextVerticalAlignment Enumeration
 Vertical location of text attach point relative to text
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextVerticalAlignment
Public Enumeration TextVerticalAlignment
Members
Member name | Value | Description
Top | 0 |  Attach to top of an "I" on the first line. (Independent of glyphs being displayed.)
MiddleOfTop | 1 |  Attach to middle of an "I" on the first line. (Independent of glyphs being displayed.)
BottomOfTop | 2 |  Attach to baseline of first line. (Independent of glyphs being displayed.)
Middle | 3 |  Attach to middle of text vertical advance. (Independent of glyphs being displayed.)
MiddleOfBottom | 4 |  Attach to middle of an "I" on the last line. (Independent of glyphs being displayed.)
Bottom | 5 |  Attach to the baseline of the last line. (Independent of glyphs being displayed.)
BottomOfBoundingBox | 6 |  Attach to the bottom of the boudning box of the visible glyphs.
See Also
Reference
Rhino.DocObjects Namespace