RhinoCommon API
Dimension Class
 Base class for dimensions
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Dimension
 Rhino.Geometry.AngularDimension
 Rhino.Geometry.Centermark
 Rhino.Geometry.LinearDimension
 Rhino.Geometry.OrdinateDimension
 Rhino.Geometry.RadialDimension
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public abstract class Dimension : AnnotationBase
<SerializableAttribute>
Public MustInherit Class Dimension
	Inherits AnnotationBase
The Dimension type exposes the following members.
Constructors
Name | Description
Dimension()
Initializes a new instance of the Dimension class
Dimension(SerializationInfo, StreamingContext)
Initializes a new instance of the Dimension class
Top
Properties
Name | Description
AlternateBelowLine
AltLengthFactor
AltLengthResolution
AltLengthRoundoff
AltPrefix
AltSuffix
AltToleranceResolution
AltUnitsDisplay
AltZeroSuppression
ArrowBlockId1
ArrowBlockId2
ArrowFit
ArrowheadType1
ArrowheadType2
ArrowSize
BaselineSpacing
CentermarkSize
CentermarkStyle
DetailMeasured
DimensionLineExtension
DistanceScale
ExtensionLineExtension
ExtensionLineOffset
FixedExtensionLength
FixedLengthExtensionOn
ForceArrowPosition |  Obsolete.
ForceDimensionLineBetweenExtensionLines
ForceDimLine
ForceTextPosition |  Obsolete.
LengthFactor
LengthResolution
LengthRoundoff
NumericValue
 Gets the numeric value (or measurement), depending on geometry type.
LinearDimension: distance between arrow tips
RadialDimension: radius or diameter depending on type
AngularDimension: angle in radians
PlainUserText
Prefix
Suffix
SuppressDimensionLine1
 Suppresses the dimension line and arrowhead between the first extension line and the dimension text.
SuppressDimensionLine2
 Suppresses the dimension line and arrowhead between the second extension line and the dimension text.
SuppressExtension1
SuppressExtension2
TextAngleType
TextFit
TextFormula
TextLocation
TextOrientation
TextPosition
 Gets and sets the position of text on the plane.
TextRotation
ToleranceFormat
ToleranceHeightScale
ToleranceLowerValue
ToleranceResolution
ToleranceUpperValue
UseDefaultTextPoint
ZeroSuppression
Top
Methods
Name | Description
Explode
 Explodes this dimension into its geometric components.
GetTextTransform
 Get the transform for this text object's text geometry
SetAltDimensionLengthDisplayWithZeroSuppressionReset
SetDimensionLengthDisplayWithZeroSuppressionReset
UpdateDimensionText(DimensionStyle, LengthUnit)
 Remakes dimension text geometry object and sets it on the dimension.
UpdateDimensionText(DimensionStyle, UnitSystem) |  Obsolete.
 Remakes dimension text geometry object and sets it on the dimension.
Top
See Also
Reference
Rhino.Geometry Namespace