RhinoCommon API
IOAuth2Token Interface
 Represents an OAuth2 Token that can be used for authorization purposes.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IOAuth2Token
Public Interface IOAuth2Token
The IOAuth2Token type exposes the following members.
Properties
Name | Description
Exp
 The expiration of the token. Expired tokens will be considered invalid by the Rhino Accounts server.
IsExpired
 true if the token is expired; false otherwise.
RawToken
 The raw token that can be passed to various servers for authorization.
Scope
 The scope of the token.
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace