RhinoCommon API
Color4f Structure
 Color defined by 4 floating point values.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public struct Color4f : ISerializable
<SerializableAttribute>
Public Structure Color4f
	Implements ISerializable
The Color4f type exposes the following members.
Constructors
Name | Description
Color4f(Color)
Initializes a new instance of the Color4f class
Color4f(Color4f)
Initializes a new instance of the Color4f class
Color4f(Int32)
Initializes a new instance of the Color4f class
Color4f(Single, Single, Single, Single)
Initializes a new instance of the Color4f class
Top
Properties
Name | Description
A
B
Black
Empty
G
L
R
White
Top
Methods
Name | Description
ApplyGamma
AsSystemColor
BlendTo
Equals |  (Overrides ValueType.Equals(Object).)
FromArgb(Single, Color4f)
FromArgb(Single, Single, Single, Single)
GetHashCode |  (Overrides ValueType.GetHashCode().)
Top
Operators
Name | Description
Equality
Inequality
Top
See Also
Reference
Rhino.Display Namespace