RhinoCommon API
StackedDialogPage Class
 Base class to inherit from for the addition of stacked dialog pages.
Inheritance Hierarchy
System.Object
 Rhino.UI.StackedDialogPage
 Rhino.UI.OptionsDialogPage
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class StackedDialogPage
Public MustInherit Class StackedDialogPage
The StackedDialogPage type exposes the following members.
Constructors
Name | Description
StackedDialogPage
 Protected constructor
Top
Properties
Name | Description
Children
 List of child (sub) pages of this page
EnglishPageTitle
 English string used when scripting this page and a user prefixes a command option with "_"
Handle
 When running on Windows return the window handle for the parent of this page otherwise; return IntPtr.Zero.
HasChildren
 Will be true if this page contains sub pages.
LocalPageTitle
 Localized page title that will appear on a tab or other page navigation control. This is also uses as a command line option when scripting this page.
Modified
 Check to see if the page has been marked as modified or not. Marking the page as modified will cause the Apply button to get enabled if this is currently the visible page and the page includes the Apply button.
NavigationTextColor
 Currently only used by Windows Rhino. If this is set to true then the tree control item text be drawn using this color. Set the color to System.Drawing.Color.Empty to use the default color.
NavigationTextIsBold
 Currently only used by Windows Rhino. If this is set to true then the tree control item text will be bold.
PageControl
 Return the control that represents this page. Rhino Windows supports classes that implement the IWin32Windows interface or are derived from some form of System.Windows.FrameworkElement or Eto.Forms.Control. Mac Rhino supports controls that are derived from NSview or Eto.Forms.Control.
PageImage
 Optionally override to provide a image to display in the Mac Rhino UI
ShowApplyButton
Called when this page is activated
ShowDefaultsButton
Called when this page is activated.
Top
Methods
Name | Description
AddChildPage
 Currently only supported on Windows. Call this method to add a child page to a page after the parent dialog has been created.
MakeActivePage
 Make this page the active, visible page
OnActivate
Called when this page is activated/deactivated.
OnApply
Called when stacked dialog OK button is pressed.
OnCancel
Called when stacked dialog Cancel button is pressed.
OnCreateParent
 Called when the parent window has been created on Windows platforms only.
OnDefaults
Called when stacked dialog Defaults button is pressed (see ShowDefaultsButton).
OnHelp
 Called when the parent dialog requests help for this page.
OnSizeParent
 Called when the parent window has been resized
RemovePage
 Remove this page from the dialog box
SetActivePageTo
SetEnglishPageTitle
 Change the title passed to the constructor and, this will cause LocalPageTitle to get called also.
Top
See Also
Reference
Rhino.UI Namespace