RhinoCommon API
UndoRedoEventArgs Class
 Undo Redo Event Arguments
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Commands.UndoRedoEventArgs
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public class UndoRedoEventArgs : EventArgs
Public Class UndoRedoEventArgs
	Inherits EventArgs
The UndoRedoEventArgs type exposes the following members.
Properties
Name | Description
CommandId
 The id of the Rhino command. This can be Guid.Empty.
DocumentSerialNumber
 The document runtime serial number.
IsBeforeBeginRecording
IsBeforeEndRecording
IsBeginRecording
IsBeginRedo
IsBeginUndo
IsEndRecording
IsEndRedo
IsEndUndo
IsPurgeRecord
UndoSerialNumber
 The undo record serial number.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Commands Namespace