RhinoCommon API
RenderContentKindList Class
 Models a collection of kinds.
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderContentKindList
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class RenderContentKindList : IDisposable
Public NotInheritable Class RenderContentKindList
	Implements IDisposable
The RenderContentKindList type exposes the following members.
Constructors
Name | Description
RenderContentKindList()
 Construct an empty kind list
RenderContentKindList(IntPtr)
 Construct from native pointer - internal use only.
RenderContentKindList(RenderContentKindList)
 Construct a kind list from another.
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Add
 Add a kind to a kind list.
Contains
 Query whether or not the collection contains a particular kind designation.
Count
 The number of kinds in the collection
Dispose
 Dispose a kind list.
Finalize
 Kind list finalizer
 (Overrides Object.Finalize().)
SingleKind
 The single kind in the list. If the list does not contain exactly one kind, returns 'None'.
Top
See Also
Reference
Rhino.Render Namespace