RhinoCommon API
Utilities.ContentChooserFlags Enumeration
[Missing <summary> documentation for "T:Rhino.Render.Utilities.ContentChooserFlags"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public enum ContentChooserFlags
Public Enumeration ContentChooserFlags
Members
Member name | Value | Description
None | 0
HideNewTab | 1
HideExistingTab | 2
MultipleSelection | 4
DisableImportButton | 16
HideCopyOrShare | 32
See Also
Reference
Rhino.Render Namespace