RhinoCommon API
TextDotUserInterfaceObject Class
 User interface object that draws as a text dot
Inheritance Hierarchy
System.Object
 Rhino.UI.UserInterfaceObjectBase
 Rhino.UI.TextDotUserInterfaceObject
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class TextDotUserInterfaceObject : UserInterfaceObjectBase
Public Class TextDotUserInterfaceObject
	Inherits UserInterfaceObjectBase
The TextDotUserInterfaceObject type exposes the following members.
Constructors
Name | Description
TextDotUserInterfaceObject
 Create a text dot styled user interface object at a defined location and text
Top
Properties
Name | Description
DotBackgroundColor
 Text dot background color
DotBorderColor
 Text dot border color
MouseOverTextHeight
 Font height used when the mouse is over the dot. The default behavior is to grow the dot a small amount when the mouse is over to help the user know that the dot is acts as a user interface object
Text
 Text content for grip
TextColor
 Text color used for dot text
TextHeight
 Font height for text
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace