RhinoCommon API
WindowStyle Enumeration
 Specifies how a new window should appear when Rhino starts.
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum WindowStyle
Public Enumeration WindowStyle
Members
Member name | Value | Description
NoWindow | -1 |  The no window style.
Normal | 0 |  The normal, visible window style.
Hidden | 1 |  The hidden window style.
Minimized | 2 |  The minimized window style.
Maximized | 3 |  The maximized window style.
See Also
Reference
Rhino.Runtime.InProcess Namespace