RhinoCommon API
DetailView Class
 Represents a view of the model placed on a page layout.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.DetailView
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class DetailView : GeometryBase
<SerializableAttribute>
Public Class DetailView
	Inherits GeometryBase
The DetailView type exposes the following members.
Constructors
Name | Description
DetailView
 Protected serialization constructor for internal use.
Top
Properties
Name | Description
IsParallelProjection
 Gets or sets whether the view is parallel.
IsPerspectiveProjection
 Gets or sets whether the view is perspective.
IsProjectionLocked
 Gets or sets whether the view is locked.
PageToModelRatio
 Gets the ratio of page units to model units for this detail view. Returns 0 if the projection is not parallel.
Top
Methods
Name | Description
SetScale(Double, LengthUnit, Double, LengthUnit)
 Sets the detail viewport's projection so geometry is displayed at a certain scale.
SetScale(Double, UnitSystem, Double, UnitSystem) |  Obsolete.
 Sets the detail viewport's projection so geometry is displayed at a certain scale.
Top
See Also
Reference
Rhino.Geometry Namespace