RhinoCommon API
FilePlyReadOptions Class
 Options for reading a PLY file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FilePlyReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FilePlyReadOptions
Public Class FilePlyReadOptions
The FilePlyReadOptions type exposes the following members.
Constructors
Name | Description
FilePlyReadOptions
Initializes a new instance of the FilePlyReadOptions class
Top
Properties
Name | Description
PLYModelUnits
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace