RhinoCommon API
TextureType Enumeration
 The TextureType controls how the pixels in the bitmap are interpreted.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public enum TextureType
Public Enumeration TextureType
Members
Member name | Value | Description
None | 0
Bitmap | 1 |  Deprecated - this should be diffuse
Diffuse | 1 |  The diffuse color of the material, ideally the albedo.
Bump | 2 |  bump map
Transparency | 3 |  Deprecated - see Opacity. This has always actually meant opacity in Rhino, so there is nothing to change.
Opacity | 3 |  value = alpha
Emap | 86 |  Emap/Environment texture
PBR_BaseColor | 1 |  Physically based materials only - base color. Re-uses diffuse texture slot.
PBR_Subsurface | 10 |  Physically based materials only - subsurface (greyscale)
PBR_SubsurfaceScattering | 11 |  Physically based materials only - subsurface scattering
PBR_SubsurfaceScatteringRadius | 12 |  Physically based materials only - subsurface scattering radius (greyscale)
PBR_Metallic | 13 |  Physically based materials only - metallic (greyscale)
PBR_Specular | 14 |  Physically based materials only - specular (greyscale)
PBR_SpecularTint | 15 |  Physically based materials only - specular tint (greyscale)
PBR_Roughness | 16 |  Physically based materials only - roughness (greyscale)
PBR_Anisotropic | 17 |  Physically based materials only - anisotropic (greyscale)
PBR_Anisotropic_Rotation | 18 |  Physically based materials only - anisotropic rotation 0 = 0, 255 = 360
PBR_Sheen | 19 |  Physically based materials only - sheen (greyscale)
PBR_SheenTint | 20 |  Physically based materials only - sheen tint (greyscale)
PBR_Clearcoat | 21 |  Physically based materials only - clearcoat (greyscale)
PBR_ClearcoatRoughness | 22 |  Physically based materials only - clearcoat roughness (greyscale)
PBR_OpacityIor | 23 |  Physically based materials only - ior (greyscale - remaps from 1.0 to 2.0)
PBR_OpacityRoughness | 24 |  Physically based materials only - transparency roughness (greyscale)
PBR_Emission | 25 |  Physically based materials only - emission (greyscale)
PBR_AmbientOcclusion | 26 |  Physically based materials only - occlusion (greyscale)
PBR_Displacement | 28 |  Physically based materials only - normal 8-bit RGB, alpha is ignored
PBR_ClearcoatBump | 29 |  Physically based materials only - clearcoat normal or bump (normal map, RGB)
PBR_Alpha | 30 |  Physically based materials only - clearcoat normal or bump (normal map, RGB)
See Also
Reference
Rhino.DocObjects Namespace