RhinoCommon API
IPostEffects Interface
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.IPostEffects"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IPostEffects
Public Interface IPostEffects
The IPostEffects type exposes the following members.
Methods
Name | Description
GetPostEffects
PostEffectFromId
Top
See Also
Reference
Rhino.Render.PostEffects Namespace