RhinoCommon API
CommandLineOptionType Enumeration
 Behavior for a command line option
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum CommandLineOptionType
Public Enumeration CommandLineOptionType
Members
Member name | Value | Description
Simple | 0
Number | 1
Toggle | 2
Color | 3
List | 4
Hidden | 5
See Also
Reference
Rhino.Input.Custom Namespace