RhinoCommon API
InvalidDimensionStyleIdException Class
 General exception that can be thrown by annotations
Inheritance Hierarchy
System.Object
 System.Exception
 System.SystemException
 System.InvalidOperationException
 Rhino.Geometry.InvalidDimensionStyleIdException
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class InvalidDimensionStyleIdException : InvalidOperationException
Public Class InvalidDimensionStyleIdException
	Inherits InvalidOperationException
The InvalidDimensionStyleIdException type exposes the following members.
Constructors
Name | Description
InvalidDimensionStyleIdException
Initializes a new instance of the InvalidDimensionStyleIdException class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace