RhinoCommon API
LoadReturnCode Enumeration
 Rhino plug-in loading return codes.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum LoadReturnCode
Public Enumeration LoadReturnCode
Members
Member name | Value | Description
Success | 1
ErrorShowDialog | 0
ErrorNoDialog | -1
See Also
Reference
Rhino.PlugIns Namespace