RhinoCommon API
RenderPrimitiveList Class
Note: This API is now obsolete.
[Missing <summary> documentation for "T:Rhino.Render.RenderPrimitiveList"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderPrimitiveList
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use RenderPrimitives")]
public class RenderPrimitiveList : IDisposable
<ObsoleteAttribute("Use RenderPrimitives")>
Public Class RenderPrimitiveList
	Implements IDisposable
The RenderPrimitiveList type exposes the following members.
Properties
Name | Description
Count
 Number of meshes in this list
RhinoObject
 The Rhino object associated with this list
UseObjectsMappingChannels
 Returns true if the texture mapping will be taken from the Rhino object otherwise; the texture mapping will use the texture coordinates on the mesh only.
Top
Methods
Name | Description
Add(Box, RenderMaterial)
 Add primitive box and material.
Add(IEnumerable<Mesh>, RenderMaterial)
Add(Mesh, RenderMaterial)
 Add mesh and material.
Add(PlaneSurface, RenderMaterial)
 Add primitive plane and material.
Add(Sphere, RenderMaterial)
 Add primitive sphere and material.
Add(Cone, Plane, RenderMaterial)
 Add primitive cone and material.
Add(Mesh, RenderMaterial, Transform)
 Add mesh and material.
AutoDeleteMaterialsOn
AutoDeleteMeshesOn
Clear
 Remove all primitives from this list
ConvertMeshesToTriangles
 Convert mesh quad faces to triangle faces.
Dispose
Releases all resources used by the RenderPrimitiveList
Finalize |  (Overrides Object.Finalize().)
GetInstanceTransform
Material
 Call this method to get the render material associated with the mesh at the specified index. Will return null if there is no material associated with the requested mesh.
Mesh
 Get the mesh for the primitive at the specified index. If the item at this index is a primitive type other than a mesh then it mesh representation is returned.
MeshInstance
 Get the mesh for the primitive at the specified index. If the item at this index is a primitive type other than a mesh then it mesh representation is returned.
PrimitiveType
 Type of primitive object at this index.
SetInstanceTransform
ToMaterialArray
 Call this method to see if there are any RenderMaterials associated with the meshes. Each primitive can optionally have a RenderMaterial associated with it, if the RenderMaterial is null then check for a RhinoObject.RenderMaterial.
ToMeshArray
 Call this method to get a array of meshes, all primitives will get meshed and the meshes will get included in the returned array.
TryGetBox
 Call this method to get a box at the specified index.
TryGetCone
 Call this method to get a box at the specified index.
TryGetPlane
 Call this method to get a box at the specified index.
TryGetSphere
 Call this method to get a box at the specified index.
Top
See Also
Reference
Rhino.Render Namespace