RhinoCommon API
CustomGripObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.CustomGripObject"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.GripObject
 Rhino.DocObjects.Custom.CustomGripObject
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class CustomGripObject : GripObject,
	IDisposable
Public Class CustomGripObject
	Inherits GripObject
	Implements IDisposable
The CustomGripObject type exposes the following members.
Constructors
Name | Description
CustomGripObject
Initializes a new instance of the CustomGripObject class
Top
Properties
Name | Description
Index
 The grip's index. CustomObjectGrips.AddGrip already assigns this the grip's position in the grips list, and Rhino passes it back as the gripIndex argument of NeighborGrip and as the key of the grip direction cache. Setting it to anything else makes those arguments disagree with CustomObjectGrips.Grip(int), which is indexed by list position.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
MovedOtherThanLocation
 Set this when the grip changes something other than its location, such as a weight, so that Rhino counts the grip as moved. Rhino already counts a grip whose location moved, so this only adds to that. Cleared when Rhino undoes the grip move.
OriginalLocation
Weight |  (Overrides GripObject.Weight.)
Top
Methods
Name | Description
Dispose()
Releases all resources used by the CustomGripObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomGripObject and optionally releases the managed resources
 (Overrides CommonObject.Dispose(Boolean).)
EvaluateCurveCVIndices
 The indices of the NURBS curve control points this grip drives. A grip may drive more than one, as at a closed or periodic seam.
EvaluateCurveParameter
 The curve parameter of the control point this grip drives.
EvaluateGripDirections
 Evaluates this grip's directions. For a surface control point these are the two surface tangents and the normal; for a curve control point, the tangent and a frame around it. Rhino caches the result per grip and does not ask again, so the directions must not change once reported.
EvaluateSurfaceCVIndices
 The indices of the NURBS surface control points this grip drives. A grip may drive more than one, as at a closed or periodic seam or a singular edge. Every index must lie inside the surface returned by the owning CustomObjectGrips' NurbsSurface(). Rhino writes through these indices without checking them, so a grip reporting one outside the control point grid is refused whole.
EvaluateSurfaceParameters
 The surface parameters of the control point this grip drives.
Finalize |  (Overrides CommonObject.Finalize().)
NewLocation
OnUndoMove
 Called when Rhino undoes a grip move. Restore anything the grip changed alongside its location, such as a weight. The location itself is restored by Rhino.
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace