RhinoCommon API
SubDSurfaceInterpolator.MaximumCounts Enumeration
 Stores maximum count values for the solver to work in reasonable time.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum MaximumCounts
Public Enumeration MaximumCounts
Members
Member name | Value | Description
MaximumRecommendedInterpolatedVertexCount | 1000 |  Interpolation requires building a solver. If the number of interpolated vertices is greater than MaximumInterpolatedVertexCount, the solver construction time can be too long for some users' comfort. Given sufficient time, memory, and CPU resources, the code will work with any value
See Also
Reference
Rhino.Geometry Namespace