RhinoCommon API
RebuildCurveKinkSplitting Enumeration
[Missing <summary> documentation for "T:Rhino.Geometry.RebuildCurveKinkSplitting"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum RebuildCurveKinkSplitting
Public Enumeration RebuildCurveKinkSplitting
Members
Member name | Value | Description
None | 0
AtG1Changes | 1
AtLargeG2Changes | 2
AtMediumG2Changes | 3
AtSmallG2Changes | 4
See Also
Reference
Rhino.Geometry Namespace