RhinoCommon API
RhinoDoc.TextureMappingEventType Enumeration
[Missing <summary> documentation for "T:Rhino.RhinoDoc.TextureMappingEventType"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.8
Syntax
public enum TextureMappingEventType
Public Enumeration TextureMappingEventType
Members
Member name | Value | Description
Added | 0 |  Adding texture mapping to a document
Deleted | 1 |  A texture mapping was deleted from a document
Undeleted | 2 |  A texture mapping was undeleted in a document
Modified | 3 |  A texture mapping was modified in a document
See Also
Reference
Rhino Namespace