RhinoCommon API
WorldMapDayNight Class
[Missing <summary> documentation for "T:Rhino.Render.UI.WorldMapDayNight"]
Inheritance Hierarchy
System.Object
 Rhino.Render.UI.WorldMapDayNight
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class WorldMapDayNight : IDisposable
Public NotInheritable Class WorldMapDayNight
	Implements IDisposable
The WorldMapDayNight type exposes the following members.
Constructors
Name | Description
WorldMapDayNight
Initializes a new instance of the WorldMapDayNight class
Top
Methods
Name | Description
Dispose
Releases all resources used by the WorldMapDayNight
Finalize |  (Overrides Object.Finalize().)
HasMapForCurrentSettings
LocationToMap
MakeMapBitmap
Map
MapToLocation
SetDayNightDisplay
SetEnabled
SetTimeInfo
Top
See Also
Reference
Rhino.Render.UI Namespace