RhinoCommon API
IEpsilonFComparable<T> Interface
[Missing <summary> documentation for "T:Rhino.IEpsilonFComparable`1"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IEpsilonFComparable<in T>
Public Interface IEpsilonFComparable(Of In T)
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "T:Rhino.IEpsilonFComparable`1"]
The IEpsilonFComparable<T> type exposes the following members.
Methods
Name | Description
EpsilonEquals
Top
See Also
Reference
Rhino Namespace