RhinoCommon API
AnnotationBase Class
 Provides a common base class to all annotation geometry.
This class refers to the geometric element that is independent from the document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Dimension
 Rhino.Geometry.Leader
 Rhino.Geometry.TextEntity
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class AnnotationBase : GeometryBase
<SerializableAttribute>
Public Class AnnotationBase
	Inherits GeometryBase
The AnnotationBase type exposes the following members.
Constructors
Name | Description
AnnotationBase()
 Protected constructor for internal use.
AnnotationBase(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
AlternateDimensionLengthDisplay
 Alternate length display units and format
AnnotationType
 Type of annotation
DecimalSeparator
 Set or get the decimal separator c
DimensionLengthDisplay
 Length display units and format
DimensionScale
 Gets or sets the dimension scale
DimensionStyle
 If there are no overrides then the parent style is returned otherwise the dimension style saved with the annotation is returned.
DimensionStyleId
 Id of this annotation's parent dimstyle If this annotation has overrides to dimstyle properties, those overrides will be represented in the DimensionStyle returned by DimensionStyle(ParentStyle)
DrawForward
 Gets or sets whether the text is oriented towards the reader when viewed from behind
DrawTextFrame |  Obsolete.
 Gets or sets whether to draw a frame around a text mask
FirstCharFont
 Returns the font used by the first run of text in an annotation
Font
 The base Font for the text of the annotation. The text string is rich text and therefore a different font that the base font can be associated with sub strings of the text
FormatWidth
 Text format width (Wrapping rectangle)
HasPropertyOverrides
LineSpaceScale
 Scale applied to line spacing
MaskColor
 Color to use for drawing a text mask when it is enabled. If the mask is enabled and MaskColor is System.Drawing.Color.Transparent, then the viewport's color will be used for the MaskColor
MaskColorSource
 Gets or sets whether the mask background color is from the background or from a color
MaskEnabled
 Determines whether or not to draw a Text Mask
MaskFrame
 Gets or sets whether to draw a frame around a text mask
MaskOffset
 Offset for the border around text of the rectangle used to draw the mask. This value multiplied by TextHeight is the offset on each side of the tight rectangle around the text characters to the mask rectangle. The default value is 0.1.
MaskUsesViewportColor
 If true, the viewport's color is used for the mask color. If false, the color defined by MaskColor is used
ParentDimensionStyle
 The parent dimension style associated with this annotation
PlainText
 Text stripped of RTF formatting information
PlainTextWithFields
 Text stripped of RTF formatting information and with field expressions intact
Plane
 Plane that this annotation lies on
RichText
 Text including additional RTF formatting information
Text |  Obsolete.
 Text including additional RTF formatting information
TextFormula |  Obsolete.
 See RichText
TextHasRtfFormatting
 Gets a value indicating whether the annotation's text is formatted as RTF (Rich Text Format). Returns true if the text begins with an RTF header; otherwise, false.
TextHeight
 AnnotationBase.TextHeight Gets the parent dimstyle for the annotation and gets or sets the text height in the dimstyle
TextIsWrapped
 Is text wrapping on
TextModelWidth
 Width of text in the model
TextRotationDegrees
 Rotation of text in degrees
TextRotationRadians
 Rotation of text in radians
UseKerning
 Use kerning data in font to set distances between glyphs
Top
Methods
Name | Description
ClearPropertyOverrides
 Clears all overridden properties for this annotation
FirstCharProperties
 Extracts the font properties (bold, italic, underline, and facename) from the first character run of an RTF string.
FormatRtfString
 Modifies the formatting of an RTF (Rich Text Format) string by setting or clearing bold, italic, underline, and font face properties on the first character run.
GetBoundingBox(Transform)
 Aligned bounding box solver. Gets the world axis aligned bounding box for the transformed geometry.
 (Overrides GeometryBase.GetBoundingBox(Transform).)
GetDimensionScale
 Get view dependent dimension scale
GetDimensionStyle
 Return the proper dimension style from which to get properties for this annotation object If this object has style overrides, those will be included in the returned dimension style and the style will be updated to include the current state of the parent style for non-overridden fields
GetPlainTextWithRunMap
 Return plain text string for this annotation with field expressions unevaluated.
IsAllBold
 Returns true if all of the text in the annotation is Bold, otherwise returns false
IsAllItalic
 Returns true if all of the text in the annotation is Italic, otherwise returns false
IsAllUnderlined
 Returns true if all of the text in the annotation is Underlined, otherwise returns false
IsPropertyOverridden
 Returns true if a property is overridden
PlainTextToRtf
RunReplace
 Replace text within a formatted string
SetBold
SetFacename
SetItalic
SetOverrideDimStyle
 Set a style including overrides for this annotation object. The DimensionStyle OverrideStyle must have the override fields marked as overridden and must have it's Id set to nil. Use DimensionStyle.SetFieldOverride(Field field) and related functions to manage override settings. To override a field, the field value must be set and the field must be marked as an override. The DimensionStyle passed in here must not be in the dimstyle table
SetRichText
 Sets the annotation's text as rich text (RTF), optionally using a specified dimension style for formatting overrides.
SetUnderline
WrapText
 Wrap text
Top
See Also
Reference
Rhino.Geometry Namespace