RhinoCommon API
ContentFactory Class
[Missing <summary> documentation for "T:Rhino.Render.DataSources.ContentFactory"]
Inheritance Hierarchy
System.Object
 Rhino.Render.DataSources.ContentFactory
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ContentFactory : IDisposable
Public Class ContentFactory
	Implements IDisposable
The ContentFactory type exposes the following members.
Constructors
Name | Description
ContentFactory
Initializes a new instance of the ContentFactory class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
ContentTypeId
Dispose
Releases all resources used by the ContentFactory
Finalize |  (Overrides Object.Finalize().)
Kind
NewContent
 New Content returns a new content, which is Initialized with the Initialize() function. The content should be unitilized after use with the Unitialize function.
Top
See Also
Reference
Rhino.Render.DataSources Namespace