RhinoCommon API
FileStpReadOptions Class
 Options used when reading a STP file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileStpReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileStpReadOptions
Public Class FileStpReadOptions
The FileStpReadOptions type exposes the following members.
Constructors
Name | Description
FileStpReadOptions
Initializes a new instance of the FileStpReadOptions class
Top
Properties
Name | Description
JoinSurfaces
LimitFaces
MaxFaceCount
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Import function
Top
See Also
Reference
Rhino.FileIO Namespace