RhinoCommon API
FileVrmlWriteOptions Class
 Options for writing a wrl file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileVrmlWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileVrmlWriteOptions
Public Class FileVrmlWriteOptions
The FileVrmlWriteOptions type exposes the following members.
Constructors
Name | Description
FileVrmlWriteOptions
Initializes a new instance of the FileVrmlWriteOptions class
Top
Properties
Name | Description
ExportTextureCoordinates
ExportVertexColors
ExportVertexNormals
MeshingParameters
Version
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace