RhinoCommon API
IsoDrawEffect Class
[Missing <summary> documentation for "T:Rhino.Display.IsoDrawEffect"]
Inheritance Hierarchy
System.Object
 Rhino.Display.IsoDrawEffect
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class IsoDrawEffect
Public Class IsoDrawEffect
The IsoDrawEffect type exposes the following members.
Constructors
Name | Description
IsoDrawEffect
Initializes a new instance of the IsoDrawEffect class
Top
Properties
Name | Description
Direction
DiscardGap
DrawMode
Falloff
Frequency
GapColor
GapSize
Point
RotationRadians
UsedBandColorCount
Top
Methods
Name | Description
GetBandColor
SetBandColor
Top
See Also
Reference
Rhino.Display Namespace