RhinoCommon API
ComponentIndexType Enumeration
 Defines enumerated values to represent component index types.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum ComponentIndexType
Public Enumeration ComponentIndexType
Members
Member name | Value | Description
InvalidType | 0 |  Not used. This is the default value of the enumeration type.
BrepVertex | 1 |  Targets a brep vertex index.
BrepEdge | 2 |  Targets a brep edge index.
BrepFace | 3 |  Targets a brep face index.
BrepTrim | 4 |  Targets a brep trim index.
BrepLoop | 5 |  Targets a brep loop index.
MeshVertex | 11 |  Targets a mesh vertex index.
MeshTopologyVertex | 12 |  Targets a mesh topology vertex index.
MeshTopologyEdge | 13 |  Targets a mesh topology edge index.
MeshFace | 14 |  Targets a mesh face index.
MeshNgon | 15 |  Targets a mesh n-gon index.
InstanceDefinitionPart | 21 |  Targets an instance definition part index.
PolycurveSegment | 31 |  Targets a polycurve segment index.
PointCloudPoint | 41 |  Targets a point cloud point index.
GroupMember | 51 |  Targets a group member index.
ExtrusionBottomProfile | 61 |  3d bottom profile curves. Index identifies profile component
ExtrusionTopProfile | 62 |  3d top profile curves. Index identifies profile component
ExtrusionWallEdge | 63 |  3d wall edge curve. Index/2: identifies profile component Index%2: 0=start, 1=end
ExtrusionWallSurface | 64 |  Side wall surfaces. Index identifies profile component
ExtrusionCapSurface | 65 |  Bottom and top cap surfaces. Index 0=bottom, 1=top
ExtrusionPath | 66 |  Extrusion path (axis line). Index -1=entire path, 0=start point, 1=endpoint
SubdVertex | 71 | Targets a SubD vertex pointer Id. Ids are not guaranteed to be sequential.
SubdEdge | 72 | Targets a SubD edge pointer Id. Ids are not guaranteed to be sequential.
SubdFace | 73 | Targets a SubD face pointer Id. Ids are not guaranteed to be sequential.
HatchLoop | 81 |  Targets a hatch loop.
DimLinearPoint | 100 |  Targets a linear dimension point index.
DimRadialPoint | 101 |  Targets a radial dimension point index.
DimAngularPoint | 102 |  Targets an angular dimension point index.
DimOrdinatePoint | 103 |  Targets an ordinate dimension point index.
DimTextPoint | 104 |  Targets a text point index.
DimCentermarkPoint | 105 |  Targets a centermark point
DimLeaderPoint | 106 |  Targets a leader point
NoType | 268435455 |  Targets no specific type.
See Also
Reference
Rhino.Geometry Namespace