RhinoCommon API
FileAmf Class
 Support for writing amf file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileAmf
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileAmf
Public NotInheritable Class FileAmf
The FileAmf type exposes the following members.
Methods
Name | Description
Write
Write a amf file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace