RhinoCommon API
ObjectGripsType Enumeration
 The kind of grips a CustomObjectGrips presents. Several Rhino commands dispatch on this, so claiming a control point type is what lets a plug-in's grips reach code paths otherwise reserved for Rhino's own curve and surface control points.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public enum ObjectGripsType
Public Enumeration ObjectGripsType
Members
Member name | Value | Description
CurveControlPoint | 1 |  The grips control the control points of a NURBS curve. A grip that does not report the control points it drives is skipped, not reported as an error.
SurfaceControlPoint | 2 |  The grips control the control points of a NURBS surface. A grip that does not report the control points it drives is skipped, not reported as an error.
Custom | 1000 |  The grips mean something private to the plug-in. Rhino draws a drag line for them.
CustomNoDragLine | 1001 |  As Custom, but Rhino draws no drag line.
Remarks
 The values match the native CRhinoGripObject::GRIP_TYPE numbering, so further types can be added here later without changing any signature.
See Also
Reference
Rhino.DocObjects.Custom Namespace