RhinoCommon API
TextRunType Enumeration
[Missing <summary> documentation for "T:Rhino.Geometry.TextRunType"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum TextRunType
Public Enumeration TextRunType
Members
Member name | Value | Description
None | 0
Text | 1
Newline | 2
Paragraph | 4
Column | 5
Field | 6
Fontdef | 8
Header | 9
Softreturn | 3
FieldValue | 7
FontTable | 10
ColorTable | 11
Tab | 12
ListBegin | 13
ListEnd | 14
ListItemBegin | 15
ListItemEnd | 16
See Also
Reference
Rhino.Geometry Namespace