RhinoCommon API
ModifierKey Enumeration
 Keyboard keys typically used in combination with other keys
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[FlagsAttribute]
public enum ModifierKey
<FlagsAttribute>
Public Enumeration ModifierKey
Members
Member name | Value | Description
None | 0 | No key
Control | 1 | Ctrl key on Windows
MacCommand | 1 | Command key on Mac. This is treated the same as Control key on Windows
Shift | 2 | Shift key
Alt | 4 | Alt key
MacControl | 8 | Control key on Mac
See Also
Reference
Rhino.UI Namespace