RhinoCommon API
File3dmPlugInData Class
 Represents custom plug-in data, in the 3dm file, written by a plug-in.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmPlugInData
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmPlugInData
Public Class File3dmPlugInData
The File3dmPlugInData type exposes the following members.
Properties
Name | Description
PlugInId
 Gets the id of the plug-in that is associated with this custom data.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace