RhinoCommon API
InstanceObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.InstanceObject"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.InstanceObject
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class InstanceObject : RhinoObject
Public Class InstanceObject
	Inherits RhinoObject
The InstanceObject type exposes the following members.
Properties
Name | Description
InsertionPoint
Base point coordinates of a block.
InstanceDefinition
instance definition that this object uses.
InstanceXform
 transformation applied to an instance definition for this object.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Top
Methods
Name | Description
Explode(Boolean, RhinoObject[], ObjectAttributes[], Transform[])
 Explodes the instance reference into pieces.
Explode(Boolean, Guid, Boolean, RhinoObject[], ObjectAttributes[], Transform[])
 Explodes the instance reference into pieces.
SubObjectFromComponentIndex
 Get a RhinoObject in this block
UsesDefinition
Determine if this reference uses an instance definition
Top
See Also
Reference
Rhino.DocObjects Namespace