RhinoCommon API
ColorGradient Class
[Missing <summary> documentation for "T:Rhino.Display.ColorGradient"]
Inheritance Hierarchy
System.Object
 Rhino.Display.ColorGradient
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ColorGradient
Public Class ColorGradient
The ColorGradient type exposes the following members.
Constructors
Name | Description
ColorGradient
Initializes a new instance of the ColorGradient class
Top
Properties
Name | Description
EndPoint
 End point of gradient
GradientType
 Gradient fill type associated with this hatch
Repeat
 Repeat factor for gradient. Factors greater than 1 define a reflected repeat factor while values less than -1 define a wrapped repeat factor.
StartPoint
 Start point of gradient
Top
Methods
Name | Description
Duplicate
 Create a duplicate of this color gradient.
GetColorStops
 Get sorted list of colors / positions that a gradient is defined over
SetColorStops
 Set color stops for the gradient
Top
See Also
Reference
Rhino.Display Namespace