RhinoCommon API
LengthValue.StringFormat Enumeration
 Formatting to apply when creating a length value from a double.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum StringFormat
Public Enumeration StringFormat
Members
Member name | Value | Description
ExactDecimal | 0 | Use exact decimal string.
ExactProperFraction | 1 | If possible, use exact integer-fraction format (1.125 becomes 1-1/8).
ExactImproperFraction | 2 | If possible, use exact fraction format (1.125 becomes 9/8).
CleanDecimal | 3 | The value may be adjusted slightly to improve clarity (1.124999... becomes 1.125).
CleanProperFraction | 4 | The value may be adjusted slightly to improve clarity (1.124999... becomes 1-1/8).
CleanImproperFraction | 5 | The value may be adjusted slightly to improve clarity (1.124999... becomes 9/8).
See Also
Reference
Rhino Namespace