RhinoCommon API
FileIgsWriteOptions.PointObjectsMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileIgsWriteOptions.PointObjectsMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum PointObjectsMode
Public Enumeration PointObjectsMode
Members
Member name | Value | Description
PoSeparate | 116
PoSets | 106
See Also
Reference
Rhino.FileIO Namespace