RhinoCommon API
FileNwdWriteOptions Class
 Options for writing a Nwd file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileNwdWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileNwdWriteOptions
Public Class FileNwdWriteOptions
The FileNwdWriteOptions type exposes the following members.
Constructors
Name | Description
FileNwdWriteOptions
Initializes a new instance of the FileNwdWriteOptions class
Top
Properties
Name | Description
MeshingParameters
Version
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace