RhinoCommon API
SubDVertex Class
 Single vertex of a SubD
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDComponent
 Rhino.Geometry.SubDVertex
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class SubDVertex : SubDComponent
Public NotInheritable Class SubDVertex
	Inherits SubDComponent
The SubDVertex type exposes the following members.
Properties
Name | Description
ControlNetPoint
 Location of the "control net" point that this SubDVertex represents
EdgeCount
 Number of edges for this vertex
Edges
 All edges that this vertex is part of
FaceCount
 Number of faces for this vertex
Next
 Next vertex in linked list of vertices on this level
Previous
 Previous vertex in linked list of vertices on this level
Tag
 identifies the type of subdivision vertex
Top
Methods
Name | Description
ClearSavedSubdivisionPoints
 Discards the cached subdivision and surface points for this vertex, so they are recomputed on next use.
ComponentIndex
 Gets the component index of this vertex.
EdgeAt
 Retrieve a SubDEdge from this vertex
FaceAt
 Retrieve a SubDFace from this vertex
SetControlNetPoint
 Change the location of the "control net" point that this SubDVertex represents
SurfacePoint
 The SubD surface point
Top
See Also
Reference
Rhino.Geometry Namespace