RhinoCommon API
FileDstReadOptions Class
 Options for reading a Dst file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileDstReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileDstReadOptions
Public Class FileDstReadOptions
The FileDstReadOptions type exposes the following members.
Constructors
Name | Description
FileDstReadOptions
Initializes a new instance of the FileDstReadOptions class
Top
Properties
Name | Description
ImportJumps
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace