RhinoCommon API
DisplayPipelineAttributes.LinearWorkflowUsages Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.LinearWorkflowUsages"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.14
Syntax
public enum LinearWorkflowUsages
Public Enumeration LinearWorkflowUsages
Members
Member name | Value | Description
ByDocument | 0
Custom | 1
See Also
Reference
Rhino.Display Namespace