RhinoCommon API
MeshExtruderFaceDirectionMode Enumeration
 Defines how mesh extruder decides orients faces
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum MeshExtruderFaceDirectionMode
Public Enumeration MeshExtruderFaceDirectionMode
Members
Member name | Value | Description
Keep | 0 |  Maintain all face directions
OrientClosedFrontOut | 1 |  Orient closed meshes front face out
See Also
Reference
Rhino.Geometry Namespace