RhinoCommon API
FileExportPlugIn Class
 Rhino plug-in that exports data from Rhino to other file formats; can support more than one format.
Inheritance Hierarchy
System.Object
 Rhino.PlugIns.PlugIn
 Rhino.PlugIns.FileExportPlugIn
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class FileExportPlugIn : PlugIn
Public MustInherit Class FileExportPlugIn
	Inherits PlugIn
The FileExportPlugIn type exposes the following members.
Constructors
Name | Description
FileExportPlugIn
Initializes a new instance of the FileExportPlugIn class
Top
Properties
Name | Description
ShouldDisplayOptionsDialog
Top
Methods
Name | Description
AddFileTypes
DisplayOptionsDialog
WriteFile
Top
Events
Name | Description
Top
See Also
Reference
Rhino.PlugIns Namespace