RhinoCommon API
DistancingMode Enumeration
 Defines how offset and similar operations should work.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum DistancingMode
Public Enumeration DistancingMode
Members
Member name | Value | Description
Undefined | 0 |  Nothing is defined. This serves as null.
Linear | 1 |  When geometrically possible, offsets with a linear distance.
LinearFromEnd | 2 |  When geometrically possible and an opposite side exists, offsets with a linear distance from that side.
Ratio | 3 |  When geometrically possible, uses a percentage of respective neighbours to compute offsets.
RatioFromEnd | 4 |  When geometrically possible and an opposite side exists, uses a percentage of respective neighbours to compute offsets.
See Also
Reference
Rhino.Geometry Namespace