RhinoCommon API
PhysicallyBased Class
 Helper class with properties containing the names of children available in our PBR implementation.
Inheritance Hierarchy
System.Object
 Rhino.Render.ChildSlotNames.PhysicallyBased
 Namespace: Rhino.Render.ChildSlotNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class PhysicallyBased
Public NotInheritable Class PhysicallyBased
The PhysicallyBased type exposes the following members.
Properties
Name | Description
Alpha
AmbientOcclusion
Anisotropic
AnisotropicRotation
BaseColor
Bump
Clearcoat
ClearcoatBump
ClearcoatRoughness
Displacement
Emission
Metallic
Opacity
OpacityIor
OpacityRoughness
Roughness
Sheen
SheenTint
Specular
SpecularTint
Subsurface
SubsurfaceScatteringColor
SubsurfaceScatteringRadius
Top
Methods
Name | Description
FromTextureType
Top
See Also
Reference
Rhino.Render.ChildSlotNames Namespace