RhinoCommon API
FileFbxWriteOptions.ObjectType Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileFbxWriteOptions.ObjectType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum ObjectType
Public Enumeration ObjectType
Members
Member name | Value | Description
Nurbs | 0
Mesh | 1
See Also
Reference
Rhino.FileIO Namespace