RhinoCommon API
ConstructionPlaneGridDefaults Class
 Default grid settings for a document
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.ConstructionPlaneGridDefaults
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ConstructionPlaneGridDefaults
Public Class ConstructionPlaneGridDefaults
The ConstructionPlaneGridDefaults type exposes the following members.
Constructors
Name | Description
ConstructionPlaneGridDefaults
Initializes a new instance of the ConstructionPlaneGridDefaults class
Top
Properties
Name | Description
GridLineCount
Number of grid lines in each direction
GridSpacing
Distance between grid lines
GridThickFrequency
 This line frequency. 0: none, 1: all lines are thick, 2: every other is thick, ...
ShowGrid
Show the grid
ShowGridAxes
Show the grid axes
ShowWorldAxes
Show the world axes icon in the corner
SnapSpacing
 When grid snap is enabled, the distance between snap points. Typically this is the same distance as grid spacing
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace