RhinoCommon API
RdkUndo Class
 RdkUndo class, which is used to get the RdkUndoRecord
Inheritance Hierarchy
System.Object
 Rhino.Render.RdkUndo
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class RdkUndo : IDisposable
Public NotInheritable Class RdkUndo
	Implements IDisposable
The RdkUndo type exposes the following members.
Constructors
Name | Description
RdkUndo
 Constructor for RdkUndo
Top
Methods
Name | Description
Dispose
 Dispose for RdkUndo
Finalize
 Destructor for RdkUndo
 (Overrides Object.Finalize().)
NewUndoRecord
 Get a new UndoRecord
Top
See Also
Reference
Rhino.Render Namespace