RhinoCommon API
File3dmRenderEnvironments Class
[Missing <summary> documentation for "T:Rhino.FileIO.File3dmRenderEnvironments"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmRenderEnvironments
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmRenderEnvironments : IEnumerable<File3dmRenderEnvironment>,
	IEnumerable
Public Class File3dmRenderEnvironments
	Implements IEnumerable(Of File3dmRenderEnvironment), IEnumerable
The File3dmRenderEnvironments type exposes the following members.
Constructors
Name | Description
File3dmRenderEnvironments
Initializes a new instance of the File3dmRenderEnvironments class
Top
Methods
Name | Description
Find
 Finds an environment by its id, if possible. Returns null on failure.
GetEnumerator
Top
See Also
Reference
Rhino.FileIO Namespace