RhinoCommon API
DrawingUtilities Class
 RhinoCommon Drawing Utilities
Inheritance Hierarchy
System.Object
 Rhino.UI.DrawingUtilities
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class DrawingUtilities
Public NotInheritable Class DrawingUtilities
The DrawingUtilities type exposes the following members.
Methods
Name | Description
BitmapFromIconResource(String, Assembly)
 Load a Icon from an embedded resource and convert it to a bitmap of the specified size. Will look for a icon image that is greater than or equal to the requested size, if all images are less than the requested size the largest image will be used.
BitmapFromIconResource(String, Size, Assembly)
 Load a Icon from an embedded resource and convert it to a bitmap of the specified size. Will look for a icon image that is greater than or equal to the requested size, if all images are less than the requested size the largest image will be used.
BitmapFromSvg(String, Int32, Int32)
 Create bitmap of a given size from an svg string
BitmapFromSvg(String, Int32, Int32, Boolean)
 Create bitmap of a given size from an svg string
CreateCurvePreviewGeometry
 Create a series of closed polyline loops representing a curve and a linetype combination.
CreateLinetypePreviewGeometryEx
 Preview geometry for a linetype on a curve, by channel, mirroring the viewport renderer. kind 0 returns the dash silhouette polygons with the line cleared under each shape (these are meant to be filled); kind 1 returns curve shape outlines (meant to be stroked); kind 2 returns text and surface shape outlines (meant to be filled with an even-odd rule).
CreateMeshPreviewImage(IEnumerable<Mesh>, IEnumerable<Color>, Size)
 Creates a preview image of one or more meshes.
CreateMeshPreviewImage(Mesh, Color, Size)
 Creates a preview image of a mesh.
CreateMeshPreviewImage(RhinoDoc, IEnumerable<Mesh>, IEnumerable<Color>, Size)
 Creates a preview image of one or more meshes.
DarkModeConvertPixel
 Attempt to adjust pixels to an image that works for dark mode
DarkModeConvertPixels
 Attempt to adjust pixels to an image that works for dark mode
IconFromResource(String, Assembly)
 Load a Icon from an embedded resource.
IconFromResource(String, Size, Assembly)
 Load a Icon from an embedded resource.
ImageFromResource
 Load a Image from an embedded resource.
LoadBitmapWithScaleDown
 Loads an icon from an embedded resource and converts it to a bitmap. If the icon is not a standard size, this function scales down a larger image.
LoadIconWithScaleDown
 Loads an icon from an embedded resource. If the icon is not a standard size, this function scales down a larger image.
MakeArgb
 Stores a color into an integer from 4 bytes.
PixelsFromSvg(String, Int32, Int32, Boolean, Color)
 Get array of bytes that represent RGBA values for an image of a given size created from SVG
PixelsFromSvg(String, Int32, Int32, Boolean, Color, Boolean)
 Get array of bytes that represent RGBA values for an image of a given size created from SVG
SvgToRhinoDibIntPtr
 Create bitmap of a given size from an svg string
Top
See Also
Reference
Rhino.UI Namespace