RhinoCommon API
ImportOptionsSections Enumeration
 Standard CRhImportOptions sections to import
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ImportOptionsSections
Public Enumeration ImportOptionsSections
Members
Member name | Value | Description
AdvancedDisplay | 0
Alias | 1
Appearance | 2
ChooseOneObject | 3
ControlPointContextMenu | 4
CursorToolTip | 5
Display | 6
File | 7
General | 8
Grid | 9
ModelAid | 10
Mouse | 11
NeverRepeatCommands | 12
ObjectContextMenu | 13
SearchPath | 14
ShortcutKey | 15
Smarttrack | 16
View | 17
ViewportContextMenu | 18
ToolPaletteSettings | 19 |  Tool palette settings for Mac, ignored for Windows
Count | 20 |  Must always be the last item
See Also
Reference
Rhino.Runtime Namespace