RhinoCommon API
ICollapsibleSection Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.ICollapsibleSection"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface ICollapsibleSection : IWindow,
	IHasCppImplementation, IDisposable
Public Interface ICollapsibleSection
	Inherits IWindow, IHasCppImplementation, IDisposable
The ICollapsibleSection type exposes the following members.
Properties
Name | Description
BackgroundColor
Collapsible
CommandOptionName
Height
Hidden
Id
InitiallyExpanded
PlugInId
SettingsTag
ViewModel
ViewModelId
Top
Methods
Name | Description
RunScript
Top
See Also
Reference
Rhino.UI.Controls Namespace