RhinoCommon API
File3dmRenderTextures Class
[Missing <summary> documentation for "T:Rhino.FileIO.File3dmRenderTextures"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmRenderTextures
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmRenderTextures : IEnumerable<File3dmRenderTexture>,
	IEnumerable
Public Class File3dmRenderTextures
	Implements IEnumerable(Of File3dmRenderTexture), IEnumerable
The File3dmRenderTextures type exposes the following members.
Constructors
Name | Description
File3dmRenderTextures
Initializes a new instance of the File3dmRenderTextures class
Top
Methods
Name | Description
Find
 Finds a texture by its id, if possible. Returns null on failure.
GetEnumerator
Top
See Also
Reference
Rhino.FileIO Namespace