RhinoCommon API
FileGHSReadOptions.ReadViewType Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileGHSReadOptions.ReadViewType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum ReadViewType
Public Enumeration ReadViewType
Members
Member name | Value | Description
Body | 0 | BodyView
Profile | 1 | Profile View
Plan | 2 | Plan View
Wire | 3 | Wireframe
Solid | 4 | Mesh
Camera | 5 | eCAMERA
Custom | 6 | eCUSTOM
See Also
Reference
Rhino.FileIO Namespace