RhinoCommon API
RenderMaterial.AssignToBlockChoices Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderMaterial.AssignToBlockChoices"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.14
Syntax
public enum AssignToBlockChoices
Public Enumeration AssignToBlockChoices
Members
Member name | Value | Description
Always | 0 | Always assign to blocks recursively.
Never | 1 | Never assign to blocks recursively.
Ask | 2 | Ask the user what to do.
See Also
Reference
Rhino.Render Namespace