RhinoCommon API
ProxyObject Class
 A proxy object (not saved in files)
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.ProxyObject
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ProxyObject : RhinoObject
Public Class ProxyObject
	Inherits RhinoObject
The ProxyObject type exposes the following members.
Properties
Name | Description
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Top
Methods
Name | Description
CreateMeshes
 Create meshes used to render and analyze surface and polysurface objects.
 (Overrides RhinoObject.CreateMeshes(MeshType, MeshingParameters, Boolean).)
GetMeshes
 Get existing meshes used to render and analyze surface and polysurface objects.
 (Overrides RhinoObject.GetMeshes(MeshType).)
Top
See Also
Reference
Rhino.DocObjects Namespace