RhinoCommon API
Notification Class
 A Notification instance can be used to inform the user about various events. For a Notification instance to be displayed in Rhino, it must be added to the NotificationCenter. When added, it will be displayed in the Notifications panel in Rhino. A Notification contains 1 to 3 buttons that are automatically wired to its ButtonClicked Action if it is not null. The buttons are displayed when the Notification is shown modally by either the user clicking on a particular notification in the Notifications panel, or by programatically showing it using ShowModal(). Currently, only process-wide notifications are supported; document specific notifications are not possible. Notification instances contain metadata that can be added, modified, or removed during its life. The metadata is important for LINQ queries and other patterns. For example, a particular action may require that multiple notifications be modified. Thus, a LINQ query can be performed on the NotificationCenter using metadata to retrieve related Notification objects and modify them as a batch. Notification objects implement IAssemblyRestrictedObject. By default, a Notification can be editedby any assembly, but explicitly specifing allowed assemblies in the constructor changes this behavior. Notification objects are not thread-safe and should only be manipulated in UI thread.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.Notifications.Notification
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Notification : INotifyPropertyChanged,
	IAssemblyRestrictedObject
Public Class Notification
	Implements INotifyPropertyChanged, IAssemblyRestrictedObject
The Notification type exposes the following members.
Constructors
Name | Description
Notification()
 Creates a new instance that can be edited by any assembly.
Notification(IEnumerable<Assembly>)
 Creates a new instance that can be edited by the given assemblies.
Top
Properties
Name | Description
AllowedAssemblies
 The assemblies that can modify this instance.
AlternateButtonTitle
 The localized title of the Alternate button.
ButtonClicked
 An Action that will be invoked whenever a button for the notification is clicked or the notification is closed.
CancelButtonTitle
 The localized title of the Cancel button.
ConfirmButtonTitle
 The localized title of the Confirm button.
DateUpdated
 The date the notification was last modified.
Description
 The description of the notification. The description is displayed in the Notifications panel in Rhino.
Item
 Gets or sets metadata for this instance.
Message
 The message of the notification. The message is shown only when the instance is displayed modally. It should contain details about the notification.
MetadataCopy
 A copy of all the metadata for this class.
SeverityLevel
 The severity of the notification. Changing the severity of the notification may change the way Rhino chooses to display the Notifications panel.
ShowEventId
 A field used by Rhino for displaying notifications. Not intended for public use.
Title
 The title of the notification. The title is displayed when the notification is displayed modally in Rhino.
Top
Methods
Name | Description
Editable
 Determines whether an assembly can modify the instance. Any code that modifies an assembly protected notification must be wrapped in a ExecuteAssemblyProtectedCode(Action) method.
ExecuteAssemblyProtectedCode(Action)
 If a Notification object is only allowed to be modified by certain assemblies, then any code that interacts with it must be wrapped around this method, or a InvalidOperationException will be thrown. For performance reasons, the code wrapped by this method should be kept as simple as possible.
ExecuteAssemblyProtectedCode<TResult>(Func<TResult>)
 If a Notification object is only allowed to be modified by certain assemblies, then any code that interacts with it must be wrapped around this method, or a InvalidOperationException will be thrown. For performance reasons, the code wrapped by this method should be kept as simple as possible.
HideModal
 Tells Rhino to hide the notification if it is being currently shown as a modal.
RemoveMetadata
 Removes metadata from this instance.
ShowModal
 Tells Rhino to display the notification modally.
ToString
 Returns a readable string representation of the instance.
 (Overrides Object.ToString().)
Top
Events
Name | Description
PropertyChanged
 Triggered whenever a visible property of the instance changes.
Top
See Also
Reference
Rhino.Runtime.Notifications Namespace