RhinoCommon API
LineCapStyle Enumeration
 Shape to be used at the ends of open curves
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LineCapStyle
Public Enumeration LineCapStyle
Members
Member name | Value | Description
Round | 0 |  Ends are extended by a half circle with diameter equal to the curve width
Flat | 1 |  Also known as butt. Ends are flat and do not extend
Square | 2 |  Ends are flat and extended by half of the curve width
See Also
Reference
Rhino.DocObjects Namespace