RhinoCommon API
MappingChannel Class
 Mapping Channel for a ChangeQueue Mesh
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.MappingChannel
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MappingChannel
Public Class MappingChannel
The MappingChannel type exposes the following members.
Properties
Name | Description
Channel
 Get channel number for this MappingChannel
Local
 Local transform for the mapping
Mapping
 Return TexturMapping for this MappingChannel
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render.ChangeQueue Namespace