RhinoCommon API
ViewCaptureWriter.Pen Class
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.Pen"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.ViewCaptureWriter.Pen
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Pen
Public Class Pen
The ViewCaptureWriter.Pen type exposes the following members.
Constructors
Name | Description
ViewCaptureWriter.Pen
Initializes a new instance of the ViewCaptureWriter.Pen class
Top
Properties
Name | Description
Cap
Color
Join
Pattern
Width
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Runtime Namespace