RhinoCommon API
RenderContent.ChangeContexts Enumeration
 Context of a change to content parameters.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public enum ChangeContexts
Public Enumeration ChangeContexts
Members
Member name | Value | Description
UI | 0 |  Change occurred as a result of user activity in the content's UI.
Drop | 1 |  Change occurred as a result of drag and drop.
Program | 2 |  Change occurred as a result of internal program activity.
Ignore | 3 |  Change can be disregarded.
Tree | 4 |  Change occurred within the content tree (e.g., nodes reordered).
Undo | 5 |  Change occurred as a result of an undo.
FieldInit | 6 |  OBSOLETE.
Serialize | 7 |  Change occurred during serialization (loading).
RealTimeUI | 8 |  Change occurred as a result of 'real-time' user activity in the (content) UI. The content's preview, UI, group members and registerable properties are not updated.
Script | 9 |  Change occurred as a result of executing a script.
See Also
Reference
Rhino.Render Namespace