RhinoCommon API
HatchPatternTableEventType Enumeration
 HatchPattern event types
Since: 8.15
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum HatchPatternTableEventType
Public Enumeration HatchPatternTableEventType
Members
Member name | Value | Description
Added | 0 |  A hatchpattern was added.
Deleted | 1 |  A hatchpattern was deleted.
Undeleted | 2 |  A hatchpattern was undeleted.
Modified | 3 |  A hatchpattern was modified.
Sorted | 4 |  The hatchpattern table was sorted.
Current | 5 |  The current hatchpattern has changed.
See Also
Reference
Rhino.DocObjects.Tables Namespace