RhinoCommon API
PurgeStatistics Class
 Describes what Purge(PurgeFilter) purged.
Inheritance Hierarchy
System.Object
 Rhino.PurgeStatistics
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PurgeStatistics
Public Class PurgeStatistics
The PurgeStatistics type exposes the following members.
Properties
Name | Description
TotalPurgedCount
 The total number of table objects that were purged.
Top
Methods
Name | Description
PurgedCount
 The number of table objects that were purged.
Top
See Also
Reference
Rhino Namespace