RhinoCommon API
FileGHSReadOptions Class
 Options for reading a GHS file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileGHSReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileGHSReadOptions
Public Class FileGHSReadOptions
The FileGHSReadOptions type exposes the following members.
Constructors
Name | Description
FileGHSReadOptions
Initializes a new instance of the FileGHSReadOptions class
Top
Properties
Name | Description
AttachGhsData
RemoveColinearPoints
ViewType
Top
Methods
Name | Description
ToDictionary
Top
See Also
Reference
Rhino.FileIO Namespace