RhinoCommon API
UnitsChangedWithScalingEventArgs Class
 Provides information about UnitsChangedWithScaling events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.UnitsChangedWithScalingEventArgs
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.20
Syntax
public class UnitsChangedWithScalingEventArgs : EventArgs
Public Class UnitsChangedWithScalingEventArgs
	Inherits EventArgs
The UnitsChangedWithScalingEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document for this event. This field might be null.
DocumentSerialNumber
 Gets the uniques document serial number for this event.
Scale
 The scale factor.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino Namespace