RhinoCommon API
ViewCaptureWriter.SetClipRectProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.SetClipRectProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void SetClipRectProc(
	ref int left,
	ref int top,
	ref int right,
	ref int bottom
)
Public Delegate Sub SetClipRectProc (
	ByRef left As Integer,
	ByRef top As Integer,
	ByRef right As Integer,
	ByRef bottom As Integer
)
Parameters
left
Type: System.Int32
top
Type: System.Int32
right
Type: System.Int32
bottom
Type: System.Int32
See Also
Reference
Rhino.Runtime Namespace