RhinoCommon API
EndAnalysisSettings Class
 Contains static methods and properties to modify the visibility of curve ends.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.EndAnalysisSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class EndAnalysisSettings
Public NotInheritable Class EndAnalysisSettings
The EndAnalysisSettings type exposes the following members.
Properties
Name | Description
ClosedSeams
 Gets or sets whether to display the closed curve seam points.
Color
 Gets or sets a color used to display the points.
OpenEnds
 Gets or sets whether to display the open curve end points.
OpenStarts
 Gets or sets whether to display the open curve start points.
PolycurveJoints
 Gets or sets whether to display the polycurve joint points.
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace