RhinoCommon API
FileX_T Class
 Support for writing X_T file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileX_T
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileX_T
Public NotInheritable Class FileX_T
The FileX_T type exposes the following members.
Methods
Name | Description
Write
Write a X_T file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace