RhinoCommon API
RenderTexture.eLocalMappingType Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderTexture.eLocalMappingType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
[FlagsAttribute]
public enum eLocalMappingType
<FlagsAttribute>
Public Enumeration eLocalMappingType
Members
Member name | Value | Description
lmt_none | 0
lmt_2D | 1
lmt_3D | 2
lmt_force32bit | 4294967295
See Also
Reference
Rhino.Render Namespace