RhinoCommon API
InstanceDefinition Class
 This is the same as InstanceDefinitionGeometry, but in a Rhino document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.Geometry.InstanceDefinitionGeometry
 Rhino.DocObjects.InstanceDefinition
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class InstanceDefinition : InstanceDefinitionGeometry
Public NotInheritable Class InstanceDefinition
	Inherits InstanceDefinitionGeometry
The InstanceDefinition type exposes the following members.
Properties
Name | Description
ArchiveFileStatus
 Returns the archive file status of a linked instance definition.
ComponentType
 Returns InstanceDefinition.
 (Overrides InstanceDefinitionGeometry.ComponentType.)
Index
 Index of this instance definition in the index definition table.
 (Overrides ModelComponent.Index.)
IsDeleted
 Returns true if this instance definition is deleted. Deleted object are not saved to a file archive.
 (Overrides ModelComponent.IsDeleted.)
IsReference
 An object from a work session reference model is reference a reference object and cannot be modified. An object is a reference object if, and only if, it is on a reference layer.
 (Overrides ModelComponent.IsReference.)
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
IsTenuous
 True if this instance definition is from a linked file. It will be saved only if it is referenced by an instance reference object that is in the active geometry list and is being saved. Note that there can be multiple linked instance definitions with references to tenuous instance definitions.
LayerStyle
 Specifies how model components (layers, materials, dimension styles, etc.) from linked instance definition files appear in the active model.
ObjectCount
 Number of objects this definition uses. This counts the objects that are used to define the geometry. This does NOT count the number of references to this instance definition.
SkipNestedLinkedDefinitions
 This property applies when an instance definition is linked. If true, when reading the file that defines the content of the linked instance definition, skip any linked instance definitions found in that file. If false, when reading the file that defines the content of the linked instance definition, recursively load linked instance definitions found in that file.
SourceArchive
 Gets the full file path for linked instance definitions.
UnitSystem
 Gets the unit system of the instance definition. If the instance definition was imported from another 3dm file, the unit system may differ from that of the document.
UpdateType
Top
Methods
Name | Description
CreatePreviewBitmap(DefinedViewportProjection, Size)
 Creates a wireframe preview bitmap of the instance definition.
CreatePreviewBitmap(DefinedViewportProjection, DisplayMode, Size)
 Creates a preview bitmap of the instance definition.
CreatePreviewBitmap(DefinedViewportProjection, Size, Boolean)
 Creates a wireframe preview bitmap of the instance definition.
CreatePreviewBitmap(DefinedViewportProjection, DisplayMode, Size, Boolean)
 Creates a preview bitmap of the instance definition.
CreatePreviewBitmap(Guid, DefinedViewportProjection, DisplayMode, Size, Boolean)
 Creates a preview bitmap of the instance definition.
CreatePreviewBitmap(Guid, DefinedViewportProjection, IsometricCamera, Boolean, Size, Boolean)
 Creates a preview bitmap of the instance definition.
Equals
 Equality is checked against InstanceDefinition.Id
 (Overrides Object.Equals(Object).)
GetContainers
 Gets a list of all the InstanceDefinitions that contain a reference this InstanceDefinition.
GetHashCode
 Use Id.GetHashCode()
 (Overrides Object.GetHashCode().)
GetObjects
 Gets an array with the objects that belong to this instance definition.
GetReferences
 Gets a list of the CRhinoInstanceObjects (inserts) that contains a reference this instance definition.
InUse
 Determines whether the instance definition is referenced.
Object
 returns an object used as part of this definition.
UseCount()
 Returns the number of references of this instance definition in the model. Both top-level references and nested instances are included in the count.
UseCount(Int32, Int32)
 Returns the number of references of this instance definition in the model. Both top-level references and nested instances are included in the count.
UsesDefinition
 Determines if this instance definition contains a reference to another instance definition.
UsesLayer
 Returns true if some object in the instance definition is on the layer with the specified layer index.
UsesLinetype
 Returns true if some object in the instance definition references the linetype with the specified linetype index.
Top
See Also
Reference
Rhino.DocObjects Namespace