RhinoCommon API
SubDFace Class
 Single face of a SubD
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDComponent
 Rhino.Geometry.SubDFace
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class SubDFace : SubDComponent
Public NotInheritable Class SubDFace
	Inherits SubDComponent
The SubDFace type exposes the following members.
Properties
Name | Description
ControlNetCenterFrame
 The face's control net center frame is a plane with normal equal to ControlNetCenterNormal and origin equal to ControlNetCenterPoint. The x and y axes of the frame have no predictable relationship to the face or SubD control net topology.
ControlNetCenterNormal
 When the face's control net polygon is planar, the face's control net normal is a unit vector perpendicular to the plane that points outwards. If the control net polygon is not planar, the control net normal is control net normal is a unit vector that is the average of the control polygon's corner normals.
ControlNetCenterPoint
 The face's control net center point is the average of the face's vertex control net points. This is the same point as the face's subdivision point.
EdgeCount
 Number of edges for this face. Note that EdgeCount is always the same as VertexCount. Two properties are provided simply for clarity.
LimitSurfaceCenterPoint
 Get the limit surface point location at the center of the face
PerFaceColor
 If per-face color is "Empty", then this face does not have a custom color
SurfaceCenterFrame
 Get the limit surface tangent plane at the center of the face. The plane's origin is the point on the limit surface at the center of the face. The plane's z axis is the limit surface normal vector at the center of the face.
SurfaceCenterNormal
 Get the limit surface normal vector at the center of the face.
VertexCount
 Number of vertices for this face. Note that EdgeCount is always the same as VertexCount. Two properties are provided simply for clarity.
Top
Methods
Name | Description
ClearSavedSubdivisionPoints
 Discards the cached subdivision and surface points for this face, so they are recomputed on next use.
ComponentIndex
 Gets the component index of this face.
EdgeAt
 Get an edge at a given index
EdgeDirectionMatchesFaceOrientation
 Check if a given edge in this face has the same direction as the face orientation
VertexAt
 Get a vertex that this face uses by index
Top
See Also
Reference
Rhino.Geometry Namespace