RhinoCommon API
RhinoMath Class
 Provides constants and static methods that are additional to Math.
Inheritance Hierarchy
System.Object
 Rhino.RhinoMath
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class RhinoMath
Public NotInheritable Class RhinoMath
The RhinoMath type exposes the following members.
Methods
Name | Description
Clamp(Double, Double, Double)
 Limits a Double to be specified within an interval of two numbers, by specifying a fixed minimum and maximum.
Clamp(Int32, Int32, Int32)
 Restricts a Int32 to be specified within an interval of two integers.
CRC32(UInt32, Byte[])
 Advances the cyclic redundancy check value remainder given a byte array. http://en.wikipedia.org/wiki/Cyclic_redundancy_check.
CRC32(UInt32, Double)
 Advances the cyclic redundancy check value remainder given a Double. http://en.wikipedia.org/wiki/Cyclic_redundancy_check.
CRC32(UInt32, Int32)
 Advances the cyclic redundancy check value remainder given a Int32. http://en.wikipedia.org/wiki/Cyclic_redundancy_check.
EpsilonEquals(Double, Double, Double)
 Compare two doubles for equality within some "epsilon" range
EpsilonEquals(Single, Single, Single)
 Compare to floats for equality within some "epsilon" range
EvaluateNormal
 Expert tool to evaluate surface unit normal.
EvaluateNormalPartials
 Expert tool to evaluate partial derivatives of surface unit normal.
EvaluateSectionalCurvature
 Expert tool to evaluate sectional curvature from surface derivatives and section plane normal.
Integrate(Func<Object, Int32, Double, Double>, Object, Curve, Double, Double, Double)
 Calculates the definite integral of a smooth (C-infinity) function of one variable using a Rhomberg integration technique and returns returns Integral(f(t)*|curve'(t)|*dt). The C-infinity requirement is used by the Rhomberg algorithm when estimating error bounds and convergence. If you choose to pass a C2 function, you are likely to converge while getting less accurate results and incorrect error bound estimates. Using a C0 or C1 fucntion will often return nonsense.
Integrate(Func<Object, Int32, Double, Double>, Object, Interval, Double, Double, Double)
 Calculates the definite integral of a smooth (C-infinity) function using a Rhomberg integration technique.
Integrate(Func<Object, Int32, Double, Double, Double>, Object, Surface, Double, Double, Double)
Integrate(Func<Object, Int32, Double, Double>, Object, Curve, Double, Double, CancellationToken, Double)
 Calculates the definite integral of a smooth (C-infinity) function of one variable using a Rhomberg integration technique and returns returns Integral(f(t)*|curve'(t)|*dt). The C-infinity requirement is used by the Rhomberg algorithm when estimating error bounds and convergence. If you choose to pass a C2 function, you are likely to converge while getting less accurate results and incorrect error bound estimates. Using a C0 or C1 fucntion will often return nonsense. The calculation can be canceled through the cancellation token.
Integrate(Func<Object, Int32, Double, Double>, Object, Interval, Double, Double, CancellationToken, Double)
 Calculates the definite integral of a smooth (C-infinity) function using a Rhomberg integration technique. The calculation can be canceled through the cancellation token.
Integrate(Func<Object, Int32, Double, Double, Double>, Object, Interval, Interval, Double, Double, Double)
Integrate(Func<Object, Int32, Double, Double, Double>, Object, Surface, Double, Double, CancellationToken, Double)
Integrate(Func<Object, Int32, Double, Double, Double>, Object, Interval, Interval, Double, Double, CancellationToken, Double)
IntIndexToString
 Portrays an Int32 index in text.
IsValidDouble
 Determines whether a Double value is valid within the RhinoCommon context.
Rhino does not use Double.NaN by convention, so this test evaluates to true if:
x is not equal to RhinoMath.UnsetValue
System.Double.IsNaN(x) evaluates to false
System.Double.IsInfinity(x) evaluates to false
IsValidSingle
 Determines whether a Single value is valid within the RhinoCommon context.
Rhino does not use Single.NaN by convention, so this test evaluates to true if:
x is not equal to RhinoMath.UnsetValue,
System.Single.IsNaN(x) evaluates to false
System.Single.IsInfinity(x) evaluates to false
MetersPerUnit
 Return number of meters per one unit of a given unit system
ParseNumber
 Evaluates command line math expression.
ToDegrees
 Convert an angle from radians to degrees.
ToRadians
 Convert an angle from degrees to radians.
TryParseNumber
 Evaluates command line math expression.
UnitScale(UnitSystem, UnitSystem)
 Computes the scale factor for changing the measurements unit systems.
UnitScale(UnitSystem, Double, UnitSystem, Double)
 Computes the scale factor for changing the measurements unit systems.
Wrap
 Limits a Double to be specified within an interval of two numbers by repeating the available interval cyclically.
Top
Fields
Name | Description
DefaultAngleTolerance
 Represents the default angle tolerance, used when no other values are provided.
This is one degree, expressed in radians.
DefaultDistanceToleranceMillimeters
 Get Rhino's default distance tolerance in millimeters.
Epsilon
 Gets the value of DBL_EPSILON, which is the smallest positive floating point number x such that 1 + x != 1. This is different than Double.Epsilon which is the smallest positive Double value that is greater than zero.
HalfPI
 Quarter of a rotation. 90 degrees. 1.57...
InfiniteRadius
 Value used to indicate a radius of curvature is infinite.
QuarterPI
 One eigth of a rotation. 45 degrees. 0.78...
SqrtEpsilon
 Represents a default value that is used when comparing square roots.
This value is several orders of magnitude larger than ZeroTolerance.
Tau
 Ratio of circumference divided by radius. Full rotation. 360 degrees. 6.28...
TwoPI
 Full rotation. 360 degrees. 6.28...
UnsetIntIndex
 When signed int values are used in a context where 0 and small negative values are valid indices and there needs to be a value that indicates the index is not set.
UnsetSingle
 Gets the single precision floating point number that is considered 'unset' in Rhino.
UnsetValue
 Gets the Rhino standard Unset value. Use this value rather than Double.NaN when a bogus floating point value is required.
ZeroTolerance
 Gets Rhino's Zero Tolerance constant, which is 2^-32. In cases when an absolute "zero" tolerance is required to compare model space coordinates, ZeroTolerance is used. The value of ZeroTolerance should be no smaller than Epsilon and should be several orders of magnitude smaller than SqrtEpsilon.
Top
See Also
Reference
Rhino Namespace