RhinoCommon API
CollapsibleSectionViewModel Class
 Derive from this class to implement your own view model that wraps around a built in implementation of IRdkViewModel. Use GetData etc to implement your properties.
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.CollapsibleSectionViewModel
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class CollapsibleSectionViewModel : IRdkViewModel,
	IHasCppImplementation
Public Class CollapsibleSectionViewModel
	Implements IRdkViewModel, IHasCppImplementation
The CollapsibleSectionViewModel type exposes the following members.
Constructors
Name | Description
CollapsibleSectionViewModel
 Construct from your section - the view model should be a member of the section
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Commit
Discard
GetData
 Call for an interface to data
UndoHelper
 Helper function to ease the use of undo records
Top
See Also
Reference
Rhino.UI.Controls Namespace