RhinoCommon API
EdgeAnalysisSettings Class
 Contains static methods and properties to modify the visibility of edges in edge-related commands.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.EdgeAnalysisSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class EdgeAnalysisSettings
Public NotInheritable Class EdgeAnalysisSettings
The EdgeAnalysisSettings type exposes the following members.
Properties
Name | Description
ShowEdgeColor
Gets or sets a color used to enhance display edges in commands like _ShowEdges and _ShowNakedEdges.
ShowEdges
 Gets or sets a value referring to the group of edges that are targeted.
0 = all.
1 = naked.
2 = non-manifold.
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
RestoreDefaults
 Commits the default settings as the current settings.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace