RhinoCommon API
MeshExtruderParameterMode Enumeration
 Parameter mode for creating texture coordinates and surface parameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum MeshExtruderParameterMode
Public Enumeration MeshExtruderParameterMode
Members
Member name | Value | Description
CoverWalls | 0 |  Stretch parameters slightly on extruded faces to cover walls
KeepAndStretch | 1 |  Keep parameters on extruded faces and stretch on walls
See Also
Reference
Rhino.Geometry Namespace