RhinoCommon API
DocumentSaveEventArgs Class
 Provides document information for RhinoDoc events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocumentEventArgs
 Rhino.DocumentSaveEventArgs
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DocumentSaveEventArgs : DocumentEventArgs
Public Class DocumentSaveEventArgs
	Inherits DocumentEventArgs
The DocumentSaveEventArgs type exposes the following members.
Properties
Name | Description
ExportSelected
 true if only selected objects are being written to a file.
FileName
 Name of file being written.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino Namespace