RhinoCommon API
ViewCaptureSettings.AnchorLocation Enumeration
[Missing <summary> documentation for "T:Rhino.Display.ViewCaptureSettings.AnchorLocation"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
public enum AnchorLocation
Public Enumeration AnchorLocation
Members
Member name | Value | Description
LowerLeft | 0
LowerRight | 2
UpperLeft | 1
UpperRight | 3
Center | 4
See Also
Reference
Rhino.Display Namespace