RhinoCommon API
DisplayPipelineAttributes.SurfaceEdgeThicknessUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeThicknessUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SurfaceEdgeThicknessUse
Public Enumeration SurfaceEdgeThicknessUse
Members
Member name | Value | Description
ObjectWidth | 0
Pixels | 1
See Also
Reference
Rhino.Display Namespace