RhinoCommon API
RenderContent.ContentInstanceBrowserButtons Enumeration
Specifies optional buttons for ShowContentInstanceBrowser().
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.15
Syntax
public enum ContentInstanceBrowserButtons
Public Enumeration ContentInstanceBrowserButtons
Members
Member name | Value | Description
None | 0 | No optional buttons.
NewButton | 1 | Include New button.
EditButton | 2 | Include Edit button.
See Also
Reference
Rhino.Render Namespace