RhinoCommon API
FreeFloatingBase Class
 Base class for Rhino.Render objects that are owned by the document, or can be delivered separately from other functions. In general, you cannot create these objects yourself.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class FreeFloatingBase
Public MustInherit Class FreeFloatingBase
The FreeFloatingBase type exposes the following members.
Methods
Name | Description
CopyFrom
 Copy from another object
Finalize
 Handle destruction of the un-managed CPP object.
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render Namespace