RhinoCommon API
MeshPrincipalCurvatureList Class
 Provides access to the principal curvatures of a mesh object.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.MeshPrincipalCurvatureList
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public class MeshPrincipalCurvatureList : IResizableList<SurfaceCurvature>,
	IList<SurfaceCurvature>, ICollection<SurfaceCurvature>, IEnumerable<SurfaceCurvature>,
	IEnumerable, IList, ICollection, IReadOnlyList<SurfaceCurvature>,
	IReadOnlyCollection<SurfaceCurvature>
Public Class MeshPrincipalCurvatureList
	Implements IResizableList(Of SurfaceCurvature), IList(Of SurfaceCurvature),
	ICollection(Of SurfaceCurvature), IEnumerable(Of SurfaceCurvature), IEnumerable,
	IList, ICollection, IReadOnlyList(Of SurfaceCurvature), IReadOnlyCollection(Of SurfaceCurvature)
The MeshPrincipalCurvatureList type exposes the following members.
Properties
Name | Description
Capacity
 Gets or sets the total number of principal curvatures the internal data structure can hold without resizing.
Count
 Gets or sets the number of principal curvatures.
Item
 Gets or sets the principal curvature at the given index.
Top
Methods
Name | Description
Add
 Adds a new principal curvature to the end of the principal curvature list.
Clear
 Clears the principal curvature list on the mesh.
Destroy
 Releases all memory allocated to store principal curvatures. The list capacity will be 0 after this call.
Subsequent calls can add new items.
GetCurvatureStats
 Gets the mesh's curvature statistics.
GetEnumerator
 Gets an enumerator that yields all principal curvatures in this collection.
SetSurfaceCurvature
 Sets or adds a principal curvature to the principal curvature iist.
If [index] is less than [Count], the existing principal curvature at [index] will be modified.
If [index] equals [Count], a new principal curvature is appended to the end of the principal curvature list.
If [index] is larger than [Count], the function will return false.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace