RhinoCommon API
LicenseBuildType Enumeration
License build contentType enumerations.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum LicenseBuildType
Public Enumeration LicenseBuildType
Members
Member name | Value | Description
Unspecified | 0 | An unspecified build
Release | 100 | A release build (e.g. commercial, education, NFR, etc.)
Evaluation | 200 | A evaluation build
Beta | 300 | A beta build (e.g. WIP)
See Also
Reference
Rhino.PlugIns Namespace