RhinoCommon API
SubDSurfaceInterpolator Class
 Interpolate some or all of the vertices limit surface positions in a SubD to specified locations. NB: It is recommended not to use these methods to interpolate more than 1000 vertices.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDSurfaceInterpolator
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SubDSurfaceInterpolator : IDisposable
Public Class SubDSurfaceInterpolator
	Implements IDisposable
The SubDSurfaceInterpolator type exposes the following members.
Constructors
Name | Description
SubDSurfaceInterpolator
 Initialize an empty SubDSurfaceInterpolator.
Top
Properties
Name | Description
ContextId
 The context assigned id. This id is provided for applications using ON_SubDSurfaceInterpolator. It is not inspected or used in any part of the interpolation setup or calculations.
MaximumRecommendedInterpolatedVertexCount
 Interpolation requires building a solver. We estimate that this solver will work in reasonnable time if the number of interplolated vertices is smaller than MaximumInterpolatedVertexCount. However, given sufficient time, memory, and CPU resources, the code will work with any value. In version 8.0, this value is 1000.
Top
Methods
Name | Description
Clear
 Destroys the information needed to solve the interpolation.
CreateFromMarkedVertices
 Create an interpolator where all the marked vertices (unmarked if interpolatedVerticesMark is false) in the SubD are free vertices in the linear system used for interpolation, and the unmarked (marked if interpolatedVerticesMark is false) are fixed to their initial positions. Free vertices are can move as a result of the interpolation, and can receive an interpolation target location.
CreateFromSelectedVertices
 Create an interpolator where all the selected vertices in the SubD are free vertices in the linear system used for interpolation, and the unselected are fixed to their initial positions. Free vertices are can move as a result of the interpolation, and can receive an interpolation target location.
CreateFromSubD
 Create an interpolator where all the vertices in the SubD are free vertices in the linear system used for interpolation (i.e. can move as a result of the interpolation, and can receive an interpolation target location).
CreateFromVertexIdList
 Create an interpolator where all the listed vertices in the SubD are free vertices in the linear system used for interpolation, and the unselected are fixed to their initial positions. Free vertices are can move as a result of the interpolation, and can receive an interpolation target location.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
FixedVertexCount
InterpolatedVertexCount
InterpolatedVertexIndex
IsInterpolatedVertex(SubDVertex)
IsInterpolatedVertex(UInt32)
Solve
 Solve the interpolation system, given target interpolation locations for the free vertices in the system. Updates the subd referenced by this system so the corresponding surface points are at the locations given by surfacePoints.
Transform
 Apply an arbitrary transformation to the target interpolation points.
VertexIdList
Top
See Also
Reference
Rhino.Geometry Namespace
SubD.SetVertexSurfacePoint(UInt32, Point3d)
SubD.InterpolateSurfacePoints(Point3d[])
SubD.InterpolateSurfacePoints(UInt32[], Point3d[])
SubDVertex.SurfacePoint()