RhinoCommon API
MeshBooleanOptions Class
 Contains a set of data to pass to boolean options.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.MeshSplitOptions
 Rhino.Geometry.MeshBooleanOptions
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MeshBooleanOptions : MeshSplitOptions
Public Class MeshBooleanOptions
	Inherits MeshSplitOptions
The MeshBooleanOptions type exposes the following members.
Constructors
Name | Description
MeshBooleanOptions
Initializes a new instance of the MeshBooleanOptions class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace