RhinoCommon API
SceneServerData Class
 The Scene Server Data used by the PreviewSceneServer
Inheritance Hierarchy
System.Object
 Rhino.Render.SceneServerData
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SceneServerData : IDisposable
Public Class SceneServerData
	Implements IDisposable
The SceneServerData type exposes the following members.
Constructors
Name | Description
SceneServerData(PreviewAppearance, SceneServerDataUsage)
Initializes a new instance of the SceneServerData class
SceneServerData(PreviewGeometry, PreviewBackground, PreviewLighting, SceneServerDataUsage) |  Obsolete.
 Constructor for SceneServerData
Top
Properties
Name | Description
CppPointer
 The CppPointer of SceneServerData
Top
Methods
Name | Description
Dispose()
 Dispose for SceneServerData
Dispose(Boolean)
 Dispose for SceneServerData
Finalize
 Destructor for SceneServerData
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render Namespace