RhinoCommon API
DisplayPipelineAttributes.SurfaceNakedEdgeColorUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeColorUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public enum SurfaceNakedEdgeColorUse
Public Enumeration SurfaceNakedEdgeColorUse
Members
Member name | Value | Description
UseSurfaceEdgeSettings | 0
ObjectColor | 1
IsoCurveColor | 2
SingleColorForAll | 3
See Also
Reference
Rhino.Display Namespace