RhinoCommon API
UndoRecord Class
 Undo Record
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.UndoRecord
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class UndoRecord : IDisposable
Public Class UndoRecord
	Implements IDisposable
The UndoRecord type exposes the following members.
Constructors
Name | Description
UndoRecord
 UndoRecord Constructor
Top
Methods
Name | Description
Dispose()
 UndoRecord Dispose
Dispose(Boolean)
 UndoRecord Dispose
Finalize
 UndoRecord Destructor
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.UI.Controls Namespace