RhinoCommon API
UserInterfaceSection Class
Note: This API is now obsolete.
 Custom user interface section manager
Inheritance Hierarchy
System.Object
 Rhino.Render.UI.UserInterfaceSection
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Obsolete")]
public class UserInterfaceSection
<ObsoleteAttribute("Obsolete")>
Public Class UserInterfaceSection
The UserInterfaceSection type exposes the following members.
Properties
Name | Description
RenderContent
 The RenderContent object that created this user interface object.
Window
 The user control associated with this user interface object.
Top
Methods
Name | Description
Expand
 Expand or collapse this content section.
FromWindow
 Find the UserInterfaceSection that created the specified instance of a window.
GetContentList
 Returns a list of currently selected content items to be edited.
Show
 Show or hide this content section.
Top
See Also
Reference
Rhino.Render.UI Namespace