RhinoCommon API
ButtonType Enumeration
 The type of button in a notification.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum ButtonType
Public Enumeration ButtonType
Members
Member name | Value | Description
CancelOrClose | 0 |  Denotes either the Cancel button as well as, on some platforms, the close button if present.
Confirm | 1 |  The Confirm buttton.
Alternate | 2 |  The Alternate button.
See Also
Reference
Rhino.Runtime.Notifications Namespace