RhinoCommon API
OpenGLSettings Class
 Static methods and properties to control OpenGL settings
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.OpenGLSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class OpenGLSettings
Public Class OpenGLSettings
The OpenGLSettings type exposes the following members.
Constructors
Name | Description
OpenGLSettings
Initializes a new instance of the OpenGLSettings class
Top
Properties
Name | Description
AntialiasLevel
Gets or sets the anti-alias level used by OpenGL viewports
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings.
GetDefaultState
 Gets the OpenGL factory settings.
RestoreDefaults
 Updates from the default setting state.
UpdateFromState
 Updates from a particular setting state.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace