RhinoCommon API
GumballAlignment Enumeration
 Specifies the plane the gumball aligns itself to.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum GumballAlignment
Public Enumeration GumballAlignment
Members
Member name | Value | Description
WorldPlane | 0 | Aligns the gumball to the world axes.
ConstructionPlane | 1 | Aligns the gumball to the construction plane of the active viewport.
ViewPlane | 2 | Aligns the gumball to the plane of the active viewport.
ObjectPlane | 3 | Aligns the gumball to the object.
ControlPolygon | 4 |  Aligns the gumball to the control polygon of the object. ObjectPlane when no control polygon frame can be made.
See Also
Reference
Rhino.ApplicationSettings Namespace