RhinoCommon API
InstanceDefinitionTable Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.InstanceDefinitionTable"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<InstanceDefinition>
 Rhino.DocObjects.Tables.RhinoDocCommonTable<InstanceDefinition>
 Rhino.DocObjects.Tables.InstanceDefinitionTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class InstanceDefinitionTable : RhinoDocCommonTable<InstanceDefinition>
Public NotInheritable Class InstanceDefinitionTable
	Inherits RhinoDocCommonTable(Of InstanceDefinition)
The InstanceDefinitionTable type exposes the following members.
Properties
Name | Description
ActiveCount
 Number of items in the instance definitions table, excluding deleted definitions.
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of items in the instance definitions table.
 (Overrides CommonComponentTable<T>.Count.)
Document
Document that owns this table.
Item
 Conceptually, the InstanceDefinition table is an array of Instance definitions. The operator[] can be used to get individual instance definition. An instance definition is either active or deleted and this state is reported by IsDeleted or will be null if it has been purged from the document.
Top
Methods
Name | Description
Add(String, String, Point3d, IEnumerable<GeometryBase>)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, GeometryBase, ObjectAttributes)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>, Boolean)
 Adds an instance definition to the instance definition table, optionally replacing an existing definition of the same name.
Add(String, String, String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Adds an instance definition to the instance definition table.
Add(String, String, String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>, Boolean)
 Adds an instance definition to the instance definition table, optionally replacing an existing definition of the same name.
Compact
 Purge deleted instance definition information that is not in use. This function is time consuming and should be used in a thoughtful manner.
CreateFromFile(String, String, InstanceDefinitionUpdateType, InstanceDefinitionLayerStyle, InstanceDefinitionNameConflictResolution, Boolean)
 Creates an instance definition by reading a file, the way the Insert command does when inserting a file as a block. No instance reference is created.
CreateFromFile(String, String, String, String, String, InstanceDefinitionUpdateType, InstanceDefinitionLayerStyle, InstanceDefinitionNameConflictResolution, Boolean)
 Creates an instance definition by reading a file, the way the Insert command does when inserting a file as a block. No instance reference is created.
Delete(InstanceDefinition)
 Deletes the instance definition. This deletes all references too.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32, Boolean, Boolean)
 Deletes the instance definition.
DestroySourceArchive
 Destroys all source archive information. Specifically: * SourceArchive is set to the empty string. * SourceRelativePath is set to false * The alternative source archive path is set to the empty string. * Checksum.Zero() is used to private destroy all checksum information. * UpdateType is set to Static.
Export
 Exports the block definition's component objects to one of the file formats supported by Rhino.
Find(String)
Finds the instance definition with a given name.
Find(Guid, Boolean)
Finds the instance definition with a given id.
Find(String, Boolean) |  Obsolete.
Finds the instance definition with a given name.
GetEnumerator |  (Overrides CommonComponentTable<T>.GetEnumerator().)
GetList
 Gets an array of instance definitions.
GetUnusedInstanceDefinitionName()
 Gets unused instance definition name used as default when creating new instance definitions.
GetUnusedInstanceDefinitionName(String)
 Gets unused instance definition name used as default when creating new instance definitions.
GetUnusedInstanceDefinitionName(String, UInt32) |  Obsolete.
 Gets unused instance definition name used as default when creating new instance definitions.
InstanceDefinitionIndex
 Get the index of the instance definition with a given id.
MakeSourcePathRelative |  Obsolete.
 Obsolete method that always returns false. Marks the source path for a linked instance definition as relative or absolute.
Modify(Int32, UserData, Boolean)
 Modifies the instance definition user data. Does not change instance definition ID or geometry.
Modify(InstanceDefinition, String, String, Boolean)
 Modifies the instance definition name and description. Does not change instance definition ID or geometry.
Modify(Int32, String, String, Boolean)
 Modifies the instance definition name and description. Does not change instance definition ID or geometry.
Modify(InstanceDefinition, String, String, String, String, Boolean)
 Modifies the instance definition name, description, and url. Does not change instance definition ID or geometry.
Modify(Int32, String, String, String, String, Boolean)
 Modifies the instance definition name, description, and url. Does not change instance definition ID or geometry.
ModifyGeometry(Int32, IEnumerable<GeometryBase>)
ModifyGeometry(Int32, GeometryBase, ObjectAttributes)
ModifyGeometry(Int32, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Modifies the instance definition geometry and replaces all references to the current definition with references to the new definition.
ModifyInsertionPlane
 Modifies the insertion plane of an instance definition. The definition's geometry is re-origined so that the supplied plane becomes the new insertion plane - its origin is the new insertion point and its axes become the definition's axes. Existing instance references are not modified, so they will appear to move. Only embedded instance definitions are supported; the function returns false for linked definitions.
ModifyInsertionPoint
 Modifies the insertion point of an instance definition. The definition's geometry is re-origined so that the supplied point becomes the new insertion point - the point that aligns with the insertion location when the block is inserted. Existing instance references are not modified, so they will appear to move. Only embedded instance definitions are supported; the function returns false for linked definitions.
ModifySourceArchive(Int32, FileReference, InstanceDefinitionUpdateType, Boolean)
 If the instance definition is linked or embedded, use SetSource to specify the source archive.
ModifySourceArchive(Int32, FileReference, InstanceDefinitionUpdateType, InstanceDefinitionLayerStyle, Boolean)
 If the instance definition is linked or embedded, use SetSource to specify the source archive.
Purge
 Purges an instance definition and its definition geometry.
PurgeUnused
 Purges any unused instance definitions.
RefreshLinkedBlock
 Reload linked block definitions and update the Rhino display.
Undelete
 Undeletes an instance definition that has been deleted by Delete()
UndoModify
 Restores the instance definition to its previous state, if the instance definition has been modified and the modification can be undone.
UpdateLinkedInstanceDefinition
 Read the objects from a file and use them as the instance's definition geometry.
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace