RhinoCommon API
DisplayConduit Class
[Missing <summary> documentation for "T:Rhino.Display.DisplayConduit"]
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayConduit
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class DisplayConduit
Public MustInherit Class DisplayConduit
The DisplayConduit type exposes the following members.
Constructors
Name | Description
DisplayConduit
Initializes a new instance of the DisplayConduit class
Top
Properties
Name | Description
Enabled
GeometryFilter
 The geometry filter will ensure that your conduit's per-object functions will only be called for objects that are of certain geometry type
SpaceFilter
 If you want this conduit to only work in a specific space (model or page), then set this filter to that specific space. The default is None meaning no filter is applied
Top
Methods
Name | Description
Bind
 Bind this conduit to a specific viewport
CalculateBoundingBox
 Library developers should override this function to increase the bounding box of scene so it includes the geometry that you plan to draw in the "Draw" virtual functions.
The default implementation does nothing.
CalculateBoundingBoxZoomExtents
 If you want to participate in the Zoom Extents command with your display conduit, then you will need to override ZoomExtentsBoundingBox. Typically you could just call your CalculateBoundingBox override, but you may also want to spend a little more time here and compute a tighter bounding box for your conduit geometry if that is needed.
The default implementation does nothing.
DrawForeground
 Called after all non-highlighted objects have been drawn and PostDrawObjects has been called. Depth writing and testing are turned OFF. If you want to draw with depth writing/testing, see PostDrawObjects.
The default implementation does nothing.
DrawOverlay
 If Rhino is in a feedback mode, the draw overlay call allows for temporary geometry to be drawn on top of everything in the scene. This is similar to the dynamic draw routine that occurs with custom get point.
The default implementation does nothing.
ExclusiveBind
 Exclusively bind this conduit to a specific viewport
GetSelectionFilter
 The selection filter will make per-object conduit functions only be called for selected objects (when the filter is turned on)
ObjectCulling
The default implementation does nothing.
OnEnable
 Called when the enabled state changes for this class instance
PostDrawObjects
 Called after all non-highlighted objects have been drawn. Depth writing and testing are still turned on. If you want to draw without depth writing/testing, see DrawForeground.
The default implementation does nothing.
PostProcessFrameBuffer
 Called after the frame has been drawn, with the finished frame available to be read. Use this to record or stream a viewport: reading the frame here copies the one that was just drawn, and never redraws the scene.
Overriding this makes every frame cost an extra frame buffer read back for as long as the conduit is enabled, whether or not the override reads anything.
The override runs on the thread that drew the frame and holds up the next one. Copy the pixels here and do the rest of the work somewhere else.
The default implementation does nothing.
PreDrawObject
 Called before every object in the scene is drawn.
PreDrawObjects
 Called before objects are been drawn. Depth writing and testing are on.
The default implementation does nothing.
SetObjectIdFilter(Guid)
 Set an object Id that this conduit's per-object functions will only be called for
SetObjectIdFilter(IEnumerable<Guid>)
 Set object Ids that this conduit's per-object functions will only be called for
SetSelectionFilter
 The selection filter will make per-object conduit functions only be called for selected objects (when the filter is turned on)
UnbindAll
 Remove viewport bindings
Top
See Also
Reference
Rhino.Display Namespace