RhinoCommon API
Dimension.ForceText Enumeration
 OBSOLETE enum do not use.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ForceText
Public Enumeration ForceText
Members
Member name | Value | Description
Auto | 0
Inside | 1
Right | 2
Left | 3
HintRight | 4
HintLeft | 5
See Also
Reference
Rhino.Geometry Namespace