RhinoCommon API
Plane Structure
 Represents the value of a center point and two axes in a plane in three dimensions.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public struct Plane : IEquatable<Plane>,
	IEpsilonComparable<Plane>, ICloneable, IFormattable
<SerializableAttribute>
Public Structure Plane
	Implements IEquatable(Of Plane), IEpsilonComparable(Of Plane),
	ICloneable, IFormattable
The Plane type exposes the following members.
Constructors
Name | Description
Plane(Plane)
Copy constructor.
Plane(Point3d, Vector3d)
 Constructs a plane from a point and a normal vector.
Plane(Point3d, Point3d, Point3d)
 Initializes a plane from three non-collinear points.
Plane(Point3d, Vector3d, Vector3d)
 Constructs a plane from a point and two vectors in the plane.
Plane(Double, Double, Double, Double)
 Constructs a plane from an equation Ax+By+Cz+D=0.
Top
Properties
Name | Description
IsValid
 Gets a value indicating whether or not this is a valid plane. A plane is considered to be valid when all fields contain reasonable information and the equation jibes with point and z-axis.
Normal
 Gets the normal of this plane. This is essentially the ZAxis of the plane.
Origin
 Gets or sets the origin point of this plane.
OriginX
 Gets or sets the X coordinate of the origin of this plane.
OriginY
 Gets or sets the Y coordinate of the origin of this plane.
OriginZ
 Gets or sets the Z coordinate of the origin of this plane.
Unset
 Gets a plane that contains Unset origin and axis vectors.
WorldXY
 plane coincident with the World XY plane.
WorldYZ
 plane coincident with the World YZ plane.
WorldZX
 plane coincident with the World ZX plane.
XAxis
 Gets or sets the X axis vector of this plane.
YAxis
 Gets or sets the Y axis vector of this plane.
ZAxis
 Gets or sets the Z axis vector of this plane.
Top
Methods
Name | Description
Clone
 Returns a deep copy of this instance.
ClosestParameter
 Gets the parameters of the point on the plane closest to a test point.
ClosestPoint
 Gets the point on the plane closest to a test point.
CreateFromFrame
 Constructs a plane from a point, and two vectors in the plane.
CreateFromNormal
 Constructs a plane from a point and normal vector.
CreateFromNormalYup
 Construct a plane from a point, a normal vector, and a vector that projects to the positive YAxis.
CreateFromPoints
 Construct a plane from three non-collinear points.
DistanceTo(Point3d)
 Returns the signed distance from testPoint to its projection onto this plane. If the point is below the plane, a negative distance is returned.
DistanceTo(BoundingBox, Double, Double)
 Returns the signed minimum and maximum distances from bounding box to this plane.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines if an object is a plane and has the same components as this plane.
 (Overrides ValueType.Equals(Object).)
Equals(Plane)
 Determines if another plane has the same components as this plane.
ExtendThroughBox(BoundingBox, Interval, Interval)
 Extends this plane through a bounding box.
ExtendThroughBox(Box, Interval, Interval)
 Extend this plane through a Box.
FitPlaneToPoints(IEnumerable<Point3d>, Plane)
Fit a plane through a collection of points.
FitPlaneToPoints(IEnumerable<Point3d>, Plane, Double)
Fit a plane through a collection of points.
Flip
 Flip this plane by swapping out the X and Y axes and inverting the Z axis.
GetHashCode
 Gets a non-unique hashing code for this entity.
 (Overrides ValueType.GetHashCode().)
GetPlaneEquation
 Gets the plane equation for this plane in the format of Ax+By+Cz+D=0.
IsCoplanar(Plane)
 Test if this plane is co-planar with a another plane.
IsCoplanar(Plane, Double)
 Test if this plane is co-planar with a another plane.
PointAt(Double, Double)
 Evaluate a point on the plane.
PointAt(Double, Double, Double)
 Evaluate a point on the plane.
RemapToPlaneSpace
 Convert a point from World space coordinates into Plane space coordinates.
Rotate(Double, Vector3d)
 Rotate the plane about its origin point.
Rotate(Double, Vector3d, Point3d)
 Rotate the plane about a custom anchor point.
Rotate(Double, Double, Vector3d)
 Rotate the plane about its origin point.
Rotate(Double, Double, Vector3d, Point3d)
Rotate the plane about a custom anchor point.
ToString()
 Constructs the string representation of this plane.
 (Overrides ValueType.ToString().)
ToString(String, IFormatProvider)
Formats the value of the current instance using the specified format.
Transform
 Transform the plane with a Transformation matrix.
Translate
 Translate (move) the plane along a vector.
UpdateEquation
 Update Equations
ValueAt
 Get the value of the plane equation at the point.
Top
Operators
Name | Description
Equality
 Determines if two planes are equal.
Inequality
 Determines if two planes are different.
Top
See Also
Reference
Rhino.Geometry Namespace