RhinoCommon API
File3dmObjectTable Class
 Represents a simple object table for a file that is open externally.
This class mimics Rhino.DocObjects.Tables.ObjectTable while providing external access to the file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<File3dmObject>
 Rhino.FileIO.File3dmCommonComponentTable<File3dmObject>
 Rhino.FileIO.File3dmObjectTable
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmObjectTable : File3dmCommonComponentTable<File3dmObject>,
	IEnumerable<File3dmObject>, IEnumerable
Public Class File3dmObjectTable
	Inherits File3dmCommonComponentTable(Of File3dmObject)
	Implements IEnumerable(Of File3dmObject), IEnumerable
The File3dmObjectTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns ModelGeometry.
 (Overrides CommonComponentTable<T>.ComponentType.)
Count
 Returns the total amount of items in the object table, including lights.
 (Overrides CommonComponentTable<T>.Count.)
Top
Methods
Name | Description
Add(File3dmObject)
 Duplicates the object, then adds a copy of the object to the document.
 (Overrides File3dmCommonComponentTable<T>.Add(T).)
Add(GeometryBase, ObjectAttributes)
 Duplicates the object, then adds a copy of the object to the document.
AddAngularDimension(AngularDimension)
 Adds a angular dimension object to the 3dm file object table.
AddAngularDimension(AngularDimension, ObjectAttributes)
 Adds a angular dimension object to the 3dm file object table.
AddArc(Arc)
Adds a curve object to the document representing an arc.
AddArc(Arc, ObjectAttributes)
Adds a curve object to the document representing an arc.
AddBrep(Brep)
Adds a brep object to Rhino.
AddBrep(Brep, ObjectAttributes)
Adds a brep object to Rhino.
AddCircle(Circle)
Adds a curve object to the document representing a circle.
AddCircle(Circle, ObjectAttributes)
Adds a curve object to the document representing a circle.
AddClippingPlane(Plane, Double, Double, IEnumerable<Guid>)
 Adds a clipping plane object to Rhino.
AddClippingPlane(Plane, Double, Double, Guid)
 Adds a clipping plane object to Rhino.
AddClippingPlane(Plane, Double, Double, IEnumerable<Guid>, ObjectAttributes)
 Adds a clipping plane object to Rhino.
AddCurve(Curve)
Adds a curve object to the table.
AddCurve(Curve, ObjectAttributes)
Adds a curve object to the table.
AddEllipse(Ellipse)
Adds a curve object to the document representing an ellipse.
AddEllipse(Ellipse, ObjectAttributes)
Adds a curve object to the document representing an ellipse.
AddExtrusion(Extrusion)
Adds an extrusion object to Rhino.
AddExtrusion(Extrusion, ObjectAttributes)
Adds an extrusion object to Rhino.
AddHatch(Hatch)
 Adds a hatch to the document.
AddHatch(Hatch, ObjectAttributes)
 Adds a hatch to the document.
AddInstanceObject(InstanceReferenceGeometry)
 Adds an instance reference geometry object to the table.
AddInstanceObject(InstanceReferenceGeometry, ObjectAttributes)
 Adds an instance reference geometry object to the table.
AddInstanceObject(Int32, Transform)
 Adds an instance reference geometry object to the table.
AddInstanceObject(Int32, Transform, ObjectAttributes)
 Adds an instance reference geometry object to the table.
AddLeader(IEnumerable<Point3d>)
 Adds an annotation leader to the document. This overload is only provided in the Rhino SDK.
AddLeader(Plane, IEnumerable<Point2d>)
 Adds an annotation leader to the document.
AddLeader(String, IEnumerable<Point3d>)
 Adds an annotation leader to the document. This overload is only provided in the Rhino SDK.
AddLeader(Plane, IEnumerable<Point2d>, ObjectAttributes)
 Adds an annotation leader to the document.
AddLeader(String, Plane, IEnumerable<Point2d>)
 Adds an annotation leader to the document.
AddLeader(String, Plane, IEnumerable<Point2d>, ObjectAttributes)
 Adds an annotation leader to the document.
AddLine(Line)
Adds a line object to Rhino.
AddLine(Line, ObjectAttributes)
Adds a line object to Rhino.
AddLine(Point3d, Point3d)
Adds a line object to Rhino.
AddLine(Point3d, Point3d, ObjectAttributes)
Adds a line object to Rhino.
AddLinearDimension(LinearDimension)
 Adds a linear dimension to the 3dm file object table.
AddLinearDimension(LinearDimension, ObjectAttributes)
 Adds a linear dimension to the 3dm file object table.
AddMesh(Mesh)
Adds a mesh object to Rhino.
AddMesh(Mesh, ObjectAttributes)
Adds a mesh object to Rhino.
AddOrdinateDimension(OrdinateDimension)
 Adds an ordinate dimension object to the 3dm file object table.
AddOrdinateDimension(OrdinateDimension, ObjectAttributes)
 Adds an ordinate dimension object to the 3dm file object table.
AddPoint(Point3d)
Adds a point object to the table.
AddPoint(Point3f)
Adds a point object to the document.
AddPoint(Point3d, ObjectAttributes)
Adds a point object to the document.
AddPoint(Point3f, ObjectAttributes)
Adds a point object to the document.
AddPoint(Double, Double, Double)
 Adds a point object to the table.
AddPointCloud(IEnumerable<Point3d>)
Adds a point cloud object to the document.
AddPointCloud(PointCloud)
Adds a point cloud object to the document.
AddPointCloud(IEnumerable<Point3d>, ObjectAttributes)
Adds a point cloud object to the document.
AddPointCloud(PointCloud, ObjectAttributes)
Adds a point cloud object to the document.
AddPoints(IEnumerable<Point3d>)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3f>)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3d>, ObjectAttributes)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3f>, ObjectAttributes)
 Adds multiple points to the document.
AddPolyline(IEnumerable<Point3d>)
Adds a polyline object to Rhino.
AddPolyline(IEnumerable<Point3d>, ObjectAttributes)
Adds a polyline object to Rhino.
AddRadialDimension(RadialDimension)
 Adds a radial dimension object to the 3dm file object table.
AddRadialDimension(RadialDimension, ObjectAttributes)
 Adds a radial dimension object to the 3dm file object table.
AddSphere(Sphere)
 Adds a surface object to the document representing a sphere.
AddSphere(Sphere, ObjectAttributes)
 Adds a surface object to the document representing a sphere.
AddSubD(SubD)
 Adds a SubD to the document
AddSubD(SubD, ObjectAttributes)
 Adds a SubD to the document
AddSurface(Surface)
Adds a surface object to Rhino.
AddSurface(Surface, ObjectAttributes)
Adds a surface object to Rhino.
AddText(Text3d)
 Adds an annotation text object to the document.
AddText(Text3d, ObjectAttributes)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean, ObjectAttributes)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean, TextJustification)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean, TextJustification, ObjectAttributes)
 Adds an annotation text object to the document.
AddTextDot(TextDot)
Adds a text dot object to the table.
AddTextDot(String, Point3d)
Adds a text dot object to the table.
AddTextDot(TextDot, ObjectAttributes)
Adds a text dot object to the table.
AddTextDot(String, Point3d, ObjectAttributes)
Adds a text dot object to the table.
Delete(Guid)
 Deletes object from document.
Delete(IEnumerable<Guid>)
 Deletes a collection of objects from the document.
FindByGroup
 Finds all File3dmObject that are in a given group.
FindByLayer(Layer)
 Finds all File3dmObject that are in a given layer.
FindByLayer(String)
 Finds all File3dmObject that are in a given layer.
GetBoundingBox
Gets the bounding box containing every object in this table.
GetEnumerator
 Returns an enumerator that yields all objects in this document. Like in Rhino, this includes lights. Unlike in Rhino, however, all lights are returned in the end of the list.
 (Overrides CommonComponentTable<T>.GetEnumerator().)
Top
See Also
Reference
Rhino.FileIO Namespace