RhinoCommon API
DistanceDisplayMode Enumeration
[Missing <summary> documentation for "T:Rhino.UI.DistanceDisplayMode"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum DistanceDisplayMode
Public Enumeration DistanceDisplayMode
Members
Member name | Value | Description
Decimal | 0
Fractional | 1
FeetInches | 2
See Also
Reference
Rhino.UI Namespace