RhinoCommon API
FileStl Class
 Support for writing STL file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileStl
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileStl
Public NotInheritable Class FileStl
The FileStl type exposes the following members.
Methods
Name | Description
Read
Read a STL file into a RhinoDoc
Write
Write a STL file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace