RhinoCommon API
ChangeQueue Class
 Base class for ChangeQueue. Generally used by render plugins to build interactive updating of scenes that are being rendered.
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.ChangeQueue
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class ChangeQueue : IDisposable
Public MustInherit Class ChangeQueue
	Implements IDisposable
The ChangeQueue type exposes the following members.
Constructors
Name | Description
ChangeQueue(Guid, CreatePreviewEventArgs)
 Construct a new ChangeQueue using the given CreatePreviewEventArgs. The preview scene for these args will be used to populate the world.
ChangeQueue(Guid, UInt32, ViewInfo, Boolean) |  Obsolete.
 Construct a new ChangeQueue from the given document
ChangeQueue(Guid, UInt32, ViewInfo, DisplayPipelineAttributes, Boolean, Boolean)
 Construct a new ChangeQueue from the given document, using given display pipeline attributes.
Top
Properties
Name | Description
DisplayPipelineAttributes
 Get the DisplayPipelineAttributes if available, null otherwise
IsPreview
 Return true if this ChangeQueue is created for preview rendering. No view was set for preview rendering.
ViewId
 Return view ID for a RhinoDoc based ChangeQueue. Returns Guid.Empty if no view was associated with the changequeue, i.e. preview rendering.
Top
Methods
Name | Description
ApplyClippingPlaneChanges
 Override this when you want to handle clippingplane changes
ApplyDisplayPipelineAttributesChanges
 Override if you need to react to display attribute changes. This function is needed to be able to react to different sample settings for i.e. capture preview rendering.
ApplyDynamicClippingPlaneChanges
 Override this when you want to handle dynamicclippingplane changes
ApplyDynamicLightChanges
 Handle dynamic light changes
ApplyDynamicObjectTransforms
 Handle dynamic object transforms
ApplyEnvironmentChanges
 Override this when you want to handle environment changes
ApplyGroundPlaneChanges
 Override this when you want to handle groundplane changes
ApplyLightChanges
 Override this when you want to handle light changes
ApplyLinearWorkflowChanges
 Override this when you want to handle linear workflow changes
ApplyMaterialChanges
 Override when you want to handle material changes
ApplyMeshChanges
 Override this when you want to handle mesh changes.
ApplyMeshInstanceChanges
 Override this when you want to handle mesh instance changes (block instances and first-time added new meshes)
ApplyRenderSettingsChanges(DisplayRenderSettings)
 Override this when you want to handle render setting changes. These are for the viewport settings.
ApplyRenderSettingsChanges(RenderSettings)
 Override this when you need to handle background changes (through RenderSettings)
ApplySkylightChanges
 Override this when you want to handle skylight changes
ApplySunChanges
 Override this when you want to handle sun changes
ApplyViewChange
 Override ApplyViewChange when you want to receive changes to the view/camera
AreViewsEqual
 Compare to ViewInfo instances and decide whether they are equal or not. If you need to change the way the comparison is done you can override this function and implement your custom comparison.
BakeFor
 Override this if you need to control baking behavior for textures. By default bake everything.
BakingSize
 Override this if you need to control the size of the baked bitmaps for textures. By default the value returned is 2048.
ContentRenderHash
 Override this if you need to modify the way render hashes are calcuated in the change queue. This will alter the way materials are grouped.
ConvertCameraBasedLightToWorld
 Convert given (camera-based) light to a world-based light (in-place)
CrcFromGuid
 Helper function to get a CRC from a Guid.
CreateWorld()
 Calls CreateWorld with true passed.
CreateWorld(Boolean)
 Signal the queue to do the initialisation of the queue, seeding it with the content currently available.
Dispose()
 Dispose our ChangeQueue
Dispose(Boolean)
 Dispose our ChangeQueue. Disposes unmanaged memory.
EnvironmentForid
 Get RenderEnvironment for given RenderHash. Can return null.
EnvironmentFromOriginalInstanceId
 Get the RenderEnvironment from the ChangeQueue content cache from the original instance id
EnvironmentIdForUsage
 Get RenderEnvironment RenderHash for given usage.
Flush
 Tell the ChangeQueue to flush all collected events. This can trigger a host of Apply* calls. The following is the order in which those calls get made if there are changes for that specific data type: ApplyViewChange ApplyLinearWorkflowChanges ApplyDynamicObjectTransforms ApplyDynamicLightChanges ApplyRenderSettingsChanges ApplyEnvironmentChanges (background) ApplyEnvironmentChanges (refl) ApplyEnvironmentChanges (sky) ApplySkylightChanges ApplySunChanges ApplyLightChanges ApplyMaterialChanges ApplyMeshChanges ApplyMeshInstanceChanges ApplyGroundPlaneChanges ApplyClippingPlaneChanges
GetQueueGroundPlane
 Get groundplane known to the queue at the time of the Flush
GetQueueRenderSettings
 Get render settings known to the queue at the time of the Flush
GetQueueSceneBoundingBox
 Get the scene bounding box
GetQueueSkylight
 Get skylight known to the queue at the time of the Flush
GetQueueSun
 Get sun known to the queue at the time of the Flush
GetQueueView
 Get view known to the queue at the time of the Flush
MaterialFromId
 Get the RenderMaterial from the ChangeQueue material cache based on RenderHash
MaterialFromOriginalInstanceId
 Get the RenderMaterial from the ChangeQueue material cache from the original instance id
NotifyBeginUpdates
 Override this when you want to be notified of begin of changes
NotifyDynamicUpdatesAreAvailable
 Override this when you want to be notified dynamic updates are available
NotifyEndUpdates
 Override this when you want to be notified when change notifications have ended.
OneShot
 Call Flush() once, after that automatically dispose the queue.
OriginalInstanceIdsFromEnvironmentId
 Return the collection of original document instance ids assocaited with the Environment id.
OriginalInstanceIdsFromMaterialId
 Return the collection of original document instance ids assocaited with the material id.
OriginalInstanceIdsFromTextureId
 Return the collection of original document instance ids assocaited with the Texture id.
ProvideOriginalObject
 Override ProvideOriginalObject and return true if you want original objects supplied with ChangeQueue.Mesh. This will then also allow access to the Attributes.UserData of the original object from which the Mesh was generated.
RefreshMaterials
 Signal the queue to refresh all of the materials in the scene.
TextureForId
 Get RenderTexture for given RenderHash. Can return null.
TextureFromOriginalInstanceId
 Get the RenderTexture from the ChangeQueue content cache from the original instance id
Top
See Also
Reference
Rhino.Render.ChangeQueue Namespace