RhinoCommon API
ViewCaptureWriter.VectorFillPolygonProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.VectorFillPolygonProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void VectorFillPolygonProc(
	int argb,
	int count,
	IntPtr points
)
Public Delegate Sub VectorFillPolygonProc (
	argb As Integer,
	count As Integer,
	points As IntPtr
)
Parameters
argb
Type: System.Int32
count
Type: System.Int32
points
Type: System.IntPtr
See Also
Reference
Rhino.Runtime Namespace