RhinoCommon API
TextureGraphInfo Class
[Missing <summary> documentation for "T:Rhino.Render.TextureGraphInfo"]
Inheritance Hierarchy
System.Object
 Rhino.Render.TextureGraphInfo
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class TextureGraphInfo : IDisposable
Public Class TextureGraphInfo
	Implements IDisposable
The TextureGraphInfo type exposes the following members.
Constructors
Name | Description
TextureGraphInfo
Initializes a new instance of the TextureGraphInfo class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
ActiveAxis
ActiveChannel
AmountU
AmountV
AmountW
Dispose
Releases all resources used by the TextureGraphInfo
Finalize |  (Overrides Object.Finalize().)
SetActiveAxis
SetActiveChannel
SetAmountU
SetAmountV
SetAmountW
Top
See Also
Reference
Rhino.Render Namespace