RhinoCommon API
IsoDrawMode Enumeration
 Defines how drawing should be performed when drawing with iso intervals aka zebra or banded drawing
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum IsoDrawMode
Public Enumeration IsoDrawMode
Members
Member name | Value | Description
None | 0
DirectionalLight | 1
DirectionalLightXY | 2
DirectionalLightXYDots | 3
DirectionalLightCameraX | 4
DirectionalLightCameraY | 5
DirectionalLightCameraXY | 6
DirectionalLightCameraXYDots | 7
DirectionalLightCameraZ | 8
PointLight | 9
PointLightCamera | 10
CylindricalStatic | 11
DirectionalDistance | 12
DirectionalDistanceCamera | 13
See Also
Reference
Rhino.Display Namespace