RhinoCommon API
StdVectorFloat Class
 Wrapper for ON_SimpleArray<float>. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.StdVectorFloat
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class StdVectorFloat : IDisposable
Public Class StdVectorFloat
	Implements IDisposable
The StdVectorFloat type exposes the following members.
Constructors
Name | Description
StdVectorFloat()
 Initializes a new StdVectorFloat class.
StdVectorFloat(IEnumerable<Single>)
 Initializes a new SimpleArrayFloat class
StdVectorFloat(StdVectorFloat)
 Initializes a new StdVectorFloat with the contents of another SimpleArrayFloat.
StdVectorFloat(UInt64)
 Initializes a new StdVectorFloat class. Initial size of the array - all values are set to zero.
Top
Properties
Name | Description
Count
 Gets the amount of elements in this array.
Top
Methods
Name | Description
ConstPointer
 Gets the constant (immutable) pointer of this array.
CopyTo
 Copies the contents of a StdVectorFloat into another SimpleArrayFloat.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Memory
 Return the raw data.
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToArray
 Returns the managed counterpart of the unmanaged array.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace