RhinoCommon API
RefinementSettings Class
 Defines the way a mesh refinement modifier works.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.MeshRefinements.RefinementSettings
 Namespace: Rhino.Geometry.MeshRefinements
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RefinementSettings
Public Class RefinementSettings
The RefinementSettings type exposes the following members.
Constructors
Name | Description
RefinementSettings
 Creates a default operation settings object.
Top
Properties
Name | Description
ContinueRequest
 A token to request computation termination.
HasPull
 Gets a value indicating whether this subdivision should create a result on a specific surface.
Level
 The level of subdivision to achieve.
NakedEdgeMode
 Set this property to define how naked edges should be treated.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry.MeshRefinements Namespace