RhinoCommon API
FileXamlWriteOptions Class
 Options for writing a Xaml file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileXamlWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileXamlWriteOptions
Public Class FileXamlWriteOptions
The FileXamlWriteOptions type exposes the following members.
Constructors
Name | Description
FileXamlWriteOptions
Initializes a new instance of the FileXamlWriteOptions class
Top
Properties
Name | Description
AddRotationAnimation
AddRotationScrollbars
AnimationAxis
MeshingParameters
UseExistingRenderMeshes
 If render meshes exist they will be used. Otherwise they are created on the fly using the current render settings of the document.
UseOriginForRotationCenter
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace