RhinoCommon API
ViewCaptureWriter.PathPoint Structure
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.PathPoint"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public struct PathPoint
Public Structure PathPoint
The ViewCaptureWriter.PathPoint type exposes the following members.
Properties
Name | Description
Location
PointType
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Runtime Namespace