RhinoCommon API
PhysicallyBasedMaterial.BRDFs Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.PhysicallyBasedMaterial.BRDFs"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum BRDFs
Public Enumeration BRDFs
Members
Member name | Value | Description
GGX | 0
Ward | 1
See Also
Reference
Rhino.DocObjects Namespace