RhinoCommon API
ThicknessAnalysisSettings Class
 Contains static methods and properties to modify Zebra analysis-related commands.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.ThicknessAnalysisSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static class ThicknessAnalysisSettings
Public NotInheritable Class ThicknessAnalysisSettings
The ThicknessAnalysisSettings type exposes the following members.
Properties
Name | Description
DistanceRange
 The distance range.
ShowIsoCurves
 Get or sets the display of surface isocurves.
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
RestoreDefaults
 Commits the default settings as the current settings.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace