RhinoCommon API
FileDwgWriteOptions.FlattenMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileDwgWriteOptions.FlattenMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum FlattenMode
Public Enumeration FlattenMode
Members
Member name | Value | Description
None | 0
Cplane | 1
View | 2
See Also
Reference
Rhino.FileIO Namespace