RhinoCommon API
FileXaml Class
 Support for writing Xaml file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileXaml
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileXaml
Public NotInheritable Class FileXaml
The FileXaml type exposes the following members.
Methods
Name | Description
Write
Write a Xaml file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace