RhinoCommon API
ICurrentEnvironment Interface
[Missing <summary> documentation for "T:Rhino.Render.ICurrentEnvironment"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface ICurrentEnvironment : ICurrentEnvironment_Get
Public Interface ICurrentEnvironment
	Inherits ICurrentEnvironment_Get
The ICurrentEnvironment type exposes the following members.
Properties
Name | Description
ForAnyUsage |  Obsolete.
ForBackground
 Get or set the RenderEnvironment used as the 360 degree backdrop environment. If getting, null will be returned if the background mode is set to 'Solid Color' or 'Gradient' (i.e., not 'Environment'). If setting, passing null will not work because this environment usage can't be turned off.
ForBackground_CheckMode |  Obsolete.
ForLighting
 Get or set the RenderEnvironment used as custom skylighting environment. If getting, null will be returned if the custom skylighting environment override is disabled. If setting, passing null will turn the custom skylighting environment override off but it will not actually set its id to null. Setting to a valid environment will also turn the custom skylighting environment override on.
ForReflectionAndRefraction
 Get or set the RenderEnvironment used as custom reflection (and refraction) environment. If getting, null will be returned if the custom reflection override is disabled. If setting, passing null will turn the custom reflection environment override off but it will not actually set its id to null. Setting to a valid environment will also turn the custom reflection environment override on.
Top
See Also
Reference
Rhino.Render Namespace