RhinoCommon API
Brep.CurveConstraint Class
 Variational curve constraint (position)
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Brep.CurveConstraint
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class CurveConstraint
Public NotInheritable Class CurveConstraint
The Brep.CurveConstraint type exposes the following members.
Constructors
Name | Description
Brep.CurveConstraint(Curve)
 Constructor, use curve as positional constraint
Brep.CurveConstraint(Curve, Continuity)
 Subclass constructor for any continuity
Top
Properties
Name | Description
Curve
 The constraint curve
Top
Methods
Name | Description
Top
Fields
Name | Description
Continuity
 The constraint continuity
Top
See Also
Reference
Rhino.Geometry Namespace