RhinoCommon API
FileIgsWriteOptions.PolySurfacesMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileIgsWriteOptions.PolySurfacesMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum PolySurfacesMode
Public Enumeration PolySurfacesMode
Members
Member name | Value | Description
PsrfSeparate | 0
PsrfUnorderedGroup | 402
See Also
Reference
Rhino.FileIO Namespace