RhinoCommon API
NamedValue Class
[Missing <summary> documentation for "T:Rhino.Render.NamedValue"]
Inheritance Hierarchy
System.Object
 Rhino.Render.NamedValue
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class NamedValue
Public NotInheritable Class NamedValue
The NamedValue type exposes the following members.
Constructors
Name | Description
NamedValue
Initializes a new instance of the NamedValue class
Top
Properties
Name | Description
Name
Value
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace