RhinoCommon API
InstanceDefinitionLayerStyle Enumeration
 InstanceDefinition.LayerStyle specifies how model components (layers, materials, dimension styles, etc.) from linked instance definition files appear in the active model.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum InstanceDefinitionLayerStyle
Public Enumeration InstanceDefinitionLayerStyle
Members
Member name | Value | Description
None | 0 |  This is the only valid layer style when the instance definition type is InstanceDefinitionUpdateType.Static or InstanceDefinitionUpdateType.LinkedAndEmbedded. This style is not valid when the instance definition type is InstanceDefinitionUpdateType.Linked.
Active | 1 |  Model components (layers, materials, dimension styles, etc.) from linked instance definition files are embedded as ordinary components in the active model. This layer style may be used when the instance definition type is InstanceDefinitionUpdateType.Linked.
Reference | 2 |  Layers from the linked instance definition are reference components in the model. This is the default layer style when the instance definition type is InstanceDefinitionUpdateType.Linked. This layer style may be used when the instance definition type is InstanceDefinitionUpdateType.Linked.
See Also
Reference
Rhino.DocObjects Namespace