RhinoCommon API
GetCircle Class
[Missing <summary> documentation for "T:Rhino.Input.Custom.GetCircle"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetCircle
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GetCircle : IDisposable
Public Class GetCircle
	Implements IDisposable
The GetCircle type exposes the following members.
Constructors
Name | Description
GetCircle
Initializes a new instance of the GetCircle class
Top
Properties
Name | Description
AllowDeformable
 Allow for deformable options
DefaultSize
 Default radius or diameter (based on InDiameterMode)
Deformable
 Is the deformable option set
DeformableDegree
DeformablePointCount
InDiameterMode
 Determines if the "size" value is representing a radius or diameter
UseActiveLayerLinetypeForCurves
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Get
 Perform the 'get' operation.
Top
See Also
Reference
Rhino.Input.Custom Namespace