RhinoCommon API
OnLeaseChangedDelegate Delegate
 Called by Rhino to signal that a lease from Rhino Accounts has changed. If LicenseLeaseChangedEventArgs.Lease is null, then the server has signaled that this product is no longer licensed. Your plug-in must change behavior to behave appropriately.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void OnLeaseChangedDelegate(
	LicenseLeaseChangedEventArgs args,
	out Icon icon
)
Public Delegate Sub OnLeaseChangedDelegate (
	args As LicenseLeaseChangedEventArgs,
	<OutAttribute> ByRef icon As Icon
)
Parameters
args
Type: Rhino.PlugIns.LicenseLeaseChangedEventArgs
Data passed by Rhino when the lease changes
icon
Type: System.Drawing.Icon
Icon to be displayed in Tools > Options > Licenses for this lease.
See Also
Reference
Rhino.PlugIns Namespace