RhinoCommon API
RiskyAction Class
 Defines risky actions that need to be reported in crash exceptions
Inheritance Hierarchy
System.Object
 Rhino.Runtime.RiskyAction
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RiskyAction : IDisposable
Public Class RiskyAction
	Implements IDisposable
The RiskyAction type exposes the following members.
Constructors
Name | Description
RiskyAction
 Always create this in a using block
Top
Methods
Name | Description
Dispose
 IDisposable implementation
Top
See Also
Reference
Rhino.Runtime Namespace