RhinoCommon API
SurfaceCurvature Class
 Maintains computed information for principal surface curvature evaluation.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SurfaceCurvature
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SurfaceCurvature : IDisposable,
	IEquatable<SurfaceCurvature>, IComparable<SurfaceCurvature>
Public Class SurfaceCurvature
	Implements IDisposable, IEquatable(Of SurfaceCurvature),
	IComparable(Of SurfaceCurvature)
The SurfaceCurvature type exposes the following members.
Constructors
Name | Description
SurfaceCurvature
 Default constructs a new surface curvature object. Both kappa1 and kappa2 are zero.
Top
Properties
Name | Description
Gaussian
 The Gaussian curvature is kappa1*kappa2.
IsNaN
 True if either of kappa1 or kappa2 is NaN.
IsSet
 True if kappa1 and kappa2 are both valid finite values.
IsUnset
 True if either of kappa1 or kappa2 is not a valid finite value.
IsZero
 True if both kappa1 and kappa2 are zero.
MaximumPrincipalCurvature
 If set, the maximum of kapp1 and kappa2 returned. Otherwise, the quiet NaN is returned.
MaximumRadius
 If a principal curvature value is zero or the principal curvatures have opposite signs, then the maximum radius of curvature is infinite RhinoMath.InfiniteRadius is returned. Otherwise the maximum radius of curvature is 1/min(fabs(kappa1),fabs(kappa2)).
Mean
 The mean curvature is (kappa1+kappa2)/2.
MinimumPrincipalCurvature
 If set, the minimum of kappa1 and kappa2 returned. Otherwise, the quiet NaN is returned.
MinimumRadius
 The minimum radius of curvature is 1/max(fabs(kappa1),fabs(kappa2)). Infinite radius values are returned as RhinoMath.InfiniteRadius.
Normal
 Gets the normal direction of the surface at the u,v parameter where the surface curvature was evaluated.
Point
 Gets the point at the u,v parameter where the surface curvature was evaluated.
UVPoint
 Gets the u,v parameter where the surface curvature was evaluated.
Top
Methods
Name | Description
CompareTo
 Compares the current instance with another object of the same type and returns an integer that indicates whether the current instance precedes, follows, or occurs in the same position in the sort order as the other object.
Create
 Create a SurfaceCurvature from explicit principal curvatures and the geometric frame at the evaluation point. Use this when you have already computed curvature data from a non-RhinoCommon surface representation (planes, spheres, cylinders, cones, etc.).
CreateFromGaussianAndMeanCurvatures
 Create a SurfaceCurvature from a gaussian and mean curvature values using the relationship between the principal curvatures, gaussian and mean: kappa1 = mean + sqrt(mean*mean - gaussian) kappa2 = mean - sqrt(mean*mean - gaussian) If the radicand is negative, we assume we're dealing with a bit of numerical noise or estimates and set the principal curvatures: kappa1 = kappa2 = sign(mean)*sqrt(gaussian)
CreateFromPrincipalCurvatures
 Create a SurfaceCurvature from the principal curvature values. The principal curvature values are the most fundamental curvature properties of a surface. Other curvatures are calculated from them.
CreateFromSubD(SubD, SubDComponentParameter)
 Create a SurfaceCurvature by evaluating a SubD's surface (its limit surface) at a surface parameter.
CreateFromSubD(SubD, SubDComponentParameter, SubD.ExtraordinaryVertexCurvature)
 Create a SurfaceCurvature by evaluating a SubD's surface (its limit surface) at a surface parameter, choosing what to report exactly on an extraordinary vertex.
CreateFromSurface
 Create a SurfaceCurvature from by evaluating surface and a u,v parameter.
Direction
 Gets the principal curvature direction vector at the u,v parameter where the surface curvature was evaluated..
Dispose
 Actively releases the unmanaged pointer.
Equals(Object)
 Indicates whether the current object is equal to another object of the same type.
 (Overrides Object.Equals(Object).)
Equals(SurfaceCurvature)
 Indicates whether the current object is equal to another object of the same type.
Finalize
 Passively releases the unmanaged pointer.
 (Overrides Object.Finalize().)
GetHashCode
 Returns a runtime-stable hash code for this object.
 (Overrides Object.GetHashCode().)
Kappa
 Gets the principal curvature values: kappa1 - Principal curvature with maximum absolute value. kappa2 - Principal curvature with minimum absolute value.
KappaValue
 Calculate one of the four typical curvature values associated with the two principal curvatures and frequently used in false color curvature analysis.
OsculatingCircle
 Computes the osculating circle along the given direction.
Top
See Also
Reference
Rhino.Geometry Namespace