RhinoCommon API
DimensionStyle.Field Enumeration
 Field identifiers used for file i/o and getting/setting values
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum Field
Public Enumeration Field
Members
Member name | Value | Description
Unset | 0
Name | 1 | Dimension style Name property. Cannot be inherited from parent.
Index | 2 | Dimension style runtime model component index property. Cannot be inherited from parent.
ExtensionLineExtension | 3
ExtensionLineOffset | 4
Arrowsize | 5
LeaderArrowsize | 6
Centermark | 7
TextGap | 8
TextHeight | 9
DimTextLocation | 10 | Linear, angular, and ordinate dimension text location above/in/below
MaskFrameType | 11 | Text mask frame
LengthResolution | 12
AngleFormat | 13
AngleResolution | 14
Font | 15
LengthFactor | 16 |  LengthFactor is a rarely used. It applies when a model is being drawn to a scale and the dimension length values should be reverse scaled. For example, if a model is drawn at 1/4 scale, a line 5 units long indicates the real world line is 20 units long. In this case setting LengthFactor to 4 would cause a linear dimension applied to that line to display a value of 20.
Alternate | 17
AlternateLengthFactor | 18 |  AlternateLengthFactor is a rarely used. See Length factor for a description of this property.
AlternateLengthResolution | 20
Prefix | 21
Suffix | 22
AlternatePrefix | 23
AlternateSuffix | 24
DimensionLineExtension | 25
SuppressExtension1 | 26
SuppressExtension2 | 27
ExtLineColorSource | 28
DimLineColorSource | 29
ArrowColorSource | 30
TextColorSource | 31
ExtLineColor | 32
DimLineColor | 33
ArrowColor | 34
TextColor | 35
ExtLinePlotColorSource | 36
DimLinePlotColorSource | 37
ArrowPlotColorSource | 38
TextPlotColorSource | 39
ExtLinePlotColor | 40
DimLinePlotColor | 41
ArrowPlotColor | 42
TextPlotColor | 43
ExtLinePlotWeightSource | 44
DimLinePlotWeightSource | 45
ExtLinePlotWeight_mm | 46
DimLinePlotWeight_mm | 47
ToleranceFormat | 48
ToleranceResolution | 49
ToleranceUpperValue | 50
ToleranceLowerValue | 51
AltToleranceResolution | 52
ToleranceHeightScale | 53
BaselineSpacing | 54
DrawMask | 55
MaskColorSource | 56
MaskColor | 57
MaskBorder | 58
DimensionScale | 59
DimscaleSource | 60
FixedExtensionLength | 61
FixedExtensionOn | 62
TextRotation | 63
SuppressArrow1 | 64
SuppressArrow2 | 65
TextmoveLeader | 66
ArclengthSymbol | 67
StackTextheightScale | 68
StackFormat | 69
AltRound | 70
Round | 71
AngularRound | 72
AltZeroSuppress | 73
AngleZeroSuppress | 75
ZeroSuppress | 76
AltBelow | 77
ArrowType1 | 78
ArrowType2 | 79
LeaderArrowType | 80
ArrowBlockId1 | 81
ArrowBlockId2 | 82
LeaderArrowBlock | 83
DimRadialTextLocation | 84 | Radial dimension text location above/in/below
TextVerticalAlignment | 85
LeaderTextVerticalAlignment | 86
LeaderContentAngleStyle | 87
LeaderCurveType | 88
LeaderContentAngle | 89
LeaderHasLanding | 90
LeaderLandingLength | 91
MaskFlags | 92
CentermarkStyle | 93
TextHorizontalAlignment | 94
LeaderTextHorizontalAlignment | 95
DrawForward | 96
SignedOrdinate | 97
UnitSystem | 98 |  Unit system for dimension rendering sizes like TextHeight, TextGap, ArrowSize, ExtOffset, and dozens of other properties that control the appearance and placement of the components used to render a dimension.
TextMask | 99
TextOrientation | 100
LeaderTextOrientation | 101
DimTextOrientation | 102
DimRadialTextOrientation | 103
DimTextAngleStyle | 104
DimRadialTextAngleStyle | 105
TextUnderlined | 106
DimensionLengthDisplay | 109 |  Dimension length display. See ON_DimStyle::DimensionLengthDisplay() for a description of this parameter.
AlternateDimensionLengthDisplay | 110 |  Alternate dimension length display. See ON_DimStyle::AlternateDimensionLengthDisplay() for a description of this parameter.
ForceDimLine | 111 |  Force dimension line to draw when text is moved outside
ArrowFit | 112 |  Arrow position when arrows won't fit between extensions
TextFit | 113 |  Text position when text won't fit between extensions
DecimalSeparator | 114 |  Character to use for decimal separator in dimension text
Kerning | 115 |  Enable kerning for placement of characters
LineSpaceScale | 116 |  Scale applied for line spacing
ClippingArrowType1 | 117
ClippingArrowType2 | 118
ClippingArrowSize | 119
SuppressDimLine1 | 120 | Suppress the dimension line and arrowhead between the first extension line and the text.
SuppressDimLine2 | 121 | Suppress the dimension line and arrowhead between the second extension line and the text.
Count | 122 | Every enum UINT value that identifies a valid dimension style property is less than the UINT value of Count.
See Also
Reference
Rhino.DocObjects Namespace