RhinoCommon API
GripObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.GripObject"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.GripObject
 Rhino.DocObjects.Custom.CustomGripObject
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GripObject : RhinoObject
Public Class GripObject
	Inherits RhinoObject
The GripObject type exposes the following members.
Properties
Name | Description
CurrentLocation
Index |  (Overrides ModelComponent.Index.)
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Moved
 true if the grip has moved from OriginalLocation.
OriginalLocation
Owner
 The object these grips belong to.
OwnerId
SubDComponentId
 Id of the SubD component this grip is on, or 0 when the grip names no SubD component.
Weight
 The weight of a NURBS control point grip or RhinoMath.UnsetValue if the grip is not a NURBS control point grip.
Top
Methods
Name | Description
GetCageParameters
 Retrieves the 2d parameter space values of this GripObject from the cage it's associated with.
GetCurveCVIndices
 Retrieves the NURBS curve control point indices of this GripObject from the curve it is associated with.
GetCurveParameters
 Retrieves the 2d parameter space values of this GripObject from the curve it's associated with.
GetGripDirections
 Sometimes grips have directions. These directions can have any length and do not have to be orthogonal.
GetSurfaceCVIndices
 Retrieves the NURBS surface control point indices of this GripObject from the surface it is associated with.
GetSurfaceParameters
 Retrieves the NURBS surface 2d parameter space values of this GripObject from the surface it's associated with.
Move(Point3d)
 Moves the grip to a new location.
Move(Transform)
 Moves the grip to a new location.
Move(Vector3d)
 Moves the grip to a new location.
NeighborGrip
 Used to get a grip's logical neighbors, like NURBS curve, surface, and cage control point grips.
UndoMove
 Undoes any grip moves made by calling Move.
Top
See Also
Reference
Rhino.DocObjects Namespace