RhinoCommon API
SweepBlend Enumeration
 Blend types for creating swept surfaces
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum SweepBlend
Public Enumeration SweepBlend
Members
Member name | Value | Description
Local | 0 |  The sweep stays constant at the ends and changes more rapidly in the middle.
Global | 1 |  The sweep is linearly blended from one end to the other, creating sweeps that taper from one cross-section curve to the other.
See Also
Reference
Rhino.Geometry Namespace