RhinoCommon API
Fonts.Size Enumeration
 Size for UI font.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum Size
Public Enumeration Size
Members
Member name | Value | Description
Small | 0 | 0.8 x Normal
Normal | 1 | 1.0 x Normal
Large | 2 | 1.2 x Normal
Title | 3 | 2.0 x Normal
See Also
Reference
Rhino.UI Namespace