RhinoCommon API
SimulatedEnvironment Class
[Missing <summary> documentation for "T:Rhino.Render.SimulatedEnvironment"]
Inheritance Hierarchy
System.Object
 Rhino.Render.SimulatedEnvironment
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimulatedEnvironment : IDisposable
Public Class SimulatedEnvironment
	Implements IDisposable
The SimulatedEnvironment type exposes the following members.
Constructors
Name | Description
SimulatedEnvironment
Initializes a new instance of the SimulatedEnvironment class
Top
Properties
Name | Description
BackgroundColor
BackgroundImage
BackgroundProjection
Top
Methods
Name | Description
ConstPointer
Dispose()
Releases all resources used by the SimulatedEnvironment
Dispose(Boolean)
Releases the unmanaged resources used by the SimulatedEnvironment and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
ProjectionFromString
StringFromProjection
Top
See Also
Reference
Rhino.Render Namespace