RhinoCommon API
File3dm.TableTypeFilter Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.File3dm.TableTypeFilter"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.9
Syntax
[FlagsAttribute]
public enum TableTypeFilter
<FlagsAttribute>
Public Enumeration TableTypeFilter
Members
Member name | Value | Description
None | 0
StartSection | 1 | The 3dm start section.
Properties | 2
Settings | 4
Bitmap | 8
TextureMapping | 16
Material | 32
Linetype | 64
Layer | 128
Group | 256
Font | 512
FutureFont | 1024
Dimstyle | 2048
Light | 4096
Hatchpattern | 8192
SectionStyle | 16384 | The section style table (Rhino 9 and later).
Markup | 32768 | The markup table (Rhino 9 and later).
PageViewGroup | 65536 | The page view group table (Rhino 9 and later).
InstanceDefinition | 131072
ObjectTable | 262144
Historyrecord | 524288
UserTable | 268435456
See Also
Reference
Rhino.FileIO Namespace