RhinoCommon API
File3mf Class
 Support for writing 3mf file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3mf
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class File3mf
Public NotInheritable Class File3mf
The File3mf type exposes the following members.
Methods
Name | Description
Write
Write a 3mf file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace