RhinoCommon API
IZooClientUtilities2 Interface
 Additions to IZooClientUtilities. Implemented in ZooClient alongside that interface and discovered by casting the injected service.
 New members go here rather than on IZooClientUtilities: that interface is public, so adding to it is a breaking change for anything else that implements it.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.34
Syntax
public interface IZooClientUtilities2
Public Interface IZooClientUtilities2
The IZooClientUtilities2 type exposes the following members.
Methods
Name | Description
ValidateStandaloneLicense
 RH-92777: Validates a stand-alone license key for the given account email against the validation server, asking the user for no input (progress and any server-reported problems are shown by the validation wizard). Returns true on success.
Top
See Also
Reference
Rhino.Runtime Namespace