RhinoCommon API
TextureGraphInfo.Axis Enumeration
[Missing <summary> documentation for "T:Rhino.Render.TextureGraphInfo.Axis"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public enum Axis
Public Enumeration Axis
Members
Member name | Value | Description
kU | 0
kV | 1
kW | 2
See Also
Reference
Rhino.Render Namespace