RhinoCommon API
FileFbxWriteOptions Class
 Options for writing a Fbx file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileFbxWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileFbxWriteOptions
Public Class FileFbxWriteOptions
The FileFbxWriteOptions type exposes the following members.
Constructors
Name | Description
FileFbxWriteOptions
Initializes a new instance of the FileFbxWriteOptions class
Top
Properties
Name | Description
MapRhinoZtoFbxY
MeshingParameters
SaveFileAs
SaveLights
SaveMaterialsAs
SaveObjectsAs
SaveVertexNormals
SaveViews
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace