RhinoCommon API
CorruptGeometryException Class
 Thrown when Rhino finds a brep or mesh that will cause a crash if used for calculations.
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.CorruptGeometryException
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class CorruptGeometryException : Exception
Public Class CorruptGeometryException
	Inherits Exception
The CorruptGeometryException type exposes the following members.
Properties
Name | Description
CommonObject
 Corrupt geometry .NET class
Pointer
 pointer to base geometry (ON_Object*)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Runtime Namespace