RhinoCommon API
VisualAnalysisMode.EdgeContinuityMode Enumeration
 Continuity mode to report
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum EdgeContinuityMode
Public Enumeration EdgeContinuityMode
Members
Member name | Value | Description
Distance | 0 |  G0 Continuity
Tangency | 1 |  G1 Continuity
Curvature | 2 |  G2 Continuity
See Also
Reference
Rhino.Display Namespace