RhinoCommon API
FileLwoReadOptions Class
 Options for reading a Lwo file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileLwoReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileLwoReadOptions
Public Class FileLwoReadOptions
The FileLwoReadOptions type exposes the following members.
Constructors
Name | Description
FileLwoReadOptions
Initializes a new instance of the FileLwoReadOptions class
Top
Properties
Name | Description
Unweld
UnweldAngle
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace