RhinoCommon API
FileSwReadOptions Class
 Options used when reading a SW file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileSwReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileSwReadOptions
Public Class FileSwReadOptions
The FileSwReadOptions type exposes the following members.
Constructors
Name | Description
FileSwReadOptions
Initializes a new instance of the FileSwReadOptions class
Top
Properties
Name | Description
ImportConstructionGeometry
ImportPartsAsBlocks
RotateYtoZ
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Import function
Top
See Also
Reference
Rhino.FileIO Namespace