RhinoCommon API
Toolbar Class
 Represents a toolbar in a Rhino toolbar, or .RUI, file.
Inheritance Hierarchy
System.Object
 Rhino.UI.Toolbar
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public sealed class Toolbar
Public NotInheritable Class Toolbar
The Toolbar type exposes the following members.
Properties
Name | Description
BitmapSize
 Gets and sets the size of the toolbar image.
Id
 Gets the id of the toolbar.
Name
 Gets the name of the toolbar.
TabSize
 Gets and sets the size of the toolbar tab.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace