RhinoCommon API
Dialogs.OnColorChangedEvent Delegate
 May be optionally passed to ShowColorDialog and will get called when the color value changes in the color dialog.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void OnColorChangedEvent(
	Color4f color
)
Public Delegate Sub OnColorChangedEvent (
	color As Color4f
)
Parameters
color
Type: Rhino.Display.Color4f
See Also
Reference
Rhino.UI Namespace