RhinoCommon API
DisplayModeDescription Class
 Description of a how Rhino will display in a viewport. These are the modes that are listed under "Advanced display" in the options dialog.
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayModeDescription
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class DisplayModeDescription : IDisposable,
	ISerializable
<SerializableAttribute>
Public Class DisplayModeDescription
	Implements IDisposable, ISerializable
The DisplayModeDescription type exposes the following members.
Properties
Name | Description
AllowObjectAssignment
AmbientOcclusionId
ArtisticId
DisplayAttributes
EnglishName
GhostedId
Id
InMenu
LocalName
MonochromeId
PenId
PipelineLocked
RaytracedId
RenderedId
RenderedShadowsId
ShadedId
ShadedPipelineRequired
SupportsShadeCommand
SupportsShading
TechId
WireframeId
WireframePipelineRequired
XRayId
Top
Methods
Name | Description
AddDisplayMode(DisplayModeDescription)
 Adds a new display mode from an existing description. Note that this only registers the mode in memory; call UpdateDisplayMode to persist it to disk.
AddDisplayMode(String)
 Adds a new display mode. Note that this only registers the mode in memory; call UpdateDisplayMode to persist it to disk.
CopyDisplayMode
 Copies an existing display mode. Note that this only registers the new mode in memory; call UpdateDisplayMode to persist it to disk.
DeleteDiplayMode |  Obsolete.
 Deletes an existing display mode.
DeleteDisplayMode
 Deletes an existing display mode.
Dispose()
Releases all resources used by the DisplayModeDescription
Dispose(Boolean)
Releases the unmanaged resources used by the DisplayModeDescription and optionally releases the managed resources
ExportToFile
 Exports a DisplayModeDescription to a Windows-style .ini file.
Finalize |  (Overrides Object.Finalize().)
FindByName
 Finds a display mode description by its English name.
GetDisplayMode
 Gets a display mode description by id.
GetDisplayModes
 Gets all display mode descriptions that Rhino currently knows about.
ImportFromFile(String)
 Imports a DisplayModeDescription from a Windows-style .ini file.
ImportFromFile(String, Boolean)
 Imports a DisplayModeDescription from a Windows-style .ini file.
SaveDisplayModes
 Saves all display modes to disk.
UpdateDisplayMode(DisplayModeDescription)
 Updates an existing display mode and immediately saves it to disk. Call this after AddDisplayMode/CopyDisplayMode or changing DisplayAttributes to persist the change; otherwise an unrelated settings save elsewhere in Rhino can reload the display mode list from disk and silently discard the unsaved mode.
UpdateDisplayMode(DisplayModeDescription, Boolean)
 Updates an existing display mode.
Top
See Also
Reference
Rhino.Display Namespace