RhinoCommon API
ContentUuids Class
 Content Guids of RenderContent provided by the RDK SDK. These Guids can be used to check against RenderContent.TypeId.
Inheritance Hierarchy
System.Object
 Rhino.Render.ContentUuids
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class ContentUuids
Public NotInheritable Class ContentUuids
The ContentUuids type exposes the following members.
Properties
Name | Description
AddTextureType
AdvancedDotTextureType
BasicEnvironmentCCI
BasicEnvironmentType
BasicMaterialCCI
BasicMaterialType
BitmapTextureType
BlendMaterialCCI
BlendMaterialType
BlendTextureType
CompositeMaterialCCI
CompositeMaterialType
CrossHatchBumpTexture
CubeMapTextureType
DefaultEnvironmentInstance
DefaultMaterialInstance
DisplayAttributeMaterialType
DotBumpTexture
DoubleSidedMaterialType
EmissionMaterialType
ExposureTextureType
EXRTextureType
FBmTextureType
GemMaterialType
GlassMaterialType
GradientTextureType
GraniteTextureType
GridTextureType
GritBumpTexture
HatchBumpTexture
HDRTextureType
LeatherBumpTexture
MarbleTextureType
MaskTextureType
MetalMaterialType
MultiplyTextureType
NoiseTextureType
PaintMaterialType
PerlinMarbleTextureType
PerturbingTextureType
PhysicallyBasedMaterialType
PhysicalSkyTextureType
PictureMaterialType
PlasterMaterialType
PlasticMaterialType
ProjectionChangerTextureType
RealtimeDisplayMaterialType
ResampleTextureType
SimpleBitmapTextureType
SingleColorTextureType
SpeckleBumpTexture
StuccoTextureType
Texture2DCheckerTextureType
Texture3DCheckerTextureType
TextureAdjustmentTextureType
TileTextureType
TurbulenceTextureType
V8BlendMaterialType
 Rhino V8 Blend material type Guid
WavesTextureType
WoodBumpTexture
WoodTextureType
Top
See Also
Reference
Rhino.Render Namespace