RhinoCommon API
LightObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.LightObject"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.LightObject
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class LightObject : RhinoObject
Public Class LightObject
	Inherits RhinoObject
The LightObject type exposes the following members.
Properties
Name | Description
ComponentType |  (Overrides RhinoObject.ComponentType.)
Index |  (Overrides ModelComponent.Index.)
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
LightGeometry
Top
Methods
Name | Description
DuplicateLightGeometry
Top
See Also
Reference
Rhino.DocObjects Namespace