RhinoCommon API
ShowPanelReason Enumeration
 OnShowDockbar event type
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ShowPanelReason
Public Enumeration ShowPanelReason
Members
Member name | Value | Description
Show | 0 |  Dock bar shown or made visible
Hide | 1 |  Dock bar hidden, no longer visible
HideOnDeactivate | 2 |  Dock bar temporarily hidden because the main Rhino application is no longer active.
ShowOnDeactivate | 3 |  Dock bar that was temporarily hidden when the main Rhino application was deactivated is now being shown.
See Also
Reference
Rhino.UI Namespace