RhinoCommon API
Installation Enumeration
The type of Rhino executable that is executing
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum Installation
Public Enumeration Installation
Members
Member name | Value | Description
Undefined | 0 | Unknown
Commercial | 1
Educational | 2
EducationalLab | 3
NotForResale | 4
NotForResaleLab | 5
Beta | 6
BetaLab | 7
Evaluation | 8 | 25 Save limit evaluation version of Rhino
Corporate | 9
EvaluationTimed | 10 | 90 day time limit evaluation version of Rhino
See Also
Reference
Rhino.ApplicationSettings Namespace