RhinoCommon API
FileAi Class
 Support for writing ai file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileAi
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileAi
Public NotInheritable Class FileAi
The FileAi type exposes the following members.
Methods
Name | Description
Read
Read a Ai file into a RhinoDoc
Write
Write a Ai file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace