RhinoCommon API
ShowMessageButton Enumeration
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageButton"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum ShowMessageButton
Public Enumeration ShowMessageButton
Members
Member name | Value | Description
OK | 0
OKCancel | 1
AbortRetryIgnore | 2
YesNoCancel | 3
YesNo | 4
RetryCancel | 5
See Also
Reference
Rhino.UI Namespace