RhinoCommon API
RhinoDoc.RenderContentTableEventArgs Class
 Passed to the RenderMaterialsTableEvent, RenderEnvironmentTableEvent and the RenderTextureTableEvent events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.RhinoDoc.RenderContentTableEventArgs
 Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderContentTableEventArgs : EventArgs
Public Class RenderContentTableEventArgs
	Inherits EventArgs
The RhinoDoc.RenderContentTableEventArgs type exposes the following members.
Properties
Name | Description
Document
 Document the table belongs to
EventType
 Event type
Top
Methods
Name | Description
Top
See Also
Reference
Rhino Namespace