RhinoCommon API
SimpleArrayArrayPoint3d Class
 Wrapper for ON_SimpleArray<ON_PolyLine*>, ON_SimpleArray<ON_3dPointArray*> If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArrayArrayPoint3d : IDisposable
Public Class SimpleArrayArrayPoint3d
	Implements IDisposable
The SimpleArrayArrayPoint3d type exposes the following members.
Constructors
Name | Description
SimpleArrayArrayPoint3d
 Initializes a new empty SimpleArrayArrayPoint3d instance.
Top
Properties
Name | Description
Count
 Gets the amount of polylines in this array.
Item
 Gets a point in a polyline.
Top
Methods
Name | Description
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
PointCountAt
 Gets the amount of points in a polyline.
PolylineAt
 Gets a polyline at an index.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace