RhinoCommon API
ScaleValue Class
 Represents a scale with associated LengthValues and string representations of the scale. This allows for going back and forth from numerical representations of a scale and a string representation without "guessing" at the initial scale.
Inheritance Hierarchy
System.Object
 Rhino.ScaleValue
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ScaleValue : IDisposable
Public Class ScaleValue
	Implements IDisposable
The ScaleValue type exposes the following members.
Constructors
Name | Description
ScaleValue
 Default constructor
Top
Properties
Name | Description
LeftToRightScale
 LeftLengthValue / RightLengthValue
RightToLeftScale
 RightLengthValue / LeftLengthValue
Top
Methods
Name | Description
Create(String, StringParserSettings)
 Create from string
Create(LengthValue, LengthValue, ScaleValue.ScaleStringFormat)
 Create from 2 length values
Dispose
actively reclaim native allocated ON_SacleValue*
Finalize
passively reclaim native allocated ON_ScaleValue*
 (Overrides Object.Finalize().)
IsUnset
 Test IsUnset
LeftLengthValue
 Get the Left LengthValue from Scale
OneToOne
 Make a new ScaleValue set to OneToOne
RightLengthValue
 Get the Right LengthValue from Scale
Top
See Also
Reference
Rhino Namespace