RhinoCommon API
IHasCppImplementation Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.IHasCppImplementation"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IHasCppImplementation
Public Interface IHasCppImplementation
The IHasCppImplementation type exposes the following members.
Properties
Name | Description
CppPointer
Top
See Also
Reference
Rhino.UI.Controls Namespace