RhinoCommon API
FileDwgWriteOptions.ExportPolycurveMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileDwgWriteOptions.ExportPolycurveMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum ExportPolycurveMode
Public Enumeration ExportPolycurveMode
Members
Member name | Value | Description
Lines | 0
Polybulges | 1
Polylines | 2
Splines | 3
ThreeDPolylines | 4
See Also
Reference
Rhino.FileIO Namespace