RhinoCommon API
OrdinateDimension.MeasuredDirection Enumeration
 Ordinate dimension measures x or y direction
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum MeasuredDirection
Public Enumeration MeasuredDirection
Members
Member name | Value | Description
Unset | 0
Xaxis | 1 |  Measures horizontal distance
Yaxis | 2 |  Measures vertical distance
See Also
Reference
Rhino.Geometry Namespace