RhinoCommon API
IRhRdkThumbnailList_Shapes Enumeration
Note: This API is now obsolete.
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Shapes"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("IRhRdkThumbnailList_Shapes is obsolete", false)]
public enum IRhRdkThumbnailList_Shapes
<ObsoleteAttribute("IRhRdkThumbnailList_Shapes is obsolete", false)>
Public Enumeration IRhRdkThumbnailList_Shapes
Members
Member name | Value | Description
Square | 0 | Square thumbnails.
Wide | 1 | Wide thumbnails.
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace