RhinoCommon API
RhinoGet.BitmapFileTypes Enumeration
[Missing <summary> documentation for "T:Rhino.Input.RhinoGet.BitmapFileTypes"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[FlagsAttribute]
public enum BitmapFileTypes
<FlagsAttribute>
Public Enumeration BitmapFileTypes
Members
Member name | Value | Description
bmp | 1
jpg | 2
pcx | 4
png | 8
tif | 16
tga | 32
See Also
Reference
Rhino.Input Namespace