RhinoCommon API
PythonCompiledCode Class
 Represents scripting compiled code.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.PythonCompiledCode
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class PythonCompiledCode
Public MustInherit Class PythonCompiledCode
The PythonCompiledCode type exposes the following members.
Constructors
Name | Description
PythonCompiledCode
Initializes a new instance of the PythonCompiledCode class
Top
Methods
Name | Description
Execute
 Executes the script in a specific scope.
Top
See Also
Reference
Rhino.Runtime Namespace