RhinoCommon API
FilePov Class
 Support for writing POV file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FilePov
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FilePov
Public NotInheritable Class FilePov
The FilePov type exposes the following members.
Methods
Name | Description
Write
Write a POV file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace