RhinoCommon API
FileXamlWriteOptions.AnimationMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileXamlWriteOptions.AnimationMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum AnimationMode
Public Enumeration AnimationMode
Members
Member name | Value | Description
X | 0
Y | 1
Z | 2
See Also
Reference
Rhino.FileIO Namespace