RhinoCommon API
MarkupTableEventArgs Class
 markup table event arguments.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.Tables.MarkupTableEventArgs
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public class MarkupTableEventArgs : EventArgs
Public Class MarkupTableEventArgs
	Inherits EventArgs
The MarkupTableEventArgs type exposes the following members.
Properties
Name | Description
Document
The Rhino document.
EventType
The event type.
Index
The index of the markup.
NewState
The markup
OldState
The old or previous markup.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace