RhinoCommon API
ViewCaptureWriter.VectorPolylineProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.VectorPolylineProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void VectorPolylineProc(
	int argb,
	float thickness,
	int dashed,
	int capStyle,
	int joinStyle,
	int count,
	IntPtr points
)
Public Delegate Sub VectorPolylineProc (
	argb As Integer,
	thickness As Single,
	dashed As Integer,
	capStyle As Integer,
	joinStyle As Integer,
	count As Integer,
	points As IntPtr
)
Parameters
argb
Type: System.Int32
thickness
Type: System.Single
dashed
Type: System.Int32
capStyle
Type: System.Int32
joinStyle
Type: System.Int32
count
Type: System.Int32
points
Type: System.IntPtr
See Also
Reference
Rhino.Runtime Namespace