RhinoCommon API
SimpleArray2dex Class
 Wrapper for ON_SimpleArray<ON_2dex>. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArray2dex
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArray2dex : IDisposable
Public Class SimpleArray2dex
	Implements IDisposable
The SimpleArray2dex type exposes the following members.
Constructors
Name | Description
SimpleArray2dex()
 Initializes a new SimpleArray2dex class.
SimpleArray2dex(IEnumerable<IndexPair>)
 Initializes a new SimpleArray2dex class
Top
Properties
Name | Description
Count
 Gets the amount of elements in this array.
Top
Methods
Name | Description
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToArray
 Returns the managed counterpart of the unmanaged array.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace