RhinoCommon API
File3dmCurvePiping Class
 Represents the curve piping attached to file3dm object attributes.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmCurvePiping
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmCurvePiping
Public Class File3dmCurvePiping
The File3dmCurvePiping type exposes the following members.
Properties
Name | Description
Accuracy
 Specifies the accuracy of the pipe in the range 0 to 100.
CapType
 Specifies the cap type to use.
Faceted
 Specifies whether the pipe is faceted or not.
On
 Specifies whether curve piping is enabled or not.
Radius
 Specifies the radius of the pipe (minimum value 0.0001).
Segments
 Specifies the number of segments in the pipe (minimum value 2).
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace