RhinoCommon API
AddCustomUISections Class
 This class contains the event to add custom ui sections when the content ui is created.
Inheritance Hierarchy
System.Object
 Rhino.Render.AddCustomUISections
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class AddCustomUISections
Public NotInheritable Class AddCustomUISections
The AddCustomUISections type exposes the following members.
Events
Name | Description
OnAddCustomUISections
 This event is raised when a OnAddCustomUISections Event is triggered in rdk.
Top
See Also
Reference
Rhino.Render Namespace