RhinoCommon API
DirectionGripUserInterfaceObject Class
 A point plus direction arrows that represents a grip constrained to a line
Inheritance Hierarchy
System.Object
 Rhino.UI.UserInterfaceObjectBase
 Rhino.UI.GripUserInterfaceObject
 Rhino.UI.DirectionGripUserInterfaceObject
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DirectionGripUserInterfaceObject : GripUserInterfaceObject
Public Class DirectionGripUserInterfaceObject
	Inherits GripUserInterfaceObject
The DirectionGripUserInterfaceObject type exposes the following members.
Constructors
Name | Description
DirectionGripUserInterfaceObject
 Create a direction grip located at location and constrained to a direction
Top
Properties
Name | Description
ArrowRadius
 Size of direction end shape
ArrowShape
 Shape used for end of direction line
DirectionLineLength
 Length of direction line in pixel units
GripDirection
 Constrained direction of grip
GripPointVisible
 Is the grip point itself drawn
OneWay
 Is the grip a single direction grip
Top
Methods
Name | Description
ArrowsVisibleInViewport
 Are the arrows visible for a given viewport. Projections that cause the arrows to be end on are projections where arrows are not drawn.
Top
See Also
Reference
Rhino.UI Namespace