RhinoCommon API
ViewCaptureSettings Class
 Holds information required to generate high resolution output of a RhinoViewport. This is used for generating paper prints or image files
Inheritance Hierarchy
System.Object
 Rhino.Display.ViewCaptureSettings
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ViewCaptureSettings : IDisposable
Public Class ViewCaptureSettings
	Implements IDisposable
The ViewCaptureSettings type exposes the following members.
Constructors
Name | Description
ViewCaptureSettings()
Construct default view capture settings
ViewCaptureSettings(ViewCaptureSettings)
Copy constructor
ViewCaptureSettings(RhinoPageView, Double)
Constructor
ViewCaptureSettings(RhinoView, Size, Double)
Constructor
Top
Properties
Name | Description
ApplyDisplayModeThicknessScales
 Should curves and edges have their thicknesses scaled based the on the display mode settings for a view being captured (default is false)
ArrowheadSizeMillimeters
 Arrowhead size in millimeters.
CropRectangle
 Actual area of output rectangle that view capture is sent to.
DefaultPrintWidthMillimeters
 Line thickness, in millimeters, used to print objects with no defined thickness.
Document
DrawAxis
DrawBackground
DrawBackgroundBitmap
DrawClippingPlanes
DrawGrid
DrawLights
DrawLockedObjects
DrawMargins
DrawRectangle
 Rectangle where drawing is confined to on MediaSize
DrawSelectedObjectsOnly
DrawWallpaper
FooterText
 Text drawn at the bottom of the output
HeaderText
 Text drawn at the top of the output
HorizontalScale
 Horizontal stretch to be applied to output. Useful for calibrating printers
IsScaleToFit
 Returns true if the model has been scaled to fit.
IsValid
LinetypeWidthUnitsArePageLengths
MatchLinetypePatternDefinition
 Default is true. Linetype scales are normally generated right before printing/view capture in order to get linetypes to print to the same lengths as defined. If false, the linetypes are not scaled and the current pattern lengths as seen on the screen as used.
MediaSize
 Total size of the image or page in dots
ModelScaleType
OffsetAnchor
OutputColor
PointSizeMillimeters
 Size of point objects in millimeters. if scale <= 0 the size is minimized so points are always drawn as small as possible
RasterMode
Resolution
Capture "density" in dots per inch.
TextDotPointSize
 Font point size use for printing text dots. The default value is 10.0. This has morphed into a scale setting as individual text dots have their own sizes. A value of 20 will print dots at double of their size setting while a value of 10 will print with no scaling applied.
UsePrintWidths
VerticalScale
 Vertical stretch to be applied to output. Useful for calibrating printers
ViewArea
 How the RhinoViewport is mapped to the output rectangle
WireThicknessScale
 Scaling factor to apply to object print widths (typically 1.0). This is helpful when printing something at 1/2 scale and having all of the curves print 1/2 as thick.
Top
Methods
Name | Description
CreatePreviewSettings
 Create a ViewCaptureSettings based on this instance, but scaled to fit in a different sized area. Scaling is also performed on dpi. This is primarily used to for capturing images that are shown as print previews
Dispose
Actively reclaims unmanaged resources that this instance uses.
Equals(ViewCaptureSettings)
 Check if the contents of this object is the same as another object
Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetMargins
 Get distances from the edge of the paper (MediaSize) to the CropRectangle in a defined unit system
GetModelScale
 Returns the model scale factor.
GetOffset
GetViewport
 Get RhinoViewport that this view capture settings is targeting
Load
MatchViewportAspectRatio
 Adjust crop rectangle to match the aspect ratio of the original viewport that these settings reference
MaximizePrintableArea
 Minimize cropping so the full drawable area is used
Save
SetLayout
SetMarginBottom
 Set the distance from the bottom edge of the paper to the CropRectangle
SetMarginLeft
 Set the distance from the left edge of the paper to the CropRectangle
SetMarginRight
 Set the distance from the right edge of the paper to the CropRectangle
SetMargins
 Set distances from the edge of the paper (MediaSize) to the CropRectange in a defined unit system
SetMarginTop
 Set the distance from the top edge of the paper to the CropRectangle
SetModelScaleToFit
 Scales the model to fit.
SetModelScaleToValue
 Sets the model scale to a value.
SetOffset
SetViewport
SetWindowRect(Point2d, Point2d)
 Set the print area to a window selection based on two points in screen coordinates
SetWindowRect(Point3d, Point3d)
 Set the print area to a window selection based on two points in world coordinates
Top
See Also
Reference
Rhino.Display Namespace