RhinoCommon API
SweepTwoRail Class
 Utility class for generating Breps by sweeping cross section curves over two rail curves. Note, this class has been superseded by the Rhino.Geometry.Brep.CreateFromSweep static functions.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SweepTwoRail
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SweepTwoRail
Public Class SweepTwoRail
The SweepTwoRail type exposes the following members.
Constructors
Name | Description
SweepTwoRail
Initializes a new instance of the SweepTwoRail class
Top
Properties
Name | Description
AngleToleranceRadians
 Gets or sets the angle tolerance in radians.
AutoAdjust
 Set to true to have shape curves adjusted, sorted, and matched automatically. This will produce results comparable to Rhino's Sweep2 command. Set to false to not have shape curves adjusted, sorted, and matched automatically.
ClosedSweep
 If the input rails are closed, ClosedSweep determines if the swept Breps will also be closed.
MaintainHeight
 Removes the association between the height scaling from the width scaling.
SweepTolerance
 Gets or sets the sweeping tolerance.
UseLegacySweeper
 Set to true if you want to use the legacy, low-level sweeper found in earlier versions of Rhino.
Top
Methods
Name | Description
PerformSweep(Curve, Curve, Curve)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweep(Curve, Curve, IEnumerable<Curve>)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweep(Curve, Curve, Curve, Double, Double)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweep(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRebuild(Curve, Curve, Curve, Int32)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRebuild(Curve, Curve, IEnumerable<Curve>, Int32)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRebuild(Curve, Curve, Curve, Double, Double, Int32)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRebuild(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>, Int32)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRefit(Curve, Curve, Curve, Double)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRefit(Curve, Curve, IEnumerable<Curve>, Double)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRefit(Curve, Curve, Curve, Double, Double, Double)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRefit(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>, Double)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
Top
See Also
Reference
Rhino.Geometry Namespace