RhinoCommon API
ModifyType Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.ModifyType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum ModifyType
Public Enumeration ModifyType
Members
Member name | Value | Description
Modify | 0
Override | 1
NotSaved | 2
See Also
Reference
Rhino.DocObjects.Tables Namespace