RhinoCommon API
LightTable Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.LightTable"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<LightObject>
 Rhino.DocObjects.Tables.RhinoDocCommonTable<LightObject>
 Rhino.DocObjects.Tables.LightTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class LightTable : RhinoDocCommonTable<LightObject>
Public Class LightTable
	Inherits RhinoDocCommonTable(Of LightObject)
The LightTable type exposes the following members.
Properties
Name | Description
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of lights in the light table. Does not include Sun or Skylight.
 (Overrides CommonComponentTable<T>.Count.)
DefaultLight
 Gets the default light that Rhino uses when no other lights illuminate the scene.
Document
Document that owns this light table.
Item
Skylight
Sun
 Gets the Sun instance that is applied to the document.
If the RDK is loaded, an instance is always returned.
Top
Methods
Name | Description
Add(Light)
Add(Light, ObjectAttributes)
Delete(LightObject) |  (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32, Boolean)
Find
FindIndex
 Retrieves a object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds the LightObject with a given name.
Deleted lights have no name.
FindNameHash
 Finds a LightObject given its name hash.
GetEnumerator |  (Overrides CommonComponentTable<T>.GetEnumerator().)
Modify(Guid, Light)
Modify(Int32, Light)
Undelete
Restores a light that has been deleted.
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace