RhinoCommon API
CustomRenderMeshProvider2 Class
Note: This API is now obsolete.
[Missing <summary> documentation for "T:Rhino.Render.CustomRenderMeshProvider2"]
Inheritance Hierarchy
System.Object
 Rhino.Render.CustomRenderMeshProvider
 Rhino.Render.CustomRenderMeshProvider2
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute]
public abstract class CustomRenderMeshProvider2 : CustomRenderMeshProvider
<ObsoleteAttribute>
Public MustInherit Class CustomRenderMeshProvider2
	Inherits CustomRenderMeshProvider
The CustomRenderMeshProvider2 type exposes the following members.
Constructors
Name | Description
CustomRenderMeshProvider2
Initializes a new instance of the CustomRenderMeshProvider2 class
Top
Properties
Name | Description
Top
Methods
Name | Description
BoundingBox(ViewportInfo, RhinoObject, Guid, Boolean) |  (Overrides CustomRenderMeshProvider.BoundingBox(ViewportInfo, RhinoObject, Guid, Boolean).)
BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes)
BuildCustomMeshes(ViewportInfo, RenderPrimitiveList, Guid, Boolean) |  (Overrides CustomRenderMeshProvider.BuildCustomMeshes(ViewportInfo, RenderPrimitiveList, Guid, Boolean).)
BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, DisplayPipelineAttributes)
WillBuildCustomMeshes(ViewportInfo, RhinoObject, Guid, Boolean) |  (Overrides CustomRenderMeshProvider.WillBuildCustomMeshes(ViewportInfo, RhinoObject, Guid, Boolean).)
WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes)
Top
See Also
Reference
Rhino.Render Namespace