RhinoCommon API
NurbsCurve Class
 Represents a Non Uniform Rational B-Splines (NURBS) curve.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Curve
 Rhino.Geometry.NurbsCurve
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class NurbsCurve : Curve, IEpsilonComparable<NurbsCurve>
<SerializableAttribute>
Public Class NurbsCurve
	Inherits Curve
	Implements IEpsilonComparable(Of NurbsCurve)
The NurbsCurve type exposes the following members.
Constructors
Name | Description
NurbsCurve(NurbsCurve)
 Initializes a NURBS curve by copying its values from another NURBS curve.
NurbsCurve(Int32, Int32)
 Constructs a new NURBS curve with a specific degree and control point count.
NurbsCurve(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
NurbsCurve(Int32, Boolean, Int32, Int32)
 Constructs a new NURBS curve with knot and CV memory allocated.
Top
Properties
Name | Description
HasBezierSpans
 Returns true if the NURBS curve has Bezier spans (all distinct knots have multiplicity = degree)
IsRational
 Gets a value indicating whether or not the curve is rational. Rational curves have control-points with custom weights.
Knots
 Gets access to the knots (or "knot vector") of this NURBS curve.
Order
 Gets the order of the curve. Order = Degree + 1.
Points
 Gets access to the control points of this NURBS curve.
Top
Methods
Name | Description
Append
 Appends a NURBS curve to this curve.
ConvertSpanToBezier
 Converts a span of the NURBS curve into a Bezier.
Create
 Constructs a 3D NURBS curve from a list of control points.
CreateFromArc(Arc)
 Gets a rational degree 2 NURBS curve representation of the arc. Note that the parameterization of NURBS curve does not match arc's transcendental parameterization.
CreateFromArc(Arc, Int32, Int32)
 Create a uniform non-rational cubic NURBS approximation of an arc.
CreateFromCircle(Circle)
 Gets a rational degree 2 NURBS curve representation of the circle. Note that the parameterization of NURBS curve does not match circle's transcendental parameterization. Use GetRadianFromNurbFormParameter() and GetParameterFromRadian() to convert between the NURBS curve parameter and the transcendental parameter.
CreateFromCircle(Circle, Int32, Int32)
 Create a uniform non-rational cubic NURBS approximation of a circle.
CreateFromEllipse
 Gets a rational degree 2 NURBS curve representation of the ellipse.
Note that the parameterization of the NURBS curve does not match with the transcendental parameterization of the ellipsis.
CreateFromFitPoints(IEnumerable<Point3d>, Double, Boolean)
 Fits a NURBS curve to a dense, ordered set of points.
CreateFromFitPoints(IEnumerable<Point3d>, Double, Int32, Boolean, Vector3d, Vector3d)
 Fits a NURBS curve to a dense, ordered set of points.
CreateFromLine
 Gets a non-rational, degree 1 NURBS curve representation of the line.
CreateHSpline(IEnumerable<Point3d>)
 Construct an H-spline from a sequence of interpolation points
CreateHSpline(IEnumerable<Point3d>, Vector3d, Vector3d)
 Construct an H-spline from a sequence of interpolation points and optional start and end derivative information
CreateNonRationalArcBezier
 Creates a non-rational approximation of a rational arc as a single bezier segment
CreateParabolaFromFocus
 Creates a parabola from focus and end points.
CreateParabolaFromPoints
 Creates a parabola from three points.
CreateParabolaFromVertex
 Creates a parabola from vertex and end points.
CreatePlanarRailFrames
 Computes planar rail sweep frames at specified parameters.
CreateRailFrames
 Computes relatively parallel rail sweep frames at specified parameters.
CreateSpiral(Point3d, Vector3d, Point3d, Double, Double, Double, Double)
 Creates a C1 cubic NURBS approximation of a helix or spiral. For a helix, you may have radius0 == radius1. For a spiral radius0 == radius1 produces a circle. Zero and negative radii are permissible.
CreateSpiral(Curve, Double, Double, Point3d, Double, Double, Double, Double, Int32)
 Create a C2 non-rational uniform cubic NURBS approximation of a swept helix or spiral.
CreateSubDFriendly(Curve)
 Create a NURBS curve, that is suitable for calculations like lofting SubD objects, from an existing curve.
CreateSubDFriendly(Curve, Int32, Boolean)
 Create a NURBS curve, that is suitable for calculations like lofting SubD objects, from an existing curve.
CreateSubDFriendly(IEnumerable<Point3d>, Boolean, Boolean)
 Create a NURBS curve, that is suitable for calculations like lofting SubD objects, through a sequence of curves.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
GrevilleParameter
 Gets the greville (edit point) parameter that belongs to the control point at the specified index.
GrevilleParameters
 Gets all Greville parameters for this curve.
GrevillePoint
 Gets the Greville parameter that belongs to the control point at the specified index.
GrevillePoints()
 Gets all Greville points for this curve.
GrevillePoints(Boolean)
 Gets Greville points for this curve.
IncreaseDegree
 Increase the degree of this curve.
IsDuplicate
 Determines if two curves are similar.
MakeCompatible
 For expert use only. From the input curves, make an array of compatible NURBS curves.
MakePiecewiseBezier
 Clamps ends and adds knots so the NURBS curve has Bezier spans (all distinct knots have multiplicity = degree).
MakeUniform
 Changes a NURBS curve so each control point affects the curve exactly the same way. This make the knot vectors uniform without changing the control point locations. This will change the object shape slightly.
MatchToCurve
 Constructs a NURBS curve with the start and end matching the start and end of targetCurve, and Greville points on targetCurve.
Reparameterize(Double)
 Use a linear fractional transformation to re-parameterize the NURBS curve. This does not change the curve's domain.
SetEndCondition(Boolean, NurbsCurve.NurbsCurveEndConditionType, Point3d, Vector3d)
 Set end condition of a NURBS curve to point, tangent and curvature.
SetEndCondition(Boolean, NurbsCurve.NurbsCurveEndConditionType, Point3d, Vector3d, Vector3d)
 Set end condition of a NURBS curve to point, tangent and curvature.
SetGrevillePoints
 Sets all Greville edit points for this curve.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The NURBS Curves segments do not have fully multiple interior knots.
 3. Rational NURBS curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent co-linear or co-circular segments are combined.
UVNDirectionsAt
 Calculates the u, V, and N directions of a NURBS curve at a parameter similar to the method used by Rhino's MoveUVN command.
Top
See Also
Reference
Rhino.Geometry Namespace