RhinoCommon API
ICollapsibleSection2 Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.ICollapsibleSection2"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface ICollapsibleSection2
Public Interface ICollapsibleSection2
The ICollapsibleSection2 type exposes the following members.
Methods
Name | Description
EnableHeaderButton
NewHeaderButtonHandler
OnAttachedToHolder
OnAttachingToHolder
OnDetachedFromHolder
OnDetachingFromHolder
ShowHeaderButton
Top
See Also
Reference
Rhino.UI.Controls Namespace