RhinoCommon API
RenderChannels Class
 Render Channels. This corresponds to the user's settings in the Rendering panel.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.RenderChannels
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class RenderChannels : DocumentOrFreeFloatingBase,
	IDisposable
Public NotInheritable Class RenderChannels
	Inherits DocumentOrFreeFloatingBase
	Implements IDisposable
The RenderChannels type exposes the following members.
Constructors
Name | Description
RenderChannels
 Create a utility object not associated with any document.
Top
Properties
Name | Description
CustomList
Mode
Top
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Dispose
Releases all resources used by the RenderChannels
Finalize |  (Overrides FreeFloatingBase.Finalize().)
Top
Events
Name | Description
Changed
 This event is raised when a Render Channels property value is changed.
Top
See Also
Reference
Rhino.Render Namespace