RhinoCommon API
RhinoAccountsCannotListenException Class
 Exception thrown when there is no port available on the machine for Rhino to listen for Rhino Accounts' response.
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.RhinoAccounts.RhinoAccountsException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsCannotListenException
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class RhinoAccountsCannotListenException : RhinoAccountsException
<SerializableAttribute>
Public Class RhinoAccountsCannotListenException
	Inherits RhinoAccountsException
The RhinoAccountsCannotListenException type exposes the following members.
Constructors
Name | Description
RhinoAccountsCannotListenException(Exception)
 Generates a new instance of the exception.
RhinoAccountsCannotListenException(String, Exception)
 Generates a new instance of the exception.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace