RhinoCommon API
IRhRdkThumbnail Interface
Note: This API is now obsolete.
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("IRhRdkThumbnail is obsolete", false)]
public interface IRhRdkThumbnail
<ObsoleteAttribute("IRhRdkThumbnail is obsolete", false)>
Public Interface IRhRdkThumbnail
The IRhRdkThumbnail type exposes the following members.
Methods
Name | Description
Dib
GetDib
GetDisplayRect
Id
IsHot
IsSelected
Label
Top
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace