RhinoCommon API
WidgetColor Enumeration
 Contains enumerated constant values to represent logical colors associated with elements of the user interface.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum WidgetColor
Public Enumeration WidgetColor
Members
Member name | Value | Description
UAxisColor | 0 | The color of the mapping widget u-axis.
VAxisColor | 1 | The color of the mapping widget v-axis..
WAxisColor | 2 | The color of the mapping widget w-axis.
See Also
Reference
Rhino.ApplicationSettings Namespace