RhinoCommon API
FileIgsWriteOptions.SurfacesMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileIgsWriteOptions.SurfacesMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum SurfacesMode
Public Enumeration SurfacesMode
Members
Member name | Value | Description
Srf143 | 143
Srf144 | 144
Srf128 | 128
See Also
Reference
Rhino.FileIO Namespace