RhinoCommon API
Light.Attenuation Enumeration
 Types of light attenuation available.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum Attenuation
Public Enumeration Attenuation
Members
Member name | Value | Description
Constant | 0 |  Constant light attenuation, meaning no light energy fall-off.
Linear | 1 |  Linear light attenuation, meaning linear light energy fall-off.
InverseSquared | 2 |  Inverse squared light attenuation, meaning light energy falls off in spherical order.
See Also
Reference
Rhino.Geometry Namespace