RhinoCommon API
Environment.BackgroundProjections Enumeration
 The available background projections.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum BackgroundProjections
Public Enumeration BackgroundProjections
Members
Member name | Value | Description
Planar | 0 | Planar.
Spherical | 1 | Spherical.
Emap | 2 | Environment map.
Box | 3 | Box.
Automatic | 4 | Automatic.
LightProbe | 5 | Light probe.
CubeMap | 6 | Cube map.
VerticalCrossCubeMap | 7 | Vertical cross cube map.
HorizontalCrossCubeMap | 8 | Horizontal cross cube map.
Hemispherical | 9 | Hemispherical.
See Also
Reference
Rhino.DocObjects Namespace