RhinoCommon API
PreserveIsoCurveMethod Enumeration
 The way the surface iso-lines align with the target
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.21
Syntax
public enum PreserveIsoCurveMethod
Public Enumeration PreserveIsoCurveMethod
Members
Member name | Value | Description
Automatic | 0 |  If the trim is on an iso direction use MatchTarget, else use Perpendicular
MatchTarget | 1 |  The surface tangent will be parallel to the surface derivative in U- or V-direction
Perpendicular | 2 |  The surface tangent will be perpendicular to the target edge
Preserve | 3 |  The surface tangent will not change
See Also
Reference
Rhino.Geometry Namespace