RhinoCommon API
FileStp Class
 Support for writing STEP (STP) file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileStp
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileStp
Public NotInheritable Class FileStp
The FileStp type exposes the following members.
Methods
Name | Description
Read
Read a Stp file into a RhinoDoc
Write
Write a STP file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace