RhinoCommon API
RealtimeDisplayMode.DrawMiddlegroundEventArgs Class
[Missing <summary> documentation for "T:Rhino.Render.RealtimeDisplayMode.DrawMiddlegroundEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RealtimeDisplayMode.DrawMiddlegroundEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DrawMiddlegroundEventArgs : EventArgs
Public Class DrawMiddlegroundEventArgs
	Inherits EventArgs
The RealtimeDisplayMode.DrawMiddlegroundEventArgs type exposes the following members.
Constructors
Name | Description
RealtimeDisplayMode.DrawMiddlegroundEventArgs
Initializes a new instance of the RealtimeDisplayMode.DrawMiddlegroundEventArgs class
Top
Properties
Name | Description
Pipeline
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace