RhinoCommon API
ChooseOneObjectSettings Class
 Contains static methods and properties to modify "choose one object" settings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.ChooseOneObjectSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static class ChooseOneObjectSettings
Public NotInheritable Class ChooseOneObjectSettings
The ChooseOneObjectSettings type exposes the following members.
Properties
Name | Description
AutomaticResize
AutomaticResize
DynamicHighlight
DynamicHighlight
FollowCursor
FollowCursor
HighlightColor
HighlightColor
MaxAutoResizeItems
MaxAutoResizeItems
ShowAllOption
ShowAllOption
ShowObjectColor
ShowObjectColor
ShowObjectLayer
ShowObjectLayer
ShowObjectName
ShowObjectName
ShowObjectType
ShowObjectType
ShowObjectTypeDetails
ShowObjectTypeDetails
ShowTitlebarAndBorder
ShowTitlebarAndBorder
UseCustomColor
UseCustomColor
XOffset
XOffset
YOffset
YOffset
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
RestoreDefaults
 Commits the default settings as the current settings.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace