RhinoCommon API
LicenseData Class
Zoo plug-in license data.
Inheritance Hierarchy
System.Object
 Rhino.PlugIns.LicenseData
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class LicenseData
Public Class LicenseData
The LicenseData type exposes the following members.
Constructors
Name | Description
LicenseData()
 Public constructor.
LicenseData(String, String, String)
 Public constructor
LicenseData(String, String, String, LicenseBuildType)
 Public constructor
LicenseData(String, String, String, LicenseBuildType, Int32)
 Public constructor
LicenseData(String, String, String, LicenseBuildType, Int32, Nullable<DateTime>)
 Public constructor
LicenseData(String, String, String, LicenseBuildType, Int32, Nullable<DateTime>, Icon)
 Public constructor
LicenseData(String, String, String, LicenseBuildType, Int32, Nullable<DateTime>, Icon, Boolean, Boolean)
 Public constructor
Top
Properties
Name | Description
BuildType
 The build of the product that this license work with. When your product requests a license from the Zoo, it will specify one of these build types.
DateToExpire
 The date and time the license is set to expire. This is provided by the plug in that validated the license. This time value should be in Coordinated Universal Time (UTC).
ErrorMessage
 Error message set by calls to callback functions
IsUpgradeFromPreviousVersion
 Set to true if this license requires a previous version license to be entered. Caller must also pass VerifyPreviousVersionLicenseDelegate to GetLicense/AskUserForLicense.
LicenseCount
 The number of instances supported by this license. This is provided by the plug in that validated the license.
LicenseExpires
LicenseTitle
 The title of the license. This is provided by the plug-in that validated the license. (e.g. "Rhinoceros 6.0 Commercial")
ProductIcon
 The product's icon. This will displayed in the "license" page in the Options dialog. Note, this can be null. Note, LicenseData creates it's own copy of the icon.
ProductLicense
 The actual product license. This is provided by the plug-in that validated the license.
RequiresOnlineValidation
 Set to true if this license requires online validation. Caller must also pass VerifyOnlineValidationCodeDelegate to GetLicense/AskUserForLicense
SerialNumber
 The "for display only" product license. This is provided by the plug-in that validated the license.
Top
Methods
Name | Description
Dispose
Releases all resources used by the LicenseData
IsNotValid
 Indicates whether a LicenseData object is either null or invalid.
IsValid()
 Public validator.
IsValid(Boolean)
IsValid(LicenseData)
 Indicates whether a LicenseData object is not null and valid.
Top
See Also
Reference
Rhino.PlugIns Namespace