RhinoCommon API
Fonts.Style Enumeration
 Style for UI font.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum Style
Public Enumeration Style
Members
Member name | Value | Description
Regular | 0 | Normal
Bold | 1 | Bold
Italic | 2 | Italic
Underline | 4 | Underline
Strikeout | 8 | Strikeout
See Also
Reference
Rhino.UI Namespace