RhinoCommon API
SubDFriendlyKnotType Enumeration
 ON_SubD::SubDFriendlyKnotType identifies the types of subd friendly NURBS knot vectors. SubD friendly NURBS curves and surfacaes are always cubic and nonrational. Any time there is a multiple knot, the 2nd derivative is zero at the corresponding parameter. SubD friendly NURBS curves are either periodic or have zero 2nd derivative at the ends.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SubDFriendlyKnotType
Public Enumeration SubDFriendlyKnotType
Members
Member name | Value | Description
Unset | 0 |  Not a valid type. Used to indicate the type has not been set and to encourage developers to explicitly specify a type.
UnclampedUniform | 1 |  NURBS knot vector is an unclamped uniform cubic knot vector. Every knot interval has the same length. Every knot has multiplicity 1.
ClampedUniform | 2 |  NURBS knot vector is a clamped uniform cubic knot vector. Every interior knot interval has the same length. End knots have multiplicity 3 and interior knots have multiplicity 1.
ClampedPiecewiseUniform | 4 |  NURBS knot vector is a clamped piecewise uniform cubic knot vector. All nonzero knot intervals have the same length. End knots have multiplicity 3 and interior knots have multiplicity 1 or 3. Interior knots with multiplicity 3 correspond to interior SubD creases.
Unfriendly | 127 |  NURBS knot vector is not subd friendly.
See Also
Reference
Rhino.Geometry Namespace