RhinoCommon API
RenderPlugIn.RenderFeature Enumeration
[Missing <summary> documentation for "T:Rhino.PlugIns.RenderPlugIn.RenderFeature"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum RenderFeature
Public Enumeration RenderFeature
Members
Member name | Value | Description
Materials | 0
Environments | 1
Textures | 2
PostEffects | 3
Sun | 4
CustomRenderMeshes | 5
Decals | 6
GroundPlane | 7
SkyLight | 8
CustomDecalProperties | 9
LinearWorkflow | 10
Exposure | 11
ShadowOnlyGroundPlane | 12
RenderBlowup | 13
RenderWindow | 14
RenderInWindow | 15
FocalBlur | 17
RenderArctic | 18
RenderViewSource | 19
CustomSkylightEnvironment | 20
CustomReflectionEnvironment | 21
RenderChannels | 22
LightMaterials | 23
See Also
Reference
Rhino.PlugIns Namespace