RhinoCommon API
DisplayPipelineAttributes.ViewDisplayAttributes Class
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes"]
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class ViewDisplayAttributes
Public NotInheritable Class ViewDisplayAttributes
The DisplayPipelineAttributes.ViewDisplayAttributes type exposes the following members.
Properties
Name | Description
BlendGrid
DrawGrid
DrawGridAxes
DrawTransparentGridPlane
DrawWorldAxes
DrawZAxis
GridBoundaryThickness
 The thickness of the grid boundary.
GridCornerRadius
 The radius used to round the corners of the grid.
GridFade
 The amount the grid fades out towards its edges, from 0.0 (no fade) to 1.0 (full fade).
HorizontalViewportScale
ShowGridOnTop
UseDocumentGrid
VerticalViewportScale
WorldAxisColorX
WorldAxisColorY
WorldAxisColorZ
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace