RhinoCommon API
RadialDimension Class
 Represents a dimension of a circular entity that can be measured with radius or diameter.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Dimension
 Rhino.Geometry.RadialDimension
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class RadialDimension : Dimension
<SerializableAttribute>
Public Class RadialDimension
	Inherits Dimension
The RadialDimension type exposes the following members.
Constructors
Name | Description
RadialDimension()
 Constructs a radial dimension.
RadialDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
RadialDimension(AnnotationType, Plane, Point3d, Point3d, Point3d)
 Constructs a radial dimension from parameters.
Top
Properties
Name | Description
AnnotationType
CenterPoint
DimlinePoint
IsDiameterDimension
 Gets a value indicating whether the value refers to the diameter, rather than the radius.
KneePoint
LeaderArrowBlockId
LeaderArrowSize
LeaderArrowType
LeaderCurveStyle
LeaderTextHorizontalAlignment
 Gets or sets the horizontal alignment of the radial dimension's text
RadiusPoint
TextAngleType |  (Overrides Dimension.TextAngleType.)
TextLocation |  (Overrides Dimension.TextLocation.)
TextOrientation |  (Overrides Dimension.TextOrientation.)
Top
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetDistanceDisplayText(LengthUnit, DimensionStyle)
GetDistanceDisplayText(UnitSystem, DimensionStyle) |  Obsolete.
GetTextRectangle
Top
See Also
Reference
Rhino.Geometry Namespace