RhinoCommon API
Utilities.ContentNewExistingResults Enumeration
[Missing <summary> documentation for "T:Rhino.Render.Utilities.ContentNewExistingResults"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum ContentNewExistingResults
Public Enumeration ContentNewExistingResults
Members
Member name | Value | Description
None | 0 |  No choice (user cancelled).
New | 1 |  User chose from 'New' tab. contents accepts the chosen type id(s).
Copy | 2 |  User chose from 'Existing' tab with 'copy' radio button checked. contents accepts the chosen instance id(s).
Instance | 3 |  User chose from 'Existing' tab with 'instance' radio button checked. contents accepts the chosen instance id(s).
Reference | 4 |  User chose from 'Existing' tab with no radio buttons. contents accepts the chosen instance id(s).
See Also
Reference
Rhino.Render Namespace