RhinoCommon API
ViewCaptureWriter.FillProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.FillProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void FillProc(
	int topl,
	int bottoml,
	int topr,
	int bottomr
)
Public Delegate Sub FillProc (
	topl As Integer,
	bottoml As Integer,
	topr As Integer,
	bottomr As Integer
)
Parameters
topl
Type: System.Int32
bottoml
Type: System.Int32
topr
Type: System.Int32
bottomr
Type: System.Int32
See Also
Reference
Rhino.Runtime Namespace