RhinoCommon API
MeshCurvatureStats Class
 Analysis mesh curvature statistics.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.MeshCurvatureStats
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public class MeshCurvatureStats : IDisposable
Public Class MeshCurvatureStats
	Implements IDisposable
The MeshCurvatureStats type exposes the following members.
Constructors
Name | Description
MeshCurvatureStats
 Default constructor.
Top
Properties
Name | Description
Average
 Get the average of "finite" values.
AverageDeviation
 Get the average deviation of "finite" values.
Count
 Gets the number of "finite" values.
CurvatureStyle
 Gets the curvature style of the curvature statistics.
InfiniteCount
 Gets the number of "infinite" values.
Infinity
 Curvature values greater than or equal to this are considered infinite and not used to compute the average of "finite" values or the average deviation of "finite" values.
Mode
 Get the mode of "finite" values.
Range
 Gets the minumum and maximum curvature based on the value of CurvatureStyle: If CurvatureStyle.GaussianCurvature, the min Gaussian curvature and the max Gaussian curvature. If CurvatureStyle.MeanCurvature, the min unsigned mean curvature and the max unsigned mean curvature. If CurvatureStyle.MinimumCurvature, the min maximum unsigned radius of curvature and the max maximum unsigned radius of curvature. If CurvatureStyle.MaximumCurvature, the min minimum unsigned radius of curvature and the the max minimum unsigned radius of curvature.
Top
Methods
Name | Description
CreateFromMesh
 Gets curvature statistics from analysis mesh.
CreateFromMeshes
 Gets curvature statistics from analysis meshes, and calculate total statistics.
Dispose
 Actively releases the unmanaged pointer.
Finalize
 Passively releases the unmanaged pointer.
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Geometry Namespace