RhinoCommon API
RhinoPageView Class
 A window that contains a single layout 'page'
Inheritance Hierarchy
System.Object
 Rhino.Display.RhinoView
 Rhino.Display.RhinoPageView
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RhinoPageView : RhinoView
Public Class RhinoPageView
	Inherits RhinoView
The RhinoPageView type exposes the following members.
Properties
Name | Description
ActiveDetail
 Returns the active detail object. If no detail is active, or if the page is active, then null is returned.
ActiveDetailId
 Returns the id of the active detail. If no detail is active, or if the page is active, then Guid.Empty is returned.
ActiveViewport
 Gets the active viewport. The ActiveViewport is the same as the MainViewport for standard RhinoViews. In a RhinoPageView, the active viewport may be the RhinoViewport of a child detail object. Most of the time, you will use ActiveViewport unless you explicitly need to work with the main viewport.
 (Overrides RhinoView.ActiveViewport.)
Description
 Gets and sets a brief description of the page view.
PageHeight
 Height of the page in the document's PageUnitSystem
PageIsActive
 Returns true if the page is active, rather than any detail view. This occurs when the MainViewport.Id == ActiveViewportID.
PageName
Same as the MainViewport.Name.
PageNumber
 Gets or sets the runtime page number and updates the page number for all of the other pages. The first page has a value of 0.
PageViewGroupCount
 Gets the number of page view groups this page view belongs to.
PageWidth
 Width of the page in the document's PageUnitSystem
PaperName
 Returns the name of the layout's media, or paper (e.g. Letter, Legal, A1, etc.), used to determine the page width and page height.
PrinterName
 Gets and sets the name of the layout's destination printer.
Top
Methods
Name | Description
AddDetailView
 Creates a detail view object that is displayed on this page and adds it to the document.
AddToPageViewGroup
 Add this page view to a page view group.
Duplicate
Copies a page view.
GetDetailViews
 Gets a list of the detail view objects associated with this layout.
GetPageViewGroupList
 Gets an array of page view group indices this page view belongs to.
GetPreviewImage
 Creates a preview image of the page.
IsInPageViewGroup
 Determines if this page view belongs in a page view group.
PageViewGroupSortIndex
 Gets this page view's sort index within a page view group. The sort index determines the order of the page view among the other members of the group, independent of the document page (view-table) order.
RemoveFromAllageViewGroups
 Removes this page view to all page view groups.
RemoveFromPageViewGroup
 Removes this page view to a page view group.
SetActiveDetail(Guid)
 Sets the active detail.
SetActiveDetail(String, Boolean)
 Sets the active detail.
SetPageAsActive
 Deactivates the active details and sets the page view as active.
SetPageViewGroupSortIndex
 Sets this page view's sort index (position) within a page view group, repositioning it among the group's members and renumbering the rest so the group stays contiguously ordered. A sort index at or beyond the member count moves the page view to the end. If the page view is not yet in the group, it is added.
Top
Events
Name | Description
PageViewPropertiesChange
PageViewSpaceChange
Top
See Also
Reference
Rhino.Display Namespace