RhinoCommon API
FileX_TWriteOptions.X_T_Types Enumeration
 X_T export types. Flavors of x_t file that are suitable for a particular application or version of parsolid x_t.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum X_T_Types
Public Enumeration X_T_Types
Members
Member name | Value | Description
Default | 0
Edgecam | 1
Mastercam | 2
SolidEdge | 3
SolidWorks | 4
See Also
Reference
Rhino.FileIO Namespace