RhinoCommon API
InstanceDefinitionGeometry Class
 Represents a block definition in a File3dm. This is the same as Rhino.DocObjects.InstanceDefinition, but not associated with a RhinoDoc.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.Geometry.InstanceDefinitionGeometry
 Rhino.DocObjects.InstanceDefinition
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class InstanceDefinitionGeometry : ModelComponent
Public Class InstanceDefinitionGeometry
	Inherits ModelComponent
The InstanceDefinitionGeometry type exposes the following members.
Constructors
Name | Description
InstanceDefinitionGeometry
 Initializes a new block definition.
Top
Properties
Name | Description
ComponentType
 Returns InstanceDefinition.
 (Overrides ModelComponent.ComponentType.)
Description
 Gets or sets the description of the definition.
IsLinkedType
 Returns true if this instance definition is linked to an external source archive, that is, if its UpdateType is Linked or LinkedAndEmbedded.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
LayerStyle
 Specifies how model components (layers, materials, dimension styles, etc.) from linked instance definition files appear in the active model.
SkipNestedLinkedDefinitions
 This property applies when an instance definition is linked. If true, when reading the file that defines the content of the linked instance definition, skip any linked instance definitions found in that file. If false, when reading the file that defines the content of the linked instance definition, recursively load linked instance definitions found in that file.
SourceArchive
 Gets the full file path for linked instance definitions.
SourceArchiveRelativePath
 Gets the source archive path for linked instance definitions relative to the file that contains this definition. Empty if the definition is not linked or no relative path is stored.
UnitSystem
 Gets the unit system of the instance definition. If the instance definition was imported from another 3dm file, the unit system may differ from that of the document.
UpdateType
 Gets the relationship between this instance definition's geometry and the source archive that contains the original definition.
Url
 Gets or sets the URL or hyperlink of the definition.
UrlDescription
 Gets or sets the description of the URL or hyperlink of the definition.
UserStringCount
 Gets the amount of user strings.
Top
Methods
Name | Description
DeleteAllUserStrings
 Deletes all user strings attached to this geometry.
DeleteUserString
 Deletes the user string with the specified key from this geometry.
GetObjectIds
 Returns the unique identifiers of all objects that are part of this instance definition's geometry table.
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
SetUserString
 Attach a user string (key,value combination) to this geometry.
Top
See Also
Reference
Rhino.Geometry Namespace