RhinoCommon API
Command Class
 Defines a base class for all commands. This class is abstract.
Inheritance Hierarchy
System.Object
 Rhino.Commands.Command
 Rhino.Commands.SelCommand
 Rhino.Commands.TransformCommand
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class Command
Public MustInherit Class Command
The Command type exposes the following members.
Constructors
Name | Description
Command
 Default protected constructor. It only allows instantiation through sub-classing.
Top
Properties
Name | Description
CommandContextHelpUrl
 Gets the URL of the command contextual help. This is usually a location of a local CHM file.
The default implementation return an empty string.
EnglishName
 Gets the name of the command. This method is abstract.
HistoryReplayOnObjectAttributeChange
 By default, object attribute changes do not trigger history replay. Set this property to true, typically in the command's constructor, if you want objects created with this command to trigger history replay when their attributes change.
Id
 Gets the unique ID of this command. It is best to use a Guid attribute for each custom derived command class since this will keep the id consistent between sessions of Rhino GuidAttribute
LastCommandId
 Gets the ID of the last commands.
LastCommandResult
 Gets the result code of the last command.
LocalName
 Gets the local name of the command.
PlugIn
 Gets the plug-in where this commands is placed.
Settings
 Gets the settings of the command.
Top
Methods
Name | Description
DisplayHelp
 Displays help for a command.
GetCommandContextHelpUrl
 Returns a command's context help url.
GetCommandNames
 Gets list of command names in Rhino. This list does not include Test, Alpha, or System commands.
GetCommandStack
 Determines if Rhino is currently running a command. Because Rhino allow for transparent commands (commands that can be run from inside of other commands), this method returns the total ids of active commands.
GetCommandStyle
 Returns a command's style flags.
GetMostRecentCommands
 Gets an array of most recent command descriptions.
InCommand
 Determines if Rhino is currently running a command.
InScriptRunnerCommand
 This is a low level tool to determine if Rhino is currently running a script running command like "ReadCommandFile" or the RhinoScript plug-in's "RunScript".
IsCommand
 Determines is a string is a command.
IsValidCommandName
 Determines if a string is a valid command name.
LookupCommandId
 Returns the ID of a command.
LookupCommandName
 Returns the command name given a command ID.
OnHelp
 Is called when the user needs assistance with this command.
ReplayHistory
 Repeats an operation of a command.
In order to make this function work, you will likely need to grab the Result property that gives the list of input objects. Then, you will be able to replace these inputs by using one of the UpdateToX() methods of the ReplayHistoryResult.
You should NOT use any document AddX() or ReplaceX() functions, as they will break history.
RunCommand
 Executes the command.
RunProxyCommand
 Execute some code as if it were running in a command
Top
Events
Name | Description
BeginCommand
 Called just before command.RunCommand().
EndCommand
 Called immediately after command.RunCommand().
UndoRedo
 Used to monitor Rhino's built in undo/redo support.
Top
See Also
Reference
Rhino.Commands Namespace