RhinoCommon API
ToolbarFileCollection Class
 Represents a collection of Rhino toolbars, or .RUI, files.
Inheritance Hierarchy
System.Object
 Rhino.UI.ToolbarFileCollection
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public sealed class ToolbarFileCollection : IEnumerable<ToolbarFile>,
	IEnumerable
Public NotInheritable Class ToolbarFileCollection
	Implements IEnumerable(Of ToolbarFile), IEnumerable
The ToolbarFileCollection type exposes the following members.
Properties
Name | Description
Count
 Get tne number of open toolbar files.
Item
 Gets an open toolbar file by index.
MruSidebarIsVisible
 Returns true if the most-recently-used sizebar is visible.
SidebarIsVisible
 Returns true if the sizebar is visible.
Top
Methods
Name | Description
FindByName
 Gets an open toolbar file by name, or alias.
FindByPath
 Gets an open toolbar by full path.
GetEnumerator
 Gets a toolbar file enumerator.
Open
 Opens a toolbar file.
Top
See Also
Reference
Rhino.UI Namespace