RhinoCommon API
DisplayPoint Class
 A 3d point with attributes used by the display pipeline
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayPoint
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DisplayPoint
Public Class DisplayPoint
The DisplayPoint type exposes the following members.
Constructors
Name | Description
DisplayPoint
Initializes a new instance of the DisplayPoint class
Top
Properties
Name | Description
Location
Top
Methods
Name | Description
WithAttributes
Top
See Also
Reference
Rhino.Display Namespace