RhinoCommon API
RhinoFileWatcherChangeReason Enumeration
 Passed to IRhinoFileEventWatcher::Changed when a change event is raised.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RhinoFileWatcherChangeReason
Public Enumeration RhinoFileWatcherChangeReason
Members
Member name | Value | Description
Created | 1 |  The creation of a file or folder.
Deleted | 2 |  The deletion of a file or folder.
Changed | 4 |  The change of a file or folder. The types of changes include: changes to size, attributes, security settings, last write, and last access time.
Renamed | 5 |  The renaming of a file or folder.
See Also
Reference
Rhino Namespace