RhinoCommon API
Font.FontStretch Enumeration
 Horizontal expansion or contraction of font
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum FontStretch
Public Enumeration FontStretch
Members
Member name | Value | Description
Unset | 0 |  Not set.
Ultracondensed | 1
Extracondensed | 2
Condensed | 3
Semicondensed | 4
Medium | 5 |  Default font stretch.
Semiexpanded | 6
Expanded | 7
Extraexpanded | 8
Ultraexpanded | 9
See Also
Reference
Rhino.DocObjects Namespace