RhinoCommon API
DisplayPipelineAttributes.SubDReflectionPlaneColorUse Enumeration
 SubD replection plane color use
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public enum SubDReflectionPlaneColorUse
Public Enumeration SubDReflectionPlaneColorUse
Members
Member name | Value | Description
ObjectColor | 0
CustomColor | 1
SingleColorForAll | 2
See Also
Reference
Rhino.Display Namespace