RhinoCommon API
IUserInterfaceSection Interface
Note: This API is now obsolete.
 Implement this interface in your user control to get UserInterfaceSection event notification.
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Obsolete")]
public interface IUserInterfaceSection
<ObsoleteAttribute("Obsolete")>
Public Interface IUserInterfaceSection
The IUserInterfaceSection type exposes the following members.
Properties
Name | Description
Hidden
 Return true if the section should be hidden, else return false.
Top
Methods
Name | Description
OnUserInterfaceSectionExpanding
 The UserInterfaceSection object that called this interface method.
UserInterfaceDisplayData
 Called by UserInterfaceSection when the selected content changes or a content field property value changes.
Top
See Also
Reference
Rhino.Render.UI Namespace