RhinoCommon API
SubDEdgeType Enumeration
 ON_SubDEdgeType describes a subdivision edge. ON_SubDEdgeType is typically used when generating text descriptions or filtering edges during selection processes. Do not confuse ON_SubDEdgeType and ON_SubDEdgeTag. The unique types are single bits and suitable for use in bitwise logic.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SubDEdgeType
Public Enumeration SubDEdgeType
Members
Member name | Value | Description
Unset | 0 |  Type is unset or the edge is not valid.
Wire | 1 |  The edge has zero faces and the tag is ON_SubDEdgeTag::Crease.
Boundary | 2 |  The edge has one face and the tag is ON_SubDEdgeTag::Crease.
InteriorSmooth | 4 |  The edge has two faces, the tag is ON_SubDEdgeTag::Smooth or ON_SubDEdgeTag::SmoothX, and the edge sharpness is zero. Note that ON_SubEdge::IsSmoothNotSharp() returns true if and only if ON_SubEdge::EdgeType() is InteriorSmooth.
InteriorSharp | 8 |  The edge has two faces, the tag is ON_SubDEdgeTag::Smooth or ON_SubDEdgeTag::SmoothX, and the edge sharpness is nonzero. Note that ON_SubEdge::IsSharp() returns true if and only if ON_SubEdge::EdgeType() is InteriorSharp.
InteriorCrease | 16 |  The edge has two faces and the tag is ON_SubDEdgeTag::Crease.
Nonmanifold | 32 |  The edge has three or more faces and the tag is ON_SubDEdgeTag::Crease.
Invalid | 64 |  The edge has an invalid combination of face count, tag, and sharpness properties.
InteriorMask | 28 |  A mask for all interior edge types. Interior edges have 2 faces.
ValidTypesMask | 63 |  A mask for all valid edge types.
See Also
Reference
Rhino.Geometry Namespace