RhinoCommon API
FileAiReadOptions.Units Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileAiReadOptions.Units"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum Units
Public Enumeration Units
Members
Member name | Value | Description
Inches | 0 | inches
Centimeters | 1 | centimeters
Millimeters | 2 | millimeters
Points | 3 | points
See Also
Reference
Rhino.FileIO Namespace