RhinoCommon API
FileDwgReadOptions Class
 Options for reading a DWG file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileDwgReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileDwgReadOptions
Public Class FileDwgReadOptions
The FileDwgReadOptions type exposes the following members.
Constructors
Name | Description
FileDwgReadOptions
Initializes a new instance of the FileDwgReadOptions class
Top
Properties
Name | Description
ConvertRegionsToCurves
ConvertWidePolylinesToSurfaces
IgnoreThickness
ImportUnreferencedBlocks
ImportUnreferencedLayers
ImportUnreferencedLinetypes
LayoutUnits
MakeExtrusions
MeshPrecision
ModelUnits
NestLayers
SetLayerMaterialToLayerColor
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace