RhinoCommon API
File3dmDisplacement Class
 Represents the displacement attached to file3dm object attributes.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmDisplacement
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmDisplacement
Public Class File3dmDisplacement
The File3dmDisplacement type exposes the following members.
Properties
Name | Description
BlackPoint
 Specifies the amount of displacement for the black color in the texture.
Fairing
 Specifies the number of steps for the fairing process. Fairing straightens rough feature edges.
FairingOn
 Specifies whether or not to perform a fairing step. Fairing straightens rough feature edges.
FinalMaxFaces
 Specifies how many faces the reduction post process should target.
FinalMaxFacesOn
 Specifies whether to perform a mesh reduction as a post process to simplify the result of displacement.
InitialQuality
 Specifies how densely the object is initially subdivided. The lower the value, the higher the resolution of the displaced mesh.
MappingChannel
 Specifies which texture mapping channel is used for the displacement texture.
MeshMemoryLimit
 Specifies in megabytes how much memory can be allocated for use by the displacement mesh.
On
 Specifies whether the displacement feature is enabled or not.
PostWeldAngle
 Specifies the maximum angle between face normals of adjacent faces that will get welded together.
RefineSensitivity
 Specifies how sensitive the divider for contrasts is on the displacement texture. Specify 1 to split all mesh edges on each refine step. Specify 0.99 to make even slight contrasts on the displacement texture cause edges to be split. Specifying 0.01 only splits edges where heavy contrast exists.
RefineSteps
 Specifies the number of refinement passes
SweepResolutionFormula
 Specifies which formula is used to calculate sweep resolution from initial quality.
TextureId
 Specifies which texture is used for computing the displacement amount.
WhitePoint
 Specifies the amount of displacement for the white color in the texture.
Top
Methods
Name | Description
AddSubItem
 Adds a new sub-item to the displacement. face_index is the index of the face on the polysurface/SubD.on is the override for File3dmDisplacement.On.texture is the override for File3dmDisplacement.TextureId.mapping_channel is the override for File3dmDisplacement.MappingChannel.black_point is the override for File3dmDisplacement.BlackPoint.white_point is the override for File3dmDisplacement.WhitePoint.
DeleteAllSubItems
 Deletes all the sub-items from the displacement.
DeleteSubItem
 Deletes a sub-item by its face index. face_index is the index of the face on the polysurface/SubD.
GetSubItemFaceIndexes
 Gets all the sub-items on the displacement. Sub-items can exist to override the top-level parameters for polysurface/SubD faces. Sub-items are identified by the face index that they apply to. An array of the face indexes of each sub-item on the displacement.
SetSubItemBlackPoint
 Sets the override for displacement 'black-point'. face_index is the index of the face on the polysurface/SubD.
SetSubItemMappingChannel
 Sets the override for displacement 'mapping channel'. face_index is the index of the face on the polysurface/SubD.
SetSubItemOn
 Sets the override for displacement 'on'. face_index is the index of the face on the polysurface/SubD.
SetSubItemTexture
 Sets the override for displacement 'texture'. face_index is the index of the face on the polysurface/SubD.
SetSubItemWhitePoint
 Sets the override for displacement 'white-point'. face_index is the index of the face on the polysurface/SubD.
SubItemBlackPoint
 Gets the override for displacement 'black-point'. face_index is the index of the face on the polysurface/SubD.
SubItemMappingChannel
 Gets the override for displacement 'mapping channel'. face_index is the index of the face on the polysurface/SubD.
SubItemOn
 Gets the override for displacement 'on'. face_index is the index of the face on the polysurface/SubD.
SubItemTexture
 Gets the override for displacement 'texture'. face_index is the index of the face on the polysurface/SubD.
SubItemWhitePoint
 Gets the override for displacement 'white-point'. face_index is the index of the face on the polysurface/SubD.
Top
See Also
Reference
Rhino.FileIO Namespace