RhinoCommon API
FileVrml Class
 Support for writing wrl file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileVrml
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileVrml
Public NotInheritable Class FileVrml
The FileVrml type exposes the following members.
Methods
Name | Description
Write
Write a wrl file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace