RhinoCommon API
ViewTypeFilter Enumeration
 Filter for view types to list
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ViewTypeFilter
Public Enumeration ViewTypeFilter
Members
Member name | Value | Description
None | 0 |  No views
Model | 1 |  Standard Rhino model views
Page | 2 |  Page views
ModelStyleViews | 268435453 |  All view styles except Page.
UVEditor | 4 |  UV Editor views
BlockEditor | 8 |  Block Editor views
All | 268435455 |  All views
See Also
Reference
Rhino.Display Namespace