RhinoCommon API
RenderContentStyles Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderContentStyles"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
[FlagsAttribute]
public enum RenderContentStyles
<FlagsAttribute>
Public Enumeration RenderContentStyles
Members
Member name | Value | Description
None | 0 |  No defined styles
TextureSummary | 1 |  Texture UI includes an auto texture summary section. See AddAutoParameters().
QuickPreview | 2 |  Editor displays an instant preview before preview cycle begins.
PreviewCache | 4 |  Content's preview imagery can be stored in the preview cache.
ProgressivePreview | 8 |  Content's preview imagery can be rendered progressively.
LocalTextureMapping | 16 |  Texture UI includes an auto local mapping section for textures. See AddAutoParameters()
GraphDisplay | 32 |  Texture UI includes a graph section.
NameTypeSection | 2048 |  Render content UI includes a 'Name' and 'Type' section.
SharedUI | 64 |  Obsolete.  OBSOLETE: The UI is always shared between render contents of the same type id.
Adjustment | 128 |  Texture UI includes an adjustment section.
Fields | 256 |  Render content uses fields to facilitate data storage and undo support. See Fields()
ModalEditing | 512 |  Render content supports editing in a modal editor. OBSOLETE: All contents support modal editing.
DynamicFields | 1024 |  The render content's fields are dynamic. OBSOLETE: Dynamic fields can co-exist with static fields.
See Also
Reference
Rhino.Render Namespace