RhinoCommon API
SquishFlatteningAlgorithm Enumeration
 Represents the type of flattening to use
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SquishFlatteningAlgorithm
Public Enumeration SquishFlatteningAlgorithm
Members
Member name | Value | Description
Geometric | 0 |  geometric flattening algorithm: (scale independent)the "spring" constant is proportional to 1/L^2 and the result is independent of scale.
PhysicalStress | 1 |  physical stress flattening algorithm: (scale dependent) the "spring" constant is proportional to 1/L.
See Also
Reference
Rhino.Geometry Namespace