RhinoCommon API
FileDwgWriteOptions.UseColorType Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileDwgWriteOptions.UseColorType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum UseColorType
Public Enumeration UseColorType
Members
Member name | Value | Description
USEDISPLAY | 0
USEPRINT | 1
See Also
Reference
Rhino.FileIO Namespace