RhinoCommon API
HostUtils.LogMessageType Enumeration
 Represents the type of message that is being sent to the OnSendLogMessageToCloud event
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.4
Syntax
public enum LogMessageType
Public Enumeration LogMessageType
Members
Member name | Value | Description
unknown | 0 |  Unknown message type
information | 1 |  Message is informational only
warning | 2 |  Message is a warning
error | 3 |  Message is an error
assert | 4 |  Message is a debug ASSERT
See Also
Reference
Rhino.Runtime Namespace