RhinoCommon API
NamedLayerStateTable Class
 All named layer states in a Rhino document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.NamedLayerStateTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class NamedLayerStateTable
Public NotInheritable Class NamedLayerStateTable
The NamedLayerStateTable type exposes the following members.
Properties
Name | Description
Count
 Returns the number of named layers states in the document.
Document
 Document that owns this table.
Names
 Returns the names of named layer states in the document.
Top
Methods
Name | Description
Delete
 Deletes an existing named layer state.
FindName
 Returns the index of an existing named layer state.
Import
 Imports named layer states from a 3dm file.
Rename
 Renames an existing named layer state.
Restore(String, RestoreLayerProperties)
 Restores a named layer state.
Restore(String, RestoreLayerProperties, Guid)
 Restores a named layer state.
Save(String)
 Saves or updates a named layer state.
Save(String, Guid)
 Saves or updates a named layer state.
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace