RhinoCommon API
VerifyPreviousVersionLicenseDelegate Delegate
 Called by GetLicense/AskUserForLicense to verify that a previous version license.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate bool VerifyPreviousVersionLicenseDelegate(
	string license,
	string previousVersionLicense,
	out string errorMessage
)
Public Delegate Function VerifyPreviousVersionLicenseDelegate (
	license As String,
	previousVersionLicense As String,
	<OutAttribute> ByRef errorMessage As String
) As Boolean
Parameters
license
Type: System.String
License being entered in GetLicense
previousVersionLicense
Type: System.String
Previous version license entered to verify upgrade eligibility
errorMessage
Type: System.String
Output parameter with localized error message to display to user when VerifyPreviousVersionLicenseDelegate returns false
Return Value
Type: Boolean
true when previousVersionLicense is eligible, otherwise false
See Also
Reference
Rhino.PlugIns Namespace