RhinoCommon API
LightMangerSupportCustomEvent Enumeration
 LightMangerSupportCustomEvent
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum LightMangerSupportCustomEvent
Public Enumeration LightMangerSupportCustomEvent
Members
Member name | Value | Description
light_added | 0
light_deleted | 1
light_undeleted | 2
light_modified | 3
light_sorted | 4
See Also
Reference
Rhino.Render Namespace