RhinoCommon API
PrintedPageDefinition Class
 Information describing a page for printed output
Inheritance Hierarchy
System.Object
 Rhino.PrintedPageDefinition
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PrintedPageDefinition
Public Class PrintedPageDefinition
The PrintedPageDefinition type exposes the following members.
Constructors
Name | Description
PrintedPageDefinition
Initializes a new instance of the PrintedPageDefinition class
Top
Properties
Name | Description
Description
 Name of the page
Height
 Height of the page in Units
Units
 Unit system for the width and height of the page
Width
 Width of the page in Units
Top
Methods
Name | Description
Top
See Also
Reference
Rhino Namespace