RhinoCommon API
PlaneSurface Class
 Represents a plane surface.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.PlaneSurface
 Rhino.Geometry.ClippingPlaneSurface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class PlaneSurface : Surface
<SerializableAttribute>
Public Class PlaneSurface
	Inherits Surface
The PlaneSurface type exposes the following members.
Constructors
Name | Description
PlaneSurface()
 Constructs a new plane surface.
PlaneSurface(Plane)
 Constructs a new plane surface.
PlaneSurface(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
PlaneSurface(Plane, Interval, Interval)
 Constructs a plane surface with x and y extents.
Top
Properties
Name | Description
Plane
 Gets or sets the plane surface's plane.
Top
Methods
Name | Description
CreateThroughBox(Plane, BoundingBox)
 Create a plane that contains the intersection of a bounding box.
CreateThroughBox(Line, Vector3d, BoundingBox)
 Create a plane that contains the intersection of a bounding box.
GetExtents
 Gets the extents of the plane surface.
SetExtents
 Sets the extents of the plane surface.
ToMesh
 Computes a polygon mesh of the surface made of one quad.
Top
See Also
Reference
Rhino.Geometry Namespace