RhinoCommon API
SimpleArraySubDPointer Class
 Wrapper for a C++ ON_SimpleArray<ON_SubD*> or ON_SimpleArray<constant ON_SubD*> If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArraySubDPointer
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArraySubDPointer : IDisposable
Public Class SimpleArraySubDPointer
	Implements IDisposable
The SimpleArraySubDPointer type exposes the following members.
Constructors
Name | Description
SimpleArraySubDPointer
 Initializes a new SimpleArraySubDPointer instance.
Top
Properties
Name | Description
Count
 Gets the amount of subds in this array.
Top
Methods
Name | Description
Add
 Adds a subd to the list.
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
Releases the unmanaged resources used by the SimpleArraySubDPointer and optionally releases the managed resources
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToNonConstArray
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace