RhinoCommon API
TextureRenderHashFlags Enumeration
 This enum is deprecated in favor of CrcRenderHashFlags.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum TextureRenderHashFlags
Public Enumeration TextureRenderHashFlags
Members
Member name | Value | Description
ExcludeLocalMapping | 1
See Also
Reference
Rhino.Render Namespace