RhinoCommon API
RibbonOffsetSurfaceMethod Enumeration
 Enum for RibbonOffset surface generation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public enum RibbonOffsetSurfaceMethod
Public Enumeration RibbonOffsetSurfaceMethod
Members
Member name | Value | Description
None | 0 |  No Surfaces will be created
Sweep2 | 1 |  Creates surfaces based off of Sweep 2 Rails
Sweep2NetworkSrf | 2 |  Creates a mix of sweeps and network surfaces. NetworkSrf will be applied in corners with 3 sides
See Also
Reference
Rhino.Geometry Namespace