RhinoCommon API
Utilities.ShowContentChooserResults Enumeration
[Missing <summary> documentation for "T:Rhino.Render.Utilities.ShowContentChooserResults"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum ShowContentChooserResults
Public Enumeration ShowContentChooserResults
Members
Member name | Value | Description
None | 0
New | 1
Copy | 2
Instance | 3
See Also
Reference
Rhino.Render Namespace