RhinoCommon API
CurveSegment Structure
 For internal use only.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public struct CurveSegment
Public Structure CurveSegment
The CurveSegment type exposes the following members.
Properties
Name | Description
Index
 The index of the curve used by this boundary element.
Reversed
 True if this piece of the curve should be reversed.
SubDomain
 The sub-domain of the curve used by this boundary element.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace