RhinoCommon API
RenderWindow.Channel Class
[Missing <summary> documentation for "T:Rhino.Render.RenderWindow.Channel"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderWindow.Channel
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Channel : IDisposable
Public Class Channel
	Implements IDisposable
The RenderWindow.Channel type exposes the following members.
Properties
Name | Description
Height
 Return the channel height.
Id
 Return the channel id.
Width
 Return the channel width.
Top
Methods
Name | Description
AddValue
 Add value to existing values at point x, y. If x or y are out of range, the function will fail and may crash Rhino.
Clone
 Return a clone of the channel.
Dispose()
Releases all resources used by the RenderWindow.Channel
Dispose(Boolean)
Releases the unmanaged resources used by the RenderWindow.Channel and optionally releases the managed resources
GetMinMaxValues
 Get the minimum and maximum values in the channel. minThe channel's minimum value. maxThe channel's maximum value.
GetValue
 Get values from the channel.
GetValues
 Get a rectangle of values from the channel. The input parameters are checked for validity. If the rectangle is not fully inside the frame buffer, the function will fail.
PixelSize
 Returns the size of the data in one pixel in the channel. For RDK standard channels, this value is always sizeof(float). For the special chanRGBA collective channel, this value is 4 * sizeof(float).
SetValue(Int32, Int32, Color4f)
 If x or y are out of range, the function will fail and may crash Rhino.
SetValue(Int32, Int32, Single)
 Assign value to a pixel at coordinate (x, y).
SetValues
 Set a pixel buffer
SetValuesFlipped
 Set a pixel buffer y-flipped.
Top
See Also
Reference
Rhino.Render Namespace