RhinoCommon API
MeshPipeCapStyle Enumeration
Enumerates methods to end a mesh pipe.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum MeshPipeCapStyle
Public Enumeration MeshPipeCapStyle
Members
Member name | Value | Description
None | 0 | Capping is skipped. The resulting object will be simpler.
Flat | 1 | A flat surface will cap the pipe.
Box | 2 | A simple construction will cap the pipe.
Dome | 3 | A meridians-and-parallels hemisphere construction will cap the pipe.
See Also
Reference
Rhino.Geometry Namespace