RhinoCommon API
MetaData Class
[Missing <summary> documentation for "T:Rhino.Render.DataSources.MetaData"]
Inheritance Hierarchy
System.Object
 Rhino.Render.DataSources.MetaData
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class MetaData : IDisposable
Public NotInheritable Class MetaData
	Implements IDisposable
The MetaData type exposes the following members.
Constructors
Name | Description
MetaData
Initializes a new instance of the MetaData class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
ContentInstanceId
Dispose
Releases all resources used by the MetaData
Finalize |  (Overrides Object.Finalize().)
Geometry
Top
See Also
Reference
Rhino.Render.DataSources Namespace