RhinoCommon API
TransformField Class
 Transform field value class
Inheritance Hierarchy
System.Object
 Rhino.Render.Fields.Field
 Rhino.Render.Fields.TransformField
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class TransformField : Field
Public Class TransformField
	Inherits Field
The TransformField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
Rhino.Render.Fields Namespace