RhinoCommon API
RhDisplayPoint Structure
[Missing <summary> documentation for "T:Rhino.Runtime.InteropWrappers.RhDisplayPoint"]
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public struct RhDisplayPoint
Public Structure RhDisplayPoint
The RhDisplayPoint type exposes the following members.
Constructors
Name | Description
RhDisplayPoint
Initializes a new instance of the RhDisplayPoint class
Top
Methods
Name | Description
Top
Fields
Name | Description
m__padding1
m__padding2
m_diameterPixels
m_fillColor
m_innerDiameterPixels
m_rotationRadians
m_strokeColor
m_strokeWidthPixels
m_style
m_vertex
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace