RhinoCommon API
RhinoDocCommonTable<T> Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.RhinoDocCommonTable`1"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<T>
 Rhino.DocObjects.Tables.RhinoDocCommonTable<T>
 More...
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class RhinoDocCommonTable<T> : CommonComponentTable<T>
where T : ModelComponent
Public MustInherit Class RhinoDocCommonTable(Of T As ModelComponent)
	Inherits CommonComponentTable(Of T)
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "T:Rhino.DocObjects.Tables.RhinoDocCommonTable`1"]
The RhinoDocCommonTable<T> type exposes the following members.
Properties
Name | Description
Document
Document that owns this table.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<T>
 Rhino.DocObjects.Tables.RhinoDocCommonTable<T>
 Rhino.DocObjects.Tables.BitmapTable
 Rhino.DocObjects.Tables.DimStyleTable
 Rhino.DocObjects.Tables.GroupTable
 Rhino.DocObjects.Tables.HatchPatternTable
 Rhino.DocObjects.Tables.InstanceDefinitionTable
 Rhino.DocObjects.Tables.LayerTable
 Rhino.DocObjects.Tables.LightTable
 Rhino.DocObjects.Tables.LinetypeTable
 Rhino.DocObjects.Tables.MarkupTable
 Rhino.DocObjects.Tables.MaterialTable
 Rhino.DocObjects.Tables.ObjectTable
 Rhino.DocObjects.Tables.PageViewGroupTable
 Rhino.DocObjects.Tables.SectionStyleTable