RhinoCommon API
LicenseUtils Class
 License Manager Utilities.
Inheritance Hierarchy
System.Object
 Rhino.PlugIns.LicenseUtils
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class LicenseUtils
Public NotInheritable Class LicenseUtils
The LicenseUtils type exposes the following members.
Methods
Name | Description
AskUserForLicense(Int32, Boolean, Object, String, ValidateProductKeyDelegate, OnLeaseChangedDelegate, String, String, Guid, Guid, LicenseCapabilities)
 This version of Rhino.PlugIns.LicenseUtils.AskUserForLicense is used by Rhino C++ plug-ins.
AskUserForLicense(Int32, Boolean, Object, String, ValidateProductKeyDelegate, OnLeaseChangedDelegate, VerifyLicenseKeyDelegate, VerifyPreviousVersionLicenseDelegate, String, String, Guid, Guid, LicenseCapabilities)
CheckInLicense
 Checks in a previously checked out license to the Zoo server from which it was checked out.
CheckOutLicense
 Checks out a license that is on loan from a Zoo server on a permanent basis.
ConvertLicense
 Converts a product license from a standalone node to a network node.
DeleteLicense
 Deletes a license along with its license file.
Echo
 Test connectivity with the Zoo.
GetLicense(ValidateProductKeyDelegate, OnLeaseChangedDelegate, Int32, Int32, String, String, String, Guid, Guid)
 This version of Rhino.PlugIns.LicenseUtils.GetLicense is used by Rhino C++ plug-ins.
GetLicense(ValidateProductKeyDelegate, OnLeaseChangedDelegate, VerifyLicenseKeyDelegate, VerifyPreviousVersionLicenseDelegate, Int32, Int32, String, String, String, Guid, Guid)
GetLicenseCapabilities
 Converts an integer to a LicenseCapabilities flag
GetLicenseStatus
 Returns the current status of every license for UI purposes.
GetLicenseType
 Returns the contentType of a specified product license
GetOneLicenseStatus
 Returns the current status of a license for UI purposes.
Initialize
 Initializes the license manager.
IsCheckOutEnabled
 Returns whether or not license checkout is enabled.
LicenseOptionsHandler
LoginToCloudZoo
LogoutOfCloudZoo
ReturnLicense
 OBSOLETE - REMOVE WHEN POSSIBLE.
ShowBuyLicenseUi
ShowLicenseValidationUi
 ShowLicenseValidationUi
ShowRhinoExpiredMessage
 Show Rhino or Beta expired message
Top
See Also
Reference
Rhino.PlugIns Namespace