RhinoCommon API
RhinoAccountsProxyException Class
 Exception thrown when there is a problem with a proxy setting during a Rhino Accounts operation.
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.RhinoAccounts.RhinoAccountsException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsProxyException
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class RhinoAccountsProxyException : RhinoAccountsException
<SerializableAttribute>
Public Class RhinoAccountsProxyException
	Inherits RhinoAccountsException
The RhinoAccountsProxyException type exposes the following members.
Constructors
Name | Description
RhinoAccountsProxyException(Exception)
 Generates a new instance of the exception.
RhinoAccountsProxyException(String, Exception)
 Generates a new instance of the exception.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace