RhinoCommon API
Sun.Accuracies Enumeration
[Missing <summary> documentation for "T:Rhino.Render.Sun.Accuracies"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum Accuracies
Public Enumeration Accuracies
Members
Member name | Value | Description
Minimum | 0
Maximum | 1
See Also
Reference
Rhino.Render Namespace