RhinoCommon API
CustomRenderSaveFileTypes Class
[Missing <summary> documentation for "T:Rhino.PlugIns.CustomRenderSaveFileTypes"]
Inheritance Hierarchy
System.Object
 Rhino.PlugIns.CustomRenderSaveFileTypes
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class CustomRenderSaveFileTypes
Public NotInheritable Class CustomRenderSaveFileTypes
The CustomRenderSaveFileTypes type exposes the following members.
Methods
Name | Description
RegisterFileType
 Call this method to register a custom file save type with the render output window save dialog.
Top
See Also
Reference
Rhino.PlugIns Namespace