RhinoCommon API
IPlatformServiceLocator Interface
 Get platform specific services that are used internally for general cross platform funtions in RhinoCommon. This includes services like localization and GUI components that have concrete implementations in the RhinoWindows or RhinoMac assemblies
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IPlatformServiceLocator
Public Interface IPlatformServiceLocator
The IPlatformServiceLocator type exposes the following members.
Methods
Name | Description
GetService<T>
Used to get service of a specific type
Top
See Also
Reference
Rhino.Runtime Namespace