RhinoCommon API
FileFindPreference Enumeration
Defines options for file search.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum FileFindPreference
Public Enumeration FileFindPreference
Members
Member name | Value | Description
None | 0 | The choice is not defined.
FullPath | 1 | File name exists in FullPath().
RelativePath | 2 | File name exists in base path + RelativePath().
BasePath | 3 | File name exists in base path directory.
ContentMatch | 4 | File with matching content exists.
MostRecent | 5 | Most recently modified file.
See Also
Reference
Rhino.FileIO Namespace