RhinoCommon API
GetLineMode Enumeration
[Missing <summary> documentation for "T:Rhino.Input.Custom.GetLineMode"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public enum GetLineMode
Public Enumeration GetLineMode
Members
Member name | Value | Description
TwoPoint | 0
SurfaceNormal | 1
Angled | 2
Vertical | 3
FourPoint | 4
Bisector | 5
Perpendicular | 6
Tangent | 7
CurveEnd | 8
CPlaneNormalVector | 9
See Also
Reference
Rhino.Input.Custom Namespace