RhinoCommon API
PlugInInfo Class
 Contains detailed information about a Rhino plug-in.
Inheritance Hierarchy
System.Object
 Rhino.PlugIns.PlugInInfo
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PlugInInfo
Public Class PlugInInfo
The PlugInInfo type exposes the following members.
Properties
Name | Description
Address
 Returns the address of the organization or company that created the plug-in.
CommandNames
 Returns a plug-in's English command names.
Country
 Returns the country of the organization or company that created the plug-in.
Description
 Returns the plug-in's description.
Email
 Returns the email address of the organization or company that created the plug-in.
Fax
 Returns the fax number of the organization or company that created the plug-in.
FileName
 Returns the plug-in's file name.
FileTypeDescriptions
 Returns the description of supported file types for file import and file export plug-in.
FileTypeExtensions
 Returns the file types extensions supported for file import and file export plug-in.
Id
 Returns the plug-in's Id.
IsDotNet
 Returns true if the plug-in is based on .NET, false otherwise.
IsLoaded
 Returns true if the plug-in is loaded, false otherwise.
Name
 Returns the plug-in's name.
Organization
 Returns the organization or company that created the plug-in.
Phone
 Returns the phone number of the organization or company that created the plug-in.
PlugInLoadTime
 Returns the plug-in's load time.
PlugInType
 Returns the plug-in type.
RegistryPath
 Returns the plug-in's Windows Registry path.
ShipsWithRhino
 Returns true if the plug-in ships with Rhino, false otherwise.
UpdateUrl
 Returns the web site, or URL, were an updated version of the plug-in can be found.
Version
 Returns the plug-in's version.
WebSite
 Returns the web site, or URL, of the organization or company that created the plug-in.
Top
Methods
Name | Description
Icon
 Returns the plug-in's icon in bitmap form.
IsLoadProtected
 Returns the load protection state for a plug-in
Top
See Also
Reference
Rhino.PlugIns Namespace