RhinoCommon API
DisplayPipelineAttributes.ClippingPlaneFillColorUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.ClippingPlaneFillColorUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public enum ClippingPlaneFillColorUse
Public Enumeration ClippingPlaneFillColorUse
Members
Member name | Value | Description
ViewportColor | 0 |  Follows how the object displays in the viewport.
RenderMaterialColor | 1 |  Uses the object's render material.
PlaneMaterialColor | 2 |  Uses the clipping plane's color or layer color property.
SolidColor | 3 |  Solid color
See Also
Reference
Rhino.Display Namespace