RhinoCommon API
StdVectorOfSharedPtrToMesh Class
 Represents a wrapper to an unmanaged array of mesh pointers.
Wrapper for a C++ ON_SimpleArray of ON_Mesh* or constant ON_Mesh*. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.StdVectorOfSharedPtrToMesh
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class StdVectorOfSharedPtrToMesh : IDisposable
Public Class StdVectorOfSharedPtrToMesh
	Implements IDisposable
The StdVectorOfSharedPtrToMesh type exposes the following members.
Constructors
Name | Description
StdVectorOfSharedPtrToMesh
 Initializes a new StdVectorOfSharedPtrToMesh instance.
Top
Properties
Name | Description
Count
 Gets the amount of meshes in this array.
Top
Methods
Name | Description
Add
 Adds a mesh to the list.
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
Releases the unmanaged resources used by the StdVectorOfSharedPtrToMesh and optionally releases the managed resources
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToNonConstArray
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace