RhinoCommon API
RhinoDoc.RenderMaterialAssignmentChangedEventArgs Class
[Missing <summary> documentation for "T:Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.RhinoDoc.RenderContentTableEventArgs
 Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderMaterialAssignmentChangedEventArgs : RhinoDoc.RenderContentTableEventArgs
Public Class RenderMaterialAssignmentChangedEventArgs
	Inherits RhinoDoc.RenderContentTableEventArgs
The RhinoDoc.RenderMaterialAssignmentChangedEventArgs type exposes the following members.
Properties
Name | Description
IsLayer
IsObject
LayerId
NewRenderMaterial
ObjectId
OldRenderMaterial
Top
Methods
Name | Description
Top
See Also
Reference
Rhino Namespace