RhinoCommon API
LineJoinStyle Enumeration
 Shape to be used at the corners of curves
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LineJoinStyle
Public Enumeration LineJoinStyle
Members
Member name | Value | Description
Round | 0 |  Rounds corners
Miter | 1 |  Sharp corners where outer edges are extended to a point where they meet
Bevel | 2 |  Beveled corner where outer edges are connected without extending
See Also
Reference
Rhino.DocObjects Namespace