RhinoCommon API
WorksessionFileModel Class
 A model in a Rhino worksession (.rws) file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.WorksessionFileModel
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public sealed class WorksessionFileModel : IDisposable
Public NotInheritable Class WorksessionFileModel
	Implements IDisposable
The WorksessionFileModel type exposes the following members.
Constructors
Name | Description
WorksessionFileModel()
Creates a reference model with no paths and no layer overrides.
WorksessionFileModel(String)
Creates a reference model for a model file.
WorksessionFileModel(WorksessionFileModel)
Creates a copy of another model.
Top
Properties
Name | Description
FullPath
 Gets or sets the full path of the model file, as saved. Nothing checks that it exists.
IsActive
 Gets or sets whether this is the model that was active when the worksession was saved. Every other model is a reference model.
LayerOverrideCount
 Gets the number of layer overrides. Rhino does not save or use layer overrides for the active model. Version 4 files do not have them.
RelativePath
 Gets or sets the path of the model file relative to the .rws file, as saved. Rhino uses it when the file is no longer at FullPath. It can be empty. Version 4 files do not have it.
Top
Methods
Name | Description
AddLayerOverride
Adds a copy of a layer override to the end of the list.
ClearLayerOverrides
Removes all of the layer overrides.
Dispose
Releases the native model.
Finalize
Releases the native model.
 (Overrides Object.Finalize().)
GetLayerOverride
Gets a copy of a layer override.
GetLayerOverrides
Gets copies of all of the layer overrides.
GetParentLayerValues
 Gets a copy of the settings of the layer Rhino adds as the parent of all of a reference model's layers. Version 4 files do not have them.
RemoveLayerOverrideAt
Removes a layer override.
SetLayerOverride
Replaces a layer override with a copy of another.
SetParentLayerValues
Replaces the parent layer settings with a copy of values.
Top
See Also
Reference
Rhino.FileIO Namespace