RhinoCommon API
LicenseStateChangedEventArgs Class
 Passed to LicenseStateChanged event on RhinoApp
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Runtime.LicenseStateChangedEventArgs
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class LicenseStateChangedEventArgs : EventArgs
Public Class LicenseStateChangedEventArgs
	Inherits EventArgs
The LicenseStateChangedEventArgs type exposes the following members.
Constructors
Name | Description
LicenseStateChangedEventArgs
 LicenseStateChangedEventArgs constructor
Top
Properties
Name | Description
CallingRhinoCommonAllowed
 true if RhinoCommon calls will never raise Rhino.Runtime.NotLicensedException. false otherwise
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Runtime Namespace