RhinoCommon API
VisualAnalysisMode.AnalysisStyle Enumeration
 Contains enumerated values for analysis styles, such as wireframe, texture or false colors..
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum AnalysisStyle
Public Enumeration AnalysisStyle
Members
Member name | Value | Description
Wireframe | 1 | The analysis is showing with wires.
Texture | 2 | The analysis is showing with textures.
FalseColor | 4 | The analysis is showing with false colors.
See Also
Reference
Rhino.Display Namespace