RhinoCommon API
LengthMassProperties Class
 Contains static initialization methods and allows access to the computed metrics of length, length centroid, and length moments in curves.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.LengthMassProperties
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class LengthMassProperties : IDisposable
Public Class LengthMassProperties
	Implements IDisposable
The LengthMassProperties type exposes the following members.
Properties
Name | Description
Centroid
 Gets the length centroid in the world coordinate system.
CentroidCoordinatesMomentsOfInertia
 Moments of inertia with respect to centroid coordinate system. X = integral of ((y-y0)^2 + (z-z0)^2) dm Y = integral of ((z-z0)^2 + (x-x0)^2) dm Z = integral of ((z-z0)^2 + (y-y0)^2) dm where (x0,y0,z0) = centroid.
CentroidCoordinatesMomentsOfInertiaError
 Uncertainty in centroid coordinates moments of inertia calculation.
CentroidCoordinatesProductMoments
 Product moments with respect to centroid coordinate system.
CentroidCoordinatesProductMomentsError
 Uncertainty in product moments with respect to centroid coordinate system.
CentroidCoordinatesRadiiOfGyration
 Radii of gyration with respect to centroid coordinate system. X = sqrt(integral of ((y-y0)^2 + (z-z0)^2) dm/M) Y = sqrt(integral of ((z-z0)^2 + (x-x0)^2) dm/M) Z = sqrt(integral of ((z-z0)^2 + (y-y0)^2) dm/M) where (x0,y0,z0) = centroid.
CentroidCoordinatesSecondMoments
 Second moments with respect to centroid coordinate system. X = integral of (x-x0)^2 dm Y = integral of (y-y0)^2 dm Z = integral of (z-z0)^2 dm where (x0,y0,z0) = centroid.
CentroidCoordinatesSecondMomentsError
 Uncertainty in centroid coordinates second moments calculation.
CentroidError
 Gets the uncertainty in the centroid calculation.
Length
 Gets the length solution.
LengthError
 Gets the uncertainty in the length calculation.
WorldCoordinatesFirstMoments
 Returns the world coordinate first moments if they were able to be calculated. X is integral of "x dm" over the length Y is integral of "y dm" over the length Z is integral of "z dm" over the length.
WorldCoordinatesFirstMomentsError
 Uncertainty in world coordinates first moments calculation.
WorldCoordinatesMomentsOfInertia
 The moments of inertia about the world coordinate axes. X = integral of (y^2 + z^2) dm Y = integral of (z^2 + x^2) dm Z = integral of (z^2 + y^2) dm.
WorldCoordinatesMomentsOfInertiaError
 Uncertainty in world coordinates moments of inertia calculation.
WorldCoordinatesProductMoments
 Returns the world coordinate product moments if they were able to be calculated. X is integral of "xy dm" over the length Y is integral of "yz dm" over the length Z is integral of "zx dm" over the length.
WorldCoordinatesProductMomentsError
 Uncertainty in world coordinates second moments calculation.
WorldCoordinatesRadiiOfGyration
 Radii of gyration with respect to world coordinate system. X = sqrt(integral of (y^2 + z^2) dm/M) Y = sqrt(integral of (z^2 + x^2) dm/M) Z = sqrt(integral of (z^2 + y^2) dm/M)
WorldCoordinatesSecondMoments
 Returns the world coordinate second moments if they were able to be calculated. X is integral of "xx dm" over the length Y is integral of "yy dm" over the length Z is integral of "zz dm" over the length.
WorldCoordinatesSecondMomentsError
 Uncertainty in world coordinates second moments calculation.
Top
Methods
Name | Description
CentroidCoordinatesPrincipalMoments
 Calculates the eigenvalues and eigenvectors of the moments matrix with respect to centroid coordinates.
CentroidCoordinatesPrincipalMomentsOfInertia
 Calculates the principal moments of inertia and principal axes with respect to centroid coordinates.
Compute(Curve)
 Calculates the length mass properties of a curve.
Compute(IEnumerable<Curve>)
 Calculates the length mass properties of an enumeration of curves.
Compute(Curve, Boolean, Boolean, Boolean, Boolean)
 Calculates the length mass properties of a curve.
Compute(IEnumerable<Curve>, Boolean, Boolean, Boolean, Boolean)
 Calculates the length mass properties of an enumeration of curves.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Sum(LengthMassProperties)
 Sum mass properties together to get an aggregate mass.
Sum(IEnumerable<LengthMassProperties>, Boolean)
 Sum mass properties together to get an aggregate mass.
WeightedSum
 Sum a list of mass properties together to get an aggregate mass, weighting each by a density factor.Ignores existing mass properties in this object.
WorldCoordinatesPrincipalMoments
 Calculates the eigenvalues and eigenvectors of moments matrix in world coordinates.
WorldCoordinatesPrincipalMomentsOfInertia
 Calculates the principal moments of inertia and principal axes with respect to world coordinates.
Top
See Also
Reference
Rhino.Geometry Namespace