RhinoCommon API
ViewTable Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.ViewTable"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.ViewTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class ViewTable : IEnumerable<RhinoView>,
	IEnumerable
Public NotInheritable Class ViewTable
	Implements IEnumerable(Of RhinoView), IEnumerable
The ViewTable type exposes the following members.
Properties
Name | Description
ActiveView
 Gets or Sets the active view.
Document
Document that owns this object table.
PageViewCount
 Gets the number of page views in the document
RedrawEnabled
Returns or sets (enable or disables) screen redrawing.
Top
Methods
Name | Description
Add
 Constructs a new Rhino view and, at the same time, adds it to the list.
AddPageView(String)
 Constructs a new page view with a given title and, at the same time, adds it to the list. On Windows the new page view becomes the active view; on Mac the active view does not change. Use the overload with a setActive parameter for behavior that is consistent across platforms.
AddPageView(String, Boolean)
 Constructs a new page view with a given title and, at the same time, adds it to the list.
AddPageView(String, Double, Double)
 Constructs a new page view with a given title and size and, at the same time, adds it to the list. On Windows the new page view becomes the active view; on Mac the active view does not change. Use the overload with a setActive parameter for behavior that is consistent across platforms.
AddPageView(String, Double, Double, Boolean)
 Constructs a new page view with a given title and size and, at the same time, adds it to the list.
DefaultViewLayout
EnableCameraIcon
 Use to turn camera icon on and off
EnableRedraw
 Enables or disables screen redrawing.
Find(Guid)
 Finds a view in this document with a given main viewport Id.
Find(String, Boolean)
 Finds a view in this document with a main viewport that has a given name. Note that there may be multiple views in this document that have the same name. This function only returns the first view found. If you want to find all the views with a given name, use the GetViewList function and iterate through the views.
FlashObjects
 Cause objects selection state to change momentarily so the object appears to flash on the screen.
FourViewLayout
GetEnumerator
GetPageViews
 Gets all page views in the document.
GetStandardRhinoViews
GetViewList
 Gets an array of all the views.
ImportPageView
 Imports a page view, or layout, from a Rhino file into this document.
IsCameraIconVisible
 Determine if a camera icon is being shown
Redraw()
Redraws all views.
Redraw(Boolean)
Redraws all views.
ThreeViewLayout
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace