RhinoCommon API
TextEntity Class
[Missing <summary> documentation for "T:Rhino.Geometry.TextEntity"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.TextEntity
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class TextEntity : AnnotationBase
<SerializableAttribute>
Public Class TextEntity
	Inherits AnnotationBase
The TextEntity type exposes the following members.
Constructors
Name | Description
TextEntity()
 Initializes a new instance of the TextEntity class.
TextEntity(SerializationInfo, StreamingContext)
 Protected constructor used in serialization
Top
Properties
Name | Description
Justification
 Gets or sets the justification of text in relation to its base point.
TextHorizontalAlignment
TextOrientation
TextVerticalAlignment
Top
Methods
Name | Description
Create
 Create Text geometry or null if input is invalid
CreateCurves(DimensionStyle, Boolean, Double, Double)
 Returns the outline curves.
CreateCurves(DimensionStyle, Boolean, Boolean, Double, Double)
 Returns the outline curves.
CreateCurvesGrouped(DimensionStyle, Boolean, Double, Double)
 Creates planar curve from text outline curves. Curves are grouped such that each element in the list being returned represents a single character.
CreateCurvesGrouped(DimensionStyle, Boolean, Boolean, Double, Double)
 Creates planar curve from text outline curves. Curves are grouped such that each element in the list being returned represents a single character.
CreateExtrusions(DimensionStyle, Double, Double, Double)
 Creates extrusions from the outline curves with specified height.
CreateExtrusions(DimensionStyle, Double, Boolean, Double, Double)
 Creates extrusions from the outline curves with specified height.
CreateExtrusionsGrouped(DimensionStyle, Double, Double, Double)
 Creates 3d Breps from text outline curves. Breps are grouped such that each element in the list being returned represents a single character.
CreateExtrusionsGrouped(DimensionStyle, Boolean, Double, Double, Double)
 Creates 3d Breps from text outline curves. Breps are grouped such that each element in the list being returned represents a single character.
CreatePolySurfaces(DimensionStyle, Double, Double, Double)
 Creates breps from the outline curves with specified height.
CreatePolySurfaces(DimensionStyle, Double, Boolean, Double, Double)
 Creates breps from the outline curves with specified height.
CreatePolysurfacesGrouped(DimensionStyle, Double, Double, Double)
 Creates 3d Breps from text outline curves. Breps are grouped such that each element in the list being returned represents a single character.
CreatePolysurfacesGrouped(DimensionStyle, Boolean, Double, Double, Double)
 Creates 3d Breps from text outline curves. Breps are grouped such that each element in the list being returned represents a single character.
CreateSurfaces(DimensionStyle, Double, Double)
 Creates planar breps from the outline curves.
CreateSurfaces(DimensionStyle, Boolean, Double, Double)
 Creates planar breps from the outline curves.
CreateSurfacesGrouped(DimensionStyle, Double, Double)
 Creates planar Breps from text outline curves. Breps are grouped such that each element in the list being returned represents a single character.
CreateSurfacesGrouped(DimensionStyle, Boolean, Double, Double)
 Creates planar Breps from text outline curves. Breps are grouped such that each element in the list being returned represents a single character.
CreateWithRichText
 Create RichText geometry or null if input is invalid
Explode
 Explodes this text entity into an array of curves.
GetTextTransform(Double, DimensionStyle)
 Get the transform for this text object's text geometry
GetTextTransform(ViewportInfo, Double, DimensionStyle)
 Get the transform for this text object's text geometry as it is drawn in a particular viewport. Unlike the parameterless-viewport overload, this honors the dimension style's TextOrientation (for example "Horizontal to view") and DrawForward, orienting the text against the viewport exactly as the display pipeline does. Use this when previewing text so the preview matches how the placed object will be drawn.
Transform(Transform, DimensionStyle)
 Transform the object by a 4x4 transform matrix and change text height override to accommodate scaling in the transform if necessary
Top
See Also
Reference
Rhino.Geometry Namespace