RhinoCommon API
FileRawReadOptions Class
 Options for reading a Raw file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileRawReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileRawReadOptions
Public Class FileRawReadOptions
The FileRawReadOptions type exposes the following members.
Constructors
Name | Description
FileRawReadOptions
Initializes a new instance of the FileRawReadOptions class
Top
Properties
Name | Description
RawModelUnits
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace