RhinoCommon API
DisplayPipelineAttributes.ClippingEdgeColorUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.ClippingEdgeColorUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public enum ClippingEdgeColorUse
Public Enumeration ClippingEdgeColorUse
Members
Member name | Value | Description
PlaneColor | 0 |  Uses the clipping plane's color (object or layer).
SolidColor | 1 |  Solid color
ObjectColor | 2 |  Uses the object's color (object or layer).
See Also
Reference
Rhino.Display Namespace