RhinoCommon API
PreviewBackground Class
 PreviewBackGround takes care of construction and destruction of PreviewLight
Inheritance Hierarchy
System.Object
 Rhino.Render.PreviewBackground
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PreviewBackground
Public Class PreviewBackground
The PreviewBackground type exposes the following members.
Constructors
Name | Description
PreviewBackground
 Constructor for PreivewLighting
Top
Properties
Name | Description
CppPointer
 CppPointer for PreivewLighting
Top
Methods
Name | Description
ElementKind
 ElementKind
EnvironmentInstanceId
 EnvironmentInstanceId
SetEnvironmentInstanceId
 SetEnvironmentInstanceId
SetUpPreview
 SetUpPreview
Top
See Also
Reference
Rhino.Render Namespace