RhinoCommon API
NurbsCurveFitParameters Class
 The NURBS curve fit tool creates a NURBS curve that approximates an existing curve. The NurbsCurveFitParameters class contains the paramters that determine NURBS curve properties (degree, point count, ...) and other fitting contstraints.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.NurbsCurveFitParameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class NurbsCurveFitParameters : ICloneable,
	IDisposable
Public Class NurbsCurveFitParameters
	Implements ICloneable, IDisposable
The NurbsCurveFitParameters type exposes the following members.
Constructors
Name | Description
NurbsCurveFitParameters()
 Initializes a new instance of the NurbsCurveFitParameters class.
NurbsCurveFitParameters(NurbsCurveFitParameters)
 Creates a new instance of the NurbsCurveFitParameters class as a copy of an existing instance.
Top
Properties
Name | Description
ApplyTangentMatchingAtKinks
 If true, the TangentMatching setting is applied at kinks. Otherwise, TangentMatching applies only to the ends of curves.
ClampedControlPointCount
 Number of control points if the NURBS curve will be clamped. Number of total control points if the NURBS curve will be periodic. This number is >= PointCount() Includes SubDFriendly constrained points and the duplicated point for a clamped closed curve.
Closed
 Number of total control points if the NURBS curve will be periodic. This number is >= PointCount() and includes periodic duplicates.
ConstrainedPointCount
 If Closed() is true, the number of constrained points is (TangentMatchStart() || TangentMatchEnd() ? 1 : 0) + (TangentMatchStart()?1:0) + (TangentMatchEnd()?1:0). If Closed() is false, the number of constrained points is 2 + (SubDFriendly() ? 2 : 0) + (TangentMatchStart()?1:0) + (TangentMatchEnd()?1:0).
CurvatureBiasCoefficient
 When CurvatureBiasIntensity == NurbsCurveFitParameters.Intensity::Custom, this value is used as the curvature bias parameter.
CurvatureBiasIntensity
 Curvature bias is used to make the fit curve stay close to regions of relatively high curvature. Use CurvatureBiasCoefficient() to convert this enum to the the value passed to the optimizer.
DefaultDegree
 The default degree of the fit
DefaultSampleCount
 Default number of points to sample from input curves and pass to the fitter that creates the output NURBS curve.
Degree
 The degree of the resulting curve
KinkAngleDegrees
 The angle, in degrees, used to determine if when an abrupt change in tangent or curvature vector direction is a kink.
KinkAngleRadians
 The angle, in radians, used to determine if when an abrupt change in tangent or curvature vector direction is a kink.
KinkSplitting
 Gets or sets the kink splitting behavior used when fitting a NURBS curve. See also
MaximumDegree
 The maximum degree of the fit
MaximumPointCount
 Gets the maximum number of points supported for NURBS curve fitting operations.
MaximumSampleCount
 Maximum number of points to sample from input curves and pass to the fitter that creates the output NURBS curve.
MinimumClampedPointCount
 The minimum clamped point count
MinimumClosedPointCount
 The minimum closed point count
MinimumDegree
 The minimum degree of the fit
MinimumSampleCount
 Minimum number of points to sample from input curves and pass to the fitter that creates the output NURBS curve.
OptimizeCurve
 If OptimizeCurve = false, then all options below are ignored and the Greville interpolant is returned. Rhino 1 - Rhino 8 Rebuild command created a result similar to what's created when m_bOptimizeCurve = false.
PeriodicControlPointCount
 Number of total control points if the NURBS curve will be periodic. This number is >= PointCount() and includes periodic duplicates.
PointCount
 Number of distinct control points in the NURBS curve fit. If a range of point counts is possible, this is the minimum number.
PointCountRange
 Gets or sets the point count range as an IndexPair.
PointCountRangeMaximum
PointCountRangeMinimum
PointCountRangeTolerance
 When a range of point counts is permitted and PointCountRangeTolerance greater than 0, then searching for the NURBS curve fit terminates if the separation is less than or equal to PointCountRangeTolerance.
SampleCount
 This is the number of points the NURBS curve is fit through. Is it common for these points to be sampled from an input curve.
SmoothingCoefficient
 When SmoothingIntensity == NurbsCurveFitParameters.Intensity::Custom, this value is used as the smoothing parameter.
SmoothingIntensity
 Smoothing penalty used to make triples of consecutive control polygon points colinear. Use SmoothingCoefficient() to convert this enum to the the value passed to the optimizer.
SubDFriendly
 Gets or sets the SubDFriendly property. When true, the resulting curve will be more likely to have good subdivision surface properties, such as fewer kinks and more even parameterization. This is accomplished by using a more aggressive kink splitting strategy and by using the SmoothingCoefficient to bias the fit towards smoother curves.
TangentMatching
 Gets ot Sets the TangentMatching value
UniformityCoefficient
 When UniformityIntensity == NurbsCurveFitParameters.Intensity::Custom, this value is used as the uniformity parameter.
UniformityIntensity
 Uniformity penalty used to make the distance between control points more equal. Use UniformityCoefficient() to convert this enum to the the value passed to the optimizer.
VariablePointCount
Top
Methods
Name | Description
Clone
 Supports the ICloneable inteface and creates a new NurbsCurveFitParameters object with the same property values as this instance.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetCurvatureBiasCoefficientFromIntensity
 Returns the Curvature bias coefficient that corresponds to a given NurbsCurveFitParameters.Intensity value.
GetCurvatureBiasIntensityFromCoefficient
 Returns the NurbsCurveFitParameters.Intensity value that corresponds to a given curvature bias coefficient.
GetPointCountRange
 Get the point count range and tolerance.
GetSmoothingCoefficientFromIntensity
 Returns the smoothing coefficient that corresponds to a given NurbsCurveFitParameters.Intensity value.
GetSmoothingIntensityFromCoefficient
 Returns the NurbsCurveFitParameters.Intensity value that corresponds to a given smoothing coefficient.
GetUniformityCoefficientFromIntensity
 Returns the uniformity coefficient that corresponds to a given NurbsCurveFitParameters.Intensity value.
GetUniformityIntensityFromCoefficient
 Returns the NurbsCurveFitParameters.Intensity value that corresponds to a given uniformity coefficient.
MaximumPointCountForDegree
 Given a point count and periodic setting, determine the maximum degree.
MinimumPointCountForDegree
 Give a degree and periodic setting, determine the minimum point count.
SetPointCountRange(Int32, Int32)
 Set the point count range and tolerance.
SetPointCountRange(Int32, Int32, Double)
 Set the point count range and tolerance.
ValidInput
 returns true if the input values are within the acceptable ranges for NURBS curve fitting. If false is returned, the input values should be adjusted before calling the curve fitting function. See also MinimumPointCountForDegree() and MaximumPointCountForDegree().
Top
See Also
Reference
Rhino.Geometry Namespace