RhinoCommon API
SimpleArrayClippingPlaneObjectPointer Class
 ON_SimpleArray of CRhinoClippingPlaneObject*
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArrayClippingPlaneObjectPointer : IDisposable
Public Class SimpleArrayClippingPlaneObjectPointer
	Implements IDisposable
The SimpleArrayClippingPlaneObjectPointer type exposes the following members.
Constructors
Name | Description
SimpleArrayClippingPlaneObjectPointer
 Initializes a new SimpleArrayClippingPlaneObjectPointer instance.
Top
Properties
Name | Description
Count
 Gets the amount of clipping planes in this array.
Top
Methods
Name | Description
Add
 Adds a clipping plane to the list.
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
Releases the unmanaged resources used by the SimpleArrayClippingPlaneObjectPointer and optionally releases the managed resources
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace