RhinoCommon API
PostEffectExecuteContexts Enumeration
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffectExecuteContexts"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum PostEffectExecuteContexts
Public Enumeration PostEffectExecuteContexts
Members
Member name | Value | Description
ProductionRendering | 0
RealtimeRendering | 1
ViewportDisplay | 2
ThumbnailCreation | 3
ConvertingToHDR | 4
See Also
Reference
Rhino.Render.PostEffects Namespace