RhinoCommon API
MeshingParameters Class
 Represents settings used for creating a mesh representation of a brep or surface.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.MeshingParameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class MeshingParameters : IDisposable,
	ISerializable, IEquatable<MeshingParameters>
<SerializableAttribute>
Public Class MeshingParameters
	Implements IDisposable, ISerializable, IEquatable(Of MeshingParameters)
The MeshingParameters type exposes the following members.
Constructors
Name | Description
MeshingParameters()
 Initializes a new instance with default values.
Initial values are same as Default.
MeshingParameters(Double)
 Initializes a new instance with simple values, similar to that of Rhino's meshing slider interface.
MeshingParameters(MeshingParameters)
 Initializes a new instance copying values from source.
Initial values are same as Default.
MeshingParameters(Double, Double)
 Initializes a new instance with simple values, similar to that of Rhino's meshing slider interface.
MeshingParameters(SerializationInfo, StreamingContext)
 Called by BinaryFormatter.Deserialize to create a new MeshParamaters object.
Top
Properties
Name | Description
ClosedObjectPostProcess
 Gets or sets a value indicating whether or not to post process non-closed meshes that should be closed. If the Brep being meshed is closed, JaggedSeams = false, and ClosedObjectPostProcess = true, and the resulting mesh is not closed, then a post meshing process is applied to find and close gaps in the mesh. Typically the resulting mesh is not closed because the input Brep has a geometric flaw, like loops in trimming curve.
Coarse |  Obsolete.
 Gets mesh creation parameters for coarse meshing.
This corresponds with the "Jagged and Faster" default in Rhino.
ComputeCurvature
 Gets or sets a value indicating whether or not surface curvature data will be embedded in the mesh.
Default
 Gets mesh creation parameters to create the default render mesh. Only use this if you plan on specifying your own custom meshing parameters.
DefaultAnalysisMesh
 Gets mesh creation parameters to create the default analysis mesh.
DoublePrecision
 Gets or sets a value indicating whether or not the mesh should have double precision vertices in addition to the floats.
FastRenderMesh
 Gets mesh creation parameters to create the a render mesh when meshing speed is preferred over mesh quality.
GridAmplification
 Gets or sets the grid amplification factor. Values lower than 1.0 will decrease the number of initial quads, values higher than 1.0 will increase the number of initial quads.
GridAngle
 Gets or sets the maximum allowed angle difference (in radians) for a single sampling quad. The angle pertains to the surface normals.
GridAspectRatio
 Gets or sets the maximum allowed aspect ratio of sampling quads.
GridMaxCount
 Gets or sets the maximum number of grid quads in the initial sampling grid.
GridMinCount
 Gets or sets the minimum number of grid quads in the initial sampling grid.
JaggedSeams
 Gets or sets whether or not the mesh is allowed to have jagged seams. When this flag is set to true, meshes on either side of a Brep Edge will not match up.
MaximumEdgeLength
 Gets or sets the maximum allowed mesh edge length.
Minimal
Gets minimal meshing parameters.
MinimumEdgeLength
 Gets or sets the minimum allowed mesh edge length.
MinimumTolerance
 Gets or sets the minimum tolerance.
QualityRenderMesh
 Gets mesh creation parameters to create the a render mesh when mesh quality is preferred over meshing speed.
RefineAngle
 Gets or sets the mesh parameter refine angle in radians.
RefineAngleInDegrees
 Gets or sets the mesh parameter refine angle in degrees.
RefineGrid
 Gets or sets a value indicating whether or not the sampling grid can be refined when certain tolerances are not met.
RelativeTolerance
 Gets or sets the relative tolerance.
SimplePlanes
 Gets or sets a value indicating whether or not planar areas are allowed to be meshed in a simplified manner.
Smooth |  Obsolete.
 Gets mesh creation parameters for smooth meshing.
This corresponds with the "Smooth and Slower" default in Rhino.
TextureRange
 Gets or sets how and if textures will be packed.
Tolerance
 Gets or sets the maximum allowed edge deviation. This tolerance is measured between the center of the mesh edge and the surface.
Top
Methods
Name | Description
CopyFrom
 Call this method to copy MeshingParameters from another instance.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
DocumentCurrentSetting
 Gets the MeshingParameters that are currently set for a document. These are the same settings that are shown in the DocumentProperties "mesh settings" user interface.
Equals(MeshingParameters)
 Determines whether the specified MeshingParameters has the same values as the present MeshingParameters.
Equals(Object)
 Determines whether the specified MeshingParameters has the same values as the present MeshingParameters.
 (Overrides Object.Equals(Object).)
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
FromEncodedString
 Converts encoded serialized string into a MeshingParameters
GetHashCode
 Computes a hash number that represents the current MeshingParameters.
 (Overrides Object.GetHashCode().)
GetObjectData
Populates a SerializationInfo with the data needed to serialize the target object.
SetSubDDisplayParameters
 Sets the SubD display parameters.
SubDDisplayParameters
 Gets the SubD display parameters.
ToEncodedString
 Returns a encoded string that represents the MeshingParameters.
Top
Operators
Name | Description
Equality
 Determines whether the two MeshingParameters have equal values.
Inequality
 Determines whether the two MeshingParameters do not have equal values.
Top
See Also
Reference
Rhino.Geometry Namespace