RhinoCommon API
DimensionStyle.TextLocation Enumeration
 The location of text in linear, angular, radial, and ordinate dimensions.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextLocation
Public Enumeration TextLocation
Members
Member name | Value | Description
AboveDimLine | 0 | Text is above dimension line.
InDimLine | 1 | Text is centered in dimension line.
BelowDimLine | 2 | Text is below dimension line.
See Also
Reference
Rhino.DocObjects Namespace