RhinoCommon API
FileDwgWriteOptions.ExportPolylineMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileDwgWriteOptions.ExportPolylineMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum ExportPolylineMode
Public Enumeration ExportPolylineMode
Members
Member name | Value | Description
Lines | 0
Polylines | 1
Splines | 2
ThreeDPolylines | 3
See Also
Reference
Rhino.FileIO Namespace