RhinoCommon API
ColorStop Structure
 Combination of a color and position. Used in defining gradient fills
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public struct ColorStop
Public Structure ColorStop
The ColorStop type exposes the following members.
Constructors
Name | Description
ColorStop
 Create color stop from a color and position
Top
Properties
Name | Description
Color
Position
 Parameter that Color is defined at
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace