RhinoCommon API
SubDComponentLocation Enumeration
 The ON_SubDComponentLocation enum is used when an ON_SubD component is referenced and it is important to distinguish between the component's location in the SubD control net and its location in the SubD limit surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SubDComponentLocation
Public Enumeration SubDComponentLocation
Members
Member name | Value | Description
Unset | 0 |  Not a valid component location and used to indicate the value is not initialized. Note well: This value is saved in 3dm archives and cannot be changed.
ControlNet | 1 |  The component's location in the SubD control net. Note well: This value is saved in 3dm archives and cannot be changed.
Surface | 2 |  The component's location in the SubD limit surface. Note well: This value is saved in 3dm archives and cannot be changed.
See Also
Reference
Rhino.Geometry Namespace