RhinoCommon API
ICommonComponentTable<T> Interface
 Provides methods to use all File3dm and RhinoDoc tables under the same contract. Do not derive from this interface. This is to ensure all tables can be used with the same method list.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface ICommonComponentTable<T> : IReadOnlyCollection<T>,
	IEnumerable<T>, IEnumerable, ICollection<T>
where T : ModelComponent
Public Interface ICommonComponentTable(Of T As ModelComponent)
	Inherits IReadOnlyCollection(Of T), IEnumerable(Of T), IEnumerable,
	ICollection(Of T)
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "T:Rhino.FileIO.ICommonComponentTable`1"]
The ICommonComponentTable<T> type exposes the following members.
Properties
Name | Description
ComponentType
 Returns the model component type the table handles.
Top
Methods
Name | Description
FindId
 Retrieves an object based on ID. You should prefer ID search over Index search.
FindNameHash
 Retrieves an object based on Name.
Top
See Also
Reference
Rhino.FileIO Namespace