RhinoCommon API
GetPolyline Class
 Use to interactively get a polyline.
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetPolyline
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GetPolyline : IDisposable
Public Class GetPolyline
	Implements IDisposable
The GetPolyline type exposes the following members.
Constructors
Name | Description
GetPolyline
Initializes a new instance of the GetPolyline class
Top
Properties
Name | Description
FirstPointPrompt
Prompt when getting first point
FourthPointPrompt
Prompt when getting fourth point
MaxPointCount
MinPointCount
SecondPointPrompt
Prompt when getting second point
ThirdPointPrompt
Prompt when getting third point
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Get
 Perform the 'get' operation.
SetFirstPoint
 Use SetFirstPoint to specify the line's starting point and skip the start point interactive picking
Top
See Also
Reference
Rhino.Input.Custom Namespace