RhinoCommon API
RenderPrimitive Class
[Missing <summary> documentation for "T:Rhino.Render.RenderPrimitive"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderPrimitive
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderPrimitive : IDisposable
Public Class RenderPrimitive
	Implements IDisposable
The RenderPrimitive type exposes the following members.
Properties
Name | Description
BoundingBox
 The bounding box for this primitive.
InstanceTransform
 Instance reference transform or Identity if not an instance reference.
PrimitiveType
 Call this before extracting meshes if you support render primitives to get the RenderPrimitiveType of this mesh then call the associated TryGetSphere(Sphere), TryGetPlane(PlaneSurface), TryGetCone(Cone, Plane), or TryGetBox(Box) method. Calling the Mesh() property will mesh the primitive and return a mesh always.
RenderMaterial
 The RenderMaterial associated with this mesh or null if there is not one.
RhinoObject
 The Rhino object associated with this render primitive.
Top
Methods
Name | Description
Dispose()
Releases all resources used by the RenderPrimitive
Dispose(Boolean)
Releases the unmanaged resources used by the RenderPrimitive and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
Mesh
 Returns the mesh associated with the object, this will mesh primitives and always return a mesh.
TryGetBox
 Call this method to get a Box primitive for this mesh. If this meshes PrimitiveType is not a Box then the box parameter is set to Empty.
TryGetCone
 Call this method to get a Cone primitive for this mesh. If this meshes PrimitiveType is not a Cone then the cone parameter is set to Unset and the truncation parameter is set to Unset.
TryGetPlane
 Call this method to get a Plane primitive for this mesh. If this meshes PrimitiveType is not a Plane then the plane parameter is set to null.
TryGetSphere
 Call this method to get a sphere primitive for this mesh. If this meshes PrimitiveType is not a Sphere then the sphere parameter is set to Unset.
Top
See Also
Reference
Rhino.Render Namespace