RhinoCommon API
ICollapsibleSection3 Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.ICollapsibleSection3"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface ICollapsibleSection3
Public Interface ICollapsibleSection3
The ICollapsibleSection3 type exposes the following members.
Methods
Name | Description
UpdateView
Top
See Also
Reference
Rhino.UI.Controls Namespace