RhinoCommon API
CullObjectEventArgs Class
[Missing <summary> documentation for "T:Rhino.Display.CullObjectEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.DrawEventArgs
 Rhino.Display.CullObjectEventArgs
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class CullObjectEventArgs : DrawEventArgs
Public Class CullObjectEventArgs
	Inherits DrawEventArgs
The CullObjectEventArgs type exposes the following members.
Properties
Name | Description
CullObject
RhinoObject
RhinoObjectSerialNumber
 Gets the rhino object runtime serial number.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace