RhinoCommon API
RenderPrimitiveType Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderPrimitiveType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public enum RenderPrimitiveType
Public Enumeration RenderPrimitiveType
Members
Member name | Value | Description
None | 0
Mesh | 1
Sphere | 2
Plane | 3
Box | 4
Cone | 5
See Also
Reference
Rhino.Render Namespace