RhinoCommon API
PageViewGroupTableEventType Enumeration
 PageViewGroupTable event types
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum PageViewGroupTableEventType
Public Enumeration PageViewGroupTableEventType
Members
Member name | Value | Description
Added | 0
Deleted | 1
Undeleted | 2
Modified | 3
Sorted | 4
See Also
Reference
Rhino.DocObjects.Tables Namespace