RhinoCommon API
PostEffectJob Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffectJob"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.PostEffectJob
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class PostEffectJob : IDisposable
Public MustInherit Class PostEffectJob
	Implements IDisposable
The PostEffectJob type exposes the following members.
Constructors
Name | Description
PostEffectJob
Initializes a new instance of the PostEffectJob class
Top
Methods
Name | Description
Clone
Dispose()
Releases all resources used by the PostEffectJob
Dispose(Boolean)
Releases the unmanaged resources used by the PostEffectJob and optionally releases the managed resources
Execute
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render.PostEffects Namespace