RhinoCommon API
RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs Class
[Missing <summary> documentation for "T:Rhino.Render.RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DisplayPipelineSettingsChangedEventArgs : EventArgs
Public Class DisplayPipelineSettingsChangedEventArgs
	Inherits EventArgs
The RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs type exposes the following members.
Constructors
Name | Description
RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs
Initializes a new instance of the RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs class
Top
Properties
Name | Description
Attributes
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace