RhinoCommon API
FileIgsWriteOptions.SolidsMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileIgsWriteOptions.SolidsMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum SolidsMode
Public Enumeration SolidsMode
Members
Member name | Value | Description
SldSeparate | 0
Sld184 | 184
SldManifoldBRep | 186
SldUnorderedGroup | 402
See Also
Reference
Rhino.FileIO Namespace