RhinoCommon API
MeshUnwrapMethod Enumeration
 Unwrapping method used
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum MeshUnwrapMethod
Public Enumeration MeshUnwrapMethod
Members
Member name | Value | Description
LSCM | 0 |  Least squares conformal map, Rhino 7 standard method
ABFPP | 1 |  ABF++, angle based flattening
ARAP | 2 |  ARAP, as rigid as possible
See Also
Reference
Rhino.Geometry Namespace