RhinoCommon API
Triangle3d Structure
 Represents a triangle, modeled using double three points that use double-precision floating point numbers.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public struct Triangle3d
Public Structure Triangle3d
The Triangle3d type exposes the following members.
Constructors
Name | Description
Triangle3d
 Instantiates a new triangle.
Top
Properties
Name | Description
A
 Gets the first triangle corner.
AB
 Gets the triangle edge connecting the A and B corners.
AltitudeA
 Gets the altitude line starting at corner A.
AltitudeB
 Gets the altitude line starting at corner B.
AltitudeC
 Gets the altitude line starting at corner C.
AngleA
 Gets the angle at the A corner.
AngleB
 Gets the angle at the B corner.
AngleC
 Gets the angle at the C corner.
Area
 Gets the area inside this triangle.
AreaCenter
 Gets the triangle area centroid.
B
 Gets the second triangle corner.
BC
 Gets the triangle edge connecting the B and C corners.
BoundingBox
 Gets the bounding box of this triangle.
C
 Gets the third triangle corner.
CA
 Gets the triangle edge connecting the C and A corners.
Circumcenter
 Gets the triangle circumcenter.
Circumcircle
 Gets the circumcircle of this triangle.
MedianA
 Gets the median line starting at corner A.
MedianB
 Gets the median line starting at corner B.
MedianC
 Gets the median line starting at corner C.
Orthocenter
 Gets the triangle orthocenter.
Perimeter
 Gets the perimeter of this triangle. This is the sum of the lengths of all edges.
PerpendicularAB
 Gets the perpendicular bisector for edge AB.
PerpendicularBC
 Gets the perpendicular bisector for edge BC.
PerpendicularCA
 Gets the perpendicular bisector for edge CA.
Top
Methods
Name | Description
BarycentricCoordsAt
 Gets the projection of a point onto the barycentric coordinates.
ClosestParameterOnBoundary
 Gets the parameter on the triangle boundary closest to a test point.
ClosestPointOnBoundary
 Gets the point on the triangle boundary closest to a test point.
PointAlongBoundary
 Gets the point along the boundary of the triangle. The triangle boundary has a domain [0, 3] where each subsequent unit domain maps to a different edge.
PointAtBarycentricCoords
 Gets a point within this triangle using barycentric coordinates.
PointOnInterior
 Gets the point on the triangle using the AB and AC primary axes.
ToMesh
 Create a mesh from this triangle.
ToPolyline
 Create a polyline from this triangle.
Transform
 Transform this triangle.
TrySmallestEnclosingTriangle
 Attempt to create the smallest triangle containing a set of planar points.
WithA
 Replace the A corner.
WithB
 Replace the B corner.
WithC
 Replace the C corner.
Top
See Also
Reference
Rhino.Geometry Namespace