RhinoCommon API
ContentCollectionIterator Class
 An iterator for the RenderContentCollection
Inheritance Hierarchy
System.Object
 Rhino.Render.ContentCollectionIterator
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class ContentCollectionIterator : IDisposable,
	IEnumerable<RenderContent>, IEnumerable
Public NotInheritable Class ContentCollectionIterator
	Implements IDisposable, IEnumerable(Of RenderContent),
	IEnumerable
The ContentCollectionIterator type exposes the following members.
Constructors
Name | Description
ContentCollectionIterator
Initializes a new instance of the ContentCollectionIterator class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
DeleteThis |  Obsolete.
Dispose
Releases all resources used by the ContentCollectionIterator
Finalize
 Finalizer
 (Overrides Object.Finalize().)
First
GetEnumerator
 Enumerates the contents, rewinding the iterator to the beginning first. This makes it possible to use the iterator in a foreach loop or with LINQ instead of manually calling First() and Next(). The iterator itself is not disposed by enumerating it, so it should still be wrapped in a 'using' statement, or the whole RenderContentCollection can be enumerated directly instead.
Next
Top
See Also
Reference
Rhino.Render Namespace