RhinoCommon API
LinetypeTableEventArgs Class
 LinetypeTable event arguments
Since: 8.0
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.Tables.LinetypeTableEventArgs
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class LinetypeTableEventArgs : EventArgs
Public Class LinetypeTableEventArgs
	Inherits EventArgs
The LinetypeTableEventArgs type exposes the following members.
Properties
Name | Description
Document
 The document in which the event occurred.
EventType
 The event type.
LinetypeIndex
 Index of the linetype.
NewState
 The new state.
OldState
 The old state.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace