RhinoCommon API
SubDTextureCoordinateType Enumeration
 ON_SubDTextureCoordinateType identifies the way ON_SubDMeshFragment texture coordinates are set from an ON_SubDFace.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SubDTextureCoordinateType
Public Enumeration SubDTextureCoordinateType
Members
Member name | Value | Description
Unset | 0 |  Texture domains are not set.
Unpacked | 1 |  Each SubDFace uses the unit square in texture space.
Packed | 2 |  The face's pack rect is used to set fragment texture coordinates. When possible, adjacent quads with the same ON_SubDFace::PackId() value are assigned adjacent rectangles in texture space.
Zero | 3 |  All ON_SubDMeshFragment texture coordinate values are zero.
Nan | 4 |  All ON_SubDMeshFragment texture coordinate values are ON_DBL_QNAN.
FromFaceTexturePoints | 6 |  All ON_SubDMeshFragment texture coordinate values are set by barycentric interpolation of ON_SubDFace.TexturePoint() values.
FromMapping | 7 |  Texture coordinates are set from an ON_TextureMapping and transformation specified by ON_SubD::TextureMappingTag(). In all other cases, ON_SubD::TextureMappingTag() can be set, but is ignored.
See Also
Reference
Rhino.Geometry Namespace