RhinoCommon API
UserInterfaceIcon Class
[Missing <summary> documentation for "T:Rhino.UI.UserInterfaceIcon"]
Inheritance Hierarchy
System.Object
 Rhino.UI.UserInterfaceObjectBase
 Rhino.UI.UserInterfaceControl
 Rhino.UI.UserInterfaceIcon
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class UserInterfaceIcon : UserInterfaceControl
Public Class UserInterfaceIcon
	Inherits UserInterfaceControl
The UserInterfaceIcon type exposes the following members.
Constructors
Name | Description
UserInterfaceIcon
Initializes a new instance of the UserInterfaceIcon class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace