RhinoCommon API
MeshFaceNormalList Class
 Provides access to the Face normals of a Mesh.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.MeshFaceNormalList
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MeshFaceNormalList : IResizableList<Vector3f>,
	IList<Vector3f>, ICollection<Vector3f>, IEnumerable<Vector3f>,
	IEnumerable, IList, ICollection, IReadOnlyList<Vector3f>,
	IReadOnlyCollection<Vector3f>
Public Class MeshFaceNormalList
	Implements IResizableList(Of Vector3f), IList(Of Vector3f),
	ICollection(Of Vector3f), IEnumerable(Of Vector3f), IEnumerable,
	IList, ICollection, IReadOnlyList(Of Vector3f), IReadOnlyCollection(Of Vector3f)
The MeshFaceNormalList type exposes the following members.
Properties
Name | Description
Capacity
 Gets or sets the total number of face normals the internal data structure can hold without resizing.
Count
 Gets or sets the number of mesh face normals.
Item
 Gets or sets the face normal at the given face index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
Methods
Name | Description
AddFaceNormal(Vector3d)
 Appends a face normal to the list of mesh face normals.
AddFaceNormal(Vector3f)
 Appends a face normal to the list of mesh face normals.
AddFaceNormal(Double, Double, Double)
 Appends a face normal to the list of mesh face normals.
AddFaceNormal(Single, Single, Single)
 Appends a face normal to the list of mesh face normals.
Clear
 Clears the Face Normal list on the mesh.
ComputeFaceNormals
 Computes all the face normals for this mesh based on the physical shape of the mesh.
Destroy
 Releases all memory allocated to store face normals. The list capacity will be 0 after this call.
Subsequent calls can add new items.
GetEnumerator
 Gets an enumerator that yields all normals (vectors) in this collection.
SetFaceNormal(Int32, Vector3d)
 Sets a face normal vector at an index using a single-precision vector.
SetFaceNormal(Int32, Vector3f)
 Sets a face normal vector at an index using a single-precision vector.
SetFaceNormal(Int32, Double, Double, Double)
 Sets a face normal vector at an index using three double-precision numbers.
SetFaceNormal(Int32, Single, Single, Single)
 Sets a face normal vector at an index using three single-precision numbers.
UnitizeFaceNormals
 Unitizes all the existing face normals.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace