RhinoCommon API
RdkModalEditContentBucket Class
Note: This API is now obsolete.
[Missing <summary> documentation for "T:Rhino.Render.DataSources.RdkModalEditContentBucket"]
Inheritance Hierarchy
System.Object
 Rhino.Render.DataSources.RdkModalEditContentBucket
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("RdkModalEditContentBucket is obsolete", false)]
public class RdkModalEditContentBucket : IDisposable
<ObsoleteAttribute("RdkModalEditContentBucket is obsolete", false)>
Public Class RdkModalEditContentBucket
	Implements IDisposable
The RdkModalEditContentBucket type exposes the following members.
Constructors
Name | Description
RdkModalEditContentBucket
Initializes a new instance of the RdkModalEditContentBucket class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
ContentsIn
Dispose
Releases all resources used by the RdkModalEditContentBucket
Finalize |  (Overrides Object.Finalize().)
SetContentsOut
Top
See Also
Reference
Rhino.Render.DataSources Namespace