RhinoCommon API
MarkupTableEventType Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.MarkupTableEventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum MarkupTableEventType
Public Enumeration MarkupTableEventType
Members
Member name | Value | Description
Added | 0 |  A markup was added to the document's markup table.
Deleted | 1 |  A markup in the document's markup table was deleted.
Undeleted | 2 |  A markup in the document's markup table was undeleted.
Modified | 3 |  A markup in the document's markup table was modified.
Sorted | 4 |  The document's markup table was sorted.
See Also
Reference
Rhino.DocObjects.Tables Namespace