RhinoCommon API
HistoryRecord Class
 Provides a single bundling of information to be passed to Rhino when setting up history for an object.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.HistoryRecord
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class HistoryRecord : IDisposable
Public Class HistoryRecord
	Implements IDisposable
The HistoryRecord type exposes the following members.
Constructors
Name | Description
HistoryRecord
Initializes a new instance of the HistoryRecord class
Top
Properties
Name | Description
CopyOnReplaceObject
 When an object is replaced and the old object has a history record with this field set, the history record is copied and attached to the new object. That allows a descendant object to continue the history linkage after it is edited.
Handle
 Wrapped native C++ pointer to CRhinoHistory instance
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
SetBool
SetBools
SetBrep
SetColor
SetColors
SetCurve
SetDouble
SetDoubles
SetGuid
SetGuids
SetHistoryVersion
 Specifies a non-zero integer that identifies the version of this history record. The virtual ReplayHistory() functions can check this version to avoid replaying history using information created by earlier versions of the command.
SetInt
SetInts
SetMesh
SetObjRef
SetPoint3d
SetPoint3dOnObject
SetPoint3ds
SetString
SetStrings
SetSurface
SetTransorm
SetVector3d
SetVector3ds
Top
Remarks
To use this object, just pass it to a RhinoDoc.Add() method along with the needed geometry. Do not reuse this class for more than one history addition.
See Also
Reference
Rhino.DocObjects Namespace