RhinoCommon API
DoubleField Class
 double field value class
Inheritance Hierarchy
System.Object
 Rhino.Render.Fields.Field
 Rhino.Render.Fields.DoubleField
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DoubleField : Field
Public Class DoubleField
	Inherits Field
The DoubleField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
Rhino.Render.Fields Namespace