RhinoCommon API
DisplayPipelineAttributes.LockedObjectUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.LockedObjectUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public enum LockedObjectUse
Public Enumeration LockedObjectUse
Members
Member name | Value | Description
UseObjectAttributes | 0 |  Uses the object's specified attributes.
SpecifyColor | 1 |  Use specified lock color
UseAppSettings | 2 |  Use settings specified in Appearance: Colors Options.
See Also
Reference
Rhino.Display Namespace