RhinoCommon API
ViewCaptureWriter.VectorPointProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.VectorPointProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void VectorPointProc(
	int style,
	float screenX,
	float screenY,
	int fillArgb,
	int strokeArgb,
	float diameterPixels,
	float innerDiameterPixels,
	float strokeWidthPixels,
	float rotationRadians
)
Public Delegate Sub VectorPointProc (
	style As Integer,
	screenX As Single,
	screenY As Single,
	fillArgb As Integer,
	strokeArgb As Integer,
	diameterPixels As Single,
	innerDiameterPixels As Single,
	strokeWidthPixels As Single,
	rotationRadians As Single
)
Parameters
style
Type: System.Int32
screenX
Type: System.Single
screenY
Type: System.Single
fillArgb
Type: System.Int32
strokeArgb
Type: System.Int32
diameterPixels
Type: System.Single
innerDiameterPixels
Type: System.Single
strokeWidthPixels
Type: System.Single
rotationRadians
Type: System.Single
See Also
Reference
Rhino.Runtime Namespace