RhinoCommon API
File3dmThickening Class
 Represents the thickening attached to file3dm object attributes.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmThickening
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmThickening
Public Class File3dmThickening
The File3dmThickening type exposes the following members.
Properties
Name | Description
BothSides
 Specifies whether to thicken to both sides of the surface.
Distance
 Specifies how thick meshes will be made.
OffsetOnly
 Specifies whether to only offset the original surface.
On
 Specifies whether the feature is enabled or not.
Solid
 Specifies whether to make open meshes solid by adding walls when thickening.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace