RhinoCommon API
CustomPostEffectAttribute Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.CustomPostEffectAttribute"]
Inheritance Hierarchy
System.Object
 System.Attribute
 Rhino.Render.PostEffects.CustomPostEffectAttribute
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class CustomPostEffectAttribute : Attribute
Public NotInheritable Class CustomPostEffectAttribute
	Inherits Attribute
The CustomPostEffectAttribute type exposes the following members.
Constructors
Name | Description
CustomPostEffectAttribute
Initializes a new instance of the CustomPostEffectAttribute class
Top
Properties
Name | Description
CanDisplayHelp
ExecuteWhileRenderingDelay
ExecuteWhileRenderingOption
Name
PostEffectType
Styles
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render.PostEffects Namespace