RhinoCommon API
FileReferenceStatus Enumeration
Enumerates a list of file statuses.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum FileReferenceStatus
Public Enumeration FileReferenceStatus
Members
Member name | Value | Description
Unknown | 0 |  Status of a the full path is not known.
FullPathValid | 1 |  Full path is valid.
FileNotFound | 2 |  Unable to locate file.
See Also
Reference
Rhino.FileIO Namespace