RhinoCommon API
AddCustomUISectionsEventArgs Class
 Used as Rhino.Render Custom Events args.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.AddCustomUISectionsEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class AddCustomUISectionsEventArgs : EventArgs
Public Class AddCustomUISectionsEventArgs
	Inherits EventArgs
The AddCustomUISectionsEventArgs type exposes the following members.
Properties
Name | Description
EventType
 The type of the event.
ExpandableContentUI
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace