RhinoCommon API
IRhinoUiDialogService Interface
 Used by Rhino.UI.Dialogs to access generic Eto dialogs from Rhino Common
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IRhinoUiDialogService
Public Interface IRhinoUiDialogService
The IRhinoUiDialogService type exposes the following members.
Methods
Name | Description
DetectColorScheme
IconFromResourceId
SetToDefaultColorScheme
ShowCheckListBox
ShowComboListBox
ShowEditBox
ShowLineTypes(String, String, RhinoDoc)
ShowLineTypes(String, String, RhinoDoc, Guid)
ShowListBox
ShowMultiListBox
ShowNumberBox
ShowPopupMenu
ShowPrintWidths(String, String)
ShowPrintWidths(String, String, Double)
ShowPropertyListBox(String, String, List<KeyValuePair<String, String>>)
ShowPropertyListBox(String, String, IList, IList<String>)
Top
See Also
Reference
Rhino.UI Namespace