RhinoCommon API
MiddleMouseMode Enumeration
 Defines enumerated constant values to define what happens when either the middle mouse button on a three-button mouse is clicked or after pressing the wheel on a wheeled mouse.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum MiddleMouseMode
Public Enumeration MiddleMouseMode
Members
Member name | Value | Description
PopupMenu | 0 | Pops up two-part menu at the cursor location. You can list your favorite commands in the top section. The bottom section is the list of most recent commands used.
PopupToolbar | 1 |  Choose a toolbar to pop up at the cursor location. Create a toolbar containing your favorite commands or object snaps to use as a pop-up toolbar.
RunMacro | 2 |  Lists a series of commands that run when you click the middle mouse button.
See Also
Reference
Rhino.ApplicationSettings Namespace