RhinoCommon API
Environment Class
 Represents an environment.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.Environment
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Environment : CommonObject
Public Class Environment
	Inherits CommonObject
The Environment type exposes the following members.
Constructors
Name | Description
Environment
 Initializes a new environment.
Top
Properties
Name | Description
BackgroundColor
Return Value
Type:
The background color.
BackgroundImage
Return Value
Type:
The background image texture.
BackgroundProjection
Return Value
Type:
The background projection.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace