RhinoCommon API
DisplayRenderSettings Class
 ChangeQueue DisplayRenderSettings
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.DisplayRenderSettings
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DisplayRenderSettings
Public Class DisplayRenderSettings
The DisplayRenderSettings type exposes the following members.
Properties
Name | Description
CullBackFaces
 True if backfaces should be culled
ForceFlatShading
 True if flat shading is forced
SceneLightingOn
 True if scene lighting is enabled
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render.ChangeQueue Namespace