RhinoCommon API
RenderPlugInList Class
[Missing <summary> documentation for "T:Rhino.Render.RenderPlugInList"]
Inheritance Hierarchy
System.Object
 System.Collections.Generic.List<RenderPlugInInfo>
 Rhino.Render.RenderPlugInList
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderPlugInList : List<RenderPlugInInfo>
Public Class RenderPlugInList
	Inherits List(Of RenderPlugInInfo)
The RenderPlugInList type exposes the following members.
Constructors
Name | Description
RenderPlugInList
Initializes a new instance of the RenderPlugInList class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace