RhinoCommon API
SubDEdgeList Class
 All edges in a SubD
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.SubDEdgeList
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SubDEdgeList : IEnumerable<SubDEdge>,
	IEnumerable
Public Class SubDEdgeList
	Implements IEnumerable(Of SubDEdge), IEnumerable
The SubDEdgeList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of SubD edges.
Top
Methods
Name | Description
Add
 Add a new edge to the list.
Find(Int32)
 Find an edge in this SubD with a given id
Find(UInt32)
 Find an edge in this SubD with a given id
FindOrAdd
 Gets the edge between two vertices, adding a smooth edge if there is not one yet.
GetEnumerator
 Implementation of IEnumerable
SetEdgeTags(IEnumerable<SubDEdge>, SubDEdgeTag)
 Set edge tags for a list of edges. Useful for adding creases to SubDs
SetEdgeTags(IEnumerable<Int32>, SubDEdgeTag)
 Set edge tags for a list of edges. Useful for adding creases to SubDs
Top
See Also
Reference
Rhino.Geometry.Collections Namespace