RhinoCommon API
DisplayPipelineAttributes Class
 Represents display pipeline settings, such as "show transparency" and "show grips".
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayPipelineAttributes
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class DisplayPipelineAttributes : IDisposable,
	ISerializable
<SerializableAttribute>
Public Class DisplayPipelineAttributes
	Implements IDisposable, ISerializable
The DisplayPipelineAttributes type exposes the following members.
Constructors
Name | Description
DisplayPipelineAttributes
Initializes a new instance of the DisplayPipelineAttributes class
Top
Properties
Name | Description
AmbientLightingColor
AxesSizePercentage
 Size of axes as a percentage of the grid extents.
BackfaceDisplayStyle
 Changes the display of the backfaces (the side opposite of the surface normal direction).
BackMaterial
 The material used to shade the back faces of an object.
BackMaterialDiffuseColor
BackMaterialShine
 Get or set the back material shine (0 to Rhino.DocObjects.Material.MaxShine). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.
BackMaterialTransparency
 Get or set the back material transparency (0.0 opaque to 1.0 transparent). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.
BackOverrideObjectReflectivity
 Objects acquire reflectivity from render materials.
BackOverrideObjectTransparency
 Objects acquire transparency from render materials.
BakeTextures
 Adds the ability to display procedural textures in viewports. When it is turned off, procedural textures in viewports look different from the rendering.
BoundingBoxMode
CastShadows
Cast shadows.
ClippingEdgeColor
 Clipping edge color
ClippingEdgeColorUsage
 Specifies how the color for the Edges is determined
ClippingEdgeThickness
 Edge thickness in pixels.
ClippingFillColor
 Clipping plane fill color
ClippingPlaneFillColorUsage
 Specifies how the color for the clipping plane object fill is determined.
ClippingShadeColor
 Clipping plane solid color
ClippingShadeColorUsage
 Specifies how to shade the clipping plane
ClippingShadeSelectedPlane
 Shades the selected clipping plane.
ClippingShadeTransparency
 Specifies the clipping plane transparency percentage.
ClipSelectionHighlight
 Clips the highlight wires. Shaded selections always clip.
ContextForDraw
ControlPolygonColor
 Control polygon color
ControlPolygonGripSize
 The control point size in pixels.
ControlPolygonHighlight
 Highlights the segments of the control polygon on either side of the control points.
ControlPolygonShow
 Shows the control polygon and only shows the control points.
ControlPolygonShowPoints
 Shows the control points while the control polygon is displayed.
ControlPolygonShowSurface
 Shows the object while the control polygon is displayed.
ControlPolygonStyle
 PointStyle for the control polygon. Supported values are ControlPoint, RoundControlPoint, VariableDot, and RoundDot
ControlPolygonUseFixedSingleColor
 Specifies a color for the control polygon.
ControlPolygonUseSolidLines
 Use dotted / solid lines
ControlPolygonWireThickness
 The width of the control polygon lines in pixels.
CullBackfaces
CurveColor
Color used for drawing curves
CurveThickness
Pixel thickness for curves
CurveThicknessScale
 Scale thickness for curves
CurveThicknessUsage
 Use a pixel thickness (CurveThickness) or a scale thickness (CurveThicknessScale)
CustomGroundPlaneAltitude
 Height above the world XY plane in model units
CustomGroundPlaneAutomaticAltitude
 Turns on auto-elevation that moves Ground Plane to the lowest point of the objects in the model.
CustomGroundPlaneOn
 Turn the custom ground plane on or off
CustomGroundPlaneShadowOnly
 Makes the ground plane transparent, but allows shadows to still be cast on it.
DisableConduits
DisableTransparency
DynamicDisplayUsage
 Sets the appearance of objects in the display
EnglishName
FillMode
 Get or set the frame buffer fill mode.
FrontDiffuse
 Shades the current viewport with no smoothing so the individual render mesh faces are visible.
FrontFlatShaded
 Shades the current viewport with no smoothing so the individual render mesh faces are visible.
FrontMaterial
 The material used to shade the front faces of an object. The Front* properties on this class are shortcuts into it.
FrontMaterialShine
 Get or set the front material shine (0 to Rhino.DocObjects.Material.MaxShine). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.
FrontMaterialTransparency
 Get or set the front material transparency (0.0 opaque to 1.0 transparent). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.
FrontOverrideObjectColor
FrontOverrideObjectReflectivity
 Objects acquire reflectivity from render materials.
FrontOverrideObjectTransparency
 Objects acquire transparency from render materials.
GhostLockedObjects
 Set locked appearance
GridPlaneColor
 The color of the grid plane
GridPlaneTransparency
 Transparency of the grid plane, percentage (0-100)
GridPlaneVisibility
 Set when to show the grid plane
GridTransparency
 Transparency of the grid, percentage (0-100)
GroundPlaneUsage
 Turn on or off custom Ground plane settungs
HighlightSurfaces
 Shades entire object with highlight color.
HonorDrawOrder
 Draw order support for this display mode. When true (the default), objects with a non-zero draw order are drawn in front of or behind other objects based on that draw order. When false, this display mode ignores per object draw order and draws everything in the standard order.
Id
IgnoreHighlights
LayersFollowLockUsage
 Applies the settings for locked objects to locked layers.
LightingScheme
LinearWorkflowUsage
 Turn on or off custom linear workflow settings
LocalName
LockedColor
 Locked Object Color
LockedObjectsDrawBehindOthers
Locked object are drawn behind other objects
LockedObjectTransparency
 LockedObjectTransparency.
LockedObjectUsage
 Set asource of display attributes for locked objects
MeshEdgeColor
 Sets the mesh edge color
MeshEdgeColorReduction
 The darken percentage of the color
MeshEdgeThickness
 Mesh edge width in pixels
MeshNakedEdgeColor
 Sets the naked edge color
MeshNakedEdgeColorReduction
 The darken percentage of the color
MeshNakedEdgeThickness
 Naked mesh edge width in pixels.}
MeshNonmanifoldEdgeColor
 Sets the nonmanifold edge color
MeshNonmanifoldEdgeColorReduction
 The darken percentage of the color
MeshNonmanifoldEdgeThickness
 Non-manifold mesh edge width in pixels
MeshSpecificAttributes
MeshVertexSize
 Mesh vertex size in pixels
ObjectColor
PlaneUsesGridColor
 If true, use the grid thin line color in App settings
PointCloudRadius
PointCloudStyle
PointRadius
PointStyle
PostProcessFrameBuffer
 Linear workflow Adjust output image
PostProcessGamma
 Linear workflow Output image gamma
PreProcessColors
 Linear workflow input colors
PreProcessGamma
 Linear workflow input gamma
PreProcessTextures
 Linear workflow input textures
RealtimeDisplayId
 Get the ID of the real-time display engine attached to the view. This will be Guid.Empty if no real-time display engine is in use. This can be the case for instance when starting a _Render session for a real-time viewport integration. That still would cause this ID to be Guid.Empty.
RealtimeRenderPasses
 Get or set the real-time passes amount
ShadeVertexColors
Shade using vertex colors.
ShadingEnabled
Draw shaded meshes and surfaces
ShadowBiasX
 ShadowBiasX (Self shadowing artifacts) from 0 (dirty) to 50 (cleaner).
ShadowClippingRadius
 Camera-based shadow clipping radius
ShadowColor
ShadowEdgeBlur
 Set blurring from 0 (no blurring) to 16 (maximum blurring)
ShadowIntensity
 Shadow intensity (percentage 0-100)
ShadowMemoryUsage
 Value from 1 to 16384 indicating how much memory is to be allocated. Actual memory use is ShadowMemoryUsage*ShadowMemoryUsage*4.
ShadowsIgnoreUserDefinedClippingPlanes
 If true, shadows ignore user-defined clipping planes
ShadowSoftEdgeQuality
 Soft edge quality, from 0 (none/faster) to 12 (softer/slower)
ShadowsOn
 Enable shadows
ShadowTransparencyTolerance
 Transparency tolerance from 0 (never cast shadows) to 100 (always case shadows)
ShowAnnotations
Show annotations.
ShowClipIntersectionEdges
Show edges and hatches where clipping planes clip objects
ShowClipIntersectionSurfaces
Show fills where clipping planes clip solid objects
ShowClippingEdges
 Shows the edges between the clipping plane and clipped objects.
ShowClippingFills
 When a clipping plane intersects a 3-D object and the section is closed, the section is filled.
ShowClippingPlanes
Show clipping planes.
ShowCreases
ShowCurves
Draw curves
ShowEdges
ShowGrips
ShowHiddenLines
ShowIntersections
ShowIsoCurves
Draw surface ISO curves.
ShowLighting
ShowLights
Show light widgets.
ShowMeshEdges
 Display mesh edges on/off
ShowMeshNakedEdges
 Display mesh naked edges on/off
ShowMeshNonmanifoldEdges
 Display mesh manifold edges on/off
ShowPointClouds
Show point clouds.
ShowPoints
Show points.
ShowRealtimeRenderProgressBar
 Get or set whether the display is used for preview rendering or not.
ShowSeams
ShowSilhouttes
ShowSubDBoundary
 Set visibility of SubD naked edges.
ShowSubDCreases
 Set visibility of SubD creased edges.
ShowSubDEdges
 Set visibility of SubD smooth edges.
ShowSubDNonmanifoldEdges
 Turn on/off color differentiation of SubD symmetry children.
ShowSubDReflectionPlanePreview
ShowSurfaceEdge
 Turn Surface Edge visibility on or off
ShowSurfaceEdges
Show surface edges.
ShowSurfaceNakedEdge
 Turn Surface Naked Edge visibility on or off
ShowTangentEdges
Show tangent edges.
ShowTangentSeams
Show tangent seams.
ShowText
Show text.
SkylightShadowQuality
 Skylight shadow quality, from 0 (lowest) to 8 (highest)
StereoContext
 Get or set the stereo render context.
SubDBoundaryApplyPattern
 Apply pattern to the edge
SubDBoundaryColorReduction
 Color reduction percentage
SubDBoundaryEdgeColor
 Edge color
SubDBoundaryEdgeColorUsage
 Edge color usage
SubDBoundaryEdgeThickness
 Edge thickness (pixels).
SubDBoundaryThicknessScale
 Edge thickness scale
SubDBoundaryThicknessUsage
SubDCreaseInteriorApplyPattern
 Apply pattern to the edge
SubDCreaseInteriorColorReduction
 Color reduction percentage
SubDCreaseInteriorEdgeColor
 Edge color
SubDCreaseInteriorEdgeColorUsage
 Edge color usage
SubDCreaseInteriorEdgeThickness
 Edge thickness (pixels).
SubDCreaseInteriorThicknessScale
 Edge thickness scale
SubDCreaseInteriorThicknessUsage
SubDNonManifoldApplyPattern
 Apply pattern to the edge
SubDNonManifoldColorReduction
 Color reduction percentage
SubDNonManifoldEdgeColor
 Edge color
SubDNonManifoldEdgeColorUsage
 Edge color usage
SubDNonManifoldEdgeThickness
 Edge thickness (pixels).
SubDNonManifoldThicknessScale
 Edge thickness scale
SubDNonManifoldThicknessUsage
SubDReflectionAxisLineColor
 Reflection axis line color
SubDReflectionAxisLineThickness
SubDReflectionPlaneAxisLineOn
 Apply Turnh on or off the reflection plane axis line
SubDReflectionPlaneColor
 Reflection plane color
SubDReflectionPlaneColorReduction
 SubD replection plane color reduction percentage
SubDReflectionPlaneColorUsage
 SubD replection plane color use
SubDSmoothInteriorApplyPattern
 Apply pattern to the edge
SubDSmoothInteriorColorReduction
 Color reduction percentage
SubDSmoothInteriorEdgeColor
 Edge color
SubDSmoothInteriorEdgeColorUsage
 Edge color usage
SubDSmoothInteriorEdgeThickness
 Edge thickness (pixels).
SubDSmoothInteriorThicknessScale
 Edge thickness scale
SubDSmoothInteriorThicknessUsage
SubDThicknessUsage
 Thickness usage, pixel thickness or a scale thickness
SurfaceEdgeApplyPattern
 Turn pattern application on or off
SurfaceEdgeColor
SurfaceEdgeColorReduction
SurfaceEdgeColorUsage
SurfaceEdgeThickness
 Thickness for surface edges
SurfaceEdgeThicknessScale
SurfaceIsoColorsUsed
SurfaceIsoShowForFlatFaces
SurfaceIsoSingleColor
SurfaceIsoThickness
SurfaceIsoThicknessUScale
SurfaceIsoThicknessUsed
SurfaceIsoThicknessVScale
SurfaceIsoThicknessWScale
SurfaceIsoUColor
SurfaceIsoUThickness
SurfaceIsoUVColor
SurfaceIsoVColor
SurfaceIsoVThickness
SurfaceNakedAdgeColorReduction
SurfaceNakedEdgeApplyPattern
 Turn pattern application on or off
SurfaceNakedEdgeColor
SurfaceNakedEdgeColorUsage
SurfaceNakedEdgeThickness
SurfaceNakedEdgeThicknessScale
UseAssignedObjectMaterial
 Gets or sets whether objects ought to be drawn using their assigned rendering material.
UseBackfaceMaterial
 Use the backface material for displaying backfaces.
UseCustomBackface
 Use a custom material for displaying backfaces.
UseCustomObjectColor
 Gets or sets whether objects ought to be drawn using a custom color.
UseCustomObjectColorBackfaces
 Gets or sets whether objects ought to be drawn using a custom color for back faces.
UseCustomObjectMaterial
 Gets or sets whether objects ought to be drawn using a custom material.
UseCustomObjectMaterialBackfaces
 Gets or sets whether objects ought to be drawn using a custom material on backfaces.
UseLightColor
 Draw lights using light color
UseObjectBackfaceMaterial
 Use the backface material of the object for displaying its backfaces.
UseSectionStyles
 When enabled, the appearances of clipping fills and edges are based on objects' section style properties.
UseSingleCurveColor
 Use a single color for drawing curves
ViewSpecificAttributes
WeightedPointStyle
 Style used to draw control points whose weight is not 1. Defaults to RoundControlPoint, matching the default control point style, so weighted control points are not called out until this is changed.
WorldAxesIconColorUsage
XrayAllObjects
Top
Methods
Name | Description
Dispose()
Releases all resources used by the DisplayPipelineAttributes
Dispose(Boolean)
Releases the unmanaged resources used by the DisplayPipelineAttributes and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
GetColorFadeEffect
 Get the current color fade effect data.
GetDiagonalHatchEffect
 Get the current diagonal hatch strength and width in pixels.
GetDitherTransparencyEffect
 Get the current dither transparency amount.
GetFill
 Get fill colors used for clearing the frame buffer
GetObjectData
GetSurfaceEdgeThicknessUsage
 Helper function for setting the SurfaceEdgeThicknessFlags
GetSurfaceIsoApplyPattern
GetSurfaceIsoColorUsage
 Helper function for getting SurfaceIsoColorsUsed and SurfaceSingleIsoColor
GetSurfaceIsoThicknessUsage
 This is a helper function that combines getting IsoThicknessUsed and SurfaceNakedEdgeThicknessUsageFlags settings to correspond to the behavor of the Settings page.
GetSurfaceNakedEdgeThicknessUsage
 This is a helper function that combines getting SurfaceNakeEdgeUseNormalThickness and SurfaceNakedEdgeThicknessUsageFlags settings to correspond to the behavor of the Settings page.
HasColorFadeEffect
 Returns TRUE if there is a color fade effect enabled with a color fade effect amount larger than 0.0, FALSE otherwise.
HasDiagonalHatchEffect
 Returns TRUE if there is a diagonal hatch effect enabled with a hatch strength larger than 0.0, FALSE otherwise.
HasDitherTransparencyEffect
 Returns TRUE if there is a dither transparency effect enabled with a transparency amount larger than 0.0, FALSE otherwise.
SetColorFadeEffect
 Set a color fade effect to make objects fade a given amount towards a given color.
SetDiagonalHatchEffect
 Set a diagonal hatch effect to make objects render with diagonal hatch with a given strength and width in pixels. The effect works by brightening and darkening pixels in a diagonal pattern.
SetDitherTransparencyEffect
 Set a dither transparency effect to make objects render with a given amount of transparency using a dither effect.
SetFill(Color)
 Set fill mode to solid color and set the fill color
SetFill(Color, Color)
 Set fill mode to two color and set the colors
SetFill(Color, Color, Color, Color)
 Set the fill mode to four color gradient and set the colors
SetSurfaceEdgeThicknessUsage
 Helper function for getting the SurfaceEdgeThicknessFlags
SetSurfaceIsoApplyPattern
SetSurfaceIsoColorUsage
 Helper function for setting SurfaceIsoColorsUsed and SurfaceIsoSingleColor
SetSurfaceIsoThicknessUsage
 This is a helper function that combines setting IsoThicknessUsed and SurfaceNakedEdgeThicknessUsageFlags settings to correspond to the behavor of the Settings page.
SetSurfaceNakedEdgeThicknessUsage
 This is a helper function that combines setting SurfaceNakeEdgeUseNormalThickness and SurfaceNakedEdgeThicknessUsageFlags settings to correspond to the behavor of the Settings page.
Top
See Also
Reference
Rhino.Display Namespace