RhinoCommon API
FileDwgWriteOptions.ColorMethodType Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileDwgWriteOptions.ColorMethodType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum ColorMethodType
Public Enumeration ColorMethodType
Members
Member name | Value | Description
ACI | 0
RGB | 1
See Also
Reference
Rhino.FileIO Namespace