RhinoCommon API
FileVdaWriteOptions Class
 Options for writing a Vda file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileVdaWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileVdaWriteOptions
Public Class FileVdaWriteOptions
The FileVdaWriteOptions type exposes the following members.
Constructors
Name | Description
FileVdaWriteOptions
Initializes a new instance of the FileVdaWriteOptions class
Top
Properties
Name | Description
Address
CompanyName
Confidentiality
DateEffective
ObjectCode
PointDeviationHairsAsMDI
ProjectName
ReceivingDepartment
SendersName
SendingCompany
TelephoneNumber
Variant
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace