RhinoCommon API
DepthMode Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DepthMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum DepthMode
Public Enumeration DepthMode
Members
Member name | Value | Description
Neutral | 0
AlwaysInFront | 1
AlwaysInBack | 2
See Also
Reference
Rhino.Display Namespace