RhinoCommon API
EdgeAnalysisSettingsState Class
Represents a snapshot of EdgeAnalysisSettings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.EdgeAnalysisSettingsState
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class EdgeAnalysisSettingsState
Public Class EdgeAnalysisSettingsState
The EdgeAnalysisSettingsState type exposes the following members.
Properties
Name | Description
ShowEdgeColor
 Gets or sets a color used to enhance display edges in commands like _ShowEdges and _ShowNakedEdges.
ShowEdges
 Gets or sets a value referring to the group of edges that are targeted.
0 = all.
1 = naked.
2 = non-manifold.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace