RhinoCommon API
ChainDirection Enumeration
 Which way to search along a chain from the current link.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ChainDirection
Public Enumeration ChainDirection
Members
Member name | Value | Description
Unset | 0 |  Not set.
Previous | 1 |  Search for chain links before the current link.
Next | 2 |  Search for chain links after the current link.
Both | 3 |  Search for chain links before and after the current link.
See Also
Reference
Rhino.Geometry Namespace