RhinoCommon API
PostEffectExecuteWhileRenderingOptions Enumeration
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffectExecuteWhileRenderingOptions"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum PostEffectExecuteWhileRenderingOptions
Public Enumeration PostEffectExecuteWhileRenderingOptions
Members
Member name | Value | Description
None | 0
Never | 0
Always | 1
UseDelay | 2
UseExecutionControl | 3
See Also
Reference
Rhino.Render.PostEffects Namespace