RhinoCommon API
PostEffectStyles Enumeration
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffectStyles"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[FlagsAttribute]
public enum PostEffectStyles
<FlagsAttribute>
Public Enumeration PostEffectStyles
Members
Member name | Value | Description
ExecuteForProductionRendering | 1
ExecuteForRealtimeRendering | 2
ExecuteForViewportDisplay | 4
Fixed | 256
DefaultShown | 512
DefaultOn | 1024
See Also
Reference
Rhino.Render.PostEffects Namespace