RhinoCommon API
Vector2d Structure
 Represents the two components of a vector in two-dimensional space, using Double-precision floating point numbers.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public struct Vector2d : ISerializable, IEquatable<Vector2d>,
	IComparable<Vector2d>, IComparable, IEpsilonComparable<Vector2d>,
	IFormattable
<SerializableAttribute>
Public Structure Vector2d
	Implements ISerializable, IEquatable(Of Vector2d),
	IComparable(Of Vector2d), IComparable, IEpsilonComparable(Of Vector2d),
	IFormattable
The Vector2d type exposes the following members.
Constructors
Name | Description
Vector2d
 Initializes a new instance of the vector based on two, X and Y, components.
Top
Properties
Name | Description
IsValid
 Gets a value indicating whether this vector is valid. A valid vector must be formed of valid component values for x, y and z.
Length
 Computes the length (or magnitude, or size) of this vector. This is an application of Pythagoras' theorem.
SquareLength
 Returns the square of the length of the vector.
Unset
 Gets the value of the vector with components set as RhinoMath.UnsetValue,RhinoMath.UnsetValue.
X
 Gets or sets the X (first) component of this vector.
Y
 Gets or sets the Y (second) component of this vector.
Zero
 Gets the value of the vector with components 0,0.
Top
Methods
Name | Description
Add
 Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
CompareTo
 Compares this Vector2d with another Vector2d.
Components evaluation priority is first X, then Y.
Divide
 Divides a Vector2d by a number, having the effect of shrinking it.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Vector2d and has the same value as the present vector.
 (Overrides ValueType.Equals(Object).)
Equals(Vector2d)
 Determines whether the specified vector has the same value as the present vector.
GetHashCode
 Provides a hashing value for the present vector.
 (Overrides ValueType.GetHashCode().)
IsTiny()
 Uses RhinoMath.ZeroTolerance for IsTiny calculation.
IsTiny(Double)
 Determines whether a vector is very short.
Multiply(Double, Vector2d)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector2d, Vector2d)
 Multiplies two vectors together, returning the dot product (or inner product).
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector2d, Double)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Negate
 Computes the reversed vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
Rotate
 Rotates this vector.
Subtract
 Subtracts the second vector from the first one.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
ToString()
 Constructs a string representation of the current vector.
 (Overrides ValueType.ToString().)
ToString(String, IFormatProvider)
Formats the value of the current instance using the specified format.
Unitize
 Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
Top
Operators
Name | Description
Addition
 Sums up two vectors.
Division
 Divides a Vector2d by a number, having the effect of shrinking it.
Equality
 Determines whether two vectors have equal values.
GreaterThan
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
GreaterThanOrEqual
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
Inequality
 Determines whether two vectors have different values.
LessThan
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
LessThanOrEqual
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
Multiply(Double, Vector2d)
 Multiplies a vector by a number, having the effect of scaling it.
Multiply(Vector2d, Vector2d)
 Multiplies two vectors together, returning the dot product (or inner product).
Multiply(Vector2d, Double)
 Multiplies a vector by a number, having the effect of scaling it.
Subtraction
 Subtracts the second vector from the first one.
UnaryNegation
 Computes the opposite vector.
Top
See Also
Reference
Rhino.Geometry Namespace