RhinoCommon API
RenderPanels Class
 This class is used to extend the standard Render user interface
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderPanels
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class RenderPanels
Public NotInheritable Class RenderPanels
The RenderPanels type exposes the following members.
Methods
Name | Description
FromRenderSessionId
 Get the instance of a render panel associated with a specific render session, this is useful when it is necessary to update a control from a RenderPipeline
RegisterPanel(PlugIn, RenderPanelType, Type, String, Boolean, Boolean) |  Obsolete.
 Register custom render user interface with Rhino. This should only be done in RegisterRenderPanels(RenderPanels). Panels registered after RegisterRenderPanels(RenderPanels) is called will be ignored.
RegisterPanel(PlugIn, RenderPanelType, Type, Guid, String, Boolean, Boolean)
 Register custom render user interface with Rhino. This should only be done in RegisterRenderPanels(RenderPanels). Panels registered after RegisterRenderPanels(RenderPanels) is called will be ignored.
RegisterPanel(PlugIn, RenderPanelType, Type, Guid, String, Boolean, Boolean, RenderPanels.ExtraSidePanePosition)
 Register custom render user interface with Rhino. This should only be done in RegisterRenderPanels(RenderPanels). Panels registered after RegisterRenderPanels(RenderPanels) is called will be ignored.
Top
See Also
Reference
Rhino.Render Namespace