RhinoCommon API
File3ds Class
 Support for writing 3ds file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3ds
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class File3ds
Public NotInheritable Class File3ds
The File3ds type exposes the following members.
Methods
Name | Description
Read
Read a 3ds file intof a RhinoDoc
Write
Write a 3ds file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace