RhinoCommon API
DisplayPipelineAttributes.SurfaceThicknessUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.SurfaceThicknessUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public enum SurfaceThicknessUse
Public Enumeration SurfaceThicknessUse
Members
Member name | Value | Description
ObjectWidth | 0
Pixels | 1
See Also
Reference
Rhino.Display Namespace