RhinoCommon API
RhinoAccountsOperationInProgressException Class
 Exception thrown when there is already a Rhino Accounts operation taking place.
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.RhinoAccounts.RhinoAccountsException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsOperationInProgressException
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class RhinoAccountsOperationInProgressException : RhinoAccountsException
<SerializableAttribute>
Public Class RhinoAccountsOperationInProgressException
	Inherits RhinoAccountsException
The RhinoAccountsOperationInProgressException type exposes the following members.
Constructors
Name | Description
RhinoAccountsOperationInProgressException(Assembly, Exception)
 Generates a new instance of the exception.
RhinoAccountsOperationInProgressException(String, Exception)
 Generates a new instance of the exception.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace