RhinoCommon API
Box Structure
 Represents the value of a plane and three intervals in an orthogonal, oriented box that is not necessarily parallel to the world Y, X, Z axes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public struct Box : IEpsilonComparable<Box>, ICloneable
<SerializableAttribute>
Public Structure Box
	Implements IEpsilonComparable(Of Box), ICloneable
The Box type exposes the following members.
Constructors
Name | Description
Box(BoundingBox)
 Initializes a new Box that mimics a BoundingBox struct.
The orientation plane of the Box is coincident with the World XY plane.
Box(Box)
Copy constructor.
Box(Plane, BoundingBox)
 Initializes a box from a base plane and a world-aligned bounding box. The box will use basePlane for its Plane, and the X, Y, and Z intervals of boundingbox as its X, Y, and Z intervals.
Box(Plane, GeometryBase)
 Initializes a box that contains a generic piece of geometry. This box will be aligned with an arbitrary plane.
Box(Plane, IEnumerable<Point3d>)
 Initializes the smallest box that contains a set of points.
Box(Plane, Interval, Interval, Interval)
 Initializes a new box from a base Plane and three Intervals.
Top
Properties
Name | Description
Area
 Gets the total surface area of this box, or UnsetValue for an invalid box.
BoundingBox
 Gets the world axis aligned Bounding box for this oriented box.
Center
 Gets the point that is in the center of the box.
Empty
 Empty Box. Empty boxes are considered to be invalid.
IsValid
 Gets the validity of this Box. Boxes are invalid when the base plane or any of the dimension intervals are invalid or decreasing.
Plane
 Gets or sets the orientation plane for this Box.
Unset
 Gets a Box whose base plane and axis dimensions are all Unset.
Volume
 Gets the total volume of this box, or UnsetValue for an invalid box.
X
 Gets or sets the Interval that describes the dimension of the Box along the orientation plane X-Axis. Otherwise known as the Width of the Box.
Y
 Gets or sets the Interval that describes the dimension of the Box along the orientation plane Y-Axis. Otherwise known as the Depth of the Box.
Z
 Gets or sets the Interval that describes the dimension of the Box along the orientation plane Z-Axis. Otherwise known as the Height of the Box.
Top
Methods
Name | Description
Clone
 Returns a deep copy of this instance.
ClosestPoint(Point3d)
 Finds the closest point on or in the Box. The box should be Valid for this to work.
ClosestPoint(Point3d, Boolean)
 Finds the closest point on or in the Box. The box should be Valid for this to work.
Contains(BoundingBox)
 Determines whether a BoundingBox is inside this Box, including its boundary. This is the same as calling Contains(box,false). Invalid boxes contain nothing. Invalid bounding boxes are never contained.
Contains(Box)
 Determines whether a Box is inside this Box, including its boundary. This is the same as calling Contains(box,false). Invalid boxes contain nothing. Invalid boxes are never contained.
Contains(Point3d)
 Determines whether a point is inside this Box, including its boundary. This is the same as calling Contains(point,false). Invalid boxes contain nothing. Invalid points are never contained.
Contains(BoundingBox, Boolean)
 Determines whether a BoundingBox is inside this Box (strict inclusion, if strict is true). Invalid boxes contain nothing. Invalid bounding boxes are never contained.
Contains(Box, Boolean)
 Determines whether a Box is inside this Box (strict inclusion, if strict is true). Invalid boxes contain nothing. Invalid boxes are never contained.
Contains(Point3d, Boolean)
 Determines whether a point is (strictly, if strict is true) inside this Box. Invalid boxes contain nothing. Invalid points are never contained.
EpsilonEquals
 Check that all values in Box other are within epsilon of the values in this Box.
FurthestPoint
 Finds the furthest point on the boundary of this Box. The Box should be Valid for this to work properly.
GetCorners
 Gets an array of the 8 corner points of this box, or an empty array if this box is not valid.
Inflate(Double)
 Inflates the box by a given offset in each direction. Inflating with negative amounts may result in decreasing boxes. InValid boxes cannot be inflated.
Inflate(Double, Double, Double)
 Inflates the box by a given offset in each direction. Inflating with negative amounts may result in decreasing boxes. InValid boxes cannot be inflated.
MakeValid |  Obsolete.
 DO NOT USE THIS FUNCTION If some of the box's values (Plane origin or axis, intervals bounds) are unset, do nothing. Else, make the Box valid by reversing the non-increasing intervals of this box. This is almost never what you want because it only makes Empty boxes not empty and with non-zero length.
PointAt
 Evaluates the box at the given unitized parameters.
The box is parametrized with a side length of 1x1x1.
RepositionBasePlane
 Repositions the origin of the Base plane for this box without affecting the physical dimensions.
ToBrep
 Constructs a brep representation of this box.
ToExtrusion
 Constructs an extrusion representation of this box.
Transform
 Transforms this Box using a Transformation matrix. If the Transform is not a Similarity, the dimensions of the resulting box cannot be trusted.
Union
 Constructs a union between this Box and the given point. This grows the box in directions so it contains the point.
Top
See Also
Reference
Rhino.Geometry Namespace