RhinoCommon API
SubDToBrepOptions.ExtraordinaryVertexProcessOption Enumeration
 ON_SubDToBrepParameters::Vertex identifies the options for post processing extraorindary vertices.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ExtraordinaryVertexProcessOption
Public Enumeration ExtraordinaryVertexProcessOption
Members
Member name | Value | Description
None | 0 |  The NURBS patches are used as is. At extraordinary vertices, the brep vertex may not be G1. Typically the deviation bewtween the brep and SubD surface is smallest with this option.
LocalG1 | 1 |  At extraordinary vertices, the NURBS patches are modified so they are G1 at the extraordinary vertex. Typically the deviation bewtween the brep and SubD surface is larger than None and smaller than LocalG1x and LocalG2.
LocalG2 | 2 |  At extraordinary vertices, the NURBS patches are modified so they are G2 at the extraordinary vertex. Typically the deviation bewtween the brep and SubD surface is larger than LocalG1 and LocalG1x.
LocalG1x | 3 |  At extraordinary vertices, the NURBS patches are modified so they are G1 at the extraordinary vertex and tend to be closer to G1 along edges near the extraordinary vertex. Typically the deviation bewtween the brep and SubD surface is larger than LocalG1 and smaller than LocalG2.
LocalG1xx | 4 |  At extraordinary vertices, the NURBS patches are modified so they are G1 at the extraordinary vertex and G1 along edges near the extraordinary vertex. The patches will have one double knot near the extraordinary vertex.
See Also
Reference
Rhino.Geometry Namespace