RhinoCommon API
RhinoModifyObjectAttributesEventArgs Class
[Missing <summary> documentation for "T:Rhino.DocObjects.RhinoModifyObjectAttributesEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoModifyObjectAttributesEventArgs
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RhinoModifyObjectAttributesEventArgs : EventArgs
Public Class RhinoModifyObjectAttributesEventArgs
	Inherits EventArgs
The RhinoModifyObjectAttributesEventArgs type exposes the following members.
Properties
Name | Description
Document
DocumentSerialNumber
 The document runtime serial number.
NewAttributes
OldAttributes
RhinoObject
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace