RhinoCommon API
TaskCompleteEventArgs Class
[Missing <summary> documentation for "T:Rhino.Input.Custom.TaskCompleteEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Input.Custom.TaskCompleteEventArgs
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class TaskCompleteEventArgs : EventArgs
Public Class TaskCompleteEventArgs
	Inherits EventArgs
The TaskCompleteEventArgs type exposes the following members.
Constructors
Name | Description
TaskCompleteEventArgs
Initializes a new instance of the TaskCompleteEventArgs class
Top
Properties
Name | Description
Doc
Redraw
Task
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Input.Custom Namespace