RhinoCommon API
ViewType Enumeration
 What a view in a document's view table is: a model view, a layout page, a detail nested inside a layout, or one of Rhino's special editor views.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.36
Syntax
public enum ViewType
Public Enumeration ViewType
Members
Member name | Value | Description
ModelView | 0 | A standard 3d model space view.
PageView | 1 | A layout, a.k.a. "paper space". Must be an orthographic top view.
NestedView | 2 | A model view nested inside another view - a layout detail.
UVEditorView | 3 | The UV editor's special view port.
BlockEditorView | 4 | The block editor's special view port.
See Also
Reference
Rhino.DocObjects Namespace