RhinoCommon API
ShortcutKeySettings Class
 Contains static methods and properties to control keyboard shortcut keys
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.ShortcutKeySettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class ShortcutKeySettings
Public NotInheritable Class ShortcutKeySettings
The ShortcutKeySettings type exposes the following members.
Methods
Name | Description
GetDefaults
 Get all the default shortcuts registered with Rhino
GetLabel
 Get the macro label associated with a given keyboard shortcut
GetMacro
 Get macro associated with a given keyboard shortcut
GetShortcuts
 Get all shortcuts registered with Rhino
IsAcceptableKeyCombo
 Is a key plus modifier combination one that can be used with Rhino
SetMacro(ShortcutKey, String)
 Set macro associated with a keyboard shortcut
SetMacro(KeyboardKey, ModifierKey, String)
 Set a macro for a given key and modifier combination
Update
 Add or modify shortcuts with a list or KeyboardShortcut elements
Top
See Also
Reference
Rhino.ApplicationSettings Namespace