RhinoCommon API
File3dsReadOptions Class
 Options for reading a 3ds file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dsReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dsReadOptions
Public Class File3dsReadOptions
The File3dsReadOptions type exposes the following members.
Constructors
Name | Description
File3dsReadOptions
Initializes a new instance of the File3dsReadOptions class
Top
Properties
Name | Description
ImportCameras
ImportLights
Unweld
UnweldAngle
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace