RhinoCommon API
SuspendCollectionChangedNotifications<T> Class
 Using this on a TrulyObservableOrderedSet<T> will suspend notifications until the SuspendCollectionChangedNotifications<T> is disposed.
Inheritance Hierarchy
System.Object
 Rhino.Notifications.SuspendCollectionChangedNotifications<T>
 Namespace: Rhino.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SuspendCollectionChangedNotifications<T> : IDisposable
where T : INotifyPropertyChanged, IAssemblyRestrictedObject
Public Class SuspendCollectionChangedNotifications(Of T As {INotifyPropertyChanged, IAssemblyRestrictedObject})
	Implements IDisposable
Type Parameters
T
The SuspendCollectionChangedNotifications<T> type exposes the following members.
Constructors
Name | Description
SuspendCollectionChangedNotifications<T>
 Constructor. Notifications will be suspended until this object is disposed.
Top
Methods
Name | Description
Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
Top
See Also
Reference
Rhino.Notifications Namespace