RhinoCommon API
RhinoAccountsGroup Class
 Represents a Rhino Accounts group.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.RhinoAccounts.RhinoAccountsGroup
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RhinoAccountsGroup
Public Class RhinoAccountsGroup
The RhinoAccountsGroup type exposes the following members.
Constructors
Name | Description
RhinoAccountsGroup
 Represents a group in Rhino Accounts. Groups are a collection of individual members that can share resources.
Top
Properties
Name | Description
Id
 The id of the group. The id is unique to a group within Rhino Accounts.
Name
 The name of the group. The name can be changed at anytime by group members.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace