RhinoCommon API
LicenseLease Class
 LicenseLease represents a lease returned from the Cloud Zoo
Inheritance Hierarchy
System.Object
 Rhino.PlugIns.LicenseLease
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class LicenseLease
Public Class LicenseLease
The LicenseLease type exposes the following members.
Constructors
Name | Description
LicenseLease(IntPtr)
Initializes a new instance of the LicenseLease class
LicenseLease(String, String, String, String, String, String, String, String, String, DateTime, DateTime)
Initializes a new instance of the LicenseLease class
LicenseLease(String, String, String, String, String, String, String, String, String, DateTime, DateTime, DateTime)
Initializes a new instance of the LicenseLease class
Top
Properties
Name | Description
Expiration
 The date when this lease will expire
GroupId
 ID of Rhino Accounts group that this lease came from
GroupName
 Name of Rhino Accounts group that this lease came from
IssuedAt
 The date this lease was issued
LeaseId
 The ID of this lease.
ProductEdition
 Edition of product that this lease is issued to. For example, "Commercial" or "Beta"
ProductId
 The ID of the product that this lease is issued to
ProductTitle
 Title of product that this lease is issued to. For example, "Rhino 6"
ProductVersion
 Version of product that this lease is issued to. For example, "6.0"
RenewableUntil
 The date when the license in the cloud zoo entity will expire, if any
UserId
 ID of Rhino Accounts user that was logged in when this lease was obtained
UserName
 Name of Rhino Accounts user that was logged in when this lease was obtained
Top
Methods
Name | Description
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.PlugIns Namespace