RhinoCommon API
LoftType Enumeration
 Specifies enumerated constants for all supported loft types.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum LoftType
Public Enumeration LoftType
Members
Member name | Value | Description
Normal | 0 |  Uses chord-length parameterization in the loft direction.
Loose | 1 |  The surface is allowed to move away from the original curves to make a smoother surface. The surface control points are created at the same locations as the control points of the loft input curves.
Tight | 2 |  The surface sticks closely to the original curves. Uses square root of chord-length parameterization in the loft direction.
Straight | 3 |  The sections between the curves are straight. This is also known as a ruled surface.
Developable | 4 |  Obsolete.  Obsolete, do not use.
Uniform | 5 |  Constructs a uniform loft. The object knot vectors will be uniform.
See Also
Reference
Rhino.Geometry Namespace