RhinoCommon API
GroundPlane Class
 Represents an infinite plane for implementation by renderers. See SupportsFeature.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.GroundPlane
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class GroundPlane : DocumentOrFreeFloatingBase,
	IDisposable
Public NotInheritable Class GroundPlane
	Inherits DocumentOrFreeFloatingBase
	Implements IDisposable
The GroundPlane type exposes the following members.
Constructors
Name | Description
GroundPlane()
 Create a utility object not associated with any document
GroundPlane(GroundPlane)
 Create a utility object not associated with any document from another object
Top
Properties
Name | Description
Altitude
 Height above world XY plane in model units. Auto-altitude is computed if enabled.
AutoAltitude
 Determines whether the ground plane is fixed by the Altitude property, or whether it is automatically placed at the lowest point in the model.
Enabled
 Determines whether the document ground plane is enabled.
MaterialInstanceId
 Id of material in material table for this ground plane.
ShadowOnly
 Determines whether the ground plane shows the material assigned, or whether it is transparent, but captures shadows.
ShowUnderside
 If this is off, the ground plane will not be visible when seen from below.
TextureOffset
 Texture mapping offset in world units.
TextureOffsetLocked
 Texture offset locked.
TextureRotation
 Texture mapping rotation around world origin + offset in degrees.
TextureSize
 Texture mapping single UV span size in world units.
TextureSizeLocked
 Texture size locked.
Top
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Dispose
Releases all resources used by the GroundPlane
Finalize |  (Overrides FreeFloatingBase.Finalize().)
Top
Events
Name | Description
Changed
 This event is raised when a GroundPlane property value is changed.
Top
See Also
Reference
Rhino.Render Namespace