RhinoCommon API
RenderContentEventArgs Class
 Event args for RenderContent
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RenderContentEventArgs
 Rhino.Render.RenderContentChangedEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderContentEventArgs : EventArgs
Public Class RenderContentEventArgs
	Inherits EventArgs
The RenderContentEventArgs type exposes the following members.
Properties
Name | Description
Content
Document
EnvironmentUsage |  Obsolete.
 Meaningful for CurrentEnvironmentChanged event. Will be one of Background, ReflectionAndRefraction or Skylighting.
EnvironmentUsageEx
 Meaningful for CurrentEnvironmentChanged event. Will be one of Background, Reflection or Skylighting.
Reason
 Not when used in CurrentEnvironmentChanged (defaults to None).
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace