RhinoCommon API
RhinoCore Class
 Represents an instance of RhinoCore.DLL.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InProcess.RhinoCore
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RhinoCore : IDisposable
Public Class RhinoCore
	Implements IDisposable
The RhinoCore type exposes the following members.
Constructors
Name | Description
RhinoCore()
 Initializes a new instance of the RhinoCore class.
RhinoCore(String[])
 Initializes a new instance of the RhinoCore class.
RhinoCore(String[], WindowStyle)
 Initializes a new instance of the RhinoCore class.
RhinoCore(String[], WindowStyle, IntPtr)
 Initializes a new instance of the RhinoCore class.
Top
Methods
Name | Description
Dispose
 IDisposable implementation
DoEvents
 If a Rhino owned window is active processes all Windows messages currently in the message queue.
DoIdle
 Processes all Rhino Idle tasks.
Finalize
 IDisposable implementation
 (Overrides Object.Finalize().)
InvokeInHostContext(Action)
 Invokes action in Host context
InvokeInHostContext<T>(Func<T>)
 Invokes function in Host context
RaiseIdle
 Raises the Idle event.
Run
 Runs RhinoApp Message loop
Top
See Also
Reference
Rhino.Runtime.InProcess Namespace