RhinoCommon API
SubD.ExtraordinaryVertexCurvature Enumeration
 ON_SubD::ExtraordinaryVertexCurvature identifies what a curvature evaluation reports exactly on an extraordinary vertex. A SubD limit surface is C1 but generally not C2 at an extraordinary vertex. The mixed second partial does not exist there, so there is no second fundamental form and no curvature of the surface itself. Every other point of the surface, including the rest of an extraordinary vertex's corner quad, has a curvature and is unaffected by this setting.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ExtraordinaryVertexCurvature
Public Enumeration ExtraordinaryVertexCurvature
Members
Member name | Value | Description
None | 0 |  Report no curvature. Evaluation fails at an extraordinary vertex. This is the default and says exactly what is true of the surface.
SectorAverage | 1 |  Report the average of the curvature of the surface immediately around the vertex: one sample per surface mesh fragment of the vertex's sector, each taken at the fragment grid point nearest the vertex. The sample spacing follows the surface mesh cache, so a denser cache samples closer to the vertex, and a minimum density of 2 is used when the cache is coarser than that or absent - the same minimum the SubD to NURBS conversion works at. Gaussian and mean curvature are averaged, not the principal curvatures: they are the invariants, whereas k1 and k2 are ordered eigenvalues that do not average meaningfully. The principal directions are left unset for the same reason. This is an estimate of a quantity the surface does not have. Use it where a plausible continuous value matters more than exactness, such as curvature display, and not where the value feeds further geometry.
See Also
Reference
Rhino.Geometry Namespace