RhinoCommon API
PreviewJobSignature Class
 Preview Job Signature is a specific identifier for a specific rendered preview
Inheritance Hierarchy
System.Object
 Rhino.Render.PreviewJobSignature
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class PreviewJobSignature : IDisposable
Public NotInheritable Class PreviewJobSignature
	Implements IDisposable
The PreviewJobSignature type exposes the following members.
Constructors
Name | Description
PreviewJobSignature()
 Preview Job Signature constructor
PreviewJobSignature(IntPtr)
 Preview Job Signature constructor
PreviewJobSignature(Int32, Int32, UInt32) |  Obsolete.
 Preview Job Signature constructor
PreviewJobSignature(Int32, Int32, UInt32, Guid)
Initializes a new instance of the PreviewJobSignature class
Top
Properties
Name | Description
CppPointer
 UnManaged pointer of the PreviewJobsingature
Top
Methods
Name | Description
Compare
 Compare two Preview Job Signatures. True if they are the same, otherwise false.
Dispose
 Dispose
Finalize
 Preview Job Signature destructor
 (Overrides Object.Finalize().)
ImageHeight
 The Height of the rendered preview image
ImageWidth
 The Width of the rendered preview image
Top
See Also
Reference
Rhino.Render Namespace