RhinoCommon API
FilePovWriteOptions Class
 Options for writing a POV file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FilePovWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FilePovWriteOptions
Public Class FilePovWriteOptions
The FilePovWriteOptions type exposes the following members.
Constructors
Name | Description
FilePovWriteOptions
Initializes a new instance of the FilePovWriteOptions class
Top
Properties
Name | Description
ExportAsOneFile
MeshingParameters
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace