RhinoCommon API
MeshInterference Structure
 Represents an element which is part of a clash or intersection between two meshes.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public struct MeshInterference
Public Structure MeshInterference
The MeshInterference type exposes the following members.
Properties
Name | Description
HitPoints
 Array of hit points where the objects of IndexA and IndexB interfere.
IndexA
 The index of the first clashing, or interfering object.
IndexB
 The index of the second clashing, or interfering object.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry.Intersect Namespace