RhinoCommon API
ViewCaptureWriter.VectorStringProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.VectorStringProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void VectorStringProc(
	IntPtr constPtrString,
	int argbTextColor,
	double x,
	double y,
	float angle,
	int alignment,
	float heightPixels,
	IntPtr constPtrFont
)
Public Delegate Sub VectorStringProc (
	constPtrString As IntPtr,
	argbTextColor As Integer,
	x As Double,
	y As Double,
	angle As Single,
	alignment As Integer,
	heightPixels As Single,
	constPtrFont As IntPtr
)
Parameters
constPtrString
Type: System.IntPtr
argbTextColor
Type: System.Int32
x
Type: System.Double
y
Type: System.Double
angle
Type: System.Single
alignment
Type: System.Int32
heightPixels
Type: System.Single
constPtrFont
Type: System.IntPtr
See Also
Reference
Rhino.Runtime Namespace