RhinoCommon API
DraftAngleAnalysisSettingsState Class
 Represents a snapshot of DraftAngleAnalysisSettings
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.DraftAngleAnalysisSettingsState
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DraftAngleAnalysisSettingsState
Public Class DraftAngleAnalysisSettingsState
The DraftAngleAnalysisSettingsState type exposes the following members.
Properties
Name | Description
AngleRange
 The angle range.
ShowIsoCurves
 Show isoparametric curves.
UpDirection
 The up direction.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace