RhinoCommon API
CurveKnotStyle Enumeration
 Defines enumerated values for knot spacing styles in interpolated curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum CurveKnotStyle
Public Enumeration CurveKnotStyle
Members
Member name | Value | Description
Uniform | 0 |  Parameter spacing between consecutive knots is 1.0.
Chord | 1 |  Chord length spacing, requires degree=3 with CV1 and CVn1 specified.
ChordSquareRoot | 2 |  Square root of chord length, requires degree=3 with CV1 and CVn1 specified.
UniformPeriodic | 3 |  Periodic with uniform spacing.
ChordPeriodic | 4 |  Periodic with chord length spacing.
ChordSquareRootPeriodic | 5 |  Periodic with square root of chord length spacing.
See Also
Reference
Rhino.Geometry Namespace