RhinoCommon API
MeshSplitOptions Class
 Contains a set of data to pass to mesh splitting operations.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.MeshSplitOptions
 Rhino.Geometry.MeshBooleanOptions
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public class MeshSplitOptions
Public Class MeshSplitOptions
The MeshSplitOptions type exposes the following members.
Constructors
Name | Description
MeshSplitOptions
Initializes a new instance of the MeshSplitOptions class
Top
Properties
Name | Description
CancellationToken
 A token that allows to request the cancellation of the operation.
CompleteOpenCuts
Gets or sets whether cuts that stop inside the mesh are completed.
An intersection curve that stops inside the mesh does not separate one side from the other, so the mesh is returned whole. When this is enabled, each such open end is joined to the nearest border of the mesh, or to another cut, following edges the mesh already has.
This yields a best-effort cut where the intersection alone leaves the answer undetermined: the added stretch follows existing edges rather than the cutter, so it is not an intersection result. No vertex is moved and no face is added. Cuts that already close, or that already run from border to border, are unaffected.
CreateNgons
 Gets or sets whether ngons are created along the split ridge, to preserve the boundary look.
ProgressReporter
 Gets or sets the object that is responsible to keep track of calculation progression.
SplitAtCoplanar
 Gets or sets whether coplanar areas are separated. If false, coplanar areas will not be separated.
TextLog
 Gets or sets a text log to write computed operations into.
Tolerance
 Gets or sets a tolerance value for intersections and overlaps.
Top
Methods
Name | Description
Top
Remarks
This is the base of MeshBooleanOptions, so an instance used for mesh booleans can also be passed to the splitting methods that take these options.
See Also
Reference
Rhino.Geometry Namespace