RhinoCommon API
FileAiWriteOptions Class
 Options for writing a ai file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileAiWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileAiWriteOptions
Public Class FileAiWriteOptions
The FileAiWriteOptions type exposes the following members.
Constructors
Name | Description
FileAiWriteOptions
Initializes a new instance of the FileAiWriteOptions class
Top
Properties
Name | Description
AIScale
AiUnits
ExportHatchesAsSolidFills
ExportViewBoundary
OrderLayers
PreserveModelScale
RhinoScale
UseCMYK
Top
Methods
Name | Description
ToDictionary
Top
See Also
Reference
Rhino.FileIO Namespace