RhinoCommon API
LicenseType Enumeration
LicenseType enumeration.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum LicenseType
Public Enumeration LicenseType
Members
Member name | Value | Description
Standalone | 0 | A standalone license
Network | 1 | A network license that has not been fulfilled by a Zoo
NetworkLoanedOut | 2 | A license on temporary loan from a Zoo
NetworkCheckedOut | 3 | A license on permanent check out from a Zoo
CloudZoo | 4 |  A lease granted by the Cloud Zoo
See Also
Reference
Rhino.PlugIns Namespace