RhinoCommon API
MeshInstance.AncestryRecord Class
 Information about the ancestry of a MeshInstance
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.MeshInstance.AncestryRecord
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class AncestryRecord : IDisposable
Public Class AncestryRecord
	Implements IDisposable
The MeshInstance.AncestryRecord type exposes the following members.
Constructors
Name | Description
MeshInstance.AncestryRecord
Initializes a new instance of the MeshInstance.AncestryRecord class
Top
Properties
Name | Description
DefinitionId
 The ModelObjectId of the InstanceDefinition
ReferenceAttributes
 The object attributes from the InstanceObject
ReferenceId
 The ModelObjectId of the InstanceObject
Transform
 The transform from the InstanceObject
Top
Methods
Name | Description
Dispose()
 Dispose
Dispose(Boolean)
 Dispose. Disposes unmanaged memory.
Finalize
 Finalizer
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render.ChangeQueue Namespace