RhinoCommon API
HiddenLineDrawingPoint Class
 Points generated from source objects which correspond to point and point cloud source objects.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.HiddenLineDrawingPoint
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class HiddenLineDrawingPoint
Public NotInheritable Class HiddenLineDrawingPoint
The HiddenLineDrawingPoint type exposes the following members.
Properties
Name | Description
ClippingPlaneIndex
 Index into HiddenLineDrawing.ClippingPlanes when SilhouetteType == SilhouetteType.SectionCut.
Index
 Index of this object in HiddenLineDrawing.Points.
Location
 Returns the location of this object in HiddenLineDrawing coordinates.
PointVisibility
 Returns the point's visibility
SourceObject
 Return the source object that this point came from.
SourceObjectComponentIndex
 Component of source object part that generated this curve.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace