RhinoCommon API
SimpleArrayUint Class
 Wrapper for ON_SimpleArray<unsigned int>. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayUint
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArrayUint : IDisposable
Public Class SimpleArrayUint
	Implements IDisposable
The SimpleArrayUint type exposes the following members.
Constructors
Name | Description
SimpleArrayUint()
 Initializes a new SimpleArrayInt class.
SimpleArrayUint(IEnumerable<UInt32>)
 Initializes a new SimpleArrayInt class.
Top
Properties
Name | Description
Count
 Gets the number of elements in this array.
UnsignedCount
 Gets the number of elements in this array.
Top
Methods
Name | Description
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToArray
 Returns the managed counterpart of the unmanaged array.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace