RhinoCommon API
RhinoDoc.RenderContentTableEventType Enumeration
 Type of content table event
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public enum RenderContentTableEventType
Public Enumeration RenderContentTableEventType
Members
Member name | Value | Description
Loaded | 0 |  The document has been read and the table has been loaded
Clearing | 1 |  The table is about to be cleared
Cleared | 2 |  The table has been cleared
MaterialAssignmentChanged | 3 |  Object or layer material assignment changed
See Also
Reference
Rhino Namespace