RhinoCommon API
FileAiReadOptions Class
 Options for reading a AI file (old ai files, ps not pdf)
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileAiReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileAiReadOptions
Public Class FileAiReadOptions
The FileAiReadOptions type exposes the following members.
Constructors
Name | Description
FileAiReadOptions
Initializes a new instance of the FileAiReadOptions class
Top
Properties
Name | Description
AiScale
AiUnits
PreserveModelScale
RhinoScale
Top
Methods
Name | Description
ToDictionary
Top
See Also
Reference
Rhino.FileIO Namespace