RhinoCommon API
BrepFace.ShrinkDisableSide Enumeration
 Defines bitwise mask flags indicating what side of a surface to not shrink.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[FlagsAttribute]
public enum ShrinkDisableSide
<FlagsAttribute>
Public Enumeration ShrinkDisableSide
Members
Member name | Value | Description
ShrinkAllSides | 0 |  Shrink on all four sides.
DoNotShrinkWestSide | 1 |  Do not shrink on the west side of domain.
DoNotShrinkSouthSide | 2 |  Do not shrink on the south side of domain.
DoNotShrinkEastSide | 4 |  Do not shrink on the east side of domain.
DoNotShrinkNorthSide | 8 |  Do not shrink on the north side of domain.
See Also
Reference
Rhino.Geometry Namespace