RhinoCommon API
RhinoList Class
 Provides helper methods to work with RhinoList<T> and other collections.
Inheritance Hierarchy
System.Object
 Rhino.Collections.RhinoList
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class RhinoList
Public NotInheritable Class RhinoList
The RhinoList type exposes the following members.
Methods
Name | Description
Point2dKNeighbors
 Finds a certain amour of points in a list of single-precision 2D points that are the k-closest to a test point. This method searches needlePoints by computing all distances from each point cloud point and keeping a "short list".
Point2fKNeighbors
 Finds a certain amour of points in a list of single-precision 2D points that are the k-closest to a test point. This method searches needlePoints by computing all distances from each point cloud point and keeping a "short list".
Point3dKNeighbors
 Finds a certain amour of points in a list of 3D points that are the k-closest to a test point. This method searches needlePoints by computing all distances from each point cloud point and keeping a "short list". See RTree KNeighbors for alternatives.
Point3fKNeighbors
 Finds a certain amour of points in a list of single-precision 3D points that are the k-closest to a test point. This method searches needlePoints by computing all distances from each point cloud point and keeping a "short list".
PointCloudKNeighbors
 Finds a certain amount of points in a list of 3D points that are the k-closest to a test point. This method searches needlePoints by computing all distances from each point cloud point and keeping a short list.
Top
See Also
Reference
Rhino.Collections Namespace