RhinoCommon API
ContentFactories Class
[Missing <summary> documentation for "T:Rhino.Render.DataSources.ContentFactories"]
Inheritance Hierarchy
System.Object
 Rhino.Render.DataSources.ContentFactories
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ContentFactories : IDisposable
Public Class ContentFactories
	Implements IDisposable
The ContentFactories type exposes the following members.
Constructors
Name | Description
ContentFactories
Initializes a new instance of the ContentFactories class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Dispose
Releases all resources used by the ContentFactories
Finalize |  (Overrides Object.Finalize().)
FindFactory
FirstFactory
NextFactory
Top
See Also
Reference
Rhino.Render.DataSources Namespace