RhinoCommon API
Curve.SortedSegment Structure
 A segment in a sorted curve collection
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public struct SortedSegment
Public Structure SortedSegment
The Curve.SortedSegment type exposes the following members.
Methods
Name | Description
Top
Fields
Name | Description
CurveId
 The id in the original input curve collection
Reversed
 Indicates if the curve is to be reversed
Top
See Also
Reference
Rhino.Geometry Namespace