RhinoCommon API
StringWrapper Class
 Represents a wrapper to an unmanaged OpenNurbs string.
Wraps a C++ ON_wString*.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.StringWrapper
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class StringWrapper : IDisposable
Public Class StringWrapper
	Implements IDisposable
The StringWrapper type exposes the following members.
Constructors
Name | Description
StringWrapper()
 Initializes a new empty unmanaged string (ON_wString*).
StringWrapper(String)
 Initializes a new unmanaged string with an initial value. The string s can be null.
Top
Properties
Name | Description
ConstPointer
 Gets the constant pointer (constant ON_wString*).
NonConstPointer
 Gets the non-constant pointer (ON_wString*).
Top
Methods
Name | Description
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetStringFromPointer
 Get string from an ON_wString*
SetString
 Set contents of this string.
SetStringOnPointer
 Set contents of an ON_wString*
ToString
 Returns the string contents of this wrapper.
 (Overrides Object.ToString().)
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace