RhinoCommon API
ViewCaptureSettings.ColorMode Enumeration
[Missing <summary> documentation for "T:Rhino.Display.ViewCaptureSettings.ColorMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.8
Syntax
public enum ColorMode
Public Enumeration ColorMode
Members
Member name | Value | Description
DisplayColor | 0
PrintColor | 1
BlackAndWhite | 2
See Also
Reference
Rhino.Display Namespace