RhinoCommon API
CollapsibleSectionHolderImpl Class
[Missing <summary> documentation for "T:Rhino.UI.Controls.CollapsibleSectionHolderImpl"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.CollapsibleSectionHolderImpl
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class CollapsibleSectionHolderImpl : IDisposable
Public NotInheritable Class CollapsibleSectionHolderImpl
	Implements IDisposable
The CollapsibleSectionHolderImpl type exposes the following members.
Constructors
Name | Description
CollapsibleSectionHolderImpl
Initializes a new instance of the CollapsibleSectionHolderImpl class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Dispose
Releases all resources used by the CollapsibleSectionHolderImpl
Find
IsSameObject
NewNativeWrapper
Top
See Also
Reference
Rhino.UI.Controls Namespace