RhinoCommon API
RdkEdit Class
[Missing <summary> documentation for "T:Rhino.Render.DataSources.RdkEdit"]
Inheritance Hierarchy
System.Object
 Rhino.Render.DataSources.RdkEdit
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RdkEdit : IDisposable
Public Class RdkEdit
	Implements IDisposable
The RdkEdit type exposes the following members.
Constructors
Name | Description
RdkEdit
Initializes a new instance of the RdkEdit class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Dispose
Releases all resources used by the RdkEdit
Execute
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render.DataSources Namespace