RhinoCommon API
RenderWindowClonedEventArgs Class
[Missing <summary> documentation for "T:Rhino.Render.RenderWindowClonedEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RenderWindowClonedEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderWindowClonedEventArgs : EventArgs
Public Class RenderWindowClonedEventArgs
	Inherits EventArgs
The RenderWindowClonedEventArgs type exposes the following members.
Properties
Name | Description
NewRenderWindow
NewSessionId
OldRenderWindow
OldSessionId
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace