RhinoCommon API
TextureMappingType Enumeration
 Defines enumerated constants for mapping types such as planar, cylindrical or spherical.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum TextureMappingType
Public Enumeration TextureMappingType
Members
Member name | Value | Description
None | 0 | No mapping is selected.
SurfaceParameters | 1 | (u, v) = linear transform of surface params, w = 0.
PlaneMapping | 2 | (u, v, w) = 3d coordinates wrt frame.
CylinderMapping | 3 | (u, v, w) = longitude, height, radius.
SphereMapping | 4 | (u, v, w) = longitude,latitude,radius.
BoxMapping | 5 | Box mapping type.
MeshMappingPrimitive | 6 | Mapping primitive is a mesh.
SurfaceMappingPrimitive | 7 | Mapping primitive is a surface.
BrepMappingPrimitive | 8 | Mapping primitive is a brep.
OcsMapping | 9 | OCS mapping type (WCS/WCS Box with object frame).
FalseColors | 10 | Some sort of false color mapping used to set per vertex colors
See Also
Reference
Rhino.Render Namespace