RhinoCommon API
IZooClientUtilities Interface
 Interface implemented in ZooClient and added to Rhino via dependency injection
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IZooClientUtilities
Public Interface IZooClientUtilities
The IZooClientUtilities type exposes the following members.
Properties
Name | Description
LoggedInUserAvatar
 Returns the logged in user's avatar picture. Returns a default avatar if the user does not have an avatar or if the avatar could not be fetched.
LoggedInUserName
 Returns the name of the logged in user, or null if the user is not logged in.
UserIsLoggedIn
 Returns true if the user is logged in; else returns false. A logged in user does not guarantee that the auth tokens managed by the CloudZooManager instance are valid.
Top
Methods
Name | Description
AskUserForLicense
CheckInLicense
 Checks in a checked out license to the owning Zoo.
CheckOutLicense
 Checks out a loaned out license from the owning Zoo.
ConvertLicense
 Converts a standalone license to a network license.
DeleteLicense
 31-Mar-2015 Dale Fugier, http://mcneel.myjetbrains.com/youtrack/issue/MR-1725 Deletes a license along with its license file.
Echo
GetCurrentTime
 Gets the current time, trying to access an NTP server before using local time.
GetLicense
GetLicenseStatus
 Returns the current status of every license for ui purposes
GetLicenseType
 Returns the type of a specified product license
GetOneLicenseStatus
 Returns the current status of a license for ui purposes
GetRegisteredOwnerInfo
 Returns the registered owner and organization of a license 4-Sept-2014 Dale Fugier, http://mcneel.myjetbrains.com/youtrack/issue/RH-28623
Initialize
IsCheckOutEnabled
 Returns whether or not license checkout is enabled
LicenseOptionsHandler
LoginToCloudZoo
 Logs the user in to the cloud zoo. This logs out the current user and voids any existing leases.
LogoutOfCloudZoo
 Logs the user out of the cloud zoo. This logs out the current user and voids any existing leases.
ReturnLicense(Object, Guid)
ReturnLicense(Object, String, Guid)
ShowBuyLicenseUi
ShowLicenseValidationUi
 Shows user interface to validate and register a license. Returns true if the license is successfully validated; false otherwise
ShowRhinoExpiredMessage
Top
See Also
Reference
Rhino.Runtime Namespace