RhinoCommon API
NurbsCurvePointList Class
 Provides access to the control points of a NURBS curve.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.NurbsCurvePointList
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class NurbsCurvePointList : IEnumerable<ControlPoint>,
	IEnumerable, IEpsilonComparable<NurbsCurvePointList>, IList<ControlPoint>,
	ICollection<ControlPoint>
Public Class NurbsCurvePointList
	Implements IEnumerable(Of ControlPoint), IEnumerable,
	IEpsilonComparable(Of NurbsCurvePointList), IList(Of ControlPoint), ICollection(Of ControlPoint)
The NurbsCurvePointList type exposes the following members.
Properties
Name | Description
ControlPolygonLength
 Gets the length of the polyline connecting all control points.
Count
 Gets the number of control points in this curve.
Item
 Gets or sets the control point location at the given index.
PointSize
 Returns the control point size, or the number of doubles per control point. For rational curves, PointSize = Curve.Dimension + 1. For non-rational curves, PointSize = Curve.Dimension.
Top
Methods
Name | Description
ChangeEndWeights
 Use a combination of scaling and reparameterization to change the end weights to the specified values.
Contains
 Determines if this list contains an item.
ControlPolygon
 Constructs a polyline through all the control points. Note that periodic curves generate a closed polyline with fewer points than control-points.
CopyTo
 Copied the list to an array.
EnsurePrivateCopy
 If you want to keep a copy of this class around by holding onto it in a variable after a command completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can call this function as many times as you want.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
GetPoint(Int32, Point3d)
 Gets a world 3-D, or Euclidean, control point at the given index. The 4-D representation is (x, y, z, 1.0).
GetPoint(Int32, Point4d)
 Gets a homogeneous control point at the given index, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
GetWeight
 Gets the weight of a control point at the given index. Note, if the curve is non-rational, the weight will be 1.0.
IndexOf
 Gets the index of a control point, or -1.
MakeNonRational
 Converts the curve to a Non-rational NURBS curve. Non-rational curves have unweighted control points.
MakeRational
 Converts the curve to a Rational NURBS curve. Rational NURBS curves have weighted control points.
SetPoint(Int32, Point3d)
 Sets a world 3-D, or Euclidean, control point at the given index. The 4-D representation is (x, y, z, 1.0).
SetPoint(Int32, Point4d)
 Sets a homogeneous control point at the given index, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
SetPoint(Int32, Point3d, Double)
 Sets a world 3-D, or Euclidean, control point and weight at a given index. The 4-D representation is (x*w, y*w, z*w, w).
SetPoint(Int32, Double, Double, Double)
 Sets a world 3-D, or Euclidean, control point at the given index. The 4-D representation is (x, y, z, 1.0).
SetPoint(Int32, Double, Double, Double, Double)
 Sets a homogeneous control point at the given index, where the 4-D representation is (x, y, z, w). The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
SetWeight
 Sets the weight of a control point at the given index Note, if the curve is non-rational, it will be converted to rational.
UVNDirectionsAt
 Calculates the U, V, and N directions of a NURBS curve control point similar to the method used by Rhino's MoveUVN command.
ValidateSpacing
 Simple check of distance between adjacent control points
Top
See Also
Reference
Rhino.Geometry.Collections Namespace