RhinoCommon API
FileSkpReadOptions Class
 Options used when reading a Skp file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileSkpReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileSkpReadOptions
Public Class FileSkpReadOptions
The FileSkpReadOptions type exposes the following members.
Constructors
Name | Description
FileSkpReadOptions
Initializes a new instance of the FileSkpReadOptions class
Top
Properties
Name | Description
AddObjectsToGroups
DisplayColorBy
EmbedTexturesInModel
ImportCurves
ImportFacesAsMeshes
Set to false for trimmed planes.
JoinEdges
JoinFaces
UseGroupLayers
UseSketchUpTextureWriter
Weld
WeldAngle
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Import function
Top
See Also
Reference
Rhino.FileIO Namespace