RhinoCommon API
StdVectorByte Class
 Wrapper for std::vector<unsigned char>. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.StdVectorByte
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class StdVectorByte : IDisposable
Public Class StdVectorByte
	Implements IDisposable
The StdVectorByte type exposes the following members.
Constructors
Name | Description
StdVectorByte()
 Initializes a new SimpleArrayByte class.
StdVectorByte(IEnumerable<Byte>)
 Initializes a new StdVectorByte class
StdVectorByte(StdVectorByte)
 Initializes a new SimpleArrayByte with the contents of another SimpleArrayByte.
StdVectorByte(UInt64)
 Initializes a new SimpleArrayByte class. Initial size of the array - all values are set to zero.
Top
Properties
Name | Description
Count
 Gets the amount of elements in this array.
Top
Methods
Name | Description
ConstPointer
 Gets the constant (immutable) pointer of this vector.
CopyTo
 Copies the contents of a StdVectorByte into another StdVectorByte.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Memory
 Return the raw data.
NonConstPointer
 Gets the non-constant pointer (for modification) of this vector.
ToArray
 Returns the managed counterpart of the unmanaged array.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace