RhinoCommon API
File3dmMeshModifiers Class
 Represents the mesh modifiers attached to file3dm object attributes.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmMeshModifiers
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmMeshModifiers
Public Class File3dmMeshModifiers
The File3dmMeshModifiers type exposes the following members.
Properties
Name | Description
CurvePiping
 Returns an object that provides access to curve piping information. If no curve piping information is present, the method returns null.
Displacement
 Returns an object that provides access to displacement information. If no displacement information is present, the method returns null.
EdgeSoftening
 Returns an object that provides access to edge softening information. If no edge softening information is present, the method returns null.
ShutLining
 Returns an object that provides access to shut-lining information. If no shutlining information is present, the method returns null.
Thickening
 Returns an object that provides access to thickening information. If no thickening information is present, the method returns null.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace