RhinoCommon API
File3dmViewTable Class
 Provides access to views in the 3dm file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmViewTable
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmViewTable : IList<ViewInfo>,
	ICollection<ViewInfo>, IEnumerable<ViewInfo>, IEnumerable
Public Class File3dmViewTable
	Implements IList(Of ViewInfo), ICollection(Of ViewInfo),
	IEnumerable(Of ViewInfo), IEnumerable
The File3dmViewTable type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of items in the table.
Item
 Gets the view info at an index. The set method always throws NotSupportedException.
Top
Methods
Name | Description
Add
 Adds a
Clear
 Removes all items from the table.
Contains
 Returns an indication of the presence of a view in the table.
CopyTo
 Copies the content of the table to an array.
Delete(Int32)
 Removes an item.
Delete(ViewInfo)
 Deletes an item.
FindName
 Finds a ViewInfo given its name.
GetEnumerator
 Returns an enumerator that yields all views in the table.
IndexOf
 Returns the index of the current ViewInfo.
Top
See Also
Reference
Rhino.FileIO Namespace