RhinoCommon API
DisplayPen Class
 Pen used to define stroke applied to several DisplayPipeline draw functions
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayPen
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DisplayPen
Public Class DisplayPen
The DisplayPen type exposes the following members.
Constructors
Name | Description
DisplayPen
Initializes a new instance of the DisplayPen class
Top
Properties
Name | Description
CapStyle
 How caps are drawn at the ends of open curves
Color
 Color applied to stroke
HaloColor
 Halos are blended colors drawn around a curve for purposes like selection
HaloThickness
 Halos are blended colors drawn around a curve for purposes like selection
JoinStyle
 How corners of curves are joined
PatternAutoscale
 Scale pattern in detail views
PatternBySegment
 Restart patterns at corners in a curve
PatternLengthInWorldUnits
 If true, lengths in pattern definition are interpreted to be in world units. If false, screen pixel distances are used.
PatternOffset
 Offset to apply to pattern. If RhinoMath.UnsetSingle, then pattern is centered to keep even dash lengths at ends
PatternScale
 Scale applied to the pattern, use 0.0 to let Rhino apply global scale.
Thickness
 Thickness for stroke
ThicknessSpace
 Coordinate system for the pen's thickness
Top
Methods
Name | Description
Duplicate
 Create a duplicate of this display pen.
FromLinetype(Linetype, Color)
 Create a display pen that matches a linetype definition on any viewport.
FromLinetype(Linetype, Color, Double)
 Create a display pen that matches a linetype definition
PatternAsArray
 Get the pattern for this pen as an array of dash,gap,dash,gap... values
SetPattern
 Set pattern to apply for a stroke.
SetTaper
 Positions and thickness at those positions along a curve that define a taper.
TaperAsArray
 Collection of positions and thicknesses at those positions to define a taper Rhino currently only supports either no taper or a single taper. An array is used here in case Rhino supports multiple taper values in the future.
Top
See Also
Reference
Rhino.Display Namespace