RhinoCommon API
DisplayPipelineAttributes.GridPlaneVisibilityMode Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.GridPlaneVisibilityMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public enum GridPlaneVisibilityMode
Public Enumeration GridPlaneVisibilityMode
Members
Member name | Value | Description
ShowOnlyIfGridVisible | 0 |  Show only when grid is on
AlwaysShow | 1 |  Show always
See Also
Reference
Rhino.Display Namespace