RhinoCommon API
IRdkViewModel Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.IRdkViewModel"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IRdkViewModel : IHasCppImplementation
Public Interface IRdkViewModel
	Inherits IHasCppImplementation
The IRdkViewModel type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Commit
Discard
GetData
Top
See Also
Reference
Rhino.UI.Controls Namespace