RhinoCommon API
CommonComponentTable<T> Class
 Provides a base table type that encompasses all document tables, both in RhinoDoc and File3dm.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<T>
 Rhino.DocObjects.Tables.RhinoDocCommonTable<T>
 Rhino.FileIO.File3dmCommonComponentTable<T>
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class CommonComponentTable<T> : ICommonComponentTable<T>,
	IReadOnlyCollection<T>, IEnumerable<T>, IEnumerable, ICollection<T>, IList<T>,
	IReadOnlyList<T>
where T : ModelComponent
Public MustInherit Class CommonComponentTable(Of T As ModelComponent)
	Implements ICommonComponentTable(Of T), IReadOnlyCollection(Of T),
	IEnumerable(Of T), IEnumerable, ICollection(Of T), IList(Of T),
	IReadOnlyList(Of T)
Type Parameters
T
A model component.
The CommonComponentTable<T> type exposes the following members.
Properties
Name | Description
ComponentType
 Returns the actual component type of a table.
Count
 Returns the count of all items, including deleted ones.
Top
Methods
Name | Description
Clear
 Marks all items as deleted.
Delete
 Deletes an item. Items that are deleted are still keeping their space, but the 'IsDeleted' flag is checked.
FindId
 Uses the guid to find a model component. Deleted objects cannot be found by id. The guid is the value that is stored in the .Id property. In a single document, no two active objects have the same guid. If an object is replaced with a new object, then the guid persists. For example, if the _Move command moves an object, then the moved object inherits its guid from the starting object. If the Copy command copies an object, then the copy gets a new guid. This guid persists through file saving/opening operations. This function will not find grip objects.
GetEnumerator
 Returns the enumerator that yields all items.
Top
See Also
Reference
Rhino.FileIO Namespace