RhinoCommon API
PlugInType Enumeration
 Rhino plug-in type enumeration.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[FlagsAttribute]
public enum PlugInType
<FlagsAttribute>
Public Enumeration PlugInType
Members
Member name | Value | Description
None | 0
Render | 1
FileImport | 2
FileExport | 4
Digitizer | 8
Utility | 16
DisplayPipeline | 32
DisplayEngine | 64
Any | 127
See Also
Reference
Rhino.PlugIns Namespace