RhinoCommon API
RhinoDocUndoRecord Class
 This helper class manages calls to RhinoDoc.BeginUndoRecord and RhinoDoc.UndoRecord. Use this if you are modifying a document from some modeless user interface. Do not use this if you are just writing Rhino commands. ALWAYS call Dispose on this class. It is best if the class is placed in a using block so Dispose will be called for you.
Inheritance Hierarchy
System.Object
 Rhino.RhinoDocUndoRecord
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RhinoDocUndoRecord : IDisposable
Public Class RhinoDocUndoRecord
	Implements IDisposable
The RhinoDocUndoRecord type exposes the following members.
Constructors
Name | Description
RhinoDocUndoRecord(RhinoDoc, String)
 Begin a RhinoDoc undo record.
RhinoDocUndoRecord(UInt32, String)
 Begin a RhinoDoc undo record.
Top
Methods
Name | Description
Dispose
 IDisposable implementaton
Top
Examples
 Use this like so:
using (var undo = new RhinoDocUndoRecord(doc, "Test"))
{
  var circle = new Circle(Point3d.Origin, 6.0);
  doc.Objects.AddCircle(circle);
  doc.Views.Redraw();
}
See Also
Reference
Rhino Namespace