RhinoCommon API
MarkupTable Class
Collection of markups for a document
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<Markup>
 Rhino.DocObjects.Tables.RhinoDocCommonTable<Markup>
 Rhino.DocObjects.Tables.MarkupTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public sealed class MarkupTable : RhinoDocCommonTable<Markup>,
	ICollection<Markup>, IEnumerable<Markup>, IEnumerable
Public NotInheritable Class MarkupTable
	Inherits RhinoDocCommonTable(Of Markup)
	Implements ICollection(Of Markup), IEnumerable(Of Markup),
	IEnumerable
The MarkupTable type exposes the following members.
Properties
Name | Description
ActiveCount
 Returns number of markups in the table, excluding deleted markups.
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
 Returns number of markups in the table, including deleted markups.
Document
Document that owns this table.
Item
 Conceptually, the markup table is an array of markups. The operator[] can be used to get individual markups. A markup is either active or deleted and this state is reported by Markup.IsDeleted.
Top
Methods
Name | Description
Add
 Adds a new markup with specified definition to the table.
AddReferenceMarkup
 Adds a reference markup that will not be saved in files.
Delete(Markup)
 Deletes a markup.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(IEnumerable<Int32>, Boolean)
 Delete multiple markups.
Delete(Int32, Boolean)
 Deletes a markup.
Delete(IEnumerable<Int32>, Boolean, Int32)
 Delete multiple markups.
Duplicate
 Duplicates a markup.
Find(String)
Finds the markup with a given name.
Find(Guid, Boolean)
Finds a markup with a matching ID.
FindIndex
 Retrieves a markup based on Index. This type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
Finds the markup with a given name.
GetEnumerator |  (Overrides CommonComponentTable<T>.GetEnumerator().)
GetUnusedMarkupName
 Gets unused markup name used as default when creating new markups.
Modify
Modify markup settings.
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace