RhinoCommon API
RenderPanels.ExtraSidePanePosition Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderPanels.ExtraSidePanePosition"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum ExtraSidePanePosition
Public Enumeration ExtraSidePanePosition
Members
Member name | Value | Description
Left | 0
Top | 1
Right | 2
Bottom | 3
See Also
Reference
Rhino.Render Namespace