RhinoCommon API
FileDwg Class
 Support for writing DWG file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileDwg
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileDwg
Public NotInheritable Class FileDwg
The FileDwg type exposes the following members.
Methods
Name | Description
Read
Read a DWG file into a RhinoDoc
Write
Write a DWG file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace