RhinoCommon API
EarthCoordinateSystem Enumeration
 ON::EarthCoordinateSystem identifies the standard used to define Earth latitude, longitude, and elevation coordinates.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum EarthCoordinateSystem
Public Enumeration EarthCoordinateSystem
Members
Member name | Value | Description
Unset | 0 |  ON::EarthCoordinateSystem::Unset
GroundLevel | 1 |  ON::EarthCoordinateSystem::GroundLevel Not well defined, but latitude and longitude will be good enough for architecture sun studies.
MeanSeaLevel | 2 |  ON::EarthCoordinateSystem::MeanSeaLevel Not well defined, but latitude and longitude will be good enough for architecture sun studies.
CenterOfEarth | 3 |  ON::EarthCoordinateSystem::CenterOfEarth Not well defined. The Earth's center of mass and center of volume are at different locations.
WGS1984 | 5 |  ON::EarthCoordinateSystem::WGS1984 World Geodetic System 1984 standard. (Current GPS standard.)
EGM2008 | 6 |  ON::EarthCoordinateSystem::EGM2008 Earth Gravitational Model 2008 standard.
See Also
Reference
Rhino.DocObjects Namespace