RhinoCommon API
UserInterfaceSlider Class
 Sliders allow dragging a grip back and forth along a defined range
Inheritance Hierarchy
System.Object
 Rhino.UI.UserInterfaceObjectBase
 Rhino.UI.UserInterfaceControl
 Rhino.UI.UserInterfaceSlider
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class UserInterfaceSlider : UserInterfaceControl
Public Class UserInterfaceSlider
	Inherits UserInterfaceControl
The UserInterfaceSlider type exposes the following members.
Constructors
Name | Description
UserInterfaceSlider
Initializes a new instance of the UserInterfaceSlider class
Top
Properties
Name | Description
AllowValueAfterRangeEnd
 Set to true if you want to allow dragging of the slider grip after the end of the defined range.
AllowValueBeforeRangeStart
 Set to true if you want to allow dragging of the slider grip before the start of the defined range.
DigitPrecision
 Number of digits of precision for the slider. If you want the slider to only represent integer values, set the Digits value to 0.
DisplayValue
 Should the slider display the current value as text on the screen
HorizontalOrientation
Range
 The range of acceptable values for the slider
Value
 Current value that the slider represents
Top
Methods
Name | Description
OnValueChanged
 Called when the slider's value changes. The default implementation calls the ValueChanged event
ValueAsFormattedString
 Formatted string shown based on value and digit precision
Top
Events
Name | Description
ValueChanged
 Event triggered when the slider's value changes
Top
See Also
Reference
Rhino.UI Namespace