RhinoCommon API
NotificationButtonClickedArgs Class
 Used when a button is clicked for a notification.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Runtime.Notifications.NotificationButtonClickedArgs
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class NotificationButtonClickedArgs : EventArgs
Public Class NotificationButtonClickedArgs
	Inherits EventArgs
The NotificationButtonClickedArgs type exposes the following members.
Constructors
Name | Description
NotificationButtonClickedArgs
 Creates a new instance.
Top
Properties
Name | Description
ButtonClicked
 The button that was clicked.
Notification
 The notification whose button was clicked.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Runtime.Notifications Namespace