RhinoCommon API
Skin Class
 Represents a customized environment that changes the appearance of Rhino.
Skin DLLs must contain a single class that derives from the Skin class.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.Skin
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class Skin
Public MustInherit Class Skin
The Skin type exposes the following members.
Constructors
Name | Description
Skin
 Initializes a new instance of the Skin class.
Top
Properties
Name | Description
ActiveSkin
 Any time Rhino is running there is at most one skin being used (and possibly no skin). If a RhinoCommon based Skin class is being used, use ActiveSkin to get at the instance of this Skin class. May return null if no Skin is being used or if the skin is not a RhinoCommon based skin.
ApplicationName
If you want to provide a custom name for your skin.
HasBootSplash
 True when the platform's native boot splash is compiled in and shown at startup.
MainRhinoIcon
If you want to provide a custom icon for your skin.
Settings
 Gets access to the skin persistent settings.
SettingsDirectory
 Get the skin's settings directory. This is the directory where the skin's persistent settings files are saved, matching the location used by Settings. Note, this does not verify the directory exists.
Top
Methods
Name | Description
DismissBootSplash
 Tells the platform's boot splash to dismiss, if one is up. Call this from a Skin subclass once its own window is on screen. No-op on platforms that have no boot splash.
HideSplash
Is called when the splash screen should be hidden.
OnBeginLoadAtStartPlugIns
Is called when the first plug-in that loads at start-up is going to be loaded.
OnBeginLoadPlugIn
Is called when a specific plug-in is going to be loaded.
OnBuiltInCommandsRegistered
Is called when built-in commands are registered.
OnEndLoadAtStartPlugIns
Is called after all of the load at start plug-ins have been loaded.
OnEndLoadPlugIn
Is called after each plug-in has been loaded.
OnLicenseCheckCompleted
Is called when the license check is completed.
OnMainFrameWindowCreated
Is called when the main frame window is created.
OpenNewDocument
 Creates a new RhinoDoc from the given template (or a blank document when the path is null/empty/missing) and brings up its document window. Must be called on the main UI thread.
SetBootSplashProgress
 Pushes a progress value to the platform's boot splash so it can paint a progress bar. The value is treated as a percentage and clamped to 0..100 on the native side. No-op on platforms that have no boot splash, and harmless if the splash is already gone.
ShowChooseRecent
 Called when the host requests the Skin's "choose recent" UI. Default implementation is empty.
ShowChooseTemplate
 Called when the host requests the Skin's "choose template" UI (e.g. from the File > New Using Template menu item). Default implementation is empty.
ShowHelp
 Called when the "help" splash screen should be shown. Default implementation just calls ShowSplash()
ShowSplash
Is called when the splash screen should be shown.
Top
See Also
Reference
Rhino.Runtime Namespace