RhinoCommon API
GetSphere.MeshSphereStyle Enumeration
Mesh sphere styles enumeration.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum MeshSphereStyle
Public Enumeration MeshSphereStyle
Members
Member name | Value | Description
UV | 0 | UV Sphere.
Triangle | 1 | Icosahedron Sphere.
Quad | 2 | Quad Sphere.
See Also
Reference
Rhino.Input.Custom Namespace