RhinoCommon API
FileStpWriteOptions Class
 Options used when writing a STP file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileStpWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileStpWriteOptions
Public Class FileStpWriteOptions
The FileStpWriteOptions type exposes the following members.
Constructors
Name | Description
FileStpWriteOptions
Initializes a new instance of the FileStpWriteOptions class
Top
Properties
Name | Description
AnalyticCurves
 Write straight edges as STEP line entities and let circular edges reference their circle directly, instead of writing degree 1 splines and trimmed curve wrappers. Some importers, sheet metal and CAM software in particular, require these analytic curves.
Export2dCurves
 Some (not most, and not Rhino) importing applications can make use of the 2-D trimming curves to get a more accurate and faster import. The size of the step file will be larger
ExportBlack
 Let importing application set color for black objects. If a Rhino object has color black, no color is assigned to the object in the step file.This will cause the importing application to give the object its default color.This is desirable because black objects look like ink blots in some applications.This option is grayed out if the schema option is AP203ControConfigDesign since that schema does not include color entities.
Schema
 Get and set the schema of the step file being written.
SplitClosedSurfaces
 Splits closed surfaces, for example, the interior surfaces of drilled holes.
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace