RhinoCommon API
FileUdoWriteOptions Class
 Options for writing a Moray UDO file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileUdoWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileUdoWriteOptions
Public Class FileUdoWriteOptions
The FileUdoWriteOptions type exposes the following members.
Constructors
Name | Description
FileUdoWriteOptions
Initializes a new instance of the FileUdoWriteOptions class
Top
Properties
Name | Description
MeshingParameters
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace