RhinoCommon API
CustomPointObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.CustomPointObject"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.PointObject
 Rhino.DocObjects.Custom.CustomPointObject
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class CustomPointObject : PointObject,
	IDisposable
Public MustInherit Class CustomPointObject
	Inherits PointObject
	Implements IDisposable
The CustomPointObject type exposes the following members.
Constructors
Name | Description
CustomPointObject()
Initializes a new instance of the CustomPointObject class
CustomPointObject(Point)
Initializes a new instance of the CustomPointObject class
Top
Properties
Name | Description
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Top
Methods
Name | Description
Dispose()
Releases all resources used by the CustomPointObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomPointObject and optionally releases the managed resources
 (Overrides CommonObject.Dispose(Boolean).)
Finalize |  (Overrides CommonObject.Finalize().)
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace