RhinoCommon API
LightManagerSupportClient Class
[Missing <summary> documentation for "T:Rhino.Render.LightManagerSupportClient"]
Inheritance Hierarchy
System.Object
 Rhino.Render.LightManagerSupportClient
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class LightManagerSupportClient : IDisposable
Public NotInheritable Class LightManagerSupportClient
	Implements IDisposable
The LightManagerSupportClient type exposes the following members.
Constructors
Name | Description
LightManagerSupportClient
Initializes a new instance of the LightManagerSupportClient class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
DeleteLight
Dispose
Releases all resources used by the LightManagerSupportClient
Finalize |  (Overrides Object.Finalize().)
GetLightFromId
GetLights
GetLightSolo
GroupLights
LightDescription
LightsInSoloStorage
ModifyLight
ObjectFromLight
OnEditLight
SetLightSolo
UnGroup
Top
See Also
Reference
Rhino.Render Namespace