RhinoCommon API
SupportOptions Class
[Missing <summary> documentation for "T:Rhino.Render.SupportOptions"]
Inheritance Hierarchy
System.Object
 Rhino.Render.SupportOptions
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class SupportOptions
Public NotInheritable Class SupportOptions
The SupportOptions type exposes the following members.
Methods
Name | Description
AlwaysShowSunPreview
AutoSaveKeepAmount
AutoSaveRenderings
BlockContent_CustomPath
BlockContent_CustomPathList
BlockContent_InitialLocation
BlockContent_InitialLocationCustomFolder
BlockContent_LastNavigatedLocation
BlockContent_SetCustomPath
BlockContent_SetCustomPathList
BlockContent_SetInitialLocation
BlockContent_SetInitialLocationCustomFolder
BlockContent_SetLastNavigatedLocation
BlockContent_SetShowBlockContent
BlockContent_SetShowCustom
BlockContent_SetShowDocuments
BlockContent_SetUseDefaultLocation
BlockContent_ShowBlockContent
BlockContent_ShowCustom
BlockContent_ShowDocuments
BlockContent_UseDefaultLocation
 Settings for the Block Content panel. This panel is the block-only sibling of the Libraries panel and keeps its own copy of the Libraries settings.
CheckSupportFilesBeforeRendering
CombineEditors
CustomLibraryPath |  Obsolete.
CustomPaths |  Obsolete.
DarkPreviewCheckerColor
EnablePreviewJobLog
FileExplorer_CustomPath
FileExplorer_CustomPathList
FileExplorer_InitialLocation
FileExplorer_InitialLocationCustomFolder
FileExplorer_LastNavigatedLocation
FileExplorer_SetCustomPath
FileExplorer_SetCustomPathList
FileExplorer_SetInitialLocation
FileExplorer_SetInitialLocationCustomFolder
FileExplorer_SetLastNavigatedLocation
FileExplorer_SetShowCustom
FileExplorer_SetShowDocuments
FileExplorer_SetShowRenderContent
FileExplorer_SetUseDefaultLocation
FileExplorer_ShowCustom
FileExplorer_ShowDocuments
FileExplorer_ShowRenderContent
FileExplorer_UseDefaultLocation
HarvestContentParameters
LabelFormatLoc
LabelFormatUtc
LastNavigatedLocation |  Obsolete.
Libraries_CustomPath
Libraries_CustomPathList
Libraries_InitialLocation
Libraries_InitialLocationCustomFolder
Libraries_LastNavigatedLocation
Libraries_SetCustomPath
Libraries_SetCustomPathList
Libraries_SetInitialLocation
Libraries_SetInitialLocationCustomFolder
Libraries_SetLastNavigatedLocation
Libraries_SetShowCustom
Libraries_SetShowDocuments
Libraries_SetShowRenderContent
Libraries_SetUseDefaultLocation
Libraries_ShowCustom
Libraries_ShowDocuments
Libraries_ShowRenderContent
Libraries_UseDefaultLocation
LibrariesInitialLocation |  Obsolete.
LibrariesInitialLocationCustomFolder |  Obsolete.
LightPreviewCheckerColor
MaxPreviewCacheMB
MaxPreviewSeconds
MultithreadedTextureEvaluation
PreferNativeRenderer
PreferredUnpackFolder
PreviewCustomRenderMeshes
SetAlwaysShowSunPreview
SetAutoSaveKeepAmount
SetAutoSaveRenderings
SetCheckSupportFilesBeforeRendering
SetCombineEditors
SetCustomLibraryPath |  Obsolete.
SetCustomPaths |  Obsolete.
SetHarvestContentParameters
SetLabelFormatLoc
SetLabelFormatUtc
SetLastNavigatedLocation |  Obsolete.
SetLibrariesInitialLocation |  Obsolete.
SetLibrariesInitialLocationCustomFolder |  Obsolete.
SetMultithreadedTextureEvaluation
SetPreferNativeRenderer
SetPreferredUnpackFolder
SetPreviewCustomRenderMeshes
SetShowCustom |  Obsolete.
SetShowDetailsPanel
SetShowDocuments |  Obsolete.
SetShowRenderContent |  Obsolete.
SetSupportSharedUIs
SetTextureSize |  Obsolete.
SetUseDefaultLibraryPath |  Obsolete.
SetUsePreviewCache
SetUseQuickInitialPreview
ShowCustom |  Obsolete.
ShowDetailsPanel
ShowDocuments |  Obsolete.
ShowRenderContent |  Obsolete.
SupportSharedUIs
SupportSharedUIsNoCache
TextureSize
UseDefaultLibraryPath |  Obsolete.
UsePreview
UsePreviewCache
UseQuickInitialPreview
UseRenderedPreview
Top
See Also
Reference
Rhino.Render Namespace