RhinoCommon API
Leader Class
 Leader geometry class
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Leader
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class Leader : AnnotationBase
<SerializableAttribute>
Public Class Leader
	Inherits AnnotationBase
The Leader type exposes the following members.
Constructors
Name | Description
Leader()
 Constructor
Leader(SerializationInfo, StreamingContext)
 Protected serialization constructor for internal use.
Top
Properties
Name | Description
Curve
 Gets the curve used by this leader
LeaderArrowBlockId
 Id of the block used as the arrow for the leader when the arrow type is 'User arrow'
LeaderArrowSize
 The size of the leader arrow
LeaderArrowType
 The arrowhead type for the leader
LeaderContentAngleStyle
 Angle for text of leader text
LeaderCurveStyle
 The style of the leader curve: polyline or spline
LeaderHasLanding
 Returns true if the leader has a landing line
LeaderLandingLength
 Gets or sets the length of the landing line
LeaderTextHorizontalAlignment
 Gets or sets the horizontal alignment of the leader's text
LeaderTextVerticalAlignment
 Gets or sets the vertical alignment of the leader's text
Points2D
 Get or set the 2d points defining the curve used by this leader
Points3D
 Get or set the 3d points defining the curve used by this leader
Top
Methods
Name | Description
Create
 Creates a Leader geometry object
CreateWithRichText
 Creates a Leader geometry object
Explode
 Explodes this leader into its geometric components.
Top
See Also
Reference
Rhino.Geometry Namespace