RhinoCommon API
FlairLayer Enumeration
[Missing <summary> documentation for "T:Rhino.Display.FlairLayer"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum FlairLayer
Public Enumeration FlairLayer
Members
Member name | Value | Description
Normals | 0
Depth | 1
Shadows | 2
Shading | 3
Material | 4
Details | 5
Background | 6
Selection | 7
Unknown | -1
See Also
Reference
Rhino.Display Namespace