RhinoCommon API
PlugIn.UnknownUserDataEventArgs Class
 Event argument passed to the UnknownUserData event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.PlugIns.PlugIn.UnknownUserDataEventArgs
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class UnknownUserDataEventArgs : EventArgs
Public Class UnknownUserDataEventArgs
	Inherits EventArgs
The PlugIn.UnknownUserDataEventArgs type exposes the following members.
Properties
Name | Description
Document
PlugInId
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.PlugIns Namespace