RhinoCommon API
ModelAidSettings Class
 Contains static methods and properties to modify model aid settings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.ModelAidSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class ModelAidSettings
Public NotInheritable Class ModelAidSettings
The ModelAidSettings type exposes the following members.
Properties
Name | Description
AltPlusArrow
true means Alt+arrow is used for nudging.
AutoAlignCPlane
 Gets or sets whether the cplane will automatically align to the selection
AutoCPlaneAlignment
 //0 = object, 1 = world, 2 = view
AutoGumballEnabled
 When AutoGumball is on, a gumball automatically appears when objects are pre-picked.
CenterSnapToApproximations
ControlPolygonDisplayDensity
Gets or sets the control polygon display density.
CtrlNudgeKeyStep
Gets or sets the Ctrl-key based nudge step amount.
DigitizerOsnapPickboxRadius
DisplayControlPolygon
Gets or sets the enabled state of Rhino's display control polygon.
DragStartsWindowSelection
 When enabled, a click and drag that starts on top of an object starts a window/crossing selection instead of dragging the object, the same as holding down the Alt key. Grip dragging and gumball dragging are not affected, and a click that does not drag still selects normally.
EnableOsnapHighlight
ExtendToApparentIntersection
Gets or sets the enabled state of Rhino's extend to apparent intersections.
ExtendTrimLines
Gets or sets the enabled state of Rhino's extend trim lines.
GridSnap
Gets or sets the enabled state of Rhino's grid snap modeling aid.
GumballAutoReset
 When GumballAutoReset is on the gumball resets its orientation after a drag When GumballAutoReset is off the gumball orientation is kept to where it was dragged
GumballExtrudeMergeFaces
 When ExtrudeMergeFaces is true the gumball will attempt to merge faces if possible after extruding a face
HighlightControlPolygon
Gets or sets the enabled state of Rhino's highlight dialog modeling aid.
MousePickboxRadius
radius of mouse pick box in pixels.
NearMidIntPerpSnapToMeshes
NudgeKeyStep
Gets or sets the nudge step amount.
NudgeMode
0 = world, 1 = cplane, 2 = view, 3 = UVN, -1 = not set.
OnlySnapToSelected
OrientAutoCPlaneToView
 Gets or sets whether the auto cplane will rotate towards the view after aligning to the selection
Ortho
Gets or sets the enabled state of Rhino's ortho modeling aid.
OrthoAngle
Gets or sets the base orthogonal angle.
OrthoUseZ
 Gets or sets whether Ortho will snap to the CPlane Z axis
Osnap
Enables or disables Rhino's object snap modeling aid.
OsnapCursorMode
Gets or sets the OSnap cursor mode.
OsnapModes
 Returns or sets Rhino's current object snap mode. The mode is a bitwise value based on the OsnapModes enumeration.
OsnapPickboxRadius
Enables or disables Rhino's planar modeling aid.
Planar
Gets or sets the enabled state of Rhino's Planar modeling aid.
PointDisplay
Gets or sets the point display mode.
ProjectSnapToCPlane
Gets or sets the enabled state of Rhino's Project modeling aid.
ProjectToCPlaneInPlanParallelViews
ShiftNudgeKeyStep
Gets or sets the Shift-key based nudge step amount.
SnappyGumballEnabled
 When SnappyGumball is on, a dragging a gumball moves the center point. When snappy gumball is off, dragging a gumball moves the mouse down point.
SnapToFiltered
SnapToLocked
Gets or sets the locked state of the snap modeling aid.
SnapToOccluded
StickyAutoCPlane
 Gets or set whether the auto cplane will stay even after deselection
UniversalConstructionPlaneMode
Gets or sets the locked state of the snap modeling aid.
UseHorizontalDialog
Gets or sets the enabled state of Rhino's use horizontal dialog modeling aid.
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings.
GetDefaultState
 Gets the factory settings.
UpdateFromState
 Updates from a particular setting state.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace