RhinoCommon API
RayShootEvent Structure
 Represents an element which is part of a ray shoot.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public struct RayShootEvent
Public Structure RayShootEvent
The RayShootEvent type exposes the following members.
Properties
Name | Description
BrepFaceIndex
 If GeometryIndex references a Brep, then the index of the Brep face that was hit. If GeometryIndex references a surface, than RhinoMath.UnsetIntIndex.
GeometryIndex
 The index of the surface or Brep that was hit.
Point
 The 3d hit point.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry.Intersect Namespace