RhinoCommon API
InstanceDefinitionTableEventType Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.InstanceDefinitionTableEventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.3
Syntax
public enum InstanceDefinitionTableEventType
Public Enumeration InstanceDefinitionTableEventType
Members
Member name | Value | Description
Added | 0
Deleted | 1
Undeleted | 2
Modified | 3
Sorted | 4 | InstanceDefinitionTable.Sort() potentially changed sort order.
See Also
Reference
Rhino.DocObjects.Tables Namespace