RhinoCommon API
AngleUnitSystem Enumeration
 ON::AngleUnitSystem identifies an angle unit system
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum AngleUnitSystem
Public Enumeration AngleUnitSystem
Members
Member name | Value | Description
None | 0 |  ON::AngleUnitSystem::None indicates no angle unit system is specified and model angle unit system should be used.
Turns | 1 |  1 turn = 2pi radians.
Radians | 2 |  1 turn = 2pi radians.
Degrees | 3 |  360 arc degrees = 1 turn = 2pi radians
Minutes | 4 |  60 arc minutes = 1 arc degree
Seconds | 5 |  60 arc seconds = 1 arc minute
Gradians | 6 |  400 gradians = 2pi radians.
Unset | 255 |  The ON::AngleUnitSystem::Unset is used to indicates no angle unit system has been specified in user interface code.
See Also
Reference
Rhino Namespace