RhinoCommon API
ColorHSV Structure
 Represents an HSV (Hue, Saturation, Value) color with double precision floating point channels. HSV colors (also sometimes called HSB, where B means Brightness) are similar to HSL colors in that they represent colors in a cylindrical color space, and are intended to provide intuitive means to edit the brightness of a particular color over RGB color space where each color channel would need to be modified to affect the color brightness.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public struct ColorHSV
<SerializableAttribute>
Public Structure ColorHSV
The ColorHSV type exposes the following members.
Constructors
Name | Description
ColorHSV(Color)
 Constructs a new instance of ColorHSV that is equivalent to an ARGB color.
ColorHSV(Double, Double, Double)
 Constructs a new instance of ColorHSV with custom channel values.
ColorHSV(Double, Double, Double, Double)
 Constructs a new instance of ColorHSV with custom channel values.
Top
Properties
Name | Description
A
 Gets or sets the alpha channel value. Alpha channels are limited to a 0~1 range.
H
 Gets or sets the hue channel value. Hue channels rotate between 0.0 and 1.0.
S
 Gets or sets the saturation channel value. Saturation channels are limited to a 0~1 range.
V
 Gets or sets the value (brightness) channel value. Value channels are limited to a 0~1 range.
Top
Methods
Name | Description
CreateFromCMYK
 Create the nearest HSV equivalent of a CMYK color.
CreateFromHSL
 Constructs the nearest HSV equivalent of an HSL color.
CreateFromLAB
 Create the nearest HSV equivalent of a LAB color.
CreateFromLCH
 Create the nearest HSV equivalent of a LCH color.
CreateFromRGBA
 Create the nearest HSV equivalent of a RGBA color.
CreateFromXYZ
 Create the nearest HSV equivalent of an XYZ color.
ToArgbColor
 Convert HSV color to an equivalent System.Drawing.Color.
Top
Operators
Name | Description
Implicit(ColorHSV to Color)
 Implicitly converts a ColorHSV in a .Net library color.
Top
See Also
Reference
Rhino.Display Namespace