RhinoCommon API
CommandPromptChangedEventArgs Class
 Event args for the CommandPromptChanged event
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.UI.CommandPromptChangedEventArgs
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class CommandPromptChangedEventArgs : EventArgs
Public Class CommandPromptChangedEventArgs
	Inherits EventArgs
The CommandPromptChangedEventArgs type exposes the following members.
Properties
Name | Description
Options
Active command line options
Prompt
Command line prompt text
PromptDefault
Default command line prompt text
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace