RhinoCommon API
PhysicallyBasedMaterial Class
Note: This API is now obsolete.
[Missing <summary> documentation for "T:Rhino.Render.PhysicallyBasedMaterial"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PhysicallyBasedMaterial
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use Rhino.Render.ParameterNames.PhysicallyBased and Rhino.Render.ChildSlotNames.PhysicallyBaseds instead")]
public class PhysicallyBasedMaterial
<ObsoleteAttribute("Use Rhino.Render.ParameterNames.PhysicallyBased and Rhino.Render.ChildSlotNames.PhysicallyBaseds instead")>
Public Class PhysicallyBasedMaterial
The PhysicallyBasedMaterial type exposes the following members.
Constructors
Name | Description
PhysicallyBasedMaterial
Initializes a new instance of the PhysicallyBasedMaterial class
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace