RhinoCommon API
PlugInLoadTime Enumeration
 Rhino plug-in load time enumeration.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum PlugInLoadTime
Public Enumeration PlugInLoadTime
Members
Member name | Value | Description
Disabled | 0 | never load plug-in.
AtStartup | 1 | Load when Rhino starts.
WhenNeeded | 2 | (default) Load the first time a plug-in command used.
WhenNeededIgnoreDockingBars | 6 | Load the first time a plug-in command used NOT when restoring docking control bars.
WhenNeededOrOptionsDialog | 10 | When a plug-in command is used or the options dialog is shown.
WhenNeededOrTabbedDockBar | 18 | When a plug-in command is used or when a tabbed dockbar is loaded.
See Also
Reference
Rhino.PlugIns Namespace