RhinoCommon API
IRhRdkContentThumbnailList_Sizes Enumeration
Note: This API is now obsolete.
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnailList_Sizes"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("IRhRdkContentThumbnailList_Sizes is obsolete", false)]
public enum IRhRdkContentThumbnailList_Sizes
<ObsoleteAttribute("IRhRdkContentThumbnailList_Sizes is obsolete", false)>
Public Enumeration IRhRdkContentThumbnailList_Sizes
Members
Member name | Value | Description
Tiny | 0 | Tiny thumbnails.
Small | 1 | Small thumbnails.
Medium | 2 | Medium thumbnails.
Large | 3 | Large thumbnails.
Custom | 4 | Custom-sized thumbnails.
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace