RhinoCommon API
PhysicallyBasedMaterial.ParametersNames Class
Note: This API is now obsolete.
 Helper class with fields containing the names of fields available in our PBR implementation.
Inheritance Hierarchy
System.Object
 Rhino.Render.PhysicallyBasedMaterial.ParametersNames
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use Rhino.Render.ParameterNames.PhysicallyBased and Rhino.Render.ChildSlotNames.PhysicallyBaseds instead")]
public class ParametersNames
<ObsoleteAttribute("Use Rhino.Render.ParameterNames.PhysicallyBased and Rhino.Render.ChildSlotNames.PhysicallyBaseds instead")>
Public Class ParametersNames
The PhysicallyBasedMaterial.ParametersNames type exposes the following members.
Constructors
Name | Description
PhysicallyBasedMaterial.ParametersNames
Initializes a new instance of the PhysicallyBasedMaterial.ParametersNames class
Top
Properties
Name | Description
AmbientOcclusion |  Obsolete.
Anisotropic |  Obsolete.
AnisotropicRotation |  Obsolete.
BaseColor |  Obsolete.
BRDF |  Obsolete.
Bump |  Obsolete.
Clearcoat |  Obsolete.
ClearcoatBump |  Obsolete.
ClearcoatRoughness |  Obsolete.
Displacement |  Obsolete.
Emission |  Obsolete.
Metallic |  Obsolete.
Normal |  Obsolete.
Opacity |  Obsolete.
OpacityIor |  Obsolete.
OpacityRoughness |  Obsolete.
Roughness |  Obsolete.
Sheen |  Obsolete.
SheenTint |  Obsolete.
Smudge |  Obsolete.
Specular |  Obsolete.
SpecularTint |  Obsolete.
Subsurface |  Obsolete.
SubsurfaceScatteringColor |  Obsolete.
SubsurfaceScatteringRadius |  Obsolete.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace