RhinoCommon API
BrepEdgeFilletDistance Class
 Fillet distances along a BrepEdge
Inheritance Hierarchy
System.Object
 Rhino.Geometry.BrepEdgeFilletDistance
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public class BrepEdgeFilletDistance
Public Class BrepEdgeFilletDistance
The BrepEdgeFilletDistance type exposes the following members.
Constructors
Name | Description
BrepEdgeFilletDistance
 Construct a fillet distance
Top
Properties
Name | Description
EdgeParameter
 The parameter along the BrepEdge where to apply a fillet distance (radius)
FilletDistance
 Distance to fillet
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace