RhinoCommon API
SimpleArrayLinetypePointer Class
 Wrapper for a C++ ON_SimpleArray<ON_Linetype*> If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArrayLinetypePointer : IDisposable
Public Class SimpleArrayLinetypePointer
	Implements IDisposable
The SimpleArrayLinetypePointer type exposes the following members.
Constructors
Name | Description
SimpleArrayLinetypePointer
 Initializes a new SimpleArrayLinetypePointer instance.
Top
Properties
Name | Description
Count
 Gets the amount of linetypes in this array.
Top
Methods
Name | Description
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 Dispose
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToNonConstArray
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace