RhinoCommon API
CreateTexture2dPreviewEventArgs Class
[Missing <summary> documentation for "T:Rhino.Render.CreateTexture2dPreviewEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.CreateTexture2dPreviewEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class CreateTexture2dPreviewEventArgs : EventArgs
Public Class CreateTexture2dPreviewEventArgs
	Inherits EventArgs
The CreateTexture2dPreviewEventArgs type exposes the following members.
Properties
Name | Description
PreviewImage
 Initially null. If this image is set, then this image will be used for the preview. If never set, the default internal simulation preview will be used.
PreviewImageSize
 Pixel size of the image that is being requested for the preview scene
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace