RhinoCommon API
RenderPropertyChangedEvent Class
 Used by Rhino.Render object property value has changed events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RenderPropertyChangedEvent
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderPropertyChangedEvent : EventArgs
Public Class RenderPropertyChangedEvent
	Inherits EventArgs
The RenderPropertyChangedEvent type exposes the following members.
Properties
Name | Description
Context
 Optional argument which may specify the property being modified.
Document
 The document triggering the event.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace