RhinoCommon API
MouseCallbackEventArgs Class
[Missing <summary> documentation for "T:Rhino.UI.MouseCallbackEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 System.ComponentModel.CancelEventArgs
 Rhino.UI.MouseCallbackEventArgs
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MouseCallbackEventArgs : CancelEventArgs
Public Class MouseCallbackEventArgs
	Inherits CancelEventArgs
The MouseCallbackEventArgs type exposes the following members.
Properties
Name | Description
CtrlKeyDown
MouseButton
ShiftKeyDown
View
ViewportPoint
Top
Methods
Name | Description
IsOverGumball
Top
See Also
Reference
Rhino.UI Namespace