RhinoCommon API
RhinoAccountsServerNotReachableException Class
 Exception thrown when the Rhino Accounts server cannot be reached due to a network problem.
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.RhinoAccounts.RhinoAccountsException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsServerNotReachableException
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class RhinoAccountsServerNotReachableException : RhinoAccountsException
<SerializableAttribute>
Public Class RhinoAccountsServerNotReachableException
	Inherits RhinoAccountsException
The RhinoAccountsServerNotReachableException type exposes the following members.
Constructors
Name | Description
RhinoAccountsServerNotReachableException(Exception)
 Generates a new instance of the exception.
RhinoAccountsServerNotReachableException(String, Exception)
 Generates a new instance of the exception.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace