RhinoCommon API
ToolbarFile Class
 Represents a Rhino toolbar, or .RUI, file.
Inheritance Hierarchy
System.Object
 Rhino.UI.ToolbarFile
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public sealed class ToolbarFile
Public NotInheritable Class ToolbarFile
The ToolbarFile type exposes the following members.
Properties
Name | Description
GroupCount
 Get the number of toolbar groups in the toolbar file.
Id
 Gets the id of the toolbar file.
Name
 Gets the name, or alias, of the toolbar file.
Path
 Gets the full path to the toolbar file.
ToolbarCount
 Get the number of toolbars in the toolbar file.
Top
Methods
Name | Description
Close
 Closes the toolbar file.
GetGroup(Int32)
 Gets a toolbar group.
GetGroup(String)
 Gets a toolbar group.
GetSvg
 Gets the SVG string for an image in this toolbar file.
GetToolbar
 Gets a toolbar.
Save
 Saves the toolbar file.
SaveAs
 Saves the toolbar file to a different path.
Top
See Also
Reference
Rhino.UI Namespace