RhinoCommon API
PickMode Enumeration
 Picking can happen in wireframe or shaded display mode
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum PickMode
Public Enumeration PickMode
Members
Member name | Value | Description
Wireframe | 1
Shaded | 2
See Also
Reference
Rhino.Input.Custom Namespace