RhinoCommon API
ClippingPlaneSurface Class
 Represents a planar surface that is used as clipping plane in viewports. A clipping plane object maintains a list of viewports that it clips against.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.PlaneSurface
 Rhino.Geometry.ClippingPlaneSurface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class ClippingPlaneSurface : PlaneSurface
<SerializableAttribute>
Public Class ClippingPlaneSurface
	Inherits PlaneSurface
The ClippingPlaneSurface type exposes the following members.
Constructors
Name | Description
ClippingPlaneSurface()
 Constructs an empty clipping plane surface
ClippingPlaneSurface(Plane)
 Constructs a clipping plane surface from a Plane
ClippingPlaneSurface(PlaneSurface)
 Constructs a ClippingPlaneSurface from a PlaneSurface
ClippingPlaneSurface(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
DimensionStyleId
 The id of the dimstyle used by this clipping plane surface. This is used to help determine how the clipping plane is drawn with respect to things like arrows and fonts
ParticipationListsEnabled
 Should the object and layer participation lists be used when determining clipping
PlaneDepth
 Distance that the clipping has an effect
PlaneDepthEnabled
 Determines if the PlaneDepth value should be used
Top
Methods
Name | Description
AddClipViewportId
 Adds a viewport id to the list of viewports that this clipping plane clips.
ClearClipParticipationLists
 Remove list of object ids that this clipping plane surface clips. This causes the clipping plane surface to clip all objects
GetClipParticipation
RemoveClipViewportId
 Removes a viewport id that this being clipped by this clipping plane.
SetClipParticipation
 Set a list of specific object ids and layers that this clipping plane surface clips.
ViewportIds
 Returns the ids of RhinoViewport objects that are clipped by this clipping plane.
Top
See Also
Reference
Rhino.Geometry Namespace