RhinoCommon API
SectionStyleTableEventType Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.SectionStyleTableEventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum SectionStyleTableEventType
Public Enumeration SectionStyleTableEventType
Members
Member name | Value | Description
Added | 0 |  A section style was added to the document's section style table.
Deleted | 1 |  A section style in the document's section style table was deleted.
Undeleted | 2 |  A section style in the document's section style table was undeleted.
Modified | 3 |  A section style in the document's section style table was modified.
Sorted | 4 |  The document's section style table was sorted.
See Also
Reference
Rhino.DocObjects.Tables Namespace