RhinoCommon API
DecalProjection Enumeration
[Missing <summary> documentation for "T:Rhino.Render.DecalProjection"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public enum DecalProjection
Public Enumeration DecalProjection
Members
Member name | Value | Description
None | -1 | No projection
Forward | 0 | Project forward
Backward | 1 | Project backward
Both | 2 | Project forward and backward
See Also
Reference
Rhino.Render Namespace