RhinoCommon API
FileDwgWriteOptions.ExportSurfaceMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileDwgWriteOptions.ExportSurfaceMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum ExportSurfaceMode
Public Enumeration ExportSurfaceMode
Members
Member name | Value | Description
Solids | 0
Curves | 1
Meshes | 2
See Also
Reference
Rhino.FileIO Namespace