RhinoCommon API
FileStlReadOptions Class
 Options for reading a STL file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileStlReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileStlReadOptions
Public Class FileStlReadOptions
The FileStlReadOptions type exposes the following members.
Constructors
Name | Description
FileStlReadOptions
Initializes a new instance of the FileStlReadOptions class
Top
Properties
Name | Description
SplitDisjointMeshes
STLModelUnits
UseFileNameAsObjectName
Weld
WeldAngle
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace