RhinoCommon API
AdvancedSetting Enumeration
Advanced setting Id
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum AdvancedSetting
Public Enumeration AdvancedSetting
Members
Member name | Value | Description
UseCompressionWhenSaving | 0 |  Use compressed buffers when saving 3dm files (default is true).
TestAdvancedString | 1 |  String value, defaults to "test string"
TestAdvancedInt | 2 |  Integer value, defaults 123
PdfOptionalContentGroups | 3 |  How optional content should be included when exporting PDF files
LeaveFloatingPanelsHiddenOnMac | 4 |  Bool value used on Mac to satisfy a user request to hide floating stuff when a command starts and leave it hidden when the command ends. This is false by default. https://mcneel.myjetbrains.com/youtrack/issue/RH-57945
DisableFileWatchers | 5 |  Disable file watchers, using to diagnose Mac Rhino mystery crashes https://mcneel.myjetbrains.com/youtrack/issue/RH-52805
EnableCheckForUpdates | 6 |  Auto check for update, enabled by default on Mac, does not show up in Windows https://mcneel.myjetbrains.com/youtrack/issue/RH-60427
LeftJustifyNumericText | 7 |  Mainly an issue on Windows; there are different numeric controls scattered across the product and no consistent text alignment. This is an attempt to provide a way to control the preferred alignment style.
EnableWindowsGestures | 8 |  https://mcneel.myjetbrains.com/youtrack/issue/RH-62173 Disable gestures for Windows views for a customer who was complaining when upgrading.
MakeInteriorNgonVertexesSelectable | 9 |  Set this to false if you only want boundary vertexes selectable when you run PointsOn. https://mcneel.myjetbrains.com/youtrack/issue/RH-62140
MacDisplayOldVersionAutosaveWarning | 10 |  Set this to true if you want to be warned about autosave for old file versions on Mac. https://mcneel.myjetbrains.com/youtrack/issue/RH-62359
UseNewMissingFontUI | 11 |  Set this to true if you want to be use the new missing font mapping UI. https://mcneel.myjetbrains.com/youtrack/issue/RH-62642
ExportDocumentUserText | 12 |  Set to true to write document user text on Export and Copy/Paste. Set to false to not write document user text (default). https://mcneel.myjetbrains.com/youtrack/issue/RH-63589
CommandsToIgnoreWhenAutoHidingToolPalettes | 13 |  String list of command names to ignore when closing tool-palette on begin command. https://mcneel.myjetbrains.com/youtrack/issue/RH-65131
DisplayNonOriginModelBasepointWarning | 14 |  Set this to true if you want to be warned about ModelBasepoints that are not set to the origin on open/import. https://mcneel.myjetbrains.com/youtrack/issue/RH-67520
UseEntireWidthForTopBand | 15 |  Use the entire client width for top and bottom dock sites https://mcneel.myjetbrains.com/youtrack/issue/RH-67783
UseMFCMenuBar | 16 |  Experimenting with using a CMFCMenuBar to host main frame menu with a CMFCVisualManager derived class for styling the menu. https://mcneel.myjetbrains.com/youtrack/issue/RH-70314
UseMenuIcons | 17 |  Show SVG command icons in the main menu. https://mcneel.myjetbrains.com/youtrack/issue/RH-97848
IgnoreRUIPlatform | 18 |  Will ignore the platforms attribute in RUI files when set. Requires restarting Rhino to take affect. https://mcneel.myjetbrains.com/youtrack/issue/RH-70777
EnableMcNeelOnlyFeatures | 19 |  Enable McNeel only features for a particular user
UseRhinoColorsForModalDialogs | 20 |  Enable to use Eto Appearance page only
AcadExportSelectUnexportableObjects | 21 |  Set to true to select objects that could not be exported to DWG, either becuase the object was invalid or the exporter failed for whatever reason. https://mcneel.myjetbrains.com/youtrack/issue/RH-77693
AcadExportSortLayers | 22 |  Temporary advanced settings for 8.x so no UI is required. Will be removed in 9.x when proper UI us added. https://mcneel.myjetbrains.com/youtrack/issue/RH-78977 https://mcneel.myjetbrains.com/youtrack/issue/RH-28804 https://mcneel.myjetbrains.com/youtrack/issue/RH-48103
AcadExportWriteEmptyLayers | 23 |  ditto
AcadImportLinetypeTextAsCurves | 24 |  Sets whether we get curves from the shx for linetype text or create actual text
DisableModelAndPageUnitsDifferDialog | 25 |  Advanced settings to re-enable the units helper dialogs. see https://mcneel.myjetbrains.com/youtrack/issue/RH-81439
DisablePageUnitsNotInchesOrMMDialog | 26 |  ditto
UseLegacyCurveJoiner | 27 |  6-May-2024 Dale Fugier, https://mcneel.myjetbrains.com/youtrack/issue/RH-81815
UseLegacyBrepCapper | 28 |  13-Jun-2024 Dale Fugier, https://mcneel.myjetbrains.com/youtrack/issue/RH-82566
HideFloatingWindowsOnDeactivate | 29 |  19-Sep-2024 Dale Fugier, https://mcneel.myjetbrains.com/youtrack/issue/RH-83845
RecordAnimationTargetFolder | 30 |  14-Oct-2024 Nathan Letwory, https://mcneel.myjetbrains.com/youtrack/issue/RH-79386
MRUFileCount | 31 |  Set number of max files to display in the MRU list Note that anything above 9 cannot be accessed with an accelator key. https://mcneel.myjetbrains.com/youtrack/issue/RH-78502
NotesUseSpacesForTabs | 32 |  Allow spaces to be used in place of tabs in Notes. https://mcneel.myjetbrains.com/youtrack/issue/RH-95377
NotesTabWidth | 33 |  Sets the number of spaces to use when NotesUseSpacesForTabs is true. https://mcneel.myjetbrains.com/youtrack/issue/RH-95377
CaptureExceptionStackDumps | 34 |  When true, geometry-error catch sites arm Rh::Diag throw-site capture before their try block and attach the resulting .dmp/.ips to the LogGeometryError report. Default is false because the throw-time minidump write is not free.
PatchUntrimmedNewMethod | 35 |  When true, untrimmed four-sided patches are created with the new method. The new method is still under development.
MarkupMinimumCaptureSize | 36 |  Minimum size in pixels for the larger dimension of the background bitmap captured when a markup is saved. Captures from smaller viewports are upscaled to this size (keeping the viewport's aspect ratio) so the stored background is not pixelated at view, thumbnail or export time. Larger viewports are never scaled down. Set to 0 to disable. Default is 1280. https://mcneel.myjetbrains.com/youtrack/issue/RH-97563
See Also
Reference
Rhino.Runtime Namespace