RhinoCommon API
GroupTableEventArgs Class
 Contains group table event data.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.Tables.GroupTableEventArgs
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GroupTableEventArgs : EventArgs
Public Class GroupTableEventArgs
	Inherits EventArgs
The GroupTableEventArgs type exposes the following members.
Properties
Name | Description
Document
 The document in which the event occurred.
EventType
 The event type.
GroupIndex
 The index of the Group that has changed.
NewState
 The Group that has changed.
OldState
 If the event is GroupTableEventType.Modified, then the old Group.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace