RhinoCommon API
Components Class
 Provides access to all Grasshopper runtime components.
Inheritance Hierarchy
System.Object
 Rhino.NodeInCode.Components
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class Components
Public MustInherit Class Components
The Components type exposes the following members.
Constructors
Name | Description
Components
Initializes a new instance of the Components class
Top
Properties
Name | Description
NodeInCodeFunctions
 Returns a collection with all component functions.
Top
Methods
Name | Description
__getAllFunctions
 Returns a collection with all component functions. For infrastructure usage only.
FindComponent
 Finds a component given its full name.
Top
See Also
Reference
Rhino.NodeInCode Namespace