RhinoCommon API
SilhouetteType Enumeration
 Enumerates the different types of silhouettes and their origins.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[FlagsAttribute]
public enum SilhouetteType
<FlagsAttribute>
Public Enumeration SilhouetteType
Members
Member name | Value | Description
None | 0 |  None.
Projecting | 1 |  Boundary of a region that projects to a curve. The view direction is tangent to the surface over the entire region.
TangentProjects | 2 |  Tangent silhouette curve where the curve projects to a point (within tolerance). In this case side_fill[i] is meaningless so it's left unset.
Tangent | 4 |  Tangent silhouette curve. The view direction is tangent to the surface along the curve.
Crease | 8 |  Crease on geometry that is a silhouette.
Boundary | 16 |  Boundary of geometry is always a silhouette.
NonSilhouetteCrease | 256 |  A non-silhouette crease, meaning both sides are visible.
NonSilhouetteTangent | 512 |  A non-silhouette tangent edge that is not a crease.
NonSilhouetteSeam | 1024 |  A non-silhouette surface seam.
SectionCut | 4096 |  Intersection with a clipping plane.
MiscellaneousFeature | 8192 |  Miscellaneous curve feature.
DraftCurve | 32768 |  Draft curve is a curve of constant draft angle.
See Also
Reference
Rhino.Geometry Namespace