RhinoCommon API
ReplayHistoryData Class
 Provides history information to commands that will repeat history construction. Generally, a developer using this class will not construct a new instance, but receive one.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.ReplayHistoryData
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ReplayHistoryData : IDisposable
Public Class ReplayHistoryData
	Implements IDisposable
The ReplayHistoryData type exposes the following members.
Properties
Name | Description
Document
The document this record belongs to
HistoryVersion
 ReplayHistory overrides check the version number to ensure the information saved in the history record is compatible with the current implementation of ReplayHistory
RecordId
 Each history record has a unique id that Rhino assigns when it adds the history record to the history record table
Results
 Provides access to BOTH inputs and outputs of the replay history operation.
Use this property to then call an appropriate UpdateToX() method and make your custom history support work.
Top
Methods
Name | Description
AppendHistoryResult
 Create an empty history result and add it to the end of the Results array. Note that you should call Results again if you need them as the old Results array will be out of sync with this class.
Dispose
Releases all resources used by the ReplayHistoryData
GetRhinoObjRef
 In ReplayHistory, use GetRhinoObjRef to convert the information in a history record into the ObjRef that has up to date RhinoObject pointers
TryGetBool
TryGetColor
TryGetDouble
TryGetDoubles
TryGetGuid
TryGetGuids
TryGetInt
TryGetInts
TryGetPoint3d
TryGetPoint3dOnObject
TryGetString
TryGetTransform
TryGetVector3d
UpdateResultArray
 Update the Results array with a different set of values. Null entries in the newResults will result in empty ReplayHistoryResult elements
Top
See Also
Reference
Rhino.DocObjects Namespace