RhinoCommon API
SectionStyleTableEventArgs Class
 Section style table event arguments.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.Tables.SectionStyleTableEventArgs
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public class SectionStyleTableEventArgs : EventArgs
Public Class SectionStyleTableEventArgs
	Inherits EventArgs
The SectionStyleTableEventArgs type exposes the following members.
Properties
Name | Description
Document
 The Rhino document.
EventType
 The event type.
Index
 The index of the section style.
NewState
 The section style.
OldState
 The old or previous section style.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace