RhinoCommon API
Light.Event Enumeration
 Light change type
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum Event
Public Enumeration Event
Members
Member name | Value | Description
Added | 0 |  Light was added
Deleted | 1 |  Light was deleted
Undeleted | 2 |  Light was undeleted
Modified | 3 |  Light was modified
Sorted | 4 |  Light was sorted in LightTable
See Also
Reference
Rhino.Render.ChangeQueue Namespace