RhinoCommon API
HiddenLineDrawingObjectCurve Class
 Curves generated from source objects which correspond to edges, and silhouettes of source objects and intersections with cutting planes. A HiddenLineDrawingObjectCurve is partitioned into hidden and visible segments called HiddenLineDrawingSegment
Inheritance Hierarchy
System.Object
 Rhino.Geometry.HiddenLineDrawingObjectCurve
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class HiddenLineDrawingObjectCurve
Public NotInheritable Class HiddenLineDrawingObjectCurve
The HiddenLineDrawingObjectCurve type exposes the following members.
Properties
Name | Description
ClippingPlaneIndex
 Index into HiddenLineDrawing.ClippingPlanes when SilhouetteType == SilhouetteType.SectionCut.
Index
 Index of this object in HiddenLineDrawing.FullCurves.
IsProjecting
 Returns true if all the non clipped portions of this curve are projecting.
IsValid
 Verifies the object is valid.
OriginalDomainStart
 Initialized to RhinoMath.UnsetValue. Valid if the full curve is closed. Rejoin can reparameterize the curve by moving the seam. When this has been done the original domain start is stored here.
Parameters
 Increasing, partition of curve.Domain.
Segments
 The HiddenLineDrawingCurve objects that make up this full curve.
SilhouetteType
 The silhouette event type
SourceObject
 Return the source object that this curve came from
SourceObjectComponentIndex
 Component of source object part that generated this curve.
Top
Methods
Name | Description
Curve(Double)
 Returns the HiddenLineDrawingCurve object containing parameter 't'.
Curve(Double, Int32)
 Returns the HiddenLineDrawingCurve object containing parameter 't'.
Top
See Also
Reference
Rhino.Geometry Namespace