RhinoCommon API
RhinoDoc.WorksessionFileChangeKind Enumeration
 Whether a worksession reference model is being attached or detached.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum WorksessionFileChangeKind
Public Enumeration WorksessionFileChangeKind
Members
Member name | Value | Description
Attached | 0 | A worksession reference model has just been attached.
Detached | 1 | A worksession reference model has just been detached.
BeforeDetach | 2 | A worksession reference model is about to be detached. The doc still contains the reference content at this point, so subscribers can identify what will be affected before it's purged.
See Also
Reference
Rhino Namespace