RhinoCommon API
ViewCapture Class
[Missing <summary> documentation for "T:Rhino.Display.ViewCapture"]
Inheritance Hierarchy
System.Object
 Rhino.Display.ViewCapture
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ViewCapture
Public Class ViewCapture
The ViewCapture type exposes the following members.
Constructors
Name | Description
ViewCapture
Initializes a new instance of the ViewCapture class
Top
Properties
Name | Description
DrawAxes
DrawGrid
DrawGridAxes
Height
 Height of capture in Pixels
Preview
RealtimeRenderPasses
ScaleScreenItems
TransparentBackground
Width
 Width of capture in Pixels
Top
Methods
Name | Description
CaptureToBitmap(RhinoView)
CaptureToBitmap(ViewCaptureSettings)
CaptureToSvg
SendToPrinter(String, ViewCaptureSettings[])
 Send a list of view capture settings to a printer. Each setting represents a single page.
SendToPrinter(String, ViewCaptureSettings[], Int32)
 Send a list of view capture settings to a printer. Each setting represents a single page.
Top
See Also
Reference
Rhino.Display Namespace