RhinoCommon API
DisplayPipelineAttributes.SurfaceNakedEdgeThicknessUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeThicknessUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public enum SurfaceNakedEdgeThicknessUse
Public Enumeration SurfaceNakedEdgeThicknessUse
Members
Member name | Value | Description
UseSurfaceEdgeSettings | 0
ObjectWidth | 1
Pixels | 2
See Also
Reference
Rhino.Display Namespace