RhinoCommon API
DisplayPipeline.InferenceLineType Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipeline.InferenceLineType"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.17
Syntax
public enum InferenceLineType
Public Enumeration InferenceLineType
Members
Member name | Value | Description
Chord | 0 |  A chord from P to Q
Ray | 1 |  A ray from P through Q
InfiniteLine | 2 |  An infinite line through P and Q
See Also
Reference
Rhino.Display Namespace