RhinoCommon API
RhinoObject.ObjectFrameFlags Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.RhinoObject.ObjectFrameFlags"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
[FlagsAttribute]
public enum ObjectFrameFlags
<FlagsAttribute>
Public Enumeration ObjectFrameFlags
Members
Member name | Value | Description
Standard | 0 |  Never returns unset plane. Will always calculate the plane even if nothing is stored.
IncludeScaleTransforms | 1 |  By default, the plane is orientation and rotation only. But scale transforms are stored if you need them.
ReturnUnset | 2 |  The object frame may be stored unset by default. If this is the case, and you want to know if it really is unset, this will tell you.
See Also
Reference
Rhino.DocObjects Namespace