RhinoCommon API
FileDwgWriteOptions Class
 Options for writing a DWG file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileDwgWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileDwgWriteOptions
Public Class FileDwgWriteOptions
The FileDwgWriteOptions type exposes the following members.
Constructors
Name | Description
FileDwgWriteOptions()
 AutoCAD version format to write to
FileDwgWriteOptions(FileDwgWriteOptions)
Initializes a new instance of the FileDwgWriteOptions class
Top
Properties
Name | Description
ColorMethod
pallette index: clrACI, RGB: clrRGB
CurveChordHeight
Absolute distance from pline to nurb
CurveMaxAngleDegrees
Angle between pline segments in writing curve
CurveMaxAngleRadians
Angle between pline segments in writing curve
CurveSegmentLength
Max length for any polyline segment
CurveUseChordHeight
CurveUseMaxAngle
CurveUseSegmentLength
ExportArcsAs
ExportLinesAs
ExportMeshesAs
Rhino meshes as polyface meshes or 3dfaces
ExportPolycurvesAs
ExportPolylinesAs
ExportSplinesAs
ExportSurfacesAs
Rhino surcaces as meshes(0) or curves(1) or acis(2)
Flatten
Project to cplane or view
FullLayerPath
write layernames as Parent$Child or Child
IsDefault
MinPointDistance
Name
NoDxfHeader
write an entities only dxf file ( R12 only)
PreserveArcNormals
Users wanted to use Pedit in AutoCAD to join them into plines and that didn't work if the normals of arcs being joined are different. Default will be true and will change the behavior
Simplify
use lines and arcs where possible
SimplifyTolerance
SplitPolycurves
Explode polycurves before exporting
SplitSplines
Split splines at FMKs before exporting
UseColor
Set AutoCAD display color with Rhino print or display color
UseLWPolylines
Version
 Version of DWG file to write
WriteThickCurves
Write extrusions with simple profile curves as thick curves.
Top
Methods
Name | Description
AddToDictionary
 Add these options to a dictionary, used by UIless dotnet export.
SetNamedParameters
 Add these options to a NamedParametersEventArgs, used in the dotnet version of the acad export UI.
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace