RhinoCommon API
RebuildCurveTangentMatching Enumeration
 RebuildCurveTangentMatch used used to specify tangent matching options.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum RebuildCurveTangentMatching
Public Enumeration RebuildCurveTangentMatching
Members
Member name | Value | Description
None | 0
AtStart | 1
AtEnd | 2
AtStartAndEnd | 3
See Also
Reference
Rhino.Geometry Namespace