RhinoCommon API
MeshVertexStatusList Class
 Provides access to status information relative to components of a mesh.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.MeshVertexStatusList
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MeshVertexStatusList : IResizableList<bool>,
	IList<bool>, ICollection<bool>, IEnumerable<bool>,
	IEnumerable, IList, ICollection, IReadOnlyList<bool>, IReadOnlyCollection<bool>
Public Class MeshVertexStatusList
	Implements IResizableList(Of Boolean), IList(Of Boolean),
	ICollection(Of Boolean), IEnumerable(Of Boolean), IEnumerable,
	IList, ICollection, IReadOnlyList(Of Boolean), IReadOnlyCollection(Of Boolean)
The MeshVertexStatusList type exposes the following members.
Properties
Name | Description
Capacity
 Gets or sets the total number of hidden vertex information the internal data structure can hold without resizing.
Count
 Gets or sets the number of hidden vertices. For this to be a valid part of a mesh, this count should be the same as the one of mesh vertices.
HiddenCount
 Gets a value indicating how many vertices have been set to hidden.
Item
 Gets or sets the hidden value at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
Methods
Name | Description
Add
 Adds a new flag at the end of the list.
AddRange
 Appends an array, a list or any enumerable of flags to the end of the list.
Clear
 Clears the hidden vertex list on the mesh. This results in a fully visible mesh.
Contains
 Determines if some vertices are hidden or some are shown.
CopyTo
 Copies to an array, starting at an index.
Destroy
 Releases all memory allocated to store hidden vertices. The list capacity will be 0 after this call.
Vertices will be immediately considered visible.
Subsequent calls can add new items.
GetEnumerator
 Gets an enumerator that yields all flags in this collection.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace