RhinoCommon API
TexturedFloat Class
 float specialization of TexturedValue.
Inheritance Hierarchy
System.Object
 Rhino.Render.TexturedValue<Single>
 Rhino.Render.TexturedFloat
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public class TexturedFloat : TexturedValue<float>
Public Class TexturedFloat
	Inherits TexturedValue(Of Single)
The TexturedFloat type exposes the following members.
Constructors
Name | Description
TexturedFloat
Initializes a new instance of the TexturedFloat class
Top
Methods
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Rhino.Render Namespace