RhinoCommon API
Font.FontWeight Enumeration
 Weight enum values Avoid casting these values to int. Use ON_Font::WindowsLogfontWeightFromWeight() or ON_Font::AppleWeightOfFontFromWeight() or add another converter.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum FontWeight
Public Enumeration FontWeight
Members
Member name | Value | Description
Unset | 0 |  Not set.
Thin | 1 |  IsLight = true
Ultralight | 2 |  IsLight = true
Light | 3 |  IsLight = true
Normal | 4 |  Default font weight. IsNormalWeight = true Also called Regular.
Medium | 5 |  IsNormalWeight = true
Semibold | 6 |  IsBold = true
Bold | 7 |  IsBold = true
Ultrabold | 8 |  IsBold = true
Heavy | 9 |  IsBold = true Also called Black
See Also
Reference
Rhino.DocObjects Namespace