RhinoCommon API
RenderMaterial.PreviewBackgroundType Enumeration
 The default scene background for the image that appears in preview panes
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.11
Syntax
public enum PreviewBackgroundType
Public Enumeration PreviewBackgroundType
Members
Member name | Value | Description
None | 1
Checkered | 2
Scene | 4
See Also
Reference
Rhino.Render Namespace