RhinoCommon API
SubDVertexList Class
 Provides access to all the vertices and vertex-related functionality of a SubD
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.SubDVertexList
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SubDVertexList : IEnumerable<SubDVertex>,
	IEnumerable
Public Class SubDVertexList
	Implements IEnumerable(Of SubDVertex), IEnumerable
The SubDVertexList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of SubD vertices.
First
 First vertex in this linked list of vertices
Top
Methods
Name | Description
Add
 Add a new vertex to the end of the Vertex list.
Find(Int32)
 Find a vertex in this SubD with a given id
Find(UInt32)
 Find a vertex in this SubD with a given id
GetEnumerator
 Implementation of IEnumerable, so a vertex list can be used with foreach and LINQ the same way SubDEdgeList and SubDFaceList can.
SetVertexTags(IEnumerable<SubDVertex>, SubDVertexTag)
 Set vertex tags for a list of vertices. Useful for adding creases to SubDs
SetVertexTags(IEnumerable<Int32>, SubDVertexTag)
 Set vertex tags for a list of vertices. Useful for adding creases to SubDs
Top
See Also
Reference
Rhino.Geometry.Collections Namespace