RhinoCommon API
Light Class
 ChangeQueue Light change representation
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.Light
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Light
Public Class Light
The Light type exposes the following members.
Properties
Name | Description
ChangeType
 Get what type of light change this represents
Data
 Get the actual light data
Id
 Get the light object id
IdCrc
 Get CRC computed from Id
MaterialId
 Get material ID of the material assigned to the light. Material ID is 0 if no material was assigned.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render.ChangeQueue Namespace