RhinoCommon API
AnimationProperties.CaptureTypes Enumeration
 Constants that define the mode of the animation tools.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.11
Syntax
public enum CaptureTypes
Public Enumeration CaptureTypes
Members
Member name | Value | Description
Path | 0 |  Camera and target movement along separate path curves
Turntable | 1 |  Rotate a view around the target.
Flythrough | 2 |  Camera and target movement along a path curve
DaySunStudy | 3 |  Sun movement through a specified calendar day
SeasonalSunStudy | 4 |  Sun movement through a specified week, month, or year
None | 5 |  No capture type specified
See Also
Reference
Rhino.DocObjects Namespace