RhinoCommon API
FileDwgWriteOptions.ExportMeshMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileDwgWriteOptions.ExportMeshMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum ExportMeshMode
Public Enumeration ExportMeshMode
Members
Member name | Value | Description
Meshes | 0
ThreeDFace | 1
See Also
Reference
Rhino.FileIO Namespace