RhinoCommon API
RenderPlugInInfo Class
[Missing <summary> documentation for "T:Rhino.Render.RenderPlugInInfo"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderPlugInInfo
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderPlugInInfo
Public Class RenderPlugInInfo
The RenderPlugInInfo type exposes the following members.
Properties
Name | Description
Name
PlugInId
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace