RhinoCommon API
IRhRdkThumbnailList Interface
Note: This API is now obsolete.
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("IRhRdkThumbnailList is obsolete", false)]
public interface IRhRdkThumbnailList
<ObsoleteAttribute("IRhRdkThumbnailList is obsolete", false)>
Public Interface IRhRdkThumbnailList
The IRhRdkThumbnailList type exposes the following members.
Methods
Name | Description
Add
Clear
Get
GetGridMetrics
GetSize
GetStatisticsHeaderHeight
Mode
SetClientText
SetCustomBitmapSize
SetMode
SetShowLabels
Shape
ShowLabels
UUID
Top
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace