RhinoCommon API
PersistentSettingsSavedEventArgs Class
 Event argument passed to the SettingsSaved event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.PersistentSettingsSavedEventArgs
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PersistentSettingsSavedEventArgs : EventArgs
Public Class PersistentSettingsSavedEventArgs
	Inherits EventArgs
The PersistentSettingsSavedEventArgs type exposes the following members.
Properties
Name | Description
PlugInSettings
 The old PlugIn settings
SavedByThisRhino
 Will be true if this instance of Rhino is writing the settings file or false if a different instance of Rhino has modified the settings file.
Top
Methods
Name | Description
CommandSettings
 The new command settings
Top
See Also
Reference
Rhino Namespace