RhinoCommon API
ZBiasMode Enumeration
 Biasing applied to geometry to attempt to get coplanar items to draw on top of or below other geometry
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum ZBiasMode
Public Enumeration ZBiasMode
Members
Member name | Value | Description
Neutral | 0
TowardsCamera | 1
AwayFromCamera | 2
See Also
Reference
Rhino.Display Namespace