RhinoCommon API
RhinoVariationalDomain Enumeration
 The type of trimming domain
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RhinoVariationalDomain
Public Enumeration RhinoVariationalDomain
Members
Member name | Value | Description
Projected | 0 |  Project the input curves to a least-squares plane
Molded | 1 |  Project the input curves to a least-squares plane, then iteratively mold the surface to the constraints.
Untrimmed | 2 |  Do not use a trimming domain
MultiBlend | 3 |  Create a multi-blend
See Also
Reference
Rhino.Geometry Namespace