RhinoCommon API
CrcRenderHashFlags Enumeration
[Missing <summary> documentation for "T:Rhino.Render.CrcRenderHashFlags"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.2
Syntax
[FlagsAttribute]
public enum CrcRenderHashFlags
<FlagsAttribute>
Public Enumeration CrcRenderHashFlags
Members
Member name | Value | Description
Normal | 0 |  Normal render CRC; nothing is excluded.
ExcludeLinearWorkflow | 1 |  Linear Workflow color and texture changes are not included.
ExcludeLocalMapping | 2 |  Local mapping is excluded (only used by Textures).
ExcludeUnits | 4 |  Units are excluded (only used by Textures).
Reserved2 | 8 |  Reserved for future use
ForSimulation | 1 |  Use this flag when simulating
ExcludeDocumentEffects | 13 |  Use this flag when you want to calculate the CRC independantly of any effect the document has on the content.
See Also
Reference
Rhino.Render Namespace