RhinoCommon API
RestoreLayerProperties Enumeration
 Layer State restoration flags
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.14
Syntax
[FlagsAttribute]
public enum RestoreLayerProperties
<FlagsAttribute>
Public Enumeration RestoreLayerProperties
Members
Member name | Value | Description
None | 0 |  Restore nothing
Current | 1 |  Restore current layer
Visible | 2 |  Restore layer visibility
Locked | 4 |  Restore layer locked status
Color | 8 |  Restore layer color
Linetype | 16 |  Restore layer linetype
PrintColor | 32 |  Restore layer print color
PrintWidth | 64 |  Restore layer print width
ViewportVisible | 128 |  Restore per-viewport layer visibility
ViewportColor | 256 |  Restore per-viewport layer color
ViewportPrintColor | 512 |  Restore per-viewport layer print color
ViewportPrintWidth | 1024 |  Restore per-viewport layer print width
RenderMaterial | 2048 |  Restore render material
SectionStyle | 4096 |  Section style
NewDetailOn | 8192 |  New Detail On
Expanded | 16384 |  Expanded/Collapsed state
All | 4294967295 |  Restore all layer properties
See Also
Reference
Rhino.DocObjects.Tables Namespace