RhinoCommon API
RenderContent.EmbedFilesChoice Enumeration
 Used by SaveToFile
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public enum EmbedFilesChoice
Public Enumeration EmbedFilesChoice
Members
Member name | Value | Description
NeverEmbed | 0 |  Never embed support files in the content file
AlwaysEmbed | 1 |  Always embed support files in the content file
AskUser | 2 |  Show a UI
See Also
Reference
Rhino.Render Namespace