RhinoCommon API
DisplayPipelineAttributes.FrameBufferFillMode Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.FrameBufferFillMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum FrameBufferFillMode
Public Enumeration FrameBufferFillMode
Members
Member name | Value | Description
DefaultColor | 1
SolidColor | 2
Gradient2Color | 3
Gradient4Color | 4
Bitmap | 5
Renderer | 6
Transparent | 7
See Also
Reference
Rhino.Display Namespace