RhinoCommon API
ViewInfo Class
 Represents the name and orientation of a View (and named view).
views can be thought of as cameras.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.ViewInfo
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ViewInfo : IDisposable
Public Class ViewInfo
	Implements IDisposable
The ViewInfo type exposes the following members.
Constructors
Name | Description
ViewInfo()
 Create a default ViewInfo instance
ViewInfo(RhinoViewport)
 Access to the ViewInfo for given RhinoViewport
ViewInfo(UInt32)
 Construct the ViewInfo for active viewport of given doc.
Top
Properties
Name | Description
ClippingPlanesIds
 Returns a list of clipping plane Ids associated with this view.
DisplayModeId
 The id of the display mode this view opens in - wireframe, shaded, rendered, or any custom display mode. DisplayModeDescription holds the standard ids. A nil id means the view has no display mode of its own and opens in wireframe, which is what every template generated without this property did.
FocalBlurAperture
 Gets or sets the Focal blur aperture of the active viewport
FocalBlurDistance
 Gets or sets the Focal blur distance of the active viewport
FocalBlurJitter
 Gets or sets the Focal blur jitter of the active viewport
FocalBlurMode
 Gets or sets the Focal blur mode of the active viewport
FocalBlurSampleCount
 Gets or sets the Focal blur sample count of the active viewport
LockedProjection
Whether the view's projection is locked against changes.
Maximized
 Gets or sets whether the view window is maximized in the frame window. Together with the window position (see GetWindowPosition(Double, Double, Double, Double)) this is stored in the 3dm file and controls the viewport layout when the file is opened.
Name
 Gets or sets the name of the view.
NamedViewId
 Returns a unique id if this is a named view otherwise an empty Guid.
RenderingSize
The pixel size this view renders at.
SectionBehavior
 How a view will interact with clipping planes
ShowConstructionAxes
Whether the construction plane x and y axes are drawn in this view.
ShowConstructionGrid
Whether the construction plane grid is drawn in this view.
ShowConstructionZAxis
Whether the construction plane z axis is drawn in this view.
ShowWallpaperInGrayScale
 True if wallpaper (if any) is to be shown in gray scale in this view.
ShowWorldAxes
Whether the world axes icon is drawn in the corner of this view.
Viewport
 Gets the viewport, or viewing frustum, associated with this view.
ViewType
 Whether this view is a model view, a layout page, a nested (detail) view, or one of the special editor views. A page view must be an orthographic top view; see PageSettings for its paper size.
WallpaperFilename
 Get filename for wallpaper set to this view, if any.
WallpaperHidden
 True if wallpaper (if any) is to be hidden from this view.
Top
Methods
Name | Description
ClippingPlaneSurfaces
 Returns a list of ClippingPlaneSurfaces for this view.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetConstructionPlane
 Gets the view's construction plane, including its grid settings: grid and snap spacing, grid line count, thick-line frequency, and depth buffering.
GetPageSettings
 Gets the paper size and margins of this view. Only meaningful when ViewType is PageView.
GetWindowPosition
 Gets the position of the view window in the frame window, expressed as fractions (0 to 1) of the frame window size.
SetConstructionPlane
 Sets the view's construction plane, including its grid settings.
SetPageSettings
 Sets the paper size and margins of this view. Set ViewType to PageView as well, or the page settings are ignored.
SetWindowPosition
 Sets the position of the view window in the frame window, expressed as fractions (0 to 1) of the frame window size. The Maximized state is preserved.
Top
See Also
Reference
Rhino.DocObjects Namespace