RhinoCommon API
CollapsibleSectionHolderImpl.CREATEFROMCPPPROC Delegate
[Missing <summary> documentation for "T:Rhino.UI.Controls.CollapsibleSectionHolderImpl.CREATEFROMCPPPROC"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate IntPtr CREATEFROMCPPPROC(
	IntPtr hwndParent,
	IntPtr contentUIPointer
)
Public Delegate Function CREATEFROMCPPPROC (
	hwndParent As IntPtr,
	contentUIPointer As IntPtr
) As IntPtr
Parameters
hwndParent
Type: System.IntPtr
contentUIPointer
Type: System.IntPtr
Return Value
Type: IntPtr
See Also
Reference
Rhino.UI.Controls Namespace