RhinoCommon API
Utilities.PreviewQuality Enumeration
 The quality of the rendered preview
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public enum PreviewQuality
Public Enumeration PreviewQuality
Members
Member name | Value | Description
None | 0
Low | 1
Medium | 2
IntermediateProgressive | 3
Full | 4
See Also
Reference
Rhino.Render Namespace