RhinoCommon API
Font.FontStyle Enumeration
 Vertical angle of font Upright, Italic, or Oblique
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum FontStyle
Public Enumeration FontStyle
Members
Member name | Value | Description
Unset | 0 |  Not set.
Upright | 1 |  Default font style.
Italic | 2 |  The face is sloped so the top is to the right of the base. Face names sometimes use the word "oblique" for italic faces.
Oblique | 3 |  The face is sloped so the top is to the left of the base. This is extremely rare. NOTE WELL: Face names sometimes use the word "oblique" for italic faces.
See Also
Reference
Rhino.DocObjects Namespace