RhinoCommon API
StringHolder Class
 This class is used to pass strings back and forth between managed and unmanaged code. This should not be needed by plug-ins.
If you are just dealing with an ON_wString*, use StringWrapper
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.StringHolder
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class StringHolder : IDisposable
Public Class StringHolder
	Implements IDisposable
The StringHolder type exposes the following members.
Constructors
Name | Description
StringHolder
 Constructor
Top
Methods
Name | Description
ConstPointer
 C++ pointer used to access the ON_wString, managed plug-ins should never need this.
Dispose()
 IDispose implementation
Dispose(Boolean)
 Called by Dispose and finalizer
Finalize
 Destructor
 (Overrides Object.Finalize().)
GetString
 Gets managed string from unmanaged ON_wString pointer.
NonConstPointer
 C++ pointer used to access the ON_wString, managed plug-ins should never need this.
ToString
 Marshals unmanaged ON_wString to a managed .NET string
 (Overrides Object.ToString().)
ToStringSafe
 Marshals unmanaged ON_wString to a managed .NET string and never returns null.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace