RhinoCommon API
FieldDictionary Class
 Dictionary containing RenderContent data fields. Add fields to this dictionary in your derived RenderContent classes constructor. Get field values using the TryGet[data type]() methods and set them using the Set() method.
Inheritance Hierarchy
System.Object
 Rhino.Render.Fields.FieldDictionary
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class FieldDictionary : IEnumerable
Public NotInheritable Class FieldDictionary
	Implements IEnumerable
The FieldDictionary type exposes the following members.
Methods
Name | Description
Add(String, Color4f)
 Add a new Color4fField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Point2d)
 Add a new Point2dField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Point3d)
 Add a new Point3dField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Point4d)
 Add a new Point4dField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Transform)
 Add a new TransformField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Vector2d)
 Add a new Vector2dField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Vector3d)
 Add a new Vector3dField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Boolean)
 Add a new BoolField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Byte[])
 AddField a new ByteArrayField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, DateTime)
 Add a new DateTimeField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Double)
 AddField a new DoubleField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Color)
 Add a new Color4fField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Guid)
 Add a new GuidField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Int32)
 Add a new IntField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Single)
 Add a new FloatField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, String)
 Add a new StringField to the dictionary. This will be a data only field and not show up in the content browsers.
Add(String, Color4f, String)
 Add a new Color4fField to the dictionary.
Add(String, Point2d, String)
 Add a new Point2dField to the dictionary.
Add(String, Point3d, String)
 Add a new Point3dField to the dictionary.
Add(String, Point4d, String)
 Add a new Point4dField to the dictionary.
Add(String, Transform, String)
 Add a new TransformField to the dictionary.
Add(String, Vector2d, String)
 Add a new Vector2dField to the dictionary.
Add(String, Vector3d, String)
 Add a new Vector3dField to the dictionary.
Add(String, Boolean, String)
 Add a new BoolField to the dictionary.
Add(String, DateTime, String)
 Add a new DateTimeField to the dictionary.
Add(String, Double, String)
 Add a new DoubleField to the dictionary.
Add(String, Color, String)
 Add a new Color4fField to the dictionary.
Add(String, Guid, String)
 Add a new GuidField to the dictionary.
Add(String, Int32, String)
 Add a new IntField to the dictionary.
Add(String, Single, String)
 AddField a new FloatField to the dictionary.
Add(String, String, Int32)
 Add a new NullField to the dictionary.
Add(String, String, String)
 Add a new StringField to the dictionary.
Add(String, Color4f, String, Int32)
 Add a new Color4fField to the dictionary.
Add(String, Point2d, String, Int32)
 Add a new Point2dField to the dictionary.
Add(String, Point3d, String, Int32)
 Add a new Point3dField to the dictionary.
Add(String, Point4d, String, Int32)
 Add a new Point4dField to the dictionary.
Add(String, Transform, String, Int32)
 Add a new TransformField to the dictionary.
Add(String, Vector2d, String, Int32)
 Add a new Vector2dField to the dictionary.
Add(String, Vector3d, String, Int32)
 Add a new Vector3dField to the dictionary.
Add(String, Boolean, String, Int32)
 Add a new BoolField to the dictionary.
Add(String, DateTime, String, Int32)
 Add a new DateTimeField to the dictionary.
Add(String, Double, String, Int32)
 Add a new DoubleField to the dictionary.
Add(String, Guid, String, Int32)
 Add a new GuidField to the dictionary.
Add(String, Int32, String, Int32)
 Add a new IntField to the dictionary.
Add(String, Single, String, Int32)
 AddField a new FloatField to the dictionary.
Add(String, String, String, Int32)
 Add a new StringField to the dictionary.
AddFilename
 Add a new StringField to the dictionary which will reference a filename. A file watcher will automatically be attached to the referenced file, and the content will be considered changed when the file is changed on disk.
AddTextured(String, String)
 Add a new NullField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Color4f, String) |  Obsolete.
AddTextured(String, Point2d, String)
 Add a new Point2dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point3d, String)
 Add a new Point3dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point4d, String)
 Add a new Point4dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Transform, String)
 Add a new TransformField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Vector2d, String)
 Add a new Vector2dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Vector3d, String)
 Add a new Vector3dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Boolean, String)
 Add a new BoolField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, DateTime, String)
 Add a new DateTimeField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Double, String)
 Add a new DoubleField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Color, String)
 Add a new Color4fField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Guid, String)
 Add a new GuidField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Int32, String)
 Add a new IntField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Single, String)
 Add a new FloatField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, String, Boolean)
 Add a new NullField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, String, String)
 Add a new StringField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Color4f, String, Boolean)
 Add a new Color4fField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point2d, String, Boolean)
 Add a new Point2dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point3d, String, Boolean)
 Add a new Point3dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point4d, String, Boolean)
 Add a new Point4dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Transform, String, Boolean)
 Add a new TransformField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Vector2d, String, Boolean)
 Add a new Vector2dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Vector3d, String, Boolean)
 Add a new Vector3dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Boolean, String, Boolean)
 Add a new BoolField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, DateTime, String, Boolean)
 Add a new DateTimeField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Double, String, Boolean)
 Add a new DoubleField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Color, String, Boolean)
 Add a new Color4fField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Guid, String, Boolean)
 Add a new GuidField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Int32, String, Boolean)
 Add a new IntField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Single, String, Boolean)
 Add a new FloatField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, String, Boolean, Int32)
 Add a new NullField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, String, String, Boolean)
 Add a new StringField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Color4f, String, Boolean, Int32)
 Add a new Color4fField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point2d, String, Boolean, Int32)
 Add a new Point2dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point3d, String, Boolean, Int32)
 Add a new Point3dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Point4d, String, Boolean, Int32)
 Add a new Point4dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Transform, String, Boolean, Int32)
 Add a new TransformField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Vector2d, String, Boolean, Int32)
 Add a new Vector2dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Vector3d, String, Boolean, Int32)
 Add a new Vector3dField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Boolean, String, Boolean, Int32)
 Add a new BoolField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, DateTime, String, Boolean, Int32)
 Add a new DateTimeField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Double, String, Boolean, Int32)
 Add a new DoubleField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Guid, String, Boolean, Int32)
 Add a new GuidField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Int32, String, Boolean, Int32)
 Add a new IntField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, Single, String, Boolean, Int32)
 Add a new FloatField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
AddTextured(String, String, String, Boolean, Int32)
 Add a new StringField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
ContainsField
 Call this method to determine if a this FieldsList contains a field with the specified field name.
GetEnumerator
GetField
 Call this method to get the field with the specified name.
RemoveField
Set(String, Color4f)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Point2d)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Point3d)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Point4d)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Transform)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Vector2d)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Vector3d)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Boolean)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Byte[])
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, DateTime)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Double)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Color)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Guid)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Int32)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Single)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, String)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
TryGetValue(String, Color4f)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Point2d)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Point3d)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Point4d)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Transform)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Vector2d)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Vector3d)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Boolean)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Byte[])
 Find a field with the specified key and get its value if found.
TryGetValue(String, DateTime)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Double)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Color)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Guid)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Int32)
 Find a field with the specified key and get its value if found.
TryGetValue(String, Single)
 Find a field with the specified key and get its value if found.
TryGetValue(String, String)
 Find a field with the specified key and get its value if found.
TryGetValue<T>(String, T)
 Parametrized version of TryGetValue.
Top
Examples
 [System.Runtime.InteropServices.Guid("ABE4059B-9BD7-451C-91B2-67C2F188860A")] public class CustomMaterial : RenderMaterial { public override string TypeName { get { return "CSharp Custom Material"; } } public override string TypeDescription { get { return "My first custom .NET material"; } } public CustomMaterial() { Fields.AddField("bool", false, "Yes/No"); Fields.AddField("color", Rhino.Display.Color4f.White, "Color"); } }
See Also
Reference
Rhino.Render.Fields Namespace