RhinoCommon API
Polyline Class
 Represents an ordered set of points connected by linear segments.
Polylines are closed if start and end points coincide.
Inheritance Hierarchy
System.Object
 Rhino.Collections.RhinoList<Point3d>
 Rhino.Collections.Point3dList
 Rhino.Geometry.Polyline
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class Polyline : Point3dList, ICloneable
<SerializableAttribute>
Public Class Polyline
	Inherits Point3dList
	Implements ICloneable
The Polyline type exposes the following members.
Constructors
Name | Description
Polyline()
 Initializes a new empty polyline.
Polyline(IEnumerable<Point3d>)
 Initializes a new polyline from a collection of points.
Polyline(Int32)
 Initializes a new empty polyline with an initial capacity.
Top
Properties
Name | Description
IsClosed
 Test a polyline to see if it is closed.
IsValid
 Gets a value that indicates whether this polyline is valid.
Valid polylines have at least one segment, no Invalid points and no zero length segments.
Closed polylines with only two segments are also not considered valid.
Length
 Gets the total length of the polyline.
SegmentCount
 Gets the number of segments for this polyline.
Top
Methods
Name | Description
BreakAtAngles
 Breaks this polyline into sections at sharp kinks. Closed polylines will also be broken at the first and last vertex.
CenterPoint
 Compute the center point of the polyline as the weighted average of all segments.
ClosestParameter
 Gets the parameter along the polyline which is closest to a test-point.
ClosestPoint
 Gets the point on the polyline which is closest to a test-point.
CollapseShortSegments
 Collapses all segments until none are shorter than tolerance. This function is significantly slower than DeleteShortSegments, since it recursively operates on the shortest segment. When a segment is collapsed the end-points are placed in the center of the segment.
CreateByJoiningLines
 Creates polylines by joining lines.
CreateCircumscribedPolygon
 Create a regular polygon circumscribe about a circle. The midpoints of the polygon's edges will be tangent to the circle.
CreateInscribedPolygon
 Create a regular polygon inscribed in a circle. The vertices of the polygon will be on the circle.
CreateStarPolygon
 Create a regular star polygon. The star begins at circle.PointAt(0) and the vertices alternate between being on circle and begin on a concentric circle of other_radius.
DeleteShortSegments
 Removes all points that are closer than tolerance to the previous point.
Start and end points are left intact.
Duplicate
 Returns a deep copy of this polyline instance.
GetSegments
 Constructs an array of line segments that make up the entire polyline.
IsClosedWithinTolerance
 Test a polyline to see if it is closed.
IsConvexLoop
 Determines if a polyline is convex.
MergeColinearSegments
 Merge co-linear consecutive segments in a polyline. This method will automatically remove any zero-length segments as well.
PointAt
 Gets the point on the polyline at the given parameter. The integer part of the parameter indicates the index of the segment.
ReduceSegments
 Constructs a reduction of this polyline by recursively removing the least significant segments.
RemoveNearlyEqualSubsequentPoints
 Removes one copy of a point that is equal to the previous or later point, by an absolute tolerance factor.
SegmentAt
 Gets the line segment at the given index.
Smooth
 Smoothen the polyline segments by averaging adjacent vertices. Smoothing requires a polyline with exclusively valid vertices.
TangentAt
 Gets the unit tangent vector along the polyline at the given parameter. The integer part of the parameter indicates the index of the segment.
ToNurbsCurve
 Constructs a nurbs curve representation of this polyline.
ToPolylineCurve
 Constructs a polyline curve representation of this polyline.
TriangulateClosedPolyline
 Attempts to create a list of triangles which represent a triangulation of a closed polyline
Trim
 Constructs a polyline out of a parameter sub-domain in this curve.
Top
See Also
Reference
Rhino.Geometry Namespace