RhinoCommon API
Brep.VariationalPatchResult Class
 This result contains additional information about the patch generation: warnings and errors and the continuity achieved.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Brep.VariationalPatchResult
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class VariationalPatchResult
Public NotInheritable Class VariationalPatchResult
The Brep.VariationalPatchResult type exposes the following members.
Constructors
Name | Description
Brep.VariationalPatchResult
Initializes a new instance of the Brep.VariationalPatchResult class
Top
Properties
Name | Description
Error
 Errors generated during patch generation. If no result is obtained, this error can give more information about what went wrong.
G0
 This value will be not-null if any positional (G0) constraints were used. It will be true if those constraints were met within the positional tolerance.
G0Int
 This value will be not-null if any internal constraints were used. It will be true if those constraints were met within the internal positional tolerance.
G1
 This value will be not-null if any tangential (G1) constraints were used. It will be true if those constraints were met within the angle tolerance.
G2
 This value will be not-null if any curvature (G2) constraints were used. It will be true if those constraints were met within the curvature relative and zero tolerances.
Warning
 Warnings generated during patch generation
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace