RhinoCommon API
EmapAnalysisSettingsState Class
Represents a snapshot of EmapAnalysisSettings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.EmapAnalysisSettingsState
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class EmapAnalysisSettingsState
Public Class EmapAnalysisSettingsState
The EmapAnalysisSettingsState type exposes the following members.
Properties
Name | Description
BlendWithObjectColor
 Gets or sets whether to blend the image with the object's color.
FileName
 Gets or sets the current emap file name.
ShowIsoparams
 Gets or sets whether to display iso curves.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace