RhinoCommon API
FileObjWriteOptions.GeometryType Enumeration
 (trimmed) NURBS surfaces may be exported as either NURBS or meshes
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum GeometryType
Public Enumeration GeometryType
Members
Member name | Value | Description
Nurbs | 0
Mesh | 1
See Also
Reference
Rhino.FileIO Namespace