RhinoCommon API
SubDFaceList Class
 All faces in a SubD
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.SubDFaceList
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SubDFaceList : IEnumerable<SubDFace>,
	IEnumerable
Public Class SubDFaceList
	Implements IEnumerable(Of SubDFace), IEnumerable
The SubDFaceList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of SubD faces.
HasPerFaceColors
 True if one or more faces on the active level have per face color overrides.
Top
Methods
Name | Description
Add
 Adds a face bounded by the given edges.
ClearPerFaceColors
 Removes all per face color overrides on the active level.
Find(Int32)
 Find a face in this SubD with a given id
Find(UInt32)
 Find a face in this SubD with a given id
GetEnumerator
 Implementation of IEnumerable
Top
See Also
Reference
Rhino.Geometry.Collections Namespace