RhinoCommon API
FilletSurfaceSplitType Enumeration
 RhinoFilletSurfaceSplitType
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum FilletSurfaceSplitType
Public Enumeration FilletSurfaceSplitType
Members
Member name | Value | Description
Nothing | 0 |  Nothing
Trim | 1 |  Trim
Split | 2 |  Split
See Also
Reference
Rhino.Geometry Namespace