RhinoCommon API
ViewSectionBehavior Enumeration
 Defines how views work with clipping planes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum ViewSectionBehavior
Public Enumeration ViewSectionBehavior
Members
Member name | Value | Description
ClipAndSection | 0 | Default - show geometry on unclipped side of clipping plane and show section
SectionOnly | 1 | Only show the section at the intersection of a clipping plane
See Also
Reference
Rhino.DocObjects Namespace