RhinoCommon API
RhinoReplaceObjectEventArgs Class
 event arguments.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoReplaceObjectEventArgs
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public class RhinoReplaceObjectEventArgs : EventArgs
Public Class RhinoReplaceObjectEventArgs
	Inherits EventArgs
The RhinoReplaceObjectEventArgs type exposes the following members.
Properties
Name | Description
Document
 The document where the event occurred.
DocumentSerialNumber
 The document runtime serial number.
NewRhinoObject
 The new replacement object, or the object about to be added. At the time is called, this object has not been added to the document. Thus, this object's id will be .
ObjectId
 The id of the existing object, or the object about to be deleted. At the time is called, this object has not been deleted.
OldRhinoObject
 The existing object, or the object about to be deleted. At the time is called, this object has not been deleted.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace
RhinoDoc.ReplaceRhinoObject