RhinoCommon API
RenderContentKind Enumeration
 Defines constant values for all render content kinds, such as material, environment or texture.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
[FlagsAttribute]
public enum RenderContentKind
<FlagsAttribute>
Public Enumeration RenderContentKind
Members
Member name | Value | Description
None | 0 |  Specifies no RenderContent kind.
Material | 1 |  Specifies a material RenderContent kind.
Environment | 2 |  Specifies an environment RenderContent kind.
Texture | 4 |  Specifies a texture RenderContent kind.
See Also
Reference
Rhino.Render Namespace