RhinoCommon API
MeshClash Class
 Represents a particular instance of a clash or intersection between two meshes.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Intersect.MeshClash
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MeshClash
Public Class MeshClash
The MeshClash type exposes the following members.
Properties
Name | Description
ClashPoint
 If valid, then the sphere centered at ClashPoint of ClashRadius distance intersects the clashing meshes.
ClashRadius
 Gets the clash, or intersection, radius.
MeshA
 Gets the first mesh.
MeshB
 Gets the second mesh.
Top
Methods
Name | Description
FindDetail(RhinoObject, RhinoObject, Double)
 Finds all of the mesh faces on each of two Rhino objects that interfere within a clash distance. This function uses the object's mesh to calculate the interferences. Acceptable object types include: BrepObject, ExtrusionObject, MeshObject, and SubDObject.
FindDetail(RhinoObject, RhinoObject, Double, MeshType, MeshingParameters)
 Finds all of the mesh faces on each of two Rhino objects that interfere within a clash distance. This function uses the object's mesh to calculate the interferences. Acceptable object types include: BrepObject, ExtrusionObject, MeshObject, and SubDObject.
Search(IEnumerable<RhinoObject>, IEnumerable<RhinoObject>, Double)
 Searches for locations where the distance from a RhinoObject, in one set of objects, is less than the specified distance to another RhinoObject in a second set of objects. This function uses the object's mesh to calculate the interferences. Acceptable object types include: BrepObject, ExtrusionObject, MeshObject, and SubDObject.
Search(IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Int32)
 Searches for locations where the distance from a mesh in one set of meshes is less than distance to another mesh in a second set of meshes.
Search(Mesh, Mesh, Double, Int32)
 Searches the locations where the distance from the first mesh to the second mesh is less than the provided value.
Search(Mesh, IEnumerable<Mesh>, Double, Int32)
 Searches the locations where the distance from the first mesh to a mesh in the second set of meshes is less than the provided value.
Search(IEnumerable<RhinoObject>, IEnumerable<RhinoObject>, Double, MeshType, MeshingParameters)
 Searches for locations where the distance from a RhinoObject, in one set of objects, is less than the specified distance to another RhinoObject in a second set of objects. This function uses the object's mesh to calculate the interferences. Acceptable object types include: BrepObject, ExtrusionObject, MeshObject, and SubDObject.
Top
See Also
Reference
Rhino.Geometry.Intersect Namespace