RhinoCommon API
CommandAlias Class
 A command alias is a set of characters that can be defined to run a macro
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.CommandAlias
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class CommandAlias
Public Class CommandAlias
The CommandAlias type exposes the following members.
Constructors
Name | Description
CommandAlias
 Create a new command alias
Top
Properties
Name | Description
Alias
 String that represents an alias
Instant
 Is the command alias instant? Instant aliases run without the need for spacebar or enter
Macro
 Macro to run when an alias is input
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace