RhinoCommon API
SimpleArrayGuid Class
 Wrapper for ON_SimpleArray<ON_UUID>. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayGuid
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArrayGuid : IDisposable
Public Class SimpleArrayGuid
	Implements IDisposable
The SimpleArrayGuid type exposes the following members.
Constructors
Name | Description
SimpleArrayGuid()
 Initializes a new SimpleArrayGuid class.
SimpleArrayGuid(IEnumerable<Guid>)
 Initializes a new SimpleArrayGuid class
Top
Properties
Name | Description
Capacity
 The capacity for the array
Count
 Gets the amount of elements in this array.
Item
 Get the Guid at index
Top
Methods
Name | Description
Append
 Appends a new Guid at the end of this array.
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToArray
 Returns the managed counterpart of the unmanaged array.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace