RhinoCommon API
MeshUnwrapper Class
 Unwraps meshes and stores the result in their texture coordinates
Inheritance Hierarchy
System.Object
 Rhino.Geometry.MeshUnwrapper
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MeshUnwrapper : IDisposable
Public Class MeshUnwrapper
	Implements IDisposable
The MeshUnwrapper type exposes the following members.
Constructors
Name | Description
MeshUnwrapper(IEnumerable<Mesh>)
 Creates a mesh unwrapper for a set of meshes
MeshUnwrapper(Mesh)
 Creates a mesh unwrapper for a single mesh
Top
Properties
Name | Description
SymmetryPlane
 Symmetry plane. Unwrapper tries to keep unwrap result symmetric to this plane.
Top
Methods
Name | Description
Dispose
 Dispose of this object and any unmanaged memory associated with it.
Finalize
 Destructor
 (Overrides Object.Finalize().)
Unwrap
 Unwraps the meshes passed in as constructor arguments and stores the results in texture coordinates.
Top
See Also
Reference
Rhino.Geometry Namespace