RhinoCommon API
SmartTrackSettingsState Class
 Represents a snapshot of SmartTrackSettings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.SmartTrackSettingsState
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SmartTrackSettingsState
Public Class SmartTrackSettingsState
The SmartTrackSettingsState type exposes the following members.
Properties
Name | Description
ActivationDelayMilliseconds
Gets or sets the activation delay in milliseconds.
ActivePointColor
Gets or sets the active point color.
GuideColor
 Gets or sets the active guide color
LineColor
Gets or sets the smart track line color.
MarkerSmartPoint
 TODO - Figure out what this does.
MaxSmartPoints
Gets or sets the maximum number of smart points.
Parallels
Turns on and off the ability to draw parallel tracking lines.
PointColor
Gets or sets the point color.
SemiPermanentPoints
 Toggles the retaining of captured points for the duration of a command as opposed to discarding them after each mouse click. For example, when you use the Copy command, clicking the mouse to place an object does not clear the existing smart points.
ShowMultipleTypes
 TODO - Figure out what this does.
SmartBasePoint
See Implied from. When a single Smart point is active, you will see the cursor tooltip with a distance.You can either type a distance or enter relative coordinates (e.g. @10,5) to place a point relative to the active smart point.
SmartOrtho
Gets or sets a value indicating if the 'Smart Ortho' feature is active.
SmartPointAtCPlaneOrigin
The active viewport construction plane origin is automatically tagged as a smart point, making it possible to snap to it, and snap to ortho lines radiating from it.
SmartSuppress
 TODO - Figure out what this does.
SmartTangents
Gets or sets a value indicating if the 'Smart Tangents' feature is active.
StrongOrtho
 TODO - Figure out what this does.
TanPerpLineColor
Gets or sets the tangent and perpendicular line color.
UseDottedLines
Gets or sets a value indicating if lines are drawn dotted.
UseSmartTrack
Gets or sets if the 'smart track' feature is active.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace