RhinoCommon API
ShrinkWrapParameters Class
 Parameters for ShrinkWrap method
Inheritance Hierarchy
System.Object
 Rhino.Geometry.ShrinkWrapParameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public class ShrinkWrapParameters
Public Class ShrinkWrapParameters
The ShrinkWrapParameters type exposes the following members.
Constructors
Name | Description
ShrinkWrapParameters
Initializes a new instance of the ShrinkWrapParameters class
Top
Properties
Name | Description
FillHolesInInputObjects
 Any input meshes will have "Fill Holes" applied to them before volume creation This value is ignored when input objects are Point Clouds
InflateVerticesAndPoints
 Inflate mesh vertices, points and point clouds Mesh vertices will be inflated as though the mesh were a point cloud
Offset
 Distance to offset outward or inward
PolygonOptimization
 0 - 100 the percentage of optimization desired. Polygons will be reduced in areas of lower curvature Lower values result in better feature preservation at the cost of more polygons
PreserveColors
 Transfers mesh vertex and or point cloud colors to the shrinkwrapped results.
SmoothingIterations
 Number of times to apply smoothing
TargetEdgeLength
 The desired target edge length in document units Smaller values equal more mesh resolution at the expense of larger mesh sizes
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace