RhinoCommon API
PageViewPropertiesChangeEventArgs Class
 PageView properties change event arguments.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.PageViewPropertiesChangeEventArgs
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public class PageViewPropertiesChangeEventArgs : EventArgs
Public Class PageViewPropertiesChangeEventArgs
	Inherits EventArgs
The PageViewPropertiesChangeEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the Rhino document.
DocumentSerialNumber
 The serial number of the Rhino document.
PageView
 Gets the Rhino page view.
PageViewSerialNumber
 The serial number of the page view.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace