RhinoCommon API
IResizableList<T> Interface
 Provides the ability to resize a generic list by setting the Count property.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IResizableList<T> : IList<T>,
	ICollection<T>, IEnumerable<T>, IEnumerable
Public Interface IResizableList(Of T)
	Inherits IList(Of T), ICollection(Of T), IEnumerable(Of T),
	IEnumerable
Type Parameters
T
The IResizableList<T> type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the length of the list. This hides (Shadows in Vb.Net) the read-only Count property of the generic list.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Collections Namespace