RhinoCommon API
DisplayPipelineAttributes.SubDEdgeColorUse Enumeration
 SubD edge color use
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.9
Syntax
public enum SubDEdgeColorUse
Public Enumeration SubDEdgeColorUse
Members
Member name | Value | Description
ObjectColor | 0
SingleColorForAll | 1
See Also
Reference
Rhino.Display Namespace