RhinoCommon API
GetTruncatedCone Class
 Class provides user interface to define a truncated cone.
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetTruncatedCone
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GetTruncatedCone : IDisposable
Public Class GetTruncatedCone
	Implements IDisposable
The GetTruncatedCone type exposes the following members.
Constructors
Name | Description
GetTruncatedCone
Initializes a new instance of the GetTruncatedCone class
Top
Properties
Name | Description
AroundDirectionMinimumCount
 The minimum number of faces in the around direction.
Cap
 Gets or sets whether or not the output should be capped.
CylinderConstraint
 State of the cone/cylinder constraint option. When the cone/cylinder option is selected, the circle is being made as a base for a cone/cylinder. By default the vertical cone/cylinder option not available but is not selected. By default the "Vertical" option applies to VerticalCircle.
DefaultSize
 Default radius or diameter (based on InDiameterMode)
Height
 Height of truncated cone.
InDiameterMode
 Determines if the "size" value is representing a radius or diameter
SecondRadius
 Radius of second circle.
VerticalDirectionMinimumCount
 The minimum number of faces in the vertical direction.
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Get
 Prompt for the getting of a truncated cone.
GetMesh(Int32, Int32, Mesh)
 Prompt for the getting of a mesh truncated cone.
GetMesh(Int32, Int32, Int32, Mesh)
 Prompt for the getting of a mesh truncated cone.
Top
See Also
Reference
Rhino.Input.Custom Namespace