RhinoCommon API
RhinoDoc.UserStringChangedArgs Class
 This event is raised when document user text strings are changed
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.RhinoDoc.UserStringChangedArgs
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class UserStringChangedArgs : EventArgs
Public Class UserStringChangedArgs
	Inherits EventArgs
The RhinoDoc.UserStringChangedArgs type exposes the following members.
Properties
Name | Description
Document
 Document containing the user string
Key
 Key for the string being changed
Top
Methods
Name | Description
Top
See Also
Reference
Rhino Namespace