RhinoCommon API
FileDgnReadOptions Class
 Options for reading a Dgn file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileDgnReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileDgnReadOptions
Public Class FileDgnReadOptions
The FileDgnReadOptions type exposes the following members.
Constructors
Name | Description
FileDgnReadOptions
Initializes a new instance of the FileDgnReadOptions class
Top
Properties
Name | Description
GroupCellHeaders
ImportUnreferencedBlocks
ImportUnreferencedLayers
ImportUnreferencedLineStyles
ImportViews
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace