RhinoCommon API
FileTxtWriteOptions Class
 Options for writing a Txt file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileTxtWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileTxtWriteOptions
Public Class FileTxtWriteOptions
The FileTxtWriteOptions type exposes the following members.
Constructors
Name | Description
FileTxtWriteOptions
Initializes a new instance of the FileTxtWriteOptions class
Top
Properties
Name | Description
Delimiter
DelimiterCharacter
ExportVertexColors
Precision
SurroundWithDoubleQuotes
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace