RhinoCommon API
RhinoObjectAnalysisModeChangedEventArgs Class
 Rhino object visual analysis mode changed event argument.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoObjectAnalysisModeChangedEventArgs
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public class RhinoObjectAnalysisModeChangedEventArgs : EventArgs
Public Class RhinoObjectAnalysisModeChangedEventArgs
	Inherits EventArgs
The RhinoObjectAnalysisModeChangedEventArgs type exposes the following members.
Properties
Name | Description
AnalysisMode
 The visual analysis mode.
AnalysisModeId
 The id of the visual analysis mode.
Document
 Gets the Rhino document.
DocumentSerialNumber
 The serial number of the Rhino document.
Enabled
 True if the visual analysis mode was enabled, false otherwise.
ObjectId
 The id of the Rhino object whose visual analysis mode changed.
TheObject
 The Rhino object whose visual analysis mode changed.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace