RhinoCommon API
EventArgs Class
[Missing <summary> documentation for "T:Rhino.UI.Controls.DataSource.EventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.UI.Controls.DataSource.EventArgs
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class EventArgs : EventArgs
Public Class EventArgs
	Inherits EventArgs
The EventArgs type exposes the following members.
Properties
Name | Description
DataType
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI.Controls.DataSource Namespace