RhinoCommon API
ZebraAnalysisSettings Class
 Contains static methods and properties to modify Zebra analysis-related commands.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.ZebraAnalysisSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.8
Syntax
public static class ZebraAnalysisSettings
Public NotInheritable Class ZebraAnalysisSettings
The ZebraAnalysisSettings type exposes the following members.
Properties
Name | Description
ShowIsoCurves
 Get or sets the display of surface isocurves.
StripeColor
 Gets or sets the stripe color.
StripeThickness
 Gets or sets the stripe thickness, where 0 = thinnest and 6 = thickest.
VerticalStripes
 Set to true for vertical stripes, or false for horizontal stripes.
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
RestoreDefaults
 Commits the default settings as the current settings.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace