RhinoCommon API
PropertyPageType Enumeration
 IRhinoProperties page type
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum PropertyPageType
Public Enumeration PropertyPageType
Members
Member name | Value | Description
Material | 0 |  Replace the material page with this page; only works for the current render plug - in.
Light | 1 |  Replace the light page with this page; only works for the current render plug-in.
Custom | 2 |  User-defined custom object page.
ObjectProperties | 3 |  For internal use only.
Dimension | 4 |  If page is provided by Rhino and only dimensions are selected, activate this page.
Leader | 5 |  If page is provided by Rhino and leaders are selected, activate this page.
Text | 6 |  If page is provided by Rhino and only text objects are selected, activate this page.
Hatch | 7 |  If page is provided by Rhino and only hatch objects are selected, activate this page.
Dot | 8 |  If page is provided by Rhino and only dot objects are selected, activate this page.
TextureMapping | 9 |  Replace the texture mapping page with this page; only works for the current render plug-in.
Detail | 10 |  If page is provided by Rhino and only detail objects are selected, activate this page.
ClippingPlane | 11 |  If page is provided by Rhino and only clipping plane objects are selected, activate this page.
NamedView | 12 |  If page is provided by Rhino and only named view widget objects are selected, activate this page.
Decal | 13 |  Decals user interface
View | 14 |  Page is a view properties page and uses view properties methods. Does not use object properties methods.
PageCount | 15 |  Reserved, do not use.
See Also
Reference
Rhino.UI Namespace