RhinoCommon API
ViewCaptureSettings.ViewAreaMapping Enumeration
 Defines how a viewport is mapped to output.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ViewAreaMapping
Public Enumeration ViewAreaMapping
Members
Member name | Value | Description
View | 0 | Best fit rectangle of what is displayed in a viewport
Extents | 1 | Zoom projection to all visible geometry in a viewport
Window | 2 | Use window rectangle defined by user
See Also
Reference
Rhino.Display Namespace