RhinoCommon API
FileRawWriteOptions Class
 Options for writing a Raw file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileRawWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileRawWriteOptions
Public Class FileRawWriteOptions
The FileRawWriteOptions type exposes the following members.
Constructors
Name | Description
FileRawWriteOptions
Initializes a new instance of the FileRawWriteOptions class
Top
Properties
Name | Description
MeshingParameters
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace