RhinoCommon API
Dimension.ForceArrow Enumeration
 OBSOLETE enum do not use.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ForceArrow
Public Enumeration ForceArrow
Members
Member name | Value | Description
Auto | 0
Inside | 1
Outside | 2
See Also
Reference
Rhino.Geometry Namespace