RhinoCommon API
SubDCreationOptions.ConcaveCornerOption Enumeration
 Defines how concave corners are treated.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ConcaveCornerOption
Public Enumeration ConcaveCornerOption
Members
Member name | Value | Description
Unset | 0 | The option is not set.
None | 1 | No concave corners. In general, this is the best choice.
AtMeshCorner | 2 |  A concave subd corner will appear at input mesh boundary vertices where the corner angle >= MinimumConcaveCornerAngleRadians() and the number of edges the end at the vertex is >= MinimumConcaveCornerEdgeCount().
See Also
Reference
Rhino.Geometry Namespace