RhinoCommon API
PointObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.PointObject"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.PointObject
 Rhino.DocObjects.Custom.CustomPointObject
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PointObject : RhinoObject
Public Class PointObject
	Inherits RhinoObject
The PointObject type exposes the following members.
Properties
Name | Description
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
PointGeometry
Top
Methods
Name | Description
DuplicatePointGeometry
Top
See Also
Reference
Rhino.DocObjects Namespace