RhinoCommon API
DateTimeField Class
 DateTime field value class
Inheritance Hierarchy
System.Object
 Rhino.Render.Fields.Field
 Rhino.Render.Fields.DateTimeField
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DateTimeField : Field
Public Class DateTimeField
	Inherits Field
The DateTimeField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
Rhino.Render.Fields Namespace