RhinoCommon API
Localization Class
[Missing <summary> documentation for "T:Rhino.UI.Localization"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Localization
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class Localization
Public NotInheritable Class Localization
The Localization type exposes the following members.
Properties
Name | Description
CurrentLanguageId
RunningAsEnglish
Top
Methods
Name | Description
FormatArea
 Format an Area string from a number
FormatDistanceAndTolerance
FormatNumber(Double)
 Get a string version of a number.
FormatNumber(Double, LengthUnit, DistanceDisplayMode, Int32, Boolean)
 Get a string version of a number in a given unit system / display mode.
FormatNumber(Double, UnitSystem, DistanceDisplayMode, Int32, Boolean)
 Get a string version of a number in a given unit system / display mode.
FormatVolume
 Format a Volume string from a number
GetLanguages
LocalizeCommandName(String)
 Commands that need to be localized should call this function.
LocalizeCommandName(String, Object)
LocalizeCommandOptionName(String, Int32)
LocalizeCommandOptionName(String, Int32, Int32) |  Obsolete.
 DO NOT use this function, it is a trap to determine where context IDs have been copied from other, already extracted, strings.
LocalizeCommandOptionName(String, Object, Int32)
LocalizeCommandOptionValue(String, Int32)
LocalizeCommandOptionValue(String, Object, Int32)
LocalizeDialogItem
 Look in the dialog item list for the specified key and return the translated localized string if the key is found otherwise return the English string.
LocalizeForm
 Look in the dialog item list for the specified key and return the translated localized string if the key is found otherwise return the English string.
LocalizeString(String, Int32)
 Returns localized version of a given English string. This function should be auto-generated by the RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
LocalizeString(LocalizedStringHandler, Int32, String)
 Returns localized version of an interpolated English string, such as LocalizeString($"Plug-in: {pi.Name}", 1428). The string table key is the source text of the literal, holes and all, which is what the string extractor records. Holes in the translation are matched by their source text and replaced with the formatted values.
LocalizeString(String, Int32, Int32) |  Obsolete.
 DO NOT use this function, it is a trap to determine where context IDs have been copied from other, already extracted, strings.
LocalizeString(String, Object, Int32)
 Returns localized version of a given English string. This function should be auto-generated by the RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
LocalizeString(LocalizedStringHandler, Object, Int32, String)
 Returns localized version of an interpolated English string, such as LocalizeString($"Plug-in: {pi.Name}", this, 1428). See LocalizeString(LocalizedStringHandler, Int32, String).
LogicalSort
 Compares two strings. Digits in the strings are considered as numerical content rather than text. This test is not case-sensitive.
SetLanguageId
 Sets the Id used for Localization in RhinoCommon. Only useful for when using RhinoCommon outside of the Rhino process
UnitSystemName
 Gets localized unit system name. Uses current application locale id.
Top
See Also
Reference
Rhino.UI Namespace