RhinoCommon API
OrdinateDimension Class
 Represents an ordinate dimension
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Dimension
 Rhino.Geometry.OrdinateDimension
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class OrdinateDimension : Dimension
<SerializableAttribute>
Public Class OrdinateDimension
	Inherits Dimension
The OrdinateDimension type exposes the following members.
Constructors
Name | Description
OrdinateDimension()
Initializes a new instance of the OrdinateDimension class
OrdinateDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
OrdinateDimension(Plane, OrdinateDimension.MeasuredDirection, Point3d, Point3d, Point3d, Double, Double)
 Constructs an ordinate dimension from parameters.
Top
Properties
Name | Description
DefPoint
Direction
 Gets or sets the measured direction.
KinkOffset1
KinkOffset2
KinkPoint1
KinkPoint2
LeaderPoint
Top
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetDistanceDisplayText(LengthUnit, DimensionStyle)
GetDistanceDisplayText(UnitSystem, DimensionStyle) |  Obsolete.
GetTextRectangle
Top
See Also
Reference
Rhino.Geometry Namespace