RhinoCommon API
MeshThicknessMeasurement Structure
 Thickness measurement used in the mesh thickness solver.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public struct MeshThicknessMeasurement
Public Structure MeshThicknessMeasurement
The MeshThicknessMeasurement type exposes the following members.
Constructors
Name | Description
MeshThicknessMeasurement
 Create a new thickness measurement.
Top
Properties
Name | Description
MeshIndex
 Gets the index of the mesh associated with this thickness measurement.
OppositePoint
 Gets the point opposite to the measurement point.
Point
 Gets the location of the thickness measurement.
Thickness
 Gets the local thickness of the mesh.
VertexIndex
 Gets the index of the vertex associated with this thickness measurement.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace