RhinoCommon API
Point3dList.XAccess Class
 Utility class for easy-access of x-components of points inside an ON_3dPointList.
Inheritance Hierarchy
System.Object
 Rhino.Collections.Point3dList.XAccess
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class XAccess
Public Class XAccess
The Point3dList.XAccess type exposes the following members.
Properties
Name | Description
Item
 Gets or sets the x-coordinate of the specified point.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Collections Namespace