RhinoCommon API
RefitTrimSectionMode Enumeration
 The mode for dividing the surface into sections
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RefitTrimSectionMode
Public Enumeration RefitTrimSectionMode
Members
Member name | Value | Description
NoSections | 0 |  just output one "upper" and one "lower" surface
DivideAtInputKnots | 1 |  divide into sections at each of the input surface's existing knots
DivideAtAddedKnots | 2 |  Yes, divide into sections at each of the "nKnot" added knot values
DivideAtAllKnots | 3 |  Yes, divide into sections at ALL knot values (i.e. both 1 and 2)
See Also
Reference
Rhino.Geometry Namespace