RhinoCommon API
FileSatWriteOptions.SatTypes Enumeration
 Sat export types. Flavors of sat file that are suitable for a particular application or version of acis sat.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum SatTypes
Public Enumeration SatTypes
Members
Member name | Value | Description
Default | 0
ACIS15 | 1
ACIS20 | 2
ACIS30 | 3
ACIS40 | 4
AutoCAD | 5
MechanicalDesktop | 6
Inventor | 7
SolidWorks | 8
SolidEdge | 9
See Also
Reference
Rhino.FileIO Namespace