RhinoCommon API
CustomBrepObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.CustomBrepObject"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.BrepObject
 Rhino.DocObjects.Custom.CustomBrepObject
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class CustomBrepObject : BrepObject,
	IDisposable
Public MustInherit Class CustomBrepObject
	Inherits BrepObject
	Implements IDisposable
The CustomBrepObject type exposes the following members.
Constructors
Name | Description
CustomBrepObject()
Initializes a new instance of the CustomBrepObject class
CustomBrepObject(Brep)
Initializes a new instance of the CustomBrepObject class
Top
Properties
Name | Description
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Top
Methods
Name | Description
Dispose(Boolean)
Releases the unmanaged resources used by the CustomBrepObject and optionally releases the managed resources
 (Overrides CommonObject.Dispose(Boolean).)
Finalize |  (Overrides CommonObject.Finalize().)
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace