RhinoCommon API
MeshCurveIntersection Class
 One certified hit from a curve-mesh intersection. Either a single isolated crossing (IsPoint) or a parameter range over which the curve lies in a face's plane (IsOverlap). For a point hit, CurveParameter is degenerate and PointA equals PointB. In a results array, every overlap is reported as two Point hits at its endpoints plus one Overlap hit for the span. The *Tolerance properties are certified half-widths derived from interval enclosures.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Intersect.MeshCurveIntersection
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public sealed class MeshCurveIntersection
Public NotInheritable Class MeshCurveIntersection
The MeshCurveIntersection type exposes the following members.
Constructors
Name | Description
MeshCurveIntersection
Initializes a new instance of the MeshCurveIntersection class
Top
Properties
Name | Description
BarycentricA
Barycentric coordinates of PointA wrt the face's triangle.
BarycentricB
Barycentric coordinates of PointB.
BarycentricTolerance
Certified half-width on each barycentric slot.
CurveParameter
Curve parameter range of the hit.
CurveParameterTolerance
Certified half-width on each curve parameter slot.
FaceIndex
Index into Faces of the canonical face that produced this hit (the lowest face index among FaceIndices).
FaceIndices
All mesh faces that share this hit, sorted ascending. For a face-interior hit or a 1-valence mesh boundary edge, contains just FaceIndex. For a hit on a shared mesh edge, contains the 2+ faces meeting at that edge. For a vertex hit, contains every face incident to that vertex.
FaceTriangleIndex
0 for a triangle face; 0 or 1 for the two sub-triangles of a quad face.
Incidence
The kind of mesh feature this hit lies on: face, edge, or vertex.
IsOnTriangleBoundary
True if this hit lies on a mesh-level boundary (Incidence is Edge or Vertex).
IsOverlap
True if this event is a range over which the curve lies in the face's plane.
IsPoint
True if this event is an isolated crossing.
PointA
3D point on the curve at the start of the event.
PointB
3D point on the curve at the end of the event.
PointTolerance
Certified half-width on each 3D point slot.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry.Intersect Namespace