RhinoCommon API
ImageFile Class
 Support functions for image files
Inheritance Hierarchy
System.Object
 Rhino.FileIO.ImageFile
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class ImageFile
Public NotInheritable Class ImageFile
The ImageFile type exposes the following members.
Methods
Name | Description
SupportsAlphaChannel
 Returns true if file at given path is an image file and that file format supports an alpha channel
Top
See Also
Reference
Rhino.FileIO Namespace