RhinoCommon API
RenderSettings Class
 Contains settings used in rendering.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Render.RenderSettings
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderSettings : CommonObject
Public Class RenderSettings
	Inherits CommonObject
The RenderSettings type exposes the following members.
Constructors
Name | Description
RenderSettings()
 Initialize a new instance of the RenderSettings class.
RenderSettings(RenderSettings)
 Initialize new instance of the RenderSettings class.
Top
Properties
Name | Description
AmbientLight
 Gets or sets the ambient light color used in rendering.
AntialiasLevel
 Gets or sets anti-alias level, used for render quality
BackgroundColorBottom
 Gets or sets the background bottom color used in rendering.
BackgroundColorTop
 Gets or sets the background top color used in rendering.
Sets also the background color if a solid background color is set.
BackgroundStyle
 How the viewport's background should be filled.
DepthCue
 Gets or sets a value indicating whether to render using depth cues.
These are clues to help the perception of position and orientation of objects in the image.
Dithering
 If this object is associated with a document, this gets the document dithering. If this object is associated with a File3dm, this gets the File3dm's dithering. Otherwise it gets a 'free-floating' dithering object.
FlatShade
 Gets or sets a value indicating whether to render using flat shading.
GroundPlane
 If this object is associated with a document, this gets the document ground plane. If this object is associated with a File3dm, this gets the File3dm's ground plane. Otherwise it gets a 'free-floating' ground plane object.
ImageDpi
 Number of dots/inch (dots=pixels) to use when printing and saving bitmaps. The default is 72.0 dots/inch.
ImageSize
 Gets or sets a value indicating the size of the rendering result if UseViewportSize is set to false. If UseViewportSize is set to true, then this value is ignored.
ImageUnitSystem
 unit system to use when converting image pixel size and DPI information into a print size. Default = inches
LinearWorkflow
 If this object is associated with a document, this gets the document linear workflow. If this object is associated with a File3dm, this gets the File3dm's linear workflow. Otherwise it gets a 'free-floating' linear workflow object.
NamedView
 Get or set the given named view
PostEffects
 If this object is associated with a document, this gets the document post effect data collection. If this object is associated with a File3dm, this gets the File3dm's post effect data collection. Otherwise it gets a 'free-floating' post effect data collection object.
RenderAnnotations
 Gets or sets a value indicating whether to instruct the rendering engine to show annotations, such as linear dimensions or angular dimensions.
RenderBackfaces
 Gets or sets a value indicating whether to render back faces.
RenderChannels
 If this object is associated with a document, this gets the document render channels. Otherwise it gets a 'free-floating' render channels object.
RenderCurves
 Gets or sets a value indicating whether to instruct the rendering engine to show curves.
RenderIsoparams
 Gets or sets a value indicating whether to instruct the rendering engine to show isocurves.
RenderMeshEdges
 Gets or sets a value indicating whether to instruct the rendering engine to show mesh edges.
RenderPoints
 Gets or sets a value indicating whether to instruct the rendering engine to show points.
RenderSource
 Gets or sets the render source RenderSettings.RenderingSources enumeration.
SafeFrame
 If this object is associated with a document, this gets the document safe-frame. If this object is associated with a File3dm, this gets the File3dm's safe-frame. Otherwise it gets a 'free-floating' safe-frame object.
ScaleBackgroundToFit
 Gets or sets a value indicating whether to scale the wallpaper in the background or not. This is meaningful only if the viewport has a wallpaper and render settings are set to render Wallpaper into the background.
ShadowmapLevel
 0=none, 1=normal, 2=best.
Skylight
 If this object is associated with a document, this gets the document skylight. If this object is associated with a File3dm, this gets the File3dm's skylight. Otherwise it gets a 'free-floating' skylight object.
Snapshot
 Set or get the given snapshot view
SpecificViewport
 Set or get the given specific viewport
Sun
 If this object is associated with a document, this gets the document sun. If this object is associated with a File3dm, this gets the File3dm's sun. Otherwise it gets a 'free-floating' sun object.
TransparentBackground
 Gets or sets whether rendering should be done with transparent background.
UseHiddenLights
 Gets or sets a value indicating whether to render using lights that are on layers that are off.
UseViewportSize
 Gets or sets a value indicating whether to use the resolution of the viewport being rendered or ImageSize when rendering
Top
Methods
Name | Description
Duplicate
 Makes a free-floating copy of the object.
RenderEnvironment
 Get the render environment for a particular usage. Only works if this render settings is in a document. If usage is Background and the background mode is set to 'Solid Color' or 'Gradient' (i.e., not 'Environment'), then null will be returned.
RenderEnvironmentId
 Get the id of the render environment for a particular usage. If usage is Background and the background mode is set to 'Solid Color' or 'Gradient' (i.e., not 'Environment'), then Guid.Empty will be returned.
RenderEnvironmentOverride
 For usage background, this checks if the background style is set to 'Environment'. For reflection and skylighting, it checks if the relevant custom override is enabled.
SetRenderEnvironment
 Set the render environment for a particular usage. Passing null for usage Skylighting or Reflection will turn the override for that usage off.
SetRenderEnvironmentId
 Set the id of the render environment for a particular usage. Passing Guid.Empty for usage Skylighting or Reflection will turn the override for that usage off.
SetRenderEnvironmentOverride
 Set the given environment override on/off. Only works for usage Reflection and Skylighting.
Top
See Also
Reference
Rhino.Render Namespace