RhinoCommon API
FileObjReadOptions.UseObjGsAs Enumeration
 Determines how "g"s in the obj file will be interpreted on import
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum UseObjGsAs
Public Enumeration UseObjGsAs
Members
Member name | Value | Description
IgnoreObjGroups | 0 |  OBJ "g"s in the file are ignored
ObjGroupsAsLayers | 1 |  OBJ "g"s in the file will become Rhino layers
ObjGroupsAsGroups | 2 |  OBJ "g"s in the file will become Rhino groups
ObjGroupsAsObjects | 3 |  OBJ "g"s in the file will become Rhino objects
See Also
Reference
Rhino.FileIO Namespace