RhinoCommon API
RenderWindow.StandardChannels Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderWindow.StandardChannels"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[FlagsAttribute]
public enum StandardChannels
<FlagsAttribute>
Public Enumeration StandardChannels
Members
Member name | Value | Description
None | 0
Red | 1
Green | 2
Blue | 4
Alpha | 8
RGBA | 14
RGB | 15
DistanceFromCamera | 16
NormalX | 32
NormalY | 64
NormalZ | 128
NormalXYZ | 240
LuminanceRed | 256
LuminanceGreen | 512
LuminanceBlue | 1024
BackgroundLuminanceRed | 4096
BackgroundLuminanceGreen | 8192
BackgroundLuminanceBlue | 16384
MaterialIds | 65536
ObjectIds | 131072
Wireframe | 262144
AlbedoRed | 1048576
AlbedoGreen | 2097152
AlbedoBlue | 4194304
AlbedoRGB | 7340032
WireframePointsRGBA | 8388608
WireframeIsocurvesRGBA | 16777216
WireframeCurvesRGBA | 33554432
WireframeAnnotationsRGBA | 67108864
See Also
Reference
Rhino.Render Namespace