RhinoCommon API
DetailViewObject Class
 A detail view object is a nested Rhino viewport placed on a page view with a 2D closed curve boundary. It can be any type of modeling view.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.DetailViewObject
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DetailViewObject : RhinoObject
Public Class DetailViewObject
	Inherits RhinoObject
The DetailViewObject type exposes the following members.
Properties
Name | Description
DescriptiveTitle
 Detail objects have two strings that can be used to describe the detail: 1. The name string that is part of the object's attributes 2. The viewport projection title that is part of the viewport This function combines these two strings to create a single "description" string in the form of attribute_name - projection_title.
DetailGeometry
 Returns the detail view geometry.
IsActive
 Gets or sets the active state of the detail view. Note, setting this property will trigger a event.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
PageToWorldTransform
 Returns the page coordinate to world coordinate transformation.
ParentPageView
 Gets the page view that this detail view belongs to.
Viewport
 Gets the detail view's viewport.
WorldToPageTransform
 Gets the world coordinate to page coordinate transformation.
Top
Methods
Name | Description
CommitViewportChanges
GetFormattedScale
 Returns the detail view object's scale as a formatted string. The detail view object's viewport must be to parallel projection.
TryGetModelLength
 Converts a paper length into a model length.
TryGetPaperLength
 Converts a paper length into a model length.
Top
See Also
Reference
Rhino.DocObjects Namespace