RhinoCommon API
ObjectGripsIds Class
 Ids of the kinds of grips Rhino itself provides, for EnableGrips(Guid) and GripsId.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.ObjectGripsIds
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class ObjectGripsIds
Public NotInheritable Class ObjectGripsIds
The ObjectGripsIds type exposes the following members.
Properties
Name | Description
CurveEditPoints
A grip at every Greville point of a curve. EditPtOn turns these on.
Default
 The object's own control points - what the PointsOn command turns on, and what differs from one object type to the next.
SubDEditPoints
A grip at every surface point of a SubD. EditPtOn turns these on.
Top
Remarks
 A plug-in's own grips are not listed here. They are identified by the id the plug-in passed to RegisterGripsEnabler(TurnOnGripsEventHandler, Type), and any such id is accepted wherever these are.
See Also
Reference
Rhino.DocObjects Namespace