RhinoCommon API
TextureGeneration Enumeration
[Missing <summary> documentation for "T:Rhino.Render.TextureGeneration"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum TextureGeneration
Public Enumeration TextureGeneration
Members
Member name | Value | Description
Allow | 1
Disallow | 2
See Also
Reference
Rhino.Render Namespace