RhinoCommon API
RhinoPlotWidthValue Enumeration
 Default width values used by UI objects to represent different states
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RhinoPlotWidthValue
Public Enumeration RhinoPlotWidthValue
Members
Member name | Value | Description
Default | 0 |  Use default plot width
None | -1 |  Don't print
ByLayer | -10 |  Plot width from layer
ByParent | -15 |  Plot width from parent object
Varies | -20 |  Multiple objects selected with different types/widths
See Also
Reference
Rhino.UI Namespace