RhinoCommon API
Point3dList.ZAccess Class
 Utility class for easy-access of z-components of points inside an ON_3dPointList.
Inheritance Hierarchy
System.Object
 Rhino.Collections.Point3dList.ZAccess
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ZAccess
Public Class ZAccess
The Point3dList.ZAccess type exposes the following members.
Properties
Name | Description
Item
 Gets or sets the z-coordinate of the specified point.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Collections Namespace