RhinoCommon API
File3mfWriteOptions Class
 Options for writing a 3mf file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3mfWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3mfWriteOptions
Public Class File3mfWriteOptions
The File3mfWriteOptions type exposes the following members.
Constructors
Name | Description
File3mfWriteOptions
Initializes a new instance of the File3mfWriteOptions class
Top
Properties
Name | Description
Copyright
Description
Designer
LicenseTerms
Metadata
MoveOutputToPositiveXYZOctant
Rating
Title
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace