RhinoCommon API
BrepVertex Class
 Brep vertex information
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Point
 Rhino.Geometry.BrepVertex
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class BrepVertex : Point
Public Class BrepVertex
	Inherits Point
The BrepVertex type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this vertex.
ProxyBrepSubDVertexId
 If this vertex is part of a brep created by SubD.ProxyBrep(), then the subd component id of the corresponding SubD vertex is returned. Otherwise 0 is returned.
Tolerance
 Accuracy of vertex point, either >=0.0 or UnsetValue. A value of UnsetValue indicates that the tolerance should be computed. A value of 0.0 indicates that the distance from the vertex to any applicable edge or trim end is <= ZeroTolerance. If an edge begins or ends at this vertex, then the distance from the vertex's 3d point to the appropriate end of the edge's 3d curve must be <= this tolerance. If a trim begins or ends at this vertex, then the distance from the vertex's 3d point to the 3d point on the surface obtained by evaluating the surface at the appropriate end of the trimming curve must be <= this tolerance.
VertexIndex
 Gets the index of this vertex in the Brep.Vertices collection.
Top
Methods
Name | Description
EdgeIndices
 Gets the indices of all edges associated with this vertex.
Top
See Also
Reference
Rhino.Geometry Namespace