RhinoCommon API
SupportOptions.RdkInitialLocation Enumeration
[Missing <summary> documentation for "T:Rhino.Render.SupportOptions.RdkInitialLocation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum RdkInitialLocation
Public Enumeration RdkInitialLocation
Members
Member name | Value | Description
RenderContent | 0
LastOpenedFolder | 1
CustomFolder | 2
See Also
Reference
Rhino.Render Namespace