RhinoCommon API
RhinoAccountsServerException Class
 Exception thrown when the Rhino Accounts server returned an unsuccessful HTTP response with a code of 400 or greater.
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.RhinoAccounts.RhinoAccountsException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsServerException
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class RhinoAccountsServerException : RhinoAccountsException
<SerializableAttribute>
Public Class RhinoAccountsServerException
	Inherits RhinoAccountsException
The RhinoAccountsServerException type exposes the following members.
Constructors
Name | Description
RhinoAccountsServerException(Exception)
 Generates a new instance of the exception.
RhinoAccountsServerException(String, Exception)
 Generates a new instance of the exception.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace