RhinoCommon API
FilePly Class
 Support for ply file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FilePly
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FilePly
Public NotInheritable Class FilePly
The FilePly type exposes the following members.
Methods
Name | Description
Read
Read a PLY file into a RhinoDoc
Write
Write a ply file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace