RhinoCommon API
ViewSettings.ViewRotationStyle Enumeration
 View rotation styles.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.1
Syntax
public enum ViewRotationStyle
Public Enumeration ViewRotationStyle
Members
Member name | Value | Description
RotateAroundWorldAxes | 0 |  Makes the view rotate relative to the world axes. You can use the tilt keys to rotate the view around the view depth axis.
RotateRelativeToView | 1 |  Makes the view rotate relative to the view axes rather than the model x, y, and z axes.
RotateRelativeToViewV2Style | 2 |  The view rotation is always relative to the previous dynamic view.
RotateAroundCplaneZaxis | 3 |  Makes the view (RotateView command) or camera (RotateCamera command) rotate around the construction plane z-axis.
See Also
Reference
Rhino.ApplicationSettings Namespace