RhinoCommon API
MeshExtruder Class
 Extrudes a mesh and provides preview
Inheritance Hierarchy
System.Object
 Rhino.Geometry.MeshExtruder
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MeshExtruder : IDisposable
Public Class MeshExtruder
	Implements IDisposable
The MeshExtruder type exposes the following members.
Constructors
Name | Description
MeshExtruder
 Construct object to extrude given mesh faces, edges and ngons.
Top
Properties
Name | Description
EdgeBasedUVN
 Edge based UVN defines UVN directions according to boundary edge directions
FaceDirectionMode
 Face direction mode determines how faces are oriented
KeepOriginalFaces
 Whether or not to keep original faces.
PreviewLines
 Gets Line objects to preview extruded mesh.
SurfaceParameterMode
 Mode for creating surface parameters for extruded areas
TextureCoordinateMode
 Mode for creating texture coordinates for extruded areas
Transform
 Transform of extrusion
UVN
 Whether or not to perform extrude in UVN basis.
Top
Methods
Name | Description
Dispose
 Dispose of this object and any unmanaged memory associated with it.
ExtrudedMesh(Mesh)
 Creates new extruded mesh. Returns true if any edges or faces were extruded.
ExtrudedMesh(Mesh, List<ComponentIndex>)
 Creates new extruded mesh. Returns true if any edges or faces were extruded.
Finalize
 Destructor
 (Overrides Object.Finalize().)
GetWallFaces
 Return list of faces that were added to connect transformed edges/faces to non-transformed edges/faces.
Top
See Also
Reference
Rhino.Geometry Namespace