RhinoCommon API
FileDgn Class
 Support for writing Dgn file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileDgn
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileDgn
Public NotInheritable Class FileDgn
The FileDgn type exposes the following members.
Methods
Name | Description
Read
Read a dgn file into a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace