RhinoCommon API
FilePdfReadOptions Class
 Options for reading a PDF file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FilePdfReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FilePdfReadOptions
Public Class FilePdfReadOptions
The FilePdfReadOptions type exposes the following members.
Constructors
Name | Description
FilePdfReadOptions
Initializes a new instance of the FilePdfReadOptions class
Top
Properties
Name | Description
ImportFillsAsHatches
LoadText
PDFScale
PdfUnits
PreserveModelScale
RhinoScale
Top
Methods
Name | Description
ToDictionary
Top
See Also
Reference
Rhino.FileIO Namespace