RhinoCommon API
ViewCaptureWriter.VectorClipPathProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.VectorClipPathProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void VectorClipPathProc(
	IntPtr loops,
	int asBeziers
)
Public Delegate Sub VectorClipPathProc (
	loops As IntPtr,
	asBeziers As Integer
)
Parameters
loops
Type: System.IntPtr
asBeziers
Type: System.Int32
See Also
Reference
Rhino.Runtime Namespace