RhinoCommon API
Command.RunCommandDelegate Delegate
[Missing <summary> documentation for "T:Rhino.Commands.Command.RunCommandDelegate"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate Result RunCommandDelegate(
	RhinoDoc doc,
	RunMode mode,
	Object data
)
Public Delegate Function RunCommandDelegate (
	doc As RhinoDoc,
	mode As RunMode,
	data As Object
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
mode
Type: Rhino.Commands.RunMode
data
Type: System.Object
Return Value
Type: Result
See Also
Reference
Rhino.Commands Namespace