RhinoCommon API
RhinoApp.KeyboardHookEvent Delegate
 KeyboardEvent delegate
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void KeyboardHookEvent(
	int key
)
Public Delegate Sub KeyboardHookEvent (
	key As Integer
)
Parameters
key
Type: System.Int32
See Also
Reference
Rhino Namespace