RhinoCommon API
RhinoApp Class
.NET RhinoApp is parallel to C++ CRhinoApp.
Inheritance Hierarchy
System.Object
 Rhino.RhinoApp
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class RhinoApp
Public NotInheritable Class RhinoApp
The RhinoApp type exposes the following members.
Properties
Name | Description
BuildDate
 Gets the build date.
CanSave
 Returns true when Rhino is allowed to save, false otherwise Conditions where Rhino is not allowed to save are: when evaluation licenses are expired; when a Cloud Zoo lease is expired; when a license is shared by a single user on multiple computers, and the current computer is not active.
CheckNewObject
 Returns true if Rhino will validate each object added to the document. This can be time consuming but is valuable for debugging.
CommandHistoryWindowText
 Text in Rhino's command history window.
CommandLineOut
 Provides a TextWriter that can write to the command line.
CommandPrompt
Rhino command prompt.
CommandWindowCaptureEnabled
 Enable or disable capturing of the strings sent to the CommandWindow through Write and WriteLine calls
CurrentRhinoId
Gets the current ID of Rhino.
DaysUntilExpiration
 Returns number of days until license expires. Zero when license is expired. Raises InvalidLicenseTypeException if LicenseExpires would return false.
DefaultUiFont
 Default font used to render user interface
ExeServiceRelease
 Service release version of Rhino executable (0, 1, 2, ...) The integer is the service release number of Rhino. For example, this function returns "0" if Rhino V4SR0 is running and returns "1" if Rhino V4SR1 is running.
ExeVersion
 Major version of Rhino executable 4, 5, ...
InCommand
 Gets the nested command count.
InstallationType
Gets the product installation type, as seen in Rhino's ABOUT dialog box.
InstallationTypeString
Gets the type of installation (product edition) of the license or lease.
InvokeRequired
 Returns true if we are currently not running on the main user interface thread
IsClosing
 Returns true if Rhino is in the process of closing, false otherwise. This can be true even before the Closing event fires, such as when RhinoDoc.CloseDocument event is called.
IsCloudZooNode
 Returns true if rhino is currently using the Cloud Zoo false otherwise
IsEvaluation
 Returns true if Rhino is licensed as an Evaluation product false otherwise
IsExiting
 Returns true if Rhino is in the process of exiting, false otherwise. This can be true even before the Closing event fires, such as when RhinoDoc.CloseDocument event is called.
IsInternetAccessAllowed
 Returns true when Rhino is allowed to access the Internet, false otherwise. Note, this does not test if Internet access is available.
IsLicenseValidated
 Returns true if the license is validated false otherwise
IsOnMainThread
 Is the current thread the main thread
IsParentDesktop
 Returns true if Rhino's parent window is the desktop, false otherwise.
IsPreRelease
 Returns true if Rhino is compiled as pre-release build (Beta, WIP) false otherwise
IsRunningAutomated
Is Rhino currently being executed through automation
IsRunningBatchMode
 Is Rhino currently being executed as a batch run, either started with the /batchmode command line switch or put into batch mode since by the BatchMode command. A batch run has a main window but no user: commands take their input from the command line rather than showing dialogs, and modal message boxes are written to the command line instead of being shown.
IsRunningHeadless
Is Rhino currently being executed in headless mode
IsRunningUnattended
 Is Rhino running with no user available to answer a question. True when either IsRunningHeadless or IsRunningBatchMode is true.
IsSafeModeEnabled
Is Rhino being executed in safe mode
IsSkinned
 Is Rhino currently using custom, user-interface Skin.
LicenseExpires
 Returns true if the license will expire false otherwise
LicenseUserName
Gets the name of the user that owns the license or lease.
LicenseUserOrganization
Gets the name of the organization of the user that owns the license or lease.
LoggedInUserAvatar
 Returns the logged in user's avatar picture. Returns a default avatar if the user does not have an avatar or if the avatar could not be fetched.
LoggedInUserName
 Returns the name of the logged in user, or null if the user is not logged in.
Name
Gets the application name.
NodeType
Gets license the node type.
Rhino2Id
Gets the ID of Rhino 2.
Rhino3Id
Gets the ID of Rhino 3.
Rhino4Id
Gets the ID of Rhino 4.
Rhino5Id
Gets the ID of Rhino 5
Rhino6Id
Gets the ID of Rhino 6
Rhino7Id
Gets the ID of Rhino 7
SchemeName
 Gets the current Registry scheme name.
SdkServiceRelease
 Rhino SDK 9 digit SDK service release number in the form YYYYMMDDn Service release of the Rhino SDK supported by this executable. Rhino will only load plug-ins that require a service release of <= this release number. For example, SR1 will load all plug-ins made with any SDK released up through and including the SR1 SDK. But, SR1 will not load a plug-in built using the SR2 SDK. If an "old" Rhino tries to load a "new" plug-in, the user is told that they have to get a free Rhino.exe update in order for the plug-in to load. Rhino.exe updates are available from http://www.rhino3d.com.
SdkVersion
 Rhino SDK 9 digit SDK version number in the form YYYYMMDDn Rhino will only load plug-ins that were build with exactly the same version of the SDK.
SendWriteToConsole
 Enable or disable sending command window strings to the console RhinoApp.Write(...) calls would be sent to the console when this is enabled
SerialNumber
Gets the product serial number, as seen in Rhino's ABOUT dialog box.
ToolbarFiles
 Collection of currently open toolbar files in the application
UpdatesAndStatisticsStatus
 Returns true when Rhino is allowed to access the Internet, false otherwise. Note, this does not test if Internet access is available.
UserIsLoggedIn
 Returns true if the user is logged in; else returns false. A logged in user does not guarantee that the auth tokens managed by the CloudZooManager instance are valid.
ValidationGracePeriodDaysLeft
 Returns number of days within which validation must occur. Zero when validation grace period has expired. Raises InvalidLicenseTypeException if LicenseType is one of: EvaluationSaveLimited EvaluationTimeLimited Viewer Unknown
Version
 File version of the main Rhino process
VersionControlRevision
 McNeel version control revision identifier at the time this version of Rhino was built.
Top
Methods
Name | Description
AskUserForRhinoLicense
 Display UI asking the user to enter a license for Rhino or use one from the Zoo.
CapturedCommandWindowStrings
 Get list of strings sent to the command window through calls to Write or WriteLine when capturing has been enabled
ChangeLicenseKey
 Display UI asking the user to enter a license for the product specified by licenseId.
ClearCommandHistoryWindow
 Clear the text in Rhino's command history window.
ExecuteCommand
 Execute a Rhino command.
Exit()
Exits, or closes, Rhino.
Exit(Boolean)
 Exits, or forcefully closes Rhino. A prompt to allow saving will appear if necessary when forcefully exiting Works on Windows and MacOS true to allow the user to cancel exiting false to force exit
GetDataDirectory(Boolean, Boolean)
 Gets the data directory.
GetDataDirectory(Boolean, Boolean, String)
 Gets the data directory.
GetExecutableDirectory
Directory where main RhinoCore binary is located
GetInstallDirectory
 Directory where all of Rhino is installed
GetPlugInObject(Guid)
 Gets the object that is returned by PlugIn.GetPlugInObject for a given plug-in. This function attempts to find and load a plug-in with a given Id. When a plug-in is found, it's GetPlugInObject function is called and the result is returned here. Note the plug-in must have already been installed in Rhino or the plug-in manager will not know where to look for a plug-in with a matching id.
GetPlugInObject(String)
 Gets the object that is returned by PlugIn.GetPlugInObject for a given plug-in. This function attempts to find and load a plug-in with a given name. When a plug-in is found, it's GetPlugInObject function is called and the result is returned here. Note the plug-in must have already been installed in Rhino or the plug-in manager will not know where to look for a plug-in with a matching name.
InFullScreen
 Verifies that Rhino is running in full screen mode.
InvokeAndWait
 Work-In-Progress. Testing this with our unit test framework
InvokeOnUiThread
 Execute a function on the main UI thread.
IsInstallationBeta
 If licenseType is a beta license, returns true. A beta license grants full use of the product during the pre-release development period.
IsInstallationCommercial
 If licenseType is a commercial license, returns true. A commercial license grants full use of the product.
IsInstallationEvaluation
 If licenseType is an evaluation license, returns true. An evaluation license limits the ability of Rhino to save based on either the number of saves or a fixed period of time.
LoginToCloudZoo
 Logs in to the cloud zoo.
MainWindowHandle
 Gets the HWND of the Rhino main window.
OutputDebugString
 Print a string to the Visual Studio Output window, if a debugger is attached. Note that the developer needs to add a newline manually if the next output should come on a separate line.
ParseTextField(String, RhinoObject, RhinoObject)
 Parses a text field string.
ParseTextField(String, RhinoObject, RhinoObject, InstanceObject)
 Parses a text field string.
PostCancelEvent
 Post a cancel event to the command line
PostEnterEvent
 Post an enter event to the command line
RefreshRhinoLicense
 Refresh the license used by Rhino. This allows any part of Rhino to ensure that the most current version of the license file on disk is in use.
RefreshScreen
 Request OS to update UI on screen.
ReleaseMouseCapture
Releases the mouse capture.
RunMenuScript
 Run a Rhino menu item script. Will add the selected menu string to the MRU command menu.
RunningInRdp
 Find out if Rhino is running in a remote session
RunningOnVMWare
 Verifies that Rhino is running on VMWare
RunScript(String, Boolean)
Runs a Rhino command script.
RunScript(String, String, Boolean)
Runs a Rhino command script.
RunScript(UInt32, String, Boolean)
Runs a Rhino command script.
RunScript(UInt32, String, String, Boolean)
Runs a Rhino command script.
SendKeystrokes
Sends a string of printable characters, including spaces, to Rhino's command line.
SetCommandPrompt(String)
Set Rhino command prompt.
SetCommandPrompt(String, String)
Sets the command prompt in Rhino.
SetCommandPromptMessage
 Set the text that appears in the Rhino command prompt. In general, you should use the SetCommandPrompt functions. In rare cases, like worker thread messages, the message that appears in the prompt has non-standard formatting. In these rare cases, SetCommandPromptMessage can be used to literally specify the text that appears in the command prompt window.
SetFocusToMainWindow()
 Sets the focus to the main window. This function attempts to use the ActiveDoc on Mac to figure out which window to set focus to.
SetFocusToMainWindow(RhinoDoc)
 Sets the focus to the main windows for a given document
ValidateRhinoLicense
 Validates a stand-alone Rhino license key for the given Rhino account email against the McNeel validation server, without asking the user for any input. Shows the validation wizard's connection/validation progress steps; problems reported by the server route to the wizard's normal interactive steps. On success the license is locked to this computer (standalone node). Used by the rhinoN://license protocol handler to install a license from a web link.
Wait
 Pauses to keep OS message pump alive.
Write(String)
Print formatted text in the command window.
Write(String, Object)
Print formatted text in the command window.
Write(String, Object, Object)
Print formatted text in the command window.
Write(String, Object, Object, Object)
Print formatted text in the command window.
WriteLine()
Print a newline in the command window.
WriteLine(String)
Print text in the command window.
WriteLine(String, Object)
Print formatted text with a newline in the command window.
WriteLine(String, Object, Object)
Print formatted text with a newline in the command window.
WriteLine(String, Object, Object, Object)
Print formatted text with a newline in the command window.
Top
Events
Name | Description
AppSettingsChanged
 Is raised when settings are changed.
Closing
 Is raised when the application is about to close.
CommandPromptChanged
 Fired when the command line changes
EscapeKeyPressed
 Can add or removed delegates that are raised when the escape key is clicked.
Idle
 Occurs when the application finishes processing and is about to enter the idle state
Initialized
 Is raised when the application is fully initialized.
KeyboardEvent
 Can add or removed delegates that are raised by a keyboard event.
LicenseStateChanged
 Fires when the license state has changed
MainLoop
 Gets called every loop iteration inside Rhino's main message loop.
RdkCacheImageChanged
 Monitors when the RDK thumbnail cache images are changed.
RdkGlobalSettingsChanged
 Monitors when RDK global settings are modified.
RdkNewDocument
 Monitors when RDK document information is rebuilt.
RdkPlugInUnloading
 Monitors when RDK client plug-ins are unloaded.
RdkUpdateAllPreviews
 Monitors when RDK thumbnails are updated.
RendererChanged
 Monitors when Rhino's current renderer changes.
Top
See Also
Reference
Rhino Namespace