RhinoCommon API
DisplayPipelineAttributes.SurfaceIsoThicknessUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThicknessUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public enum SurfaceIsoThicknessUse
Public Enumeration SurfaceIsoThicknessUse
Members
Member name | Value | Description
ObjectWidth | 0
SingleWidthForAllCurves | 1
PixelsUV | 2
See Also
Reference
Rhino.Display Namespace