RhinoCommon API
SubDToBrepOptions Class
 Options used for converting a SubD to a Brep
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDToBrepOptions
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SubDToBrepOptions : IDisposable
Public Class SubDToBrepOptions
	Implements IDisposable
The SubDToBrepOptions type exposes the following members.
Constructors
Name | Description
SubDToBrepOptions()
 Create default options
SubDToBrepOptions(Boolean, SubDToBrepOptions.ExtraordinaryVertexProcessOption)
 Create options from the given packFaces and vertexProcess values.
Top
Properties
Name | Description
Default
 Default SubDToBrepOptions settings. Currently selects the same options as DefaultUnpacked: Locally-G1 smoothing of extraordinary vertices, unpacked faces.
DefaultPacked
 Default ON_SubDToBrepParameters settings for creating a packed brep. Locally-G1 smoothing of extraordinary vertices, packed faces.
DefaultUnpacked
 Default ON_SubDToBrepParameters settings for creating an unpacked brep. Locally-G1 smoothing of extraordinary vertices, unpacked faces.
ExtraordinaryVertexProcess
 Get or sets the extraordinary vertex process option.
PackFaces
 Get or sets the pack faces option.
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Geometry Namespace