RhinoCommon API
ItemColorSource Enumeration
 Color source for a per-item color override on object attributes (for example, hatch boundary color or hatch pattern color). Selects whether the color is read from the layer, from the object's main attribute color, inherited from the parent, or read from a custom override color stored on the attribute itself.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum ItemColorSource
Public Enumeration ItemColorSource
Members
Member name | Value | Description
ColorFromLayer | 0 | Use color assigned to layer.
ColorFromObject | 1 | Use the object's main attribute color.
ColorFromParent | 3 |  For objects with parents (like objects in instance references), use the parent's color. If no parent, treat as ColorFromLayer.
ColorCustom | 4 |  Use the per-item custom override color stored on the attribute (for example, the color set by the matching color property such as HatchBoundaryColor or HatchPatternColor).
See Also
Reference
Rhino.DocObjects Namespace