RhinoCommon API
LoadPlugInResult Enumeration
Result of attempting to load a plug-in
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum LoadPlugInResult
Public Enumeration LoadPlugInResult
Members
Member name | Value | Description
Success | 0 | Successfully loaded
SuccessAlreadyLoaded | 1
ErrorUnknown | 2
NotRhinoPlugIn | 3 |  The rhp is a valid assembly, but it does not contain a Rhino plugin class. Instead it contains what is needed to define grasshopper or grasshopper 2 component(s)
See Also
Reference
Rhino.PlugIns Namespace