RhinoCommon API
File3dsWriteOptions Class
 Options for writing a 3ds file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dsWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dsWriteOptions
Public Class File3dsWriteOptions
The File3dsWriteOptions type exposes the following members.
Constructors
Name | Description
File3dsWriteOptions
Initializes a new instance of the File3dsWriteOptions class
Top
Properties
Name | Description
MeshingParameters
SaveLights
SaveViews
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace