RhinoCommon API
KnotStyle Enumeration
 Knot styles for NURBS curves and surfaces. If a knot vector meets the conditions of two styles, then the style with the lowest value is used.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum KnotStyle
Public Enumeration KnotStyle
Members
Member name | Value | Description
Unknown | 0 |  Unknown knot style
Uniform | 1 |  Uniform knots (ends not clamped).
QuasiUniform | 2 |  Uniform knots (clamped ends, degree >= 2).
PiecewiseBezier | 3 |  All internal knots have full multiplicity.
ClampedEnd | 4 |  Clamped end knots (with at least one interior non-uniform knot).
NonUniform | 5 |  Known to be none of the other styles
See Also
Reference
Rhino.Geometry Namespace