RhinoCommon API
RenderEnvironment.Usage Enumeration
Note: This API is now obsolete.
[Missing <summary> documentation for "T:Rhino.Render.RenderEnvironment.Usage"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[FlagsAttribute]
[ObsoleteAttribute("Use Rhino.Render.RenderSettings.EnvironmentUsage")]
public enum Usage
<FlagsAttribute>
<ObsoleteAttribute("Use Rhino.Render.RenderSettings.EnvironmentUsage")>
Public Enumeration Usage
Members
Member name | Value | Description
None | 0
Background | 1
ReflectionAndRefraction | 2
Skylighting | 4
AnyUsage | 7
See Also
Reference
Rhino.Render Namespace