RhinoCommon API
RenderEndEventArgs Class
 Contains information about why OnRenderEnd was called
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RenderEndEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderEndEventArgs : EventArgs
Public Class RenderEndEventArgs
	Inherits EventArgs
The RenderEndEventArgs type exposes the following members.
Constructors
Name | Description
RenderEndEventArgs
Initializes a new instance of the RenderEndEventArgs class
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace