RhinoCommon API
UserInterfaceGridColumnSizing Enumeration
 How a UserInterfaceGrid decides the width of one of its columns
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum UserInterfaceGridColumnSizing
Public Enumeration UserInterfaceGridColumnSizing
Members
Member name | Value | Description
Fixed | 0 | The column is exactly the width it was given
Auto | 1 | The column is as wide as the widest control in it
Flexible | 2 |  The column shares the width the fixed and auto columns leave over, in proportion to its weight
See Also
Reference
Rhino.UI Namespace