RhinoCommon API
RhinoGetPlotWidthArgs Enumeration
 Argument flags passed to methods used to get Rhino plot width lists
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RhinoGetPlotWidthArgs
Public Enumeration RhinoGetPlotWidthArgs
Members
Member name | Value | Description
NoArgs | 0 |  Just get the standard or default width list
ByLayer | 1 |  Include a By Layer option
ByParent | 2 |  Include a By Parent option
HairLine | 4 |  Include a hairline width option
Default | 8 |  Include a default width option
None | 32 |  Include a no print option
All | 268435455 |  Include everything
See Also
Reference
Rhino.UI Namespace