RhinoCommon API
LicenseTypes Enumeration
 Different licensing modes that Rhino can run in
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum LicenseTypes
Public Enumeration LicenseTypes
Members
Member name | Value | Description
Undefined | 0 |  Licensing mode not define
Standalone | 1 |  Standalone license installed on this computer.
ZooAutoDetect | 2 |  Classic Zoo license with the Zoo server automatically detected at runtime.
ZooManualDetect | 3 |  Classic Zoo license with the Zoo server specified by hostname or IP
CloudZoo | 4 |  Cloud Zoo licenese
See Also
Reference
Rhino.Runtime Namespace