RhinoCommon API
GetSphere Class
 Class provides user interface to define a sphere.
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetSphere
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GetSphere : IDisposable
Public Class GetSphere
	Implements IDisposable
The GetSphere type exposes the following members.
Constructors
Name | Description
GetSphere
Initializes a new instance of the GetSphere class
Top
Properties
Name | Description
DefaultSize
 Default radius or diameter (based on InDiameterMode)
InDiameterMode
 Determines if the "size" value is representing a radius or diameter
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Get
 Prompt for the getting of a sphere.
GetMesh
 Prompt for the getting of a mesh sphere.
Top
See Also
Reference
Rhino.Input.Custom Namespace