RhinoCommon API
MaterialTableEventType Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.MaterialTableEventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum MaterialTableEventType
Public Enumeration MaterialTableEventType
Members
Member name | Value | Description
Added | 0
Deleted | 1
Undeleted | 2
Modified | 3
Sorted | 4
Current | 5
See Also
Reference
Rhino.DocObjects.Tables Namespace