RhinoCommon API
USDExportBlockHandling Enumeration
 USD Block Exporting Options
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum USDExportBlockHandling
Public Enumeration USDExportBlockHandling
Members
Member name | Value | Description
SeparateFiles | 0 |  Blocks are exported as separate files
Ignore | 1 |  Blocks are not exported inside the file or outside the file
Embedded | 2 |  Blocks are included inside the file
See Also
Reference
Rhino.FileIO Namespace