RhinoCommon API
ShowMessageOptions Enumeration
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageOptions"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[FlagsAttribute]
public enum ShowMessageOptions
<FlagsAttribute>
Public Enumeration ShowMessageOptions
Members
Member name | Value | Description
None | 0
SetForeground | 65536
DefaultDesktopOnly | 131072
TopMost | 262144
RightAlign | 524288
RtlReading | 1048576
ServiceNotification | 2097152
See Also
Reference
Rhino.UI Namespace