RhinoCommon API
File3dmInstanceDefinitionTable Class
 Provides access to instance (block) definitions in the 3dm file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<InstanceDefinitionGeometry>
 Rhino.FileIO.File3dmCommonComponentTable<InstanceDefinitionGeometry>
 Rhino.FileIO.File3dmInstanceDefinitionTable
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmInstanceDefinitionTable : File3dmCommonComponentTable<InstanceDefinitionGeometry>,
	IList<InstanceDefinitionGeometry>, ICollection<InstanceDefinitionGeometry>, IEnumerable<InstanceDefinitionGeometry>,
	IEnumerable
Public Class File3dmInstanceDefinitionTable
	Inherits File3dmCommonComponentTable(Of InstanceDefinitionGeometry)
	Implements IList(Of InstanceDefinitionGeometry), ICollection(Of InstanceDefinitionGeometry),
	IEnumerable(Of InstanceDefinitionGeometry), IEnumerable
The File3dmInstanceDefinitionTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns InstanceDefinition.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
Methods
Name | Description
Add(String, String, Point3d, IEnumerable<GeometryBase>)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, GeometryBase, ObjectAttributes)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Adds an instance definition to the instance definition table.
Add(String, String, String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Adds an instance definition to the instance definition table.
AddLinked
 Adds a linked instance definition to the instance definition table.
FindName
 Finds an InstanceDefinitionGeometry given its name.
FindNameHash
 Finds a InstanceDefinitionGeometry given its name hash.
Top
See Also
Reference
Rhino.FileIO Namespace