RhinoCommon API
GetEllipse Class
 Class provides user interface to define an ellipse.
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetEllipse
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GetEllipse : IDisposable
Public Class GetEllipse
	Implements IDisposable
The GetEllipse type exposes the following members.
Constructors
Name | Description
GetEllipse
 Constructs a GetEllispe object.
Top
Properties
Name | Description
FirstPoint
 Returns the first point. If in "from foci" mode, then this is the first foci point.
IsModeFromFoci
 Indicates the ellipse was created from foci.
MarkFoci
 Indicates the user wants the ellipse foci marked with point objects.
SecondPoint
 Returns the second point. If in "from foci" mode, then this is the second foci point.
Top
Methods
Name | Description
Dispose()
 Actively releases the unmanaged object.
Dispose(Boolean)
 Releases the unmanaged object.
Finalize
 Passively releases the unmanaged object.
 (Overrides Object.Finalize().)
Get
 Prompt for the getting of an ellipse.
Top
See Also
Reference
Rhino.Input.Custom Namespace