RhinoCommon API
HatchPattern.Defaults Class
[Missing <summary> documentation for "T:Rhino.DocObjects.HatchPattern.Defaults"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.HatchPattern.Defaults
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class Defaults
Public NotInheritable Class Defaults
The HatchPattern.Defaults type exposes the following members.
Properties
Name | Description
Dash
Grid
Grid60
Hatch1
Hatch2
Hatch3
Plus
Solid
Squares
Top
See Also
Reference
Rhino.DocObjects Namespace