RhinoCommon API
Point3dList Class
 Represents a list of Point3d.
Inheritance Hierarchy
System.Object
 Rhino.Collections.RhinoList<Point3d>
 Rhino.Collections.Point3dList
 Rhino.Geometry.Polyline
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class Point3dList : RhinoList<Point3d>,
	ICloneable, IEquatable<Point3dList>
<SerializableAttribute>
Public Class Point3dList
	Inherits RhinoList(Of Point3d)
	Implements ICloneable, IEquatable(Of Point3dList)
The Point3dList type exposes the following members.
Constructors
Name | Description
Point3dList()
 Initializes a new empty list with default capacity.
Point3dList(IEnumerable<Point3d>)
 Initializes a new point list by copying the values from another set.
Point3dList(Int32)
 Initializes a new point list with a preallocated initial capacity.
Point3dList(Point3d[])
 Constructs a new point list from values in a point array.
Top
Properties
Name | Description
BoundingBox
 Even though this is a property, it is not a "fast" calculation. Every point is evaluated in order to get the bounding box of the list.
X
 Returns an indexer with all X coordinates in this list.
Y
 Returns an indexer with all Y coordinates in this list.
Z
 Returns an indexer with all Z coordinates in this list.
Top
Methods
Name | Description
Add(Double, Double, Double)
 Adds a Point3d to the end of the list with given x,y,z coordinates.
ClosestIndex
 Finds the index of the point that is closest to a test point in this list.
ClosestIndexInList
 Finds the index of the point in a list of points that is closest to a test point.
ClosestPointInList
 Finds the point in a list of points that is closest to a test point.
Duplicate
 Returns a deep copy of this point list instance.
Equals(Object)
 Overrides the default object equality to compare lists by value.
 (Overrides Object.Equals(Object).)
Equals(Point3dList)
 Determines if the point lists are exactly equal.
GetHashCode
 Creates a hash code for this object.
 (Overrides Object.GetHashCode().)
SetAllX
 Set all the X values for the points to a single value
SetAllY
 Set all the Y values for the points to a single value
SetAllZ
 Set all the Z values for the points to a single value
Transform
 Applies a transform to all the points in the list.
Top
See Also
Reference
Rhino.Collections Namespace