RhinoCommon API
FileSlc Class
 Support for writing slice (SLC) file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileSlc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileSlc
Public NotInheritable Class FileSlc
The FileSlc type exposes the following members.
Methods
Name | Description
Write
Write a SLC file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace