RhinoCommon API
ArcArcIntersection Enumeration
 Represents all possible cases of a Arc|Arc intersection event.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.12
Syntax
public enum ArcArcIntersection
Public Enumeration ArcArcIntersection
Members
Member name | Value | Description
None | 0 |  Arcs do not intersect.
Single | 1 |  Arcs touch at a one point.
Multiple | 2 |  Arcs intersect at two points.
Overlap | 3 |  Arcs are cocircular and overlap.
See Also
Reference
Rhino.Geometry.Intersect Namespace