RhinoCommon API
RdkNotLoadedException Class
 Is thrown when the RDK is not loaded.
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.RdkNotLoadedException
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class RdkNotLoadedException : Exception
<SerializableAttribute>
Public Class RdkNotLoadedException
	Inherits Exception
The RdkNotLoadedException type exposes the following members.
Constructors
Name | Description
RdkNotLoadedException
 Initializes a new instance of the RDK not loaded exception with a standard message.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Runtime Namespace