RhinoCommon API
GpuDeviceInfo Class
 Represents a GPU device providing name, vendor and memory all as strings. Currently fully implemented only on Windows.
Inheritance Hierarchy
System.Object
 Rhino.GpuDeviceInfo
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GpuDeviceInfo
Public Class GpuDeviceInfo
The GpuDeviceInfo type exposes the following members.
Properties
Name | Description
DriverDateAsString
 The driver date as string formatted year-month-day
Memory
 Memory of the device in bytes
MemoryAsString
 Memory of the device as a human-readable string
Name
 Name of the device
Vendor
 Vendor of the device
Top
Methods
Name | Description
Top
See Also
Reference
Rhino Namespace