RhinoCommon API
Dithering.Methods Enumeration
 Dithering algorithm.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum Methods
Public Enumeration Methods
Members
Member name | Value | Description
None | 0 | No dithering
FloydSteinberg | 1 | Floyd Steinberg algorithm
SimpleNoise | 2 | Simple random noise
See Also
Reference
Rhino.Render Namespace