RhinoCommon API
FileStlWriteOptions Class
 Options for writing a STL file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileStlWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileStlWriteOptions
Public Class FileStlWriteOptions
The FileStlWriteOptions type exposes the following members.
Constructors
Name | Description
FileStlWriteOptions
Initializes a new instance of the FileStlWriteOptions class
Top
Properties
Name | Description
BinaryFile
ExportOpenObjects
MeshingParameters
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace