RhinoCommon API
BezierSurface Class
 Represents a Bezier surface.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.BezierSurface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class BezierSurface : IDisposable
Public Class BezierSurface
	Implements IDisposable
The BezierSurface type exposes the following members.
Properties
Name | Description
Dimension
Dimension of Bezier
IsRational
 Gets a value indicating whether or not the surface is rational. Rational surfaces have control-points with custom weights.
IsValid
Tests an object to see if it is valid.
Top
Methods
Name | Description
ControlVertexCount
 Number of control vertices in this surface
CreateLoftedBezier
 Loft a bezier surface through a list of bezier curves.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Domain
Gets the domain in a direction.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetBoundingBox
 Bounding box solver. Gets the world axis aligned bounding box for the surface.
GetControlVertex2d
Get location of a control vertex.
GetControlVertex3d
Get location of a control vertex.
GetControlVertex4d
Get location of a control vertex.
MakeNonRational
Make bezier non-rational
MakeRational
Make bezier rational
PointAt
Evaluates point at a surface parameter.
Reverse
 Reverses parameterization Domain changes from [a,b] to [-b,-a]
Split
 Divides the Bezier surface at the specified parameter.
ToNurbsSurface
 Constructs a NURBS surface representation of this surface.
Transform
Transforms the surface
Transpose
 Transposes surface parameterization (swap U and V)
Top
See Also
Reference
Rhino.Geometry Namespace