RhinoCommon API
SimpleArrayMeshFace Class
 Wrapper for ON_SimpleArray<ON_MeshFace>. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayMeshFace
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArrayMeshFace : IDisposable
Public Class SimpleArrayMeshFace
	Implements IDisposable
The SimpleArrayMeshFace type exposes the following members.
Constructors
Name | Description
SimpleArrayMeshFace
 Initializes a new SimpleArrayMeshFace instance.
Top
Properties
Name | Description
Count
 Gets the amount of mesh faces in this array.
Top
Methods
Name | Description
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToArray
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace