RhinoCommon API
FileSvgReadOptions.ImportFillMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileSvgReadOptions.ImportFillMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum ImportFillMode
Public Enumeration ImportFillMode
Members
Member name | Value | Description
AsCurves | 0
AsHatches | 1
AsTrimmedPlanes | 2
See Also
Reference
Rhino.FileIO Namespace