RhinoCommon API
TrulyObservableOrderedSet<T> Class
 An ordered set that notifies its subscribers whenever one of its INotifyPropertyChanged elements raises its PropertyChanged event.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.Notifications.TrulyObservableOrderedSet<T>
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class TrulyObservableOrderedSet<T> : IList<T>,
	ICollection<T>, IEnumerable<T>, IEnumerable, INotifyCollectionChanged
where T : INotifyPropertyChanged, IAssemblyRestrictedObject
Public Class TrulyObservableOrderedSet(Of T As {INotifyPropertyChanged, IAssemblyRestrictedObject})
	Implements IList(Of T), ICollection(Of T),
	IEnumerable(Of T), IEnumerable, INotifyCollectionChanged
Type Parameters
T
A class that implements INotifyPropertyChanged as well as IAssemblyRestrictedObject
The TrulyObservableOrderedSet<T> type exposes the following members.
Constructors
Name | Description
TrulyObservableOrderedSet<T>(IEqualityComparer<T>)
 Creates an empty instance.
TrulyObservableOrderedSet<T>(IEnumerable<T>, IEqualityComparer<T>)
 Creates an instance with the given items.
Top
Properties
Name | Description
Count
 Returns the total number of items in the set.
IsReadOnly
 Always returns false.
Item
 Gets or replaces an element in the ordered set at the specified index.
Top
Methods
Name | Description
Add
 Adds an object to the end of the ordered set if the set does not already contain the item.
AddRange
 Add multiple objects to the end of the ordered set. Only distinct items are added. If new items were added, one CollectionChanged event is fired.
Clear
 Clears the ordered set.
Contains
 Determines whether an element is in the set.
CopyTo
 Copies the values of the set to an array.
GetEnumerator
 Returns an enumerator that iterates through the set.
IndexOf
 Searches for the specified object and returns the zero-based index of the first occurrence.
Insert
 Inserts an element at the specified index.
Remove
 Removes an element from the set.
RemoveAt
 Removes an element at the specified index from the set.
RemoveRange
 Remove a number of items. If at least one item was removed, one CollectionChanged event is fired.
Sort<TKey>
 Sorts the set.
Top
Events
Name | Description
CollectionChanged
 Triggered whenever the set changes or when one of its elements has its PropertyChanged event triggered.
Top
Remarks
This class prevents the removal of elements by assemblies they cannot be edited by. At the time of removal, each element's Editable() method will be invoked, and if false, an InvalidOperationException will be thrown.
See Also
Reference
Rhino.Runtime.Notifications Namespace