RhinoCommon API
Decals Class
Represents all the decals of an object.
Inheritance Hierarchy
System.Object
 Rhino.Render.Decals
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Decals : IEnumerable<Decal>,
	IEnumerable
Public Class Decals
	Implements IEnumerable(Of Decal), IEnumerable
The Decals type exposes the following members.
Methods
Name | Description
Add
 Add a new Decal to the collection. Use Decal.Create() to create a new decal instance to add.
Clear |  Obsolete.
GetEnumerator
Remove
 Remove a single decal from the collection.
RemoveAllDecals
 Remove all the decals from the collection.
Top
See Also
Reference
Rhino.Render Namespace