RhinoCommon API
NodeInCodeTable Class
 Permits rapid access to references to all Grasshopper functions.
Inheritance Hierarchy
System.Object
 System.Dynamic.DynamicObject
 Rhino.NodeInCode.NodeInCodeTable
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class NodeInCodeTable : DynamicObject
Public Class NodeInCodeTable
	Inherits DynamicObject
The NodeInCodeTable type exposes the following members.
Constructors
Name | Description
NodeInCodeTable
 Instantiates the table. Users of RhinoCommon do not typically need to call this constructor.
Top
Properties
Name | Description
Count
 Returns the amount of items in this table.
Top
Methods
Name | Description
Add
 Adds, or replaces a new instance of component function information.
Contains
 Check whether node is registered in this table or not
GetDynamicMemberNames
 Returns all additional names in the table.
 (Overrides DynamicObject.GetDynamicMemberNames().)
GetDynamicMembers
 Returns component info for all additional names in the table.
TryGetIndex
 Gets the ComponentFunctionInfo at
 (Overrides DynamicObject.TryGetIndex(GetIndexBinder, Object[], Object).)
TryGetMember
 Dynamically binds the table to property-like access via its item names.
 (Overrides DynamicObject.TryGetMember(GetMemberBinder, Object).)
TryInvokeMember
 Dynamically invokes a member of the table.
 (Overrides DynamicObject.TryInvokeMember(InvokeMemberBinder, Object[], Object).)
Top
See Also
Reference
Rhino.NodeInCode Namespace