RhinoCommon API
UserInterfaceLabel Class
 Draws a single line of text. Labels do not respond to the mouse; they are the descriptive text that goes beside the controls that do.
Inheritance Hierarchy
System.Object
 Rhino.UI.UserInterfaceObjectBase
 Rhino.UI.UserInterfaceControl
 Rhino.UI.UserInterfaceLabel
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class UserInterfaceLabel : UserInterfaceControl
Public Class UserInterfaceLabel
	Inherits UserInterfaceControl
The UserInterfaceLabel type exposes the following members.
Constructors
Name | Description
UserInterfaceLabel()
Initializes a new instance of the UserInterfaceLabel class
UserInterfaceLabel(String)
Initializes a new instance of the UserInterfaceLabel class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace