RhinoCommon API
ControlVerticalAlignment Enumeration
 Vertical alignment settings for control with respect to it's parent
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum ControlVerticalAlignment
Public Enumeration ControlVerticalAlignment
Members
Member name | Value | Description
Top | 0
Center | 1
Bottom | 2
Stretch | 3
See Also
Reference
Rhino.UI Namespace