RhinoCommon API
DisplayPipelineAttributes.WorldAxesIconColorUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.WorldAxesIconColorUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public enum WorldAxesIconColorUse
Public Enumeration WorldAxesIconColorUse
Members
Member name | Value | Description
UseApplicationSettings | 0 |  Use default setting
SameAsGridAxesColors | 1 |  Set colors for grid axes in Appearance: Colors Options
Custom | 2 |  Use specified custom colors
See Also
Reference
Rhino.Display Namespace