RhinoCommon API
FileGltf Class
 Support for writing glTF file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileGltf
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.3
Syntax
public class FileGltf
Public Class FileGltf
The FileGltf type exposes the following members.
Constructors
Name | Description
FileGltf
Initializes a new instance of the FileGltf class
Top
Methods
Name | Description
Write
Write a glTF file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace