RhinoCommon API
RenderTexture.TextureEvaluatorFlags Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderTexture.TextureEvaluatorFlags"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[FlagsAttribute]
public enum TextureEvaluatorFlags
<FlagsAttribute>
Public Enumeration TextureEvaluatorFlags
Members
Member name | Value | Description
Normal | 0
DisableFiltering | 1
DisableLocalMapping | 2
DisableAdjustment | 4
DisableProjectionChange | 8
See Also
Reference
Rhino.Render Namespace