RhinoCommon API
PreviewGeometry Class
 PreviewAppearance takes care of construction and destruction of PreviewGeometry
Inheritance Hierarchy
System.Object
 Rhino.Render.PreviewGeometry
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PreviewGeometry
Public Class PreviewGeometry
The PreviewGeometry type exposes the following members.
Constructors
Name | Description
PreviewGeometry
 Constructor for PreviewGeometry
Top
Properties
Name | Description
CppPointer
 CppPointer for PreviewGeometry
Top
Methods
Name | Description
ElementKind
 ElementKind
SetUpPreview
 SetUpPreview
Top
See Also
Reference
Rhino.Render Namespace