RhinoCommon API
ViewCaptureWriter Class
 Callback system used by SVG and PDF exporter to generate documents. Not intended for general SDK usage
Inheritance Hierarchy
System.Object
 Rhino.Runtime.ViewCaptureWriter
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class ViewCaptureWriter
Public MustInherit Class ViewCaptureWriter
The ViewCaptureWriter type exposes the following members.
Constructors
Name | Description
ViewCaptureWriter
Initializes a new instance of the ViewCaptureWriter class
Top
Properties
Name | Description
Dpi
PageSize
Top
Methods
Name | Description
Draw
DrawBitmap
DrawCircle
DrawGradientHatch
DrawPath
DrawRectangle
DrawScreenText
FillPolygon
Flush
PopClipPath
PushClipPath(ViewCaptureWriter.PathPoint[])
PushClipPath(RectangleF)
SetClipPath
SupportsArc
Top
See Also
Reference
Rhino.Runtime Namespace