RhinoCommon API
SimpleArrayByte Class
 Wrapper for ON_SimpleArray<unsigned char>. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayByte
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArrayByte : IDisposable
Public Class SimpleArrayByte
	Implements IDisposable
The SimpleArrayByte type exposes the following members.
Constructors
Name | Description
SimpleArrayByte()
 Initializes a new SimpleArrayByte class.
SimpleArrayByte(IEnumerable<Byte>)
 Initializes a new SimpleArrayByte class
SimpleArrayByte(Int32)
 Initializes a new SimpleArrayByte class. Initial size of the array - all values are set to zero.
SimpleArrayByte(SimpleArrayByte)
 Initializes a new SimpleArrayByte with the contents of another SimpleArrayByte.
Top
Properties
Name | Description
Count
 Gets the amount of elements in this array.
Top
Methods
Name | Description
Array
 Return the raw data.
ConstPointer
 Gets the constant (immutable) pointer of this array.
CopyTo
 Copies the contents of a SimpleArrayByte into another SimpleArrayByte.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToArray
 Returns the managed counterpart of the unmanaged array.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace