RhinoCommon API
CurvatureAnalysisSettings.CurvatureStyle Enumeration
 Curvature analysis styles
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum CurvatureStyle
Public Enumeration CurvatureStyle
Members
Member name | Value | Description
Gaussian | 0 |  Gaussian curvature
Mean | 1 |  Mean curvature
MinRadius | 2 |  Minimum radius curvature
MaxRadius | 3 |  Maximum radius curvature
Remarks
 These values mirror the curvature analysis settings of the application and differ from CurvatureStyle, which mirrors openNURBS. Casting one to the other selects the wrong style. The geometry methods, such as CreateFromMeshes(IEnumerable<Mesh>, CurvatureStyle), take the openNURBS values.
See Also
Reference
Rhino.ApplicationSettings Namespace