RhinoCommon API
Skylight Class
 ChangeQueue skylight
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.Skylight
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Skylight
Public Class Skylight
The Skylight type exposes the following members.
Properties
Name | Description
Enabled
 Return true if skylight is enabled
ShadowIntensity
 Get shadow intensity for skylight. This is unused at present.
UsesCustomEnvironment
 Return true if skylight uses custom environment
Top
Methods
Name | Description
ToString
 Textual representation of Skylight
 (Overrides Object.ToString().)
Top
See Also
Reference
Rhino.Render.ChangeQueue Namespace