RhinoCommon API
SimpleArrayHatchLinePointer Class
 Wrapper for a C++ ON_SimpleArray of ON_HatchLine*. If you are not writing C++ code, then you can ignore this class.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayHatchLinePointer
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public class SimpleArrayHatchLinePointer : IDisposable
Public Class SimpleArrayHatchLinePointer
	Implements IDisposable
The SimpleArrayHatchLinePointer type exposes the following members.
Constructors
Name | Description
SimpleArrayHatchLinePointer()
 Initializes a new SimpleArrayHatchLinePointer instance.
SimpleArrayHatchLinePointer(IEnumerable<HatchLine>)
 Initializes a new SimpleArrayHatchLinePointer instance, from a set of input hatch lines.
Top
Methods
Name | Description
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace