RhinoCommon API
SecretKey Class
 An instance of this of this class is given to the function you pass to ExceuteProtectedCodeAsync and must be passed to any method of the RhinoAccountsManager that requires it. Failure to do so will throw an InvalidOperationException.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.RhinoAccounts.SecretKey
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SecretKey
Public Class SecretKey
The SecretKey type exposes the following members.
Constructors
Name | Description
SecretKey
Initializes a new instance of the SecretKey class
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace