RhinoCommon API
RenderSettings.EnvironmentPurpose Enumeration
 The purpose a render environment is being used for.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum EnvironmentPurpose
Public Enumeration EnvironmentPurpose
Members
Member name | Value | Description
Standard | 0 |  Used to directly get and set the environment instance id.
ForRendering | 1 |  Used to get the environment instance id to be used for actual rendering.
See Also
Reference
Rhino.Render Namespace