RhinoCommon API
FileFbxWriteOptions.MaterialType Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileFbxWriteOptions.MaterialType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum MaterialType
Public Enumeration MaterialType
Members
Member name | Value | Description
Lambert | 0
Phong | 1
See Also
Reference
Rhino.FileIO Namespace