RhinoCommon API
DisplayPipelineAttributes.ClippingShadeColorUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.ClippingShadeColorUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public enum ClippingShadeColorUse
Public Enumeration ClippingShadeColorUse
Members
Member name | Value | Description
PlaneColor | 0 |  Uses the clipping plane's color (object or layer).
PlaneMaterialColor | 1 |  Uses the plane's render material (object or layer).
SolidColor | 2 |  Solid Color
See Also
Reference
Rhino.Display Namespace