RhinoCommon API
RenderMeshes Class
 RenderMeshes is a collection of geometry instances for a given ObjectId typically returned by the Custom Render primitive system. As each set of primitives is returned by the RenderMeshProviders in turn, the running hash is updated with new information about the primitive modifications that have been made along the way.
Inheritance Hierarchy
System.Object
 Rhino.Render.CustomRenderMeshes.RenderMeshes
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderMeshes : IDisposable,
	IEnumerable<Instance>, IEnumerable
Public Class RenderMeshes
	Implements IDisposable, IEnumerable(Of Instance),
	IEnumerable
The RenderMeshes type exposes the following members.
Constructors
Name | Description
RenderMeshes(RhinoDoc, Guid, Guid, UInt32) |  Obsolete.
 Create a new render primitives collection.
RenderMeshes(RhinoDoc, Guid, Guid, UInt32, UInt32)
 Create a new render primitives collection.
Top
Properties
Name | Description
Document
 The document with which this IRenderMeshes object is associated.
Hash
 The running hash for these render meshes.
InstanceCount
 The number of instance objects in this collection.
ObjectId
 The ObjectId with which this IRenderMeshes object is associated.
Top
Methods
Name | Description
AddInstance
 Adds a new instance to the render primitives collection.
Dispose()
 Dispose this collection
Dispose(Boolean)
 Dispose
Finalize
 Finalizer for this collection
 (Overrides Object.Finalize().)
GetEnumerator
 Return an object to iterator over the instances in the collection
GetHashCode
 Overrides default hash code function - just returns Hash
 (Overrides Object.GetHashCode().)
Top
See Also
Reference
Rhino.Render.CustomRenderMeshes Namespace