RhinoCommon API
TextureGraphInfo.Channel Enumeration
[Missing <summary> documentation for "T:Rhino.Render.TextureGraphInfo.Channel"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.3
Syntax
public enum Channel
Public Enumeration Channel
Members
Member name | Value | Description
kRed | 0
kGrn | 1
kBlu | 2
kAlp | 3
kLum | 4
See Also
Reference
Rhino.Render Namespace