RhinoCommon API
SubD.NurbsSurfaceType Enumeration
 ON_SubD::NurbsSurfaceType specifies what type of NURBS surfaces are returned by ON_SubD.GetSurfaceNurbsFragments()
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum NurbsSurfaceType
Public Enumeration NurbsSurfaceType
Members
Member name | Value | Description
Unset | 0 |  Not a valid type. Used to indicate the type has not been set and to encourage developers to explicitly specify a type. When in doubt, specify NurbsSurfaceType::Large.
Large | 1 |  Onee NURBS surface will be generated for each SubD quad. N NURBS surfaces will be generated for each SubD N-gon (N = 3, 5 or more). ON_Brepface may cover multiple Near extraordinary vertices, the surfaces may have lots of knots.
Medium | 2 |  NURBS surfaces will be as large as possible without the addition of extra knots. Near extraordinary vertices, the surfaces may have lots of knots. This option is preferred when a user wants larger NURBS surfaces but not at the cost of additional NURBS control points.
Small | 3 |  NURBS surfaces will not be merged and will have clamped knots.
Unprocessed | 4 |  NURBS surfaces will not be merged and will have unclamped uniform knots. This is useful as a starting point for customized merging and modifying continuity at extraordinary vertices.
See Also
Reference
Rhino.Geometry Namespace