RhinoCommon API
GetTorus Class
 Class provides user interface to define a torus.
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetTorus
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GetTorus : IDisposable
Public Class GetTorus
	Implements IDisposable
The GetTorus type exposes the following members.
Constructors
Name | Description
GetTorus
Initializes a new instance of the GetTorus class
Top
Properties
Name | Description
AroundDirectionCount
 The number of faces in the around direction.
AroundDirectionMinimumCount
 The minimum number of faces in the around direction.
DefaultSize
 Default radius or diameter (based on InDiameterMode)
FixInnerRadius
 Second radius option. The first radius chosen sets the inner dimension of the torus and the second radius is constrained to be outside of the first radius.
InDiameterMode
 Determines if the "size" value is representing a radius or diameter
InSecondDiameterMode
 Second radius option. Determines if the second "size" value is representing a radius or diameter
PromptForMeshDensity
 Set true if you are prompting for a mesh or subd torus.
SecondSize
 Second radius or diameter (based on InSecondDiameterMode)
VerticalDirectionCount
 The number of faces in the vertical direction.
VerticalDirectionMinimumCount
 The minimum number of faces in the vertical direction.
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Get
 Prompt for the getting of a torus.
GetMesh
 Prompt for the getting of a mesh torus.
Top
See Also
Reference
Rhino.Input.Custom Namespace