RhinoCommon API
PostEffectState Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffectState"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.PostEffectState
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PostEffectState : IDisposable
Public Class PostEffectState
	Implements IDisposable
The PostEffectState type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the PostEffectState
Finalize |  (Overrides Object.Finalize().)
SetValue<T>
TryGetValue<T>
Top
See Also
Reference
Rhino.Render.PostEffects Namespace