RhinoCommon API
ModelAidSettingsState Class
 Represents a snapshot of ModelAidSettings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.ModelAidSettingsState
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ModelAidSettingsState
Public Class ModelAidSettingsState
The ModelAidSettingsState type exposes the following members.
Properties
Name | Description
AltPlusArrow
true mean Alt+arrow is used for nudging.
AutoAlignCPlane
AutoCPlaneAlignment
 //0 = object, 1 = world, 2 = view
AutoGumballEnabled
CenterSnapToApproximations
ControlPolygonDisplayDensity
Gets or sets the control polygon display density.
CtrlNudgeKeyStep
Gets or sets the Ctrl-key based nudge step amount.
DigitizerOsnapPickboxRadius
DisplayControlPolygon
Gets or sets the enabled state of Rhino's display control polygon.
DragStartsWindowSelection
EnableOsnapHighlight
ExtendToApparentIntersection
Gets or sets the enabled state of Rhino's extend to apparent intersections.
ExtendTrimLines
Gets or sets the enabled state of Rhino's extend trim lines.
GridSnap
Gets or sets the enabled state of Rhino's grid snap modeling aid.
GumballExtrudeMergeFaces
HighlightControlPolygon
Gets or sets the enabled state of Rhino's highlight dialog modeling aid.
MousePickboxRadius
Gets or sets the radius of the mouse pick box in pixels.
NearMidIntPerpSnapToMeshes
NudgeKeyStep
Gets or sets the nudge step amount.
NudgeMode
0 = world, 1 = cplane, 2 = view, 3 = UVN, -1 = not set.
OnlySnapToSelected
OrientAutoCPlaneToView
 Gets or sets whether the auto cplane will rotate towards the view after aligning to the selection
Ortho
Gets or sets the enabled state of Rhino's ortho modeling aid.
OrthoAngle
Gets or sets the base orthogonal angle.
OrthoUseZ
 Gets or sets whether Ortho will snap to the CPlane Z axis
Osnap
Gets or sets the enabled state of Rhino's object snap modeling aid.
OsnapCursorMode
Gets or sets the OSnap cursor mode.
OsnapModes
 Returns or sets Rhino's current object snap mode.
The mode is a bitwise value based on the OsnapModes enumeration.
OsnapPickboxRadius
Enables or disables Rhino's planar modeling aid.
Planar
Gets or sets the enabled state of Rhino's Planar modeling aid.
PointDisplay
Gets or sets the point display mode.
ProjectSnapToCPlane
Gets or sets the enabled state of Rhino's Project modeling aid.
ProjectToCPlaneInPlanParallelViews
ShiftNudgeKeyStep
Gets or sets the Shift-key based nudge step amount.
SnappyGumballEnabled
SnapToFiltered
SnapToLocked
Gets or sets the locked state of the snap modeling aid.
SnapToOccluded
StickyAutoCPlane
 Gets or set whether the auto cplane will stay even after deselection
UniversalConstructionPlaneMode
Gets or sets the locked state of the snap modeling aid.
UseHorizontalDialog
Gets or sets the enabled state of Rhino's use horizontal dialog modeling aid.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace