RhinoCommon API
RhinoAccountsInvalidTokenException Class
 Exception thrown when the token returned by Rhino Accounts is not valid.
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.RhinoAccounts.RhinoAccountsException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsInvalidTokenException
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class RhinoAccountsInvalidTokenException : RhinoAccountsException
<SerializableAttribute>
Public Class RhinoAccountsInvalidTokenException
	Inherits RhinoAccountsException
The RhinoAccountsInvalidTokenException type exposes the following members.
Constructors
Name | Description
RhinoAccountsInvalidTokenException(Exception)
 Generates a new instance of the exception.
RhinoAccountsInvalidTokenException(String, Exception)
 Generates a new instance of the exception.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace