RhinoCommon API
CurvatureGraphSettings Class
 Contains static methods and properties to modify curvature graph commands.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.CurvatureGraphSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static class CurvatureGraphSettings
Public NotInheritable Class CurvatureGraphSettings
The CurvatureGraphSettings type exposes the following members.
Properties
Name | Description
CurveHairColor
 Gets or sets the curve hair color;
HairDensity
 Gets or sets the hair density;
HairScale
 Gets or sets the hair scale;
SampleDensity
 Gets or sets the sampling density;
SrfUHair
 Gets or sets the surface U hairs are on;
SrfVHair
 Gets or sets the surface V hairs are on;
SurfaceUHairColor
 Gets or sets the surface U hair color;
SurfaceVHairColor
 Gets or sets the surface V hair color;
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
RestoreDefaults
 Commits the default settings as the current settings.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace