RhinoCommon API
HatchPatternTable Class
 All of the hatch pattern definitions contained in a rhino document.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<HatchPattern>
 Rhino.DocObjects.Tables.RhinoDocCommonTable<HatchPattern>
 Rhino.DocObjects.Tables.HatchPatternTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class HatchPatternTable : RhinoDocCommonTable<HatchPattern>,
	ICollection<HatchPattern>, IEnumerable<HatchPattern>, IEnumerable
Public NotInheritable Class HatchPatternTable
	Inherits RhinoDocCommonTable(Of HatchPattern)
	Implements ICollection(Of HatchPattern), IEnumerable(Of HatchPattern),
	IEnumerable
The HatchPatternTable type exposes the following members.
Properties
Name | Description
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
CurrentHatchPatternIndex
 At all times, there is a "current" hatch pattern. Unless otherwise specified, new objects are assigned to the current hatch pattern. The current hatch pattern is never locked, hidden, or deleted.
Item
 Conceptually, the hatch pattern table is an array of hatch patterns. The operator[] can be used to get individual hatch patterns. A hatch pattern is either active or deleted and this state is reported by HatchPattern.IsDeleted.
Top
Methods
Name | Description
Add
 Adds a new hatch pattern with specified definition to the table.
Delete(HatchPattern)
 Deletes a hatch pattern from the table.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32)
 Deletes a hatch pattern from the table.
Delete(HatchPattern, Boolean)
 Deletes a hatch pattern from the table.
Delete(IEnumerable<Int32>, Boolean)
 Delete multiple hatch patterns.
Delete(Int32, Boolean)
 Deletes a hatch pattern from the table.
Find |  Obsolete.
 Finds the hatch pattern with a given name. Search ignores case.
FindIndex
 Retrieves a HatchPattern object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds the hatch pattern with a given name. Search ignores case.
FindNameHash
 Finds a HatchPattern given its name hash.
GetUnusedHatchPatternName
 Gets unused hatchpattern name used as default when creating new hatchpatterns.
Modify
 Modify hatch pattern settings.
PurgeUnused
 Purges any unused hatch patterns.
Rename(HatchPattern, String)
 Renames a hatch pattern in the table.
Rename(Int32, String)
 Renames a hatch pattern in the table.
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace