RhinoCommon API
MatchSrfSettings Class
 Settings for matching a surface edge to other edge(s)
Inheritance Hierarchy
System.Object
 Rhino.Geometry.MatchSrfSettings
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MatchSrfSettings
Public Class MatchSrfSettings
The MatchSrfSettings type exposes the following members.
Constructors
Name | Description
MatchSrfSettings
 Constructor
Top
Properties
Name | Description
Average
 If true, change both surfaces
Continuity
 Match the shape of the edge being edited to the target edge C0_continuous: edge position only G1_continuous: edge position and tangency G2_continuous: edge position, tangency and curvature
MatchClosestPoints
 Match the edge to the closest points on the target edge
OtherEnd
 Maintain the shape of the edge opposite the one being edited None: opposite edge is free to change C0_continuous: opposite edge position only G1_continuous: opposite edge position and tangency G2_continuous: opposite edge position, tangency and curvature
PreserveIso
 The way the surface iso-lines align with the target
RefineAngleToleranceRadians
 Angle between surface normals during refinement
RefineCurvatureTolerance
 Percentage radius of curvature difference during refinement
RefineMatch
 Add control point rows to the surface if necessary
RefinePositionalTolerance
 Absolute distance tolerance for refinement
ReverseAverageTargetDirection
 Reverse the direction of the target for the averaged edge.
ReverseMatchDirection
 Reverse the direction of the edge to match.
Top
Methods
Name | Description
EnableRefinement
 Enable refinement of the surface being edited
Top
See Also
Reference
Rhino.Geometry Namespace