RhinoCommon API
DisplayPipelineAttributes.DynamicDisplayUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.DynamicDisplayUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.11
Syntax
public enum DynamicDisplayUse
Public Enumeration DynamicDisplayUse
Members
Member name | Value | Description
UseAppSettings | 0 |  Use system default settings.
DisplayObjectBoundingBox | 1 |  Reduces the display of objects to their bounding boxes. This can speed up the display on large models.
See Also
Reference
Rhino.Display Namespace