RhinoCommon API
LinkedInstanceDefinitionUpdateStyle Enumeration
 Linked and linked and embedded instance definition update style.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.29
Syntax
public enum LinkedInstanceDefinitionUpdateStyle
Public Enumeration LinkedInstanceDefinitionUpdateStyle
Members
Member name | Value | Description
Prompt | 1 |  Ask the user if the linked and linked and embedded instance definitions should be updated.
AlwaysUpdate | 2 |  Always update linked and linked and embedded instance definitions.
NeverUpdate | 3 |  Never update linked and linked and embedded instance definitions.
See Also
Reference
Rhino Namespace