RhinoCommon API
FileGts Class
 Support for writing Gts file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileGts
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileGts
Public NotInheritable Class FileGts
The FileGts type exposes the following members.
Methods
Name | Description
Write
Write a Gts file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace