RhinoCommon API
DocumentOpenEventArgs Class
 Provides document information for RhinoDoc events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocumentEventArgs
 Rhino.DocumentOpenEventArgs
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DocumentOpenEventArgs : DocumentEventArgs
Public Class DocumentOpenEventArgs
	Inherits DocumentEventArgs
The DocumentOpenEventArgs type exposes the following members.
Properties
Name | Description
FileName
 Name of file being opened.
Merge
 true if file is being merged into the current document. This occurs during the "Import" command.
Reference
 true if file is opened as a reference file.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino Namespace