RhinoCommon API
EmapAnalysisSettings Class
 Contains static methods and properties to modify the visibility of curve ends.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.EmapAnalysisSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class EmapAnalysisSettings
Public NotInheritable Class EmapAnalysisSettings
The EmapAnalysisSettings type exposes the following members.
Properties
Name | Description
BlendWithObjectColor
 Gets or sets whether to blend the image with the object's color.
FileName
 Gets or sets the current emap file name.
ShowIsoparams
 Gets or sets whether to display iso curves.
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultFileNames
 Get list of emap's Default MRU filenames
GetDefaultState
 Gets the factory settings of the application.
GetFileNames
 Get available list of emap filenames
SetFileNames
 Set available list of emap filenames
Top
See Also
Reference
Rhino.ApplicationSettings Namespace