RhinoCommon API
ComponentOrders Enumeration
 Pixel component order for channels in the RenderWindow and PostEffects.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum ComponentOrders
Public Enumeration ComponentOrders
Members
Member name | Value | Description
Irrelevant | 0 |  Used in single-value channels.
RGBA | 1 |  This is the default (to match Rhino 5)
ARGB | 2 |  ARGB component order
RGB | 3 |  This will only access 3 components, even in the case of the RGBA channel
BGR | 4 |  This will only access 3 components, even in the case of the RGBA channel.
ABGR | 5 |  ABGR component order
BGRA | 6 |  BGRA component order
XYZ | 3 |  For readability when using the Normal XYZ channel. Same as RGB
ZYX | 4 |  For readability when using the Normal XYZ channel. Same as BGR
See Also
Reference
Rhino.Render Namespace