RhinoCommon API
HiddenLineDrawing Class
 Represents a hidden line drawing object. A hidden line drawing consists of curves generated from source objects. The curves correspond to edges, and silhouettes of source objects and intersections with cutting planes.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.HiddenLineDrawing
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class HiddenLineDrawing : IDisposable
Public NotInheritable Class HiddenLineDrawing
	Implements IDisposable
The HiddenLineDrawing type exposes the following members.
Properties
Name | Description
Points
 Point objects calculated by the hidden line drawing.
Segments
 Sub-curve objects calculated by the hidden line drawing.
Viewport
 Returns the ViewportInfo used by the hidden line drawing.
WorldToHiddenLine
 Returns the world-coordinate system to HLD-coordinate system transformation.
Top
Methods
Name | Description
BoundingBox
 Get tight bounding box of the hidden line drawing.
Compute(HiddenLineDrawingParameters, Boolean)
 Perform the hidden line drawing calculation based on input parameters
Compute(HiddenLineDrawingParameters, Boolean, IProgress<Double>, CancellationToken)
 Perform the hidden line drawing calculation based on input parameters
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
RejoinCompatibleVisible
 Join consecutive visible curves from a single FullCurve
Top
See Also
Reference
Rhino.Geometry Namespace