RhinoCommon API
WorksessionFileLayerOverride Class
 A layer setting in a reference model that the worksession changes. Any value that is different in the worksession values and the file values is an override. Values that are the same are not.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.WorksessionFileLayerOverride
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public sealed class WorksessionFileLayerOverride : IDisposable
Public NotInheritable Class WorksessionFileLayerOverride
	Implements IDisposable
The WorksessionFileLayerOverride type exposes the following members.
Constructors
Name | Description
WorksessionFileLayerOverride()
Creates a layer override with default values.
WorksessionFileLayerOverride(WorksessionFileLayerOverride)
Creates a copy of another layer override.
Top
Properties
Name | Description
LayerId
Gets or sets the id of the layer in the reference model file.
Top
Methods
Name | Description
Dispose
Releases the native layer override.
Finalize
Releases the native layer override.
 (Overrides Object.Finalize().)
GetFileValues
 Gets a copy of the layer's settings in the reference model when the worksession was saved.
GetWorksessionValues
Gets a copy of the layer's settings in the worksession.
SetFileValues
Replaces the file values with a copy of values.
SetWorksessionValues
Replaces the worksession values with a copy of values.
Top
See Also
Reference
Rhino.FileIO Namespace