RhinoCommon API
SnapshotTable Class
 All snapshots in a rhino document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.SnapshotTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class SnapshotTable
Public NotInheritable Class SnapshotTable
The SnapshotTable type exposes the following members.
Properties
Name | Description
Document
Document that owns this table.
Names
Array of Snapshot names.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace