RhinoCommon API
FileFbx Class
 Support for writing Fbx file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileFbx
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileFbx
Public NotInheritable Class FileFbx
The FileFbx type exposes the following members.
Methods
Name | Description
Read
Read a Fbx file intof a RhinoDoc
Write
Write a Fbx file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace