RhinoCommon API
RhinoPageInterop Class
 For internal use only, provides access to unmanaged core Rhino.
Inheritance Hierarchy
System.Object
 Rhino.UI.RhinoPageInterop
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class RhinoPageInterop
Public NotInheritable Class RhinoPageInterop
The RhinoPageInterop type exposes the following members.
Methods
Name | Description
NewPropertiesPanelPagePointer
 For internal use only, provides access to unmanaged core
StackedDialogPageFromUnmanagedPointer
 For internal use only, provides access to unmanaged core
Top
See Also
Reference
Rhino.UI Namespace