RhinoCommon API
SumSurface Class
 Represents a sum surface, or an extrusion of a curve along a curved path.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.SumSurface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class SumSurface : Surface
<SerializableAttribute>
Public Class SumSurface
	Inherits Surface
The SumSurface type exposes the following members.
Constructors
Name | Description
SumSurface
 Protected constructor for internal use.
Top
Properties
Name | Description
Top
Methods
Name | Description
Create(Curve, Curve)
 Constructs a new sum surface by extruding a curve A along a path B.
Create(Curve, Vector3d)
 Constructs a new sum surface by extruding a curve in a specified direction.
Top
See Also
Reference
Rhino.Geometry Namespace