RhinoCommon API
Point4dField Class
 Point4d field value class
Inheritance Hierarchy
System.Object
 Rhino.Render.Fields.Field
 Rhino.Render.Fields.Point4dField
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Point4dField : Field
Public Class Point4dField
	Inherits Field
The Point4dField type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the field value
Top
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
Rhino.Render.Fields Namespace