RhinoCommon API
DocumentOrFreeFloatingBase Class
 Base class for Rhino.Render objects that are owned by the document, or can be delivered separately from other functions. In general, you cannot create these objects yourself.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 More...
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class DocumentOrFreeFloatingBase : FreeFloatingBase
Public MustInherit Class DocumentOrFreeFloatingBase
	Inherits FreeFloatingBase
The DocumentOrFreeFloatingBase type exposes the following members.
Methods
Name | Description
BeginChange
EndChange
Top
See Also
Reference
Rhino.Render Namespace
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.Dithering
 Rhino.Render.GroundPlane
 Rhino.Render.LinearWorkflow
 Rhino.Render.PostEffects.PostEffectCollection
 Rhino.Render.RenderChannels
 Rhino.Render.SafeFrame
 Rhino.Render.Skylight
 Rhino.Render.Sun