RhinoCommon API
ValidateProductKeyDelegate Delegate
 Validates a product key or license.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate ValidateResult ValidateProductKeyDelegate(
	string productKey,
	out LicenseData licenseData
)
Public Delegate Function ValidateProductKeyDelegate (
	productKey As String,
	<OutAttribute> ByRef licenseData As LicenseData
) As ValidateResult
Parameters
productKey
Type: System.String
licenseData
Type: Rhino.PlugIns.LicenseData
Return Value
Type: ValidateResult
See Also
Reference
Rhino.PlugIns Namespace