RhinoCommon API
FileIgsWriteOptions.IgesStringTypeMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileIgsWriteOptions.IgesStringTypeMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum IgesStringTypeMode
Public Enumeration IgesStringTypeMode
Members
Member name | Value | Description
Unicode | 0
BIG5 | 1
See Also
Reference
Rhino.FileIO Namespace