RhinoCommon API
FileStpWriteOptions.StepSchema Enumeration
 Step schema.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum StepSchema
Public Enumeration StepSchema
Members
Member name | Value | Description
SF_203 | 0
SF_214 | 1
SF_214_CC2 | 2
SF_242 | 3
See Also
Reference
Rhino.FileIO Namespace