RhinoCommon API
PostEffectThreadEngine Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffectThreadEngine"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.PostEffectThreadEngine
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PostEffectThreadEngine : IDisposable
Public Class PostEffectThreadEngine
	Implements IDisposable
The PostEffectThreadEngine type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the PostEffectThreadEngine
Finalize |  (Overrides Object.Finalize().)
RunPostEffect
Top
See Also
Reference
Rhino.Render.PostEffects Namespace