RhinoCommon API
ContentHash Class
 Contains information that is useful to uniquely identify an object.
Remarks
This object is immutable.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.ContentHash
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ContentHash : ICloneable,
	IEquatable<ContentHash>
Public Class ContentHash
	Implements ICloneable, IEquatable(Of ContentHash)
The ContentHash type exposes the following members.
Constructors
Name | Description
ContentHash
 Constructs a copy of a content hash.
Top
Properties
Name | Description
ByteCount
 Gets the length of the content, in bytes.
HashTime
 Gets the hash time, rounded to seconds.
Sha1ContentHash
 Gets the 20-bytes long SHA1 hash of the content.
Sha1NameHash
 Gets the 20-bytes long SHA1 hash of the name.
Top
Methods
Name | Description
Clone
 Creates a copy of this content hash. Because content hash is immutable, this can be used as a deep copy.
CreateFromFile
 Creates a new ContentHash, representing the content of a file.
Equals(ContentHash)
 Determines if another content hash has the same value.
Equals(Object)
 Determines if another object is a content hash with same value.
 (Overrides Object.Equals(Object).)
GetHashCode
 Gets an hash code for this content hash. Two equal content hashes have equal hash code. The other way around might not be true.
 (Overrides Object.GetHashCode().)
Top
Operators
Name | Description
Equality
 Determines if two ContentHash instances are equal by value.
Inequality
 Determines if two ContentHash instances are different by value.
Top
See Also
Reference
Rhino.FileIO Namespace