RhinoCommon API
PlaneIntersectionCache Class
 Data that GeometryPlane(GeometryBase, Plane, Double, Boolean, Boolean, Boolean, RhinoDoc, Transform, PlaneIntersectionCache, CancellationToken, Curve[], Point3d[]) computes from the geometry alone, kept between calls: the mesh intersection data of a mesh, and the Brep a SubD, Extrusion, Surface or BrepFace converts to. Reuse one cache for many planes through the same geometry, such as a contour stack.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Intersect.PlaneIntersectionCache
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class PlaneIntersectionCache : IDisposable
Public NotInheritable Class PlaneIntersectionCache
	Implements IDisposable
The PlaneIntersectionCache type exposes the following members.
Constructors
Name | Description
PlaneIntersectionCache
 Creates an empty cache.
Top
Methods
Name | Description
Clear
 Removes all entries, and releases the geometry the cache kept alive.
Dispose
 Releases the native cache.
Finalize
 Releases the native cache.
 (Overrides Object.Finalize().)
Top
Remarks
 Entries are keyed by the native geometry. The cache keeps each geometry it is used with alive until Clear() or Dispose(), so a new object cannot take over the entry of a collected one. Call Clear() when a geometry used with the cache, or an instance definition it references, is changed in place; not while the cache is in use. One cache can be used from several threads at the same time.
See Also
Reference
Rhino.Geometry.Intersect Namespace