RhinoCommon API
DisplayDeviceInfo Class
 Get information about display devices found on this machine (GPUs).
Inheritance Hierarchy
System.Object
 Rhino.DisplayDeviceInfo
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DisplayDeviceInfo
Public Class DisplayDeviceInfo
The DisplayDeviceInfo type exposes the following members.
Constructors
Name | Description
DisplayDeviceInfo
Initializes a new instance of the DisplayDeviceInfo class
Top
Methods
Name | Description
GpuDeviceInfos
 Get a list of GpuDeviceInfo for GPUs found on this machine.
GpuNames
 Get a list with the names of all GPUs on this machine.
Top
See Also
Reference
Rhino Namespace