RhinoCommon API
FactoryBase Class
 Base class for CollapsibleSection and ViewModel factories used by the RDK UI
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.FactoryBase
 Rhino.UI.Controls.CollapsibleSectionImpl.Factory
 Rhino.UI.Controls.InternalRdkViewModelFactory
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class FactoryBase
Public MustInherit Class FactoryBase
The FactoryBase type exposes the following members.
Methods
Name | Description
Finalize
 Finalizer
 (Overrides Object.Finalize().)
Get
 Override this method to return a new instance of your class for the given ID
Register()
 Call this function during startup of current assembly to load classes with factory creation support are registed
Register(PlugIn)
 Call this function during the startup of your plug-in to ensure that all classes that support factory creation are registed
Top
See Also
Reference
Rhino.UI.Controls Namespace