RhinoCommon API
Point3f Structure
 Represents the three coordinates of a point in three-dimensional space, using Single-precision floating point numbers.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public struct Point3f : IEquatable<Point3f>,
	IComparable<Point3f>, IComparable, IEpsilonFComparable<Point3f>,
	IFormattable
<SerializableAttribute>
Public Structure Point3f
	Implements IEquatable(Of Point3f), IComparable(Of Point3f),
	IComparable, IEpsilonFComparable(Of Point3f), IFormattable
The Point3f type exposes the following members.
Constructors
Name | Description
Point3f
 Initializes a new two-dimensional vector from two components.
Top
Properties
Name | Description
IsValid
 Each coordinate of the point must pass the IsValidSingle(Single) test.
Origin
 Gets the value of a point at location 0,0,0.
Unset
 Gets the value of a point at location RhinoMath.UnsetValue,RhinoMath.UnsetValue,RhinoMath.UnsetValue.
X
 Gets or sets the X (first) component of the vector.
Y
 Gets or sets the Y (second) component of the vector.
Z
 Gets or sets the Z (third) component of the vector.
Top
Methods
Name | Description
CompareTo
 Compares this Point3f with another Point3f.
Component evaluation priority is first X, then Y, then Z.
DistanceTo
 Computes the distance between two points.
DistanceToSquared
 Computes the squared distance between two points.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Point3f and has the same values as the present point.
 (Overrides ValueType.Equals(Object).)
Equals(Point3f)
 Determines whether the specified Point3f has the same values as the present point.
GetHashCode
 Computes a hash code for the present point.
 (Overrides ValueType.GetHashCode().)
Subtract
 Subtracts a point from another point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
ToString()
 Constructs the string representation for the current point.
 (Overrides ValueType.ToString().)
ToString(String, IFormatProvider)
Formats the value of the current instance using the specified format.
Transform
 Transforms the present point in place. The transformation matrix acts on the left of the point. i.e.,
result = transformation*point
Top
Operators
Name | Description
Addition
 Adds a point to another point.
Equality
 Determines whether two points have equal values.
Explicit(Point3d to Point3f)
 Converts a double-precision point in a single-precision point. Needs explicit casting to help retain precision.
Explicit(Point3f to Vector3f)
 Converts a single-precision point in a single-precision vector. Needs explicit casting to help retain precision.
GreaterThan
 Determines whether the first specified point comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
GreaterThanOrEqual
 Determines whether the first specified point comes after (has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then Z.
Inequality
 Determines whether two points have different values.
LessThan
 Determines whether the first specified point comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
LessThanOrEqual
 Determines whether the first specified point comes before (has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then Z.
Multiply(Point3f, Single)
 Multiplies a point by a factor.
Multiply(Single, Point3f)
 Multiplies a point by a factor.
Subtraction
 Subtracts a point from another point.
Top
See Also
Reference
Rhino.Geometry Namespace