RhinoCommon API
NurbsCurveFitParameters.TangentMatch Enumeration
 The TangentMatch enum is used to constrain the tangents of the rebuilt curve to match those of the target curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum TangentMatch
Public Enumeration TangentMatch
Members
Member name | Value | Description
None | 0 |  Ignore target curve start and end tangent directions.
AtStart | 1 |  Match the target curve start tangent direction.
AtEnd | 2 |  Match the target curve end tangent direction.
AtStartAndEnd | 3 |  Match the target curve start and end tangent direction.
See Also
Reference
Rhino.Geometry Namespace