RhinoCommon API
GumballMode Enumeration
 Transformation modes for gumballs.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum GumballMode
Public Enumeration GumballMode
Members
Member name | Value | Description
None | 0
Menu | 1 | Gumball menu button was picked.
TranslateFree | 2 | Unconstrained translation.
TranslateX | 3 | Translation along a single axis.
TranslateY | 4 | Translation along a single axis.
TranslateZ | 5 | Translation along a single axis.
TranslateXY | 6 | Translation in a plane.
TranslateYZ | 7 | Translation in a plane.
TranslateZX | 8 | Translation in a plane.
ScaleX | 9 | Scale along a single axis.
ScaleY | 10 | Scale along a single axis.
ScaleZ | 11 | Scale along a single axis.
ScaleXY | 12 | Scale in a plane.
ScaleYZ | 13 | Scale in a plane.
ScaleZX | 14 | Scale in a plane.
RotateX | 15 | Rotation around a single axis.
RotateY | 16 | Rotation around a single axis.
RotateZ | 17 | Rotation around a single axis.
ExtrudeX | 18 | Extrusion along a single axis.
ExtrudeY | 19 | Extrusion along a single axis.
ExtrudeZ | 20 | Extrusion along a single axis.
CutX | 21 | Cutting extrusion along the gumball X axis.
CutY | 22 | Cutting extrusion along the gumball Y axis.
CutZ | 23 | Cutting extrusion along the gumball Z axis.
See Also
Reference
Rhino.UI.Gumball Namespace