RhinoCommon API
RhinoAccountsInvalidStateException Class
 Occurs when the state returned by the Rhino Accounts server is not the same as the one sent to the server. It usually indicates the request has been tampered with.
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.RhinoAccounts.RhinoAccountsException
 Rhino.Runtime.RhinoAccounts.RhinoAccountsInvalidStateException
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class RhinoAccountsInvalidStateException : RhinoAccountsException
<SerializableAttribute>
Public Class RhinoAccountsInvalidStateException
	Inherits RhinoAccountsException
The RhinoAccountsInvalidStateException type exposes the following members.
Constructors
Name | Description
RhinoAccountsInvalidStateException(Exception)
 Generates a new instance of the exception.
RhinoAccountsInvalidStateException(String, Exception)
 Generates a new instance of the exception.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace