RhinoCommon API
ComponentStatus Structure
 Provides information about selection, highlighting, visibility, editability and integrity states of a component.
This structure is immutable.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public struct ComponentStatus : IEquatable<ComponentStatus>
Public Structure ComponentStatus
	Implements IEquatable(Of ComponentStatus)
The ComponentStatus type exposes the following members.
Properties
Name | Description
AllSet
 All flags are checked.
Clear
 This is the default value and equal to undefined.
Damaged
 The damaged flag is checked.
Hidden
 The hidden flag is checked.
Highlighted
 The highlight selection flag is checked.
IsClear
 True if every setting is 0 or false.
IsDamaged
 Returns false if component is not damaged. True otherwise.
IsHidden
 Returns true if hidden. False otherwise.
IsHighlighted
 Returns true if highlighted. False otherwise.
IsLocked
 Returns true if locked. False otherwise.
IsSelected
 Returns true if selected or selected persistent. False otherwise.
IsSelectedPersistent
 Returns true if selected persistent. False otherwise.
Locked
 The locked flag is checked.
Selected
 The selection flag is checked.
SelectedPersistent
 The persistent selection flag is checked.
Top
Methods
Name | Description
Equals(ComponentStatus)
 Determines if another ComponentStatus and this are equal.
Equals(Object)
 Determines if an object and this are equal.
 (Overrides ValueType.Equals(Object).)
GetHashCode
 Serves as a special hash function. The inner value is used for the purpose.
 (Overrides ValueType.GetHashCode().)
HasAllEqualStates
 For the purposes of this test, Selected and SelectedPersistent are considered equal.
HasNoEqualStates
 For the purposes of this test, Selected and SelectedPersistent are considered equal.
HasSomeEqualStates
 For the purposes of this test, Selected and SelectedPersistent are considered equal.
ToString
 Provides a string representation of this ComponentStatus.
 (Overrides ValueType.ToString().)
WithStates
 Activates any information flag described in any of the two input component statuses and returns a new ComponentStatus with those flags checked.
Top
Operators
Name | Description
Addition
 Sets flags from both component states and returns a new ComponentStatus.
Equality
 Determines if two ComponentStatus objects are equal.
Inequality
 Determines if two ComponentStatus objects differ.
Top
See Also
Reference
Rhino.Geometry Namespace