RhinoCommon API
Thumbnail Class
Note: This API is now obsolete.
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.Thumbnail"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.ThumbnailUI.Thumbnail
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Thumbnail is obsolete", false)]
public class Thumbnail : IRhRdkThumbnail, IDisposable
<ObsoleteAttribute("Thumbnail is obsolete", false)>
Public Class Thumbnail
	Implements IRhRdkThumbnail, IDisposable
The Thumbnail type exposes the following members.
Constructors
Name | Description
Thumbnail
 Constructor for Thumbnail
Top
Properties
Name | Description
CppPointer
 Thumbnail c++ pointer
Top
Methods
Name | Description
Dib
Dispose
 Dispose for Thumbnail
Finalize
 Destructor for Thumbnail
 (Overrides Object.Finalize().)
GetDib
GetDisplayRect
Id
IsHot
IsSelected
Label
Top
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace