RhinoCommon API
RuiUpdateUi Class
[Missing <summary> documentation for "T:Rhino.UI.RuiUpdateUi"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.UI.RuiUpdateUi
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RuiUpdateUi : EventArgs
Public Class RuiUpdateUi
	Inherits EventArgs
The RuiUpdateUi type exposes the following members.
Properties
Name | Description
Checked
Set to true to enable menu item or false to check menu item
Enabled
Set to true to enable menu item or false to disable menu item
FileId
Id of the RUI file that owns this menu item
MenuHandle
Windows menu handle of menu that contains this item
MenuId
Id of the menu that owns this menu item
MenuIndex
Zero based index of item in the Windows menu
MenuItemId
Id of the menu item that owns this menu item
RadioChecked
Set to true to enable menu item or false to check menu item
Text
Menu item text
WindowsMenuItemId
Windows menu item ID
Top
Methods
Name | Description
RegisterMenuItem(Guid, Guid, Guid, RuiUpdateUi.UpdateMenuItemEventHandler)
Register menu item update delegate
RegisterMenuItem(String, String, String, RuiUpdateUi.UpdateMenuItemEventHandler)
Register menu item update delegate
Top
See Also
Reference
Rhino.UI Namespace