RhinoCommon API
HatchPatternTableEventArgs Class
 LinetypeTable event arguments
Since: 8.15
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.Tables.HatchPatternTableEventArgs
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class HatchPatternTableEventArgs : EventArgs
Public Class HatchPatternTableEventArgs
	Inherits EventArgs
The HatchPatternTableEventArgs type exposes the following members.
Properties
Name | Description
Document
 The document in which the event occurred.
EventType
 The event type.
HatchPatternIndex
 Index of the hatchpattern.
NewState
 The new state.
OldState
 The old state.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace