RhinoCommon API
OptionPageButtons Enumeration
 Standard IRhinoOptionsPageButton
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum OptionPageButtons
Public Enumeration OptionPageButtons
Members
Member name | Value | Description
None | 0 |  Don't display any of the standard buttons.
DefaultButton | 1 |  The "Restore Defaults" button located at the bottom of the host.
ApplyButton | 2 |  The "Apply" button located at the bottom of the host.
See Also
Reference
Rhino.UI Namespace