RhinoCommon API
SceneServerDataUsage Enumeration
 SceneServerData Usage (Synchronous or Asynchronous)
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum SceneServerDataUsage
Public Enumeration SceneServerDataUsage
Members
Member name | Value | Description
Synchronous | 0
Asynchronous | 1
See Also
Reference
Rhino.Render Namespace