RhinoCommon API
SweepRebuild Enumeration
 Rebuild types for creating swept surfaces
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.16
Syntax
public enum SweepRebuild
Public Enumeration SweepRebuild
Members
Member name | Value | Description
None | 0 |  Do not simplify cross section curves.
Rebuild | 1 |  Rebuild cross section curves through points.
Refit | 2 |  Refit cross section curves to tolerance.
See Also
Reference
Rhino.Geometry Namespace