RhinoCommon API
MeshIncidence Enumeration
 The kind of mesh feature a MeshCurveIntersection lies on, determined by mesh topology after deduplication.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum MeshIncidence
Public Enumeration MeshIncidence
Members
Member name | Value | Description
Face | 0 | Strictly inside a face (also reported for hits on the internal diagonal of a quad's two-triangle split, which is not a real mesh edge).
Edge | 1 | On a mesh edge (shared by 2+ faces, or a 1-valence boundary edge).
Vertex | 2 | At a mesh topology vertex.
See Also
Reference
Rhino.Geometry.Intersect Namespace