RhinoCommon API
RailType Enumeration
 Rail types used for creating filleted Brep edges
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum RailType
Public Enumeration RailType
Members
Member name | Value | Description
DistanceFromEdge | 0 |  The distance from the edge curves determines the intersection.
RollingBall | 1 |  The radius of a rolling ball determines the intersection.
DistanceBetweenRails | 2 |  The distance between the edge rails determines the intersection.
See Also
Reference
Rhino.Geometry Namespace