RhinoCommon API
Color4fField Class
 Color4f field value class
Inheritance Hierarchy
System.Object
 Rhino.Render.Fields.Field
 Rhino.Render.Fields.Color4fField
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Color4fField : Field
Public Class Color4fField
	Inherits Field
The Color4fField type exposes the following members.
Properties
Name | Description
SystemColorValue
 Gets or sets the field value
Value
 Gets or sets the field value
Top
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
Rhino.Render.Fields Namespace