RhinoCommon API
CollapsibleSectionImpl Class
[Missing <summary> documentation for "T:Rhino.UI.Controls.CollapsibleSectionImpl"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.CollapsibleSectionImpl
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class CollapsibleSectionImpl : IDisposable
Public NotInheritable Class CollapsibleSectionImpl
	Implements IDisposable
The CollapsibleSectionImpl type exposes the following members.
Constructors
Name | Description
CollapsibleSectionImpl
Initializes a new instance of the CollapsibleSectionImpl class
Top
Properties
Name | Description
CppPointer
ViewModel
Top
Methods
Name | Description
__InternalSetParent
CreateHostedSection
Dispose
Releases all resources used by the CollapsibleSectionImpl
Finalize |  (Overrides Object.Finalize().)
Find
GetSibling
GetSiblings
IsSameObject
NewNativeWrapper
ReplaceClient
Top
Events
Name | Description
DataChanged
ViewModelActivated
Top
See Also
Reference
Rhino.UI.Controls Namespace