RhinoCommon API
File3dmCurvePiping.CapTypes Enumeration
 Defines how the pipe is capped at the ends.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum CapTypes
Public Enumeration CapTypes
Members
Member name | Value | Description
None | 0 |  No capping.
Flat | 1 |  A flat surface will cap the pipe.
Box | 2 |  A simple construction will cap the pipe.
Dome | 3 |  A meridians-and-parallels hemisphere construction will cap the pipe.
See Also
Reference
Rhino.FileIO Namespace