RhinoCommon API
RenderWindow.ImageAdjust Class
 Class to set image adjusting settings to a RenderWindow. This can't be directly created. Instead, one should use RenderWindow.GetAdjust() to get an ImageAdjust instance that can be modified, then passed into RenderWindow.SetAdjust() to update image adjusting settings.1
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderWindow.ImageAdjust
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ImageAdjust
Public Class ImageAdjust
The RenderWindow.ImageAdjust type exposes the following members.
Properties
Name | Description
Dither
 Set the Dithering method to use when adjusting the RenderWindow content.
Gamma
 Set the gamma value. The inverse of this will be used to apply gamma correction to the RenderWindow RGBA channel when necessary.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace