RhinoCommon API
IPanelsService Interface
 For internal use, the IPanels service is implemented in RhinoWindows or RhinoMac as appropriate and handles the communication with core Rhino
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IPanelsService
Public Interface IPanelsService
The IPanelsService type exposes the following members.
Methods
Name | Description
CreateDockBar
DestroyNativeWindow
DockBarIdInUse
DockBarIsVisible
FactoryResetSettings
Float
ResizeFloating
SetF1Hook
ShowDockBar
StartDraggingDockBar
SupportedType
ToggleDocking
UnhookDeleteAndDestroyDockBar
Top
See Also
Reference
Rhino.UI Namespace