RhinoCommon API
FileSkp Class
 Support for writing Skp file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileSkp
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileSkp
Public NotInheritable Class FileSkp
The FileSkp type exposes the following members.
Methods
Name | Description
Read
Read a Skp file into a RhinoDoc
Write
Write a Skp file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace