RhinoCommon API
Point3dList.YAccess Class
 Utility class for easy-access of x-components of points inside an ON_3dPointList.
Inheritance Hierarchy
System.Object
 Rhino.Collections.Point3dList.YAccess
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class YAccess
Public Class YAccess
The Point3dList.YAccess type exposes the following members.
Properties
Name | Description
Item
 Gets or sets the y-coordinate of the specified point.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Collections Namespace