RhinoCommon API
FileDwgWriteOptions.AutocadVersion Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileDwgWriteOptions.AutocadVersion"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum AutocadVersion
Public Enumeration AutocadVersion
Members
Member name | Value | Description
Release12 | 12 | Acad 12, vAC12
Release13 | 13 | Acad 13, vAC13
Release14 | 14 | Acad 14, vAC14
Acad2000 | 2000 | Acad 2000, vAC15
Acad2004 | 2004 | Acad 2004, vAC18
Acad2007 | 2007 | Acad 2007, vAC21
Acad2010 | 2010 | Acad 2010, vAC24
Acad2013 | 2013 | Acad 2013, vAC27
Acad2018 | 2018 | Acad 2018, vAC32
See Also
Reference
Rhino.FileIO Namespace