RhinoCommon API
SnapShotsClient Class
 This is the abstract interface class for all Snapshot clients.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.SnapShots.SnapShotsClient
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class SnapShotsClient : IDisposable
Public MustInherit Class SnapShotsClient
	Implements IDisposable
The SnapShotsClient type exposes the following members.
Constructors
Name | Description
SnapShotsClient
 SnapShotsClient constructor
Top
Properties
Name | Description
CppPointer
SerialNumber
Top
Methods
Name | Description
AnimateDocument
 Called for each frame. Starting at 0.0.
AnimateObject
 Called for each frame. Starting at 0.0.
AnimationStart
 Called once at the start of an animation.
AnimationStop
 Called once at the end of an animation.
ApplicationCategory
 Predefined application category
Category
 The category of this client. Usually one of the above predefined categories like e.g object, rendering or application category
ClientId
 The unique id of this client.
Dispose
 SnapShotsClient Dispose
DocumentCategory
 Predefined document category
ExtendBoundingBoxForDocumentAnimation
 Called once at the start of an animation. This can be used to extend the scene bounding box to avoid clipping.
ExtendBoundingBoxForObjectAnimation
 Called once at the start of an animation. This can be used to extend the scene bounding box to avoid clipping.
IsCurrentModelStateInAnySnapshot(RhinoDoc, BinaryArchiveReader, SimpleArrayBinaryArchiveReader, TextLog)
 Called before restoring a snapshot. Warns the user if the current model state is not already saved.
IsCurrentModelStateInAnySnapshot(RhinoDoc, RhinoObject, BinaryArchiveReader, SimpleArrayBinaryArchiveReader, TextLog)
 Called before restoring a snapshot. Warns the user if the current model state is not already saved.
LayersCategory
 Predefined layers category
LightsCategory
 Predefined lights category
Name
 The client's name.
ObjectsCategory
 Predefined objects category
ObjectTransformNotification
 Called for every object that is associated with a snapshot and gets transformed in Rhino. This is getting called for each stored snapshot and gives the client the possibility to update the stored data.
PlugInId
 The plug-in id that registers this client.
PrepareForDocumentAnimation
 Called once at the start of an animation.
PrepareForObjectAnimation
 Called once at the start of an animation.
RegisterSnapShotClient
 Function used to register snapshots client
RenderingCategory
 Predefined rendering category
RestoreDocument
 Called when the user restores a snapshot and SupportDocument() returns true.
RestoreObject
 Called when the user restores a snapshot and SupportsObjects() and SupportsObject(Rhino.DocObjects.RhinoObject doc_object) returns true.
SaveDocument
 Called when the user saves a snapshot and SupportDocument() returns true.
SaveObject
 Called when the user saves a snapshot and SupportsObjects() and SupportsObject(Rhino.DocObjects.RhinoObject doc_object) returns true.
SnapshotRestored
 Called after all clients restored their data.
SupportsAnimation
 Returns true if the client allows animation.
SupportsDocument
 Defines if the client supports document user data or not
SupportsObject
 Returns true if the client saves/restores object user data for the given object.
SupportsObjects
 Returns true if the client saves/restores object user data.
ViewsCategory
 Predefined views category
Top
See Also
Reference
Rhino.DocObjects.SnapShots Namespace