RhinoCommon API
FileCsv Class
 Support for writing Csv file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileCsv
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileCsv
Public NotInheritable Class FileCsv
The FileCsv type exposes the following members.
Methods
Name | Description
Write
Write a Csv file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace