RhinoCommon API
SubDComponentParameter Structure
 Identifies a point on the surface of a SubD.
 SubDs have no global (u,v) parameterization. Instead a point on the surface is identified relative to a component of the SubD: a vertex, a point on an edge, or a point inside a face. A point inside a face is given by the index of the face corner it belongs to plus two parameters inside that corner, because a face with five or more sides has no single well behaved (u,v) domain.
 Use ClosestPoint(Point3d, Point3d, SubDComponentParameter) to find a parameter and Evaluate(SubDComponentParameter, Point3d) and its overloads to evaluate one.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public struct SubDComponentParameter : IEquatable<SubDComponentParameter>
Public Structure SubDComponentParameter
	Implements IEquatable(Of SubDComponentParameter)
The SubDComponentParameter type exposes the following members.
Properties
Name | Description
ActiveFaceId
 Gets the id of the face this parameter uses to resolve which sector of a vertex or which side of an edge it means, or 0 if there is none. It is always 0 when IsFaceParameter is true; use ComponentId in that case.
ComponentId
 Gets the id of the SubD component this parameter is relative to, or 0 if this parameter is not set.
ComponentIndex
 Gets the component index of the SubD component this parameter is relative to. It is Unset if this parameter is not set.
EdgeParameter
 Gets a value between 0 and 1 identifying a point on the edge, or NaN if IsEdgeParameter is false.
FaceCornerIndex
 Gets the index of the face corner the face parameters are measured in, or -1 if IsFaceParameter is false.
FaceCornerParameters
 Gets the two parameters inside the face corner identified by FaceCornerIndex. Both run from 0 to 1/2: (0,0) is the corner vertex and (1/2,1/2) is the center of the face. X runs towards the midpoint of the edge leaving the corner and Y towards the midpoint of the edge entering it. The point is Unset if IsFaceParameter is false.
FaceEdgeCount
 Gets the number of edges of the face, or 0 if IsFaceParameter is false.
IsEdgeParameter
 Gets true if this parameter identifies a surface point on a SubD edge.
IsFaceParameter
 Gets true if this parameter identifies a surface point inside a SubD face.
IsSet
 Gets true if this parameter identifies a point on a SubD.
IsVertexParameter
 Gets true if this parameter identifies the surface point at a SubD vertex.
Unset
 The unset parameter. It does not identify a point on any SubD.
Top
Methods
Name | Description
CreateEdgeParameter
 Creates a parameter that identifies a surface point on a SubD edge.
CreateFaceParameter
 Creates a parameter that identifies a surface point inside a SubD face.
CreateVertexParameter
 Creates a parameter that identifies the surface point at a SubD vertex.
Equals(Object)
Indicates whether this instance and a specified object are equal.
 (Overrides ValueType.Equals(Object).)
Equals(SubDComponentParameter)
Indicates whether the current object is equal to another object of the same type.
GetHashCode
Returns the hash code for this instance.
 (Overrides ValueType.GetHashCode().)
ToString
Returns the fully qualified type name of this instance.
 (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Equality
 Determines whether two parameters are equal.
Inequality
 Determines whether two parameters are different.
Top
See Also
Reference
Rhino.Geometry Namespace