RhinoCommon API
FileObjWriteOptions.ObjGroupNames Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileObjWriteOptions.ObjGroupNames"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum ObjGroupNames
Public Enumeration ObjGroupNames
Members
Member name | Value | Description
NoGroups | 0 |  Neither layer or group names are exported as OBJ groups
LayerAsGroup | 1 |  Rhino layer names are exported as OBJ groups
GroupAsGroup | 2 |  Rhino group names are exported as OBJ groups
See Also
Reference
Rhino.FileIO Namespace