RhinoCommon API
DisplayPipelineAttributes.BoundingBoxDisplayMode Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.BoundingBoxDisplayMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public enum BoundingBoxDisplayMode
Public Enumeration BoundingBoxDisplayMode
Members
Member name | Value | Description
None | 0
OnDuringDynamicDisplay | 2
OnAlways | 1
See Also
Reference
Rhino.Display Namespace