RhinoCommon API
CursorMode Enumeration
 Defines enumerated constant values for particular OSnap cursor colors.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum CursorMode
Public Enumeration CursorMode
Members
Member name | Value | Description
None | 0 |  No OSnap cursor.
BlackOnWhite | 1 |  Black on white OSnap cursor.
WhiteOnBlack | 2 |  White on black OSnap cursor.
See Also
Reference
Rhino.ApplicationSettings Namespace