RhinoCommon API
TwoColorRenderTexture Class
[Missing <summary> documentation for "T:Rhino.Render.TwoColorRenderTexture"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderContent
 Rhino.Render.RenderTexture
 Rhino.Render.TwoColorRenderTexture
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class TwoColorRenderTexture : RenderTexture
Public MustInherit Class TwoColorRenderTexture
	Inherits RenderTexture
The TwoColorRenderTexture type exposes the following members.
Constructors
Name | Description
TwoColorRenderTexture
Initializes a new instance of the TwoColorRenderTexture class
Top
Properties
Name | Description
Color1
Color2
SuperSample
SwapColors
Texture1Amount
Texture1On
Texture2Amount
Texture2On
Top
Methods
Name | Description
AddAdditionalUISections
OnAddUserInterfaceSections |  (Overrides RenderContent.OnAddUserInterfaceSections().)
Top
See Also
Reference
Rhino.Render Namespace