RhinoCommon API
NamedColor Class
 An entry with name and color for the NamedColorList
Inheritance Hierarchy
System.Object
 Rhino.UI.NamedColor
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class NamedColor
Public Class NamedColor
The NamedColor type exposes the following members.
Constructors
Name | Description
NamedColor
 Initializes a new instance of the ColorListEntry with the specified name and color.
Top
Properties
Name | Description
Color
 Gets the color for this entry.
Name
 Gets the name of this color to show to the user.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace