RhinoCommon API
CullFaceMode Enumeration
[Missing <summary> documentation for "T:Rhino.Display.CullFaceMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum CullFaceMode
Public Enumeration CullFaceMode
Members
Member name | Value | Description
DrawFrontAndBack | 0
DrawFrontFaces | 1
DrawBackFaces | 2
See Also
Reference
Rhino.Display Namespace