RhinoCommon API
DracoCompressionOptions Class
 Options for applying Draco compression
Inheritance Hierarchy
System.Object
 Rhino.FileIO.DracoCompressionOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DracoCompressionOptions
Public Class DracoCompressionOptions
The DracoCompressionOptions type exposes the following members.
Constructors
Name | Description
DracoCompressionOptions
 Initializes to default options
Top
Properties
Name | Description
CompressionLevel
 Compression level. 0 if fastest, but least compression. 10 is slowest, but best compression
NormalQuantizationBits
 Sets the quantization compression options for normal values. The values will be quantized in a box defined by the maximum extent of the values. I.e., the actual precision of this option depends on the scale of the attribute values.
PositionQuantizationBits
 Sets the quantization compression options for position values. The values will be quantized in a box defined by the maximum extent of the values. I.e., the actual precision of this option depends on the scale of the attribute values.
TextureCoordintateQuantizationBits
 Sets the quantization compression options for texture coordinate values. The values will be quantized in a box defined by the maximum extent of the values. I.e., the actual precision of this option depends on the scale of the attribute values.
Top
Methods
Name | Description
Top
Fields
Name | Description
IncludeNormals
 Include vertex normals in the compressed data.
IncludeTextureCoordinates
 Include texture coordinates in the compressed data.
IncludeVertexColors
 Include vertex colors in the compressed data.
VertexColorFormat
 Color format of vertex colors in compressed data
Top
See Also
Reference
Rhino.FileIO Namespace