RhinoCommon API
ArchivableDictionary Class
Represents a dictionary class that can be attached to objects and can be serialized (saved) at necessity.
See remarks for layout.
Inheritance Hierarchy
System.Object
 Rhino.Collections.ArchivableDictionary
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class ArchivableDictionary : ICloneable,
	IDictionary<string, Object>, ICollection<KeyValuePair<string, Object>>,
	IEnumerable<KeyValuePair<string, Object>>, IEnumerable,
	ISerializable
<SerializableAttribute>
Public Class ArchivableDictionary
	Implements ICloneable, IDictionary(Of String, Object),
	ICollection(Of KeyValuePair(Of String, Object)), IEnumerable(Of KeyValuePair(Of String, Object)),
	IEnumerable, ISerializable
The ArchivableDictionary type exposes the following members.
Constructors
Name | Description
ArchivableDictionary()
Initializes an instance of a dictionary for writing to a 3dm archive.
ArchivableDictionary(Int32)
Initializes an instance of a dictionary for writing to a 3dm archive.
ArchivableDictionary(UserData)
Initializes an instance of a dictionary for writing to a 3dm archive
ArchivableDictionary(Int32, String)
Initializes an instance of a dictionary for writing to a 3dm archive.
ArchivableDictionary(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
ChangeSerialNumber
 Retrieve current change serial number. This is a number that gets increased each time a datum is set or changed.
Count
 Gets the number of key/value pairs contained in the dictionary.
Item
 Gets the value associated with the specified key.
Keys
Gets all entry names or keys.
Name
 Gets or sets the name string of this ArchivableDictionary.
ParentUserData
 If this dictionary is part of user-data (or is a UserDictionary), then this is the parent user data. null if this dictionary is not part of user-data
Values
Gets all values in this dictionary.
Version
 Gets or sets the version of this ArchivableDictionary.
Top
Methods
Name | Description
AddContentsFrom
 Add the contents from the source dictionary.
Clear
 Removes all keys and values from the dictionary.
Clone
 Constructs a deep copy of this object.
ContainsKey
 Determines whether the dictionary contains the specified key.
GetBool(String)
 Get value as Boolean, will only succeed if value was created using Set(string key, Boolean value)
GetBool(String, Boolean)
 Get value as Boolean, will return defaultValue unless value was created using Set(string key, Boolean value)
GetBytes(String)
 Get value as byte[], will only succeed if value was created using Set(string key, byte[] value)
GetBytes(String, Byte[])
 Get value as byte[], will return defaultValue unless value was created using Set(string key, byte[] value)
GetDictionary(String)
 Get value as ArchivableDictionary, will only succeed if value was created using Set(string key, ArchivableDictionary value)
GetDictionary(String, ArchivableDictionary)
 Get value as ArchivableDictionary, will return defaultValue unless value was created using Set(string key, ArchivableDictionary value)
GetDouble(String)
 Get value as double, will only succeed if value was created using Set(string key, double value)
GetDouble(String, Double)
 Get value as double, will only succeed if value was created using Set(string key, double value)
GetEnumerator
 Gets the enumerator of this dictionary.
GetEnumValue<T>()
 Get an enum value
GetEnumValue<T>(String)
 Get an enum value from the dictionary using a custom key.
GetFloat(String)
 Get value as float, will only succeed if value was created using Set(string key, float value)
GetFloat(String, Single)
 Get value as float, will return defaultValue unless value was created using Set(string key, float value)
GetGuid(String)
 Get value as Guid, will only succeed if value was created using Set(string key, Guid value)
GetGuid(String, Guid)
 Get value as Guid, will return defaultValue unless value was created using Set(string key, Guid value)
Getint
 Get value as int, will return defaultValue unless value was created using Set(string key, int value)
GetInteger(String)
 Get value as int, will only succeed if value was created using Set(string key, int value)
GetInteger(String, Int32)
 Get value as int, will return defaultValue unless value was created using Set(string key, int value)
GetObjectData
 Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
GetPlane(String)
 Get value as Plane, will return defaultValue unless value was created using Set(string key, Plane value)
GetPlane(String, Plane)
 Get value as Plane, will return defaultValue unless value was created using Set(string key, Plane value)
GetPoint3d(String)
 Get value as Point3d, will only succeed if value was created using Set(string key, Point3d value)
GetPoint3d(String, Point3d)
 Get value as Point3d, will return defaultValue unless value was created using Set(string key, Point3d value)
GetPoint3f(String)
 Get value as Point3f, will only succeed if value was created using Set(string key, Point3f value)
GetPoint3f(String, Point3f)
 Get value as Point3f, will return defaultValue unless value was created using Set(string key, Point3f value)
GetString(String)
 Get value as string, will only succeed if value was created using Set(string key, string value)
GetString(String, String)
 Get value as string, will return defaultValue unless value was created using Set(string key, string value)
GetVector3d(String)
 Get value as Vector3d, will only succeed if value was created using Set(string key, Vector3d value)
GetVector3d(String, Vector3d)
 Get value as Vector3d, will return defaultValue unless value was created using Set(string key, Vector3d value)
Remove
 Removes the value with the specified key from the dictionary.
RemoveEnumValue<T>
 Remove an enum value from the dictionary.
ReplaceContentsWith
 Replace the contents of the dictionary with that of the given source dictionary.
Set(String, ArchivableDictionary)
 Sets another ArchivableDictionary as entry in this dictionary.
Set(String, ObjRef)
 Sets a ObjRef
Set(String, BoundingBox)
 Sets a BoundingBox.
Set(String, GeometryBase)
 Sets any class deriving from the GeometryBase base class.
Set(String, Interval)
 Sets an Interval.
Set(String, Line)
 Sets a Line.
Set(String, MeshingParameters)
 Sets a MeshingParameters.
Set(String, Plane)
 Sets a Plane.
Set(String, Point2d)
 Sets a Point2d.
Set(String, Point3d)
 Sets a Point3d.
Set(String, Point3f)
 Sets a Point3f.
Set(String, Point4d)
 Sets a Point4d.
Set(String, Ray3d)
 Sets a Ray3d.
Set(String, Transform)
 Sets a Transform.
Set(String, Vector2d)
 Sets a Vector2d.
Set(String, Vector3d)
 Sets a Vector3d.
Set(String, Vector3f)
 Sets a Vector3f.
Set(String, Boolean)
 Sets a Boolean.
Set(String, Byte)
 Sets a Byte.
Set(String, IEnumerable<ObjRef>)
 Sets an array of ObjRef
Set(String, IEnumerable<GeometryBase>)
 Sets an array of GeometryBase
Set(String, IEnumerable<Boolean>)
 Sets a list, an array or any enumerable of Boolean.
Set(String, IEnumerable<Byte>)
 Sets a list, an array or any enumerable of Byte.
Set(String, IEnumerable<Double>)
 Sets a list, an array or any enumerable of Double.
Set(String, IEnumerable<Guid>)
 Sets a list, an array or any enumerable of Guid.
Set(String, IEnumerable<Int16>)
 Sets a list, an array or any enumerable of Int16.
Set(String, IEnumerable<Int32>)
 Sets a list, an array or any enumerable of Int32.
Set(String, IEnumerable<SByte>)
 Sets a list, an array or any enumerable of SByte.
Set(String, IEnumerable<Single>)
 Sets a list, an array or any enumerable of Single.
Set(String, IEnumerable<String>)
 Sets a list, an array or any enumerable of String.
Set(String, Double)
 Sets a Double.
Set(String, Color)
 Sets a Color.
Set(String, Font)
 Sets a Font.
Set(String, Point)
 Sets a Point.
Set(String, PointF)
 Sets a PointF.
Set(String, Rectangle)
 Sets a Rectangle.
Set(String, RectangleF)
 Sets a RectangleF.
Set(String, Size)
 Sets a Size.
Set(String, SizeF)
 Sets a SizeF.
Set(String, Guid)
 Sets a Guid.
Set(String, Int16)
 Sets a Int16.
Set(String, Int32)
 Sets a Int32.
Set(String, Int64)
 Sets a Int64.
Set(String, SByte)
 Sets a SByte.
Set(String, Single)
 Sets a Single.
Set(String, String)
 Sets a String.
Set(String, UInt16)
 Sets a UInt16.
Set(String, UInt32)
 Sets a UInt32.
SetEnumValue<T>(T)
 Set an enum value
SetEnumValue<T>(String, T)
 Set an enum value in the dictionary with a custom key.
TryGetBool
 Get value as Boolean, will only succeed if value was created using Set(string key, Boolean value)
TryGetBytes
 Get value as byte[], will only succeed if value was created using Set(string key, byte[] value)
TryGetDictionary
 Get value as ArchivableDictionary, will only succeed if value was created using Set(string key, ArchivableDictionary value)
TryGetDouble
 Get value as double, will only succeed if value was created using Set(string key, double value)
TryGetEnumValue<T>
 Attempt to get an enum value from the dictionary using a custom key.
TryGetFloat
 Get value as float, will only succeed if value was created using Set(string key, float value)
TryGetGuid
 Get value as Guid, will only succeed if value was created using Set(string key, Guid value)
TryGetInteger
 Get value as int, will only succeed if value was created using Set(string key, int value)
TryGetPlane
 Get value as Plane, will only succeed if value was created using Set(string key, Plane value)
TryGetPoint3d
 Get value as Point3d, will only succeed if value was created using Set(string key, Point3d value)
TryGetPoint3f
 Get value as Point3f, will only succeed if value was created using Set(string key, Point3f value)
TryGetString
 Get value as string, will only succeed if value was created using Set(string key, string value)
TryGetValue
 Gets the value associated with the specified key.
TryGetVector3d
 Get value as Vector3d, will only succeed if value was created using Set(string key, Vector3d value)
Top
Remarks
This is the layout of this object:
.
BEGINCHUNK (TCODE_ANONYMOUS_CHUNK)
- version (int)
- entry count (int)
 for entry count entries
- BEGINCHUNK (TCODE_ANONYMOUS_CHUNK)
- key (string)
- entry contents
- ENDCHUNK (TCODE_ANONYMOUS_CHUNK)
ENDCHUNK (TCODE_ANONYMOUS_CHUNK)
See Also
Reference
Rhino.Collections Namespace