RhinoCommon API
LengthValue Class
 Represents a length with an associated unit system and a string representation of that length. This allows for going back and forth from numerical representation of a length and a string representation without "guessing" at the initial string
Inheritance Hierarchy
System.Object
 Rhino.LengthValue
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class LengthValue : IDisposable
Public NotInheritable Class LengthValue
	Implements IDisposable
The LengthValue type exposes the following members.
Properties
Name | Description
ContextAngleUnitSystem
 Returns the context AngleUnitSystem from this LengthValue's ParseSettings
ContextLocaleId
 returns the context LocaleId from this LengthValue
LengthString
 Return length as a string
LengthStringFormat
 Returns the StringFormat from this LengthValue
ParseSettings
 Parse settings
Units
 LengthUnit used by this LengthValue
UnitSystem
 UnitSystem used by this LengthValue
Top
Methods
Name | Description
ChangeLength
 Changes the numeric value in a LengthValue and leaves all of the other info unchanged UnitSystem, ParseSettings and StringFormat stay as they were
ChangeUnits
 Change the UnitSystem of a LengthValue The numeric value of Length is scaled by new_us / current unit system so that the absolute length stays the same
ChangeUnitSystem
 Change the UnitSystem of a LengthValue The numeric value of Length is scaled by new_us / current unit system so that the absolute length stays the same
Create(Double, LengthUnit, LengthValue.StringFormat)
Create from Length and LengthUnit
Create(Double, UnitSystem, LengthValue.StringFormat)
Create from Length and UnitSystem
Create(String, StringParserSettings, Boolean)
 Create from string
Create(Double, LengthUnit, LengthValue.StringFormat, UInt32)
Create from Length and LengthUnit
Create(Double, UnitSystem, LengthValue.StringFormat, UInt32)
Create from Length and UnitSystem
Dispose
actively reclaim native allocated ON_LengthValue*
Finalize
passively reclaim native allocated ON_LengthValue*
 (Overrides Object.Finalize().)
IsUnset
 Test IsUnset
Length()
 Length value in this instance's current unit system
Length(LengthUnit)
 Length value in a given unit system
Length(UnitSystem)
 Length value in a given unit system
Top
See Also
Reference
Rhino Namespace