RhinoCommon API
OptionsDialogPage.PageType Enumeration
 17 March 2021 John Morse For internal use in determining the page type. RhinoMac uses this to ensure pages are sized properly when hosting them.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum PageType
Public Enumeration PageType
Members
Member name | Value | Description
Options | 0
DocumentProperties | 1
See Also
Reference
Rhino.UI Namespace