RhinoCommon API
File3dmWriteOptions Class
Options used by File3dm.Write
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmWriteOptions
Public Class File3dmWriteOptions
The File3dmWriteOptions type exposes the following members.
Constructors
Name | Description
File3dmWriteOptions
 Initializes properties to defaults.
Top
Properties
Name | Description
SaveAnalysisMeshes |  Obsolete.
 Include analysis meshes in the file. Default is true
SaveRenderMeshes |  Obsolete.
 Include Render meshes in the file. Default is true
SaveUserData
 Include custom user data in the file. Default is true
Version
File version. Default is major version number of this assembly version.
Must be in range [2; current version].
Alternatively, 0 is a placeholder for the last valid version.
Rhino can read its current version, plus earlier file versions except 1.
Use latest version when possible.
Top
Methods
Name | Description
EnableAnalysisMeshes
 Activates saving of analysis meshes for specific types of objects. If you do not specify the state for an object type, its default is used. Currently SubD mesh saving is disabled by default, while Brep and Extrusion is enabled.
EnableRenderMeshes
 Activates saving of render meshes for specific types of objects. If you do not specify the state for an object type, its default is used. Specifically, currently SubD mesh saving is disabled by default, while Brep and Extrusion is on.
Top
See Also
Reference
Rhino.FileIO Namespace