RhinoCommon API
ObjectPropertiesPageEventArgs Class
[Missing <summary> documentation for "T:Rhino.UI.ObjectPropertiesPageEventArgs"]
Inheritance Hierarchy
System.Object
 Rhino.UI.ObjectPropertiesPageEventArgs
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ObjectPropertiesPageEventArgs
Public Class ObjectPropertiesPageEventArgs
The ObjectPropertiesPageEventArgs type exposes the following members.
Constructors
Name | Description
ObjectPropertiesPageEventArgs
 Used by ObjectPropertiesPage to notify the page when updating, modifying or determining if the page should be included in the navigation bar
Top
Properties
Name | Description
DocRuntimeSerialNumber
 Document containing the objects and views
Document
 Document containing the objects and views
EventRuntimeSerialNumber
 Gets the runtime serial number.
ObjectCount
Objects
 Return a list of Rhino objects to be processed by this object properties page
ObjectTypes
Page
 The page sending these arguments
View
 Active view
Viewport
 Active viewport
Top
Methods
Name | Description
GetObjects(ObjectType)
 Get selected objects that match a given filter
GetObjects<T>()
 Get selected objects of a given type
IncludesObjectsType(ObjectType)
IncludesObjectsType(ObjectType, Boolean)
IncludesObjectsType<T>()
 Return true if any of the selected objects match the given type
IncludesObjectsType<T>(Boolean)
 Return true if any of the selected objects match the given type
Top
See Also
Reference
Rhino.UI Namespace