RhinoCommon API
IEpsilonComparable<T> Interface
[Missing <summary> documentation for "T:Rhino.IEpsilonComparable`1"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IEpsilonComparable<in T>
Public Interface IEpsilonComparable(Of In T)
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "T:Rhino.IEpsilonComparable`1"]
The IEpsilonComparable<T> type exposes the following members.
Methods
Name | Description
EpsilonEquals
Top
See Also
Reference
Rhino Namespace