RhinoCommon API
ScaleValue.ScaleStringFormat Enumeration
 Specifies preferred formats for automatically created string descriptions of a scale value.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ScaleStringFormat
Public Enumeration ScaleStringFormat
Members
Member name | Value | Description
None | 0 |  No preference for automatically created string descriptions of a scale value.
RatioFormat | 1 |  Prefer the ratio format using a colon, like "1:4" or "4:1".
EquationFormat | 2 |  Prefer the equation format using an equal sign, like "1 = 4" or "4 = 1".
FractionFormat | 3 |  Prefer the fraction format using a slash, like "1/4" or "4/1".
Unset | 255 |  ON_ScaleValue::ScaleStringFormat::Unset is used to indicate no preference is set. This condition is different from ON_ScaleValue::ScaleStringFormat::None.
See Also
Reference
Rhino Namespace