RhinoCommon API
PlaneSphereIntersection Enumeration
 Represents all possible cases of a Plane|Sphere intersection event.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum PlaneSphereIntersection
Public Enumeration PlaneSphereIntersection
Members
Member name | Value | Description
None | 0 |  No intersections.
Point | 1 |  Tangent intersection.
Circle | 2 |  Circular intersection.
See Also
Reference
Rhino.Geometry.Intersect Namespace