RhinoCommon API
RhinoDoc.TextureMappingEventArgs Class
 Event arguments passed to the RhinoDoc.TextureMappingEvent.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.RhinoDoc.TextureMappingEventArgs
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class TextureMappingEventArgs : EventArgs
Public Class TextureMappingEventArgs
	Inherits EventArgs
The RhinoDoc.TextureMappingEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
NewMapping
OldMapping
Top
Methods
Name | Description
Top
See Also
Reference
Rhino Namespace