RhinoCommon API
DisplayPipelineAttributes.ContextsForDraw Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.ContextsForDraw"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.5
Syntax
public enum ContextsForDraw
Public Enumeration ContextsForDraw
Members
Member name | Value | Description
Unset | 0
FilePreview | 1
ViewCapture | 2
Printing | 3
UIPreview | 4
Mask | 5
RenderOverlays | 6
See Also
Reference
Rhino.Display Namespace