RhinoCommon API
QuadRemeshSymmetryAxis Enumeration
 Symmetrical meshing axis
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[FlagsAttribute]
public enum QuadRemeshSymmetryAxis
<FlagsAttribute>
Public Enumeration QuadRemeshSymmetryAxis
Members
Member name | Value | Description
None | 0 |  No symmetric re-meshing
X | 1 |  Symmetry across X axis
Y | 2 |  Symmetry across Y axis
Z | 4 |  Symmetry across Z axis
See Also
Reference
Rhino.Geometry Namespace