RhinoCommon API
MetaDataProxy Class
 ProxyClass for MetaData
Inheritance Hierarchy
System.Object
 Rhino.Render.MetaDataProxy
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MetaDataProxy : IDisposable
Public Class MetaDataProxy
	Implements IDisposable
The MetaDataProxy type exposes the following members.
Constructors
Name | Description
MetaDataProxy
 Constructor for MetaDataProxy
Top
Properties
Name | Description
CppPointer
 MetaDataProxy c++ pointer
Top
Methods
Name | Description
Dispose
 Dispose for MetaDataProxy
Finalize
 Destructor for MetaDataProxy
 (Overrides Object.Finalize().)
SetContentInstanceId
 Set Content instance id for meta data
Top
See Also
Reference
Rhino.Render Namespace