RhinoCommon API
IAssemblyRestrictedObject Interface
 A class that implements this interface signals its clients that its instances can only be modified by certain assemblies. This is useful in cases where only certain assemblies should be able to modify an object. The actual members of an instance that are restricted are left to the discretion of the instance's class, and should be documented.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IAssemblyRestrictedObject
Public Interface IAssemblyRestrictedObject
The IAssemblyRestrictedObject type exposes the following members.
Methods
Name | Description
Editable
 Determines whether an assembly can modify the instance.
Top
See Also
Reference
Rhino.Runtime.Notifications Namespace