RhinoCommon API
RhinoApp.CommandLineTextWriter Class
 Provides a text writer that writes to the command line.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.IO.TextWriter
 Rhino.RhinoApp.CommandLineTextWriter
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class CommandLineTextWriter : TextWriter
Public Class CommandLineTextWriter
	Inherits TextWriter
The RhinoApp.CommandLineTextWriter type exposes the following members.
Constructors
Name | Description
RhinoApp.CommandLineTextWriter
Initializes a new instance of the RhinoApp.CommandLineTextWriter class
Top
Properties
Name | Description
Encoding
 Returns Encoding Unicode.
 (Overrides TextWriter.Encoding.)
Top
Methods
Name | Description
Write(Char)
 Writes a char to the command line.
 (Overrides TextWriter.Write(Char).)
Write(String)
 Writes a string to the command line.
 (Overrides TextWriter.Write(String).)
Write(Char[], Int32, Int32)
 Writes a char buffer to the command line.
 (Overrides TextWriter.Write(Char[], Int32, Int32).)
Top
Fields
Name | Description
Top
See Also
Reference
Rhino Namespace