RhinoCommon API
PostProcessFrameBufferEventArgs Class
 Gives a PostProcessFrameBuffer handler access to the frame that was just drawn.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.DrawEventArgs
 Rhino.Display.PostProcessFrameBufferEventArgs
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PostProcessFrameBufferEventArgs : DrawEventArgs
Public Class PostProcessFrameBufferEventArgs
	Inherits DrawEventArgs
The PostProcessFrameBufferEventArgs type exposes the following members.
Properties
Name | Description
FrameBufferSize
 Width and height in pixels of the frame this handler can read. A layout runs this channel once per detail, so this is not always the size of the view.
Top
Methods
Name | Description
TryCopyFrameBuffer(Byte[], Int32)
 Copies the frame into a caller owned array as 32 bit BGRA, with every pixel made opaque. Reuse one array across frames; allocating per frame defeats the point of this event.
TryCopyFrameBuffer(Byte[], Int32, Boolean)
 Copies the frame into a caller owned array as 32 bit BGRA. Reuse one array across frames; allocating per frame defeats the point of this event.
TryCopyFrameBuffer(IntPtr, Int32, Int32)
 Copies the frame into caller owned memory as 32 bit BGRA, with every pixel made opaque.
TryCopyFrameBuffer(IntPtr, Int32, Int32, Boolean)
 Copies the frame into caller owned memory as 32 bit BGRA.
Top
See Also
Reference
Rhino.Display Namespace