RhinoCommon API
Text3d Class
 3D aligned text with font settings.
Inheritance Hierarchy
System.Object
 Rhino.Display.Text3d
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Text3d : IDisposable
Public Class Text3d
	Implements IDisposable
The Text3d type exposes the following members.
Constructors
Name | Description
Text3d(String)
 Constructs a new instance of Text3d.
Text3d(String, Plane, Double)
 Constructs a new instance of Text3d.
Top
Properties
Name | Description
Bold
 Gets or sets whether this Text3d object will be drawn in Bold.
BoundingBox
 Gets the bounding box for this Text3d object.
FontFace
 Gets or sets the FontFace name.
Height
 Gets or sets the height (in units) of this Text3d object. The height should be a positive number larger than zero.
HorizontalAlignment
 Horizontal alignment that this Text3d is drawn with
Italic
 Gets or sets whether this Text3d object will be drawn in Italics.
Text
 Gets or sets the text string for this Text3d object.
TextPlane
 Gets or sets the 3D aligned plane for this Text3d object.
VerticalAlignment
 Vertical alignment that this Text3d is drawn with
Top
Methods
Name | Description
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Top
See Also
Reference
Rhino.Display Namespace