RhinoCommon API
ChangeQueue.BakingFunctions Enumeration
 Enumeration of functions for baking to conduct.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[FlagsAttribute]
public enum BakingFunctions
<FlagsAttribute>
Public Enumeration BakingFunctions
Members
Member name | Value | Description
None | 0 |  No baking
Decals | 1 |  Bake decals
ProceduralTextures | 2 |  Bake procedural textures
CustomObjectMappings | 4 |  Bake custom object mappings
WcsBasedMappings | 8 |  Bake WCS-based mappings
MultipleMappingChannels | 16 |  Bake multiple mapping channels
NoRepeatTextures | 32 |  Bake no-repeat textures
All | 4294967295 |  Bake everything
See Also
Reference
Rhino.Render.ChangeQueue Namespace