RhinoCommon API
Silhouette Class
 Information about silhouette curves that are generated from geometry (surfaces, brep faces, meshes)
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Silhouette
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Silhouette
Public Class Silhouette
The Silhouette type exposes the following members.
Properties
Name | Description
Curve
 3D curve representing the shape of the silhouette.
GeometryComponentIndex
 Gets the component index corresponding with this silhouette curve. This field is only set when the entire silhouette curve is part of some geometry component.
SilhouetteType
 Gets the type of this silhouette curve.
Top
Methods
Name | Description
Compute(GeometryBase, SilhouetteType, ViewportInfo, Double, Double)
 Compute silhouettes of a shape for a specified projection.
Compute(GeometryBase, SilhouetteType, Point3d, Double, Double)
 Compute silhouettes of a shape for a perspective projection.
Compute(GeometryBase, SilhouetteType, Vector3d, Double, Double)
 Compute silhouettes of a shape for a parallel projection.
Compute(GeometryBase, SilhouetteType, ViewportInfo, Double, Double, IEnumerable<Plane>, CancellationToken)
 Compute silhouettes of a shape for a specified projection.
Compute(GeometryBase, SilhouetteType, Point3d, Double, Double, IEnumerable<Plane>, CancellationToken)
 Compute silhouettes of a shape for a perspective projection.
Compute(GeometryBase, SilhouetteType, Vector3d, Double, Double, IEnumerable<Plane>, CancellationToken)
 Compute silhouettes of a shape for a parallel projection.
ComputeDraftCurve(GeometryBase, Double, Vector3d, Double, Double)
 Computes draft curve silhouettes of a shape.
ComputeDraftCurve(GeometryBase, Double, Vector3d, Double, Double, CancellationToken)
 Computes draft curve silhouettes of a shape.
Top
See Also
Reference
Rhino.Geometry Namespace