RhinoCommon API
FileIgs Class
 Support for writing Igs file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileIgs
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileIgs
Public NotInheritable Class FileIgs
The FileIgs type exposes the following members.
Methods
Name | Description
Write
Write a Igs file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace