RhinoCommon API
SectionLabelStyle Enumeration
 The source of sectioning attributes on an object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum SectionLabelStyle
Public Enumeration SectionLabelStyle
Members
Member name | Value | Description
None | 0 | No label
TextDotFromName | 1 | Label shown as a text dot with content from name
TextFromName | 2 | Label shown as text with content from name
See Also
Reference
Rhino.DocObjects Namespace