RhinoCommon API
UserInterfaceRadioButton Class
 Draws a radio button with optional text beside it. Radio buttons that belong to the same group take turns: turning one on turns off whichever one was on before it, so exactly one button in a set is on at a time. Clicking a button that is already on does nothing.
A group is the radio buttons that share a Group number, sit in the same container and belong to the same document. The default group number is 0, so a set of radio buttons added to one grid is already a group. Give each set its own number when a container holds more than one set.
Inheritance Hierarchy
System.Object
 Rhino.UI.UserInterfaceObjectBase
 Rhino.UI.UserInterfaceControl
 Rhino.UI.UserInterfaceRadioButton
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class UserInterfaceRadioButton : UserInterfaceControl
Public Class UserInterfaceRadioButton
	Inherits UserInterfaceControl
The UserInterfaceRadioButton type exposes the following members.
Constructors
Name | Description
UserInterfaceRadioButton()
Initializes a new instance of the UserInterfaceRadioButton class
UserInterfaceRadioButton(String)
Initializes a new instance of the UserInterfaceRadioButton class
UserInterfaceRadioButton(String, Int32)
Initializes a new instance of the UserInterfaceRadioButton class
Top
Properties
Name | Description
Checked
 Is this the button that is on in its group? Turning a button on turns off every other button in its group. Setting this does not raise CheckedChanged; that is only for a state the user changed.
CheckedButtonInGroup
 The button in this button's group that is on, which can be this button, or null when nothing in the group has been turned on yet. The buttons have to have been added to a document for this to find anything, since it is the native side that keeps track of a group.
Group
 Which set of radio buttons this one belongs to. The default is 0. Two sets of radio buttons in the same container need different group numbers or they will turn each other off.
Top
Methods
Name | Description
OnCheckedChanged
 Called after a click or a key has changed the state of this button. Both ends of the change are told, the button that came on and the button that went off, so a set can be watched from any one of its buttons. The default implementation raises the CheckedChanged event.
Top
Events
Name | Description
CheckedChanged
 Event triggered when a click or a key changes the state of this radio button
Top
See Also
Reference
Rhino.UI Namespace