RhinoCommon API
LinearWorkflow Class
 This is the interface to linear workflow settings.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.LinearWorkflow
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class LinearWorkflow : DocumentOrFreeFloatingBase,
	IDisposable
Public NotInheritable Class LinearWorkflow
	Inherits DocumentOrFreeFloatingBase
	Implements IDisposable
The LinearWorkflow type exposes the following members.
Constructors
Name | Description
LinearWorkflow()
 Create a utility object not associated with any document.
LinearWorkflow(LinearWorkflow)
 Create a utility object not associated with any document from another object.
Top
Properties
Name | Description
Hash
 Linear workflow hash.
PostProcessFrameBuffer
 Linear workflow post-process frame buffer enabled state.
PostProcessGamma
 Linear workflow post-process gamma value.
PostProcessGammaOn
 Linear workflow post-process gamma enabled state.
PostProcessGammaReciprocal
 Reciprocal of linear workflow post-process gamma value.
PreProcessColors
 Linear workflow pre-process colors enabled state.
PreProcessGamma
 Linear workflow pre-process gamma value. This is currently the same as the post-process gamma value.
PreProcessTextures
 Linear workflow pre-process textures enabled state.
Top
Methods
Name | Description
CopyFrom
 Copy from another linear workflow object.
 (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Dispose
Releases all resources used by the LinearWorkflow
Equals
 Compare two LinearWorkflow objects. They are considered equal if their hashes match.
 (Overrides Object.Equals(Object).)
Finalize
 (Overrides FreeFloatingBase.Finalize().)
GetHashCode
 Get hash code for this object. It is the Hash property cast to int.
 (Overrides Object.GetHashCode().)
Top
See Also
Reference
Rhino.Render Namespace