RhinoCommon API
ProxyTypes Enumeration
 Defines the proxy type of the render content
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum ProxyTypes
Public Enumeration ProxyTypes
Members
Member name | Value | Description
None | 0 |  No proxy type specified.
Single | 1 |  A proxy that represents a single material in the CRhinoDoc::m_material_table
Multi | 2 |  A proxy that represents multiple materials - all similar.
Texture | 3 |  A proxy that represents textures, either in the texture table, or attached to materials or environments.
See Also
Reference
Rhino.Render Namespace