RhinoCommon API
NotificationCenter Class
 The NotificationCenter holds all Notification objects that are displayed in the Notifications panel by Rhino. The NotificationCenter is not thread-safe and should only be used in the UI thread.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.Notifications.NotificationCenter
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class NotificationCenter
Public NotInheritable Class NotificationCenter
The NotificationCenter type exposes the following members.
Fields
Name | Description
Notifications
 A set containing all the Notification instances. Any Notification added will be displayed in the Notifications panel. Any Notification removed will be removed from the Notifications panel, and, if shown modally or queued to be shown modally, will be closed or dequeued from the modal queue.
Top
See Also
Reference
Rhino.Runtime.Notifications Namespace