RhinoCommon API
ShutLiningCurveInfo Class
 Contains shutlining curve information. This is used in WithShutLining(Boolean, Double, IEnumerable<ShutLiningCurveInfo>).
Inheritance Hierarchy
System.Object
 Rhino.Geometry.ShutLiningCurveInfo
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ShutLiningCurveInfo
Public Class ShutLiningCurveInfo
The ShutLiningCurveInfo type exposes the following members.
Constructors
Name | Description
ShutLiningCurveInfo
 Creates a new instance of the ShutLining curve information class.
Top
Properties
Name | Description
Curve
 The profile curve.
CurveIntervals
 The parts of the curve to use as profiles.
Enabled
 If true, this curve is active.
IsBump
 True if profile constitutes a bump. See Rhino's Help for more information.
Profile
 >The profile type.
Pull
 True if the curve should be pulled.
Radius
 The profile radius.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace