RhinoCommon API
LicenseLeaseChangedEventArgs Class
 Arguments for OnLeaseChangedDelegate
Inheritance Hierarchy
System.Object
 Rhino.PlugIns.LicenseLeaseChangedEventArgs
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class LicenseLeaseChangedEventArgs
Public Class LicenseLeaseChangedEventArgs
The LicenseLeaseChangedEventArgs type exposes the following members.
Constructors
Name | Description
LicenseLeaseChangedEventArgs
Initializes a new instance of the LicenseLeaseChangedEventArgs class
Top
Properties
Name | Description
Lease
 The lease returned by Rhino Accounts server
Top
Methods
Name | Description
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.PlugIns Namespace