RhinoCommon API
PackageManagerSettings Class
 Settings specific to Rhino's package manager
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.PackageManagerSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class PackageManagerSettings
Public NotInheritable Class PackageManagerSettings
The PackageManagerSettings type exposes the following members.
Properties
Name | Description
Sources
 semicolon separated list of paths/urls that the package manager uses for sources
Top
See Also
Reference
Rhino.ApplicationSettings Namespace