RhinoCommon API
DescriptionType Enumeration
 Rhino plug-in developer information fields.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum DescriptionType
Public Enumeration DescriptionType
Members
Member name | Value | Description
Organization | 0
Address | 1
Country | 2
Phone | 3
WebSite | 4
Email | 5
UpdateUrl | 6
Fax | 7
Icon | 8
See Also
Reference
Rhino.PlugIns Namespace