RhinoCommon API
SubDEdge Class
 Single edge of a SubD
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDComponent
 Rhino.Geometry.SubDEdge
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class SubDEdge : SubDComponent
Public NotInheritable Class SubDEdge
	Inherits SubDComponent
The SubDEdge type exposes the following members.
Properties
Name | Description
ControlNetLine
 Line representing the control net end points.
FaceCount
Number of faces for this edge.
IsSharp
 Gets true if this edge is smooth and has a nonzero sharpness. A crease edge is not a sharp edge.
RelativeFaceLeft
 The face on the left of this edge, with respect to the direction this edge is referenced with. Null for a boundary edge with no face on that side, and for a nonmanifold edge.
RelativeFaceRight
 The face on the right of this edge, with respect to the direction this edge is referenced with.
RelativeVertexFrom
 The vertex this edge starts at, taking ComponentDirection into account. This is VertexFrom for an edge in its natural orientation and VertexTo for a reversed one.
RelativeVertexTo
 The vertex this edge ends at, taking ComponentDirection into account.
Sharpness
 Gets or sets the sharpness of this edge.
 The getter reports Crease for a crease edge; use GetSharpness(false) to get Smooth for creases instead.
Tag
 identifies the type of subdivision edge.
VertexFrom
 Start vertex for this edge.
VertexTo
 End vertex for this edge.
Top
Methods
Name | Description
ClearSavedSubdivisionPoints
 Discards the cached subdivision and surface points for this edge, so they are recomputed on next use.
ComponentIndex
 Gets the component index of this edge.
EndSharpness
 Gets the sharpness of this edge at one of its ends.
FaceAt
 Retrieve a SubDFace from this edge.
GetSharpness()
 Gets the sharpness of this edge, reporting Crease for a crease edge.
GetSharpness(Boolean)
 Gets the sharpness of this edge.
RelativeFaceAt
 Gets the face on one side of this edge, relative to the direction this edge is referenced with.
RelativeVertexAt
 Gets one of this edge's two vertices, relative to the direction this edge is referenced with.
ToNurbsCurve
 Get a cubic, uniform, non-rational, NURBS curve that is on the edge's limit curve.
Top
See Also
Reference
Rhino.Geometry Namespace