RhinoCommon API
Worksession Class
 Manages a list of models that are being used as reference geometry.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Worksession
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class Worksession
Public NotInheritable Class Worksession
The Worksession type exposes the following members.
Properties
Name | Description
Document
 Gets the document that owns this worksession.
FileName
 Returns the path to the open worksession, or .rws, file. If there is no worksession file open, or the active worksession has not yet been saved, then null is returned.
ModelCount
 Returns the number of models in the worksession. The active model will included in this count whether or not it has been saved.
ModelPaths
 Returns the paths to the models used by the worksession. If the active model has not been saved, then it will not be included in the output array.
Models
 The models in this worksession, including the active model.
UpdateAvailable is filled in, so this reports the same state the Worksessions panel shows. Use GetModels(Boolean) with false to skip that check.
Name
 Gets the name of the worksession - the worksession (.rws) file name without its path or extension. Returns an empty string if there is no worksession file open, or the active worksession has not yet been saved; it is up to the caller to decide what to display in that case.
RuntimeSerialNumber
 Unique serial number for the worksession while the application is running. This is not a persistent value.
 Since Rhino 9 worksessions are per-document and no longer have serial numbers of their own, so this returns Document's RuntimeSerialNumber. Prefer that property in new code.
Top
Methods
Name | Description
Attach(IEnumerable<String>)
 Attaches several models to this worksession as reference models.
Attach(String)
 Attaches a model to this worksession as a reference model.
Detach(IEnumerable<UInt32>)
 Detaches several reference models from this worksession.
Detach(UInt32)
 Detaches a reference model from this worksession.
FileNameFromRuntimeSerialNumber
 Returns the path to the open worksession, or .rws, file. If there is no worksession file open, or the active worksession has not yet been saved, then null is returned.
GetLockInformation
 Describes whether a worksession model's file is locked, and by whom.
GetModels
 The models in this worksession, including the active model.
ModelPathFromSerialNumber
 Returns the path to a model, used by the worksession, given a reference model serial number
Open
 Opens a worksession (.rws) file.
Save
 Saves this worksession to its existing .rws file.
SaveAs
 Saves this worksession to a .rws file.
SetActiveModel
 Makes one of this worksession's reference models the active model.
Update
 Re-reads a reference model whose file has changed on disk.
UpdateAll
 Re-reads every reference model in this worksession whose file has changed on disk.
Top
See Also
Reference
Rhino.DocObjects Namespace