RhinoCommon API
RenderPlugIn.PreviewRenderTypes Enumeration
[Missing <summary> documentation for "T:Rhino.PlugIns.RenderPlugIn.PreviewRenderTypes"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum PreviewRenderTypes
Public Enumeration PreviewRenderTypes
Members
Member name | Value | Description
None | 0
ThreeSeparateImages | 1
SingleImage | 2
Progressive | 3
See Also
Reference
Rhino.PlugIns Namespace