RhinoCommon API
ReadFileResult Enumeration
 ON::ReadFileResult reports what happened when a file read was attempted.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ReadFileResult
Public Enumeration ReadFileResult
Members
Member name | Value | Description
Unset | 0 |  No result is available.
Completed | 1 |  Read completed with no errors.
CompletedWithErrors | 2 |  Read completed with non fatal errors.
Failed | 3 |  Read failed.
See Also
Reference
Rhino Namespace