RhinoCommon API
Ellipse Structure
 Represents the values of a plane and the two semi-axes radii in an ellipse.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public struct Ellipse : IEpsilonComparable<Ellipse>,
	ICloneable
<SerializableAttribute>
Public Structure Ellipse
	Implements IEpsilonComparable(Of Ellipse), ICloneable
The Ellipse type exposes the following members.
Constructors
Name | Description
Ellipse(Plane, Double, Double)
 Initializes a new ellipse from base plane and both principal radii.
Ellipse(Point3d, Point3d, Point3d)
 Initializes a new ellipse from a center point and the two semi-axes intersections.
Top
Properties
Name | Description
Center
 Gets or sets the center of the ellipse.
FocalDistance
 Gets the distance from the center to a focus.
IsValid
 Returns an indication of the validity of this ellipse.
Plane
 Gets or sets the base plane of the ellipse.
Radius1
 Gets or sets the radius of the ellipse along the base plane X semi-axis.
Radius2
 Gets or sets the radius of the ellipse along the base plane Y semi-axis.
Top
Methods
Name | Description
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
GetFoci
 Gets the foci. The foci are two points whose sum of distances from any point on the ellipse is always the same.
ToNurbsCurve
 Constructs a nurbs curve representation of this ellipse.
This is equivalent to calling NurbsCurve.CreateFromEllipse().
TryFitEllipseToPoints
 Attempt to fit an ellipse through a set of points.
Top
See Also
Reference
Rhino.Geometry Namespace