RhinoCommon API
ViewInfoFocalBlurModes Enumeration
 The different focal blur modes of the ViewInfo
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum ViewInfoFocalBlurModes
Public Enumeration ViewInfoFocalBlurModes
Members
Member name | Value | Description
None | 0 |  No focal blur
Automatic | 1 | Auto-focus on selected objects
Manual | 2 | Fully manual focus
See Also
Reference
Rhino.DocObjects Namespace