RhinoCommon API
PreviewNotification Class
[Missing <summary> documentation for "T:Rhino.PlugIns.PreviewNotification"]
Inheritance Hierarchy
System.Object
 Rhino.PlugIns.PreviewNotification
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class PreviewNotification
Public NotInheritable Class PreviewNotification
The PreviewNotification type exposes the following members.
Methods
Name | Description
NotifyIntermediateUpdate
Top
See Also
Reference
Rhino.PlugIns Namespace