RhinoCommon API
FileLwo Class
 Support for writing lwo file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileLwo
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileLwo
Public NotInheritable Class FileLwo
The FileLwo type exposes the following members.
Methods
Name | Description
Read
Read a lwo file into a RhinoDoc
Write
Write a lwo file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace