RhinoCommon API
FileRaw Class
 Support for writing Raw file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileRaw
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileRaw
Public NotInheritable Class FileRaw
The FileRaw type exposes the following members.
Methods
Name | Description
Read
Read a raw file into a RhinoDoc
Write
Write a raw file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace