RhinoCommon API
SimpleArrayVector3d Class
 ON_SimpleArray<ON_3dVector>, ON_3dVectorArray all have the same size This class wraps all of these C++ versions. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayVector3d
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArrayVector3d : IDisposable
Public Class SimpleArrayVector3d
	Implements IDisposable
The SimpleArrayVector3d type exposes the following members.
Constructors
Name | Description
SimpleArrayVector3d()
 Initializes a new empty SimpleArrayVector3d instance.
SimpleArrayVector3d(IEnumerable<Vector3d>)
 Initializes a new SimpleArrayVector3d instance from a set of vectors
Top
Properties
Name | Description
Count
 Gets the amount of vectors in this array.
Top
Methods
Name | Description
Add
 Adds a vector to the list
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToArray
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace