RhinoCommon API
SweepFrame Enumeration
 Frame types for creating swept surfaces
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum SweepFrame
Public Enumeration SweepFrame
Members
Member name | Value | Description
Freeform | 0 |  The cross-section curve rotates to maintain its angle to the rail throughout the sweep.
Roadlike | 1 |  Specify an axis for calculating the 3-D rotation of the cross-section.
AlignWithSurface | 2 |  The cross-section rotates to follow the normal of the surface that the rail lies on. This requires a rail that knows its surface, so pass a BrepEdge or a BrepTrim as the rail. Any other curve falls back to Freeform.
See Also
Reference
Rhino.Geometry Namespace