RhinoCommon API
DisplayAttributeMaterial Class
 One side of the material the display pipeline shades an object with. A texture-style VisualAnalysisMode sets its texture up here from SetUpDisplayAttributes.
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayAttributeMaterial
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class DisplayAttributeMaterial
Public NotInheritable Class DisplayAttributeMaterial
The DisplayAttributeMaterial type exposes the following members.
Properties
Name | Description
Diffuse
 Diffuse color.
DisableLighting
 When true the material is drawn at full diffuse color, ignoring the scene lights.
Emission
 Emission color.
FlatShaded
 Shades with no smoothing, so the individual render mesh faces are visible.
IndexOfRefraction
 Index of refraction.
Luminosity
 Luminosity.
OverrideObjectColor
 Objects acquire color from render materials.
OverrideObjectReflectivity
 Objects acquire reflectivity from render materials.
OverrideObjectTransparency
 Objects acquire transparency from render materials.
Reflectivity
 Reflectivity, 0.0 to 1.0.
Shine
 Shine, 0 to MaxShine.
ShineIntensity
 Shine intensity.
Transparency
 Transparency, 0.0 opaque to 1.0 transparent.
Top
Methods
Name | Description
GetTexture
 Gets the texture of the given type, or null when this material has none.
GetTextures
 Gets every texture this material uses.
RemoveTexture
 Removes every texture of the given type.
SetTexture
 Assigns a texture, replacing any texture this material already has of the same type.
Top
Remarks
 Valid for as long as the DisplayPipelineAttributes it came from, the same as MeshSpecificAttributes. The attributes passed to SetUpDisplayAttributes belong to the display pipeline and are disposed when that call returns; using this afterwards does nothing rather than reaching freed memory.
See Also
Reference
Rhino.Display Namespace