RhinoCommon API
RuntimeDocumentDataTable Class
 Collection of document runtime data. This is a good place to put non-serialized, per document data.
Inheritance Hierarchy
System.Object
 System.Collections.Generic.Dictionary<Object, Object>
 Rhino.DocObjects.Tables.RuntimeDocumentDataTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class RuntimeDocumentDataTable : Dictionary<Object, Object>
Public NotInheritable Class RuntimeDocumentDataTable
	Inherits Dictionary(Of Object, Object)
The RuntimeDocumentDataTable type exposes the following members.
Properties
Name | Description
Document
Top
Methods
Name | Description
GetValue<T>
 Checks the dictionary for the specified key, if found and the value is not null then the value is returned. If the key is not found or its value is null then newT(Document) is called to create a new value instance which is put in the dictionary and returned.
TryGetValue<T>(Object)
 Check dictionary for value and return it properly cast if found.
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace