RhinoCommon API
DirectionAnalysisSettingsState Class
Represents a snapshot of DirectionAnalysisSettings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.DirectionAnalysisSettingsState
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DirectionAnalysisSettingsState
Public Class DirectionAnalysisSettingsState
The DirectionAnalysisSettingsState type exposes the following members.
Properties
Name | Description
Color
 Gets or sets a color used to display the direction.
Direction
 Gets or sets whether to display the direction.
U
 Gets or sets whether to display the U dir.
V
 Gets or sets whether to display the V dir.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace