RhinoCommon API
LocalizedStringHandler Structure
 Built by the compiler when an interpolated string is passed to LocalizeString(LocalizedStringHandler, Int32, String). Collects the English text and each hole's formatted value. Not for direct use.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public struct LocalizedStringHandler
Public Structure LocalizedStringHandler
The LocalizedStringHandler type exposes the following members.
Constructors
Name | Description
LocalizedStringHandler
Initializes a new instance of the LocalizedStringHandler class
Top
Methods
Name | Description
AppendFormatted<T>(T)
AppendFormatted<T>(T, Int32)
AppendFormatted<T>(T, String)
AppendFormatted<T>(T, Int32, String)
AppendLiteral
Top
See Also
Reference
Rhino.UI Namespace