RhinoCommon API
CurveList Class
 Represents a list of curves.
Inheritance Hierarchy
System.Object
 Rhino.Collections.RhinoList<Curve>
 Rhino.Collections.CurveList
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class CurveList : RhinoList<Curve>
Public Class CurveList
	Inherits RhinoList(Of Curve)
The CurveList type exposes the following members.
Constructors
Name | Description
CurveList()
 Initializes a new empty list of curves.
CurveList(IEnumerable<Curve>)
 Initializes a new list that is filled with all items of the input enumerable.
Input items are not explicitly duplicated (this is a shallow copy).
CurveList(Int32)
 Initializes a new empty list of curves with a predefined capacity.
This is the amount of items the list will accept before resizing.
Top
Properties
Name | Description
Top
Methods
Name | Description
Add(Arc)
 Adds an arc to this list.
Add(Circle)
 Adds a circle to this list.
Add(Ellipse)
 Adds an ellipse to this list.
Add(IEnumerable<Point3d>)
 Adds a polyline to this list.
Add(Line)
 Adds a line to this list.
Insert(Int32, Arc)
 Inserts an arc at a given index of this list.
Insert(Int32, Circle)
 Inserts a line at a given index of this list.
Insert(Int32, Ellipse)
 Inserts an ellipse at a given index of this list.
Insert(Int32, Line)
 Inserts a line at a given index of this list.
Insert(Int32, IEnumerable<Point3d>)
 Inserts a polyline at a given index of this list.
Transform
 Transform all the curves in this list. If at least a single transform failed this function returns false.
Top
See Also
Reference
Rhino.Collections Namespace