RhinoCommon API
Environment.FrameBufferFillMode Enumeration
 Fillmode for background
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum FrameBufferFillMode
Public Enumeration FrameBufferFillMode
Members
Member name | Value | Description
None | 0 |  None set
DefaultColor | 1 |  Use default color
SolidColor | 2 |  Use specified solid color
Gradient2Color | 3 |  Use 2-color gradient
Gradient4Color | 4 |  Use 4-color gradient (colors are specified by corners)
Bitmap | 5 |  Use bitmap
Renderer | 6 |  Use whatever renderer chooses
Transparent | 7 |  Transparent background
Force32Bit | 4294967295 |  Use 32bit color @todo verify what this means
See Also
Reference
Rhino.Render.ChangeQueue Namespace