RhinoCommon API
RenderContent.MatchDataResult Enumeration
 Return values for MatchData function
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public enum MatchDataResult
Public Enumeration MatchDataResult
Members
Member name | Value | Description
None | 0 |  None
Some | 1 |  Some
All | 2 |  All
See Also
Reference
Rhino.Render Namespace