RhinoCommon API
LicenseNode Enumeration
License node types.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum LicenseNode
Public Enumeration LicenseNode
Members
Member name | Value | Description
Standalone | 0 | An independent node.
Network | 1 | Network (obtains license from Zoo server)
NetworkCheckedOut | 2 | Network (has license checked out from Zoo server)
See Also
Reference
Rhino.ApplicationSettings Namespace