RhinoCommon API
FilePlyWriteOptions Class
[Missing <summary> documentation for "T:Rhino.FileIO.FilePlyWriteOptions"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FilePlyWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FilePlyWriteOptions
Public Class FilePlyWriteOptions
The FilePlyWriteOptions type exposes the following members.
Constructors
Name | Description
FilePlyWriteOptions
Initializes a new instance of the FilePlyWriteOptions class
Top
Properties
Name | Description
ExportASCII
 Determines whether to export as Ascii.
ExportColors
 Determines whether to export vertex colors.
ExportDoubles
 Determines whether vertexes are exported as doubles or floats.
ExportMaterial
 Determines whether to export a material.
ExportNormals
 Determines whether to export vertex normals.
MeshingParameters
UseSimpleDialog
 Determines whether to use the simple or detailed meshing dialog.
Top
Methods
Name | Description
Top
Fields
Name | Description
WriteOptions
Top
See Also
Reference
Rhino.FileIO Namespace