RhinoCommon API
ViewCaptureWriter.VectorBitmapProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.VectorBitmapProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void VectorBitmapProc(
	IntPtr hBmp,
	double m11,
	double m12,
	double m21,
	double m22,
	double dx,
	double dy
)
Public Delegate Sub VectorBitmapProc (
	hBmp As IntPtr,
	m11 As Double,
	m12 As Double,
	m21 As Double,
	m22 As Double,
	dx As Double,
	dy As Double
)
Parameters
hBmp
Type: System.IntPtr
m11
Type: System.Double
m12
Type: System.Double
m21
Type: System.Double
m22
Type: System.Double
dx
Type: System.Double
dy
Type: System.Double
See Also
Reference
Rhino.Runtime Namespace