RhinoCommon API
DecalCreateParams Class
 Used by Rhino.Render.Decal.Create() to create a new decal.
Inheritance Hierarchy
System.Object
 Rhino.Render.DecalCreateParams
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DecalCreateParams
Public Class DecalCreateParams
The DecalCreateParams type exposes the following members.
Constructors
Name | Description
DecalCreateParams
Initializes a new instance of the DecalCreateParams class
Top
Properties
Name | Description
DecalMapping
DecalProjection
EndLatitude
EndLongitude
Height
MapToInside
MaxU
MaxV
MinU
MinV
Origin
Radius
StartLatitude
StartLongitude
TextureInstanceId
Transparency
VectorAcross
VectorUp
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace