RhinoCommon API
DisplayModeChangedEventArgs Class
[Missing <summary> documentation for "T:Rhino.Display.DisplayModeChangedEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.DisplayModeChangedEventArgs
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DisplayModeChangedEventArgs : EventArgs
Public Class DisplayModeChangedEventArgs
	Inherits EventArgs
The DisplayModeChangedEventArgs type exposes the following members.
Properties
Name | Description
ChangedDisplayModeId
OldDisplayModeId
RhinoDoc
Viewport
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace