RhinoCommon API
PhysicallyBased Class
 Helper class with properties containing the names of fields available in our PBR implementation.
Inheritance Hierarchy
System.Object
 Rhino.Render.ParameterNames.PhysicallyBased
 Namespace: Rhino.Render.ParameterNames
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class PhysicallyBased
Public NotInheritable Class PhysicallyBased
The PhysicallyBased type exposes the following members.
Properties
Name | Description
Alpha
AmbientOcclusion
Anisotropic
AnisotropicRotation
BaseColor
BRDF
Bump
Clearcoat
ClearcoatBump
ClearcoatRoughness
Displacement
Emission
Metallic
Opacity
OpacityIor
OpacityRoughness
Roughness
Sheen
SheenTint
Specular
SpecularTint
Subsurface
SubsurfaceScatteringColor
SubsurfaceScatteringRadius
Top
See Also
Reference
Rhino.Render.ParameterNames Namespace