RhinoCommon API
SimpleArrayFloat Class
 Wrapper for ON_SimpleArray<float>. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayFloat
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArrayFloat : IDisposable
Public Class SimpleArrayFloat
	Implements IDisposable
The SimpleArrayFloat type exposes the following members.
Constructors
Name | Description
SimpleArrayFloat()
 Initializes a new SimpleArrayFloat class.
SimpleArrayFloat(IEnumerable<Single>)
 Initializes a new SimpleArrayFloat class
SimpleArrayFloat(Int32)
 Initializes a new SimpleArrayFloat class. Initial size of the array - all values are set to zero.
SimpleArrayFloat(SimpleArrayFloat)
 Initializes a new SimpleArrayFloat with the contents of another SimpleArrayFloat.
Top
Properties
Name | Description
Count
 Gets the amount of elements in this array.
Top
Methods
Name | Description
Array
 Return the raw data.
ConstPointer
 Gets the constant (immutable) pointer of this array.
CopyTo
 Copies the contents of a SimpleArrayFloat into another SimpleArrayFloat.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToArray
 Returns the managed counterpart of the unmanaged array.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace