RhinoCommon API
NurbsCurveFitParameters.Intensity Enumeration
 The Intensity enum is used to select a predefined or a custom value for the smoothing, uniformity, and curvature bias coefficients.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum Intensity
Public Enumeration Intensity
Members
Member name | Value | Description
None | 0
Low | 1
Moderate | 2
Medium | 3
High | 4
Extreme | 5
Custom | 6
See Also
Reference
Rhino.Geometry Namespace