RhinoCommon API
DynamicIconUsage Enumeration
[Missing <summary> documentation for "T:Rhino.Render.DynamicIconUsage"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum DynamicIconUsage
Public Enumeration DynamicIconUsage
Members
Member name | Value | Description
TreeControl | 0 |  Used in a tree control (e.g., TreeGridView).
SubnodeControl | 1 |  Used in a sub-node control (\see CRhRdkSubNodeCtrl)
ContentControl | 2 |  Used in a content control (\see CRhRdkContentCtrl)
General | 3 |  Used in a custom user interface. The background will be plain white.
See Also
Reference
Rhino.Render Namespace