RhinoCommon API
RenderMeshProvider.Flags Enumeration
 Flags to be passed into and returned from RenderMeshes and HasCustomRenderMeshes.
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
[FlagsAttribute]
public enum Flags
<FlagsAttribute>
Public Enumeration Flags
Members
Member name | Value | Description
None | 0 |  No flags set.
Canceled | 1 |  If this flag is set when returned, then RenderMeshes was canceled.
DisableCaching | 2 |  Pass in this flag to bypass any primitive caching that the RenderMeshProviders might do.
Recursive | 4 |  Pass in this flag to get the render meshes for entire blocks. Only has an effect if the ObjectId is a block reference, and if it will not produce CRMs of its own.
IsDocumentObject | 8 |  Pass in this flag to indicate that the object id is a document resident object
AlwaysCopyDocumentContent | 16 |  Pass in this flag to ensure that materials, environments and textures that refer to document objects are always copied. This makes the RenderMeshes object safe to be stored outside of the lifetime of those objects - in caches, or for use in threaded situtations.
ReturnNullForStandardMaterial | 32 |  Pass in this flag to request that null is returned when the material on a mesh should be the standard material used - in otherwords, not customized by this RenderMeshes object. Note that this will require document access to resolve - do not use in threaded situations.
Incomplete | 64 |  This flag is returned when an asynchronous operation (like Displacement) has not yet completed. The meshes returned with it are the object's ordinary render meshes, not the provider's final result, so a caller that measures them sees the object as it was before the provider ran. Call again while this flag remains set, calling RhinoApp.Wait() in between so the pending work can publish its result.
See Also
Reference
Rhino.Render.CustomRenderMeshes Namespace