RhinoCommon API
FilterContentByUsage Enumeration
 Content collection filter value
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.9
Syntax
public enum FilterContentByUsage
Public Enumeration FilterContentByUsage
Members
Member name | Value | Description
None | 0 |  No filter in use.
Used | 1 |  Display only used contents.
Unused | 2 |  Display only unused contents.
UsedSelected | 3 |  Display only contents used by selected objects.
See Also
Reference
Rhino.Render Namespace