RhinoCommon API
GradientType Enumeration
 Style of color gradient
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum GradientType
Public Enumeration GradientType
Members
Member name | Value | Description
None | 0 | No gradient
Linear | 1 | Linear (or axial) gradient between two points
Radial | 2 | Radial (or spherical) gradient using a center point and a radius
LinearDisabled | 3 | Disabled linear gradient. Useful for keeping gradient information around, but not having it displayed
RadialDisabled | 4 | Disabled radial gradient. Useful for keeping gradient information around, but not having it displayed
See Also
Reference
Rhino.Display Namespace