RhinoCommon API
AsyncRenderContext Class
 \ingroup rhino_render Inherit from AsyncRenderContext to be able to create asynchronous render engine implementations through RhinoCommon.
Inheritance Hierarchy
System.Object
 Rhino.Render.AsyncRenderContext
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class AsyncRenderContext : IDisposable
Public MustInherit Class AsyncRenderContext
	Implements IDisposable
The AsyncRenderContext type exposes the following members.
Constructors
Name | Description
AsyncRenderContext
Initializes a new instance of the AsyncRenderContext class
Top
Properties
Name | Description
Cancel
 If set to true rendering should be stopped. Is set to true only by StopRendering().
RenderThread
 Holder for render thread, that gets set through StartRenderThread()
RenderWindow
 Handle to the RenderWindow for the instance of this class. This is a convenience property for implementors to use.
Top
Methods
Name | Description
DeleteThis
Dispose()
Releases all resources used by the AsyncRenderContext
Dispose(Boolean)
Releases the unmanaged resources used by the AsyncRenderContext and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
JoinRenderThread
 Join the render thread, then set to null;
StartRenderThread
 Start a new render thread with given function.
StopRendering
 Override StopRendering if you need to do additional tasks besides having Cancel set to true. Note: you should always base.StopRendering() in your overriding implementation.
Top
See Also
Reference
Rhino.Render Namespace