RhinoCommon API
BezierCurve Class
 Represents a Bezier curve.
Note: as an exception, the bezier curve is not derived from Curve.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.BezierCurve
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class BezierCurve : IDisposable,
	ISerializable
<SerializableAttribute>
Public Class BezierCurve
	Implements IDisposable, ISerializable
The BezierCurve type exposes the following members.
Constructors
Name | Description
BezierCurve(IEnumerable<Point2d>)
 Create bezier curve with controls defined by a list of 2d points
BezierCurve(IEnumerable<Point3d>)
 Create bezier curve with controls defined by a list of 3d points
BezierCurve(IEnumerable<Point4d>)
 Create bezier curve with controls defined by a list of 4d points
BezierCurve(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
ControlVertexCount
 Number of control vertices in this curve
Dimension
 Dimension of Bezier
IsRational
 Gets a value indicating whether or not the curve is rational. Rational curves have control-points with custom weights.
IsValid
Tests an object to see if it is valid.
Top
Methods
Name | Description
ChangeDimension
Change dimension of bezier.
CreateBeziers
 Create an array of Bezier curves that fit to an existing curve. Please note, these Beziers can be of any order and may be rational.
CreateCubicBeziers
 Constructs an array of cubic, non-rational Beziers that fit a curve to a tolerance.
CreateLoftedBezier(IEnumerable<Point2d>)
 Loft a bezier through a list of points
CreateLoftedBezier(IEnumerable<Point3d>)
 Loft a bezier through a list of points
CurvatureAt
Evaluate the curvature vector at a curve parameter.
Derivative
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetBoundingBox
 Bounding box solver. Gets the world axis aligned bounding box for the curve.
GetControlVertex2d
Get location of a control vertex.
GetControlVertex3d
Gets the 3D location of a control vertex at the specified index.
GetControlVertex4d
 Gets the homogeneous (4D) value of a control vertex at the specified index.
GetObjectData
 Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
IncreaseDegree
Increase degree of bezier
MakeNonRational
Make bezier non-rational
MakeRational
Make bezier rational
PointAt
Evaluates point at a curve parameter.
Split
 Divides the Bezier curve at the specified parameter.
TangentAt
Evaluates the unit tangent vector at a curve parameter.
ToNurbsCurve
 Constructs a NURBS curve representation of this curve.
Top
See Also
Reference
Rhino.Geometry Namespace