RhinoCommon API
ViewCaptureWriter.VectorRoundedRectProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.VectorRoundedRectProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void VectorRoundedRectProc(
	float centerX,
	float centerY,
	float pixelWidth,
	float pixelHeight,
	float cornerRadius,
	int strokeColor,
	float strokeWidth,
	int fillColor
)
Public Delegate Sub VectorRoundedRectProc (
	centerX As Single,
	centerY As Single,
	pixelWidth As Single,
	pixelHeight As Single,
	cornerRadius As Single,
	strokeColor As Integer,
	strokeWidth As Single,
	fillColor As Integer
)
Parameters
centerX
Type: System.Single
centerY
Type: System.Single
pixelWidth
Type: System.Single
pixelHeight
Type: System.Single
cornerRadius
Type: System.Single
strokeColor
Type: System.Int32
strokeWidth
Type: System.Single
fillColor
Type: System.Int32
See Also
Reference
Rhino.Runtime Namespace