RhinoCommon API
FileIgsWriteOptions.IgeswVersionMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileIgsWriteOptions.IgeswVersionMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum IgeswVersionMode
Public Enumeration IgeswVersionMode
Members
Member name | Value | Description
Igv52 | 1
Igv53 | 2
See Also
Reference
Rhino.FileIO Namespace