RhinoCommon API
ShaderLanguage Enumeration
 Graphics Shader Language https://en.wikipedia.org/wiki/OpenGL_Shading_Language#Versions
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ShaderLanguage
Public Enumeration ShaderLanguage
Members
Member name | Value | Description
GLSL_ES100 | 1 | Used for OpenGL ES 2.0 and WebGL 1.0
GLSL_ES300 | 2 | Used for OpenGL ES 3.0 and WebGL 2.0
GLSL_ES310 | 3
GLSL_120 | 4 | Used for OpenGL 2.1
GLSL_130 | 5 | Used for OpenGL 3.0
GLSL_140 | 6 | Used for OpenGL 3.1
GLSL_150 | 7 | Used for OpenGL 3.2
GLSL_330 | 8 | Used for OpenGL 3.3
GLSL_400 | 9 | Used for OpenGL 4.0
GLSL_410 | 10 | Used for OpenGL 4.1
GLSL_420 | 11 | Used for OpenGL 4.2
GLSL_430 | 12 | Used for OpenGL 4.3
GLSL_440 | 13 | Used for OpenGL 4.4
Metal | 14 | Metal for Apple
See Also
Reference
Rhino.Display Namespace