RhinoCommon API
RenderContentFieldChangedEventArgs Class
 EventArgs for the RenderContentFieldChanged event
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RenderContentEventArgs
 Rhino.Render.RenderContentChangedEventArgs
 Rhino.Render.RenderContentFieldChangedEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderContentFieldChangedEventArgs : RenderContentChangedEventArgs
Public Class RenderContentFieldChangedEventArgs
	Inherits RenderContentChangedEventArgs
The RenderContentFieldChangedEventArgs type exposes the following members.
Properties
Name | Description
FieldName
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace