RhinoCommon API
ThicknessAnalysisSettingsState Class
 Represents a snapshot of ThicknessAnalysisSettings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.ThicknessAnalysisSettingsState
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public class ThicknessAnalysisSettingsState
Public Class ThicknessAnalysisSettingsState
The ThicknessAnalysisSettingsState type exposes the following members.
Properties
Name | Description
DistanceRange
 The distance range.
ShowIsoCurves
 Get or sets the display of surface isocurves.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace