RhinoCommon API
SerializationOptions Class
 Contains options for serializing -or storing- data, such as Rhino version, user data, and meshes.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.SerializationOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SerializationOptions
Public Class SerializationOptions
The SerializationOptions type exposes the following members.
Constructors
Name | Description
SerializationOptions
 Initializes a new instance of the SerializationOptions class.
Top
Properties
Name | Description
MaxRhinoVersion
 Gets the most recent serialization version available.
MinRhinoVersion
 Gets the earliest serialization version available.
RhinoVersion
 Gets or sets a value indicating the Rhino version.
WriteAnalysisMeshes
 Gets or sets a value indicating whether to write analysis meshes
WriteRenderMeshes
 Gets or sets a value indicating whether to write render meshes
WriteUserData
 Gets or sets a value indicating whether to write user data.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace