RhinoCommon API
DisplayPipelineAttributes.BackfaceStyle Enumeration
 Values for changing the display of the backface (the side opposite of the surface normal direction).
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.20
Syntax
public enum BackfaceStyle
Public Enumeration BackfaceStyle
Members
Member name | Value | Description
UseFrontFaceSettings | 0 |  No color change.
CullBackfaces | 1 |  Surfaces viewed from the back will be transparent.
UseObjectColor | 2 |  Surfaces viewed from the back use the color specified in the object's display properties.
SingleColorAllBackfaces | 3 |  All backfaces display a specified color regardless of the object color.
UseRenderMaterial | 4 |  Shades using rendering material.
CustomMaterialAllBackfaces | 5 |  Use a custom material for all backfaces.
See Also
Reference
Rhino.Display Namespace