RhinoCommon API
TextureWrapType Enumeration
[Missing <summary> documentation for "T:Rhino.Render.TextureWrapType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
public enum TextureWrapType
Public Enumeration TextureWrapType
Members
Member name | Value | Description
Clamped | 0
Repeating | 1
See Also
Reference
Rhino.Render Namespace