RhinoCommon API
ObjectPropertiesPageCollection Class
 Passed to Rhino.PlugIns.PlugIn.ObjectPropertiesPages to allow a plug-in to add custom ObjectPropertiesPage pages to the Rhino properties panel.
Inheritance Hierarchy
System.Object
 Rhino.UI.ObjectPropertiesPageCollection
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ObjectPropertiesPageCollection
Public Class ObjectPropertiesPageCollection
The ObjectPropertiesPageCollection type exposes the following members.
Properties
Name | Description
Document
 Document associated with the Rhino properties panel.
DocumentRuntimeSerialNumber
 Document associated with the Rhino properties panel.
Top
Methods
Name | Description
Add
 Custom page to add
Top
See Also
Reference
Rhino.UI Namespace