RhinoCommon API
FileSatWriteOptions Class
 Options used when writing a Sat file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileSatWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileSatWriteOptions
Public Class FileSatWriteOptions
The FileSatWriteOptions type exposes the following members.
Constructors
Name | Description
FileSatWriteOptions
Initializes a new instance of the FileSatWriteOptions class
Top
Properties
Name | Description
Type
 Get and set the type of the sat file being written.
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace