RhinoCommon API
InstanceDefinitionNameConflictResolution Enumeration
 Specifies how to resolve a name collision when an instance definition is created from a file and the model already contains an instance definition with that name.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum InstanceDefinitionNameConflictResolution
Public Enumeration InstanceDefinitionNameConflictResolution
Members
Member name | Value | Description
KeepCurrent | 2 |  Keep the instance definition that is already in the model and discard the new one.
Redefine | 3 |  Replace the instance definition that is already in the model with the new one. References to the discarded instance definition are changed to reference the new one. This is what the Insert command does.
KeepBoth | 4 |  Keep both instance definitions, giving the new one an automatically generated unused name, such as "Block 01".
See Also
Reference
Rhino.DocObjects Namespace