RhinoCommon API
ICollapsibleSectionHolder Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.ICollapsibleSectionHolder"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface ICollapsibleSectionHolder : IWindow,
	IHasCppImplementation, IDisposable
Public Interface ICollapsibleSectionHolder
	Inherits IWindow, IHasCppImplementation, IDisposable
The ICollapsibleSectionHolder type exposes the following members.
Properties
Name | Description
BackgroundColor
BottomMargin
EmptyText
LeftMargin
RightMargin
ScrollPosition
SectionCount
Sections
SettingsPathSubKey
TopMargin
Top
Methods
Name | Description
Add
ExpandSection
IsSectionExpanded
Remove
SectionAt
UpdateAllViews
Top
See Also
Reference
Rhino.UI.Controls Namespace