RhinoCommon API
DimensionStyle.LeaderContentAngleStyle Enumeration
 Angle for text or other leader or dimension content
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LeaderContentAngleStyle
Public Enumeration LeaderContentAngleStyle
Members
Member name | Value | Description
Horizontal | 0 |  Annotation text is horizontal in annotation object's plane
Aligned | 1 |  Aligned with last leader direction or dimension line
Rotated | 2 |  Explicit angle
See Also
Reference
Rhino.DocObjects Namespace