RhinoCommon API
GripUserInterfaceObjectShape Enumeration
 Grip shapes available for GripUserInterfaceObject classes
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum GripUserInterfaceObjectShape
Public Enumeration GripUserInterfaceObjectShape
Members
Member name | Value | Description
Circle | 0
Square | 1
Triangle | 2
X | 3
See Also
Reference
Rhino.UI Namespace