RhinoCommon API
GumballSettings Class
 Contains static metthods and properties to modify Rhino gumball settings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.GumballSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public static class GumballSettings
Public NotInheritable Class GumballSettings
The GumballSettings type exposes the following members.
Properties
Name | Description
ArcThickness
 Specifies the thickness of the rotation arcs in pixels. Set arc thickness to zero to turn off rotation handles.
AutoGumballAlignment
 Specifies the plane the gumball aligns itself to.
AxisThickness
 Specifies the thickness of the axis arrows in pixels. Set axis thickness to zero to turn of move handles.
EnableGumball
 Turns the gumball widget on any time objects are selected.
ExtrudeBallSize
 Specifies the size of the extrude dots in pixels.
GumballRadius
 Specifies the radius of the gumball widget in pixels.
MenuBallColor
 Specifies the gumball menu ball color.
MenuBallLocation
 Specifies the distance of the menu ball from the gumball origin in pixels.
MenuBallSize
 Specifies the size of the menu dots in pixels.
MergeFacesAfterExtrude
 Merges faces after extruding.
PlaneLocation
 Specifies the distance of the plane indicators from the gumball origin in pixels.
PlaneSize
 Specifies the size of the plane indicators in pixels. Set plane size to zero to turn off the plane indicators.
Since: 9.0
PlaneVisibilityAngle
 Sets the angle of view for the plane to be visible. The range is from 0 to 90 degrees. 0 degrees means the plane only shows if the gumball is perfectly aligned to the view, 90 means the plane always shows. The default is 50 degrees.
RotateViewAroundGumball
 Sets the view rotation center to the gumball origin.
ScaleHandleSize
 Specifies the size of the scale handles in pixels. Set scale handle size to zero to turn off scale handles.
SnappyGumball
 If true, snaps to object snap locations. if false, ignores object snap locations.
TipLength
 Specifies the length of the direction arrows in pixels.
TipWidth
 Specifies the width of the direction arrows in pixels.
XAxisColor
 Specifies the gumball x axis color.
YAxisColor
 Specifies the gumball y axis color.
ZAxisColor
 Specifies the gumball z axis color.
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultAlignment
 Gets the factory default value of AutoGumballAlignment.
GetDefaultState
 Gets the factory settings of the application.
RestoreDefaults
 Commits the default settings as the current settings.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace