RhinoCommon API
City Class
 City
Inheritance Hierarchy
System.Object
 Rhino.Render.City
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class City
Public Class City
The City type exposes the following members.
Properties
Name | Description
Latitude
 Gets latitude of city.
Longitude
 Gets longitude of city.
Name
 Gets name of city.
TimeZone
 Gets time zone of city.
Top
Methods
Name | Description
Cities
 Returns number of available cities.
CityAt
 Returns city at given index.
FindNearest
 Finds nearest city of specified input parameters.
Top
See Also
Reference
Rhino.Render Namespace