RhinoCommon API
FileTypeList Class
[Missing <summary> documentation for "T:Rhino.PlugIns.FileTypeList"]
Inheritance Hierarchy
System.Object
 Rhino.PlugIns.FileTypeList
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class FileTypeList
Public NotInheritable Class FileTypeList
The FileTypeList type exposes the following members.
Constructors
Name | Description
FileTypeList()
Initializes a new instance of the FileTypeList class
FileTypeList(String, String)
Initializes a new instance of the FileTypeList class
FileTypeList(String, String, Boolean)
Initializes a new instance of the FileTypeList class
Top
Methods
Name | Description
AddFileType(String, IEnumerable<String>)
AddFileType(String, String)
AddFileType(String, IEnumerable<String>, Boolean)
AddFileType(String, String, Boolean)
AddFileType(String, String, String)
AddFileType(String, String, String, Boolean)
Top
See Also
Reference
Rhino.PlugIns Namespace