RhinoCommon API
AntialiasLevel Enumeration
 Provides the anti-alias levels used for render quality
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum AntialiasLevel
Public Enumeration AntialiasLevel
Members
Member name | Value | Description
None | 0 |  Low quality
Draft | 1 |  Draft quality
Good | 2 |  Good quality
High | 3 |  High quality
See Also
Reference
Rhino Namespace