RhinoCommon API
RenderSourceView Class
 Helper class to get the correct view from the Render View Source settings. An instance of this class is supposed to be used with the using() {} construct.
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderSourceView
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderSourceView : IDisposable
Public Class RenderSourceView
	Implements IDisposable
The RenderSourceView type exposes the following members.
Constructors
Name | Description
RenderSourceView
 Create a new RenderSourceView for the given doc. Note that this should be done with using(var rsv = new RenderSourceView(doc)) {} If the RenderSettings have the source view set to for instance a SnapShot this construct will ensure that the (active) view is set to the correct snapshot, and reverted back to the original once this instance goes out of scope.
Top
Methods
Name | Description
Dispose()
Releases all resources used by the RenderSourceView
Dispose(Boolean)
Releases the unmanaged resources used by the RenderSourceView and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
GetViewInfo
 Get the ViewInfo as specified by the render source view settings.
Top
See Also
Reference
Rhino.Render Namespace