RhinoCommon API
DimensionStyle.CenterMarkStyle Enumeration
 Style for drawing centermark for Radial dimensions and Centermark objects
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum CenterMarkStyle
Public Enumeration CenterMarkStyle
Members
Member name | Value | Description
None | 0 |  No centermark display
Mark | 1 |  + mark only
MarkAndLines | 2 |  + mark and lines to radius
See Also
Reference
Rhino.DocObjects Namespace