RhinoCommon API
DisplayPipelineAttributes.CurveThicknessUse Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.CurveThicknessUse"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.6
Syntax
public enum CurveThicknessUse
Public Enumeration CurveThicknessUse
Members
Member name | Value | Description
ObjectWidth | 0
Pixels | 1
See Also
Reference
Rhino.Display Namespace