RhinoCommon API
TexturedColor Class
 Color4f specialization of TexturedValue.
Inheritance Hierarchy
System.Object
 Rhino.Render.TexturedValue<Color4f>
 Rhino.Render.TexturedColor
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public class TexturedColor : TexturedValue<Color4f>
Public Class TexturedColor
	Inherits TexturedValue(Of Color4f)
The TexturedColor type exposes the following members.
Constructors
Name | Description
TexturedColor
Initializes a new instance of the TexturedColor class
Top
Methods
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Rhino.Render Namespace