RhinoCommon API
UserInterfaceButton Class
[Missing <summary> documentation for "T:Rhino.UI.UserInterfaceButton"]
Inheritance Hierarchy
System.Object
 Rhino.UI.UserInterfaceObjectBase
 Rhino.UI.UserInterfaceControl
 Rhino.UI.UserInterfaceButton
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class UserInterfaceButton : UserInterfaceControl
Public Class UserInterfaceButton
	Inherits UserInterfaceControl
The UserInterfaceButton type exposes the following members.
Constructors
Name | Description
UserInterfaceButton
Initializes a new instance of the UserInterfaceButton class
Top
Properties
Name | Description
Top
Methods
Name | Description
OnMouseClick |  (Overrides UserInterfaceObjectBase.OnMouseClick(MouseState).)
Top
Events
Name | Description
Click
Top
See Also
Reference
Rhino.UI Namespace