RhinoCommon API
IsometricCamera Enumeration
 Isometric camera orientation.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.10
Syntax
public enum IsometricCamera
Public Enumeration IsometricCamera
Members
Member name | Value | Description
None | 0
Northeast | 1
Northwest | 2
Southeast | 3
Southwest | 4
See Also
Reference
Rhino.Display Namespace