RhinoCommon API
TimeZone Class
 TimeZone
Inheritance Hierarchy
System.Object
 Rhino.Render.TimeZone
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class TimeZone
Public Class TimeZone
The TimeZone type exposes the following members.
Properties
Name | Description
Hours
 Gets hours of a time zone.
Latitude
 Returns the latitude of a major city nearby
Longitude
 Returns the Longitude of a major city nearby
Name
 Gets name of a time zone.
Top
Methods
Name | Description
TimeZoneAt
 Returns a time zone at given index.
TimeZones
 Returns number of available time zones.
Top
See Also
Reference
Rhino.Render Namespace