RhinoCommon API
Dithering Class
 This is the interface to dithering settings.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.Dithering
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class Dithering : DocumentOrFreeFloatingBase,
	IDisposable
Public NotInheritable Class Dithering
	Inherits DocumentOrFreeFloatingBase
	Implements IDisposable
The Dithering type exposes the following members.
Constructors
Name | Description
Dithering()
 Create a utility object not associated with any document
Dithering(Dithering)
 Create a utility object not associated with any document from another object
Top
Properties
Name | Description
Enabled
Method
On |  Obsolete.
Top
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Dispose
Releases all resources used by the Dithering
Finalize
 (Overrides FreeFloatingBase.Finalize().)
Top
See Also
Reference
Rhino.Render Namespace