RhinoCommon API
PostEffectUuids Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffectUuids"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.PostEffectUuids
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class PostEffectUuids
Public NotInheritable Class PostEffectUuids
The PostEffectUuids type exposes the following members.
Properties
Name | Description
Bloom
BriCon
DepthOfField
Dithering
Fog
Gamma
GaussianBlur
Glare
Glow
HueSatLum
Multiplier
Noise
ToneMapper_BlackWhitePoint
ToneMapper_Clamp
ToneMapper_FalseColor
ToneMapper_Filmic
ToneMapper_Logarithmic
Watermark
WireframeAnnotationsRGBA
WireframeCurvesRGBA
WireframeIsocurvesRGBA
WireframePointsRGBA
Top
See Also
Reference
Rhino.Render.PostEffects Namespace