RhinoCommon API
FileSvg Class
 Support for writing Svg file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileSvg
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileSvg
Public NotInheritable Class FileSvg
The FileSvg type exposes the following members.
Methods
Name | Description
Read
Read a Svg file into a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace