RhinoCommon API
Brep.PointConstraint Class
 Constrain the result to go through a point
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Brep.PointConstraint
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class PointConstraint
Public NotInheritable Class PointConstraint
The Brep.PointConstraint type exposes the following members.
Constructors
Name | Description
Brep.PointConstraint
 Constructor for a given location
Top
Properties
Name | Description
Point
 Location of the constraint
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace