RhinoCommon API
ShowPanelEventArgs Class
 Panels.Show event arguments
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.UI.PanelEventArgs
 Rhino.UI.ShowPanelEventArgs
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ShowPanelEventArgs : PanelEventArgs
Public Class ShowPanelEventArgs
	Inherits PanelEventArgs
The ShowPanelEventArgs type exposes the following members.
Constructors
Name | Description
ShowPanelEventArgs
Initializes a new instance of the ShowPanelEventArgs class
Top
Properties
Name | Description
Show
 Will be true if showing or false if hiding
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace