RhinoCommon API
FileGtsWriteOptions Class
 Options for writing a Gts file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileGtsWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileGtsWriteOptions
Public Class FileGtsWriteOptions
The FileGtsWriteOptions type exposes the following members.
Constructors
Name | Description
FileGtsWriteOptions
Initializes a new instance of the FileGtsWriteOptions class
Top
Properties
Name | Description
MeshingParameters
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace