RhinoCommon API
RenderSettings.RenderingSources Enumeration
 Rendering source (render directly from a NamedView or Snapshot)
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.1
Syntax
public enum RenderingSources
Public Enumeration RenderingSources
Members
Member name | Value | Description
ActiveViewport | 0 |  Get the rendering view from the currently active viewport (as in all previous versions of Rhino)
SpecificViewport | 1 |  Get the rendering view from the named viewport (see NamedViewport below)
NamedView | 2 |  Get the rendering view from a specific named view (see NamedView below)
SnapShot | 3 |  Before rendering, restore the Snapshot specified in Snapshot below, then render.
See Also
Reference
Rhino.Render Namespace