RhinoCommon API
ICurrentEnvironment_Get Interface
[Missing <summary> documentation for "T:Rhino.Render.ICurrentEnvironment_Get"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface ICurrentEnvironment_Get
Public Interface ICurrentEnvironment_Get
The ICurrentEnvironment_Get type exposes the following members.
Properties
Name | Description
ForBackground
 Get the RenderEnvironment used as the 360 degree backdrop environment. Null will be returned if the background mode is set to 'Solid Color' or 'Gradient' (i.e., not 'Environment').
ForBackground_CheckMode |  Obsolete.
ForLighting
 Get the RenderEnvironment used as custom skylighting environment. Null will be returned if the custom skylighting environment override is disabled.
ForReflectionAndRefraction
 Get the RenderEnvironment used as custom reflection (and refraction) environment. Null will be returned if the custom reflection override is disabled.
Top
See Also
Reference
Rhino.Render Namespace