RhinoCommon API
FileDwgReadOptions.MeshPrecisionMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileDwgReadOptions.MeshPrecisionMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum MeshPrecisionMode
Public Enumeration MeshPrecisionMode
Members
Member name | Value | Description
Automatic | 0
DoublePrecision | 1
SinglePrecision | 2
See Also
Reference
Rhino.FileIO Namespace