RhinoCommon API
FileX3dv Class
 Support for writing x3dv file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileX3dv
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileX3dv
Public NotInheritable Class FileX3dv
The FileX3dv type exposes the following members.
Methods
Name | Description
Write
Write a x3dv file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace