RhinoCommon API
MeshVertexColorList Class
 Provides access to the vertex colors of a mesh object.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.MeshVertexColorList
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MeshVertexColorList : IResizableList<Color>,
	IList<Color>, ICollection<Color>, IEnumerable<Color>,
	IEnumerable, IList, ICollection, IReadOnlyList<Color>,
	IReadOnlyCollection<Color>
Public Class MeshVertexColorList
	Implements IResizableList(Of Color), IList(Of Color),
	ICollection(Of Color), IEnumerable(Of Color), IEnumerable,
	IList, ICollection, IReadOnlyList(Of Color), IReadOnlyCollection(Of Color)
The MeshVertexColorList type exposes the following members.
Properties
Name | Description
Capacity
 Gets or sets the total number of vertex colors the internal data structure can hold without resizing.
Count
 Gets or sets the number of mesh colors.
Item
 Gets or sets the vertex color at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Tag
 Gets or sets a mapping information for the mesh associated with these vertex colors.
Top
Methods
Name | Description
Add(Color)
 Adds a new vertex color to the end of the color list.
Add(Int32, Int32, Int32)
 Adds a new vertex color to the end of the color list.
AddRange
 Adds an enumerable of colors to the to the vertex color list. For the Mesh to be valid, the number of colors must match the number of vertices.
AppendColors
 Appends a collection of colors to the vertex color list. For the Mesh to be valid, the number of colors must match the number of vertices.
Clear
 Clears the vertex color list on the mesh.
CreateMonotoneMesh
 Constructs a valid vertex color list consisting of a single color.
Destroy
 Releases all memory allocated to store vertex colors. The list capacity will be 0 after this call.
Subsequent calls can add new items.
GetEnumerator
 Gets an enumerator that yields all colors in this collection.
SetColor(Int32, Color)
 Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
SetColor(MeshFace, Color)
 Sets a color at the three or four vertex indices of a specified face.
SetColor(Int32, Int32, Int32, Int32)
 Sets or adds a vertex color to the color List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
SetColors
 Sets all the vertex colors in one go. For the Mesh to be valid, the number of colors must match the number of vertices.
ToARGBArray
 Return colors as an array of integers with packed ARGB values
Top
See Also
Reference
Rhino.Geometry.Collections Namespace