RhinoCommon API
FileX3dvWriteOptions Class
 Options for writing a x3dv file
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileX3dvWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileX3dvWriteOptions
Public Class FileX3dvWriteOptions
The FileX3dvWriteOptions type exposes the following members.
Constructors
Name | Description
FileX3dvWriteOptions
Initializes a new instance of the FileX3dvWriteOptions class
Top
Properties
Name | Description
ExportTextureCoordinates
ExportVertexColors
ExportVertexNormals
MeshingParameters
Top
Methods
Name | Description
ToDictionary
 Create a dictionary of these options. This dictionary can be passed to the RhinoDoc.Export function
Top
See Also
Reference
Rhino.FileIO Namespace