RhinoCommon API
DisplayTechnology Enumeration
 Graphics display techologies.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum DisplayTechnology
Public Enumeration DisplayTechnology
Members
Member name | Value | Description
None | 0
OpenGL | 1
Metal | 2
DirectX | 3
Software | 4
Vulkan | 5
Direct3d11 | 3
Direct3d12 | 6
See Also
Reference
Rhino.Display Namespace