RhinoCommon API
Brep.FilletSurfaceResults Class
 Results from a fillet surface operation
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Brep.FilletSurfaceResults
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FilletSurfaceResults
Public Class FilletSurfaceResults
The Brep.FilletSurfaceResults type exposes the following members.
Constructors
Name | Description
Brep.FilletSurfaceResults
Initializes a new instance of the Brep.FilletSurfaceResults class
Top
Properties
Name | Description
Face0
 The first face used as input for the fillet surface generation
Face1
 The second face used as input for the fillet surface generation
Fillets
 The fillet surfaces created between the first and second face
OutBreps0
 If the first input face was trimmed, the trimmed results are returned here
OutBreps1
 If the second input face was trimmed, the trimmed results are returned here
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace