RhinoCommon API
MeshNgon Class
 Represents a mesh ngon.
When retrieved from the Ngon property of a mesh, this contains faces that have edge valence strictly higher than 4.
When retrieving Ngons from GetNgonAndFacesEnumerable(), this might contain also triangles and quads.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.MeshNgon
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MeshNgon : IEquatable<MeshNgon>,
	IComparable<MeshNgon>, IComparable
Public Class MeshNgon
	Implements IEquatable(Of MeshNgon), IComparable(Of MeshNgon),
	IComparable
The MeshNgon type exposes the following members.
Properties
Name | Description
BoundaryVertexCount
 Get the number of vertices in this ngon. about length information.
Empty
 Gets an empty MeshNgon.
FaceCount
 Get the number of faces in this ngon.
Item
 Get a mesh vertex index from the ngon's vertex index list.
Top
Methods
Name | Description
BoundaryVertexIndexList
 Get the outer boundary mesh vertex list of the ngon.
Vertices are sorted counterclockwise with respect to the direction of the face, although the degree by which vertex normals will respect this might vary.
CompareTo
 Compares this MeshNgon with otherNgon and returns a value of 1, 0, or -1.
Priority is for vertex count, then face count, then vertex index list values, then face index list values.
Create
 Constructs an ngon from lists of mesh vertex and face indexes.
Equals(MeshNgon)
 Determines if this ngon and otherNgon are identical.
Equals(Object)
 Determines if otherObj is a MeshNgon and is identical to this ngon.
 (Overrides Object.Equals(Object).)
FaceIndexList
 Get the ngon's mesh face index list.
GetHashCode
 Returns a runtime-stable hash code for the current mesh ngon. You are not allowed to rely on persistence of this hash code in serialization, but for each instance of the application, this hash code will be the same for ngons with identical vertex and face lists.
 (Overrides Object.GetHashCode().)
Set
 Set the ngon vertex and face index lists.
ToString
 Returns a string representation for this MeshNgon. This is to provide a meaningful visualization of this structure and is subject to change in newer releases.
 (Overrides Object.ToString().)
Top
Operators
Name | Description
Equality
 Determines whether two MeshNgon structures have equal values.
Inequality
 Determines whether two MeshNgon structures have different values.
Top
See Also
Reference
Rhino.Geometry Namespace