RhinoCommon API
FileFbxWriteOptions.FileType Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileFbxWriteOptions.FileType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum FileType
Public Enumeration FileType
Members
Member name | Value | Description
Binary7 | 0
Ascii7 | 1
Binary6 | 2
Ascii6 | 3
See Also
Reference
Rhino.FileIO Namespace