RhinoCommon API
LayerTableEventType Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.LayerTableEventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum LayerTableEventType
Public Enumeration LayerTableEventType
Members
Member name | Value | Description
Added | 0
Deleted | 1
Undeleted | 2
Modified | 3
Sorted | 4 | LayerTable.Sort() potentially changed sort order.
Current | 5 | Current layer change.
See Also
Reference
Rhino.DocObjects.Tables Namespace