RhinoCommon API
SmoothingCoordinateSystem Enumeration
 The direction of the smoothing used by Curve, Surface, and Mesh Smooth.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum SmoothingCoordinateSystem
Public Enumeration SmoothingCoordinateSystem
Members
Member name | Value | Description
World | 0 |  World coordinates
CPlane | 1 |  Construction plane coordinates
Object | 2 |  Object u, v, and n coordinates
See Also
Reference
Rhino.Geometry Namespace