RhinoCommon API
FileCd Class
 Support for writing CD file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileCd
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileCd
Public NotInheritable Class FileCd
The FileCd type exposes the following members.
Methods
Name | Description
Write
Write a CD file based on the contents of a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace