RhinoCommon API
TextOrientation Enumeration
 Method for getting rotation for drawing text
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextOrientation
Public Enumeration TextOrientation
Members
Member name | Value | Description
InPlane | 0 |  Text has fixed rotation on a world coordinate plane
InView | 1 |  Text is drawn on a plane perpendicular to view direction horizontal to the screen
See Also
Reference
Rhino.DocObjects Namespace