RhinoCommon API
CurvatureStyle Enumeration
 Curvature style
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum CurvatureStyle
Public Enumeration CurvatureStyle
Members
Member name | Value | Description
None | 0 |  None
GaussianCurvature | 1 |  Gaussian curvature
MeanCurvature | 2 |  Unsigned mean curvature
MinimumCurvature | 3 |  Minimum unsigned radius of curvature
MaximumCurvature | 4 |  Maximum unsigned radius of curvature
Remarks
 These values mirror openNURBS and differ from the CurvatureStyle of Rhino.ApplicationSettings.CurvatureAnalysisSettings, which mirrors the curvature analysis settings of the application. Casting one to the other selects the wrong style.
See Also
Reference
Rhino.Geometry Namespace