RhinoCommon API
PhysicallyBasedMaterial Class
[Missing <summary> documentation for "T:Rhino.DocObjects.PhysicallyBasedMaterial"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.PhysicallyBasedMaterial
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PhysicallyBasedMaterial
Public Class PhysicallyBasedMaterial
The PhysicallyBasedMaterial type exposes the following members.
Properties
Name | Description
Alpha
Anisotropic
AnisotropicRotation
BaseColor
BRDF
Clearcoat
ClearcoatRoughness
Emission
Material
Metallic
Opacity
OpacityIOR
OpacityRoughness
ReflectiveIOR
Roughness
Sheen
SheenTint
Specular
SpecularTint
Subsurface
SubsurfaceScatteringColor
SubsurfaceScatteringRadius
UseBaseColorTextureAlphaForObjectAlphaTransparencyTexture
Top
Methods
Name | Description
GetTexture
 Get the texture that corresponds with the specified texture type for this material.
GetTextures
 Get array of textures that this material uses
SetTexture
 Set the texture that corresponds with the specified texture type for this material.
SynchronizeLegacyMaterial
Top
See Also
Reference
Rhino.DocObjects Namespace