RhinoCommon API
WorksessionModel Class
 An immutable snapshot of one model in a worksession.
 The values are copied when the snapshot is taken, so an instance stays usable (though it may go out of date) after the worksession changes. It holds no pointer into the document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.WorksessionModel
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public sealed class WorksessionModel
Public NotInheritable Class WorksessionModel
The WorksessionModel type exposes the following members.
Properties
Name | Description
Alias
 The alias used to decorate names - layers, materials, and so on - that come from this model.
AttachFailed
 True if the most recent attempt to attach this model failed, which usually means the file is missing.
FileTypeId
 The id of the plug-in used to read the model's file.
IsActiveModel
 True if this is the worksession's active model - the document you are editing - rather than a reference model.
IsAttached
 True if the model's contents are currently attached to the document.
Path
 The full path to the model's file. This is empty for an active model that has never been saved.
SerialNumber
 The reference model's serial number, which identifies this model in calls like Detach(UInt32). Zero means this is the worksession's active model.
 Reference model serial numbers are unique across the application, not just within one document, so a serial number from another document's worksession will simply not be found rather than matching the wrong model.
UpdateAvailable
 True if the file on disk has changed since it was attached, so Update(UInt32) has something to do.
 This is only filled in when the snapshot was taken with the file check enabled. Models enables it; pass false to GetModels(Boolean) to skip it, and this is then always false.
Top
Methods
Name | Description
ToString
 Returns the model's alias, or its path when it has no alias.
 (Overrides Object.ToString().)
Top
See Also
Reference
Rhino.DocObjects Namespace