RhinoCommon API
IHelp Interface
 Implement this class to add help to a modeless UI panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IHelp
Public Interface IHelp
The IHelp type exposes the following members.
Properties
Name | Description
HelpUrl
 Help topic URL which gets passed to RhinoHelp.Show
Top
See Also
Reference
Rhino.UI Namespace