RhinoCommon API
NotLicensedException Class
 Exception thrown when calling functions in RhinoCommon and the application is executing without a license
Inheritance Hierarchy
System.Object
 System.Exception
 Rhino.Runtime.NotLicensedException
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class NotLicensedException : Exception
Public Class NotLicensedException
	Inherits Exception
The NotLicensedException type exposes the following members.
Constructors
Name | Description
NotLicensedException()
 Default constructor
NotLicensedException(String)
 Create a new instance with a custom message
NotLicensedException(String, Exception)
 Create a new instance with a custom message and an inner exception
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Runtime Namespace