RhinoCommon API
LightArray Class
[Missing <summary> documentation for "T:Rhino.Render.LightArray"]
Inheritance Hierarchy
System.Object
 Rhino.Render.LightArray
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class LightArray : IDisposable
Public NotInheritable Class LightArray
	Implements IDisposable
The LightArray type exposes the following members.
Constructors
Name | Description
LightArray()
Initializes a new instance of the LightArray class
LightArray(IntPtr)
Initializes a new instance of the LightArray class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Append
Count
Dispose
Releases all resources used by the LightArray
ElementAt
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render Namespace