RhinoCommon API
LineCircleIntersection Enumeration
 Represents all possible cases of a Line|Circle intersection event.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public enum LineCircleIntersection
Public Enumeration LineCircleIntersection
Members
Member name | Value | Description
None | 0 |  No intersections.
Single | 1 |  One intersection.
Multiple | 2 |  Two intersections.
See Also
Reference
Rhino.Geometry.Intersect Namespace