RhinoCommon API
Utilities.PreviewRenderResult Enumeration
 The preview render result
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.8
Syntax
public enum PreviewRenderResult
Public Enumeration PreviewRenderResult
Members
Member name | Value | Description
Rendering | 0
CacheOK | 1
CacheFail | 2
Nothing | 3
See Also
Reference
Rhino.Render Namespace