RhinoCommon API
FilePdfReadOptions.PDF_UNITS Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FilePdfReadOptions.PDF_UNITS"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum PDF_UNITS
Public Enumeration PDF_UNITS
Members
Member name | Value | Description
inches | 0 | inches
centimeters | 1 | centimeters
millimeters | 2 | millimeters
points | 3 | points
See Also
Reference
Rhino.FileIO Namespace