RhinoCommon API
ViewCaptureWriter.VectorArcProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.VectorArcProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void VectorArcProc(
	int argb,
	float thickness,
	int dashed,
	ref Arc arc
)
Public Delegate Sub VectorArcProc (
	argb As Integer,
	thickness As Single,
	dashed As Integer,
	ByRef arc As Arc
)
Parameters
argb
Type: System.Int32
thickness
Type: System.Single
dashed
Type: System.Int32
arc
Type: Rhino.Geometry.Arc
See Also
Reference
Rhino.Runtime Namespace