RhinoCommon API
UserInterfaceCheckState Enumeration
 State of a UserInterfaceCheckBox. Named the way the other enums in here are, so that it does not collide with System.Windows.Forms.CheckState in code that uses both namespaces.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
public enum UserInterfaceCheckState
Public Enumeration UserInterfaceCheckState
Members
Member name | Value | Description
Off | 0 | Not checked
On | 1 | Checked
Indeterminate | 2 |  Neither on nor off, drawn as a dash. Use this when the things the check box stands for do not agree with each other.
See Also
Reference
Rhino.UI Namespace