RhinoCommon API
SimpleArrayPlane Class
 Wrapper for ON_SimpleArray<ON_Plane>. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayPlane
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SimpleArrayPlane : IDisposable
Public Class SimpleArrayPlane
	Implements IDisposable
The SimpleArrayPlane type exposes the following members.
Constructors
Name | Description
SimpleArrayPlane
 Initializes a new SimpleArrayLine instance.
Top
Properties
Name | Description
Count
 Gets the amount of lines in this array.
Top
Methods
Name | Description
ConstPointer
 Gets the constant (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-constant pointer (for modification) of this array.
ToArray
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace