RhinoCommon API
KeyboardKey Enumeration
 Keyboard key recognized by shortcuts
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.12
Syntax
public enum KeyboardKey
Public Enumeration KeyboardKey
Members
Member name | Value | Description
None | 0 | No key
Tab | 9 | Tab key
PageUp | 33 | PageUp key
PageDown | 34 | PageDown key
End | 35 | End key
Home | 36 | Home key
Num0 | 48 | 0 key
Num1 | 49 | 1 key
Num2 | 50 | 2 key
Num3 | 51 | 3 key
Num4 | 52 | 4 key
Num5 | 53 | 5 key
Num6 | 54 | 6 key
Num7 | 55 | 7 key
Num8 | 56 | 8 key
Num9 | 57 | 9 key
A | 65 | A key
B | 66 | B key
C | 67 | C key
D | 68 | D key
E | 69 | E key
F | 70 | F key
G | 71 | G key
H | 72 | H key
I | 73 | I key
J | 74 | J key
K | 75 | K key
L | 76 | L key
M | 77 | M key
N | 78 | N key
O | 79 | O key
P | 80 | P key
Q | 81 | Q key
R | 82 | R key
S | 83 | S key
T | 84 | T key
U | 85 | U key
V | 86 | V key
W | 87 | W key
X | 88 | X key
Y | 89 | Y key
Z | 90 | Z key
F1 | 112 | F1 key
F2 | 113 | F2 key
F3 | 114 | F3 key
F4 | 115 | F4 key
F5 | 116 | F5 key
F6 | 117 | F6 key
F7 | 118 | F7 key
F8 | 119 | F8 key
F9 | 120 | F9 key
F10 | 121 | F10 key
F11 | 122 | F11 key
F12 | 123 | F12 key
Semicolon | 186 | ; key
Equal | 187 | + key
Comma | 188 | , key
Minus | 189 | - key
Period | 190 | . key
Slash | 191 | / key
Grave | 192 | Backtick key
LeftBracket | 219 | [ key
BackSlash | 220 | Back slash key
RightBracket | 221 | ] key
Quote | 222 | Quote key
See Also
Reference
Rhino.UI Namespace