RhinoCommon API
ZooClientParameters Class
 ZooClientParameters is a read-only set of parameters that control the flow of licensing inside ZooClient. Because this class flows through a number of other classes, functions, and UI, it is read-only so that inadvertent changes are not made to the data as it propagates from the caller.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.ZooClientParameters
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ZooClientParameters
Public Class ZooClientParameters
The ZooClientParameters type exposes the following members.
Constructors
Name | Description
ZooClientParameters
 ZooClientParameters Constructor
Top
Properties
Name | Description
Capabilities
 LicenseCapabilities flags that set options for how licenses can be obtained for this product
LicenseEntryTextMask
 Text mask in the form @"RH4A-AAAA-AAAA-AAAA-AAAA-AAAA" that informs the user what numbers they are looking for
LicenseGuid
 Guid used by ZooClient to identify the license saved by ZooClient. This differs from ProductGuid because different versions of a plug-in with the same Plug-in ID may need different licenses.
OnLeaseChanged
 Delegate called by ZooClient when a cloud zoo lease is changed
ParentWindow
 Parent window assigned to any licensing dialogs that appear. If null, the Rhino main window is used.
ProductBuildType
 Product build type. Must be one of LicenseBuildType values.
ProductGuid
 Guid used by ZooClient to identify the plug-in requesting a license from ZooClient. This Guid may be used by different versions of the plug-in. If different licenses are used by different versions of the plug-in, the plug-in must also specify a LicenseGuid.
ProductPath
 Path to the application calling ZooClient
ProductTitle
 Title of the product, "Rhinoceros 6" for example.
SelectedLicenseType
 License type selected by default when user is prompted to enter a license key
Top
Methods
Name | Description
VerifyLicenseKey
 Called by GetLicense to ensure that the license key entered by the user is legitimate and can be used.
VerifyPreviousVersionLicense
 When a caller calls GetLicense, ZooClient may call VerifyPreviousVersionLicense to ensure previousVersionLicense is legitimate and can be used to upgrade license.
Top
See Also
Reference
Rhino.Runtime Namespace