RhinoCommon API
FileEps Class
 Support for reading eps file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileEps
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileEps
Public NotInheritable Class FileEps
The FileEps type exposes the following members.
Methods
Name | Description
Read
Read a Eps file into a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace