RhinoCommon API
DimensionStyle.MaskFrame Enumeration
 Draw a frame stroke around the text mask area
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum MaskFrame
Public Enumeration MaskFrame
Members
Member name | Value | Description
NoFrame | 0 |  Text mask frame not drawn
RectFrame | 1 |  Text mask frame outline rectangle drawn
CapsuleFrame | 2 |  Text mask frame outline capsule drawn
CircleFrame | 3 |  Text mask frame outline circle drawn
SquareFrame | 4 |  Text mask frame outline square drawn
DiamondFrame | 5 |  Text mask frame outline square rotated 45 degrees
TriangleFrame | 6 |  Text mask frame outline triangle drawn
HexagonFrame | 7 |  Text mask frame outline as a hexagon
HexagonCapsuleFrame | 8 |  Text mask frame outline as an elongated hexagon
RoundRectFrame | 9 |  Text mask frame outline as a rounded rectangle
See Also
Reference
Rhino.DocObjects Namespace