RhinoCommon API
MeshProviderIds Class
 Built in primitive provider ids.
Inheritance Hierarchy
System.Object
 Rhino.Render.CustomRenderMeshes.MeshProviderIds
 Namespace: Rhino.Render.CustomRenderMeshes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class MeshProviderIds
Public NotInheritable Class MeshProviderIds
The MeshProviderIds type exposes the following members.
Properties
Name | Description
CurvePiping
Displacement
EdgeSoftening
Shutlining
Thickening
Top
See Also
Reference
Rhino.Render.CustomRenderMeshes Namespace