RhinoCommon API
FileGHS Class
 Support for reading eps file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileGHS
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileGHS
Public NotInheritable Class FileGHS
The FileGHS type exposes the following members.
Methods
Name | Description
Read
Read a Ghs file into a RhinoDoc
Top
See Also
Reference
Rhino.FileIO Namespace