RhinoCommon API
File3dmEmbeddedFiles Class
[Missing <summary> documentation for "T:Rhino.FileIO.File3dmEmbeddedFiles"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmEmbeddedFiles
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmEmbeddedFiles : IEnumerable<File3dmEmbeddedFile>,
	IEnumerable
Public Class File3dmEmbeddedFiles
	Implements IEnumerable(Of File3dmEmbeddedFile), IEnumerable
The File3dmEmbeddedFiles type exposes the following members.
Constructors
Name | Description
File3dmEmbeddedFiles
Initializes a new instance of the File3dmEmbeddedFiles class
Top
Methods
Name | Description
Add
 Add a new embedded file and load it from a local file.
GetEnumerator
Top
See Also
Reference
Rhino.FileIO Namespace