RhinoCommon API
PurgeFilter Enumeration
 The document table object types that Purge(PurgeFilter) can purge.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 9.0
Syntax
[FlagsAttribute]
public enum PurgeFilter
<FlagsAttribute>
Public Enumeration PurgeFilter
Members
Member name | Value | Description
None | 0 | Purge nothing.
AnnotationStyles | 1 | Unused annotation styles.
Bitmaps | 2 | Embedded bitmaps.
BlockDefinitions | 4 | Unused block definitions.
Environments | 8 | Unused render environments.
Groups | 16 | Empty groups.
HatchPatterns | 32 | Unused hatch patterns.
Layers | 64 | Empty layers.
LayoutGroups | 128 | Empty layout groups.
Linetypes | 256 | Unused linetypes.
Materials | 512 | Unused legacy materials and unused render materials.
SectionStyles | 1024 | Unused section styles.
Textures | 2048 | Unused render textures.
All | 4095 | Everything listed above.
See Also
Reference
Rhino Namespace