RhinoCommon API
PreviewSceneServer Class
 PreviewSceneServer
Inheritance Hierarchy
System.Object
 Rhino.Render.PreviewSceneServer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PreviewSceneServer : IDisposable
Public Class PreviewSceneServer
	Implements IDisposable
The PreviewSceneServer type exposes the following members.
Constructors
Name | Description
PreviewSceneServer |  Obsolete.
 Constructor for PreviewSceneServer
Top
Properties
Name | Description
CppPointer
 The CppPointer of PreviewSceneServer
Top
Methods
Name | Description
ApplyRotation
 Set Scene Server Rotation
Dispose()
 Dispose for PreviewSceneServer
Dispose(Boolean)
 Dispose for PreviewSceneServer
Finalize
 Destructor for PreviewSceneServer
 (Overrides Object.Finalize().)
SetSceneScale
 Set Scene Server Scale
Top
See Also
Reference
Rhino.Render Namespace