RhinoCommon API
DimensionStyle.LengthDisplay Enumeration
 Dimension display length unit system and style
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LengthDisplay
Public Enumeration LengthDisplay
Members
Member name | Value | Description
ModelUnits | 0 |  Decimal current model units
Millmeters | 3 |  Decimal Millimeters
Centimeters | 4 |  Decimal Centimeters
Meters | 5 |  Decimal Meters
Kilometers | 6 |  Decimal Kilometers
InchesDecimal | 7 |  Decimal Inches
InchesFractional | 1 |  Fractional Inches ( 1.75 inches displays as 1-3/4 )
FeetDecimal | 8 |  Decimal Feet
FeetAndInches | 2 |  Feet and Inches ( 14.75 inches displays as 1'-2-3/4" )
Miles | 9 |  Decimal Miles
See Also
Reference
Rhino.DocObjects Namespace