RhinoCommon API
DimensionStyle.ClippingArrowType Enumeration
 Defines enumerated values for arrowhead shapes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ClippingArrowType
Public Enumeration ClippingArrowType
Members
Member name | Value | Description
None | 0
Triangle | 1
OffsetTriangle | 2
Arrow | 3
OffsetArrow | 4
OpenArrow | 5
Rectangle | 6
Ribbon | 7
Line | 8
See Also
Reference
Rhino.DocObjects Namespace