RhinoCommon API
RevSurface Class
 Represents a surface of revolution.
Revolutions can be incomplete (they can form arcs).
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.RevSurface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class RevSurface : Surface
<SerializableAttribute>
Public Class RevSurface
	Inherits Surface
The RevSurface type exposes the following members.
Constructors
Name | Description
RevSurface
 Protected constructor for internal use.
Top
Properties
Name | Description
Angle
 Gets the start and end angles of revolution in radians. The interval angle must be increasing and satisfy RhinoMath.ZeroTolerance < Angle.Length<= 2.0 * System.Math.PI.
Axis
 Gets the axis of revolution.
Curve
 Gets the revolute curve.
Interval
 Interval specifies the parameterization for the angular parameter. Interval must be an increasing interval. The parameter Interval[0] corresponds to Angle[0] and the parameter Interval[1] corresponds to Angle[1].
IsTransposed
 If false, the "u" parameter is the angle parameter and the "v" parameter is the curve parameter. If true, the "u" parameter is the curve parameter and the "v" parameter is the angle parameter.
Top
Methods
Name | Description
AxisAndCurveCoplanar
 Detemines if the axis of revolution and the curve are co-planar.
Create(Curve, Line)
 Constructs a new surface of revolution from a generatrix curve and an axis.
Create(Line, Line)
 Constructs a new surface of revolution from a generatrix line and an axis.
If the operation succeeds, results can be (truncated) cones, cylinders and circular hyperboloids.
Create(Polyline, Line)
 Constructs a new surface of revolution from a generatrix polyline and an axis.
Create(Curve, Line, Double, Double)
 Constructs a new surface of revolution from a generatrix curve and an axis.
This overload accepts a slice start and end angles.
Create(Line, Line, Double, Double)
 Constructs a new surface of revolution from a generatrix line and an axis.
This overload accepts a slice start and end angles.
Results can be (truncated) cones, cylinders and circular hyperboloids, or can fail.
Create(Polyline, Line, Double, Double)
 Constructs a new surface of revolution from a generatrix polyline and an axis.
This overload accepts a slice start and end angles.
CreateFromCone
 Constructs a new surface of revolution from the values of a cone.
CreateFromCylinder
 Constructs a new surface of revolution from the values of a cylinder.
CreateFromSphere
 Constructs a new surface of revolution from the values of a sphere.
CreateFromTorus
 Constructs a new surface of revolution from the values of a torus.
Top
See Also
Reference
Rhino.Geometry Namespace