RhinoCommon API
File3dmDisplacement.SweepResolutionFormulas Enumeration
 Formula to use to calculate sweep resolution from initial quality.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public enum SweepResolutionFormulas
Public Enumeration SweepResolutionFormulas
Members
Member name | Value | Description
Default | 0 |  Default formula.
AbsoluteToleranceDependent | 1 |  Formula used in Rhino 5. Dependent on absolute tolerance.
See Also
Reference
Rhino.FileIO Namespace