RhinoCommon SDK
File3dmWriteOptions.Version Property
Rhino for Mac 5.1
 File version. Default is 5
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Version { get; set; }
Public Property Version As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace