RhinoCommon SDK
MappingTag.MappingType Property
Rhino for Mac 5.1
 Gets or sets a texture mapping type: linear, cylinder, etc...
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TextureMappingType MappingType { get; set; }
Public Property MappingType As TextureMappingType
	Get
	Set
Property Value
Type: TextureMappingType
See Also
Reference
MappingTag Class
Rhino.Render Namespace