RhinoCommon SDK
NurbsCurve.CreateFromLine Method
Rhino for Mac 5.1
 Gets a non-rational, degree 1 Nurbs curve representation of the line.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static NurbsCurve CreateFromLine(
	Line line
)
Public Shared Function CreateFromLine (
	line As Line
) As NurbsCurve
Parameters
line
Type: Rhino.Geometry.Line
[Missing <param name="line"/> documentation for "M:Rhino.Geometry.NurbsCurve.CreateFromLine(Rhino.Geometry.Line)"]
Return Value
Type: NurbsCurve
Curve on success, null on failure.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace