RhinoCommon SDK
RhinoPageView.ActiveViewportID Property
Rhino for Mac 5.1
 Returns viewport ID for the active viewport. Faster than ActiveViewport function when working with page views.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override Guid ActiveViewportID { get; }
Public Overrides ReadOnly Property ActiveViewportID As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace