RhinoCommon SDK
ViewportInfo.UnlockFrustumSymmetry Method
Rhino for Mac 5.1
 Unlocks frustum horizontal and vertical symmetries.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void UnlockFrustumSymmetry()
Public Sub UnlockFrustumSymmetry
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace