RhinoCommon SDK
GetString.GetLiteralString Method
Rhino for Mac 5.1
Returns the string that the user typed. By default, space does not stop input.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GetResult GetLiteralString()
Public Function GetLiteralString As GetResult
Return Value
Type: GetResult
The result type. If the user typed a string, this is String.
See Also
Reference
GetString Class
Rhino.Input.Custom Namespace