RhinoCommon SDK
MeshVertexNormalList.SetNormals Method
Rhino for Mac 5.1
 Sets all normal vectors in one go. This method destroys the current normal array if it exists.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetNormals(
	Vector3f[] normals
)
Public Function SetNormals (
	normals As Vector3f()
) As Boolean
Parameters
normals
Type: Rhino.Geometry.Vector3f[]
Normals for the entire mesh.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace