RhinoCommon SDK
Light.PowerCandela Property
Rhino for Mac 5.1
 Gets or sets the light power in candelas (cd).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double PowerCandela { get; set; }
Public Property PowerCandela As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Light Class
Rhino.Geometry Namespace