RhinoCommon SDK
ObjRef Class
Rhino for Mac 5.1
 Represents a reference to a Rhino object.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.ObjRef
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class ObjRef : IDisposable
Public Class ObjRef
	Implements IDisposable
The ObjRef type exposes the following members.
Constructors
Name | Description
ObjRef(Guid)
 Initializes a new object reference from a globally unique identifier (Guid).
ObjRef(RhinoObject)
 Initializes a new object reference from a Rhino object.
ObjRef(RhinoObject, PickContext)
 Initialized a new object reference from a Rhino object and pick context
Top
Properties
Name | Description
GeometryComponentIndex
 Gets the component index of the referenced (sub) geometry. Some objects have subobjects that are valid pieces of geometry. For example, breps have edges and faces that are valid curves and surfaces. Each subobject has a component index that is > 0. The parent geometry has a component index = -1.
ObjectId
Returns the id of the referenced Rhino object.
RuntimeSerialNumber
 If > 0, then this is the value of a Rhino object's serial number field. The serial number is used instead of the pointer to prevent crashes in cases when the RhinoObject is deleted but an ObjRef continues to reference the Rhino object. The value of RuntimeSerialNumber is not saved in archives because it generally changes if you save and reload an archive.
Top
Methods
Name | Description
Brep
 Gets the brep if this reference geometry is one.
ClippingPlaneSurface
 Gets the clipping plane surface if this reference targeted one.
Curve
 Gets the curve if this reference targeted one.
CurveParameter
 If the reference geometry is a curve or edge with a selection point, then this gets the parameter of the selection point.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Edge
 Gets the edge if this reference geometry is one.
Face
 If the referenced geometry is a brep face, a brep with one face, or a surface, this returns the brep face.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Geometry
 Gets the geometry linked to the object targeted by this reference.
Hatch
 Gets the hatch if the referenced geometry is one.
Light
 Gets the light if the referenced geometry is one.
Mesh
 Gets the mesh if the referenced geometry is one.
Object
Returns the referenced Rhino object.
Point
 Gets the point if the referenced geometry is one.
PointCloud
 Gets the point cloud if the referenced geometry is one.
SelectionMethod
 Gets the method used to select this object.
SelectionPoint
 If the object was selected by picking a point on it, then SelectionPoint() returns the point where the selection occured, otherwise it returns Point3d.Unset.
SetSelectionComponent
 When an object is selected by picking a sub-object, SetSelectionComponent may be used to identify the sub-object.
Surface
 Gets the surface if the referenced geometry is one.
SurfaceParameter
 If the reference geometry is a surface, brep with one face, or surface edge with a selection point, then this gets the surface paramters of the selection point.
TextDot
 Gets the text dot if the referenced geometry is one.
TextEntity
 Gets the text entity if the referenced geometry is one.
Trim
 If the referenced geometry is an edge of a surface, this returns the associated brep trim.
Top
See Also
Reference
Rhino.DocObjects Namespace