RhinoCommon SDK
GumballDisplayConduit Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.Gumball.GumballDisplayConduit"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Gumball.GumballDisplayConduit
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class GumballDisplayConduit : IDisposable
Public Class GumballDisplayConduit
	Implements IDisposable
The GumballDisplayConduit type exposes the following members.
Constructors
Name | Description
GumballDisplayConduit
Initializes a new instance of the GumballDisplayConduit class
Top
Properties
Name | Description
BaseGumball
Starting location.
Enabled
Gumball
GumballTransform
 The gumball transformation is the transformation calculated by comparing the current gumball to the starting BaseGumball.
InRelocate
PickResult
The inital mouse down event sets PickResult.
PreTransform
 The pre-transform is a transformation that needs to be applied before the gumball transformation.
TotalTransform
 The total transformation is GumballTransform * PreTransform.
Top
Methods
Name | Description
CheckShiftAndControlKeys
Dispose()
Releases all resources used by the GumballDisplayConduit
Dispose(Boolean)
Releases the unmanaged resources used by the GumballDisplayConduit and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
PickGumball
SetBaseGumball(GumballObject)
 Contents of the gumball are copied to the base gumball of this class.
SetBaseGumball(GumballObject, GumballAppearanceSettings)
 Contents of the gumball are copied to the base gumball of this class.
UpdateGumball
Top
See Also
Reference
Rhino.UI.Gumball Namespace