RhinoCommon SDK
GetBaseClass.PostCustomMessage Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetBaseClass.PostCustomMessage(System.Object)"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void PostCustomMessage(
	Object messageData
)
Public Shared Sub PostCustomMessage (
	messageData As Object
)
Parameters
messageData
Type: System.Object
[Missing <param name="messageData"/> documentation for "M:Rhino.Input.Custom.GetBaseClass.PostCustomMessage(System.Object)"]
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace