RhinoCommon SDK
ControlPoint Properties
Rhino for Mac 5.1
The ControlPoint type exposes the following members.
Properties
Name | Description
Location
 Gets or sets the location of the control point. Internally, Rhino stores the location of a weighted control-point as a pre-multiplied coordinate, but RhinoCommon always provides Euclidean coordinates for control-points, regardless of weight.
Unset
 Gets the predefined unset control point.
Weight
 Gets or sets the weight of this control point.
Top
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace