RhinoCommon SDK
Curve.Trim Method (CurveEnd, Double)
Rhino for Mac 5.1
 Shortens a curve by a given length
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve Trim(
	CurveEnd side,
	double length
)
Public Function Trim (
	side As CurveEnd,
	length As Double
) As Curve
Parameters
side
Type: Rhino.Geometry.CurveEnd
[Missing <param name="side"/> documentation for "M:Rhino.Geometry.Curve.Trim(Rhino.Geometry.CurveEnd,System.Double)"]
length
Type: System.Double
[Missing <param name="length"/> documentation for "M:Rhino.Geometry.Curve.Trim(Rhino.Geometry.CurveEnd,System.Double)"]
Return Value
Type: Curve
Trimmed curve if successful, null on failure.
See Also
Reference
Curve Class
Trim Overload
Rhino.Geometry Namespace