RhinoCommon SDK
Torus.Unset Property
Rhino for Mac 5.1
 Gets an invalid Torus.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Torus Unset { get; }
Public Shared ReadOnly Property Unset As Torus
	Get
Property Value
Type: Torus
See Also
Reference
Torus Structure
Rhino.Geometry Namespace