RhinoCommon SDK
TextureMapping.TryGetMappingBox Method
Rhino for Mac 5.1
 Get a box projection from the texture mapping.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetMappingBox(
	out Plane plane,
	out Interval dx,
	out Interval dy,
	out Interval dz
)
Public Function TryGetMappingBox (
	<OutAttribute> ByRef plane As Plane,
	<OutAttribute> ByRef dx As Interval,
	<OutAttribute> ByRef dy As Interval,
	<OutAttribute> ByRef dz As Interval
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
 The center of the box is at plane.origin and the sides of the box are parallel to the plane's coordinate planes.
dx
Type: Rhino.Geometry.Interval
 The "front" and "back" sides of the box are in spanned by the vectors plane.yaxis and plane.zaxis. The back plane contains the point plane.PointAt(dx[0],0,0) and the front plane contains the point plane.PointAt(dx[1],0,0).
dy
Type: Rhino.Geometry.Interval
 The "left" and "right" sides of the box are in spanned by the vectors plane.zaxis and plane.xaxis. The left plane contains the point plane.PointAt(0,dx[0],0) and the back plane contains the point plane.PointAt(0,dy[1],0).
dz
Type: Rhino.Geometry.Interval
 The "top" and "bottom" sides of the box are in spanned by the vectors plane.xaxis and plane.yaxis. The bottom plane contains the point plane.PointAt(0,0,dz[0]) and the top plane contains the point plane.PointAt(0,0,dz[1]).
Return Value
Type: Boolean
 Returns true if a valid box is returned.
Remarks
 Generally, GetMappingBox will not return the same parameters passed to SetBoxMapping. However, the location of the box will be the same.
See Also
Reference
TextureMapping Class
Rhino.Render Namespace