RhinoCommon SDK
UserData.MoveUserDataTo Method
Rhino for Mac 5.1
 Moves the user data.
See MoveUserDataFrom(CommonObject) for more information.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void MoveUserDataTo(
	CommonObject objectToGetUserData,
	Guid id,
	bool append
)
Public Shared Sub MoveUserDataTo (
	objectToGetUserData As CommonObject,
	id As Guid,
	append As Boolean
)
Parameters
objectToGetUserData
Type: Rhino.Runtime.CommonObject
Object data source.
id
Type: System.Guid
Target.
append
Type: System.Boolean
If the data should be appended or replaced.
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace