RhinoCommon SDK
ParticleSystem Properties
Rhino for Mac 5.1
The ParticleSystem type exposes the following members.
Properties
Name | Description
BoundingBox
DisplaySizesInWorldUnits
DrawRequiresDepthSorting
Top
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace