RhinoCommon SDK
Interval.IncludesParameter Method (Double)
Rhino for Mac 5.1
 Tests a parameter for Interval inclusion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IncludesParameter(
	double t
)
Public Function IncludesParameter (
	t As Double
) As Boolean
Parameters
t
Type: System.Double
Parameter to test.
Return Value
Type: Boolean
true if t is contained within or is coincident with the limits of this Interval.
See Also
Reference
Interval Structure
IncludesParameter Overload
Rhino.Geometry Namespace