RhinoCommon SDK
CustomDisplay.AddArc Method
Rhino for Mac 5.1
Overload List
Name | Description
AddArc(Arc)
 Adds a new, black arc to the display list.
AddArc(Arc, Color)
 Adds a new, colored arc to the display list.
AddArc(Arc, Color, Int32)
 Adds a new, colored arc to the display list.
Top
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace