RhinoCommon SDK
Intersection.PlaneCircle Method
Rhino for Mac 5.1
 Intersects a plane with a circle using exact calculations.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static PlaneCircleIntersection PlaneCircle(
	Plane plane,
	Circle circle,
	out double firstCircleParameter,
	out double secondCircleParameter
)
Public Shared Function PlaneCircle (
	plane As Plane,
	circle As Circle,
	<OutAttribute> ByRef firstCircleParameter As Double,
	<OutAttribute> ByRef secondCircleParameter As Double
) As PlaneCircleIntersection
Parameters
plane
Type: Rhino.Geometry.Plane
Plane to intersect.
circle
Type: Rhino.Geometry.Circle
Circe to intersect.
firstCircleParameter
Type: System.Double
First intersection parameter on circle if successful or RhinoMath.UnsetValue if not.
secondCircleParameter
Type: System.Double
Second intersection parameter on circle if successful or RhinoMath.UnsetValue if not.
Return Value
Type: PlaneCircleIntersection
The type of intersection that occured.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace