RhinoCommon SDK
ObjRef.Geometry Method
Rhino for Mac 5.1
 Gets the geometry linked to the object targeted by this reference.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GeometryBase Geometry()
Public Function Geometry As GeometryBase
Return Value
Type: GeometryBase
The geometry.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace