RhinoCommon SDK
CurveList.Insert Method (Int32, Line)
Rhino for Mac 5.1
 Inserts a line at a given index of this list.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Insert(
	int index,
	Line line
)
Public Sub Insert (
	index As Integer,
	line As Line
)
Parameters
index
Type: System.Int32
A 0-based position in the list.
line
Type: Rhino.Geometry.Line
The line value from which to construct the new curve.
See Also
Reference
CurveList Class
Insert Overload
Rhino.Collections Namespace