RhinoCommon SDK
Curve.LengthParameter Method (Double, Double, Double)
Rhino for Mac 5.1
 Gets the parameter along the curve which coincides with a given length along the curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool LengthParameter(
	double segmentLength,
	out double t,
	double fractionalTolerance
)
Public Function LengthParameter (
	segmentLength As Double,
	<OutAttribute> ByRef t As Double,
	fractionalTolerance As Double
) As Boolean
Parameters
segmentLength
Type: System.Double
 Length of segment to measure. Must be less than or equal to the length of the curve.
t
Type: System.Double
 Parameter such that the length of the curve from the curve start point to t equals s.
fractionalTolerance
Type: System.Double
 Desired fractional precision. fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Curve Class
LengthParameter Overload
Rhino.Geometry Namespace