RhinoCommon SDK
RhinoGet.GetGrip Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetGrip(Rhino.DocObjects.GripObject@,System.String)"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetGrip(
	out GripObject grip,
	string prompt
)
Public Shared Function GetGrip (
	<OutAttribute> ByRef grip As GripObject,
	prompt As String
) As Result
Parameters
grip
Type: Rhino.DocObjects.GripObject
[Missing <param name="grip"/> documentation for "M:Rhino.Input.RhinoGet.GetGrip(Rhino.DocObjects.GripObject@,System.String)"]
prompt
Type: System.String
[Missing <param name="prompt"/> documentation for "M:Rhino.Input.RhinoGet.GetGrip(Rhino.DocObjects.GripObject@,System.String)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetGrip(Rhino.DocObjects.GripObject@,System.String)"]
See Also
Reference
RhinoGet Class
Rhino.Input Namespace