RhinoCommon SDK
CalculateBoundingBoxEventArgs.BoundingBox Property
Rhino for Mac 5.1
 Gets the current bounding box.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
CalculateBoundingBoxEventArgs Class
Rhino.Display Namespace