RhinoCommon SDK
MeshVertexList.ToFloatArray Method
Rhino for Mac 5.1
 Copies all vertices to a linear array of float in x,y,z order
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public float[] ToFloatArray()
Public Function ToFloatArray As Single()
Return Value
Type: Single[]
The float array.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace