RhinoCommon SDK
BinaryArchiveWriter.WriteFont Method
Rhino for Mac 5.1
 Writes a Font value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteFont(
	Font value
)
Public Sub WriteFont (
	value As Font
)
Parameters
value
Type: System.Drawing.Font
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace