RhinoCommon SDK
DrawObjectEventArgs.DrawObject Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DrawObjectEventArgs.DrawObject"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DrawObject { get; set; }
Public Property DrawObject As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DrawObjectEventArgs Class
Rhino.Display Namespace