RhinoCommon SDK
Mesh.SetCachedTextureCoordinates Method
Rhino for Mac 5.1
 Set cached texture coordinates using the specified mapping.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetCachedTextureCoordinates(
	TextureMapping tm,
	ref Transform xf
)
Public Sub SetCachedTextureCoordinates (
	tm As TextureMapping,
	ByRef xf As Transform
)
Parameters
tm
Type: Rhino.Render.TextureMapping
[Missing <param name="tm"/> documentation for "M:Rhino.Geometry.Mesh.SetCachedTextureCoordinates(Rhino.Render.TextureMapping,Rhino.Geometry.Transform@)"]
xf
Type: Rhino.Geometry.Transform
[Missing <param name="xf"/> documentation for "M:Rhino.Geometry.Mesh.SetCachedTextureCoordinates(Rhino.Render.TextureMapping,Rhino.Geometry.Transform@)"]
See Also
Reference
Mesh Class
Rhino.Geometry Namespace