RhinoCommon SDK
Mesh.TopologyEdges Property
Rhino for Mac 5.1
 Gets the MeshTopologyEdgeList object associated with this mesh.
This object stores edge connectivity.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MeshTopologyEdgeList TopologyEdges { get; }
Public ReadOnly Property TopologyEdges As MeshTopologyEdgeList
	Get
Property Value
Type: MeshTopologyEdgeList
See Also
Reference
Mesh Class
Rhino.Geometry Namespace