RhinoCommon SDK
Panels.GetPanel Method
Rhino for Mac 5.1
 Will return an instance of a .Net panel if the panel has been displayed at least once. Panel instances are not created until a panel is displayed.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Object GetPanel(
	Guid panelId
)
Public Shared Function GetPanel (
	panelId As Guid
) As Object
Parameters
panelId
Type: System.Guid
 Class Id of the panel to search for.
Return Value
Type: Object
 Returns the one and only instance of a panel if it has been properly registered and displayed at least once. If the panel has never been displayed then null will be returned even if the panel is properly registered.
See Also
Reference
Panels Class
Rhino.UI Namespace