RhinoCommon SDK
Surface.IsCone Method
Rhino for Mac 5.1
Overload List
Name | Description
IsCone()
 Determines if the surface is a portion of a cone within RhinoMath.ZeroTolerance.
IsCone(Double)
Determines if the surface is a portion of a cone within a given tolerance.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace