RhinoCommon SDK
Matrix.RowCount Property
Rhino for Mac 5.1
 Gets the amount of rows.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int RowCount { get; }
Public ReadOnly Property RowCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Matrix Class
Rhino.Geometry Namespace