RhinoCommon SDK
Layer.IsChildOf Method (Layer)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(Rhino.DocObjects.Layer)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsChildOf(
	Layer otherLayer
)
Public Function IsChildOf (
	otherLayer As Layer
) As Boolean
Parameters
otherLayer
Type: Rhino.DocObjects.Layer
[Missing <param name="otherLayer"/> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(Rhino.DocObjects.Layer)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(Rhino.DocObjects.Layer)"]
See Also
Reference
Layer Class
IsChildOf Overload
Rhino.DocObjects Namespace