RhinoCommon SDK
RhinoView.ScreenToClient Method (Point2d)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.RhinoView.ScreenToClient(Rhino.Geometry.Point2d)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2d ScreenToClient(
	Point2d screenPoint
)
Public Function ScreenToClient (
	screenPoint As Point2d
) As Point2d
Parameters
screenPoint
Type: Rhino.Geometry.Point2d
[Missing <param name="screenPoint"/> documentation for "M:Rhino.Display.RhinoView.ScreenToClient(Rhino.Geometry.Point2d)"]
Return Value
Type: Point2d
[Missing <returns> documentation for "M:Rhino.Display.RhinoView.ScreenToClient(Rhino.Geometry.Point2d)"]
See Also
Reference
RhinoView Class
ScreenToClient Overload
Rhino.Display Namespace