RhinoCommon SDK
GetLine.EnableAllVariations Method
Rhino for Mac 5.1
 If true, then all line variations are shown if the default line mode is used
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableAllVariations(
	bool on
)
Public Sub EnableAllVariations (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Input.Custom.GetLine.EnableAllVariations(System.Boolean)"]
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace