RhinoCommon SDK
ShowPanelEventArgs Constructor
Rhino for Mac 5.1
Initializes a new instance of the ShowPanelEventArgs class
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ShowPanelEventArgs(
	Guid panelId,
	bool show
)
Public Sub New (
	panelId As Guid,
	show As Boolean
)
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.ShowPanelEventArgs.#ctor(System.Guid,System.Boolean)"]
show
Type: System.Boolean
[Missing <param name="show"/> documentation for "M:Rhino.UI.ShowPanelEventArgs.#ctor(System.Guid,System.Boolean)"]
See Also
Reference
ShowPanelEventArgs Class
Rhino.UI Namespace