RhinoCommon SDK
Box Structure
Rhino for Mac 5.1
 Represents the value of a plane and three intervals in an orthogonal, oriented box that is not necessarily parallel to the world Y, X, Z axes.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct Box : IEpsilonComparable<Box>
<SerializableAttribute>
Public Structure Box
	Implements IEpsilonComparable(Of Box)
The Box type exposes the following members.
Constructors
Name | Description
Box(BoundingBox)
 Initializes a new Box that mimics a BoundingBox struct.
The orientation plane of the Box is coincident with the World XY plane.
Box(Plane, BoundingBox)
 Initializes a world aligned box from a base plane and a boundingbox.
Box(Plane, GeometryBase)
 Initializes a box that contains a generic piece of geometry. This box will be aligned with an arbitrary plane.
Box(Plane, IEnumerable<Point3d>)
 Initializes the smallest box that contains a set of points.
Box(Plane, Interval, Interval, Interval)
 Initializes a new box from a base Plane and three Intervals.
Top
Properties
Name | Description
Area
 Gets the total surface area of this box.
BoundingBox
 Gets the world axis aligned Bounding box for this oriented box.
Center
 Gets the point that is in the center of the box.
Empty
 Empty Box. Empty boxes are considered to be invalid.
IsValid
 Gets the validity of this Box. Boxes are invalid when the base plane or any of the dimension intervals are invalid or decreasing.
Plane
 Gets or sets the orientation plane for this Box.
Unset
 Gets a Box whose base plane and axis dimensions are all Unset.
Volume
 Gets the total volume of this box.
X
 Gets or sets the Interval that describes the dimension of the Box along the orientation plane X-Axis. Otherwise known as the Width of the Box.
Y
 Gets or sets the Interval that describes the dimension of the Box along the orientation plane Y-Axis. Otherwise known as the Depth of the Box.
Z
 Gets or sets the Interval that describes the dimension of the Box along the orientation plane Z-Axis. Otherwise known as the Height of the Box.
Top
Methods
Name | Description
ClosestPoint
 Finds the closest point on or in the Box. The box should be Valid for this to work.
Contains(BoundingBox)
 Test a boundingbox for Box inclusion. This is the same as calling Contains(box,false)
Contains(Box)
 Test a box for Box inclusion. This is the same as calling Contains(box,false)
Contains(Point3d)
 Determines whether a point is included in this box. This is the same as calling Contains(point,false)
Contains(BoundingBox, Boolean)
 Test a boundingbox for Box inclusion.
Contains(Box, Boolean)
 Test a box for Box inclusion.
Contains(Point3d, Boolean)
 Determines whether a point is included in this box.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
FurthestPoint
 Finds the furthest point on the Box. The Box should be Valid for this to work properly.
GetCorners
 Gets an array of the 8 corner points of this box.
Inflate(Double)
 Inflates the box by a given offset in each direction. Inflating with negative amounts may result in decreasing boxes. InValid boxes cannot be inflated.
Inflate(Double, Double, Double)
 Inflates the box by a given offset in each direction. Inflating with negative amounts may result in decreasing boxes. InValid boxes cannot be inflated.
MakeValid
 Attempts to make the Box valid. This is not always possible.
PointAt
 Evaluates the box volume at the given unitized parameters.
The box has idealized side length of 1x1x1.
RepositionBasePlane
 Repositions the origin of the Base plane for this box without affecting the physical dimensions.
ToBrep
 Constructs a brep representation of this box.
Transform
 Transforms this Box using a Transformation matrix. If the Transform does not preserve Similarity, the dimensions of the resulting box cannot be trusted.
Union
 Constructs a union between this Box and the given point. This grows the box in directions so it contains the point.
Top
See Also
Reference
Rhino.Geometry Namespace