RhinoCommon SDK
BrepEdgeList.GetEnumerator Method
Rhino for Mac 5.1
 Gets an enumerator that visits all edges.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<BrepEdge> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepEdge)
Return Value
Type: IEnumerator<BrepEdge>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
BrepEdgeList Class
Rhino.Geometry.Collections Namespace