RhinoCommon SDK
GumballDisplayConduit.PickResult Property
Rhino for Mac 5.1
The inital mouse down event sets PickResult.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GumballPickResult PickResult { get; }
Public ReadOnly Property PickResult As GumballPickResult
	Get
Property Value
Type: GumballPickResult
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace