RhinoCommon SDK
NurbsSurfaceKnotList Class
Rhino for Mac 5.1
 Provides access to the knot vector of a nurbs surface.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.NurbsSurfaceKnotList
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class NurbsSurfaceKnotList : IEnumerable<double>,
	IEpsilonComparable<NurbsSurfaceKnotList>, IEnumerable
Public NotInheritable Class NurbsSurfaceKnotList
	Implements IEnumerable(Of Double), IEpsilonComparable(Of NurbsSurfaceKnotList),
	IEnumerable
The NurbsSurfaceKnotList type exposes the following members.
Properties
Name | Description
ClampedAtEnd
Determines if a knot vector is clamped.
ClampedAtStart
Determines if a knot vector is clamped.
Count
Gets the total number of knots in this curve.
Item
 Gets or sets the knot vector value at the given index.
Top
Methods
Name | Description
CreatePeriodicKnots
 Compute a clamped, uniform, periodic knot vector based on the current degree and control point count. Does not change values of control vertices.
CreateUniformKnots
 Compute a clamped, uniform knot vector based on the current degree and control point count. Does not change values of control vertices.
EnsurePrivateCopy
 If you want to keep a copy of this class around by holding onto it in a variable after a command completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can call this function as many times as you want.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
InsertKnot(Double)
 Inserts a knot and update control point locations. Does not change parameterization or locus of curve.
InsertKnot(Double, Int32)
 Inserts a knot and update control point locations. Does not change parameterization or locus of curve.
KnotMultiplicity
Get knot multiplicity.
SuperfluousKnot
 Computes the knots that are superfluous because they are not used in NURBs evaluation. These make it appear so that the first and last surface spans are different from interior spans.
http://wiki.mcneel.com/developer/onsuperfluousknot
Top
See Also
Reference
Rhino.Geometry.Collections Namespace