RhinoCommon SDK
RhinoObject.IsSubObjectSelected Method
Rhino for Mac 5.1
Check sub-object selection state.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSubObjectSelected(
	ComponentIndex componentIndex
)
Public Function IsSubObjectSelected (
	componentIndex As ComponentIndex
) As Boolean
Parameters
componentIndex
Type: Rhino.Geometry.ComponentIndex
Index of subobject to check.
Return Value
Type: Boolean
true if the subobject is selected.
Remarks
A subobject cannot be persistently selected.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace