RhinoCommon SDK
BinaryArchiveReader.ReadInterval Method
Rhino for Mac 5.1
 Reads a Interval from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interval ReadInterval()
Public Function ReadInterval As Interval
Return Value
Type: Interval
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace