RhinoCommon SDK
LayerTableEventArgs.LayerIndex Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LayerTableEventArgs.LayerIndex"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int LayerIndex { get; }
Public ReadOnly Property LayerIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
LayerTableEventArgs Class
Rhino.DocObjects.Tables Namespace