RhinoCommon SDK
MeshTopologyEdgeList.IsSwappableEdge Method
Rhino for Mac 5.1
 Determines if a mesh edge index is valid input for SwapEdge(Int32).
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSwappableEdge(
	int topologyEdgeIndex
)
Public Function IsSwappableEdge (
	topologyEdgeIndex As Integer
) As Boolean
Parameters
topologyEdgeIndex
Type: System.Int32
An index of a topology edge in TopologyEdges.
Return Value
Type: Boolean
true if edge can be swapped.
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace