RhinoCommon SDK
Surface.TryGetPlane Method
Rhino for Mac 5.1
Overload List
Name | Description
TryGetPlane(Plane)
Tests a surface for planarity and return the plane.
TryGetPlane(Plane, Double)
Tests a surface for planarity and return the plane.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace