RhinoCommon SDK
BrepFace.FaceIndex Property
Rhino for Mac 5.1
Index of face in Brep.Faces array.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int FaceIndex { get; }
Public ReadOnly Property FaceIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace