RhinoCommon SDK
TransformCommand.ResetGrips Method
Rhino for Mac 5.1
 Sets dynamic grip locations back to starting grip locations. This makes things like the Copy command work when grips are "copied".
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected void ResetGrips(
	TransformObjectList list
)
Protected Sub ResetGrips (
	list As TransformObjectList
)
Parameters
list
Type: Rhino.Collections.TransformObjectList
A list of object to transform. This is a special list type.
See Also
Reference
TransformCommand Class
Rhino.Commands Namespace