RhinoCommon SDK
ViewTable.GetViewList Method
Rhino for Mac 5.1
Gets an array of all the views.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoView[] GetViewList(
	bool includeStandardViews,
	bool includePageViews
)
Public Function GetViewList (
	includeStandardViews As Boolean,
	includePageViews As Boolean
) As RhinoView()
Parameters
includeStandardViews
Type: System.Boolean
true if "Right", "Perspective", etc., view should be included; false otherwise.
includePageViews
Type: System.Boolean
true if page-related views should be included; false otherwise.
Return Value
Type: RhinoView[]
A array of Rhino views. This array can be emptry, but not null.
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace