RhinoCommon SDK
Interval.Grow Method
Rhino for Mac 5.1
 Grows the Interval to include the given number.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Grow(
	double value
)
Public Sub Grow (
	value As Double
)
Parameters
value
Type: System.Double
Number to include in this interval.
See Also
Reference
Interval Structure
Rhino.Geometry Namespace