RhinoCommon SDK
Brep.IsSurface Property
Rhino for Mac 5.1
 Returns true if the Brep has a single face and that face is geometrically the same as the underlying surface. I.e., the face has trivial trimming.
In this case, the surface is the first face surface. The flag Brep.Faces[0].OrientationIsReversed records the correspondence between the surface's natural parametric orientation and the orientation of the Brep.
trivial trimming here means that there is only one loop curve in the brep and that loop curve is the same as the underlying surface boundary.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSurface { get; }
Public ReadOnly Property IsSurface As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Brep Class
Rhino.Geometry Namespace