RhinoCommon SDK
Interop.ToOnSurface Method
Rhino for Mac 5.1
 Constructs a Rhino_DotNet OnSurface that is a copy of a given curve.
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Object ToOnSurface(
	Surface source
)
Public Shared Function ToOnSurface (
	source As Surface
) As Object
Parameters
source
Type: Rhino.Geometry.Surface
A source brep.
Return Value
Type: Object
 Rhino_DotNet object on success. This will be an independent copy.
See Also
Reference
Interop Class
Rhino.Runtime Namespace