RhinoCommon SDK
SpaceMorph Methods
Rhino for Mac 5.1
The SpaceMorph type exposes the following members.
Methods
Name | Description
IsMorphable
 true if the geometry can be morphed by calling SpaceMorph.Morph(geometry)
Morph
Apply the space morph to geometry.
MorphPoint
Morphs an Euclidean point.
This method is abstract.
Top
See Also
Reference
SpaceMorph Class
Rhino.Geometry Namespace