RhinoCommon SDK
DrawForegroundEventArgs.DrawWorldAxes Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DrawForegroundEventArgs.DrawWorldAxes"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DrawWorldAxes { get; set; }
Public Property DrawWorldAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DrawForegroundEventArgs Class
Rhino.Display Namespace