RhinoCommon SDK
Material.GetEnvironmentTexture Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.GetEnvironmentTexture"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Texture GetEnvironmentTexture()
Public Function GetEnvironmentTexture As Texture
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.GetEnvironmentTexture"]
See Also
Reference
Material Class
Rhino.DocObjects Namespace