RhinoCommon SDK
ViewTable.Find Method (Guid)
Rhino for Mac 5.1
 Finds a view in this document with a given main viewport Id.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoView Find(
	Guid mainViewportId
)
Public Function Find (
	mainViewportId As Guid
) As RhinoView
Parameters
mainViewportId
Type: System.Guid
The ID of the main viewport looked for.
Return Value
Type: RhinoView
View on success. null if the view could not be found in this document.
See Also
Reference
ViewTable Class
Find Overload
Rhino.DocObjects.Tables Namespace