RhinoCommon SDK
CommandEventArgs.CommandId Property
Rhino for Mac 5.1
 Gets the ID of the command that raised this event.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid CommandId { get; }
Public ReadOnly Property CommandId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace