RhinoCommon SDK
Interval.IsIncreasing Property
Rhino for Mac 5.1
 Returns true if T0 < T1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsIncreasing { get; }
Public ReadOnly Property IsIncreasing As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Interval Structure
Rhino.Geometry Namespace