RhinoCommon SDK
Plane.Equals Method (Object)
Rhino for Mac 5.1
 Determines if an object is a plane and has the same components as this plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
An object.
Return Value
Type: Boolean
true if obj is a plane and has the same components as this plane; false otherwise.
See Also
Reference
Plane Structure
Equals Overload
Rhino.Geometry Namespace