RhinoCommon SDK
Curve.GetLength Method (Double, Interval)
Rhino for Mac 5.1
Get the length of a sub-section of the curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double GetLength(
	double fractionalTolerance,
	Interval subdomain
)
Public Function GetLength (
	fractionalTolerance As Double,
	subdomain As Interval
) As Double
Parameters
fractionalTolerance
Type: System.Double
 Desired fractional precision. fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
subdomain
Type: Rhino.Geometry.Interval
 The calculation is performed on the specified sub-domain of the curve (must be non-decreasing).
Return Value
Type: Double
The length of the sub-curve on success, or zero on failure.
See Also
Reference
Curve Class
GetLength Overload
Rhino.Geometry Namespace