RhinoCommon SDK
Sphere.FitSphereToPoints Method
Rhino for Mac 5.1
 Attempts to fit a sphere to a collection of points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Sphere FitSphereToPoints(
	IEnumerable<Point3d> points
)
Public Shared Function FitSphereToPoints (
	points As IEnumerable(Of Point3d)
) As Sphere
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to fit. The collection must contain at least two points.
Return Value
Type: Sphere
The Sphere that best approximates the points or Sphere.Unset on failure.
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace