RhinoCommon SDK
DimStyleTable.Item Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTable.Item(System.Int32)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DimensionStyle this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As DimensionStyle
	Get
Parameters
index
Type: System.Int32
Property Value
Type: DimensionStyle
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace