RhinoCommon SDK
DisplayPipeline.DrawLine Method (Line, Color)
Rhino for Mac 5.1
 Draws a single line object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawLine(
	Line line,
	Color color
)
Public Sub DrawLine (
	line As Line,
	color As Color
)
Parameters
line
Type: Rhino.Geometry.Line
Line to draw.
color
Type: System.Drawing.Color
Color to draw line in.
See Also
Reference
DisplayPipeline Class
DrawLine Overload
Rhino.Display Namespace