RhinoCommon SDK
Curve.ProjectToBrep Method (Curve, Brep, Vector3d, Double)
Rhino for Mac 5.1
 Projects a Curve onto a Brep along a given direction.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] ProjectToBrep(
	Curve curve,
	Brep brep,
	Vector3d direction,
	double tolerance
)
Public Shared Function ProjectToBrep (
	curve As Curve,
	brep As Brep,
	direction As Vector3d,
	tolerance As Double
) As Curve()
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to project.
brep
Type: Rhino.Geometry.Brep
Brep to project onto.
direction
Type: Rhino.Geometry.Vector3d
Direction of projection.
tolerance
Type: System.Double
Tolerance to use for projection.
Return Value
Type: Curve[]
An array of projected curves or empty array if the projection set is empty.
See Also
Reference
Curve Class
ProjectToBrep Overload
Rhino.Geometry Namespace