RhinoCommon SDK
ClippingPlaneSurface Properties
Rhino for Mac 5.1
The ClippingPlaneSurface type exposes the following members.
Properties
Name | Description
Plane
 Gets or sets the clipping plane.
Top
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace