RhinoCommon SDK
LineCurve Constructor (SerializationInfo, StreamingContext)
Rhino for Mac 5.1
 Protected constructor used in serialization.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected LineCurve(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
Serialization data.
context
Type: System.Runtime.Serialization.StreamingContext
Serialization stream.
See Also
Reference
LineCurve Class
LineCurve Overload
Rhino.Geometry Namespace