RhinoCommon SDK
BrepFace.ChangeSurface Method
Rhino for Mac 5.1
 Expert user tool that replaces the 3d surface geometry use by the face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ChangeSurface(
	int surfaceIndex
)
Public Function ChangeSurface (
	surfaceIndex As Integer
) As Boolean
Parameters
surfaceIndex
Type: System.Int32
brep surface index of new surface.
Return Value
Type: Boolean
true if successful.
Remarks
 If the face had a surface and new surface has a different shape, then you probably want to call something like RebuildEdges() to move the 3d edge curves so they will lie on the new surface. This doesn't delete the old surface; call Brep.CullUnusedSurfaces() or Brep.Compact() to remove unused surfaces.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace