RhinoCommon SDK
ObjectTable.AddCurve Method
Rhino for Mac 5.1
Overload List
Name | Description
AddCurve(Curve)
Adds a curve object to Rhino.
AddCurve(Curve, ObjectAttributes)
Adds a curve object to Rhino.
AddCurve(Curve, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace