RhinoCommon SDK
FileReadOptions.Finalize Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.FileIO.FileReadOptions.Finalize"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace