RhinoCommon SDK
DisplayPipeline.Draw3dText Method (Text3d, Color, Point3d)
Rhino for Mac 5.1
 Draws 3d text using the Text3d plane with an adjusted origin.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Draw3dText(
	Text3d text,
	Color color,
	Point3d textPlaneOrigin
)
Public Sub Draw3dText (
	text As Text3d,
	color As Color,
	textPlaneOrigin As Point3d
)
Parameters
text
Type: Rhino.Display.Text3d
The string to draw.
color
Type: System.Drawing.Color
Text color.
textPlaneOrigin
Type: Rhino.Geometry.Point3d
The origin of the plane to draw.
See Also
Reference
DisplayPipeline Class
Draw3dText Overload
Rhino.Display Namespace