RhinoCommon SDK
GripObject.Moved Property
Rhino for Mac 5.1
 true if the grip has moved from OriginalLocation.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Moved { get; }
Public ReadOnly Property Moved As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace