RhinoCommon SDK
Vector3d.Item Property
Rhino for Mac 5.1
 Gets or sets a vector component at the given index.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Double
	Get
	Set
Parameters
index
Type: System.Int32
Index of vector component. Valid values are:
0 = X-component
1 = Y-component
2 = Z-component
 .
Property Value
Type: Double
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace