RhinoCommon SDK
DisplayPipeline.ZBiasMode Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.ZBiasMode"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ZBiasMode ZBiasMode { get; set; }
Public Property ZBiasMode As ZBiasMode
	Get
	Set
Property Value
Type: ZBiasMode
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace