RhinoCommon SDK
ViewportInfo.SetCameraDirection Method
Rhino for Mac 5.1
 Sets the direction that the camera faces.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetCameraDirection(
	Vector3d direction
)
Public Function SetCameraDirection (
	direction As Vector3d
) As Boolean
Parameters
direction
Type: Rhino.Geometry.Vector3d
A new direction.
Return Value
Type: Boolean
true if the direction was set; otherwise false.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace