RhinoCommon SDK
GetObject.EnableIgnoreGrips Method
Rhino for Mac 5.1
 By default, post selection will select objects with grips on. If you do not want to be able to post select objects with grips on, then call EnableIgnoreGrips = false. The ability to preselect an object with grips on is determined by the value returned by the virtual RhinoObject.IsSelectableWithGripsOn.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableIgnoreGrips(
	bool enable
)
Public Sub EnableIgnoreGrips (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
[Missing <param name="enable"/> documentation for "M:Rhino.Input.Custom.GetObject.EnableIgnoreGrips(System.Boolean)"]
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace