RhinoCommon SDK
DisplayPipeline.PushDepthWriting Method
Rhino for Mac 5.1
 Push a DepthWriting flag on the engine's stack.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PushDepthWriting(
	bool enable
)
Public Sub PushDepthWriting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
DepthWriting flag.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace