RhinoCommon SDK
File3dmObject.Name Property
Rhino for Mac 5.1
 Gets or sets the Name of the object. Equivalent to this.Attributes.Name.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace