RhinoCommon SDK
MaterialRef.MaterialSource Property
Rhino for Mac 5.1
 Determines if the simple material should come from the object or from it's layer.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectMaterialSource MaterialSource { get; }
Public ReadOnly Property MaterialSource As ObjectMaterialSource
	Get
Property Value
Type: ObjectMaterialSource
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace