RhinoCommon SDK
Layer.ToString Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.ToString"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.ToString"]
See Also
Reference
Layer Class
Rhino.DocObjects Namespace