RhinoCommon SDK
BinaryArchiveReader.SeekFromStart Method
Rhino for Mac 5.1
 seek from start position ( like fseek( ,SEEK_SET) )
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SeekFromStart(
	ulong byteOffset
)
Public Function SeekFromStart (
	byteOffset As ULong
) As Boolean
Parameters
byteOffset
Type: System.UInt64
[Missing <param name="byteOffset"/> documentation for "M:Rhino.FileIO.BinaryArchiveReader.SeekFromStart(System.UInt64)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveReader.SeekFromStart(System.UInt64)"]
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace