RhinoCommon SDK
Curve.CreateControlPointCurve Method (IEnumerable<Point3d>)
Rhino for Mac 5.1
 Constructs a control-point of degree=3 (or less).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve CreateControlPointCurve(
	IEnumerable<Point3d> points
)
Public Shared Function CreateControlPointCurve (
	points As IEnumerable(Of Point3d)
) As Curve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Control points of curve.
Return Value
Type: Curve
[Missing <returns> documentation for "M:Rhino.Geometry.Curve.CreateControlPointCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
See Also
Reference
Curve Class
CreateControlPointCurve Overload
Rhino.Geometry Namespace