RhinoCommon SDK
Point3dList.ClosestIndex Method
Rhino for Mac 5.1
 Finds the index of the point that is closest to a test point in this list.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ClosestIndex(
	Point3d testPoint
)
Public Function ClosestIndex (
	testPoint As Point3d
) As Integer
Parameters
testPoint
Type: Rhino.Geometry.Point3d
point to compare against.
Return Value
Type: Int32
index of closest point in the list on success. -1 on error.
See Also
Reference
Point3dList Class
Rhino.Collections Namespace