RhinoCommon SDK
BrepTrim.Brep Property
Rhino for Mac 5.1
 Gets the Brep that owns this trim.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace