RhinoCommon SDK
GetLine.SecondPointPrompt Property
Rhino for Mac 5.1
Prompt when getting second point
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string SecondPointPrompt { get; set; }
Public Property SecondPointPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace