RhinoCommon SDK
NamedViewTable Class
Rhino for Mac 5.1
 All named views in a rhino document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.NamedViewTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class NamedViewTable : IEnumerable<ViewInfo>,
	IEnumerable
Public NotInheritable Class NamedViewTable
	Implements IEnumerable(Of ViewInfo), IEnumerable
The NamedViewTable type exposes the following members.
Properties
Name | Description
Count
Number of named views in the table.
Document
Document that owns this table.
Item
 Conceptually, the named view table is an array of ViewInfo and their associated names. The indexing operator ([] in C#) can be used to get individual ViewInfo items.
Top
Methods
Name | Description
Add(ViewInfo)
Add(String, Guid)
 Adds named view to document which is based on an existing viewport.
Delete(Int32)
Remove named view from the document.
Delete(String)
Remove named view from the document.
FindByName
Finds a named view.
GetEnumerator
Restore(Int32, RhinoView, Boolean)
 Sets the MainViewport of a standard RhinoView to a named views settings
Restore(Int32, RhinoViewport, Boolean)
RestoreAnimated(Int32, RhinoView, Boolean)
RestoreAnimated(Int32, RhinoViewport, Boolean)
RestoreAnimated(Int32, RhinoView, Boolean, Int32, Int32)
RestoreAnimated(Int32, RhinoViewport, Boolean, Int32, Int32)
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace