RhinoCommon SDK
GetPoint.Get Method
Rhino for Mac 5.1
Overload List
Name | Description
Get()
 After setting up options and so on, call GetPoint::Get to get a 3d point. The point is retrieved when the mouse goes down.
Get(Boolean)
 After setting up options and so on, call this method to get a 3d point.
Top
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace