RhinoCommon SDK
TextDot Constructor
Rhino for Mac 5.1
Overload List
Name | Description
TextDot(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
TextDot(String, Point3d)
 Initializes a new textdot based on the text and the location.
Top
See Also
Reference
TextDot Class
Rhino.Geometry Namespace