RhinoCommon SDK
Point2d.Multiply Method (Double, Point2d)
Rhino for Mac 5.1
 Multiplies a Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point2d Multiply(
	double t,
	Point2d point
)
Public Shared Function Multiply (
	t As Double,
	point As Point2d
) As Point2d
Parameters
t
Type: System.Double
A number.
point
Type: Rhino.Geometry.Point2d
A point.
Return Value
Type: Point2d
A new point that is coordinatewise multiplied by t.
See Also
Reference
Point2d Structure
Multiply Overload
Rhino.Geometry Namespace