RhinoCommon SDK
RenderSettings Constructor
Rhino for Mac 5.1
 Initializes a new instance of the RenderSettings class.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RenderSettings()
Public Sub New
See Also
Reference
RenderSettings Class
Rhino.Render Namespace