RhinoCommon SDK
Cylinder.Height1 Property
Rhino for Mac 5.1
 Gets or sets the start height of the cylinder.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Height1 { get; set; }
Public Property Height1 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace