RhinoCommon SDK
RhinoView.EnableDrawing Property
Rhino for Mac 5.1
 Gets or sets the 'drawing enabled' flag. By default, drawing is enabled.
There are some rare situations where scipts want to disable drawing for a while.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool EnableDrawing { get; set; }
Public Shared Property EnableDrawing As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoView Class
Rhino.Display Namespace