RhinoCommon SDK
ArcCurve.AngleDegrees Property
Rhino for Mac 5.1
 Gets the angles of this arc in degrees.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double AngleDegrees { get; }
Public ReadOnly Property AngleDegrees As Double
	Get
Property Value
Type: Double
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace