RhinoCommon SDK
Point.Location Property
Rhino for Mac 5.1
 Gets or sets the location (position) of this point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d Location { get; set; }
Public Property Location As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Point Class
Rhino.Geometry Namespace