RhinoCommon SDK
Box Constructor (Plane, BoundingBox)
Rhino for Mac 5.1
 Initializes a world aligned box from a base plane and a boundingbox.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Box(
	Plane basePlane,
	BoundingBox boundingbox
)
Public Sub New (
	basePlane As Plane,
	boundingbox As BoundingBox
)
Parameters
basePlane
Type: Rhino.Geometry.Plane
Base plane of bounging box.
boundingbox
Type: Rhino.Geometry.BoundingBox
Bounding Box in plane coordinates.
See Also
Reference
Box Structure
Box Overload
Rhino.Geometry Namespace