RhinoCommon SDK
File3dmObjectTable.GetEnumerator Method
Rhino for Mac 5.1
 Gets the enumerator that visits any File3dmObject in this table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<File3dmObject> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of File3dmObject)
Return Value
Type: IEnumerator<File3dmObject>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace