RhinoCommon SDK
HostUtils.DebugDumpToString Method (BezierCurve)
Rhino for Mac 5.1
 Gets the debug dumps. This is a text description of the geometric contents. DebugDump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string DebugDumpToString(
	BezierCurve bezierCurve
)
Public Shared Function DebugDumpToString (
	bezierCurve As BezierCurve
) As String
Parameters
bezierCurve
Type: Rhino.Geometry.BezierCurve
curve to evaluate
Return Value
Type: String
A debug dump text.
See Also
Reference
HostUtils Class
DebugDumpToString Overload
Rhino.Runtime Namespace