RhinoCommon SDK
Curve.PlanarCurveCollision Method
Rhino for Mac 5.1
 Determines if two coplanar curves collide (intersect).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool PlanarCurveCollision(
	Curve curveA,
	Curve curveB,
	Plane testPlane,
	double tolerance
)
Public Shared Function PlanarCurveCollision (
	curveA As Curve,
	curveB As Curve,
	testPlane As Plane,
	tolerance As Double
) As Boolean
Parameters
curveA
Type: Rhino.Geometry.Curve
A curve.
curveB
Type: Rhino.Geometry.Curve
Another curve.
testPlane
Type: Rhino.Geometry.Plane
A valid plane containing the curves.
tolerance
Type: System.Double
A tolerance value for intersection.
Return Value
Type: Boolean
true if the curves intersect, otherwise false
See Also
Reference
Curve Class
Rhino.Geometry Namespace