RhinoCommon SDK
HatchObject Properties
Rhino for Mac 5.1
The HatchObject type exposes the following members.
Properties
Name | Description
HatchGeometry
Top
See Also
Reference
HatchObject Class
Rhino.DocObjects Namespace