RhinoCommon SDK
Hatch.Create Method
Rhino for Mac 5.1
Overload List
Name | Description
Create(Curve, Int32, Double, Double)
 Constructs an array of hatches from one curve.
Create(IEnumerable<Curve>, Int32, Double, Double)
 Constructs an array of hatches from a set of curves.
Top
See Also
Reference
Hatch Class
Rhino.Geometry Namespace