RhinoCommon SDK
Surface.Fit Method
Rhino for Mac 5.1
Fits a new surface through an existing surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface Fit(
	int uDegree,
	int vDegree,
	double fitTolerance
)
Public Function Fit (
	uDegree As Integer,
	vDegree As Integer,
	fitTolerance As Double
) As Surface
Parameters
uDegree
Type: System.Int32
the output surface U degree. Must be bigger than 1.
vDegree
Type: System.Int32
the output surface V degree. Must be bigger than 1.
fitTolerance
Type: System.Double
The fitting tolerance.
Return Value
Type: Surface
A surface, or null on error.
See Also
Reference
Surface Class
Rhino.Geometry Namespace