RhinoCommon SDK
SurfaceCurvature.UVPoint Property
Rhino for Mac 5.1
 Gets the UV location where the curvature was computed.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2d UVPoint { get; }
Public ReadOnly Property UVPoint As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace