RhinoCommon SDK
Surface.Transpose Method (Boolean)
Rhino for Mac 5.1
 Transposes surface parameterization (swap U and V)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface Transpose(
	bool inPlace
)
Public Function Transpose (
	inPlace As Boolean
) As Surface
Parameters
inPlace
Type: System.Boolean
[Missing <param name="inPlace"/> documentation for "M:Rhino.Geometry.Surface.Transpose(System.Boolean)"]
Return Value
Type: Surface
New transposed surface on success, null on failure.
See Also
Reference
Surface Class
Transpose Overload
Rhino.Geometry Namespace