RhinoCommon SDK
FileReadOptions.Dispose Method
Rhino for Mac 5.1
Overload List
Name | Description
Dispose()
Releases all resources used by the FileReadOptions
Dispose(Boolean)
Releases the unmanaged resources used by the FileReadOptions and optionally releases the managed resources
Top
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace