RhinoCommon SDK
BrepObject Properties
Rhino for Mac 5.1
The BrepObject type exposes the following members.
Properties
Name | Description
BrepGeometry
 Gets the brep geometry linked with this object.
Top
See Also
Reference
BrepObject Class
Rhino.DocObjects Namespace