RhinoCommon SDK
Curve.PullToMesh Method
Rhino for Mac 5.1
 Makes a polyline approximation of the curve and gets the closest point on the mesh for each point on the curve. Then it "connects the points" so that you have a polyline on the mesh.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PolylineCurve PullToMesh(
	Mesh mesh,
	double tolerance
)
Public Function PullToMesh (
	mesh As Mesh,
	tolerance As Double
) As PolylineCurve
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to project onto.
tolerance
Type: System.Double
Input tolerance (RhinoDoc.ModelAbsoluteTolerance is a good default)
Return Value
Type: PolylineCurve
A polyline curve on success, null on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace