RhinoCommon SDK
LinetypeTable.Delete Method
Rhino for Mac 5.1
Overload List
Name | Description
Delete(IEnumerable<Int32>, Boolean)
Deletes multiple linetypes.
Delete(Int32, Boolean)
Deletes linetype.
Top
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace