RhinoCommon SDK
ObjectTable.Select Method (ObjRef)
Rhino for Mac 5.1
 Select a single object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Select(
	ObjRef objref
)
Public Function Select (
	objref As ObjRef
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
Object represented by this ObjRef is selected.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
ObjectTable Class
Select Overload
Rhino.DocObjects.Tables Namespace