RhinoCommon SDK
HistoryRecord.SetDoubles Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetDoubles(System.Int32,System.Collections.Generic.IEnumerable{System.Double})"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetDoubles(
	int id,
	IEnumerable<double> values
)
Public Function SetDoubles (
	id As Integer,
	values As IEnumerable(Of Double)
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetDoubles(System.Int32,System.Collections.Generic.IEnumerable{System.Double})"]
values
Type: System.Collections.Generic.IEnumerable<Double>
[Missing <param name="values"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetDoubles(System.Int32,System.Collections.Generic.IEnumerable{System.Double})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetDoubles(System.Int32,System.Collections.Generic.IEnumerable{System.Double})"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace