RhinoCommon SDK
OptionsDialogPage Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.OptionsDialogPage"]
Inheritance Hierarchy
System.Object
 Rhino.UI.StackedDialogPage
 Rhino.UI.OptionsDialogPage
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class OptionsDialogPage : StackedDialogPage
Public MustInherit Class OptionsDialogPage
	Inherits StackedDialogPage
The OptionsDialogPage type exposes the following members.
Constructors
Name | Description
OptionsDialogPage
Initializes a new instance of the OptionsDialogPage class
Top
Properties
Name | Description
Top
Methods
Name | Description
RunScript
Top
See Also
Reference
Rhino.UI Namespace