RhinoCommon SDK
RhinoObjectEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.RhinoObjectEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoObjectEventArgs
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class RhinoObjectEventArgs : EventArgs
Public Class RhinoObjectEventArgs
	Inherits EventArgs
The RhinoObjectEventArgs type exposes the following members.
Properties
Name | Description
ObjectId
TheObject
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace