RhinoCommon SDK
ToolbarGroup.Id Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.ToolbarGroup.Id"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ToolbarGroup Class
Rhino.UI Namespace