RhinoCommon SDK
Texture Constructor
Rhino for Mac 5.1
 Initializes a new texture.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Texture()
Public Sub New
See Also
Reference
Texture Class
Texture Overload
Rhino.DocObjects Namespace