RhinoCommon SDK
HistoryRecord.SetPoint3ds Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetPoint3ds(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetPoint3ds(
	int id,
	IEnumerable<Point3d> values
)
Public Function SetPoint3ds (
	id As Integer,
	values As IEnumerable(Of Point3d)
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetPoint3ds(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
values
Type: System.Collections.Generic.IEnumerable<Point3d>
[Missing <param name="values"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetPoint3ds(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetPoint3ds(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace