RhinoCommon SDK
Rectangle3d.PointAt Method (Double)
Rhino for Mac 5.1
 Gets a point along the rectangle boundary.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAt(
	double t
)
Public Function PointAt (
	t As Double
) As Point3d
Parameters
t
Type: System.Double
Parameter along rectangle boundary. Valid values range from 0.0 to 4.0, where each integer domain represents a single boundary edge.
Return Value
Type: Point3d
The point at the given boundary parameter.
See Also
Reference
Rectangle3d Structure
PointAt Overload
Rhino.Geometry Namespace