RhinoCommon SDK
GetBaseClass.SetDefaultNumber Method
Rhino for Mac 5.1
 Sets a number as default value that will be returned if the user presses ENTER key during the get.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetDefaultNumber(
	double defaultNumber
)
Public Sub SetDefaultNumber (
	defaultNumber As Double
)
Parameters
defaultNumber
Type: System.Double
value for default number.
Remarks
 Calling SetDefaultNumber will automatically handle setting the command prompt default and reacting to the user pressing ENTER. If the user presses ENTER to accept the default number, GetResult.Number is returned and RhinoGet.GotDefault() will return true. Calling SetDefaultNumber will clear any previous calls to SetDefaultString or SetDefaultPoint.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace