RhinoCommon SDK
GripObject Properties
Rhino for Mac 5.1
The GripObject type exposes the following members.
Properties
Name | Description
CurrentLocation
Index
Moved
 true if the grip has moved from OriginalLocation.
OriginalLocation
OwnerId
Weight
 The weight of a NURBS control point grip or RhinoMath.UnsetValue if the grip is not a NURBS control point grip.
Top
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace