RhinoCommon SDK
Sphere.NorthPole Property
Rhino for Mac 5.1
 Gets the point at the North Pole of the sphere.
This is the parameterization singularity that can be obtained, at V value +Math.Pi/2.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d NorthPole { get; }
Public ReadOnly Property NorthPole As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace