RhinoCommon SDK
HistoryRecord Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.HistoryRecord"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.HistoryRecord
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class HistoryRecord : IDisposable
Public Class HistoryRecord
	Implements IDisposable
The HistoryRecord type exposes the following members.
Constructors
Name | Description
HistoryRecord
Initializes a new instance of the HistoryRecord class
Top
Properties
Name | Description
Handle
 Wrapped native C++ pointer to CRhinoHistory instance
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
SetBool
SetBools
SetBrep
SetColor
SetColors
SetCurve
SetDouble
SetDoubles
SetGuid
SetGuids
SetInt
SetInts
SetMesh
SetObjRef
SetPoint3d
SetPoint3dOnObject
SetPoint3ds
SetString
SetStrings
SetSurface
SetTransorm
SetVector3d
SetVector3ds
Top
See Also
Reference
Rhino.DocObjects Namespace