RhinoCommon SDK
BinaryArchiveWriter.WriteGeometry Method
Rhino for Mac 5.1
 Writes a GeometryBase value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteGeometry(
	GeometryBase value
)
Public Sub WriteGeometry (
	value As GeometryBase
)
Parameters
value
Type: Rhino.Geometry.GeometryBase
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace