RhinoCommon SDK
SweepTwoRail Constructor
Rhino for Mac 5.1
Initializes a new instance of the SweepTwoRail class
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public SweepTwoRail()
Public Sub New
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace