RhinoCommon SDK
DimensionStyle Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.DimensionStyle"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.DimensionStyle
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class DimensionStyle : CommonObject
<SerializableAttribute>
Public Class DimensionStyle
	Inherits CommonObject
The DimensionStyle type exposes the following members.
Constructors
Name | Description
DimensionStyle()
Initializes a new instance of the DimensionStyle class
DimensionStyle(SerializationInfo, StreamingContext)
Initializes a new instance of the DimensionStyle class
Top
Properties
Name | Description
AlternateLengthFactor
AngleResolution
ArrowLength
ArrowType
CenterMarkSize
ExtensionLineExtension
ExtensionLineOffset
FontIndex
Id
Index
IsReference
LeaderArrowLength
LeaderArrowType
LengthFactor
LengthFormat
LengthResolution
Linear display precision.
Name
Prefix
Suffix
TextAlignment
TextGap
TextHeight
Top
Methods
Name | Description
CommitChanges
Top
See Also
Reference
Rhino.DocObjects Namespace