RhinoCommon SDK
ViewportInfo.IsFrustumTopBottomSymmetric Property
Rhino for Mac 5.1
 Gets or sets a value that indicates whether the camera frustum has a horizontal symmetry axis.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsFrustumTopBottomSymmetric { get; set; }
Public Property IsFrustumTopBottomSymmetric As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace