RhinoCommon SDK
DisplayPipeline.PopModelTransform Method
Rhino for Mac 5.1
 Pop a model transformation off the engine's model transform stack.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PopModelTransform()
Public Sub PopModelTransform
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace