RhinoCommon SDK
ZBufferCapture Constructor
Rhino for Mac 5.1
Initializes a new instance of the ZBufferCapture class
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ZBufferCapture(
	RhinoViewport viewport
)
Public Sub New (
	viewport As RhinoViewport
)
Parameters
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.Display.ZBufferCapture.#ctor(Rhino.Display.RhinoViewport)"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace