RhinoCommon SDK
MaterialTable.Add Method
Rhino for Mac 5.1
Overload List
Name | Description
Add()
 Adds a new material to the table based on the default material.
Add(Material)
 Adds a new material to the table based on a given material.
Add(Material, Boolean)
 Adds a new material to the table based on a given material.
Top
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace