RhinoCommon SDK
BitmapEntry.Save Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.BitmapEntry.Save(System.String)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Save(
	string fileName
)
Public Function Save (
	fileName As String
) As Boolean
Parameters
fileName
Type: System.String
[Missing <param name="fileName"/> documentation for "M:Rhino.DocObjects.BitmapEntry.Save(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.BitmapEntry.Save(System.String)"]
See Also
Reference
BitmapEntry Class
Rhino.DocObjects Namespace