RhinoCommon SDK
Dialogs.ShowMessage Method (String, String, ShowMessageButton, ShowMessageIcon)
Rhino for Mac 5.1
 Same as System.Windows.Froms.MessageBox.Show but using a message box tailored to Rhino.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ShowMessageResult ShowMessage(
	string message,
	string title,
	ShowMessageButton buttons,
	ShowMessageIcon icon
)
Public Shared Function ShowMessage (
	message As String,
	title As String,
	buttons As ShowMessageButton,
	icon As ShowMessageIcon
) As ShowMessageResult
Parameters
message
Type: System.String
Message box text content.
title
Type: System.String
Message box title text.
buttons
Type: Rhino.UI.ShowMessageButton
Which buttons to display in the message box.
icon
Type: Rhino.UI.ShowMessageIcon
Which icon to display in the message box.
Return Value
Type: ShowMessageResult
One of the ShowMessageBoxResult values.
See Also
Reference
Dialogs Class
ShowMessage Overload
Rhino.UI Namespace