RhinoCommon SDK
NurbsSurface Constructor (NurbsSurface)
Rhino for Mac 5.1
 Initializes a new NURBS surface by copying the values from another surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsSurface(
	NurbsSurface other
)
Public Sub New (
	other As NurbsSurface
)
Parameters
other
Type: Rhino.Geometry.NurbsSurface
Another surface.
See Also
Reference
NurbsSurface Class
NurbsSurface Overload
Rhino.Geometry Namespace