RhinoCommon SDK
Material.IsDefaultMaterial Property
Rhino for Mac 5.1
 By default Rhino layers and objects are assigned the default rendering material.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsDefaultMaterial { get; }
Public ReadOnly Property IsDefaultMaterial As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Material Class
Rhino.DocObjects Namespace