RhinoCommon SDK
DisplayPipeline.DrawPoint Method
Rhino for Mac 5.1
Overload List
Name | Description
DrawPoint(Point3d, Color)
Draws a point with a given radius, style and color.
DrawPoint(Point3d, PointStyle, Int32, Color)
Draws a point with a given radius, style and color.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace