RhinoCommon SDK
Texture.TextureCombineMode Property
Rhino for Mac 5.1
 Determines how this texture is combined with others in a material's texture list.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TextureCombineMode TextureCombineMode { get; set; }
Public Property TextureCombineMode As TextureCombineMode
	Get
	Set
Property Value
Type: TextureCombineMode
See Also
Reference
Texture Class
Rhino.DocObjects Namespace