RhinoCommon SDK
CustomUndoEventArgs Properties
Rhino for Mac 5.1
The CustomUndoEventArgs type exposes the following members.
Properties
Name | Description
ActionDescription
CommandId
CreatedByRedo
Document
Tag
UndoSerialNumber
Top
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace