RhinoCommon SDK
RhinoView.Document Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.RhinoView.Document"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoView Class
Rhino.Display Namespace