RhinoCommon SDK
DisplayBitmap.Load Method
Rhino for Mac 5.1
 Load a DisplayBitmap from and image file on disk.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static DisplayBitmap Load(
	string path
)
Public Shared Function Load (
	path As String
) As DisplayBitmap
Parameters
path
Type: System.String
A location from which to load the file.
Return Value
Type: DisplayBitmap
The new display bitmap, or null on error.
See Also
Reference
DisplayBitmap Class
Rhino.Display Namespace