RhinoCommon SDK
AngularDimension Constructor (Arc, Double)
Rhino for Mac 5.1
 Create an angular dimension from a give arc
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public AngularDimension(
	Arc arc,
	double offset
)
Public Sub New (
	arc As Arc,
	offset As Double
)
Parameters
arc
Type: Rhino.Geometry.Arc
The start and end points of the arc are the start and endpoints of the dimension
offset
Type: System.Double
How far to offset the dimension location from the arc
See Also
Reference
AngularDimension Class
AngularDimension Overload
Rhino.Geometry Namespace