RhinoCommon SDK
BinaryArchiveReader.ReadRectangleF Method
Rhino for Mac 5.1
 Reads a RectangleF from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RectangleF ReadRectangleF()
Public Function ReadRectangleF As RectangleF
Return Value
Type: RectangleF
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace