RhinoCommon SDK
File3dmObjectTable Properties
Rhino for Mac 5.1
The File3dmObjectTable type exposes the following members.
Properties
Name | Description
Count
 Gets the number of File3dmObjects in this table.
Item
 Gets the File3dmObject at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace