RhinoCommon SDK
MeshClash.ClashRadius Property
Rhino for Mac 5.1
 Gets the clash, or intersection, radius.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ClashRadius { get; }
Public ReadOnly Property ClashRadius As Double
	Get
Property Value
Type: Double
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace