RhinoCommon SDK
Brep.TryConvertBrep Method
Rhino for Mac 5.1
 Attempts to convert a generic Geometry object into a Brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep TryConvertBrep(
	GeometryBase geometry
)
Public Shared Function TryConvertBrep (
	geometry As GeometryBase
) As Brep
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
Geometry to convert, not all types of GeometryBase can be represented by BReps.
Return Value
Type: Brep
Brep if a brep form could be created or null if this is not possible. If geometry was of type Brep to begin with, the same object is returned, i.e. it is not duplicated.
See Also
Reference
Brep Class
Rhino.Geometry Namespace