RhinoCommon SDK
BrepObject Methods
Rhino for Mac 5.1
The BrepObject type exposes the following members.
Methods
Name | Description
DuplicateBrepGeometry
 Constructs a new deep copy of the brep geometry.
Top
See Also
Reference
BrepObject Class
Rhino.DocObjects Namespace