RhinoCommon SDK
GroupTable.AddToGroup Method (Int32, Guid)
Rhino for Mac 5.1
 Adds an object to an existing group.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool AddToGroup(
	int groupIndex,
	Guid objectId
)
Public Function AddToGroup (
	groupIndex As Integer,
	objectId As Guid
) As Boolean
Parameters
groupIndex
Type: System.Int32
The group index value.
objectId
Type: System.Guid
An ID of an object.
Return Value
Type: Boolean
true if the operation was successful.
See Also
Reference
GroupTable Class
AddToGroup Overload
Rhino.DocObjects.Tables Namespace