RhinoCommon SDK
Quaternion.SetRotation Method (Double, Vector3d)
Rhino for Mac 5.1
 Sets the quaternion to cos(angle/2), sin(angle/2)*x, sin(angle/2)*y, sin(angle/2)*z where (x,y,z) is the unit vector parallel to axis. This is the unit quaternion that represents the rotation of angle about axis.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetRotation(
	double angle,
	Vector3d axisOfRotation
)
Public Sub SetRotation (
	angle As Double,
	axisOfRotation As Vector3d
)
Parameters
angle
Type: System.Double
in radians.
axisOfRotation
Type: Rhino.Geometry.Vector3d
The direction of the axis of rotation.
See Also
Reference
Quaternion Structure
SetRotation Overload
Rhino.Geometry Namespace