RhinoCommon SDK
File3dmTypeCodes.TCODE_RH_SPOTLIGHT Field
Rhino for Mac 5.1
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RH_SPOTLIGHT"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_RH_SPOTLIGHT
Public Const TCODE_RH_SPOTLIGHT As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace