RhinoCommon SDK
GeometryBase.IsDeformable Property
Rhino for Mac 5.1
 true if object can be accurately modified with "squishy" transformations like projections, shears, and non-uniform scaling.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsDeformable { get; }
Public ReadOnly Property IsDeformable As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace