RhinoCommon SDK
NurbsCurve.GrevillePoint Method
Rhino for Mac 5.1
 Gets the greville (edit point) parameter that belongs to the control point at the specified index.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d GrevillePoint(
	int index
)
Public Function GrevillePoint (
	index As Integer
) As Point3d
Parameters
index
Type: System.Int32
Index of Greville (Edit) point.
Return Value
Type: Point3d
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurve.GrevillePoint(System.Int32)"]
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace