RhinoCommon SDK
Polyline.TangentAt Method
Rhino for Mac 5.1
 Gets the unit tangent vector along the polyline at the given parameter. The integer part of the parameter indicates the index of the segment.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d TangentAt(
	double t
)
Public Function TangentAt (
	t As Double
) As Vector3d
Parameters
t
Type: System.Double
Polyline parameter.
Return Value
Type: Vector3d
The tangent along the polyline at t.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace