RhinoCommon SDK
ViewportInfo.Extents Method
Rhino for Mac 5.1
Overload List
Name | Description
Extents(Double, BoundingBox)
 Extends this viewport view to include a bounding box.
Use Extents() as a quick way to set a viewport to so that bounding volume is inside of a viewports frustrum. The view angle is used to determine the position of the camera.
Extents(Double, Sphere)
 Extends this viewport view to include a sphere.
Use Extents() as a quick way to set a viewport to so that bounding volume is inside of a viewports frustrum. The view angle is used to determine the position of the camera.
Top
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace