RhinoCommon SDK
GetColorEventArgs.SelectedColor Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.GetColorEventArgs.SelectedColor"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color SelectedColor { get; set; }
Public Property SelectedColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GetColorEventArgs Class
Rhino.UI Namespace