RhinoCommon SDK
FileReadOptions.OpenMode Property
Rhino for Mac 5.1
 true means we are reading the information into an empty document. This means you need to consider things like:
Setting the unit system (if the file has a unit system)
Creating a default layer if one is not there.
Setting up appropriate views when you're finished reading.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool OpenMode { get; set; }
Public Property OpenMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace