RhinoCommon SDK
MeshingParameters.DocumentCurrentSetting Method
Rhino for Mac 5.1
 Gets the MeshingParameters that are currently set for a document. These are the same settings that are shown in the DocumentProperties "mesh settings" user interface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static MeshingParameters DocumentCurrentSetting(
	RhinoDoc doc
)
Public Shared Function DocumentCurrentSetting (
	doc As RhinoDoc
) As MeshingParameters
Parameters
doc
Type: Rhino.RhinoDoc
A Rhino document to query.
Return Value
Type: MeshingParameters
Meshing parameters of the document.
Exceptions
Exception | Condition
ArgumentNullException | If doc is null.
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace