RhinoCommon SDK
DetailViewObject Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.DetailViewObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.DetailViewObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class DetailViewObject : RhinoObject
Public Class DetailViewObject
	Inherits RhinoObject
The DetailViewObject type exposes the following members.
Properties
Name | Description
DetailGeometry
IsActive
Viewport
Top
Methods
Name | Description
CommitViewportChanges
Top
See Also
Reference
Rhino.DocObjects Namespace