RhinoCommon SDK
HistoryRecord.SetInts Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInts(System.Int32,System.Collections.Generic.IEnumerable{System.Int32})"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetInts(
	int id,
	IEnumerable<int> values
)
Public Function SetInts (
	id As Integer,
	values As IEnumerable(Of Integer)
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInts(System.Int32,System.Collections.Generic.IEnumerable{System.Int32})"]
values
Type: System.Collections.Generic.IEnumerable<Int32>
[Missing <param name="values"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInts(System.Int32,System.Collections.Generic.IEnumerable{System.Int32})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInts(System.Int32,System.Collections.Generic.IEnumerable{System.Int32})"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace