RhinoCommon SDK
Circle.BoundingBox Property
Rhino for Mac 5.1
 Gets the circle's 3d axis aligned bounding box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Return Value
Type: BoundingBox
3d bounding box.
See Also
Reference
Circle Structure
Rhino.Geometry Namespace