RhinoCommon SDK
MeshObject.SetMesh Method
Rhino for Mac 5.1
 Only for developers who are defining custom subclasses of MeshObject. Directly sets the internal mesh geometry for this object. Note that this function does not work with Rhino's "undo".
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected Mesh SetMesh(
	Mesh mesh
)
Protected Function SetMesh (
	mesh As Mesh
) As Mesh
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.DocObjects.MeshObject.SetMesh(Rhino.Geometry.Mesh)"]
Return Value
Type: Mesh
 The old mesh geometry that was set for this object
Remarks
 Note that this function does not work with Rhino's "undo". The typical approach for adjusting the mesh geometry is to modify the object that you get when you call the MeshGeometry property and then call CommitChanges.
See Also
Reference
MeshObject Class
Rhino.DocObjects Namespace