RhinoCommon SDK
Brep.CapPlanarHoles Method
Rhino for Mac 5.1
 Returns a new Brep that is equivalent to this Brep with all planar holes capped.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep CapPlanarHoles(
	double tolerance
)
Public Function CapPlanarHoles (
	tolerance As Double
) As Brep
Parameters
tolerance
Type: System.Double
Tolerance to use for capping.
Return Value
Type: Brep
New brep on success. null on error.
See Also
Reference
Brep Class
Rhino.Geometry Namespace