RhinoCommon SDK
ViewportInfo.CameraLocation Property
Rhino for Mac 5.1
 Gets the camera location (position) point.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d CameraLocation { get; }
Public ReadOnly Property CameraLocation As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace