RhinoCommon SDK
FlowSpaceMorph Constructor
Rhino for Mac 5.1
Overload List
Name | Description
FlowSpaceMorph(Curve, Curve, Boolean)
 Constructs a flow space morph.
FlowSpaceMorph(Curve, Curve, Boolean, Boolean, Boolean)
 Constructs a flow space morph.
Top
See Also
Reference
FlowSpaceMorph Class
Rhino.Geometry.Morphs Namespace