RhinoCommon SDK
Dialogs.ShowComboListBox Method
Rhino for Mac 5.1
 Displays Rhino's combo list box.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Object ShowComboListBox(
	string title,
	string message,
	IList items
)
Public Shared Function ShowComboListBox (
	title As String,
	message As String,
	items As IList
) As Object
Parameters
title
Type: System.String
The dialog title.
message
Type: System.String
The dialog message.
items
Type: System.Collections.IList
A list of items to show.
Return Value
Type: Object
selected item.
null if the user canceled.
See Also
Reference
Dialogs Class
Rhino.UI Namespace