RhinoCommon SDK
PointCloudItem.Index Property
Rhino for Mac 5.1
 Gets the index of this point cloud item.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace