RhinoCommon SDK
CachedTextureCoordinates.Clear Method
Rhino for Mac 5.1
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace