RhinoCommon SDK
Line.ToNurbsCurve Method
Rhino for Mac 5.1
 Constructs a nurbs curve representation of this line. This amounts to the same as calling NurbsCurve.CreateFromLine().
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsCurve ToNurbsCurve()
Public Function ToNurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
A nurbs curve representation of this line or null if no such representation could be made.
See Also
Reference
Line Structure
Rhino.Geometry Namespace