RhinoCommon SDK
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes"]
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class ViewDisplayAttributes
Public NotInheritable Class ViewDisplayAttributes
The DisplayPipelineAttributes.ViewDisplayAttributes type exposes the following members.
Properties
Name | Description
BlendGrid
DrawGrid
DrawGridAxes
DrawTransparentGridPlane
DrawWorldAxes
DrawZAxis
HorizontalViewportScale
ShowGridOnTop
UseDocumentGrid
VerticalViewportScale
WorldAxisColorX
WorldAxisColorY
WorldAxisColorZ
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace