RhinoCommon SDK
ColorCMYK.CreateFromLCH Method
Rhino for Mac 5.1
 Constructs the nearest CMYK equivalent of a LCH color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorCMYK CreateFromLCH(
	ColorLCH lch
)
Public Shared Function CreateFromLCH (
	lch As ColorLCH
) As ColorCMYK
Parameters
lch
Type: Rhino.Display.ColorLCH
Target color in LCH space.
Return Value
Type: ColorCMYK
The CMYK equivalent of the LCH color.
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace