RhinoCommon SDK
RhinoViewport.Magnify Method (Double, Boolean, Point)
Rhino for Mac 5.1
 Zooms or dollies in order to scale the viewport projection of observed objects.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Magnify(
	double magnificationFactor,
	bool mode,
	Point fixedScreenPoint
)
Public Function Magnify (
	magnificationFactor As Double,
	mode As Boolean,
	fixedScreenPoint As Point
) As Boolean
Parameters
magnificationFactor
Type: System.Double
The scale factor.
mode
Type: System.Boolean
 false = perform a "dolly" magnification by moving the camera towards/away from the target so that the amount of the screen subtended by an object changes. true = perform a "zoom" magnification by adjusting the "lens" angle
fixedScreenPoint
Type: System.Drawing.Point
A point in the sceen that should remain fixed.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
See Also
Reference
RhinoViewport Class
Magnify Overload
Rhino.Display Namespace