RhinoCommon SDK
Polyline.ToNurbsCurve Method
Rhino for Mac 5.1
 Constructs a nurbs curve representation of this polyline.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsCurve ToNurbsCurve()
Public Function ToNurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
A Nurbs curve shaped like this polyline or null on failure.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace