RhinoCommon SDK
PointCloud.GetNormals Method
Rhino for Mac 5.1
 Copy all the normal vectors in this point cloud to an array.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d[] GetNormals()
Public Function GetNormals As Vector3d()
Return Value
Type: Vector3d[]
An array containing all the normals in this point cloud.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace