RhinoCommon SDK
File3dmObjectTable.AddSphere Method (Sphere)
Rhino for Mac 5.1
 Adds a surface object to the document representing a sphere.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddSphere(
	Sphere sphere
)
Public Function AddSphere (
	sphere As Sphere
) As Guid
Parameters
sphere
Type: Rhino.Geometry.Sphere
A sphere to add.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddSphere Overload
Rhino.FileIO Namespace