RhinoCommon SDK
OptionToggle Methods
Rhino for Mac 5.1
The OptionToggle type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
OptionToggle Class
Rhino.Input.Custom Namespace