RhinoCommon SDK
ColorLCH Structure
Rhino for Mac 5.1
 Represents an LCH (Lightness, A, B) color with double precision floating point channels. LCH colors (also sometimes called CIELUV) are transformation of the 1931 CIE XYZ color space, in order to approach perceptual uniformity. They are primarily used in computer graphics which deal with colored lights.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct ColorLCH
<SerializableAttribute>
Public Structure ColorLCH
The ColorLCH type exposes the following members.
Constructors
Name | Description
ColorLCH(Color)
 Constructs a new instance of ColorLCH that is equivalent to an RGB color.
ColorLCH(Double, Double, Double)
 Constructs a new instance of ColorLCH with custom channel values.
ColorLCH(Double, Double, Double, Double)
 Constructs a new instance of ColorLCH with custom channel values.
Top
Properties
Name | Description
A
 Gets or sets the Alpha channel. The Alpha channel is limited to the 0~1 range.
C
 Gets or sets the Chroma channel. Chroma is defined from -1.0 to +1.0.
H
 Gets or sets the Hue channel. The hue channel is limited to the 0~360 degree range.
L
 Gets or sets the Lightness channel.
Top
Methods
Name | Description
CreateFromCMYK
 Create the nearest LCH equivalent of a CMYK color.
CreateFromHSL
 Create the nearest LCH equivalent of an HSL color.
CreateFromLAB
 Create the nearest LCH equivalent of a LAB color.
CreateFromXYZ
 Create the nearest LCH equivalent of an XYZ color.
MakePositive
 Ensure the Chromaticity of this color is positive.
Top
Operators
Name | Description
Implicit(ColorLCH to Color)
 Implicitly converts a LCH color into a .Net library color.
Top
See Also
Reference
Rhino.Display Namespace