RhinoCommon SDK
LightTableEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.LightTableEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.Tables.LightTableEventArgs
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class LightTableEventArgs : EventArgs
Public Class LightTableEventArgs
	Inherits EventArgs
The LightTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
LightIndex
NewState
OldState
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace