RhinoCommon SDK
SpaceMorph Class
Rhino for Mac 5.1
 Represents a spacial, Euclidean morph.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SpaceMorph
 More...
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class SpaceMorph
Public MustInherit Class SpaceMorph
The SpaceMorph type exposes the following members.
Constructors
Name | Description
SpaceMorph
Initializes a new instance of the SpaceMorph class
Top
Properties
Name | Description
PreserveStructure
 true if the morph should be done in a way that preserves the structure of the geometry. In particular, for NURBS objects, true means that only the control points are moved. The PreserveStructure value does not affect the way meshes and points are morphed. The default is false.
QuickPreview
 true if the morph should be done as quickly as possible because the result is being used for some type of dynamic preview. If QuickPreview is true, the tolerance may be ignored. The QuickPreview value does not affect the way meshes and points are morphed. The default is false.
Tolerance
 The desired accuracy of the morph. This value is primarily used for deforming surfaces and breps. The default is 0.0 and any value <= 0.0 is ignored by morphing functions. The Tolerance value does not affect the way meshes and points are morphed.
Top
Methods
Name | Description
IsMorphable
 true if the geometry can be morphed by calling SpaceMorph.Morph(geometry)
Morph
Apply the space morph to geometry.
MorphPoint
Morphs an Euclidean point.
This method is abstract.
Top
See Also
Reference
Rhino.Geometry Namespace
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SpaceMorph
 Rhino.Geometry.Morphs.BendSpaceMorph
 Rhino.Geometry.Morphs.FlowSpaceMorph
 Rhino.Geometry.Morphs.MaelstromSpaceMorph
 Rhino.Geometry.Morphs.SplopSpaceMorph
 Rhino.Geometry.Morphs.SporphSpaceMorph
 Rhino.Geometry.Morphs.StretchSpaceMorph
 Rhino.Geometry.Morphs.TaperSpaceMorph
 Rhino.Geometry.Morphs.TwistSpaceMorph