RhinoCommon SDK
TextDot.Point Property
Rhino for Mac 5.1
 Gets or sets the position of the textdot.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d Point { get; set; }
Public Property Point As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
TextDot Class
Rhino.Geometry Namespace