RhinoCommon SDK
RhinoGet.GetCircle Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetCircle(Rhino.Geometry.Circle@)"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetCircle(
	out Circle circle
)
Public Shared Function GetCircle (
	<OutAttribute> ByRef circle As Circle
) As Result
Parameters
circle
Type: Rhino.Geometry.Circle
[Missing <param name="circle"/> documentation for "M:Rhino.Input.RhinoGet.GetCircle(Rhino.Geometry.Circle@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetCircle(Rhino.Geometry.Circle@)"]
See Also
Reference
RhinoGet Class
Rhino.Input Namespace