RhinoCommon SDK
Transform.PlanarProjection Method
Rhino for Mac 5.1
 Constructs a projection transformation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform PlanarProjection(
	Plane plane
)
Public Shared Function PlanarProjection (
	plane As Plane
) As Transform
Parameters
plane
Type: Rhino.Geometry.Plane
Plane onto which everything will be perpendicularly projected.
Return Value
Type: Transform
A transformation matrix which projects geometry onto a specified plane.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace