RhinoCommon SDK
Interval.ParameterIntervalAt Method
Rhino for Mac 5.1
Converts normalized parameter to interval value, or pair of values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interval ParameterIntervalAt(
	Interval normalizedInterval
)
Public Function ParameterIntervalAt (
	normalizedInterval As Interval
) As Interval
Parameters
normalizedInterval
Type: Rhino.Geometry.Interval
[Missing <param name="normalizedInterval"/> documentation for "M:Rhino.Geometry.Interval.ParameterIntervalAt(Rhino.Geometry.Interval)"]
Return Value
Type: Interval
Interval parameter min*(1.0-normalizedParameter) + max*normalized_paramete.
See Also
Reference
Interval Structure
Rhino.Geometry Namespace
NormalizedParameterAt