RhinoCommon SDK
UserDictionary Constructor
Rhino for Mac 5.1
Initializes a new instance of the UserDictionary class
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public UserDictionary()
Public Sub New
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace