RhinoCommon SDK
Rectangle3d Constructor (Plane, Point3d, Point3d)
Rhino for Mac 5.1
 Initializes a new rectangle from a base plane and two corner points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Rectangle3d(
	Plane plane,
	Point3d cornerA,
	Point3d cornerB
)
Public Sub New (
	plane As Plane,
	cornerA As Point3d,
	cornerB As Point3d
)
Parameters
plane
Type: Rhino.Geometry.Plane
Base plane for Rectangle.
cornerA
Type: Rhino.Geometry.Point3d
First corner of Rectangle (will be projected onto plane).
cornerB
Type: Rhino.Geometry.Point3d
Second corner of Rectangle (will be projected onto plane).
See Also
Reference
Rectangle3d Structure
Rectangle3d Overload
Rhino.Geometry Namespace