RhinoCommon SDK
InstanceDefinitionTable.Undelete Method
Rhino for Mac 5.1
 Undeletes an instance definition that has been deleted by Delete()
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Undelete(
	int idefIndex
)
Public Function Undelete (
	idefIndex As Integer
) As Boolean
Parameters
idefIndex
Type: System.Int32
 zero based index of instance definition to delete. This must be in the range 0 <= idefIndex < InstanceDefinitionTable.Count.
Return Value
Type: Boolean
true if successful
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace