RhinoCommon SDK
File3dmObjectTable.AddPoints Method
Rhino for Mac 5.1
Overload List
Name | Description
AddPoints(IEnumerable<Point3d>)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3f>)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3d>, ObjectAttributes)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3f>, ObjectAttributes)
 Adds multiple points to the document.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace