RhinoCommon SDK
File3dmObjectTable.AddPoint Method (Point3d, ObjectAttributes)
Rhino for Mac 5.1
Adds a point object to the document.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddPoint(
	Point3d point,
	ObjectAttributes attributes
)
Public Function AddPoint (
	point As Point3d,
	attributes As ObjectAttributes
) As Guid
Parameters
point
Type: Rhino.Geometry.Point3d
A location for point.
attributes
Type: Rhino.DocObjects.ObjectAttributes
attributes to apply to point.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddPoint Overload
Rhino.FileIO Namespace