RhinoCommon SDK
Hatch.CreateDisplayGeometry Method
Rhino for Mac 5.1
 Generate geometry that would be used to draw the hatch with a given hatch pattern
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void CreateDisplayGeometry(
	HatchPattern pattern,
	double patternScale,
	out Curve[] bounds,
	out Line[] lines,
	out Brep solidBrep
)
Public Sub CreateDisplayGeometry (
	pattern As HatchPattern,
	patternScale As Double,
	<OutAttribute> ByRef bounds As Curve(),
	<OutAttribute> ByRef lines As Line(),
	<OutAttribute> ByRef solidBrep As Brep
)
Parameters
pattern
Type: Rhino.DocObjects.HatchPattern
[Missing <param name="pattern"/> documentation for "M:Rhino.Geometry.Hatch.CreateDisplayGeometry(Rhino.DocObjects.HatchPattern,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Line[]@,Rhino.Geometry.Brep@)"]
patternScale
Type: System.Double
[Missing <param name="patternScale"/> documentation for "M:Rhino.Geometry.Hatch.CreateDisplayGeometry(Rhino.DocObjects.HatchPattern,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Line[]@,Rhino.Geometry.Brep@)"]
bounds
Type: Rhino.Geometry.Curve[]
[Missing <param name="bounds"/> documentation for "M:Rhino.Geometry.Hatch.CreateDisplayGeometry(Rhino.DocObjects.HatchPattern,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Line[]@,Rhino.Geometry.Brep@)"]
lines
Type: Rhino.Geometry.Line[]
[Missing <param name="lines"/> documentation for "M:Rhino.Geometry.Hatch.CreateDisplayGeometry(Rhino.DocObjects.HatchPattern,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Line[]@,Rhino.Geometry.Brep@)"]
solidBrep
Type: Rhino.Geometry.Brep
[Missing <param name="solidBrep"/> documentation for "M:Rhino.Geometry.Hatch.CreateDisplayGeometry(Rhino.DocObjects.HatchPattern,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Line[]@,Rhino.Geometry.Brep@)"]
See Also
Reference
Hatch Class
Rhino.Geometry Namespace