RhinoCommon SDK
Polyline.ReduceSegments Method
Rhino for Mac 5.1
 Constructs a reduction of this polyline by recursively removing the least significant segments.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ReduceSegments(
	double tolerance
)
Public Function ReduceSegments (
	tolerance As Double
) As Integer
Parameters
tolerance
Type: System.Double
Tolerance for reduction. Whenever a vertex of the polyline is more significant than tolerance, it will be included in the reduction.
Return Value
Type: Int32
The number of vertices that disappeared due to reduction.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace