RhinoCommon SDK
Quaternion.Conjugate Property
Rhino for Mac 5.1
 Gets a new quaternion that is the conjugate of this quaternion.
This is (a,-b,-c,-d)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Quaternion Conjugate { get; }
Public ReadOnly Property Conjugate As Quaternion
	Get
Property Value
Type: Quaternion
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace