RhinoCommon SDK
Quaternion.Distance Method
Rhino for Mac 5.1
 Returns the distance or norm of the difference between two quaternions.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static double Distance(
	Quaternion p,
	Quaternion q
)
Public Shared Function Distance (
	p As Quaternion,
	q As Quaternion
) As Double
Parameters
p
Type: Rhino.Geometry.Quaternion
A quaternion.
q
Type: Rhino.Geometry.Quaternion
Another quaternion.
Return Value
Type: Double
(p - q).Length()
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace