RhinoCommon SDK
GetBaseClass.GetSelectedEnumValue<T> Method
Rhino for Mac 5.1
 Returns the selected enum value. Use this in combination with AddOptionEnumList<T>(String, T)
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public T GetSelectedEnumValue<T>()
where T : struct, new(), IConvertible
Public Function GetSelectedEnumValue(Of T As {Structure, New, IConvertible}) As T
Type Parameters
T
Return Value
Type: T
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetBaseClass.GetSelectedEnumValue``1"]
Exceptions
Exception | Condition
ArgumentException | Gets thrown if type T is not an enum type.
IndexOutOfRangeException | If 0 >= CurrentListOptionIndex or CurrentListOptionIndex > N where N is the number of enum values.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace