RhinoCommon SDK
GetBaseClass.AcceptPoint Method
Rhino for Mac 5.1
 If you want to allow the user to be able to type in a point then call AcceptPoint(true) before calling GetPoint()/GetObject(). If the user chooses to type in a number, then the result code GetResult.Point is returned and you can use RhinoGet.Point() to get the value of the point.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AcceptPoint(
	bool enable
)
Public Sub AcceptPoint (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true if user is able to type in a point.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace