RhinoCommon SDK
Rectangle3d.CreateFromPolyline Method (IEnumerable<Point3d>, Double, Double)
Rhino for Mac 5.1
 Attempts to create a Rectangle from a Polyline. In order for a polyline to qualify as a rectangle, it must have 4 or 5 corner points (i.e. it need not be closed).
This overload also returns deviations.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Rectangle3d CreateFromPolyline(
	IEnumerable<Point3d> polyline,
	out double deviation,
	out double angleDeviation
)
Public Shared Function CreateFromPolyline (
	polyline As IEnumerable(Of Point3d),
	<OutAttribute> ByRef deviation As Double,
	<OutAttribute> ByRef angleDeviation As Double
) As Rectangle3d
Parameters
polyline
Type: System.Collections.Generic.IEnumerable<Point3d>
Polyline to parse.
deviation
Type: System.Double
On success, the deviation will contain the largest deviation between the polyline and the rectangle.
angleDeviation
Type: System.Double
On success, the angleDeviation will contain the largest deviation (in radians) between the polyline edges and the rectangle edges.
Return Value
Type: Rectangle3d
A rectangle that is shaped similarly to the polyline or Rectangle3d.Unset if the polyline does not represent a rectangle.
See Also
Reference
Rectangle3d Structure
CreateFromPolyline Overload
Rhino.Geometry Namespace