RhinoCommon SDK
ObjectTable.FindClippingPlanesForViewport Method
Rhino for Mac 5.1
 Finds all of the clipping plane objects that actively clip a viewport.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ClippingPlaneObject[] FindClippingPlanesForViewport(
	RhinoViewport viewport
)
Public Function FindClippingPlanesForViewport (
	viewport As RhinoViewport
) As ClippingPlaneObject()
Parameters
viewport
Type: Rhino.Display.RhinoViewport
The viewport in which clipping planes are searched.
Return Value
Type: ClippingPlaneObject[]
An array of clipping plane objects. The array can be emptry but not null.
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace