RhinoCommon SDK
Point3d.UnaryNegation Operator
Rhino for Mac 5.1
 Computes the additive inverse of all coordinates in the point, and returns the new point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d operator -(
	Point3d point
)
Public Shared Operator - (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
Return Value
Type: Point3d
A point value that, when summed with the point input, yields the Origin.
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace