RhinoCommon SDK
IPanelsService.OpenPanel Method (Guid)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
void OpenPanel(
	Guid panelId
)
Sub OpenPanel (
	panelId As Guid
)
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid)"]
See Also
Reference
IPanelsService Interface
OpenPanel Overload
Rhino.UI Namespace