RhinoCommon SDK
LightTableEventArgs Properties
Rhino for Mac 5.1
The LightTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
LightIndex
NewState
OldState
Top
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace