RhinoCommon SDK
FileReadOptions.BatchMode Property
Rhino for Mac 5.1
 true means you cannot ask questions during reading. (no dialogs, no "getters", etc.)
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool BatchMode { get; set; }
Public Property BatchMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace