RhinoCommon SDK
Quaternion.IsValid Property
Rhino for Mac 5.1
 Determines if the four coefficients are valid numbers within RhinoCommon.
See IsValidDouble(Double).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace