RhinoCommon SDK
ColorXYZ.CreateFromHSL Method
Rhino for Mac 5.1
 Create the nearest XYZ equivalent of an HSL color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorXYZ CreateFromHSL(
	ColorHSL hsl
)
Public Shared Function CreateFromHSL (
	hsl As ColorHSL
) As ColorXYZ
Parameters
hsl
Type: Rhino.Display.ColorHSL
Target color in HSL space.
Return Value
Type: ColorXYZ
The XYZ equivalent of the HSL color.
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace