RhinoCommon SDK
MeshVertexList.GetEnumerator Method
Rhino for Mac 5.1
 Gets an enumerator that yields all mesh vertices (points) in this collection.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<Point3f> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Point3f)
Return Value
Type: IEnumerator<Point3f>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace