RhinoCommon SDK
ObjectTable.Replace Method (Guid, Brep)
Rhino for Mac 5.1
Replaces one object with new brep object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	Guid objectId,
	Brep brep
)
Public Function Replace (
	objectId As Guid,
	brep As Brep
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
brep
Type: Rhino.Geometry.Brep
 new surface to be added A duplicate of the brep is added to the Rhino model.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace