RhinoCommon SDK
ObjectTable.Replace Method (Guid, TextEntity)
Rhino for Mac 5.1
 Replaces one object with new text object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	Guid objectId,
	TextEntity text
)
Public Function Replace (
	objectId As Guid,
	text As TextEntity
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
text
Type: Rhino.Geometry.TextEntity
 new text to be added A duplicate of the text is added to the Rhino model.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace