RhinoCommon SDK
Surface.TryGetPlane Method (Plane)
Rhino for Mac 5.1
Tests a surface for planarity and return the plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetPlane(
	out Plane plane
)
Public Function TryGetPlane (
	<OutAttribute> ByRef plane As Plane
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
On success, the plane parameters are filled in.
Return Value
Type: Boolean
 true if there is a plane such that the maximum distance from the surface to the plane is <= RhinoMath.ZeroTolerance.
See Also
Reference
Surface Class
TryGetPlane Overload
Rhino.Geometry Namespace