RhinoCommon SDK
Point3dList.ClosestPointInList Method
Rhino for Mac 5.1
 Finds the point in a list of points that is closest to a test point.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d ClosestPointInList(
	IList<Point3d> list,
	Point3d testPoint
)
Public Shared Function ClosestPointInList (
	list As IList(Of Point3d),
	testPoint As Point3d
) As Point3d
Parameters
list
Type: System.Collections.Generic.IList<Point3d>
A list of points.
testPoint
Type: Rhino.Geometry.Point3d
Point to compare against.
Return Value
Type: Point3d
A point.
Exceptions
Exception | Condition
ArgumentException |  List must contain at least one point and testPoint must be valid.
See Also
Reference
Point3dList Class
Rhino.Collections Namespace