RhinoCommon SDK
File3dm.Read Method (String)
Rhino for Mac 5.1
 Reads a 3dm file from a specified location.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static File3dm Read(
	string path
)
Public Shared Function Read (
	path As String
) As File3dm
Parameters
path
Type: System.String
The file to read.
Return Value
Type: File3dm
new File3dm on success, null on error.
Exceptions
Exception | Condition
FileNotFoundException | If path does not exist.
See Also
Reference
File3dm Class
Read Overload
Rhino.FileIO Namespace