RhinoCommon SDK
ViewportInfo.FrustumCenter Property
Rhino for Mac 5.1
 Gets the frustum center point.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d FrustumCenter { get; }
Public ReadOnly Property FrustumCenter As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace