RhinoCommon SDK
ObjectTable.Transform Method (RhinoObject, Transform, Boolean)
Rhino for Mac 5.1
 Constructs a new object that is the transformation of the existing object and deletes the existing object if deleteOriginal is true.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Transform(
	RhinoObject obj,
	Transform xform,
	bool deleteOriginal
)
Public Function Transform (
	obj As RhinoObject,
	xform As Transform,
	deleteOriginal As Boolean
) As Guid
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
 Rhino object to transform. This object will be deleted if deleteOriginal is true.
xform
Type: Rhino.Geometry.Transform
transformation to apply.
deleteOriginal
Type: System.Boolean
 if true, the original object is deleted if false, the original object is not deleted.
Return Value
Type: Guid
 Id of the new object that is the transformation of the existing_object. The new object has identical attributes.
Remarks
 If the object is locked or on a locked layer, then it cannot be transformed.
See Also
Reference
ObjectTable Class
Transform Overload
Rhino.DocObjects.Tables Namespace