RhinoCommon SDK
Material.MaxShine Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.MaxShine"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static double MaxShine { get; }
Public Shared ReadOnly Property MaxShine As Double
	Get
Property Value
Type: Double
See Also
Reference
Material Class
Rhino.DocObjects Namespace