RhinoCommon SDK
MeshPoint.EdgeParameter Property
Rhino for Mac 5.1
 Edge parameter when found.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double EdgeParameter { get; }
Public ReadOnly Property EdgeParameter As Double
	Get
Property Value
Type: Double
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace