RhinoCommon SDK
Matrix.RowReduce Method (Double, Double, Double)
Rhino for Mac 5.1
Row reduces a matrix to calculate rank and determinant.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int RowReduce(
	double zeroTolerance,
	out double determinant,
	out double pivot
)
Public Function RowReduce (
	zeroTolerance As Double,
	<OutAttribute> ByRef determinant As Double,
	<OutAttribute> ByRef pivot As Double
) As Integer
Parameters
zeroTolerance
Type: System.Double
 (>=0.0) zero tolerance for pivot test. If a the absolute value of a pivot is <= zeroTolerance, then the pivot is assumed to be zero.
determinant
Type: System.Double
value of determinant is returned here.
pivot
Type: System.Double
value of the smallest pivot is returned here.
Return Value
Type: Int32
Rank of the matrix.
Remarks
 The matrix itself is row reduced so that the result is an upper triangular matrix with 1's on the diagonal.
See Also
Reference
Matrix Class
RowReduce Overload
Rhino.Geometry Namespace