RhinoCommon SDK
CurveIntersections.CopyTo Method
Rhino for Mac 5.1
 Copies all intersection results into another array, departing at an index in the target array.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void CopyTo(
	IntersectionEvent[] array,
	int arrayIndex
)
Public Sub CopyTo (
	array As IntersectionEvent(),
	arrayIndex As Integer
)
Parameters
array
Type: Rhino.Geometry.Intersect.IntersectionEvent[]
The target array. This value cannot be null.
arrayIndex
Type: System.Int32
Zero-based index in which to start the copy.
Implements
ICollection<T>.CopyTo(T[], Int32)
Exceptions
Exception | Condition
ArgumentNullException | If array is null.
ArgumentOutOfRangeException | If arrayIndex is less than 0.
ArgumentException | If array is multi-dimensional; or if arrayIndex is larger than or equal to the length of this collection; or this collection contains more IntersectionEvents than the ones that can be stored in array after and including arrayIndex.
See Also
Reference
CurveIntersections Class
Rhino.Geometry.Intersect Namespace