RhinoCommon SDK
GetPoint.EnableCurveSnapTangentBar Method
Rhino for Mac 5.1
 Controls display of the curve snap tangent bar icon.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableCurveSnapTangentBar(
	bool drawTangentBarAtSnapPoint,
	bool drawEndPoints
)
Public Sub EnableCurveSnapTangentBar (
	drawTangentBarAtSnapPoint As Boolean,
	drawEndPoints As Boolean
)
Parameters
drawTangentBarAtSnapPoint
Type: System.Boolean
 true to draw a tangent bar icon whenever GetPoint snaps to a curve.
drawEndPoints
Type: System.Boolean
 true to draw points at the end of the tangent bar.
Remarks
 The tangent bar is drawn by GetPoint::DynamicDraw. If you override GetPoint::DynamicDraw, then you must call the base class function.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace