RhinoCommon SDK
RhinoModifyObjectAttributesEventArgs.NewAttributes Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoModifyObjectAttributesEventArgs.NewAttributes"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectAttributes NewAttributes { get; }
Public ReadOnly Property NewAttributes As ObjectAttributes
	Get
Property Value
Type: ObjectAttributes
See Also
Reference
RhinoModifyObjectAttributesEventArgs Class
Rhino.DocObjects Namespace