RhinoCommon SDK
Interop.TryCopyToOnArc Method
Rhino for Mac 5.1
 Attempts to copy the contents of a Rhino.Geometry.Arc to a RMA.OpenNURBS.OnArc.
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool TryCopyToOnArc(
	Arc source,
	Object destination
)
Public Shared Function TryCopyToOnArc (
	source As Arc,
	destination As Object
) As Boolean
Parameters
source
Type: Rhino.Geometry.Arc
A source arc.
destination
Type: System.Object
A destination OnArc.
Return Value
Type: Boolean
true if the operation succeeded; false otherwise.
See Also
Reference
Interop Class
Rhino.Runtime Namespace