RhinoCommon SDK
BinaryArchiveReader.ReadStringArray Method
Rhino for Mac 5.1
 Reads an array of String from the archive.
An array is returned even if the input was another enumerable type.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string[] ReadStringArray()
Public Function ReadStringArray As String()
Return Value
Type: String[]
The array that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace