RhinoCommon SDK
TextEntity Properties
Rhino for Mac 5.1
The TextEntity type exposes the following members.
Properties
Name | Description
AnnotativeScalingEnabled
 Scale annotation according to detail scale factor in paperspace or by 1.0 in paperspace and not in a detail Otherwise, dimscale or text scale is used
FontIndex
 Gets or sets the index of font in document font table used by the text.
Justification
 Gets or sets the justification of text in relation to its base point.
MaskColor
 Color to use for drawing a text mask when it is enabled. If the mask is enabled and MaskColor is System.Drawing.Color.Transparent, then the viewport's color will be used for the MaskColor
MaskEnabled
 Determines whether or not to draw a Text Mask
MaskOffset
 distance around text to display mask
MaskUsesViewportColor
 If true, the viewport's color is used for the mask color. If false, the color defined by MaskColor is used
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace