RhinoCommon SDK
GumballPickResult.SetToDefault Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballPickResult.SetToDefault"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetToDefault()
Public Sub SetToDefault
See Also
Reference
GumballPickResult Class
Rhino.UI.Gumball Namespace