RhinoCommon SDK
RhinoObject.GetTextureMapping Method (Int32)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.RhinoObject.GetTextureMapping(System.Int32)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TextureMapping GetTextureMapping(
	int channel
)
Public Function GetTextureMapping (
	channel As Integer
) As TextureMapping
Parameters
channel
Type: System.Int32
[Missing <param name="channel"/> documentation for "M:Rhino.DocObjects.RhinoObject.GetTextureMapping(System.Int32)"]
Return Value
Type: TextureMapping
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.GetTextureMapping(System.Int32)"]
See Also
Reference
RhinoObject Class
GetTextureMapping Overload
Rhino.DocObjects Namespace