RhinoCommon SDK
RhinoGet.GetLine Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetLine(Rhino.Geometry.Line@)"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetLine(
	out Line line
)
Public Shared Function GetLine (
	<OutAttribute> ByRef line As Line
) As Result
Parameters
line
Type: Rhino.Geometry.Line
[Missing <param name="line"/> documentation for "M:Rhino.Input.RhinoGet.GetLine(Rhino.Geometry.Line@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetLine(Rhino.Geometry.Line@)"]
See Also
Reference
RhinoGet Class
Rhino.Input Namespace