RhinoCommon SDK
MouseCursor.SetToolTip Method
Rhino for Mac 5.1
 Sets a cursor tooltip string shown next to the mouse cursor. Overrides all cursor tooltip panes.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void SetToolTip(
	string tooltip
)
Public Shared Sub SetToolTip (
	tooltip As String
)
Parameters
tooltip
Type: System.String
The text to show.
See Also
Reference
MouseCursor Class
Rhino.UI Namespace