RhinoCommon SDK
Brep.CreatePatch Method (IEnumerable<GeometryBase>, Surface, Double)
Rhino for Mac 5.1
 Constructs a brep patch.
This is the simple version of fit that uses a specified starting surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep CreatePatch(
	IEnumerable<GeometryBase> geometry,
	Surface startingSurface,
	double tolerance
)
Public Shared Function CreatePatch (
	geometry As IEnumerable(Of GeometryBase),
	startingSurface As Surface,
	tolerance As Double
) As Brep
Parameters
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
 Combination of Curves, BrepTrims, Points, PointClouds or Meshes. Curves and trims are sampled to get points. Trims are sampled for points and normals.
startingSurface
Type: Rhino.Geometry.Surface
A starting surface (can be null).
tolerance
Type: System.Double
 Tolerance used by input analysis functions for loop finding, trimming, etc.
Return Value
Type: Brep
 Brep fit through input on success, or null on error.
See Also
Reference
Brep Class
CreatePatch Overload
Rhino.Geometry Namespace