RhinoCommon SDK
ConstructionPlane Class
Rhino for Mac 5.1
 Represents a contruction plane inside the document.
Use Rhino.DocObjects.Tables.NamedConstructionPlaneTable methods and indexers to add and access a ConstructionPlane.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.ConstructionPlane
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class ConstructionPlane
Public Class ConstructionPlane
The ConstructionPlane type exposes the following members.
Constructors
Name | Description
ConstructionPlane
 Initializes a new instance of ConstructionPlane.
Top
Properties
Name | Description
DepthBuffered
 Gets or sets whether the grid is drawn on top of geometry.
false=grid is always drawn behind 3d geometry
true=grid is drawn at its depth as a 3d plane and grid lines obscure things behind the grid.
GridLineCount
 Gets or sets the total amount of grid lines in each direction.
GridSpacing
 Gets or sets the distance between grid lines.
GridXColor
 Gets or sets the color of the grid X-axis mark.
GridYColor
 Gets or sets the color of the grid Y-axis mark.
GridZColor
 Gets or sets the color of the grid Z-axis mark.
Name
 Gets or sets the name of the grid.
Plane
 Gets or sets the geometric plane to use for construction.
ShowAxes
 Gets or sets whether the axes of the grid shuld be visible.
ShowGrid
 Gets or sets whether the grid itself should be visible.
SnapSpacing
 when "grid snap" is enabled, the distance between snap points. Typically this is the same distance as grid spacing.
ThickLineColor
 Gets or sets the color of the thicker, wider line.
ThickLineFrequency
 Gets or sets the recurrence of a wider line on the grid.
0: No lines are thick, all are drawn thin.
1: All lines are thick.
2: Every other line is thick.
3: One line in three lines is thick (and two are thin).
4: ...
ThinLineColor
 Gets or sets the color of the thinner, less prominent line.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace