RhinoCommon SDK
CustomDisplay.AddPoint Method (Point3d, Color, PointStyle, Int32)
Rhino for Mac 5.1
 Adds a new stylized point to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddPoint(
	Point3d point,
	Color color,
	PointStyle style,
	int radius
)
Public Sub AddPoint (
	point As Point3d,
	color As Color,
	style As PointStyle,
	radius As Integer
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to add.
color
Type: System.Drawing.Color
Color of point.
style
Type: Rhino.Display.PointStyle
Display style of point.
radius
Type: System.Int32
Radius of point widget.
See Also
Reference
CustomDisplay Class
AddPoint Overload
Rhino.Display Namespace