RhinoCommon SDK
BrepVertex Class
Rhino for Mac 5.1
 Brep vertex information
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Point
 Rhino.Geometry.BrepVertex
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class BrepVertex : Point
Public Class BrepVertex
	Inherits Point
The BrepVertex type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this vertex.
VertexIndex
 Gets the index of this vertex in the Brep.Vertices collection.
Top
Methods
Name | Description
EdgeIndices
 Gets the indices of all edges associated with this vertex.
Top
See Also
Reference
Rhino.Geometry Namespace