RhinoCommon SDK
ObjectTable.AddMesh Method
Rhino for Mac 5.1
Overload List
Name | Description
AddMesh(Mesh)
Adds a mesh object to Rhino.
AddMesh(Mesh, ObjectAttributes)
Adds a mesh object to Rhino.
AddMesh(Mesh, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace