RhinoCommon SDK
ToolbarFile.GroupCount Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.ToolbarFile.GroupCount"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int GroupCount { get; }
Public ReadOnly Property GroupCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace