RhinoCommon SDK
File3dmTypeCodes.TCODE_LIGHT_RECORD_ATTRIBUTES_USERDATA Field
Rhino for Mac 5.1
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LIGHT_RECORD_ATTRIBUTES_USERDATA"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_LIGHT_RECORD_ATTRIBUTES_USERDATA
Public Const TCODE_LIGHT_RECORD_ATTRIBUTES_USERDATA As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace