RhinoCommon SDK
Arc.ToNurbsCurve Method
Rhino for Mac 5.1
 Initializes a nurbs curve representation of this arc. This amounts to the same as calling NurbsCurve.CreateFromArc().
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsCurve ToNurbsCurve()
Public Function ToNurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
A nurbs curve representation of this arc or null if no such representation could be made.
See Also
Reference
Arc Structure
Rhino.Geometry Namespace