RhinoCommon SDK
Brep.IsDuplicate Method
Rhino for Mac 5.1
See if this and other are same brep geometry.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsDuplicate(
	Brep other,
	double tolerance
)
Public Function IsDuplicate (
	other As Brep,
	tolerance As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.Brep
other brep.
tolerance
Type: System.Double
tolerance to use when comparing control points.
Return Value
Type: Boolean
true if breps are the same.
See Also
Reference
Brep Class
Rhino.Geometry Namespace