RhinoCommon SDK
BinaryArchiveWriter.WriteLine Method
Rhino for Mac 5.1
 Writes a Line value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteLine(
	Line value
)
Public Sub WriteLine (
	value As Line
)
Parameters
value
Type: Rhino.Geometry.Line
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace