RhinoCommon SDK
Point4d Properties
Rhino for Mac 5.1
The Point4d type exposes the following members.
Properties
Name | Description
Unset
 Gets the value of a point with all coordinates set as RhinoMath.UnsetValue.
W
 Gets or sets the W (fourth) coordinate -or weight- of this point.
X
 Gets or sets the X (first) coordinate of this point.
Y
 Gets or sets the Y (second) coordinate of this point.
Z
 Gets or sets the Z (third) coordinate of this point.
Top
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace