RhinoCommon SDK
ObjectTable.AddExplodedInstancePieces Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddExplodedInstancePieces(Rhino.DocObjects.InstanceObject)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid[] AddExplodedInstancePieces(
	InstanceObject instance
)
Public Function AddExplodedInstancePieces (
	instance As InstanceObject
) As Guid()
Parameters
instance
Type: Rhino.DocObjects.InstanceObject
[Missing <param name="instance"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddExplodedInstancePieces(Rhino.DocObjects.InstanceObject)"]
Return Value
Type: Guid[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddExplodedInstancePieces(Rhino.DocObjects.InstanceObject)"]
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace