RhinoCommon SDK
HatchObject Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.HatchObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.HatchObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class HatchObject : RhinoObject
Public Class HatchObject
	Inherits RhinoObject
The HatchObject type exposes the following members.
Properties
Name | Description
HatchGeometry
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace