RhinoCommon SDK
Curve.CreateBlendCurve Method (Curve, Double, Boolean, BlendContinuity, Curve, Double, Boolean, BlendContinuity)
Rhino for Mac 5.1
 Makes a curve blend between 2 curves at the parameters specified with the directions and continuities specified
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve CreateBlendCurve(
	Curve curve0,
	double t0,
	bool reverse0,
	BlendContinuity continuity0,
	Curve curve1,
	double t1,
	bool reverse1,
	BlendContinuity continuity1
)
Public Shared Function CreateBlendCurve (
	curve0 As Curve,
	t0 As Double,
	reverse0 As Boolean,
	continuity0 As BlendContinuity,
	curve1 As Curve,
	t1 As Double,
	reverse1 As Boolean,
	continuity1 As BlendContinuity
) As Curve
Parameters
curve0
Type: Rhino.Geometry.Curve
First curve to blend from
t0
Type: System.Double
Parameter on first curve for blend endpoint
reverse0
Type: System.Boolean
 If false, the blend will go in the natural direction of the curve. If true, the blend will go in the opposite direction to the curve
continuity0
Type: Rhino.Geometry.BlendContinuity
continuity for the blend at the start
curve1
Type: Rhino.Geometry.Curve
Second curve to blend from
t1
Type: System.Double
Parameter on second curve for blend endpoint
reverse1
Type: System.Boolean
 If false, the blend will go in the natural direction of the curve. If true, the blend will go in the opposite direction to the curve
continuity1
Type: Rhino.Geometry.BlendContinuity
continuity for the blend at the end
Return Value
Type: Curve
the blend curve on success. null on failure
See Also
Reference
Curve Class
CreateBlendCurve Overload
Rhino.Geometry Namespace