RhinoCommon SDK
RhinoViewport.ParentView Property
Rhino for Mac 5.1
 Gets the parent view, if there is one Every RhinoView has an associated RhinoViewport that does all the 3d display work. Those associated viewports return the RhinoView as their parent view. However, RhinoViewports are used in other image creating contexts that do not have a parent RhinoView. If you call ParentView, you MUST check for NULL return values.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoView ParentView { get; }
Public ReadOnly Property ParentView As RhinoView
	Get
Property Value
Type: RhinoView
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace