RhinoCommon SDK
Rectangle3d.RecenterPlane Method (Point3d)
Rhino for Mac 5.1
 Recenters the base plane on a new origin.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void RecenterPlane(
	Point3d origin
)
Public Sub RecenterPlane (
	origin As Point3d
)
Parameters
origin
Type: Rhino.Geometry.Point3d
New origin for plane.
See Also
Reference
Rectangle3d Structure
RecenterPlane Overload
Rhino.Geometry Namespace