RhinoCommon SDK
ViewportInfo.IsFrustumLeftRightSymmetric Property
Rhino for Mac 5.1
 Gets or sets a value that indicates whether the camera frustum has a vertical symmetry axis.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsFrustumLeftRightSymmetric { get; set; }
Public Property IsFrustumLeftRightSymmetric As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace