RhinoCommon SDK
Curve.ProjectToBrep Method (IEnumerable<Curve>, IEnumerable<Brep>, Vector3d, Double)
Rhino for Mac 5.1
 Projects a collection of Curves onto a collection of Breps along a given direction.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] ProjectToBrep(
	IEnumerable<Curve> curves,
	IEnumerable<Brep> breps,
	Vector3d direction,
	double tolerance
)
Public Shared Function ProjectToBrep (
	curves As IEnumerable(Of Curve),
	breps As IEnumerable(Of Brep),
	direction As Vector3d,
	tolerance As Double
) As Curve()
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
Curves to project.
breps
Type: System.Collections.Generic.IEnumerable<Brep>
Breps to project onto.
direction
Type: Rhino.Geometry.Vector3d
Direction of projection.
tolerance
Type: System.Double
Tolerance to use for projection.
Return Value
Type: Curve[]
An array of projected curves or empty array if the projection set is empty.
See Also
Reference
Curve Class
ProjectToBrep Overload
Rhino.Geometry Namespace