RhinoCommon SDK
ColorXYZ.Z Property
Rhino for Mac 5.1
 Gets or set the Z channel value. Channel will be limited to 0~1.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Z { get; set; }
Public Property Z As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace