RhinoCommon SDK
MeshFaceList.GetConnectedFaces Method
Rhino for Mac 5.1
 Find all connected face indices where adjacent face normals meet the criteria of angleRadians and greaterThanAngle
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] GetConnectedFaces(
	int faceIndex,
	double angleRadians,
	bool greaterThanAngle
)
Public Function GetConnectedFaces (
	faceIndex As Integer,
	angleRadians As Double,
	greaterThanAngle As Boolean
) As Integer()
Parameters
faceIndex
Type: System.Int32
face index to start from
angleRadians
Type: System.Double
angle to use for comparison of what is connected
greaterThanAngle
Type: System.Boolean
 If true angles greater than or equal to are considered connected. If false, angles less than or equal to are considerd connected.
Return Value
Type: Int32[]
list of connected face indices
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace