RhinoCommon SDK
Localization.UnitSystemName Method
Rhino for Mac 5.1
 Gets localized unit system name. Uses current application locale id.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string UnitSystemName(
	UnitSystem units,
	bool capitalize,
	bool singular,
	bool abbreviate
)
Public Shared Function UnitSystemName (
	units As UnitSystem,
	capitalize As Boolean,
	singular As Boolean,
	abbreviate As Boolean
) As String
Parameters
units
Type: Rhino.UnitSystem
The unit system.
capitalize
Type: System.Boolean
true if the name should be capitalized.
singular
Type: System.Boolean
true if the name is expressed for a singular element.
abbreviate
Type: System.Boolean
true if name should be the abbreviation.
Return Value
Type: String
The unit system name.
See Also
Reference
Localization Class
Rhino.UI Namespace