RhinoCommon SDK
GetBaseClass.AddOption Method (String, String)
Rhino for Mac 5.1
 Adds a command line option.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddOption(
	string englishOption,
	string englishOptionValue
)
Public Function AddOption (
	englishOption As String,
	englishOptionValue As String
) As Integer
Parameters
englishOption
Type: System.String
 Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
englishOptionValue
Type: System.String
The option value in English, visualized after an equality sign.
Return Value
Type: Int32
 Option index value (>0) or 0 if option cannot be added.
See Also
Reference
GetBaseClass Class
AddOption Overload
Rhino.Input.Custom Namespace