RhinoCommon SDK
Line.Extend Method
Rhino for Mac 5.1
 Extend the line by custom distances on both sides.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Extend(
	double startLength,
	double endLength
)
Public Function Extend (
	startLength As Double,
	endLength As Double
) As Boolean
Parameters
startLength
Type: System.Double
 Distance to extend the line at the start point. Positive distance result in longer lines.
endLength
Type: System.Double
 Distance to extend the line at the end point. Positive distance result in longer lines.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Line Structure
Rhino.Geometry Namespace