RhinoCommon SDK
PolyCurve.Explode Method
Rhino for Mac 5.1
 Explodes this PolyCurve into a list of Curve segments. This will not explode nested polycurves. Call RemoveNesting() first if you need all individual segments.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] Explode()
Public Function Explode As Curve()
Return Value
Type: Curve[]
An array of polycurve segments.
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace