RhinoCommon SDK
PickContext.UpdateClippingPlanes Method
Rhino for Mac 5.1
 Updates the clipping plane information in pick region. The SetClippingPlanes and View fields must be called before calling UpdateClippingPlanes().
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void UpdateClippingPlanes()
Public Sub UpdateClippingPlanes
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace