RhinoCommon SDK
BinaryArchiveWriter.WriteRay3d Method
Rhino for Mac 5.1
 Writes a Ray3d value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteRay3d(
	Ray3d value
)
Public Sub WriteRay3d (
	value As Ray3d
)
Parameters
value
Type: Rhino.Geometry.Ray3d
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace