RhinoCommon SDK
InstanceDefinitionGeometry.GetObjectIds Method
Rhino for Mac 5.1
 list of object ids in the instance geometry table
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid[] GetObjectIds()
Public Function GetObjectIds As Guid()
Return Value
Type: Guid[]
[Missing <returns> documentation for "M:Rhino.Geometry.InstanceDefinitionGeometry.GetObjectIds"]
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace