RhinoCommon SDK
ViewportInfo.GetScreenPort Method
Rhino for Mac 5.1
 Gets the location of viewport in pixels. See documentation for SetScreenPort.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Rectangle GetScreenPort()
Public Function GetScreenPort As Rectangle
Return Value
Type: Rectangle
The rectangle, or Empty rectangle on error.
See Also
Reference
ViewportInfo Class
GetScreenPort Overload
Rhino.DocObjects Namespace