RhinoCommon SDK
PolyCurve.HasGap Property
Rhino for Mac 5.1
 This is a quick way to see if the curve has gaps between the sub curve segments.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool HasGap { get; }
Public ReadOnly Property HasGap As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace