RhinoCommon SDK
File3dm.ApplicationDetails Property
Rhino for Mac 5.1
 Gets or sets details for the application that wrote this file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string ApplicationDetails { get; set; }
Public Property ApplicationDetails As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dm Class
Rhino.FileIO Namespace