RhinoCommon SDK
PickContext.PickFrustumTest Method (Point3d[], Int32, Double, Double)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Point3d[],System.Int32@,System.Double@,System.Double@)"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PickFrustumTest(
	Point3d[] points,
	out int pointIndex,
	out double depth,
	out double distance
)
Public Function PickFrustumTest (
	points As Point3d(),
	<OutAttribute> ByRef pointIndex As Integer,
	<OutAttribute> ByRef depth As Double,
	<OutAttribute> ByRef distance As Double
) As Boolean
Parameters
points
Type: Rhino.Geometry.Point3d[]
[Missing <param name="points"/> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Point3d[],System.Int32@,System.Double@,System.Double@)"]
pointIndex
Type: System.Int32
[Missing <param name="pointIndex"/> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Point3d[],System.Int32@,System.Double@,System.Double@)"]
depth
Type: System.Double
[Missing <param name="depth"/> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Point3d[],System.Int32@,System.Double@,System.Double@)"]
distance
Type: System.Double
[Missing <param name="distance"/> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Point3d[],System.Int32@,System.Double@,System.Double@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Point3d[],System.Int32@,System.Double@,System.Double@)"]
See Also
Reference
PickContext Class
PickFrustumTest Overload
Rhino.Input.Custom Namespace