RhinoCommon SDK
DimensionStyle.ArrowType Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ArrowType"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DimensionStyleArrowType ArrowType { get; set; }
Public Property ArrowType As DimensionStyleArrowType
	Get
	Set
Property Value
Type: DimensionStyleArrowType
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace