RhinoCommon SDK
BrepLoop.LoopIndex Property
Rhino for Mac 5.1
 Gets the index of this loop in the Brep.Loops collection.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int LoopIndex { get; }
Public ReadOnly Property LoopIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace