RhinoCommon SDK
BinaryArchiveReader.ReadBoundingBox Method
Rhino for Mac 5.1
 Reads a BoundingBox from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox ReadBoundingBox()
Public Function ReadBoundingBox As BoundingBox
Return Value
Type: BoundingBox
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace