RhinoCommon SDK
ViewportInfo.SetFrustumNearFar Method (Double, Double)
Rhino for Mac 5.1
 Sets the frustum near and far distances using two values.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFrustumNearFar(
	double nearDistance,
	double farDistance
)
Public Function SetFrustumNearFar (
	nearDistance As Double,
	farDistance As Double
) As Boolean
Parameters
nearDistance
Type: System.Double
The new near distance.
farDistance
Type: System.Double
The new far distance.
Return Value
Type: Boolean
true if operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
SetFrustumNearFar Overload
Rhino.DocObjects Namespace