RhinoCommon SDK
ViewportInfo.SetFrustumNearFar Method (Double, Double, Double, Double, Double)
Rhino for Mac 5.1
 Sets near and far clipping distance subject to constraints.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFrustumNearFar(
	double nearDistance,
	double farDistance,
	double minNearDistance,
	double minNearOverFar,
	double targetDistance
)
Public Function SetFrustumNearFar (
	nearDistance As Double,
	farDistance As Double,
	minNearDistance As Double,
	minNearOverFar As Double,
	targetDistance As Double
) As Boolean
Parameters
nearDistance
Type: System.Double
(>0) desired near clipping distance.
farDistance
Type: System.Double
(>near_dist) desired near clipping distance.
minNearDistance
Type: System.Double
 If min_near_dist <= 0.0, it is ignored. If min_near_dist > 0 and near_dist < min_near_dist, then the frustum's near_dist will be increased to min_near_dist.
minNearOverFar
Type: System.Double
 If min_near_over_far <= 0.0, it is ignored. If near_dist < far_dist*min_near_over_far, then near_dist is increased and/or far_dist is decreased so that near_dist = far_dist*min_near_over_far. If near_dist < target_dist < far_dist, then near_dist near_dist is increased and far_dist is decreased so that projection precision will be good at target_dist. Otherwise, near_dist is simply set to far_dist*min_near_over_far.
targetDistance
Type: System.Double
If target_dist <= 0.0, it is ignored. If target_dist > 0, it is used as described in the description of the min_near_over_far parameter.
Return Value
Type: Boolean
true if operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
SetFrustumNearFar Overload
Rhino.DocObjects Namespace