RhinoCommon SDK
ViewportInfo.SetFrustumNearFar Method (Point3d, Double)
Rhino for Mac 5.1
 Sets the frustum near and far using a center point and radius.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFrustumNearFar(
	Point3d center,
	double radius
)
Public Function SetFrustumNearFar (
	center As Point3d,
	radius As Double
) As Boolean
Parameters
center
Type: Rhino.Geometry.Point3d
A center point.
radius
Type: System.Double
A radius value.
Return Value
Type: Boolean
true if operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
SetFrustumNearFar Overload
Rhino.DocObjects Namespace