RhinoCommon SDK
GeometryBase.HasBrepForm Property
Rhino for Mac 5.1
 Returns true if the Brep.TryConvertBrep function will be successful for this object
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool HasBrepForm { get; }
Public ReadOnly Property HasBrepForm As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace