RhinoCommon SDK
File3dmNotes.IsVisible Property
Rhino for Mac 5.1
 Gets or sets the notes visibility. If the notes are visible, true; false otherwise.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsVisible { get; set; }
Public Property IsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace