RhinoCommon SDK
FileImportPlugIn.AddFileTypes Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.PlugIns.FileImportPlugIn.AddFileTypes(Rhino.FileIO.FileReadOptions)"]
Namespace: Rhino.PlugIns
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected abstract FileTypeList AddFileTypes(
	FileReadOptions options
)
Protected MustOverride Function AddFileTypes (
	options As FileReadOptions
) As FileTypeList
Parameters
options
Type: Rhino.FileIO.FileReadOptions
[Missing <param name="options"/> documentation for "M:Rhino.PlugIns.FileImportPlugIn.AddFileTypes(Rhino.FileIO.FileReadOptions)"]
Return Value
Type: FileTypeList
[Missing <returns> documentation for "M:Rhino.PlugIns.FileImportPlugIn.AddFileTypes(Rhino.FileIO.FileReadOptions)"]
See Also
Reference
FileImportPlugIn Class
Rhino.PlugIns Namespace