RhinoCommon SDK
DimensionStyleArrowType Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.DimensionStyleArrowType"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum DimensionStyleArrowType
Public Enumeration DimensionStyleArrowType
Members
Member name | Value | Description
SolidTriangle | 0 | 2:1
Dot | 1
Tick | 2
ShortTriangle | 3 | 1:1
Arrow | 4
Rectangle | 5
LongTriangle | 6 | 4:1
LongerTriangle | 7 | 6:1
See Also
Reference
Rhino.DocObjects Namespace