RhinoCommon SDK
Vector3d.Multiply Operator
Rhino for Mac 5.1
Overload List
Name | Description
Multiply(Double, Vector3d)
 Multiplies a vector by a number, having the effect of scaling it.
Multiply(Vector3d, Vector3d)
 Multiplies two vectors together, returning the dot product (or inner product). This differs from the cross product.
Multiply(Vector3d, Double)
 Multiplies a vector by a number, having the effect of scaling it.
Top
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace