RhinoCommon SDK
VolumeMassProperties.WorldCoordinatesMomentsOfInertia Property
Rhino for Mac 5.1
 The moments of inertia about the world coordinate axes. X = integral of (y^2 + z^2) dm Y = integral of (z^2 + x^2) dm Z = integral of (z^2 + y^2) dm.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d WorldCoordinatesMomentsOfInertia { get; }
Public ReadOnly Property WorldCoordinatesMomentsOfInertia As Vector3d
	Get
Property Value
Type: Vector3d
Remarks
 What is meant by "moments of intertia" varies widely in textbooks and papers. The values returned here are the integrals listed in the Summary section. Some applications may want the values from WorldCoordinatesSecondMoments instead of the values returned here.
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace