RhinoCommon SDK
SimpleArrayMeshPointer Class
Rhino for Mac 5.1
 Represents a wrapper to an unmanaged array of mesh pointers.
Wrapper for a C++ ON_SimpleArray of ON_Mesh* or const ON_Mesh*. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer
Namespace: Rhino.Runtime.InteropWrappers
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class SimpleArrayMeshPointer : IDisposable
Public Class SimpleArrayMeshPointer
	Implements IDisposable
The SimpleArrayMeshPointer type exposes the following members.
Constructors
Name | Description
SimpleArrayMeshPointer
 Initializes a new SimpleArrayMeshPointer instance.
Top
Properties
Name | Description
Count
 Gets the amount of meshes in this array.
Top
Methods
Name | Description
Add
 Adds a mesh to the list.
ConstPointer
 Gets the const (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
Releases the unmanaged resources used by the SimpleArrayMeshPointer and optionally releases the managed resources
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-const pointer (for modification) of this array.
ToNonConstArray
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace