RhinoCommon SDK
LineCurve Constructor
Rhino for Mac 5.1
 Initializes a new instance of the LineCurve class.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public LineCurve()
Public Sub New
See Also
Reference
LineCurve Class
LineCurve Overload
Rhino.Geometry Namespace