RhinoCommon SDK
SweepOneRail.PerformSweepRebuild Method
Rhino for Mac 5.1
Overload List
Name | Description
PerformSweepRebuild(Curve, Curve, Int32)
PerformSweepRebuild(Curve, IEnumerable<Curve>, Int32)
PerformSweepRebuild(Curve, Curve, Double, Int32)
PerformSweepRebuild(Curve, IEnumerable<Curve>, IEnumerable<Double>, Int32)
Top
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace