RhinoCommon SDK
DisplayPipeline.DrawCurvatureGraph Method (Curve, Color, Int32)
Rhino for Mac 5.1
 Draw a typical Rhino Curvature Graph.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawCurvatureGraph(
	Curve curve,
	Color color,
	int hairScale
)
Public Sub DrawCurvatureGraph (
	curve As Curve,
	color As Color,
	hairScale As Integer
)
Parameters
curve
Type: Rhino.Geometry.Curve
Base curve for curvature graph.
color
Type: System.Drawing.Color
Color of curvature graph.
hairScale
Type: System.Int32
100 = true length, > 100 magnified, < 100 shortened.
See Also
Reference
DisplayPipeline Class
DrawCurvatureGraph Overload
Rhino.Display Namespace