RhinoCommon SDK
RhinoObject.GetTextureMapping Method (Int32, Transform)
Rhino for Mac 5.1
 Get objects texture mapping
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TextureMapping GetTextureMapping(
	int channel,
	out Transform objectTransform
)
Public Function GetTextureMapping (
	channel As Integer,
	<OutAttribute> ByRef objectTransform As Transform
) As TextureMapping
Parameters
channel
Type: System.Int32
[Missing <param name="channel"/> documentation for "M:Rhino.DocObjects.RhinoObject.GetTextureMapping(System.Int32,Rhino.Geometry.Transform@)"]
objectTransform
Type: Rhino.Geometry.Transform
[Missing <param name="objectTransform"/> documentation for "M:Rhino.DocObjects.RhinoObject.GetTextureMapping(System.Int32,Rhino.Geometry.Transform@)"]
Return Value
Type: TextureMapping
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.GetTextureMapping(System.Int32,Rhino.Geometry.Transform@)"]
See Also
Reference
RhinoObject Class
GetTextureMapping Overload
Rhino.DocObjects Namespace