RhinoCommon SDK
GumballObject.SetFromPlane Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromPlane(Rhino.Geometry.Plane)"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFromPlane(
	Plane plane
)
Public Function SetFromPlane (
	plane As Plane
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromPlane(Rhino.Geometry.Plane)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromPlane(Rhino.Geometry.Plane)"]
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace