RhinoCommon SDK
BezierCurve.GetControlVertex4d Method
Rhino for Mac 5.1
Get location of a control vertex.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point4d GetControlVertex4d(
	int index
)
Public Function GetControlVertex4d (
	index As Integer
) As Point4d
Parameters
index
Type: System.Int32
 Control vertex index (0 <= index < ControlVertexCount)
Return Value
Type: Point4d
 Homogenous value of control vertex. If the bezier is not rational, the weight is 1.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | when index is out of range
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace