RhinoCommon SDK
Layer.Id Property
Rhino for Mac 5.1
 Gets or sets the ID of this layer object. You typically do not need to assign a custom ID.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Layer Class
Rhino.DocObjects Namespace