RhinoCommon SDK
UserDataList.Remove Method
Rhino for Mac 5.1
 Remove the userdata from this list
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Remove(
	UserData userdata
)
Public Function Remove (
	userdata As UserData
) As Boolean
Parameters
userdata
Type: Rhino.DocObjects.Custom.UserData
[Missing <param name="userdata"/> documentation for "M:Rhino.DocObjects.Custom.UserDataList.Remove(Rhino.DocObjects.Custom.UserData)"]
Return Value
Type: Boolean
true if the user data was successfully removed
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace