RhinoCommon SDK
LightObject Properties
Rhino for Mac 5.1
The LightObject type exposes the following members.
Properties
Name | Description
LightGeometry
Top
See Also
Reference
LightObject Class
Rhino.DocObjects Namespace