RhinoCommon SDK
DisplayPipelineAttributes.DisableTransparency Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.DisableTransparency"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DisableTransparency { get; set; }
Public Property DisableTransparency As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace