RhinoCommon SDK
Circle.Normal Property
Rhino for Mac 5.1
 Gets the normal vector for this circle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d Normal { get; }
Public ReadOnly Property Normal As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Circle Structure
Rhino.Geometry Namespace