RhinoCommon SDK
Curve.Duplicate Method
Rhino for Mac 5.1
 Constructs an exact duplicate of this Curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override GeometryBase Duplicate()
Public Overrides Function Duplicate As GeometryBase
Return Value
Type: GeometryBase
[Missing <returns> documentation for "M:Rhino.Geometry.Curve.Duplicate"]
See Also
Reference
Curve Class
Rhino.Geometry Namespace
Curve.DuplicateCurve()