RhinoCommon SDK
RhinoObject.MemoryEstimate Method
Rhino for Mac 5.1
 Computes an estimate of the number of bytes that this object is using in memory. Note that this is a runtime memory estimate and does not directly compare to the amount of space take up by the object when saved to a file.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public uint MemoryEstimate()
Public Function MemoryEstimate As UInteger
Return Value
Type: UInt32
The estimated number of bytes this object occupies in memory.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace