RhinoCommon SDK
ColorLAB.CreateFromHSL Method
Rhino for Mac 5.1
 Create the nearest LAB equivalent of an HSL color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorLAB CreateFromHSL(
	ColorHSL hsl
)
Public Shared Function CreateFromHSL (
	hsl As ColorHSL
) As ColorLAB
Parameters
hsl
Type: Rhino.Display.ColorHSL
Target color in HSL space.
Return Value
Type: ColorLAB
The LAB equivalent of the HSL color.
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace