RhinoCommon SDK
BrepRegion Class
Rhino for Mac 5.1
 Represents a brep topological region that has sides.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.BrepRegion
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class BrepRegion
Public Class BrepRegion
The BrepRegion type exposes the following members.
Properties
Name | Description
BoundingBox
Gets the region bounding box.
Brep
Gets a reference to the Brep this region belongs to.
Index
Gets the index of region in the RegionTopology array.
IsFinite
 Gets a value indicating whether this region is finite.
Top
Methods
Name | Description
BoundaryBrep
 Gets the boundary of a region as a brep object. If the region is finite, the boundary will be a closed manifold brep. The boundary may have more than one connected component.
GetFaceSides
 Gets an array of BrepRegionFaceSide entities delimiting this region.
Top
See Also
Reference
Rhino.Geometry Namespace