RhinoCommon SDK
RTree.CreateMeshFaceTree Method
Rhino for Mac 5.1
 Constructs a new tree with an element for each face in the mesh. The element id is set to the index of the face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static RTree CreateMeshFaceTree(
	Mesh mesh
)
Public Shared Function CreateMeshFaceTree (
	mesh As Mesh
) As RTree
Parameters
mesh
Type: Rhino.Geometry.Mesh
A mesh.
Return Value
Type: RTree
A new tree, or null on error.
See Also
Reference
RTree Class
Rhino.Geometry Namespace