RhinoCommon SDK
ClassIdAttribute Constructor
Rhino for Mac 5.1
Initializes a class id attrbute.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ClassIdAttribute(
	string id
)
Public Sub New (
	id As String
)
Parameters
id
Type: System.String
String in the form of a Guid.
See Also
Reference
ClassIdAttribute Class
Rhino.DocObjects.Custom Namespace