RhinoCommon SDK
ViewportInfo.FrustumRight Property
Rhino for Mac 5.1
 Gets the frustum right value. This is -left if the frustum has a vertical symmetry axis.
This number is usually positive.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double FrustumRight { get; }
Public ReadOnly Property FrustumRight As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace