RhinoCommon SDK
Rectangle3d.Circumference Property
Rhino for Mac 5.1
 Gets the circumference of the rectangle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Circumference { get; }
Public ReadOnly Property Circumference As Double
	Get
Property Value
Type: Double
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace