RhinoCommon SDK
DisplayPipeline.DrawForeground Event
Rhino for Mac 5.1
 Called after all non-highlighted objects have been drawn and PostDrawObjects has been called. Depth writing and testing are turned OFF. If you want to draw with depth writing/testing, see PostDrawObjects.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<DrawEventArgs> DrawForeground
Public Shared Event DrawForeground As EventHandler(Of DrawEventArgs)
Value
Type: System.EventHandler<DrawEventArgs>
Remarks
 This event is actually passed a DrawForegroundEventArgs, but we could not change the event declaration without breaking the SDK. Cast to a DrawForegroundEventArgs if you need it.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace