RhinoCommon SDK
VisualAnalysisMode.RhinoZebraStripeAnalysisModeId Property
Rhino for Mac 5.1
 Id for Rhino's built-in zebra stripe analysis mode. Zebra stripes are shown on surfaces and meshes.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid RhinoZebraStripeAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoZebraStripeAnalysisModeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace