RhinoCommon SDK
GetPoint.Constrain Method (Plane, Boolean)
Rhino for Mac 5.1
constrain the picked point to lie on a plane.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Constrain(
	Plane plane,
	bool allowElevator
)
Public Function Constrain (
	plane As Plane,
	allowElevator As Boolean
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
A plane to use as constraint.
allowElevator
Type: System.Boolean
true if elevator mode should be allowed at user request.
Return Value
Type: Boolean
true if constraint could be applied.
See Also
Reference
GetPoint Class
Constrain Overload
Rhino.Input.Custom Namespace