RhinoCommon SDK
GetPoint.Constrain Method (Circle)
Rhino for Mac 5.1
Constrains the picked point to lie on a circle.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Constrain(
	Circle circle
)
Public Function Constrain (
	circle As Circle
) As Boolean
Parameters
circle
Type: Rhino.Geometry.Circle
A circle to use as constraint.
Return Value
Type: Boolean
true if constraint could be applied.
See Also
Reference
GetPoint Class
Constrain Overload
Rhino.Input.Custom Namespace