RhinoCommon SDK
GetPoint.Constrain Method (Sphere)
Rhino for Mac 5.1
Constrains the picked point to lie on a sphere.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Constrain(
	Sphere sphere
)
Public Function Constrain (
	sphere As Sphere
) As Boolean
Parameters
sphere
Type: Rhino.Geometry.Sphere
A sphere to use as constraint.
Return Value
Type: Boolean
true if constraint could be applied.
See Also
Reference
GetPoint Class
Constrain Overload
Rhino.Input.Custom Namespace