RhinoCommon SDK
GetPoint.Constrain Method (Brep, Int32, Int32, Boolean)
Rhino for Mac 5.1
Constrains the picked point to lie on a brep.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Constrain(
	Brep brep,
	int wireDensity,
	int faceIndex,
	bool allowPickingPointOffObject
)
Public Function Constrain (
	brep As Brep,
	wireDensity As Integer,
	faceIndex As Integer,
	allowPickingPointOffObject As Boolean
) As Boolean
Parameters
brep
Type: Rhino.Geometry.Brep
A brep to use as constraint.
wireDensity
Type: System.Int32
 When wire_density<0, isocurve intersection snapping is turned off, when wire_density>=0, the value defines the isocurve density used for isocurve intersection snapping.
faceIndex
Type: System.Int32
 When face_index <0, constrain to whole brep. When face_index >=0, constrain to individual face.
allowPickingPointOffObject
Type: System.Boolean
 defines whether the point pick is allowed to happen off object. When false, a "no no" cursor is shown when the cursor is not on the object. When true, a normal point picking cursor is used and the marker is visible also when the cursor is not on the object.
Return Value
Type: Boolean
true if constraint could be applied.
See Also
Reference
GetPoint Class
Constrain Overload
Rhino.Input.Custom Namespace