RhinoCommon SDK
SphereSphereIntersection Enumeration
Rhino for Mac 5.1
 Represents all possible cases of a Sphere|Sphere intersection event.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum SphereSphereIntersection
Public Enumeration SphereSphereIntersection
Members
Member name | Value | Description
None | 0 |  Spheres do not intersect.
Point | 1 |  Spheres touch at a single point.
Circle | 2 |  Spheres intersect at a circle.
Overlap | 3 |  Spheres are identical.
See Also
Reference
Rhino.Geometry.Intersect Namespace