RhinoCommon SDK
Transform.Scale Method
Rhino for Mac 5.1
Overload List
Name | Description
Scale(Point3d, Double)
 Constructs a new uniform scaling transformation with a specified scaling anchor point.
Scale(Plane, Double, Double, Double)
 Constructs a new non-uniform scaling transformation with a specified scaling anchor point.
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace