RhinoCommon SDK
File3dm.WriteWithLog Method
Rhino for Mac 5.1
 Writes contents of this model to an openNURBS archive. I STRONGLY suggested that you call Polish() before calling Write so that your file has all the "fluff" that makes it complete. If the model is not valid, then Write will refuse to write it.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool WriteWithLog(
	string path,
	int version,
	out string errorLog
)
Public Function WriteWithLog (
	path As String,
	version As Integer,
	<OutAttribute> ByRef errorLog As String
) As Boolean
Parameters
path
Type: System.String
 Version of the openNURBS archive to write. Must be 2, 3, 4, or 5. Rhino 2.x can read version 2 files. Rhino 3.x can read version 2 and 3 files. Rhino 4.x can read version 2, 3 and 4 files. Rhino 5.x can read version 2, 3, 4, and 5 files. Use version 5 when possible.
version
Type: System.Int32
A version number.
errorLog
Type: System.String
. This argument will be filled by out reference.
Return Value
Type: Boolean
 true if archive is written with no error. false if errors occur.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace