RhinoCommon SDK
RhinoViewport.SetConstructionPlane Method (ConstructionPlane)
Rhino for Mac 5.1
 Sets the construction plane to cplane.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetConstructionPlane(
	ConstructionPlane cplane
)
Public Sub SetConstructionPlane (
	cplane As ConstructionPlane
)
Parameters
cplane
Type: Rhino.DocObjects.ConstructionPlane
The constuction plane to set.
See Also
Reference
RhinoViewport Class
SetConstructionPlane Overload
Rhino.Display Namespace