RhinoCommon SDK
Vector3d.Negate Method
Rhino for Mac 5.1
 Computes the opposite vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Vector3d Negate(
	Vector3d vector
)
Public Shared Function Negate (
	vector As Vector3d
) As Vector3d
Parameters
vector
Type: Rhino.Geometry.Vector3d
A vector to negate.
Return Value
Type: Vector3d
A new vector where all components were multiplied by -1.
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace