RhinoCommon SDK
GetBaseClass.SetWaitDuration Method
Rhino for Mac 5.1
 Sets the wait duration (in milliseconds) of the getter. If the duration passes without the user making a decision, the GetResult.Timeout code is returned.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetWaitDuration(
	int milliseconds
)
Public Sub SetWaitDuration (
	milliseconds As Integer
)
Parameters
milliseconds
Type: System.Int32
Number of milliseconds to wait.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace