RhinoCommon SDK
LightStyle Enumeration
Rhino for Mac 5.1
 Defines enumerated values to represent light styles or types, such as directional or spotlight.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum LightStyle
Public Enumeration LightStyle
Members
Member name | Value | Description
None | 0 |  No light type. This is the default value of the enumeration type.
CameraDirectional | 4 |  Light location and direction in camera coordinates. +x points to right, +y points up, +z points towards camera.
CameraPoint | 5 |  Light location and direction in camera coordinates. +x points to right, +y points up, +z points towards camera.
CameraSpot | 6 |  Light location and direction in camera coordinates. +x points to right, +y points up, +z points towards camera.
WorldDirectional | 7 | Light location and direction in world coordinates.
WorldPoint | 8 | Light location and direction in world coordinates.
WorldSpot | 9 | Light location and direction in world coordinates.
Ambient | 10 | Ambient light.
WorldLinear | 11 | Linear light in world coordinates.
WorldRectangular | 12 | Rectangular light in world coordinates.
See Also
Reference
Rhino.Geometry Namespace