RhinoCommon SDK
ColorLCH.H Property
Rhino for Mac 5.1
 Gets or sets the Hue channel. The hue channel is limited to the 0~360 degree range.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double H { get; set; }
Public Property H As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace