RhinoCommon SDK
HatchPattern.FillType Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.FillType"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public HatchPatternFillType FillType { get; set; }
Public Property FillType As HatchPatternFillType
	Get
	Set
Property Value
Type: HatchPatternFillType
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace