RhinoCommon SDK
Intersection.MeshRay Method (Mesh, Ray3d)
Rhino for Mac 5.1
Finds the first intersection of a ray with a mesh.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static double MeshRay(
	Mesh mesh,
	Ray3d ray
)
Public Shared Function MeshRay (
	mesh As Mesh,
	ray As Ray3d
) As Double
Parameters
mesh
Type: Rhino.Geometry.Mesh
A mesh to intersect.
ray
Type: Rhino.Geometry.Ray3d
A ray to be casted.
Return Value
Type: Double
 >= 0.0 parameter along ray if successful. < 0.0 if no intersection found.
See Also
Reference
Intersection Class
MeshRay Overload
Rhino.Geometry.Intersect Namespace