RhinoCommon SDK
Surface.Rebuild Method
Rhino for Mac 5.1
 Rebuilds an existing surface to a given degree and point count.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsSurface Rebuild(
	int uDegree,
	int vDegree,
	int uPointCount,
	int vPointCount
)
Public Function Rebuild (
	uDegree As Integer,
	vDegree As Integer,
	uPointCount As Integer,
	vPointCount As Integer
) As NurbsSurface
Parameters
uDegree
Type: System.Int32
the output surface u degree.
vDegree
Type: System.Int32
the output surface u degree.
uPointCount
Type: System.Int32
 The number of points in the output surface u direction. Must be bigger than uDegree (maximum value is 1000)
vPointCount
Type: System.Int32
 The number of points in the output surface v direction. Must be bigger than vDegree (maximum value is 1000)
Return Value
Type: NurbsSurface
new rebuilt surface on success. null on failure.
See Also
Reference
Surface Class
Rhino.Geometry Namespace