RhinoCommon SDK
MaterialTable.CurrentMaterialSource Property
Rhino for Mac 5.1
 Gets or sets the current material source.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectMaterialSource CurrentMaterialSource { get; set; }
Public Property CurrentMaterialSource As ObjectMaterialSource
	Get
	Set
Property Value
Type: ObjectMaterialSource
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace