RhinoCommon SDK
RTree.Search Method (Sphere, EventHandler<RTreeEventArgs>)
Rhino for Mac 5.1
 Searches for items in a sphere.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Search(
	Sphere sphere,
	EventHandler<RTreeEventArgs> callback
)
Public Function Search (
	sphere As Sphere,
	callback As EventHandler(Of RTreeEventArgs)
) As Boolean
Parameters
sphere
Type: Rhino.Geometry.Sphere
bounds used for searching.
callback
Type: System.EventHandler<RTreeEventArgs>
An event handler to be raised when items are found.
Return Value
Type: Boolean
 true if entire tree was searched. It is possible no results were found.
See Also
Reference
RTree Class
Search Overload
Rhino.Geometry Namespace