RhinoCommon SDK
RTree.Search Method (BoundingBox, EventHandler<RTreeEventArgs>, Object)
Rhino for Mac 5.1
 Searches for items in a bounding box.
The bounding box can be singular and contain exactly one single point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Search(
	BoundingBox box,
	EventHandler<RTreeEventArgs> callback,
	Object tag
)
Public Function Search (
	box As BoundingBox,
	callback As EventHandler(Of RTreeEventArgs),
	tag As Object
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
A bounding box.
callback
Type: System.EventHandler<RTreeEventArgs>
An event handler to be raised when items are found.
tag
Type: System.Object
State to be passed inside the RTreeEventArgs Tag property.
Return Value
Type: Boolean
 true if entire tree was searched. It is possible no results were found.
See Also
Reference
RTree Class
Search Overload
Rhino.Geometry Namespace