RhinoCommon SDK
BrepEdge.IsSmoothManifoldEdge Method
Rhino for Mac 5.1
 For a manifold, non-boundary edge, decides whether or not the two surfaces on either side meet smoothly.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSmoothManifoldEdge(
	double angleToleranceRadians = 0.0174532925199433
)
Public Function IsSmoothManifoldEdge (
	Optional angleToleranceRadians As Double = 0.0174532925199433
) As Boolean
Parameters
angleToleranceRadians (Optional)
Type: System.Double
 used to decide if surface normals on either side are parallel.
Return Value
Type: Boolean
 true if edge is manifold, has exactly 2 trims, and surface normals on either side agree to within angle_tolerance.
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace