RhinoCommon SDK
File3dmObjectTable.AddExtrusion Method
Rhino for Mac 5.1
Overload List
Name | Description
AddExtrusion(Extrusion)
Adds an extrusion object to Rhino.
AddExtrusion(Extrusion, ObjectAttributes)
Adds an extrusion object to Rhino.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace