RhinoCommon SDK
Sphere.Transform Method
Rhino for Mac 5.1
 Transforms this sphere. Note that non-similarity preserving transformations cannot be applied to a sphere as that would result in an ellipsoid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation matrix to apply.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace