RhinoCommon SDK
ObjectTable.AddPoint Method (Point3d, ObjectAttributes, HistoryRecord, Boolean)
Rhino for Mac 5.1
Adds a point object to the document
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddPoint(
	Point3d point,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddPoint (
	point As Point3d,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
point
Type: Rhino.Geometry.Point3d
location of point
attributes
Type: Rhino.DocObjects.ObjectAttributes
attributes to apply to point. null is acceptible
history
Type: Rhino.DocObjects.HistoryRecord
history associated with this point. null is acceptable
reference
Type: System.Boolean
 true if the object is from a reference file. Reference objects do not persist in archives
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddPoint Overload
Rhino.DocObjects.Tables Namespace