RhinoCommon SDK
MeshTopologyEdgeList.CollapseEdge Method
Rhino for Mac 5.1
 Replaces a mesh edge with a vertex at its center and update adjacent faces as needed.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool CollapseEdge(
	int topologyEdgeIndex
)
Public Function CollapseEdge (
	topologyEdgeIndex As Integer
) As Boolean
Parameters
topologyEdgeIndex
Type: System.Int32
An index of a topology edge in TopologyEdges.
Return Value
Type: Boolean
true if successful.
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace