RhinoCommon SDK
File3dm.InstanceDefinitions Property
Rhino for Mac 5.1
 Instance definitions in this file
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IList<InstanceDefinitionGeometry> InstanceDefinitions { get; }
Public ReadOnly Property InstanceDefinitions As IList(Of InstanceDefinitionGeometry)
	Get
Property Value
Type: IList<InstanceDefinitionGeometry>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace