RhinoCommon SDK
ObjectTable.GetEnumerator Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetEnumerator"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<RhinoObject> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of RhinoObject)
Return Value
Type: IEnumerator<RhinoObject>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace