RhinoCommon SDK
DisplayPipeline.DrawArc Method (Arc, Color, Int32)
Rhino for Mac 5.1
 Draw a single arc object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawArc(
	Arc arc,
	Color color,
	int thickness
)
Public Sub DrawArc (
	arc As Arc,
	color As Color,
	thickness As Integer
)
Parameters
arc
Type: Rhino.Geometry.Arc
Arc to draw.
color
Type: System.Drawing.Color
Color to draw with.
thickness
Type: System.Int32
Thickness (in pixels) of arc.
See Also
Reference
DisplayPipeline Class
DrawArc Overload
Rhino.Display Namespace