RhinoCommon SDK
Line.ExtendThroughBox Method (Box)
Rhino for Mac 5.1
 Ensure the line extends all the way through a box. Note, this does not result in the shortest possible line that overlaps the box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ExtendThroughBox(
	Box box
)
Public Function ExtendThroughBox (
	box As Box
) As Boolean
Parameters
box
Type: Rhino.Geometry.Box
Box to extend through.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Line Structure
ExtendThroughBox Overload
Rhino.Geometry Namespace