RhinoCommon SDK
MeshVertexColorList.CreateMonotoneMesh Method
Rhino for Mac 5.1
 Constructs a valid vertex color list consisting of a single color.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool CreateMonotoneMesh(
	Color baseColor
)
Public Function CreateMonotoneMesh (
	baseColor As Color
) As Boolean
Parameters
baseColor
Type: System.Drawing.Color
Color to apply to every vertex.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace