RhinoCommon SDK
DisplayPipeline.DrawDot Method
Rhino for Mac 5.1
Overload List
Name | Description
DrawDot(Point3d, String)
 Draws a text dot in world coordinates.
DrawDot(Int32, Int32, String)
 Draws a text dot in screen coordinates.
DrawDot(Point3d, String, Color, Color)
 Draw a text dot in world coordinates.
DrawDot(Int32, Int32, String, Color, Color)
 Draws a text dot in screen coordinates.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace