RhinoCommon SDK
Point3d.Addition Operator
Rhino for Mac 5.1
Overload List
Name | Description
Addition(Point3d, Point3d)
 Sums two Point3d instances.
Addition(Point3d, Vector3d)
 Sums up a point and a vector, and returns a new point.
Addition(Point3d, Vector3f)
 Sums up a point and a vector, and returns a new point.
Addition(Vector3d, Point3d)
 Sums up a point and a vector, and returns a new point.
Top
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace