RhinoCommon SDK
ArchivableDictionary.Set Method (String, Line)
Rhino for Mac 5.1
 Sets a Line.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Set(
	string key,
	Line val
)
Public Function Set (
	key As String,
	val As Line
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: Rhino.Geometry.Line
A value for that key.
Because Line has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Line)"]
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace