RhinoCommon SDK
NamedViewTable.FindByName Method
Rhino for Mac 5.1
Finds a named view.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int FindByName(
	string name
)
Public Function FindByName (
	name As String
) As Integer
Parameters
name
Type: System.String
name to search for.
Return Value
Type: Int32
 >=0 index of the found named view -1 no named view found.
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace