RhinoCommon SDK
Curve.PullToBrepFace Method
Rhino for Mac 5.1
Overload List
Name | Description
PullToBrepFace(BrepFace, Double)
 Pulls this curve to a brep face and returns the result of that operation.
PullToBrepFace(Curve, BrepFace, Double)
 Pull a curve to a BrepFace using closest point projection.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace