RhinoCommon SDK
CustomObjectGrips.OnUpdateMesh Method
Rhino for Mac 5.1
 Just before Rhino shades an object with grips on, it calls this method to update the display meshes. Grips that modify surface or mesh objects must override this function and modify the display meshes here.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnUpdateMesh(
	MeshType meshType
)
Protected Overridable Sub OnUpdateMesh (
	meshType As MeshType
)
Parameters
meshType
Type: Rhino.Geometry.MeshType
The mesh type being updated.
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace