RhinoCommon SDK
Polyline.IsClosed Property
Rhino for Mac 5.1
 Gets a value that indicates whether this polyline is closed.
The polyline is considered to be closed if its start is identical to its endpoint.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsClosed { get; }
Public ReadOnly Property IsClosed As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Polyline Class
Rhino.Geometry Namespace
Polyline.IsClosedWithinTolerance(Double)