RhinoCommon SDK
InstanceReferenceGeometry.Xform Property
Rhino for Mac 5.1
Transformation for this reference.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform Xform { get; }
Public ReadOnly Property Xform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
InstanceReferenceGeometry Class
Rhino.Geometry Namespace