RhinoCommon SDK
CustomDisplay.AddCircle Method (Circle)
Rhino for Mac 5.1
 Adds a new, black circle to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddCircle(
	Circle circle
)
Public Sub AddCircle (
	circle As Circle
)
Parameters
circle
Type: Rhino.Geometry.Circle
Circle to add.
See Also
Reference
CustomDisplay Class
AddCircle Overload
Rhino.Display Namespace