RhinoCommon SDK
Arc.PointAt Method
Rhino for Mac 5.1
 Gets the point at the given arc parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAt(
	double t
)
Public Function PointAt (
	t As Double
) As Point3d
Parameters
t
Type: System.Double
Arc parameter to evaluate.
Return Value
Type: Point3d
The point at the given parameter.
See Also
Reference
Arc Structure
Rhino.Geometry Namespace