RhinoCommon SDK
BoundingBox.Corner Method
Rhino for Mac 5.1
 Gets one of the eight corners of the box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d Corner(
	bool minX,
	bool minY,
	bool minZ
)
Public Function Corner (
	minX As Boolean,
	minY As Boolean,
	minZ As Boolean
) As Point3d
Parameters
minX
Type: System.Boolean
true for the minimum on the X axis; false for the maximum.
minY
Type: System.Boolean
true for the minimum on the Y axis; false for the maximum.
minZ
Type: System.Boolean
true for the minimum on the Z axis; false for the maximum.
Return Value
Type: Point3d
The requested point.
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace