RhinoCommon SDK
MaterialRef Methods
Rhino for Mac 5.1
The MaterialRef type exposes the following members.
Methods
Name | Description
Dispose
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace