RhinoCommon SDK
File3dm.ReadWithLog Method (String, String)
Rhino for Mac 5.1
 Read a 3dm file from a specified location and log any archive reading errors.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static File3dm ReadWithLog(
	string path,
	out string errorLog
)
Public Shared Function ReadWithLog (
	path As String,
	<OutAttribute> ByRef errorLog As String
) As File3dm
Parameters
path
Type: System.String
The file to read.
errorLog
Type: System.String
Any archive reading errors are logged here.
Return Value
Type: File3dm
New File3dm on success, null on error.
Exceptions
Exception | Condition
FileNotFoundException | If path does not exist.
See Also
Reference
File3dm Class
ReadWithLog Overload
Rhino.FileIO Namespace