RhinoCommon SDK
ColorLAB.B Property
Rhino for Mac 5.1
 Gets or sets the Opponent channel. The channel is limited to 0~1.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double B { get; set; }
Public Property B As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace