RhinoCommon SDK
BinaryArchiveWriter.WriteInterval Method
Rhino for Mac 5.1
 Writes a Interval value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteInterval(
	Interval value
)
Public Sub WriteInterval (
	value As Interval
)
Parameters
value
Type: Rhino.Geometry.Interval
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace