RhinoCommon SDK
GetBaseClass.AddOptionEnumList<T> Method
Rhino for Mac 5.1
 Add a choice of enum values as list option
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddOptionEnumList<T>(
	string englishOptionName,
	T defaultValue
)
where T : struct, new(), IConvertible
Public Function AddOptionEnumList(Of T As {Structure, New, IConvertible}) (
	englishOptionName As String,
	defaultValue As T
) As Integer
Parameters
englishOptionName
Type: System.String
The name of the option
defaultValue
Type: T
The default value
Type Parameters
T
The enum type
Return Value
Type: Int32
Option index
Exceptions
Exception | Condition
ArgumentException | Gets thrown if defaultValue provided is not an enum type.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace