RhinoCommon SDK
RhinoViewport.IsParallelProjection Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.IsParallelProjection"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsParallelProjection { get; }
Public ReadOnly Property IsParallelProjection As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace