RhinoCommon SDK
ObjectTable.AddRhinoObject Method (CustomPointObject)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomPointObject)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddRhinoObject(
	CustomPointObject pointObject
)
Public Sub AddRhinoObject (
	pointObject As CustomPointObject
)
Parameters
pointObject
Type: Rhino.DocObjects.Custom.CustomPointObject
[Missing <param name="pointObject"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomPointObject)"]
See Also
Reference
ObjectTable Class
AddRhinoObject Overload
Rhino.DocObjects.Tables Namespace