RhinoCommon SDK
ViewportInfo Constructor (ViewportInfo)
Rhino for Mac 5.1
 Initializes a new instance by copying values from another instance.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ViewportInfo(
	ViewportInfo other
)
Public Sub New (
	other As ViewportInfo
)
Parameters
other
Type: Rhino.DocObjects.ViewportInfo
The other viewport info.
See Also
Reference
ViewportInfo Class
ViewportInfo Overload
Rhino.DocObjects Namespace