RhinoCommon SDK
OptionColor.CurrentValue Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.OptionColor.CurrentValue"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color CurrentValue { get; set; }
Public Property CurrentValue As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
OptionColor Class
Rhino.Input.Custom Namespace