RhinoCommon SDK
PolyCurve.SegmentCurveParameter Method
Rhino for Mac 5.1
 Converts a polycurve parameter to a segment curve parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double SegmentCurveParameter(
	double polycurveParameter
)
Public Function SegmentCurveParameter (
	polycurveParameter As Double
) As Double
Parameters
polycurveParameter
Type: System.Double
Parameter on PolyCurve to convert.
Return Value
Type: Double
 Segment curve evaluation parameter or UnsetValue if the segment curve parameter could not be computed.
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace