RhinoCommon SDK
GetObject.EnableUnselectObjectsOnExit Method
Rhino for Mac 5.1
 By default any objects in the object list are unselected when GetObject.GetObjects() exits with any return code besides Object. If you want to leave the objects selected when non-object input is returned, then call EnableUnselectObjectsOnExit(false) before calling GetObjects().
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableUnselectObjectsOnExit(
	bool enable
)
Public Sub EnableUnselectObjectsOnExit (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
The state to set.
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace