RhinoCommon SDK
ObjectAttributes.Name Property
Rhino for Mac 5.1
 Gets or sets an object optional text name.
More than one object in a model can have the same name and some objects may have no name.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace