RhinoCommon SDK
BinaryArchiveWriter.WriteBool Method
Rhino for Mac 5.1
 Writes a Boolean value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteBool(
	bool value
)
Public Sub WriteBool (
	value As Boolean
)
Parameters
value
Type: System.Boolean
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace