RhinoCommon SDK
ViewportInfo.Extents Method (Double, Sphere)
Rhino for Mac 5.1
 Extends this viewport view to include a sphere.
Use Extents() as a quick way to set a viewport to so that bounding volume is inside of a viewports frustrum. The view angle is used to determine the position of the camera.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Extents(
	double halfViewAngleRadians,
	Sphere sphere
)
Public Function Extents (
	halfViewAngleRadians As Double,
	sphere As Sphere
) As Boolean
Parameters
halfViewAngleRadians
Type: System.Double
1/2 smallest subtended view angle in radians.
sphere
Type: Rhino.Geometry.Sphere
A sphere in 3d world coordinates.
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
Extents Overload
Rhino.DocObjects Namespace