RhinoCommon SDK
Transform.Shear Method
Rhino for Mac 5.1
 Constructs a Shear transformation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform Shear(
	Plane plane,
	Vector3d x,
	Vector3d y,
	Vector3d z
)
Public Shared Function Shear (
	plane As Plane,
	x As Vector3d,
	y As Vector3d,
	z As Vector3d
) As Transform
Parameters
plane
Type: Rhino.Geometry.Plane
Base plane for shear.
x
Type: Rhino.Geometry.Vector3d
Shearing vector along plane x-axis.
y
Type: Rhino.Geometry.Vector3d
Shearing vector along plane y-axis.
z
Type: Rhino.Geometry.Vector3d
Shearing vector along plane z-axis.
Return Value
Type: Transform
A transformation matrix which shear geometry.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace