RhinoCommon SDK
CurveObject.CurveGeometry Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.CurveObject.CurveGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve CurveGeometry { get; }
Public ReadOnly Property CurveGeometry As Curve
	Get
Property Value
Type: Curve
See Also
Reference
CurveObject Class
Rhino.DocObjects Namespace