RhinoCommon SDK
Mesh.Split Method (IEnumerable<Mesh>)
Rhino for Mac 5.1
 Split a mesh with a collection of meshes.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Mesh[] Split(
	IEnumerable<Mesh> meshes
)
Public Function Split (
	meshes As IEnumerable(Of Mesh)
) As Mesh()
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
Meshes to split with.
Return Value
Type: Mesh[]
An array of mesh segments representing the split result.
See Also
Reference
Mesh Class
Split Overload
Rhino.Geometry Namespace