RhinoCommon SDK
Mesh.Split Method (Plane)
Rhino for Mac 5.1
 Split a mesh by an infinite plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Mesh[] Split(
	Plane plane
)
Public Function Split (
	plane As Plane
) As Mesh()
Parameters
plane
Type: Rhino.Geometry.Plane
The splitting plane.
Return Value
Type: Mesh[]
A new mesh array with the split result. This can be null if no result was found.
See Also
Reference
Mesh Class
Split Overload
Rhino.Geometry Namespace