RhinoCommon SDK
MeshTopologyEdgeList.GetConnectedFaces Method
Rhino for Mac 5.1
Overload List
Name | Description
GetConnectedFaces(Int32)
 Gets indices of faces connected to an edge.
GetConnectedFaces(Int32, Boolean[])
 Gets indices of faces connected to an edge.
Top
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace