RhinoCommon SDK
BezierCurve.IncreaseDegree Method
Rhino for Mac 5.1
Increase degree of bezier
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IncreaseDegree(
	int desiredDegree
)
Public Function IncreaseDegree (
	desiredDegree As Integer
) As Boolean
Parameters
desiredDegree
Type: System.Int32
Return Value
Type: Boolean
true if successful. false if desiredDegree < current degree.
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace