RhinoCommon SDK
ReplayHistoryData.RecordId Property
Rhino for Mac 5.1
 Each history record has a unique id that Rhino assigns when it adds the history record to the history record table
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid RecordId { get; }
Public ReadOnly Property RecordId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace