RhinoCommon SDK
FileReadOptions.ImportMode Property
Rhino for Mac 5.1
 true means we are merging whatever is being read into an existing document. This means you need to consider things like:
 If the information being read is in a different unit system, it should be scaled if UseScaleGeometry is true.
 There can be existing layers, fonts, materials, dimension styles, hatch patterns, and so on with the same name as items being read from the file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ImportMode { get; set; }
Public Property ImportMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace