RhinoCommon SDK
DisplayPipeline.PostDrawObjects Event
Rhino for Mac 5.1
 Called after all non-highlighted objects have been drawn. Depth writing and testing are still turned on. If you want to draw without depth writing/testing, see DrawForeground.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<DrawEventArgs> PostDrawObjects
Public Shared Event PostDrawObjects As EventHandler(Of DrawEventArgs)
Value
Type: System.EventHandler<DrawEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace