RhinoCommon SDK
StackedDialogPage Class
Rhino for Mac 5.1
 Provides a base class to inherit from for the addition of stacked dialog pages.
Inheritance Hierarchy
System.Object
 Rhino.UI.StackedDialogPage
 Rhino.UI.OptionsDialogPage
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class StackedDialogPage
Public MustInherit Class StackedDialogPage
The StackedDialogPage type exposes the following members.
Constructors
Name | Description
StackedDialogPage
Initializes a new instance of the StackedDialogPage class
Top
Properties
Name | Description
Children
EnglishPageTitle
HasChildren
LocalPageTitle
PageControl
 Return the control that represents this page. Currently only classes derived from System.Windows.Forms.Control are allowed
PageImage
 Opitionally override to provide a image to display in the Mac Rhino UI
ShowDefaultsButton
Called when this page is activated.
Top
Methods
Name | Description
OnActivate
Called when this page is activated/deactivated.
OnApply
Called when stacked dialog OK button is pressed.
OnCancel
Called when stacked dialog Cancel button is pressed.
OnCreateParent
OnDefaults
Called when stacked dialog Defaults button is pressed (see ShowDefaultsButton).
OnHelp
OnSizeParent
Top
See Also
Reference
Rhino.UI Namespace