RhinoCommon SDK
ColorLCH Constructor
Rhino for Mac 5.1
Overload List
Name | Description
ColorLCH(Color)
 Constructs a new instance of ColorLCH that is equivalent to an RGB color.
ColorLCH(Double, Double, Double)
 Constructs a new instance of ColorLCH with custom channel values.
ColorLCH(Double, Double, Double, Double)
 Constructs a new instance of ColorLCH with custom channel values.
Top
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace