RhinoCommon SDK
Box.RepositionBasePlane Method
Rhino for Mac 5.1
 Repositions the origin of the Base plane for this box without affecting the physical dimensions.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void RepositionBasePlane(
	Point3d origin
)
Public Sub RepositionBasePlane (
	origin As Point3d
)
Parameters
origin
Type: Rhino.Geometry.Point3d
The new base plane origin.
See Also
Reference
Box Structure
Rhino.Geometry Namespace