RhinoCommon SDK
BrepLoopList.AddPlanarFaceLoop Method
Rhino for Mac 5.1
 Add a planar trimming loop to a planar face
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepLoop AddPlanarFaceLoop(
	int faceIndex,
	BrepLoopType loopType,
	IEnumerable<Curve> boundaryCurves
)
Public Function AddPlanarFaceLoop (
	faceIndex As Integer,
	loopType As BrepLoopType,
	boundaryCurves As IEnumerable(Of Curve)
) As BrepLoop
Parameters
faceIndex
Type: System.Int32
 index of planar face. The underlying suface must be a PlaneSurface
loopType
Type: Rhino.Geometry.BrepLoopType
 type of loop to add. If loopType is Unknown, then the loop direction is tested and the the new loops type will be set to Outer or Inner. If the loopType is Outer, then the direction of the new loop is tested and flipped if it is clockwise. If the loopType is Inner, then the direction of the new loop is tested and flipped if it is counter-clockwise.
boundaryCurves
Type: System.Collections.Generic.IEnumerable<Curve>
 list of 3d curves that form a simple (no self intersections) closed curve. These curves define the 3d edge geometry and should be near the planar surface.
Return Value
Type: BrepLoop
new loop if successful
See Also
Reference
BrepLoopList Class
Rhino.Geometry.Collections Namespace