RhinoCommon SDK
PointCloud Constructor
Rhino for Mac 5.1
 Initializes a new instance of the PointCloud class that is empty.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PointCloud()
Public Sub New
See Also
Reference
PointCloud Class
PointCloud Overload
Rhino.Geometry Namespace