RhinoCommon SDK
Point3d.Divide Method
Rhino for Mac 5.1
 Divides a Point3d by a number.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d Divide(
	Point3d point,
	double t
)
Public Shared Function Divide (
	point As Point3d,
	t As Double
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
t
Type: System.Double
A number.
Return Value
Type: Point3d
A new point that is coordinatewise divided by t.
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace