RhinoCommon SDK
VisualAnalysisMode.Style Property
Rhino for Mac 5.1
 Gets the visual analysis mode style.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract VisualAnalysisMode.AnalysisStyle Style { get; }
Public MustOverride ReadOnly Property Style As VisualAnalysisMode.AnalysisStyle
	Get
Property Value
Type: VisualAnalysisMode.AnalysisStyle
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace