RhinoCommon SDK
Surface.ClosestSide Method
Rhino for Mac 5.1
 Gets the side that is closest, in terms of 3D-distance, to a U and V parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IsoStatus ClosestSide(
	double u,
	double v
)
Public Function ClosestSide (
	u As Double,
	v As Double
) As IsoStatus
Parameters
u
Type: System.Double
A u parameter.
v
Type: System.Double
A v parameter.
Return Value
Type: IsoStatus
A side.
See Also
Reference
Surface Class
Rhino.Geometry Namespace