RhinoCommon SDK
LineCurve Class
Rhino for Mac 5.1
 Represents a linear curve.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Curve
 Rhino.Geometry.LineCurve
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class LineCurve : Curve
<SerializableAttribute>
Public Class LineCurve
	Inherits Curve
The LineCurve type exposes the following members.
Constructors
Name | Description
LineCurve()
 Initializes a new instance of the LineCurve class.
LineCurve(Line)
 Initializes a new instance of the LineCurve class, by retrieving its value from a line.
LineCurve(LineCurve)
 Initializes a new instance of the LineCurve class, by copying values from another linear curve.
LineCurve(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
LineCurve(Point2d, Point2d)
 Initializes a new instance of the LineCurve class, by setting start and end point from two 2D points.
LineCurve(Point3d, Point3d)
 Initializes a new instance of the LineCurve class, by setting start and end point from two 3D points.
LineCurve(Line, Double, Double)
 Initializes a new instance of the LineCurve class, by retrieving its value from a line and setting the domain.
Top
Properties
Name | Description
Line
 Gets or sets the Line value inside this curve.
Top
Methods
Name | Description
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The Nurbs Curves segments do not have fully multiple interior knots.
 3. Rational Nurbs curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent Colinear or Cocircular segments are combined.
Top
See Also
Reference
Rhino.Geometry Namespace