RhinoCommon SDK
Light.AttenuationVector Property
Rhino for Mac 5.1
 Gets or Sets the attenuation vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d AttenuationVector { get; set; }
Public Property AttenuationVector As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
Light Class
Rhino.Geometry Namespace