RhinoCommon SDK
BezierCurve.MakeNonRational Method
Rhino for Mac 5.1
Make bezier non-rational
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MakeNonRational()
Public Function MakeNonRational As Boolean
Return Value
Type: Boolean
treu if successful
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace