RhinoCommon SDK
GetObject.EnableHighlight Method
Rhino for Mac 5.1
 By default, any object post-pick selected by GetObjects() is highlighted. If you want to post-pick objects and not have them automatically highlight, then call EnableHighlight = false.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableHighlight(
	bool enable
)
Public Sub EnableHighlight (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
[Missing <param name="enable"/> documentation for "M:Rhino.Input.Custom.GetObject.EnableHighlight(System.Boolean)"]
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace