RhinoCommon SDK
ObjectTable.AddInstanceObject Method (Int32, Transform, ObjectAttributes)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddInstanceObject(
	int instanceDefinitionIndex,
	Transform instanceXform,
	ObjectAttributes attributes
)
Public Function AddInstanceObject (
	instanceDefinitionIndex As Integer,
	instanceXform As Transform,
	attributes As ObjectAttributes
) As Guid
Parameters
instanceDefinitionIndex
Type: System.Int32
[Missing <param name="instanceDefinitionIndex"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform,Rhino.DocObjects.ObjectAttributes)"]
instanceXform
Type: Rhino.Geometry.Transform
[Missing <param name="instanceXform"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ObjectTable Class
AddInstanceObject Overload
Rhino.DocObjects.Tables Namespace