RhinoCommon SDK
ClassArrayObjRef Properties
Rhino for Mac 5.1
The ClassArrayObjRef type exposes the following members.
Properties
Name | Description
Count
 Gets the number of CRhinoObjRef instances in this array.
Top
See Also
Reference
ClassArrayObjRef Class
Rhino.Runtime.InteropWrappers Namespace