RhinoCommon SDK
Brep.DuplicateSubBrep Method
Rhino for Mac 5.1
 Copy a subset of this Brep into another Brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep DuplicateSubBrep(
	IEnumerable<int> faceIndices
)
Public Function DuplicateSubBrep (
	faceIndices As IEnumerable(Of Integer)
) As Brep
Parameters
faceIndices
Type: System.Collections.Generic.IEnumerable<Int32>
 array of face indices in this brep to copy. (If any values in faceIndices are out of range or if faceIndices contains duplicates, this function will return null.)
Return Value
Type: Brep
A brep, or null on error.
See Also
Reference
Brep Class
Rhino.Geometry Namespace