RhinoCommon SDK
DisplayMaterial.GetBumpTexture Method
Rhino for Mac 5.1
 Gets the bump texture for this display material.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Texture GetBumpTexture(
	bool front
)
Public Function GetBumpTexture (
	front As Boolean
) As Texture
Parameters
front
Type: System.Boolean
[Missing <param name="front"/> documentation for "M:Rhino.Display.DisplayMaterial.GetBumpTexture(System.Boolean)"]
Return Value
Type: Texture
The texture, or null if no bump texture has been added to this material.
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace