RhinoCommon SDK
GetBaseClass.Dispose Method
Rhino for Mac 5.1
Overload List
Name | Description
Dispose()
Releases all resources used by the GetBaseClass
Dispose(Boolean)
Releases the unmanaged resources used by the GetBaseClass and optionally releases the managed resources
Top
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace