RhinoCommon SDK
GetPoint.EnableSnapToCurves Method
Rhino for Mac 5.1
 If you want GetPoint() to try to snap to curves when the mouse is near a curve (like the center point in the Circle command when the AroundCurve option is on), then enable the snap to curves option.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableSnapToCurves(
	bool enable
)
Public Sub EnableSnapToCurves (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
Whether points should be enabled.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace