RhinoCommon SDK
MeshingParameters Constructor
Rhino for Mac 5.1
 Initializes a new instance with default values.
Initial values are same as Default.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MeshingParameters()
Public Sub New
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace