RhinoCommon SDK
Cone.ToBrep Method
Rhino for Mac 5.1
 Gets a Brep representation of the cone with a single face for the cone, an edge along the cone seam, and vertices at the base and apex ends of this seam edge. The optional cap is a single face with one circular edge starting and ending at the base vertex.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep ToBrep(
	bool capBottom
)
Public Function ToBrep (
	capBottom As Boolean
) As Brep
Parameters
capBottom
Type: System.Boolean
true if the bottom should be filled with a surface. false otherwise.
Return Value
Type: Brep
A brep (polysurface) representation of this cone values.
See Also
Reference
Cone Structure
Rhino.Geometry Namespace