RhinoCommon SDK
Command.InCommand Method
Rhino for Mac 5.1
 Determines if Rhino is currently running a command.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool InCommand()
Public Shared Function InCommand As Boolean
Return Value
Type: Boolean
true if a command is currently running, false if no commands are currently running.
See Also
Reference
Command Class
Rhino.Commands Namespace