RhinoCommon SDK
DimStyleTable Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.DimStyleTable"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.DimStyleTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class DimStyleTable : IEnumerable<DimensionStyle>,
	IEnumerable
Public NotInheritable Class DimStyleTable
	Implements IEnumerable(Of DimensionStyle), IEnumerable
The DimStyleTable type exposes the following members.
Properties
Name | Description
Count
Number of dimstyles in the table.
CurrentDimensionStyle
CurrentDimensionStyleIndex
Document
Document that owns this dimstyle table.
Item
Top
Methods
Name | Description
Add(String)
 Adds a new dimension style to the document. The new dimension style will be initialized with the current default dimension style properties.
Add(String, Boolean)
 Adds a new dimension style to the document. The new dimension style will be initialized with the current default dimension style properties.
DeleteDimensionStyle
Find
GetEnumerator
GetUnusedDimensionStyleName
SetCurrentDimensionStyleIndex
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace