RhinoCommon SDK
File3dmObjectTable.Delete Method
Rhino for Mac 5.1
Overload List
Name | Description
Delete(IEnumerable<Guid>)
 Deletes a collection of objects from the document.
Delete(Guid)
 Deletes object from document.
Delete(File3dmObject)
 Deletes object from document.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace