RhinoCommon SDK
RhinoReplaceObjectEventArgs.ObjectId Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoReplaceObjectEventArgs.ObjectId"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid ObjectId { get; }
Public ReadOnly Property ObjectId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoReplaceObjectEventArgs Class
Rhino.DocObjects Namespace