RhinoCommon SDK
Polyline.ClosestPoint Method
Rhino for Mac 5.1
 Gets the point on the polyline which is closest to a test-point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d ClosestPoint(
	Point3d testPoint
)
Public Function ClosestPoint (
	testPoint As Point3d
) As Point3d
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to approximate.
Return Value
Type: Point3d
The point on the polyline closest to testPoint.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace