RhinoCommon SDK
DisplayPipeline.DrawCurve Method (Curve, Color)
Rhino for Mac 5.1
 Draw a single Curve object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawCurve(
	Curve curve,
	Color color
)
Public Sub DrawCurve (
	curve As Curve,
	color As Color
)
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to draw.
color
Type: System.Drawing.Color
Color to draw with.
See Also
Reference
DisplayPipeline Class
DrawCurve Overload
Rhino.Display Namespace