RhinoCommon SDK
Curve.Trim Method (Interval)
Rhino for Mac 5.1
 Removes portions of the curve outside the specified interval.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve Trim(
	Interval domain
)
Public Function Trim (
	domain As Interval
) As Curve
Parameters
domain
Type: Rhino.Geometry.Interval
 Trimming interval. Portions of the curve before curve(domain[0]) and after curve(domain[1]) are removed.
Return Value
Type: Curve
Trimmed curve if successful, null on failure.
See Also
Reference
Curve Class
Trim Overload
Rhino.Geometry Namespace