RhinoCommon SDK
Curve.Trim Method (Double, Double)
Rhino for Mac 5.1
 Removes portions of the curve outside the specified interval.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve Trim(
	double t0,
	double t1
)
Public Function Trim (
	t0 As Double,
	t1 As Double
) As Curve
Parameters
t0
Type: System.Double
 Start of the trimming interval. Portions of the curve before curve(t0) are removed.
t1
Type: System.Double
 End of the trimming interval. Portions of the curve after curve(t1) are removed.
Return Value
Type: Curve
Trimmed portion of this curve is successfull, null on failure.
See Also
Reference
Curve Class
Trim Overload
Rhino.Geometry Namespace