RhinoCommon SDK
ViewportInfo.SetCameraLocation Method
Rhino for Mac 5.1
 Sets the camera location (position) point.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetCameraLocation(
	Point3d location
)
Public Function SetCameraLocation (
	location As Point3d
) As Boolean
Parameters
location
Type: Rhino.Geometry.Point3d
[Missing <param name="location"/> documentation for "M:Rhino.DocObjects.ViewportInfo.SetCameraLocation(Rhino.Geometry.Point3d)"]
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace