RhinoCommon SDK
ViewportInfo.IsPerspectiveProjection Property
Rhino for Mac 5.1
 Get or set whether this projection is perspective.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsPerspectiveProjection { get; set; }
Public Property IsPerspectiveProjection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace