RhinoCommon SDK
IStackedDialogPageService Methods
Rhino for Mac 5.1
The IStackedDialogPageService type exposes the following members.
Methods
Name | Description
NewObjectPropertiesDialogPagePointer
SelectedObjects
Top
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace