RhinoCommon SDK
Font.AvailableFontFaceNames Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Font.AvailableFontFaceNames"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string[] AvailableFontFaceNames()
Public Shared Function AvailableFontFaceNames As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Font.AvailableFontFaceNames"]
See Also
Reference
Font Class
Rhino.DocObjects Namespace