RhinoCommon SDK
Plane.PointAt Method (Double, Double)
Rhino for Mac 5.1
 Evaluate a point on the plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAt(
	double u,
	double v
)
Public Function PointAt (
	u As Double,
	v As Double
) As Point3d
Parameters
u
Type: System.Double
evaulation parameter.
v
Type: System.Double
evaulation parameter.
Return Value
Type: Point3d
plane.origin + u*plane.xaxis + v*plane.yaxis.
See Also
Reference
Plane Structure
PointAt Overload
Rhino.Geometry Namespace