RhinoCommon SDK
ToolbarFile.Name Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.ToolbarFile.Name"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace