RhinoCommon SDK
HistoryRecord.SetGuids Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetGuids(System.Int32,System.Collections.Generic.IEnumerable{System.Guid})"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetGuids(
	int id,
	IEnumerable<Guid> values
)
Public Function SetGuids (
	id As Integer,
	values As IEnumerable(Of Guid)
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetGuids(System.Int32,System.Collections.Generic.IEnumerable{System.Guid})"]
values
Type: System.Collections.Generic.IEnumerable<Guid>
[Missing <param name="values"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetGuids(System.Int32,System.Collections.Generic.IEnumerable{System.Guid})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetGuids(System.Int32,System.Collections.Generic.IEnumerable{System.Guid})"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace