RhinoCommon SDK
MaterialRef Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.MaterialRef"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.MaterialRef
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MaterialRef : IDisposable
Public Class MaterialRef
	Implements IDisposable
The MaterialRef type exposes the following members.
Properties
Name | Description
BackFaceMaterialId
 The Id of the Material used to render the back of an object.
BackFaceMaterialIndex
 The index of the material used to render the back of an object
FrontFaceMaterialId
 The Id of the Material used to render the front of an object.
FrontFaceMaterialIndex
 The index of the material used to render the front of an object
MaterialSource
 Determines if the simple material should come from the object or from it's layer.
PlugInId
 Identifies a rendering plug-in
Top
Methods
Name | Description
Dispose
Releases all resources used by the MaterialRef
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.DocObjects Namespace