RhinoCommon SDK
Sphere.Radius Property
Rhino for Mac 5.1
 Gets or sets the Radius for this sphere.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace