RhinoCommon SDK
RhinoViewport.ZoomBoundingBox Method
Rhino for Mac 5.1
 Zooms the viewport to the given bounding box.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ZoomBoundingBox(
	BoundingBox box
)
Public Function ZoomBoundingBox (
	box As BoundingBox
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
The bouding box to zoom.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace