RhinoCommon SDK
BinaryArchiveReader.CurrentPosition Property
Rhino for Mac 5.1
current offset (in bytes) into archive ( like ftell() )
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ulong CurrentPosition { get; }
Public ReadOnly Property CurrentPosition As ULong
	Get
Property Value
Type: UInt64
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace