RhinoCommon SDK
BezierCurve Properties
Rhino for Mac 5.1
The BezierCurve type exposes the following members.
Properties
Name | Description
ControlVertexCount
 Number of control vertices in this curve
IsRational
 Gets a value indicating whether or not the curve is rational. Rational curves have control-points with custom weights.
IsValid
Tests an object to see if it is valid.
Top
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace