RhinoCommon SDK
SimpleArrayBrepPointer Class
Rhino for Mac 5.1
 Wrapper for a C++ ON_SimpleArray<ON_Brep*> or ON_SimpleArray<const ON_Brep*> If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer
Namespace: Rhino.Runtime.InteropWrappers
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class SimpleArrayBrepPointer : IDisposable
Public Class SimpleArrayBrepPointer
	Implements IDisposable
The SimpleArrayBrepPointer type exposes the following members.
Constructors
Name | Description
SimpleArrayBrepPointer
 Initializes a new SimpleArrayBrepPointer instance.
Top
Properties
Name | Description
Count
 Gets the amount of breps in this array.
Top
Methods
Name | Description
Add
 Adds a brep to the list.
ConstPointer
 Gets the const (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
Releases the unmanaged resources used by the SimpleArrayBrepPointer and optionally releases the managed resources
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-const pointer (for modification) of this array.
ToNonConstArray
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace