RhinoCommon SDK
GeometryBase.GetBoundingBox Method (Plane, Box)
Rhino for Mac 5.1
 Aligned Boundingbox solver. Gets the plane aligned boundingbox.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox GetBoundingBox(
	Plane plane,
	out Box worldBox
)
Public Function GetBoundingBox (
	plane As Plane,
	<OutAttribute> ByRef worldBox As Box
) As BoundingBox
Parameters
plane
Type: Rhino.Geometry.Plane
Orientation plane for BoundingBox.
worldBox
Type: Rhino.Geometry.Box
Aligned box in World coordinates.
Return Value
Type: BoundingBox
A BoundingBox in plane coordinates.
See Also
Reference
GeometryBase Class
GetBoundingBox Overload
Rhino.Geometry Namespace