RhinoCommon SDK
Localization.SetLanguageId Method
Rhino for Mac 5.1
 Sets the Id used for Localization in RhinoCommon. Only useful for when using RhinoCommon outside of the Rhino process
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool SetLanguageId(
	int id
)
Public Shared Function SetLanguageId (
	id As Integer
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.UI.Localization.SetLanguageId(System.Int32)"]
Return Value
Type: Boolean
true if the language id could be set
See Also
Reference
Localization Class
Rhino.UI Namespace