RhinoCommon SDK
CustomObjectGrips.NurbsSurfaceGrip Method
Rhino for Mac 5.1
 If the grips are control points of a NURBS surface, then this gets the index of the grip that controls the (i,j)-th cv.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual GripObject NurbsSurfaceGrip(
	int i,
	int j
)
Protected Overridable Function NurbsSurfaceGrip (
	i As Integer,
	j As Integer
) As GripObject
Parameters
i
Type: System.Int32
The index in the first dimension.
j
Type: System.Int32
The index in the second dimension.
Return Value
Type: GripObject
A grip controling a NURBS surface CV or null.
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace