RhinoCommon SDK
NurbsCurvePointList.Item Property
Rhino for Mac 5.1
 Gets or sets the control point location at the given index.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ControlPoint this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As ControlPoint
	Get
	Set
Parameters
index
Type: System.Int32
Index of control vertex to access.
Return Value
Type: ControlPoint
The control vertex at [index]
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace