RhinoCommon SDK
BinaryArchiveFile Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.FileIO.BinaryArchiveFile"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.BinaryArchiveFile
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class BinaryArchiveFile : IDisposable
Public Class BinaryArchiveFile
	Implements IDisposable
The BinaryArchiveFile type exposes the following members.
Constructors
Name | Description
BinaryArchiveFile
Initializes a new instance of the BinaryArchiveFile class
Top
Properties
Name | Description
Reader
Writer
Top
Methods
Name | Description
Close
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Open
Top
See Also
Reference
Rhino.FileIO Namespace