RhinoCommon SDK
RhinoPageView.PageViewSpaceChange Event
Rhino for Mac 5.1
[Missing <summary> documentation for "E:Rhino.Display.RhinoPageView.PageViewSpaceChange"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<PageViewSpaceChangeEventArgs> PageViewSpaceChange
Public Shared Event PageViewSpaceChange As EventHandler(Of PageViewSpaceChangeEventArgs)
Value
Type: System.EventHandler<PageViewSpaceChangeEventArgs>
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace