RhinoCommon SDK
Extrusion.ToBrep Method (Boolean)
Rhino for Mac 5.1
 Constructs a brep form of the extrusion. The outer profile is always the first face of the brep. If there are inner profiles, additional brep faces are created for each profile. If the outer profile is closed, then end caps are added as the last two faces of the brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep ToBrep(
	bool splitKinkyFaces
)
Public Function ToBrep (
	splitKinkyFaces As Boolean
) As Brep
Parameters
splitKinkyFaces
Type: System.Boolean
 If true and the profiles have kinks, then the faces corresponding to those profiles are split so they will be G1.
Return Value
Type: Brep
A brep with a similar shape like this extrustion, or null on error.
See Also
Reference
Extrusion Class
ToBrep Overload
Rhino.Geometry Namespace