RhinoCommon SDK
VisualAnalysisMode.AnalysisStyle Enumeration
Rhino for Mac 5.1
 Contains enumerated values for analysis styles, such as wireframe, texture or false colors..
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum AnalysisStyle
Public Enumeration AnalysisStyle
Members
Member name | Value | Description
Wireframe | 1 | The analysis is showing with wires.
Texture | 2 | The analysis is showing with textures.
FalseColor | 4 | The analysis is showing with false colors.
See Also
Reference
Rhino.Display Namespace