RhinoCommon SDK
GumballDisplayConduit Methods
Rhino for Mac 5.1
The GumballDisplayConduit type exposes the following members.
Methods
Name | Description
CheckShiftAndControlKeys
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
PickGumball
SetBaseGumball(GumballObject)
 Contents of the gumball are copied to the base gumball of this class.
SetBaseGumball(GumballObject, GumballAppearanceSettings)
 Contents of the gumball are copied to the base gumball of this class.
UpdateGumball
Top
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace