RhinoCommon SDK
DisplayPipelineAttributes.CurveThickness Property
Rhino for Mac 5.1
Pixel thickness for curves
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int CurveThickness { get; set; }
Public Property CurveThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace