RhinoCommon SDK
GroupTable.IsDeleted Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.GroupTable.IsDeleted(System.Int32)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsDeleted(
	int groupIndex
)
Public Function IsDeleted (
	groupIndex As Integer
) As Boolean
Parameters
groupIndex
Type: System.Int32
[Missing <param name="groupIndex"/> documentation for "M:Rhino.DocObjects.Tables.GroupTable.IsDeleted(System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.GroupTable.IsDeleted(System.Int32)"]
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace