RhinoCommon SDK
Extrusion.CreateCylinderExtrusion Method
Rhino for Mac 5.1
 Gets an extrusion form of a cylinder.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Extrusion CreateCylinderExtrusion(
	Cylinder cylinder,
	bool capBottom,
	bool capTop
)
Public Shared Function CreateCylinderExtrusion (
	cylinder As Cylinder,
	capBottom As Boolean,
	capTop As Boolean
) As Extrusion
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
IsFinite must be true.
capBottom
Type: System.Boolean
If true, the end at cylinder.Height1 will be capped.
capTop
Type: System.Boolean
If true, the end at cylinder.Height2 will be capped.
Return Value
Type: Extrusion
Extrusion on success. null on failure.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace