RhinoCommon SDK
StatusBar.ClearMessagePane Method
Rhino for Mac 5.1
 Removes the message from the message pane.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void ClearMessagePane()
Public Shared Sub ClearMessagePane
See Also
Reference
StatusBar Class
Rhino.UI Namespace