RhinoCommon SDK
Curve.PullToBrepFace Method (BrepFace, Double)
Rhino for Mac 5.1
 Pulls this curve to a brep face and returns the result of that operation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] PullToBrepFace(
	BrepFace face,
	double tolerance
)
Public Function PullToBrepFace (
	face As BrepFace,
	tolerance As Double
) As Curve()
Parameters
face
Type: Rhino.Geometry.BrepFace
A brep face.
tolerance
Type: System.Double
A tolerance value.
Return Value
Type: Curve[]
An array containing the resulting curves after pulling. This array could be empty.
Exceptions
Exception | Condition
ArgumentNullException | If face is null.
See Also
Reference
Curve Class
PullToBrepFace Overload
Rhino.Geometry Namespace