RhinoCommon SDK
BrepFace.AdjacentEdges Method
Rhino for Mac 5.1
 Gets the indices of all the BrepEdges that delineate this Face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] AdjacentEdges()
Public Function AdjacentEdges As Integer()
Return Value
Type: Int32[]
[Missing <returns> documentation for "M:Rhino.Geometry.BrepFace.AdjacentEdges"]
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace