RhinoCommon SDK
CustomDisplay.AddText Method
Rhino for Mac 5.1
Overload List
Name | Description
AddText(Text3d, Color)
 Adds a new 3D text object to the display list.
AddText(String, Plane, Double)
 Adds a new, black 3D text object to the display list.
AddText(String, Plane, Double, Color)
 Adds a new, colored 3D text object to the display list.
Top
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace