RhinoCommon SDK
GetPoint.PermitFromOption Method
Rhino for Mac 5.1
 Control the availability of the built-in "From" option. By default, the "From" option is enabled.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PermitFromOption(
	bool permit
)
Public Sub PermitFromOption (
	permit As Boolean
)
Parameters
permit
Type: System.Boolean
 if true, then the "From" option is automatically avaiable in GetPoint.
Remarks
 The GetPoint "From" option is never visible on the command line and the user must type the complete option name to activate the "From" option. When the GetPoint "From" snap is enabled, the user set/change the base point during GetPoint by typing "From" and picking a point. A related option is the builit-in distance from base point constraint that is can be set before GetPoint is called by passing a value to GetPoint::ConstrainDistanceFromBasePoint or during GetPoint by entering a number.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace