RhinoCommon SDK
VolumeMassProperties.WorldCoordinatesSecondMoments Property
Rhino for Mac 5.1
 Returns the world coordinate first moments if they were able to be calculated. X is integral of "xx dm" over the area Y is integral of "yy dm" over the area Z is integral of "zz dm" over the area.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d WorldCoordinatesSecondMoments { get; }
Public ReadOnly Property WorldCoordinatesSecondMoments As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace