RhinoCommon SDK
PolyCurve.SegmentCount Property
Rhino for Mac 5.1
 Gets the number of segments that make up this Polycurve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int SegmentCount { get; }
Public ReadOnly Property SegmentCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace