RhinoCommon SDK
Curve.IsPeriodic Property
Rhino for Mac 5.1
 Gets a value indicating whether or not this curve is considered to be Periodic.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsPeriodic { get; }
Public ReadOnly Property IsPeriodic As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Curve Class
Rhino.Geometry Namespace