RhinoCommon SDK
File3dmObject.Attributes Property
Rhino for Mac 5.1
 Gets the attributes that are linked with this document object.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectAttributes Attributes { get; }
Public ReadOnly Property Attributes As ObjectAttributes
	Get
Property Value
Type: ObjectAttributes
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace