RhinoCommon SDK
Arc Constructor (Point3d, Double, Double)
Rhino for Mac 5.1
 Initializes a new horizontal arc at the given center point, with a custom radius and angle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Arc(
	Point3d center,
	double radius,
	double angleRadians
)
Public Sub New (
	center As Point3d,
	radius As Double,
	angleRadians As Double
)
Parameters
center
Type: Rhino.Geometry.Point3d
Center point of arc.
radius
Type: System.Double
Radius of arc.
angleRadians
Type: System.Double
Sweep angle of arc (in radians)
See Also
Reference
Arc Structure
Arc Overload
Rhino.Geometry Namespace