RhinoCommon SDK
ObjectEnumeratorSettings.LayerIndexFilter Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.LayerIndexFilter"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int LayerIndexFilter { get; set; }
Public Property LayerIndexFilter As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace