RhinoCommon SDK
Curve.CreateMeanCurve Method
Rhino for Mac 5.1
Overload List
Name | Description
CreateMeanCurve(Curve, Curve)
 Constructs a mean, or average, curve from two curves.
CreateMeanCurve(Curve, Curve, Double)
 Constructs a mean, or average, curve from two curves.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace