RhinoCommon SDK
ObjectAttributes.PlotWeight Property
Rhino for Mac 5.1
 Plot weight in millimeters. =0.0 means use the default width <0.0 means don't plot (visible for screen display, but does not show on plot)
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double PlotWeight { get; set; }
Public Property PlotWeight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace