RhinoCommon SDK
PointCloud.Item Property
Rhino for Mac 5.1
 Gets the item at the given index.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PointCloudItem this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As PointCloudItem
	Get
Parameters
index
Type: System.Int32
Index of item to retrieve.
Return Value
Type: PointCloudItem
The item at the given index.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace