RhinoCommon SDK
RenderSettings.UseViewportSize Property
Rhino for Mac 5.1
 Gets or sets a value indicating whether to use the resolution of the viewport being rendered or ImageSize when rendering
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UseViewportSize { get; set; }
Public Property UseViewportSize As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderSettings Class
Rhino.Render Namespace