RhinoCommon SDK
Circle.Unset Property
Rhino for Mac 5.1
 Gets a circle with Unset components.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Circle Unset { get; }
Public Shared ReadOnly Property Unset As Circle
	Get
Property Value
Type: Circle
See Also
Reference
Circle Structure
Rhino.Geometry Namespace