RhinoCommon SDK
GetPoint.MouseMove Event
Rhino for Mac 5.1
 Called every time the mouse moves. MouseMove is called once per mouse move and is called BEFORE any calls to OnDynamicDraw. If you are doing anything that takes a long time, periodically call InterruptMouseMove() to see if you should stop. If the view is such that the 2d screen point can't be mapped to a 3d point, the 'point' argument will be Unset.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public event EventHandler<GetPointMouseEventArgs> MouseMove
Public Event MouseMove As EventHandler(Of GetPointMouseEventArgs)
Value
Type: System.EventHandler<GetPointMouseEventArgs>
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace