RhinoCommon SDK
RhinoViewport.WallpaperVisible Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.WallpaperVisible"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool WallpaperVisible { get; }
Public ReadOnly Property WallpaperVisible As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace