RhinoCommon SDK
SplopSpaceMorph Constructor (Plane, Surface, Point2d, Double, Double)
Rhino for Mac 5.1
 Constructs a flow space morph.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public SplopSpaceMorph(
	Plane plane,
	Surface surface,
	Point2d surfaceParam,
	double scale,
	double angle
)
Public Sub New (
	plane As Plane,
	surface As Surface,
	surfaceParam As Point2d,
	scale As Double,
	angle As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
Source plane of deformation.
surface
Type: Rhino.Geometry.Surface
Surface to wrap objects onto.
surfaceParam
Type: Rhino.Geometry.Point2d
U,V parameter on surface used for orienting.
scale
Type: System.Double
Scale factor. To ignore, use Rhino.RhinoMath.UnsetValue.
angle
Type: System.Double
Rotation angle in radians. To ignore, use Rhino.RhinoMath.UnsetValue.
See Also
Reference
SplopSpaceMorph Class
SplopSpaceMorph Overload
Rhino.Geometry.Morphs Namespace