RhinoCommon SDK
Layer.SetPersistentVisibility Method
Rhino for Mac 5.1
 Set the persistent visibility setting for this layer
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetPersistentVisibility(
	bool persistentVisibility
)
Public Sub SetPersistentVisibility (
	persistentVisibility As Boolean
)
Parameters
persistentVisibility
Type: System.Boolean
[Missing <param name="persistentVisibility"/> documentation for "M:Rhino.DocObjects.Layer.SetPersistentVisibility(System.Boolean)"]
See Also
Reference
Layer Class
Rhino.DocObjects Namespace