RhinoCommon SDK
Mesh.CreateBooleanSplit Method
Rhino for Mac 5.1
 Splits a set of meshes with another set.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Mesh[] CreateBooleanSplit(
	IEnumerable<Mesh> meshesToSplit,
	IEnumerable<Mesh> meshSplitters
)
Public Shared Function CreateBooleanSplit (
	meshesToSplit As IEnumerable(Of Mesh),
	meshSplitters As IEnumerable(Of Mesh)
) As Mesh()
Parameters
meshesToSplit
Type: System.Collections.Generic.IEnumerable<Mesh>
A list, an array, or any enumerable set of meshes to be split. If this is null, null will be returned.
meshSplitters
Type: System.Collections.Generic.IEnumerable<Mesh>
A list, an array, or any enumerable set of meshes that cut. If this is null, null will be returned.
Return Value
Type: Mesh[]
A new mesh array, or null on error.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace