RhinoCommon SDK
Hatch.PatternRotation Property
Rhino for Mac 5.1
 Gets or sets the relative rotation of the pattern.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double PatternRotation { get; set; }
Public Property PatternRotation As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Hatch Class
Rhino.Geometry Namespace