RhinoCommon SDK
File3dm.ApplicationUrl Property
Rhino for Mac 5.1
 Gets or sets a URL for the application that wrote this file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string ApplicationUrl { get; set; }
Public Property ApplicationUrl As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dm Class
Rhino.FileIO Namespace