RhinoCommon SDK
Brep.CreateFromMesh Method
Rhino for Mac 5.1
 Create a brep representation of a mesh
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep CreateFromMesh(
	Mesh mesh,
	bool trimmedTriangles
)
Public Shared Function CreateFromMesh (
	mesh As Mesh,
	trimmedTriangles As Boolean
) As Brep
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.Geometry.Brep.CreateFromMesh(Rhino.Geometry.Mesh,System.Boolean)"]
trimmedTriangles
Type: System.Boolean
 if true, triangles in the mesh will be represented by trimmed planes in the brep. If false, triangles in the mesh will be represented by untrimmed singular bilinear NURBS surfaces in the brep.
Return Value
Type: Brep
[Missing <returns> documentation for "M:Rhino.Geometry.Brep.CreateFromMesh(Rhino.Geometry.Mesh,System.Boolean)"]
See Also
Reference
Brep Class
Rhino.Geometry Namespace