RhinoCommon SDK
Panels Events
Rhino for Mac 5.1
The Panels type exposes the following members.
Events
Name | Description
Show
 This event is called when a panel is opened or closed
Top
See Also
Reference
Panels Class
Rhino.UI Namespace