RhinoCommon SDK
LayerTable.ForceLayerVisible Method (Guid)
Rhino for Mac 5.1
 Makes a layer and all of its parent layers visible.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ForceLayerVisible(
	Guid layerId
)
Public Function ForceLayerVisible (
	layerId As Guid
) As Boolean
Parameters
layerId
Type: System.Guid
The layer ID to be made visible.
Return Value
Type: Boolean
true if the operation succeeded.
See Also
Reference
LayerTable Class
ForceLayerVisible Overload
Rhino.DocObjects.Tables Namespace