RhinoCommon SDK
RhinoObject.OnAddToDocument Method
Rhino for Mac 5.1
 This call informs an object it is about to be added to the list of active objects in the document.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnAddToDocument(
	RhinoDoc doc
)
Protected Overridable Sub OnAddToDocument (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.DocObjects.RhinoObject.OnAddToDocument(Rhino.RhinoDoc)"]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace