RhinoCommon SDK
BlendMode Enumeration
Rhino for Mac 5.1
 Defines enmerated constants for display blend modes.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum BlendMode
Public Enumeration BlendMode
Members
Member name | Value | Description
Zero | 0 |  Blends using 0.
One | 1 |  Blends using 1.
SourceColor | 768 |  Blends using source color.
OneMinusSourceColor | 769 |  Blends using 1-source color.
SourceAlpha | 770 |  Blends using the source alpha channel.
OneMinusSourceAlpha | 771 |  Blends using 1-the source alpha channel.
DestinationAlpha | 772 |  Blends using the destination alpha channel.
OneMinusDestinationAlpha | 773 |  Blends using 1-the destination alpha channel.
DestinationColor | 774 |  Blends using the destination color.
OneMinusDestinationColor | 775 |  Blends using 1-the destination color.
SourceAlphaSaturate | 776 |  Blends using the source alpha saturation.
See Also
Reference
Rhino.Display Namespace