RhinoCommon SDK
SelCommand.SelFilter Method
Rhino for Mac 5.1
 Override this virtual function and return true if object should be selected.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected abstract bool SelFilter(
	RhinoObject rhObj
)
Protected MustOverride Function SelFilter (
	rhObj As RhinoObject
) As Boolean
Parameters
rhObj
Type: Rhino.DocObjects.RhinoObject
The object to check regarding selection status.
Return Value
Type: Boolean
true if the object should be selected; false otherwise.
See Also
Reference
SelCommand Class
Rhino.Commands Namespace