RhinoCommon SDK
MeshTopologyEdgeList Class
Rhino for Mac 5.1
 Represents an entry point to the list of edges in a mesh topology.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.MeshTopologyEdgeList
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MeshTopologyEdgeList
Public Class MeshTopologyEdgeList
The MeshTopologyEdgeList type exposes the following members.
Properties
Name | Description
Count
 Gets the amount of edges in this list.
Top
Methods
Name | Description
CollapseEdge
 Replaces a mesh edge with a vertex at its center and update adjacent faces as needed.
EdgeLine
Gets the 3d line along an edge.
GetConnectedFaces(Int32)
 Gets indices of faces connected to an edge.
GetConnectedFaces(Int32, Boolean[])
 Gets indices of faces connected to an edge.
GetEdgeIndex
 Returns index of edge that connects topological vertices. returns -1 if no edge is found.
GetEdgesForFace(Int32)
 Gets indices of edges that surround a given face.
GetEdgesForFace(Int32, Boolean[])
 Gets indices of edges that surround a given face.
GetTopologyVertices
Gets the two topology vertices for a given topology edge.
IsHidden
 Returns true if the topological edge is hidden. The mesh topology edge is hidden only if either of its mesh topology vertices is hidden.
IsSwappableEdge
 Determines if a mesh edge index is valid input for SwapEdge(Int32).
SplitEdge(Int32, Point3d)
 Divides a mesh edge to create two or more triangles
SplitEdge(Int32, Double)
 Divides a mesh edge to create two or more triangles
SwapEdge
 If the edge is shared by two triangular face, then the edge is swapped.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace