RhinoCommon SDK
Arc.Equals Method (Object)
Rhino for Mac 5.1
 Determines whether another object is an arc and has the same value as this arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
An object.
Return Value
Type: Boolean
true if obj is an arc and is exactly equal to this arc; otherwise false.
See Also
Reference
Arc Structure
Equals Overload
Rhino.Geometry Namespace