RhinoCommon SDK
Light.LightStyle Property
Rhino for Mac 5.1
 Gets or sets a light style on this camera.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public LightStyle LightStyle { get; set; }
Public Property LightStyle As LightStyle
	Get
	Set
Property Value
Type: LightStyle
See Also
Reference
Light Class
Rhino.Geometry Namespace