RhinoCommon SDK
BinaryArchiveWriter.WriteString Method
Rhino for Mac 5.1
 Writes a String value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteString(
	string value
)
Public Sub WriteString (
	value As String
)
Parameters
value
Type: System.String
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace