RhinoCommon SDK
LinetypeTable.Find Method (Guid, Boolean)
Rhino for Mac 5.1
Finds a linetype with a matching ID.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Find(
	Guid id,
	bool ignoreDeletedLinetypes
)
Public Function Find (
	id As Guid,
	ignoreDeletedLinetypes As Boolean
) As Integer
Parameters
id
Type: System.Guid
The ID of the line type to be found.
ignoreDeletedLinetypes
Type: System.Boolean
If true, deleted linetypes are not checked.
Return Value
Type: Int32
 Zero or a positive value if the index of the linetype with the given ID is found.
-1 if no linetype has the given ID.
See Also
Reference
LinetypeTable Class
Find Overload
Rhino.DocObjects.Tables Namespace