RhinoCommon SDK
GetInteger Class
Rhino for Mac 5.1
Used to get integer numbers.
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetBaseClass
 Rhino.Input.Custom.GetInteger
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class GetInteger : GetBaseClass
Public Class GetInteger
	Inherits GetBaseClass
The GetInteger type exposes the following members.
Constructors
Name | Description
GetInteger
Initializes a new instance of the GetInteger class
Top
Methods
Name | Description
Get
 Call to get an integer.
Number
SetLowerLimit
 Sets a lower limit on the number that can be returned. By default there is no lower limit.
SetUpperLimit
 Sets an upper limit on the number that can be returned. By default there is no upper limit.
Top
See Also
Reference
Rhino.Input.Custom Namespace