RhinoCommon SDK
CommandEventArgs.CommandEnglishName Property
Rhino for Mac 5.1
 Gets the English name of the command that raised this event.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string CommandEnglishName { get; }
Public ReadOnly Property CommandEnglishName As String
	Get
Property Value
Type: String
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace