RhinoCommon SDK
LocalizeStringPair Class
Rhino for Mac 5.1
Pair of strings used for localization.
Inheritance Hierarchy
System.Object
 Rhino.UI.LocalizeStringPair
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class LocalizeStringPair
Public NotInheritable Class LocalizeStringPair
The LocalizeStringPair type exposes the following members.
Constructors
Name | Description
LocalizeStringPair
Initializes a new instance of the LocalizeStringPair class
Top
Properties
Name | Description
English
Local
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace