RhinoCommon SDK
Box Constructor (Plane, GeometryBase)
Rhino for Mac 5.1
 Initializes a box that contains a generic piece of geometry. This box will be aligned with an arbitrary plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Box(
	Plane basePlane,
	GeometryBase geometry
)
Public Sub New (
	basePlane As Plane,
	geometry As GeometryBase
)
Parameters
basePlane
Type: Rhino.Geometry.Plane
Base plane for aligned bounding box.
geometry
Type: Rhino.Geometry.GeometryBase
Geometry to box.
See Also
Reference
Box Structure
Box Overload
Rhino.Geometry Namespace