RhinoCommon SDK
CurveList.Add Method (Ellipse)
Rhino for Mac 5.1
 Adds an ellipse to this list.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Add(
	Ellipse ellipse
)
Public Sub Add (
	ellipse As Ellipse
)
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
An ellipse that will be the model of the new internal curve.
See Also
Reference
CurveList Class
Add Overload
Rhino.Collections Namespace