RhinoCommon SDK
CurveList.Add Method (Line)
Rhino for Mac 5.1
 Adds a line to this list.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Add(
	Line line
)
Public Sub Add (
	line As Line
)
Parameters
line
Type: Rhino.Geometry.Line
A line value that will be the model of the new internal curve.
See Also
Reference
CurveList Class
Add Overload
Rhino.Collections Namespace