RhinoCommon SDK
CurveList.Add Method (IEnumerable<Point3d>)
Rhino for Mac 5.1
 Adds a polyline to this list.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Add(
	IEnumerable<Point3d> polyline
)
Public Sub Add (
	polyline As IEnumerable(Of Point3d)
)
Parameters
polyline
Type: System.Collections.Generic.IEnumerable<Point3d>
A polyline value that will be copied in a new polyline.
This argument can be null, an array, a list or any enumerable set of Point3d.
See Also
Reference
CurveList Class
Add Overload
Rhino.Collections Namespace