RhinoCommon SDK
DisplayMaterial Constructor
Rhino for Mac 5.1
 Constructs a default material.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DisplayMaterial()
Public Sub New
See Also
Reference
DisplayMaterial Class
DisplayMaterial Overload
Rhino.Display Namespace