RhinoCommon SDK
DisplayPipelineAttributes.MeshDisplayAttributes.HighlightMeshes Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes.HighlightMeshes"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool HighlightMeshes { get; set; }
Public Property HighlightMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes.MeshDisplayAttributes Class
Rhino.Display Namespace