RhinoCommon SDK
BrepEdgeList Class
Rhino for Mac 5.1
 Provides access to all the Edges in a Brep object.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.BrepEdgeList
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class BrepEdgeList : IEnumerable<BrepEdge>,
	IEnumerable
Public Class BrepEdgeList
	Implements IEnumerable(Of BrepEdge), IEnumerable
The BrepEdgeList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of brep edges.
Item
 Gets the BrepEdge at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
Methods
Name | Description
Add(Int32)
 Create and add a new edge to this list
Add(Int32, Int32, Int32, Double)
 Create and add a new edge to this list
Add(BrepVertex, BrepVertex, Int32, Double)
 Create and add a new edge to this list
Add(Int32, Int32, Int32, Interval, Double)
 Create and add a new edge to this list
Add(BrepVertex, BrepVertex, Int32, Interval, Double)
 Create and add a new edge to this list
GetEnumerator
 Gets an enumerator that visits all edges.
SplitEdgeAtParameters
 Splits an edge at the specified parameters.
SplitKinkyEdge
Splits the edge into G1 pieces.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace