RhinoCommon SDK
BrepFaceList.SplitClosedFaces Method
Rhino for Mac 5.1
 Splits closed surfaces so they are not closed.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SplitClosedFaces(
	int minimumDegree
)
Public Function SplitClosedFaces (
	minimumDegree As Integer
) As Boolean
Parameters
minimumDegree
Type: System.Int32
 If the degree of the surface < min_degree, the surface is not split. In some cases, minimumDegree = 2 is useful to preserve piecewise linear surfaces.
Return Value
Type: Boolean
true if successful.
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace