RhinoCommon SDK
BinaryArchiveWriter.WriteBoundingBox Method
Rhino for Mac 5.1
 Writes a BoundingBox value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteBoundingBox(
	BoundingBox value
)
Public Sub WriteBoundingBox (
	value As BoundingBox
)
Parameters
value
Type: Rhino.Geometry.BoundingBox
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace