RhinoCommon SDK
LayerTable.SetCurrentLayerIndex Method
Rhino for Mac 5.1
 At all times, there is a "current" layer. Unless otherwise specified, new objects are assigned to the current layer. The current layer is never locked, hidden, or deleted.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetCurrentLayerIndex(
	int layerIndex,
	bool quiet
)
Public Function SetCurrentLayerIndex (
	layerIndex As Integer,
	quiet As Boolean
) As Boolean
Parameters
layerIndex
Type: System.Int32
 Value for new current layer. 0 <= layerIndex < LayerTable.Count. The layer's mode is automatically set to NormalMode.
quiet
Type: System.Boolean
 if true, then no warning message box pops up if the current layer request can't be satisfied.
Return Value
Type: Boolean
true if current layer index successfully set.
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace