RhinoCommon SDK
AreaMassProperties.WorldCoordinatesFirstMomentsError Property
Rhino for Mac 5.1
 Uncertainty in world coordinates first moments calculation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d WorldCoordinatesFirstMomentsError { get; }
Public ReadOnly Property WorldCoordinatesFirstMomentsError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace