RhinoCommon SDK
Point2f.Unset Property
Rhino for Mac 5.1
 Gets the standard unset point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point2f Unset { get; }
Public Shared ReadOnly Property Unset As Point2f
	Get
Property Value
Type: Point2f
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace