RhinoCommon SDK
BinaryArchiveReader.ReadInt Method
Rhino for Mac 5.1
 Reads a Int32 from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ReadInt()
Public Function ReadInt As Integer
Return Value
Type: Int32
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace