RhinoCommon SDK
Curve.OffsetOnSurface Method (Surface, Point2d, Double)
Rhino for Mac 5.1
 Offset a curve on a surface. This curve must lie on the surface.
This overload allows to specify a surface point at which the offset will pass.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] OffsetOnSurface(
	Surface surface,
	Point2d throughPoint,
	double fittingTolerance
)
Public Function OffsetOnSurface (
	surface As Surface,
	throughPoint As Point2d,
	fittingTolerance As Double
) As Curve()
Parameters
surface
Type: Rhino.Geometry.Surface
A surface on which to offset.
throughPoint
Type: Rhino.Geometry.Point2d
2d point on the brep face to offset through.
fittingTolerance
Type: System.Double
A fitting tolerance.
Return Value
Type: Curve[]
Offset curves on success, or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | If surface is null.
See Also
Reference
Curve Class
OffsetOnSurface Overload
Rhino.Geometry Namespace