RhinoCommon SDK
GeometryBase.OnSwitchToNonConst Method
Rhino for Mac 5.1
 Is called when a non-const operation occurs.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected override void OnSwitchToNonConst()
Protected Overrides Sub OnSwitchToNonConst
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace