RhinoCommon SDK
Sphere.ToBrep Method
Rhino for Mac 5.1
 Converts this sphere is it Brep representation
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep ToBrep()
Public Function ToBrep As Brep
Return Value
Type: Brep
[Missing <returns> documentation for "M:Rhino.Geometry.Sphere.ToBrep"]
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace