RhinoCommon SDK
TextureMapping.CreatePlaneMapping Method
Rhino for Mac 5.1
Create a planar projection texture mapping
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static TextureMapping CreatePlaneMapping(
	Plane plane,
	Interval dx,
	Interval dy,
	Interval dz
)
Public Shared Function CreatePlaneMapping (
	plane As Plane,
	dx As Interval,
	dy As Interval,
	dz As Interval
) As TextureMapping
Parameters
plane
Type: Rhino.Geometry.Plane
A plane to use for mapping.
dx
Type: Rhino.Geometry.Interval
portion of the plane's x axis that is mapped to [0,1] (can be a decreasing interval)
dy
Type: Rhino.Geometry.Interval
portion of the plane's y axis that is mapped to [0,1] (can be a decreasing interval)
dz
Type: Rhino.Geometry.Interval
portion of the plane's z axis that is mapped to [0,1] (can be a decreasing interval)
Return Value
Type: TextureMapping
TextureMapping instance if input is valid
See Also
Reference
TextureMapping Class
Rhino.Render Namespace