RhinoCommon SDK
ColorHSL Methods
Rhino for Mac 5.1
The ColorHSL type exposes the following members.
Methods
Name | Description
CreateFromCMYK
 Create the nearest HSL equivalent of a CMYK color.
CreateFromLAB
 Create the nearest HSL equivalent of a LAB color.
CreateFromLCH
 Create the nearest HSL equivalent of a LCH color.
CreateFromXYZ
 Create the nearest HSL equivalent of an XYZ color.
ToArgbColor
 Convert HSL color to an equivalent System.Drawing.Color.
Top
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace