RhinoCommon SDK
IntersectionEvent.ParameterA Property
Rhino for Mac 5.1
 Gets the parameter on Curve A where the intersection occured. If the intersection type is overlap, then this will return the start of the overlap region.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ParameterA { get; }
Public ReadOnly Property ParameterA As Double
	Get
Property Value
Type: Double
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace