RhinoCommon SDK
Plane.Equals Method
Rhino for Mac 5.1
Overload List
Name | Description
Equals(Object)
 Determines if an object is a plane and has the same components as this plane.
 (Overrides ValueType.Equals(Object).)
Equals(Plane)
 Determines if another plane has the same components as this plane.
Top
See Also
Reference
Plane Structure
Rhino.Geometry Namespace