RhinoCommon SDK
BrepFaceList.Item Property
Rhino for Mac 5.1
 Gets the BrepFace at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepFace this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As BrepFace
	Get
Parameters
index
Type: System.Int32
Index of BrepFace to access.
Return Value
Type: BrepFace
The BrepFace at [index].
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace