RhinoCommon SDK
SimpleArraySurfacePointer Class
Rhino for Mac 5.1
 Wrapper for a C++ ON_SimpleArray of ON_Surface* or const ON_Surface*. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer
Namespace: Rhino.Runtime.InteropWrappers
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class SimpleArraySurfacePointer : IDisposable
Public Class SimpleArraySurfacePointer
	Implements IDisposable
The SimpleArraySurfacePointer type exposes the following members.
Constructors
Name | Description
SimpleArraySurfacePointer
 Initializes a new SimpleArraySurfacePointer instance.
Top
Methods
Name | Description
ConstPointer
 Gets the const (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-const pointer (for modification) of this array.
ToNonConstArray
 Copies the unmanaged array to a managed counterpart. Elements are made non-const.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace