RhinoCommon SDK
BrepRegion Methods
Rhino for Mac 5.1
The BrepRegion type exposes the following members.
Methods
Name | Description
BoundaryBrep
 Gets the boundary of a region as a brep object. If the region is finite, the boundary will be a closed manifold brep. The boundary may have more than one connected component.
GetFaceSides
 Gets an array of BrepRegionFaceSide entities delimiting this region.
Top
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace