RhinoCommon SDK
CustomCurveObject Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.CustomCurveObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.CurveObject
 Rhino.DocObjects.Custom.CustomCurveObject
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class CustomCurveObject : CurveObject,
	IDisposable
Public MustInherit Class CustomCurveObject
	Inherits CurveObject
	Implements IDisposable
The CustomCurveObject type exposes the following members.
Constructors
Name | Description
CustomCurveObject()
Initializes a new instance of the CustomCurveObject class
CustomCurveObject(Curve)
Initializes a new instance of the CustomCurveObject class
Top
Properties
Name | Description
Top
Methods
Name | Description
Dispose()
Releases all resources used by the CustomCurveObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomCurveObject and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
SetCurve
 Only for developers who are defining custom subclasses of CurveObject. Directly sets the internal curve geometry for this object. Note that this function does not work with Rhino's "undo".
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace