RhinoCommon SDK
Interval.Subtraction Operator (Double, Interval)
Rhino for Mac 5.1
 Shifts an interval by a specific amount (subtraction).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Interval operator -(
	double number,
	Interval interval
)
Public Shared Operator - (
	number As Double,
	interval As Interval
) As Interval
Parameters
number
Type: System.Double
The shifting value to subtract from (minuend).
interval
Type: Rhino.Geometry.Interval
The interval to be subtracted from (subtrahend).
Return Value
Type: Interval
A new interval with [number-T0, number-T1].
See Also
Reference
Interval Structure
Subtraction Overload
Rhino.Geometry Namespace