RhinoCommon SDK
RhinoViewport.GetFrustumLeftPlane Method
Rhino for Mac 5.1
Get left world frustum clipping plane.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetFrustumLeftPlane(
	out Plane plane
)
Public Function GetFrustumLeftPlane (
	<OutAttribute> ByRef plane As Plane
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
 frustum left side clipping plane. The normal points into the visible region of the frustum. If the projection is perspective, the origin is at the camera location, otherwise the origin isthe point on the plane that is closest to the camera location.
Return Value
Type: Boolean
true if camera and frustum are valid and plane was set.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace