RhinoCommon SDK
DistanceDisplayMode Enumeration
Rhino for Mac 5.1
 Defines enumerated values for the display of distances in US customary and Imperial units.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum DistanceDisplayMode
Public Enumeration DistanceDisplayMode
Members
Member name | Value | Description
Decimal | 0 |  Shows distance decimals.
Feet | 1 |  Show feet.
FeetAndInches | 2 |  Show feet and inches.
See Also
Reference
Rhino.DocObjects Namespace