RhinoCommon SDK
Particle.Update Method
Rhino for Mac 5.1
 Base class implementation does nothing.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual void Update()
Public Overridable Sub Update
See Also
Reference
Particle Class
Rhino.Geometry Namespace