RhinoCommon SDK
BinaryArchiveWriter.WriteInt Method
Rhino for Mac 5.1
 Writes a Int32 value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteInt(
	int value
)
Public Sub WriteInt (
	value As Integer
)
Parameters
value
Type: System.Int32
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace