RhinoCommon SDK
Material.SetUserString Method
Rhino for Mac 5.1
 Attach a user string (key,value combination) to this geometry.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetUserString(
	string key,
	string value
)
Public Function SetUserString (
	key As String,
	value As String
) As Boolean
Parameters
key
Type: System.String
id used to retrieve this string.
value
Type: System.String
string associated with key.
Return Value
Type: Boolean
true on success.
See Also
Reference
Material Class
Rhino.DocObjects Namespace