RhinoCommon SDK
Brep.Curves3D Property
Rhino for Mac 5.1
 Pointers to 3d curves (used by edges)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepCurveList Curves3D { get; }
Public ReadOnly Property Curves3D As BrepCurveList
	Get
Property Value
Type: BrepCurveList
See Also
Reference
Brep Class
Rhino.Geometry Namespace