RhinoCommon SDK
NurbsCurvePointList.ChangeEndWeights Method
Rhino for Mac 5.1
 Use a combination of scaling and reparameterization to change the end weights to the specified values.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ChangeEndWeights(
	double w0,
	double w1
)
Public Function ChangeEndWeights (
	w0 As Double,
	w1 As Double
) As Boolean
Parameters
w0
Type: System.Double
Weight for first control point.
w1
Type: System.Double
Weight for last control point.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
 The domain, euclidean locations of the control points, and locus of the curve do not change, but the weights, homogeneous cv values and internal knot values may change. If w0 and w1 are 1 and the curve is not rational, the curve is not changed.
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace