RhinoCommon SDK
InstanceReferenceGeometry Properties
Rhino for Mac 5.1
The InstanceReferenceGeometry type exposes the following members.
Properties
Name | Description
ParentIdefId
 The unique id for the parent instance definition of this instance reference.
Xform
Transformation for this reference.
Top
See Also
Reference
InstanceReferenceGeometry Class
Rhino.Geometry Namespace