RhinoCommon SDK
NamedConstructionPlaneTable.Find Method
Rhino for Mac 5.1
Finds a named construction plane.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Find(
	string name
)
Public Function Find (
	name As String
) As Integer
Parameters
name
Type: System.String
 Name of construction plane to search for.
Return Value
Type: Int32
 >=0 index of the construction plane with the given name. -1 no construction plane found with the given name.
See Also
Reference
NamedConstructionPlaneTable Class
Rhino.DocObjects.Tables Namespace