RhinoCommon SDK
RhinoTransformObjectsEventArgs.ObjectsWillBeCopied Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoTransformObjectsEventArgs.ObjectsWillBeCopied"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ObjectsWillBeCopied { get; }
Public ReadOnly Property ObjectsWillBeCopied As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace