RhinoCommon SDK
GeometryBase.ComponentIndex Method
Rhino for Mac 5.1
 If this piece of geometry is a component in something larger, like a BrepEdge in a Brep, then this function returns the component index.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ComponentIndex ComponentIndex()
Public Function ComponentIndex As ComponentIndex
Return Value
Type: ComponentIndex
 This object's component index. If this object is not a sub-piece of a larger geometric entity, then the returned index has m_type = ComponentIndex.InvalidType and m_index = -1.
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace