RhinoCommon SDK
SweepOneRail.IsRoadlike Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.IsRoadlike"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsRoadlike { get; }
Public ReadOnly Property IsRoadlike As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace