RhinoCommon SDK
DisplayModeDescription.DeleteDiplayMode Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayModeDescription.DeleteDiplayMode(System.Guid)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool DeleteDiplayMode(
	Guid id
)
Public Shared Function DeleteDiplayMode (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Display.DisplayModeDescription.DeleteDiplayMode(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.DisplayModeDescription.DeleteDiplayMode(System.Guid)"]
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace