RhinoCommon SDK
LOC.CON Method (String)
Rhino for Mac 5.1
 Command option name strings that need to be localized should call this function. The CON function doesn't actually do anything but return the original string. The LocalizationProcessor application walks through the source code of a project and looks for LOC.CON. The function is then replaced with a call to Localization.LocalizeCommandOptionName using a unique context ID.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static LocalizeStringPair CON(
	string english
)
Public Shared Function CON (
	english As String
) As LocalizeStringPair
Parameters
english
Type: System.String
[in] The English string to localize.
Return Value
Type: LocalizeStringPair
Returns localized string pair with both the English and local names set to the English value.
See Also
Reference
LOC Class
CON Overload
Rhino.UI Namespace