RhinoCommon SDK
GetPointDrawEventArgs Properties
Rhino for Mac 5.1
The GetPointDrawEventArgs type exposes the following members.
Properties
Name | Description
CurrentPoint
Source
 GetPoint class that this draw event originated from.
Top
See Also
Reference
GetPointDrawEventArgs Class
Rhino.Input.Custom Namespace