RhinoCommon SDK
FileReadOptions.NewMode Property
Rhino for Mac 5.1
 true means we are reading template information in something like a OnFileNew event.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool NewMode { get; set; }
Public Property NewMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace