RhinoCommon SDK
MeshPart.EndVertexIndex Property
Rhino for Mac 5.1
End of subinterval of parent mesh vertex array
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int EndVertexIndex { get; }
Public ReadOnly Property EndVertexIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace