RhinoCommon SDK
PlugIn.ObjectPropertiesPages Method
Rhino for Mac 5.1
 Override this function is you want to extend the object properties dialog
Namespace: Rhino.PlugIns
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void ObjectPropertiesPages(
	List<ObjectPropertiesPage> pages
)
Protected Overridable Sub ObjectPropertiesPages (
	pages As List(Of ObjectPropertiesPage)
)
Parameters
pages
Type: System.Collections.Generic.List<ObjectPropertiesPage>
[Missing <param name="pages"/> documentation for "M:Rhino.PlugIns.PlugIn.ObjectPropertiesPages(System.Collections.Generic.List{Rhino.UI.ObjectPropertiesPage})"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace