RhinoCommon SDK
GroupTable Properties
Rhino for Mac 5.1
The GroupTable type exposes the following members.
Properties
Name | Description
Count
Number of groups in the group table.
Document
Document that owns this group table.
Top
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace