RhinoCommon SDK
Line.Equals Method (Line)
Rhino for Mac 5.1
 Determines whether a line has the same value as this line.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Equals(
	Line other
)
Public Function Equals (
	other As Line
) As Boolean
Parameters
other
Type: Rhino.Geometry.Line
A line.
Return Value
Type: Boolean
true if other has the same coordinates as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Line Structure
Equals Overload
Rhino.Geometry Namespace