RhinoCommon SDK
Intersection.MeshPlane Method (Mesh, Plane)
Rhino for Mac 5.1
 Intersects a mesh with an (infinite) plane.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Polyline[] MeshPlane(
	Mesh mesh,
	Plane plane
)
Public Shared Function MeshPlane (
	mesh As Mesh,
	plane As Plane
) As Polyline()
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to intersect.
plane
Type: Rhino.Geometry.Plane
Plane to intersect with.
Return Value
Type: Polyline[]
An array of polylines describing the intersection loops or null (Nothing in Visual Basic) if no intersections could be found.
See Also
Reference
Intersection Class
MeshPlane Overload
Rhino.Geometry.Intersect Namespace