RhinoCommon SDK
Linetype.SetSegment Method
Rhino for Mac 5.1
Sets the length and type of the segment at index.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetSegment(
	int index,
	double length,
	bool isSolid
)
Public Function SetSegment (
	index As Integer,
	length As Double,
	isSolid As Boolean
) As Boolean
Parameters
index
Type: System.Int32
Zero based index of the segment.
length
Type: System.Double
The length of the segment to be added in millimeters.
isSolid
Type: System.Boolean
 If true, the length is interpreted as a line. If false, then the length is interpreted as a space.
Return Value
Type: Boolean
true if the operation was successful; otherwise false.
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace