RhinoCommon SDK
IStackedDialogPageService Interface
Rhino for Mac 5.1
 For internal use, the IStackedDialogPageService service is implemented in RhinoWindows or RhinoMac as appropriate and handles the communication with core Rhino This is borrowed from StackedDialogPageService.cs in Rhino 6.0 for Windows and is only included in MacRhino 5.1, this does not appear in Rhino 5 for Windows. Only hooking up here to get ObjectProperties selection support on Mac Rhino.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public interface IStackedDialogPageService
Public Interface IStackedDialogPageService
The IStackedDialogPageService type exposes the following members.
Methods
Name | Description
NewObjectPropertiesDialogPagePointer
SelectedObjects
Top
See Also
Reference
Rhino.UI Namespace