RhinoCommon SDK
Color4f Structure
Rhino for Mac 5.1
 Color defined by 4 floating point values.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct Color4f : ISerializable
<SerializableAttribute>
Public Structure Color4f
	Implements ISerializable
The Color4f type exposes the following members.
Constructors
Name | Description
Color4f(Color)
Initializes a new instance of the Color4f class
Color4f(Color4f)
Initializes a new instance of the Color4f class
Color4f(Single, Single, Single, Single)
Initializes a new instance of the Color4f class
Top
Properties
Name | Description
A
B
Black
Empty
G
R
White
Top
Methods
Name | Description
AsSystemColor
BlendTo
Equals |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
Top
Operators
Name | Description
Equality
Inequality
Top
See Also
Reference
Rhino.Display Namespace