RhinoCommon SDK
Vector3f.Rotate Method
Rhino for Mac 5.1
 Rotates this vector around a given axis.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Rotate(
	double angleRadians,
	Vector3f rotationAxis
)
Public Function Rotate (
	angleRadians As Double,
	rotationAxis As Vector3f
) As Boolean
Parameters
angleRadians
Type: System.Double
Angle of rotation (in radians).
rotationAxis
Type: Rhino.Geometry.Vector3f
Axis of rotation.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace