RhinoCommon SDK
FileWriteOptions.Xform Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.Xform"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform Xform { get; set; }
Public Property Xform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace