RhinoCommon SDK
Box.BoundingBox Property
Rhino for Mac 5.1
 Gets the world axis aligned Bounding box for this oriented box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
Box Structure
Rhino.Geometry Namespace