RhinoCommon SDK
GripObject.Move Method
Rhino for Mac 5.1
Overload List
Name | Description
Move(Point3d)
 Moves the grip to a new location.
Move(Transform)
 Moves the grip to a new location.
Move(Vector3d)
 Moves the grip to a new location.
Top
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace