RhinoCommon SDK
DisplayPipeline.ShadingRequired Property
Rhino for Mac 5.1
 Gets or sets the "ShadingRequired" flag. This flag gets set inside the pipeline when a request is made to draw a shaded mesh but the current render engine doesn't support shaded mesh drawing...at this point the redraw mechanism will make sure everything will work the next time around.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ShadingRequired { get; set; }
Public Property ShadingRequired As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace