RhinoCommon SDK
LinearDimension.TextPosition Property
Rhino for Mac 5.1
 Gets and sets the position of text on the plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2d TextPosition { get; set; }
Public Property TextPosition As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace