RhinoCommon SDK
RhinoGet.GetColor Method
Rhino for Mac 5.1
Easy to use color getter.
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetColor(
	string prompt,
	bool acceptNothing,
	ref Color color
)
Public Shared Function GetColor (
	prompt As String,
	acceptNothing As Boolean,
	ByRef color As Color
) As Result
Parameters
prompt
Type: System.String
Command prompt.
acceptNothing
Type: System.Boolean
If true, the user can press enter.
color
Type: System.Drawing.Color
Color value returned here. also used as default color.
Return Value
Type: Result
Commands.Result.Success - got color.
Commands.Result.Nothing - user pressed enter.
Commands.Result.Cancel - user cancel color getting.
Remarks
 If you need options or more advanced user interface, then use GetColor class.
See Also
Reference
RhinoGet Class
Rhino.Input Namespace