RhinoCommon SDK
InstanceDefinitionTable.ActiveCount Property
Rhino for Mac 5.1
 Number of items in the instance definitions table, excluding deleted definitions.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ActiveCount { get; }
Public ReadOnly Property ActiveCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace