RhinoCommon SDK
Quaternion.Invert Method
Rhino for Mac 5.1
 Modifies this quaternion to become
(a/L2, -b/L2, -c/L2, -d/L2),
where L2 = length squared = (a*a + b*b + c*c + d*d).
This is the multiplicative inverse, i.e., (a,b,c,d)*(a/L2, -b/L2, -c/L2, -d/L2) = (1,0,0,0).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Invert()
Public Function Invert As Boolean
Return Value
Type: Boolean
 true if successful. false if the quaternion is zero and cannot be inverted.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace