RhinoCommon SDK
MeshVertexList.Remove Method (Int32, Boolean)
Rhino for Mac 5.1
 Removes the vertex at the given index and all faces that reference that index.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Remove(
	int index,
	bool shrinkFaces
)
Public Function Remove (
	index As Integer,
	shrinkFaces As Boolean
) As Boolean
Parameters
index
Type: System.Int32
Index of vertex to remove.
shrinkFaces
Type: System.Boolean
If true, quads that reference the deleted vertex will be converted to triangles.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexList Class
Remove Overload
Rhino.Geometry.Collections Namespace