RhinoCommon SDK
Ellipse.ToNurbsCurve Method
Rhino for Mac 5.1
 Constructs a nurbs curve representation of this ellipse.
This is equivalent to calling NurbsCurve.CreateFromEllipse().
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsCurve ToNurbsCurve()
Public Function ToNurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
A nurbs curve representation of this ellipse or null if no such representation could be made.
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace