RhinoCommon SDK
ConstructionPlane.ShowAxes Property
Rhino for Mac 5.1
 Gets or sets whether the axes of the grid shuld be visible.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ShowAxes { get; set; }
Public Property ShowAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace