RhinoCommon SDK
Linetype.GetSegment Method
Rhino for Mac 5.1
 Gets the segment information at a index.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void GetSegment(
	int index,
	out double length,
	out bool isSolid
)
Public Sub GetSegment (
	index As Integer,
	<OutAttribute> ByRef length As Double,
	<OutAttribute> ByRef isSolid As Boolean
)
Parameters
index
Type: System.Int32
Zero based index of the segment.
length
Type: System.Double
The length of the segment in millimeters.
isSolid
Type: System.Boolean
 If the length is interpreted as a line, true is assigned during the call to this out parameter.
If the length is interpreted as a space, then false is assigned during the call to this out parameter.
Exceptions
Exception | Condition
IndexOutOfRangeException | If the index is unacceptable.
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace