RhinoCommon SDK
FileImportPlugIn.ReadFile Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.PlugIns.FileImportPlugIn.ReadFile(System.String,System.Int32,Rhino.RhinoDoc,Rhino.FileIO.FileReadOptions)"]
Namespace: Rhino.PlugIns
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected abstract bool ReadFile(
	string filename,
	int index,
	RhinoDoc doc,
	FileReadOptions options
)
Protected MustOverride Function ReadFile (
	filename As String,
	index As Integer,
	doc As RhinoDoc,
	options As FileReadOptions
) As Boolean
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.PlugIns.FileImportPlugIn.ReadFile(System.String,System.Int32,Rhino.RhinoDoc,Rhino.FileIO.FileReadOptions)"]
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.PlugIns.FileImportPlugIn.ReadFile(System.String,System.Int32,Rhino.RhinoDoc,Rhino.FileIO.FileReadOptions)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.PlugIns.FileImportPlugIn.ReadFile(System.String,System.Int32,Rhino.RhinoDoc,Rhino.FileIO.FileReadOptions)"]
options
Type: Rhino.FileIO.FileReadOptions
[Missing <param name="options"/> documentation for "M:Rhino.PlugIns.FileImportPlugIn.ReadFile(System.String,System.Int32,Rhino.RhinoDoc,Rhino.FileIO.FileReadOptions)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.FileImportPlugIn.ReadFile(System.String,System.Int32,Rhino.RhinoDoc,Rhino.FileIO.FileReadOptions)"]
See Also
Reference
FileImportPlugIn Class
Rhino.PlugIns Namespace