RhinoCommon SDK
SweepTwoRail.PerformSweepRebuild Method (Curve, Curve, Curve, Double, Double, Int32)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Int32)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] PerformSweepRebuild(
	Curve rail1,
	Curve rail2,
	Curve crossSection,
	double crossSectionParameterRail1,
	double crossSectionParameterRail2,
	int rebuildCount
)
Public Function PerformSweepRebuild (
	rail1 As Curve,
	rail2 As Curve,
	crossSection As Curve,
	crossSectionParameterRail1 As Double,
	crossSectionParameterRail2 As Double,
	rebuildCount As Integer
) As Brep()
Parameters
rail1
Type: Rhino.Geometry.Curve
[Missing <param name="rail1"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Int32)"]
rail2
Type: Rhino.Geometry.Curve
[Missing <param name="rail2"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Int32)"]
crossSection
Type: Rhino.Geometry.Curve
[Missing <param name="crossSection"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Int32)"]
crossSectionParameterRail1
Type: System.Double
[Missing <param name="crossSectionParameterRail1"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Int32)"]
crossSectionParameterRail2
Type: System.Double
[Missing <param name="crossSectionParameterRail2"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Int32)"]
rebuildCount
Type: System.Int32
[Missing <param name="rebuildCount"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Int32)"]
Return Value
Type: Brep[]
[Missing <returns> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Int32)"]
See Also
Reference
SweepTwoRail Class
PerformSweepRebuild Overload
Rhino.Geometry Namespace