RhinoCommon SDK
GeometryBase Class
Rhino for Mac 5.1
 Provides a common base for most geometric classes. This class is abstract.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 More...
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public abstract class GeometryBase : CommonObject
<SerializableAttribute>
Public MustInherit Class GeometryBase
	Inherits CommonObject
The GeometryBase type exposes the following members.
Constructors
Name | Description
GeometryBase
 Protected constructor for internal use.
Top
Properties
Name | Description
HasBrepForm
 Returns true if the Brep.TryConvertBrep function will be successful for this object
IsDeformable
 true if object can be accurately modified with "squishy" transformations like projections, shears, and non-uniform scaling.
IsDocumentControlled
 If true this object may not be modified. Any properties or functions that attempt to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.
 (Overrides CommonObject.IsDocumentControlled.)
ObjectType
 Useful for switch statements that need to differentiate between basic object types like points, curves, surfaces, and so on.
UserStringCount
 Gets the amount of user strings.
Top
Methods
Name | Description
ComponentIndex
 If this piece of geometry is a component in something larger, like a BrepEdge in a Brep, then this function returns the component index.
Duplicate
 Constructs a deep (full) copy of this object.
DuplicateShallow
 Constructs a light copy of this object. By "light", it is meant that the same underlying data is used until something is done to attempt to change it. For example, you could have a shallow copy of a very heavy mesh object and the same underlying data will be used when doing things like inspecting the number of faces on the mesh. If you modify the location of one of the mesh vertices, the shallow copy will create a full duplicate of the underlying mesh data and the shallow copy will become a deep copy.
GetBoundingBox(Boolean)
 Boundingbox solver. Gets the world axis aligned boundingbox for the geometry.
GetBoundingBox(Plane)
 Aligned Boundingbox solver. Gets the plane aligned boundingbox.
GetBoundingBox(Transform)
 Aligned Boundingbox solver. Gets the world axis aligned boundingbox for the transformed geometry.
GetBoundingBox(Plane, Box)
 Aligned Boundingbox solver. Gets the plane aligned boundingbox.
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
MakeDeformable
 If possible, converts the object into a form that can be accurately modified with "squishy" transformations like projections, shears, an non-uniform scaling.
MemoryEstimate
 Computes an estimate of the number of bytes that this object is using in memory.
OnSwitchToNonConst
 Is called when a non-const operation occurs.
 (Overrides CommonObject.OnSwitchToNonConst().)
Rotate
 Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule).
Scale
 Scales the object by the specified factor. The scale is centered at the origin.
SetUserString
 Attach a user string (key,value combination) to this geometry.
Transform
 Transforms the geometry. If the input Transform has a SimilarityType of OrientationReversing, you may want to consider flipping the transformed geometry after calling this function when it makes sense. For example, you may want to call Flip() on a Brep after transforming it.
Translate(Vector3d)
Translates the object along the specified vector.
Translate(Double, Double, Double)
Translates the object along the specified vector.
Top
See Also
Reference
Rhino.Geometry Namespace
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Brep
 Rhino.Geometry.BrepLoop
 Rhino.Geometry.Curve
 Rhino.Geometry.DetailView
 Rhino.Geometry.Hatch
 Rhino.Geometry.InstanceDefinitionGeometry
 Rhino.Geometry.InstanceReferenceGeometry
 Rhino.Geometry.Light
 Rhino.Geometry.Mesh
 Rhino.Geometry.MorphControl
 Rhino.Geometry.Point
 Rhino.Geometry.Point3dGrid
 Rhino.Geometry.PointCloud
 Rhino.Geometry.Surface
 Rhino.Geometry.TextDot