RhinoCommon SDK
Sphere.ToRevSurface Method
Rhino for Mac 5.1
 Converts this Sphere to a RevSurface representation. This is synonymous with calling RevSurface.CreateFromSphere().
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RevSurface ToRevSurface()
Public Function ToRevSurface As RevSurface
Return Value
Type: RevSurface
A surface of revolution representation of this sphere or null.
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace