RhinoCommon SDK
ViewportInfo.GetWorldToScreenScale Method
Rhino for Mac 5.1
 Gets the scale factor from point in frustum to screen scale.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double GetWorldToScreenScale(
	Point3d pointInFrustum
)
Public Function GetWorldToScreenScale (
	pointInFrustum As Point3d
) As Double
Parameters
pointInFrustum
Type: Rhino.Geometry.Point3d
point in viewing frustum.
Return Value
Type: Double
number of pixels per world unit at the 3d point.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace