RhinoCommon SDK
RhinoDoc.WriteFile Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.RhinoDoc.WriteFile(System.String,Rhino.FileIO.FileWriteOptions)"]
Namespace: Rhino
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool WriteFile(
	string path,
	FileWriteOptions options
)
Public Function WriteFile (
	path As String,
	options As FileWriteOptions
) As Boolean
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.RhinoDoc.WriteFile(System.String,Rhino.FileIO.FileWriteOptions)"]
options
Type: Rhino.FileIO.FileWriteOptions
[Missing <param name="options"/> documentation for "M:Rhino.RhinoDoc.WriteFile(System.String,Rhino.FileIO.FileWriteOptions)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoDoc.WriteFile(System.String,Rhino.FileIO.FileWriteOptions)"]
See Also
Reference
RhinoDoc Class
Rhino Namespace