RhinoCommon SDK
MeshFace.IsValid Method (Int32)
Rhino for Mac 5.1
 Gets a value indicating whether or not this mesh face is considered to be valid. Unlike the simple IsValid function, this function takes upper bound indices into account.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValid(
	int vertexCount
)
Public Function IsValid (
	vertexCount As Integer
) As Boolean
Parameters
vertexCount
Type: System.Int32
Number of vertices in the mesh that this face is a part of.
Return Value
Type: Boolean
true if the face is considered valid, false if not.
See Also
Reference
MeshFace Structure
IsValid Overload
Rhino.Geometry Namespace