RhinoCommon SDK
TextureMapping.Id Property
Rhino for Mac 5.1
 The unique Id for this texture mapping object.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
TextureMapping Class
Rhino.Render Namespace