RhinoCommon SDK
ConstructionPlane.SnapSpacing Property
Rhino for Mac 5.1
 when "grid snap" is enabled, the distance between snap points. Typically this is the same distance as grid spacing.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double SnapSpacing { get; set; }
Public Property SnapSpacing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace