RhinoCommon SDK
Extrusion.PathLineCurve Method
Rhino for Mac 5.1
 Gets the line-like curve that is the conceptual axis of the extrusion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public LineCurve PathLineCurve()
Public Function PathLineCurve As LineCurve
Return Value
Type: LineCurve
The path as a line curve.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace