RhinoCommon SDK
ReplayHistoryResult Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.ReplayHistoryResult"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.ReplayHistoryResult
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class ReplayHistoryResult
Public Class ReplayHistoryResult
The ReplayHistoryResult type exposes the following members.
Properties
Name | Description
ExistingObject
Top
Methods
Name | Description
UpdateToAngularDimension
UpdateToArc
UpdateToBrep
UpdateToCircle
UpdateToClippingPlane(Plane, Double, Double, IEnumerable<Guid>, ObjectAttributes)
UpdateToClippingPlane(Plane, Double, Double, Guid, ObjectAttributes)
UpdateToCurve
UpdateToEllipse
UpdateToExtrusion
UpdateToHatch
UpdateToLeader
UpdateToLine
UpdateToLinearDimension
UpdateToMesh
UpdateToPoint
UpdateToPointCloud(IEnumerable<Point3d>, ObjectAttributes)
UpdateToPointCloud(PointCloud, ObjectAttributes)
UpdateToPolyline
UpdateToRadialDimension
UpdateToSphere
UpdateToSurface
UpdateToText(TextEntity, ObjectAttributes)
UpdateToText(String, Plane, Double, String, Boolean, Boolean, TextJustification, ObjectAttributes)
UpdateToTextDot
Top
See Also
Reference
Rhino.DocObjects Namespace