RhinoCommon SDK
Vector3f Structure
Rhino for Mac 5.1
 Represents the three components of a vector in three-dimensional space, using Single-precision floating point numbers.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct Vector3f : IEquatable<Vector3f>,
	IComparable<Vector3f>, IComparable, IEpsilonFComparable<Vector3f>
<SerializableAttribute>
Public Structure Vector3f
	Implements IEquatable(Of Vector3f), IComparable(Of Vector3f),
	IComparable, IEpsilonFComparable(Of Vector3f)
The Vector3f type exposes the following members.
Constructors
Name | Description
Vector3f
 Constructs a new vector from 3 single precision numbers.
Top
Properties
Name | Description
Length
 Computes the length (or magnitude, or size) of this vector. This is an application of Pythagoras' theorem. If this vector is invalid, its length is considered 0.
Unset
 Gets the value of the vector with each component set to RhinoMath.UnsetValue.
X
 Gets or sets the X (first) component of this vector.
XAxis
 Gets the value of the vector with components 1,0,0.
Y
 Gets or sets the Y (second) component of this vector.
YAxis
 Gets the value of the vector with components 0,1,0.
Z
 Gets or sets the Z (third) component of this vector.
ZAxis
 Gets the value of the vector with components 0,0,1.
Zero
 Gets the value of the vector with components 0,0,0.
Top
Methods
Name | Description
Add
 Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
CompareTo
 Compares this Vector3f with another Vector3f.
Component evaluation priority is first X, then Y, then Z.
CrossProduct
 Computes the cross product (or vector product, or exterior product) of two vectors.
This operation is not commutative.
EpsilonEquals
 Check that all values in other are withing epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Vector3f and has the same values as the present vector.
 (Overrides ValueType.Equals(Object).)
Equals(Vector3f)
 Determines whether the specified vector has the same values as the present vector.
GetHashCode
 Computes a hash number that represents the current vector.
 (Overrides ValueType.GetHashCode().)
Multiply(Single, Vector3f)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector3f, Vector3f)
 Multiplies two vectors together, returning the dot product (or inner product). This differs from the cross product.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector3f, Single)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
PerpendicularTo
 Sets this vector to be perpendicular to another vector. Result is not unitized.
Reverse
 Reverses (inverts) this vector in place.
If this vector contains RhinoMath.UnsetValue, the reverse will also be invalid and false will be returned.
Rotate
 Rotates this vector around a given axis.
ToString
 Constructs the string representation of the current vector.
 (Overrides ValueType.ToString().)
Transform
 Transforms the vector in place.
The transformation matrix acts on the left of the vector; i.e.,
result = transformation*vector
Unitize
 Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
Top
Operators
Name | Description
Addition
 Sums up a point and a vector, and returns a new point.
Equality
 Determines whether two vectors have equal values.
GreaterThan
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector.
Components evaluation priority is first X, then Y, then Z.
GreaterThanOrEqual
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector, or it is equal to it.
Components evaluation priority is first X, then Y, then Z.
Inequality
 Determines whether two vectors have different values.
LessThan
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector.
Components evaluation priority is first X, then Y, then Z.
LessThanOrEqual
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector, or it is equal to it.
Components evaluation priority is first X, then Y, then Z.
Multiply(Single, Vector3f)
 Multiplies a vector by a number, having the effect of scaling it.
Multiply(Vector3f, Vector3f)
 Multiplies two vectors together, returning the dot product (or inner product). This differs from the cross product.
Multiply(Vector3f, Single)
 Multiplies a vector by a number, having the effect of scaling it.
Top
See Also
Reference
Rhino.Geometry Namespace