RhinoCommon SDK
DisplayBitmap Constructor
Rhino for Mac 5.1
 Constructs a DisplayBitmap from an existing bitmap.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DisplayBitmap(
	Bitmap bitmap
)
Public Sub New (
	bitmap As Bitmap
)
Parameters
bitmap
Type: System.Drawing.Bitmap
The original bitmap.
See Also
Reference
DisplayBitmap Class
Rhino.Display Namespace