RhinoCommon SDK
ControlPoint.Weight Property
Rhino for Mac 5.1
 Gets or sets the weight of this control point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Weight { get; set; }
Public Property Weight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace