RhinoCommon SDK
Curve.CreateMeanCurve Method (Curve, Curve)
Rhino for Mac 5.1
 Constructs a mean, or average, curve from two curves.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve CreateMeanCurve(
	Curve curveA,
	Curve curveB
)
Public Shared Function CreateMeanCurve (
	curveA As Curve,
	curveB As Curve
) As Curve
Parameters
curveA
Type: Rhino.Geometry.Curve
A first curve.
curveB
Type: Rhino.Geometry.Curve
A second curve.
Return Value
Type: Curve
The average curve, or null on error.
Exceptions
Exception | Condition
ArgumentNullException | If curveA or curveB are null.
See Also
Reference
Curve Class
CreateMeanCurve Overload
Rhino.Geometry Namespace