RhinoCommon SDK
VisualAnalysisMode.DrawMeshObject Method
Rhino for Mac 5.1
 Draws one mesh. Override this method to add your custom behavior.
The default implementation does nothing.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void DrawMeshObject(
	MeshObject mesh,
	DisplayPipeline pipeline
)
Protected Overridable Sub DrawMeshObject (
	mesh As MeshObject,
	pipeline As DisplayPipeline
)
Parameters
mesh
Type: Rhino.DocObjects.MeshObject
A mesh object.
pipeline
Type: Rhino.Display.DisplayPipeline
The current display pipeline.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace