RhinoCommon SDK
Brep.DuplicateVertices Method
Rhino for Mac 5.1
 Duplicate all the corner vertices of this Brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d[] DuplicateVertices()
Public Function DuplicateVertices As Point3d()
Return Value
Type: Point3d[]
An array or corner vertices.
See Also
Reference
Brep Class
Rhino.Geometry Namespace