RhinoCommon SDK
Sphere Constructor
Rhino for Mac 5.1
Overload List
Name | Description
Sphere(Plane, Double)
 Initializes a new sphere given the plane of the equator circle and radius.
Sphere(Point3d, Double)
 Initializes a new sphere given center point and radius.
Top
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace