RhinoCommon SDK
Panels.ClosePanel Method
Rhino for Mac 5.1
Overload List
Name | Description
ClosePanel(Guid)
 Will close or hide the specified panel type, in Windows Rhino, if it is the only visible tab the tab dock bar will be closed as well. In Mac Rhino it will always close the modeless dialog hosting the panel.
ClosePanel(Type)
 Will close or hide the specified panel type, in Windows Rhino, if it is the only visible tab the tab dock bar will be closed as well. In Mac Rhino it will always close the modeless dialog hosting the panel.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace