RhinoCommon SDK
Cylinder.IsFinite Property
Rhino for Mac 5.1
 true if the cylinder is finite (Height0 != Height1) false if the cylinder is infinite.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsFinite { get; }
Public ReadOnly Property IsFinite As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace