RhinoCommon SDK
OptionInteger Constructor (Int32, Boolean, Int32)
Rhino for Mac 5.1
 Initializes a new instance of the OptionInteger class.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public OptionInteger(
	int initialValue,
	bool setLowerLimit,
	int limit
)
Public Sub New (
	initialValue As Integer,
	setLowerLimit As Boolean,
	limit As Integer
)
Parameters
initialValue
Type: System.Int32
The initial value.
setLowerLimit
Type: System.Boolean
 If true, limit sets the lower limit and upper limit is undefined If false, limit sets the upper limit and lower limit is undefined.
limit
Type: System.Int32
If setLowerLimit is true, then limit is the minimum value. Otherwise, it is the maximum.
See Also
Reference
OptionInteger Class
OptionInteger Overload
Rhino.Input.Custom Namespace