RhinoCommon SDK
GetBaseClass.SetDefaultColor Method
Rhino for Mac 5.1
 Sets a color as default value that will be returned if the user presses ENTER key during the get.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetDefaultColor(
	Color defaultColor
)
Public Sub SetDefaultColor (
	defaultColor As Color
)
Parameters
defaultColor
Type: System.Drawing.Color
value for default color.
Remarks
 Calling SetDefaultColor will automatically handle setting the command prompt default and reacting to the user pressing ENTER. If the user presses ENTER to accept the default color, GetResult.Color is returned and RhinoGet.GotDefault() will return true. Calling SetDefaultColor will clear any previous calls to SetDefaultString or SetDefaultPoint.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace