RhinoCommon SDK
Box.Unset Property
Rhino for Mac 5.1
 Gets a Box whose base plane and axis dimensions are all Unset.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Box Unset { get; }
Public Shared ReadOnly Property Unset As Box
	Get
Property Value
Type: Box
See Also
Reference
Box Structure
Rhino.Geometry Namespace