RhinoCommon SDK
MeshFaceNormalList.SetFaceNormal Method (Int32, Single, Single, Single)
Rhino for Mac 5.1
 Sets a face normal vector at an index using three single-precision numbers.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFaceNormal(
	int index,
	float x,
	float y,
	float z
)
Public Function SetFaceNormal (
	index As Integer,
	x As Single,
	y As Single,
	z As Single
) As Boolean
Parameters
index
Type: System.Int32
An index.
x
Type: System.Single
A x component.
y
Type: System.Single
A y component.
z
Type: System.Single
A z component.
Return Value
Type: Boolean
true on success; false on error.
See Also
Reference
MeshFaceNormalList Class
SetFaceNormal Overload
Rhino.Geometry.Collections Namespace