RhinoCommon SDK
MeshFaceNormalList.SetFaceNormal Method (Int32, Double, Double, Double)
Rhino for Mac 5.1
 Sets a face normal vector at an index using three double-precision numbers.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFaceNormal(
	int index,
	double x,
	double y,
	double z
)
Public Function SetFaceNormal (
	index As Integer,
	x As Double,
	y As Double,
	z As Double
) As Boolean
Parameters
index
Type: System.Int32
An index.
x
Type: System.Double
A x component.
y
Type: System.Double
A y component.
z
Type: System.Double
A z component.
Return Value
Type: Boolean
true on success; false on error.
See Also
Reference
MeshFaceNormalList Class
SetFaceNormal Overload
Rhino.Geometry.Collections Namespace