RhinoCommon SDK
DisplayPipeline.DrawDottedLine Method (Line, Color)
Rhino for Mac 5.1
 Draws a single dotted line.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawDottedLine(
	Line line,
	Color color
)
Public Sub DrawDottedLine (
	line As Line,
	color As Color
)
Parameters
line
Type: Rhino.Geometry.Line
Line to draw.
color
Type: System.Drawing.Color
Color of line.
See Also
Reference
DisplayPipeline Class
DrawDottedLine Overload
Rhino.Display Namespace