RhinoCommon SDK
Surface.TryGetTorus Method (Torus, Double)
Rhino for Mac 5.1
Tests a surface to see if it is a portion of a torus and returns the torus.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetTorus(
	out Torus torus,
	double tolerance
)
Public Function TryGetTorus (
	<OutAttribute> ByRef torus As Torus,
	tolerance As Double
) As Boolean
Parameters
torus
Type: Rhino.Geometry.Torus
On success, the torus parameters are filled in.
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the surface is a portion of a torus.
See Also
Reference
Surface Class
TryGetTorus Overload
Rhino.Geometry Namespace