RhinoCommon SDK
Rectangle3d Constructor (Plane, Double, Double)
Rhino for Mac 5.1
 Initializes a new rectangle from width and height.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Rectangle3d(
	Plane plane,
	double width,
	double height
)
Public Sub New (
	plane As Plane,
	width As Double,
	height As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
Base plane for Rectangle.
width
Type: System.Double
Width (as measured along the base plane x-axis) of rectangle.
height
Type: System.Double
Height (as measured along the base plane y-axis) of rectangle.
See Also
Reference
Rectangle3d Structure
Rectangle3d Overload
Rhino.Geometry Namespace