RhinoCommon SDK
Intersection.LineLine Method
Rhino for Mac 5.1
Overload List
Name | Description
LineLine(Line, Line, Double, Double)
 Finds the closest point between two infinite lines.
LineLine(Line, Line, Double, Double, Double, Boolean)
 Intersects two lines.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace