RhinoCommon SDK
RhinoViewport.GetCameraAngle Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.GetCameraAngle(System.Double@,System.Double@,System.Double@)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetCameraAngle(
	out double halfDiagonalAngle,
	out double halfVerticalAngle,
	out double halfHorizontalAngle
)
Public Function GetCameraAngle (
	<OutAttribute> ByRef halfDiagonalAngle As Double,
	<OutAttribute> ByRef halfVerticalAngle As Double,
	<OutAttribute> ByRef halfHorizontalAngle As Double
) As Boolean
Parameters
halfDiagonalAngle
Type: System.Double
[Missing <param name="halfDiagonalAngle"/> documentation for "M:Rhino.Display.RhinoViewport.GetCameraAngle(System.Double@,System.Double@,System.Double@)"]
halfVerticalAngle
Type: System.Double
[Missing <param name="halfVerticalAngle"/> documentation for "M:Rhino.Display.RhinoViewport.GetCameraAngle(System.Double@,System.Double@,System.Double@)"]
halfHorizontalAngle
Type: System.Double
[Missing <param name="halfHorizontalAngle"/> documentation for "M:Rhino.Display.RhinoViewport.GetCameraAngle(System.Double@,System.Double@,System.Double@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.GetCameraAngle(System.Double@,System.Double@,System.Double@)"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace