RhinoCommon SDK
GeometryBase.Transform Method
Rhino for Mac 5.1
 Transforms the geometry. If the input Transform has a SimilarityType of OrientationReversing, you may want to consider flipping the transformed geometry after calling this function when it makes sense. For example, you may want to call Flip() on a Brep after transforming it.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
 Transformation to apply to geometry.
Return Value
Type: Boolean
true if geometry successfully transformed.
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace