RhinoCommon SDK
GumballAppearanceSettings Constructor
Rhino for Mac 5.1
Initializes a new instance of the GumballAppearanceSettings class
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GumballAppearanceSettings()
Public Sub New
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace