RhinoCommon SDK
HatchPattern Constructor
Rhino for Mac 5.1
Initializes a new instance of the HatchPattern class
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public HatchPattern()
Public Sub New
See Also
Reference
HatchPattern Class
HatchPattern Overload
Rhino.DocObjects Namespace