RhinoCommon SDK
OptionColor Methods
Rhino for Mac 5.1
The OptionColor type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
OptionColor Class
Rhino.Input.Custom Namespace