RhinoCommon SDK
OptionsDialogPage.RunScript Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.OptionsDialogPage.RunScript(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual Result RunScript(
	RhinoDoc doc,
	RunMode mode
)
Public Overridable Function RunScript (
	doc As RhinoDoc,
	mode As RunMode
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.UI.OptionsDialogPage.RunScript(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
mode
Type: Rhino.Commands.RunMode
[Missing <param name="mode"/> documentation for "M:Rhino.UI.OptionsDialogPage.RunScript(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.UI.OptionsDialogPage.RunScript(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
See Also
Reference
OptionsDialogPage Class
Rhino.UI Namespace