RhinoCommon SDK
Curve.NonConstOperation Method
Rhino for Mac 5.1
 For derived classes implementers.
Defines the necessary implementation to free the instance from being const.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected override void NonConstOperation()
Protected Overrides Sub NonConstOperation
See Also
Reference
Curve Class
Rhino.Geometry Namespace