RhinoCommon SDK
MeshPoint.GetTriangle Method
Rhino for Mac 5.1
 Gets the mesh face indices of the triangle where the intersection is on the face takes into consideration the way the quad was split during the intersection.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetTriangle(
	out int a,
	out int b,
	out int c
)
Public Function GetTriangle (
	<OutAttribute> ByRef a As Integer,
	<OutAttribute> ByRef b As Integer,
	<OutAttribute> ByRef c As Integer
) As Boolean
Parameters
a
Type: System.Int32
[Missing <param name="a"/> documentation for "M:Rhino.Geometry.MeshPoint.GetTriangle(System.Int32@,System.Int32@,System.Int32@)"]
b
Type: System.Int32
[Missing <param name="b"/> documentation for "M:Rhino.Geometry.MeshPoint.GetTriangle(System.Int32@,System.Int32@,System.Int32@)"]
c
Type: System.Int32
[Missing <param name="c"/> documentation for "M:Rhino.Geometry.MeshPoint.GetTriangle(System.Int32@,System.Int32@,System.Int32@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.MeshPoint.GetTriangle(System.Int32@,System.Int32@,System.Int32@)"]
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace