RhinoCommon SDK
File3dmObjectTable.GetBoundingBox Method
Rhino for Mac 5.1
Gets the bounding box containing every object in this table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox GetBoundingBox()
Public Function GetBoundingBox As BoundingBox
Return Value
Type: BoundingBox
The computed bounding box.
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace