RhinoCommon SDK
VolumeMassProperties.Compute Method (Surface)
Rhino for Mac 5.1
 Compute the VolumeMassProperties for a single Surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static VolumeMassProperties Compute(
	Surface surface
)
Public Shared Function Compute (
	surface As Surface
) As VolumeMassProperties
Parameters
surface
Type: Rhino.Geometry.Surface
Surface to measure.
Return Value
Type: VolumeMassProperties
The VolumeMassProperties for the given Surface or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When surface is null.
See Also
Reference
VolumeMassProperties Class
Compute Overload
Rhino.Geometry Namespace