RhinoCommon SDK
AnnotationObjectBase Properties
Rhino for Mac 5.1
The AnnotationObjectBase type exposes the following members.
Properties
Name | Description
DisplayText
 Gets the text that is displayed to users.
Top
See Also
Reference
AnnotationObjectBase Class
Rhino.DocObjects Namespace