RhinoCommon SDK
RhinoView.ClientToScreen Method (Point2d)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.RhinoView.ClientToScreen(Rhino.Geometry.Point2d)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2d ClientToScreen(
	Point2d clientPoint
)
Public Function ClientToScreen (
	clientPoint As Point2d
) As Point2d
Parameters
clientPoint
Type: Rhino.Geometry.Point2d
[Missing <param name="clientPoint"/> documentation for "M:Rhino.Display.RhinoView.ClientToScreen(Rhino.Geometry.Point2d)"]
Return Value
Type: Point2d
[Missing <returns> documentation for "M:Rhino.Display.RhinoView.ClientToScreen(Rhino.Geometry.Point2d)"]
See Also
Reference
RhinoView Class
ClientToScreen Overload
Rhino.Display Namespace