RhinoCommon SDK
SurfaceObject Methods
Rhino for Mac 5.1
The SurfaceObject type exposes the following members.
Methods
Name | Description
DuplicateSurfaceGeometry
 Constructs a new deep copy of the surface geometry.
Top
See Also
Reference
SurfaceObject Class
Rhino.DocObjects Namespace