RhinoCommon SDK
LightTable Methods
Rhino for Mac 5.1
The LightTable type exposes the following members.
Methods
Name | Description
Add(Light)
Add(Light, ObjectAttributes)
Find
GetEnumerator
Modify(Guid, Light)
Modify(Int32, Light)
Top
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace