RhinoCommon SDK
DigitizerPlugIn.SendRay Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.PlugIns.DigitizerPlugIn.SendRay(Rhino.Geometry.Ray3d,Rhino.UI.MouseButton,System.Boolean,System.Boolean)"]
Namespace: Rhino.PlugIns
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SendRay(
	Ray3d ray,
	MouseButton mousebuttons,
	bool shiftKey,
	bool controlKey
)
Public Sub SendRay (
	ray As Ray3d,
	mousebuttons As MouseButton,
	shiftKey As Boolean,
	controlKey As Boolean
)
Parameters
ray
Type: Rhino.Geometry.Ray3d
[Missing <param name="ray"/> documentation for "M:Rhino.PlugIns.DigitizerPlugIn.SendRay(Rhino.Geometry.Ray3d,Rhino.UI.MouseButton,System.Boolean,System.Boolean)"]
mousebuttons
Type: Rhino.UI.MouseButton
[Missing <param name="mousebuttons"/> documentation for "M:Rhino.PlugIns.DigitizerPlugIn.SendRay(Rhino.Geometry.Ray3d,Rhino.UI.MouseButton,System.Boolean,System.Boolean)"]
shiftKey
Type: System.Boolean
[Missing <param name="shiftKey"/> documentation for "M:Rhino.PlugIns.DigitizerPlugIn.SendRay(Rhino.Geometry.Ray3d,Rhino.UI.MouseButton,System.Boolean,System.Boolean)"]
controlKey
Type: System.Boolean
[Missing <param name="controlKey"/> documentation for "M:Rhino.PlugIns.DigitizerPlugIn.SendRay(Rhino.Geometry.Ray3d,Rhino.UI.MouseButton,System.Boolean,System.Boolean)"]
See Also
Reference
DigitizerPlugIn Class
Rhino.PlugIns Namespace