RhinoCommon SDK
Plane Operators
Rhino for Mac 5.1
The Plane type exposes the following members.
Operators
Name | Description
Equality
 Determines if two planes are equal.
Inequality
 Determines if two planes are different.
Top
See Also
Reference
Plane Structure
Rhino.Geometry Namespace