RhinoCommon SDK
File3dm.CreatedBy Property
Rhino for Mac 5.1
 Gets a string that names the user who created the file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string CreatedBy { get; }
Public ReadOnly Property CreatedBy As String
	Get
Property Value
Type: String
See Also
Reference
File3dm Class
Rhino.FileIO Namespace