RhinoCommon SDK
DisplayPipeline.DrawCurve Method
Rhino for Mac 5.1
Overload List
Name | Description
DrawCurve(Curve, Color)
 Draw a single Curve object.
DrawCurve(Curve, Color, Int32)
 Draw a single Curve object.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace