RhinoCommon SDK
DimStyleTable.Add Method
Rhino for Mac 5.1
Overload List
Name | Description
Add(String)
 Adds a new dimension style to the document. The new dimension style will be initialized with the current default dimension style properties.
Add(String, Boolean)
 Adds a new dimension style to the document. The new dimension style will be initialized with the current default dimension style properties.
Top
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace