RhinoCommon SDK
Intersection.BrepBrep Method
Rhino for Mac 5.1
 Intersects two Breps.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool BrepBrep(
	Brep brepA,
	Brep brepB,
	double tolerance,
	out Curve[] intersectionCurves,
	out Point3d[] intersectionPoints
)
Public Shared Function BrepBrep (
	brepA As Brep,
	brepB As Brep,
	tolerance As Double,
	<OutAttribute> ByRef intersectionCurves As Curve(),
	<OutAttribute> ByRef intersectionPoints As Point3d()
) As Boolean
Parameters
brepA
Type: Rhino.Geometry.Brep
First Brep for intersection.
brepB
Type: Rhino.Geometry.Brep
Second Brep for intersection.
tolerance
Type: System.Double
Intersection tolerance.
intersectionCurves
Type: Rhino.Geometry.Curve[]
The intersection curves will be returned here.
intersectionPoints
Type: Rhino.Geometry.Point3d[]
The intersection points will be returned here.
Return Value
Type: Boolean
true on success; false on failure.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace