RhinoCommon SDK
Curve.TryGetArc Method (Arc)
Rhino for Mac 5.1
 Try to convert this curve into an Arc using RhinoMath.ZeroTolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetArc(
	out Arc arc
)
Public Function TryGetArc (
	<OutAttribute> ByRef arc As Arc
) As Boolean
Parameters
arc
Type: Rhino.Geometry.Arc
On success, the Arc will be filled in.
Return Value
Type: Boolean
true if the curve could be converted into an arc.
See Also
Reference
Curve Class
TryGetArc Overload
Rhino.Geometry Namespace