RhinoCommon SDK
Unroller.ExplodeOutput Property
Rhino for Mac 5.1
 Gets or sets a value determining whether geometry should be exploded.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ExplodeOutput { get; set; }
Public Property ExplodeOutput As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Unroller Class
Rhino.Geometry Namespace