RhinoCommon SDK
Particle.Size Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Geometry.Particle.Size"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public float Size { get; set; }
Public Property Size As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
Particle Class
Rhino.Geometry Namespace