RhinoCommon SDK
File3dmObjectTable.AddBrep Method
Rhino for Mac 5.1
Overload List
Name | Description
AddBrep(Brep)
Adds a brep object to Rhino.
AddBrep(Brep, ObjectAttributes)
Adds a brep object to Rhino.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace