RhinoCommon SDK
Light.Direction Property
Rhino for Mac 5.1
 Gets or sets the vector direction of the camera.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d Direction { get; set; }
Public Property Direction As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
Light Class
Rhino.Geometry Namespace