RhinoCommon SDK
RenderSettings.DepthCue Property
Rhino for Mac 5.1
 Gets or sets a value indicating whether to render using depth cues.
These are clues to help the perception of position and orientation of objects in the image.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DepthCue { get; set; }
Public Property DepthCue As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderSettings Class
Rhino.Render Namespace