RhinoCommon SDK
Quaternion.GetHashCode Method
Rhino for Mac 5.1
 Gets a non-unique but repeatable hashing code for this quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A signed number.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace