RhinoCommon SDK
Point3dList.Transform Method
Rhino for Mac 5.1
 Applies a transform to all the points in the list.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Transform(
	Transform xform
)
Public Sub Transform (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
Transform to apply.
See Also
Reference
Point3dList Class
Rhino.Collections Namespace