RhinoCommon SDK
File3dmObjectTable.AddArc Method
Rhino for Mac 5.1
Overload List
Name | Description
AddArc(Arc)
Adds a curve object to the document representing an arc.
AddArc(Arc, ObjectAttributes)
Adds a curve object to the document representing an arc.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace