RhinoCommon SDK
Ray3d Operators
Rhino for Mac 5.1
The Ray3d type exposes the following members.
Operators
Name | Description
Equality
 Determines whether two Ray3d have equal values.
Inequality
 Determines whether two Ray3d have different values.
Top
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace