RhinoCommon SDK
Command.GetCommandStack Method
Rhino for Mac 5.1
 Determines if Rhino is currently running a command. Because Rhino allow for transparent commands (commands that can be run from inside of other commands), this method returns the total ids of active commands.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid[] GetCommandStack()
Public Shared Function GetCommandStack As Guid()
Return Value
Type: Guid[]
 Ids of running commands or null if no commands are currently running. The "active" command is at the end of this list.
See Also
Reference
Command Class
Rhino.Commands Namespace