RhinoCommon SDK
VisualAnalysisMode.EnableUserInterface Method
Rhino for Mac 5.1
 Turns the analysis mode's user interface on and off. For Rhino's built in modes this opens or closes the modeless dialog that controls the analysis mode's display settings.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual void EnableUserInterface(
	bool on
)
Public Overridable Sub EnableUserInterface (
	on As Boolean
)
Parameters
on
Type: System.Boolean
true if the inferface should be shown; false if it should be concealed.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace