RhinoCommon SDK
ObjectTable.Select Method (ObjRef, Boolean, Boolean)
Rhino for Mac 5.1
 Select or deselects a single object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Select(
	ObjRef objref,
	bool select,
	bool syncHighlight
)
Public Function Select (
	objref As ObjRef,
	select As Boolean,
	syncHighlight As Boolean
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
Object represented by this ObjRef is selected.
select
Type: System.Boolean
If true, the object will be selected, if false, it will be deselected.
syncHighlight
Type: System.Boolean
 If true, then the object is highlighted if it is selected and unhighlighted if is is not selected.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
ObjectTable Class
Select Overload
Rhino.DocObjects.Tables Namespace