RhinoCommon SDK
Line.TryCreateBetweenCurves Method
Rhino for Mac 5.1
 Creates a line segment between a pair of curves such that the line segment is either tangent or perpendicular to each of the curves.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool TryCreateBetweenCurves(
	Curve curve0,
	Curve curve1,
	ref double t0,
	ref double t1,
	bool perpendicular0,
	bool perpendicular1,
	out Line line
)
Public Shared Function TryCreateBetweenCurves (
	curve0 As Curve,
	curve1 As Curve,
	ByRef t0 As Double,
	ByRef t1 As Double,
	perpendicular0 As Boolean,
	perpendicular1 As Boolean,
	<OutAttribute> ByRef line As Line
) As Boolean
Parameters
curve0
Type: Rhino.Geometry.Curve
The first curve.
curve1
Type: Rhino.Geometry.Curve
The second curve.
t0
Type: System.Double
Parameter value of point on curve0. Seed value at input and solution at output.
t1
Type: System.Double
Parameter value of point on curve 0. Seed value at input and solution at output.
perpendicular0
Type: System.Boolean
Find line Perpendicuar to (true) or tangent to (false) curve0.
perpendicular1
Type: System.Boolean
Find line Perpendicuar to (true) or tangent to (false) curve1.
line
Type: Rhino.Geometry.Line
The line segment if successful.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Line Structure
Rhino.Geometry Namespace