RhinoCommon SDK
DisplayPipeline.IsVisible Method (RhinoObject)
Rhino for Mac 5.1
 Test a given object for visibility inside the view frustum under the current viewport and model transformation settings. This function calls a virtual IsVisibleFinal function that subclassed pipelines can add extra tests to. In the base class, this test only tests visibility based on the objects world coordinates location and does not pay attention to the object's attributes. NOTE: Use CRhinoDisplayPipeline::IsVisible() to perform "visibility" tests based on location (is some part of the object in the view frustum). Use CRhinoDisplayPipeline::IsActive() to perform "visibility" tests based on object type.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsVisible(
	RhinoObject rhinoObject
)
Public Function IsVisible (
	rhinoObject As RhinoObject
) As Boolean
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
Object to test.
Return Value
Type: Boolean
true if the object is visible, false if not.
See Also
Reference
DisplayPipeline Class
IsVisible Overload
Rhino.Display Namespace