RhinoCommon SDK
TextureUvwWrapping Enumeration
Rhino for Mac 5.1
 Defines Texture UVW wrapping modes
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum TextureUvwWrapping
Public Enumeration TextureUvwWrapping
Members
Member name | Value | Description
Repeat | 0 |  Repeat the texture
Clamp | 1 |  Clamp the texture
See Also
Reference
Rhino.DocObjects Namespace