RhinoCommon SDK
TextEntity.MaskOffset Property
Rhino for Mac 5.1
 distance around text to display mask
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double MaskOffset { get; set; }
Public Property MaskOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace