RhinoCommon SDK
Light.SpotLightShadowIntensity Property
Rhino for Mac 5.1
 Gets or sets the spot light shadow intensity.
(ignored for non-spot lights.)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double SpotLightShadowIntensity { get; set; }
Public Property SpotLightShadowIntensity As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Light Class
Rhino.Geometry Namespace