RhinoCommon SDK
Transform.TransformList Method
Rhino for Mac 5.1
 Given a list, an array or any enumerable set of points, computes a new array of tranformed points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d[] TransformList(
	IEnumerable<Point3d> points
)
Public Function TransformList (
	points As IEnumerable(Of Point3d)
) As Point3d()
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable set of points to be left untouched and copied.
Return Value
Type: Point3d[]
A new array.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace