RhinoCommon SDK
Vector2f.CompareTo Method
Rhino for Mac 5.1
 Compares this Vector2f with another Vector2f.
Components evaluation priority is first X, then Y.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int CompareTo(
	Vector2f other
)
Public Function CompareTo (
	other As Vector2f
) As Integer
Parameters
other
Type: Rhino.Geometry.Vector2f
The other Vector2f to use in comparison.
Return Value
Type: Int32
 0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
+1: otherwise.
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace