RhinoCommon SDK
DisplayMaterial.Shine Property
Rhino for Mac 5.1
 Gets or sets the shine factor of the material (0.0 to 1.0)
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Shine { get; set; }
Public Property Shine As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace