RhinoCommon SDK
ObjectTable.Replace Method (ObjRef, RhinoObject)
Rhino for Mac 5.1
 Replaces one object with another. Conceptually, this function is the same as calling Setting new_object attributes = old_object attributes DeleteObject(old_object); AddObject(old_object);
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	ObjRef objref,
	RhinoObject newObject
)
Public Function Replace (
	objref As ObjRef,
	newObject As RhinoObject
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
reference to old object to be replaced. The objref.Object() will be deleted.
newObject
Type: Rhino.DocObjects.RhinoObject
new replacement object - must not be in document.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace