RhinoCommon SDK
SweepOneRail.SweepTolerance Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.SweepTolerance"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double SweepTolerance { get; set; }
Public Property SweepTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace