RhinoCommon SDK
ObjectTable.Add Method
Rhino for Mac 5.1
Overload List
Name | Description
Add(GeometryBase)
 Adds geometry that is not further specified.
This is meant, for example, to handle addition of sets of different geometrical entities.
Add(GeometryBase, ObjectAttributes)
 Adds geometry that is not further specified.
This is meant, for example, to handle addition of sets of different geometrical entities.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace