RhinoCommon SDK
TextureMapping.UvwTransform Property
Rhino for Mac 5.1
 Transform applied to mapping coordinate (u,v,w) to convert it into a texture coordinate.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform UvwTransform { get; set; }
Public Property UvwTransform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
TextureMapping Class
Rhino.Render Namespace