RhinoCommon SDK
RhinoObject.EnableCustomGrips Method
Rhino for Mac 5.1
Turns on/off the object's editing grips.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool EnableCustomGrips(
	CustomObjectGrips customGrips
)
Public Function EnableCustomGrips (
	customGrips As CustomObjectGrips
) As Boolean
Parameters
customGrips
Type: Rhino.DocObjects.Custom.CustomObjectGrips
The custom object grips.
Return Value
Type: Boolean
 true if the call succeeded. If you attempt to add custom grips to an object that does not support custom grips, then false is returned.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace