RhinoCommon SDK
SweepOneRail Class
Rhino for Mac 5.1
 Utility class for generating breps by sweeping cross section curves over a single rail curve.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SweepOneRail
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class SweepOneRail
Public Class SweepOneRail
The SweepOneRail type exposes the following members.
Constructors
Name | Description
SweepOneRail
Initializes a new instance of the SweepOneRail class
Top
Properties
Name | Description
AngleToleranceRadians
ClosedSweep
 If the input rail is closed, ClosedSweep determines if the swept breps will also be closed.
GlobalShapeBlending
 If true, the sweep is linearly blended from one end to the other, creating sweeps that taper from one cross-section curve to the other. If false, the sweep stays constant at the ends and changes more rapidly in the middle.
IsFreeform
IsRoadlike
IsRoadlikeFront
IsRoadlikeTop
IsRoadlineRight
MiterType
 0: don't miter, 1: intersect surfaces and trim sweeps, 2: rotate shapes at kinks and don't trim.
SweepTolerance
Top
Methods
Name | Description
PerformSweep(Curve, Curve)
PerformSweep(Curve, IEnumerable<Curve>)
PerformSweep(Curve, Curve, Double)
PerformSweep(Curve, IEnumerable<Curve>, IEnumerable<Double>)
PerformSweepRebuild(Curve, Curve, Int32)
PerformSweepRebuild(Curve, IEnumerable<Curve>, Int32)
PerformSweepRebuild(Curve, Curve, Double, Int32)
PerformSweepRebuild(Curve, IEnumerable<Curve>, IEnumerable<Double>, Int32)
PerformSweepRefit(Curve, Curve, Double)
PerformSweepRefit(Curve, IEnumerable<Curve>, Double)
PerformSweepRefit(Curve, Curve, Double, Double)
PerformSweepRefit(Curve, IEnumerable<Curve>, IEnumerable<Double>, Double)
SetRoadlikeUpDirection
SetToRoadlikeFront
SetToRoadlikeRight
SetToRoadlikeTop
Top
See Also
Reference
Rhino.Geometry Namespace