RhinoCommon SDK
ObjRef.TextDot Method
Rhino for Mac 5.1
 Gets the text dot if the referenced geometry is one.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TextDot TextDot()
Public Function TextDot As TextDot
Return Value
Type: TextDot
A text dot; or null if the referenced object is not a text dot, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace