RhinoCommon SDK
Light Constructor
Rhino for Mac 5.1
Overload List
Name | Description
Light()
 Initializes a new light.
Light(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
Light Class
Rhino.Geometry Namespace