RhinoCommon SDK
Point3d.CullDuplicates Method
Rhino for Mac 5.1
 Removes duplicates in the supplied set of points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d[] CullDuplicates(
	IEnumerable<Point3d> points,
	double tolerance
)
Public Shared Function CullDuplicates (
	points As IEnumerable(Of Point3d),
	tolerance As Double
) As Point3d()
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable of Point3d.
tolerance
Type: System.Double
The minimum distance between points.
Points that fall within this tolerance will be discarded.
 .
Return Value
Type: Point3d[]
An array of points without duplicates; or null on error.
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace