RhinoCommon SDK
Surface.CreateRollingBallFillet Method (Surface, Surface, Double, Double)
Rhino for Mac 5.1
 Constructs a rolling ball fillet between two surfaces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Surface[] CreateRollingBallFillet(
	Surface surfaceA,
	Surface surfaceB,
	double radius,
	double tolerance
)
Public Shared Function CreateRollingBallFillet (
	surfaceA As Surface,
	surfaceB As Surface,
	radius As Double,
	tolerance As Double
) As Surface()
Parameters
surfaceA
Type: Rhino.Geometry.Surface
A first surface.
surfaceB
Type: Rhino.Geometry.Surface
A second surface.
radius
Type: System.Double
A radius value.
tolerance
Type: System.Double
A tolerance value.
Return Value
Type: Surface[]
A new array of rolling ball fillet surfaces; this array can be empty on failure.
Exceptions
Exception | Condition
ArgumentNullException | If surfaceA or surfaceB are null.
See Also
Reference
Surface Class
CreateRollingBallFillet Overload
Rhino.Geometry Namespace