RhinoCommon SDK
MeshTopologyEdgeList.SplitEdge Method
Rhino for Mac 5.1
Overload List
Name | Description
SplitEdge(Int32, Point3d)
 Divides a mesh edge to create two or more triangles
SplitEdge(Int32, Double)
 Divides a mesh edge to create two or more triangles
Top
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace