RhinoCommon SDK
File3dm.Revision Property
Rhino for Mac 5.1
 Gets or sets the revision number.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Revision { get; set; }
Public Property Revision As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
File3dm Class
Rhino.FileIO Namespace