RhinoCommon SDK
CustomPointObject.Dispose Method
Rhino for Mac 5.1
Overload List
Name | Description
Dispose()
Releases all resources used by the CustomPointObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomPointObject and optionally releases the managed resources
Top
See Also
Reference
CustomPointObject Class
Rhino.DocObjects.Custom Namespace