RhinoCommon SDK
CustomDisplay.AddPoint Method (Point3d, Color)
Rhino for Mac 5.1
 Adds a new colored point to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddPoint(
	Point3d point,
	Color color
)
Public Sub AddPoint (
	point As Point3d,
	color As Color
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to add.
color
Type: System.Drawing.Color
Color of point.
See Also
Reference
CustomDisplay Class
AddPoint Overload
Rhino.Display Namespace