RhinoCommon SDK
File3dm.PlugInData Property
Rhino for Mac 5.1
 Custom plug-in data in this file. This data is not attached to any geometry or attributes
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public File3dmPlugInDataTable PlugInData { get; }
Public ReadOnly Property PlugInData As File3dmPlugInDataTable
	Get
Property Value
Type: File3dmPlugInDataTable
See Also
Reference
File3dm Class
Rhino.FileIO Namespace