RhinoCommon SDK
Sphere.BoundingBox Property
Rhino for Mac 5.1
 Gets the world aligned boundingbox for this Sphere. If the Sphere is Invalid, an empty box is returned.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace