RhinoCommon SDK
OptionsDialogPage Methods
Rhino for Mac 5.1
The OptionsDialogPage type exposes the following members.
Methods
Name | Description
RunScript
Top
See Also
Reference
OptionsDialogPage Class
Rhino.UI Namespace