RhinoCommon SDK
Transform.ChangeBasis Method (Plane, Plane)
Rhino for Mac 5.1
 Computes a change of basis transformation. A basis change is essentially a remapping of geometry from one coordinate system to another.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform ChangeBasis(
	Plane plane0,
	Plane plane1
)
Public Shared Function ChangeBasis (
	plane0 As Plane,
	plane1 As Plane
) As Transform
Parameters
plane0
Type: Rhino.Geometry.Plane
Coordinate system in which the geometry is currently described.
plane1
Type: Rhino.Geometry.Plane
Target coordinate system in which we want the geometry to be described.
Return Value
Type: Transform
 A transformation matrix which orients geometry from one coordinate system to another on success. Transform.Unset on failure.
See Also
Reference
Transform Structure
ChangeBasis Overload
Rhino.Geometry Namespace