RhinoCommon SDK
DisplayModeDescription.SupportsShading Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.SupportsShading"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SupportsShading { get; set; }
Public Property SupportsShading As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace