RhinoCommon SDK
Polyline Methods
Rhino for Mac 5.1
The Polyline type exposes the following members.
Methods
Name | Description
BreakAtAngles
 Breaks this polyline into sections at sharp kinks. Closed polylines will also be broken at the first and last vertex.
CenterPoint
 Compute the center point of the polyline as the weighted average of all segments.
ClosestParameter
 Gets the parameter along the polyline which is closest to a test-point.
ClosestPoint
 Gets the point on the polyline which is closest to a test-point.
CollapseShortSegments
 Collapses all segments until none are shorter than tolerance. This function is significantly slower than DeleteShortSegments, since it recursively operates on the shortest segment. When a segment is collapsed the end-points are placed in the center of the segment.
DeleteShortSegments
 Removes all points that are closer than tolerance to the previous point.
Start and end points are left intact.
GetSegments
 Constructs an array of line segments that make up the entire polyline.
IsClosedWithinTolerance
 Determines whether the polyline is closed, provided a tolerance value.
PointAt
 Gets the point on the polyline at the given parameter. The integer part of the parameter indicates the index of the segment.
ReduceSegments
 Constructs a reduction of this polyline by recursively removing the least significant segments.
SegmentAt
 Gets the line segment at the given index.
Smooth
 Smoothens the polyline segments by averaging adjacent vertices. Smoothing requires a polyline with exclusively valid vertices.
TangentAt
 Gets the unit tangent vector along the polyline at the given parameter. The integer part of the parameter indicates the index of the segment.
ToNurbsCurve
 Constructs a nurbs curve representation of this polyline.
TriangulateClosedPolyline
 Attempts to create a list of triangles which represent a triangulation of a closed polyline
Trim
 Constructs a polyline out of a parameter subdomain in this curve.
Top
See Also
Reference
Polyline Class
Rhino.Geometry Namespace