RhinoCommon SDK
GeometryBase.Translate Method (Vector3d)
Rhino for Mac 5.1
Translates the object along the specified vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Translate(
	Vector3d translationVector
)
Public Function Translate (
	translationVector As Vector3d
) As Boolean
Parameters
translationVector
Type: Rhino.Geometry.Vector3d
A moving vector.
Return Value
Type: Boolean
true if geometry successfully translated.
See Also
Reference
GeometryBase Class
Translate Overload
Rhino.Geometry Namespace