RhinoCommon SDK
BinaryArchiveWriter.WriteDouble Method
Rhino for Mac 5.1
 Writes a Double value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteDouble(
	double value
)
Public Sub WriteDouble (
	value As Double
)
Parameters
value
Type: System.Double
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace