RhinoCommon SDK
File3dm.Objects Property
Rhino for Mac 5.1
 Gets access to the File3dmObjectTable class associated with this file, which contains all objects.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public File3dmObjectTable Objects { get; }
Public ReadOnly Property Objects As File3dmObjectTable
	Get
Property Value
Type: File3dmObjectTable
See Also
Reference
File3dm Class
Rhino.FileIO Namespace