RhinoCommon SDK
GetBaseClass.SetCommandPromptDefault Method
Rhino for Mac 5.1
 Sets message that describes what default value will be used if the user presses enter. This description appears in angle brackets <> in the command prompt window. You do not need to provide a default value description unless you explicity enable AcceptNothing.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetCommandPromptDefault(
	string defaultValue
)
Public Sub SetCommandPromptDefault (
	defaultValue As String
)
Parameters
defaultValue
Type: System.String
description of default value.
Remarks
 If you have a simple default point, number, or string, it is easier to use SetDefaultPoint, SetDefaultNumber, or SetDefaultString. SetCommandPromptDefault and AcceptNothing can be used for providing more advanced UI behavior.
Examples
 ON_3dPoint default_center = new ON_3dPoint(2,3,4); GetPoint gp = new GetPoint(); gp.SetCommandPrompt( "Center point" ); gp.SetCommandPromptDefault( "(2,3,4)" ); gp.AcceptNothing(true); gp.GetPoint(); if ( gp.Result() == GetResult.Nothing ) point = default_center;
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace