RhinoCommon SDK
MeshTopologyEdgeList.GetConnectedFaces Method (Int32, Boolean[])
Rhino for Mac 5.1
 Gets indices of faces connected to an edge.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] GetConnectedFaces(
	int topologyEdgeIndex,
	out bool[] faceOrientationMatchesEdgeDirection
)
Public Function GetConnectedFaces (
	topologyEdgeIndex As Integer,
	<OutAttribute> ByRef faceOrientationMatchesEdgeDirection As Boolean()
) As Integer()
Parameters
topologyEdgeIndex
Type: System.Int32
An index of a topology edge that is queried.
faceOrientationMatchesEdgeDirection
Type: System.Boolean[]
An array of Boolean values that explains whether each face direction matches the direction of the specified edge.
Return Value
Type: Int32[]
An array of face indices the edge borders. This might be empty on error.
See Also
Reference
MeshTopologyEdgeList Class
GetConnectedFaces Overload
Rhino.Geometry.Collections Namespace