RhinoCommon SDK
DisplayMaterial Constructor (Color)
Rhino for Mac 5.1
 Constructs a default material with a specific diffuse color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DisplayMaterial(
	Color diffuse
)
Public Sub New (
	diffuse As Color
)
Parameters
diffuse
Type: System.Drawing.Color
Diffuse color of material. The alpha component of the Diffuse color is ignored.
See Also
Reference
DisplayMaterial Class
DisplayMaterial Overload
Rhino.Display Namespace