RhinoCommon SDK
DisplayMaterial Constructor (Color, Color, Color, Color, Double, Double)
Rhino for Mac 5.1
 Constructs a material with custom properties.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DisplayMaterial(
	Color diffuse,
	Color specular,
	Color ambient,
	Color emission,
	double shine,
	double transparency
)
Public Sub New (
	diffuse As Color,
	specular As Color,
	ambient As Color,
	emission As Color,
	shine As Double,
	transparency As Double
)
Parameters
diffuse
Type: System.Drawing.Color
Diffuse color of material. The alpha component of the Diffuse color is ignored.
specular
Type: System.Drawing.Color
Specular color of material. The alpha component of the Specular color is ignored.
ambient
Type: System.Drawing.Color
Ambient color of material. The alpha component of the Ambient color is ignored.
emission
Type: System.Drawing.Color
Emission color of material. The alpha component of the Emission color is ignored.
shine
Type: System.Double
Shine (highlight size) of material.
transparency
Type: System.Double
Transparency of material (0.0 = opaque, 1.0 = transparent)
See Also
Reference
DisplayMaterial Class
DisplayMaterial Overload
Rhino.Display Namespace