RhinoCommon SDK
DisplayMaterial Constructor (Color, Double)
Rhino for Mac 5.1
 Constructs a default material with a specific diffuse color and transparency.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DisplayMaterial(
	Color diffuse,
	double transparency
)
Public Sub New (
	diffuse As Color,
	transparency As Double
)
Parameters
diffuse
Type: System.Drawing.Color
Diffuse color of material. The alpha component of the Diffuse color is ignored.
transparency
Type: System.Double
Transparency factor (0.0 = opaque, 1.0 = transparent)
See Also
Reference
DisplayMaterial Class
DisplayMaterial Overload
Rhino.Display Namespace