RhinoCommon SDK
ViewportInfo.UnlockCamera Method
Rhino for Mac 5.1
 Unlocks the camera vectors and location.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void UnlockCamera()
Public Sub UnlockCamera
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace