RhinoCommon SDK
MeshTopologyVertexList.ConnectedFaces Method
Rhino for Mac 5.1
 Gets all faces that are connected to a given vertex.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] ConnectedFaces(
	int topologyVertexIndex
)
Public Function ConnectedFaces (
	topologyVertexIndex As Integer
) As Integer()
Parameters
topologyVertexIndex
Type: System.Int32
Index of a topology vertex in Mesh.TopologyVertices.
Return Value
Type: Int32[]
 Indices of all faces in Mesh.Faces that are connected to this topological vertex. null if no faces are connected to this vertex.
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace