RhinoCommon SDK
LayerTable.Item Property
Rhino for Mac 5.1
 Conceptually, the layer table is an array of layers. The operator[] can be used to get individual layers. A layer is either active or deleted and this state is reported by Layer.IsDeleted.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Layer this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As Layer
	Get
Parameters
index
Type: System.Int32
zero based array index.
Return Value
Type: Layer
 Refererence to the layer. If layer_index is out of range, the current layer is returned. Note that this reference may become invalid after AddLayer() is called.
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace