RhinoCommon SDK
Surface.IsTorus Method
Rhino for Mac 5.1
Overload List
Name | Description
IsTorus()
Determines if the surface is a portion of a torus within RhinoMath.ZeroTolerance.
IsTorus(Double)
Determines if the surface is a portion of a torus within a given tolerance.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace