RhinoCommon SDK
LinetypeTable.GetEnumerator Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LinetypeTable.GetEnumerator"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<Linetype> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Linetype)
Return Value
Type: IEnumerator<Linetype>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LinetypeTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace