RhinoCommon SDK
Sphere.EquitorialPlane Property
Rhino for Mac 5.1
 Gets or sets the Equatorial plane for this sphere.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Plane EquitorialPlane { get; set; }
Public Property EquitorialPlane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace