RhinoCommon SDK
MaterialRefCreateParams.BackFaceMaterialId Property
Rhino for Mac 5.1
 The Id of the Material used to render the back of an object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid BackFaceMaterialId { get; set; }
Public Property BackFaceMaterialId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace