RhinoCommon SDK
DisplayPipelineAttributes.MeshDisplayAttributes Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes"]
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class MeshDisplayAttributes
Public NotInheritable Class MeshDisplayAttributes
The DisplayPipelineAttributes.MeshDisplayAttributes type exposes the following members.
Properties
Name | Description
AllMeshWiresColor
 Color.Empty means that we are NOT using a single color for all mesh wires.
HighlightMeshes
MeshWireThickness
ShowMeshVertices
ShowMeshWires
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace