RhinoCommon SDK
Text3d Properties
Rhino for Mac 5.1
The Text3d type exposes the following members.
Properties
Name | Description
Bold
 Gets or sets whether this Text3d object will be drawn in Bold.
BoundingBox
 Gets the boundingbox for this Text3d object.
FontFace
 Gets or sets the FontFace name.
Height
 Gets or sets the height (in units) of this Text3d object. The height should be a positive number larger than zero.
Italic
 Gets or sets whether this Text3d object will be drawn in Italics.
Text
 Gets or sets the text string for this Text3d object.
TextPlane
 Gets or sets the 3D aligned plane for this Text3d object.
Top
See Also
Reference
Text3d Class
Rhino.Display Namespace