RhinoCommon SDK
Curve.RemoveShortSegments Method
Rhino for Mac 5.1
 Looks for segments that are shorter than tolerance that can be removed. Does not change the domain, but it will change the relative parameterization.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool RemoveShortSegments(
	double tolerance
)
Public Function RemoveShortSegments (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
Tolerance which defines "short" segments.
Return Value
Type: Boolean
 true if removable short segments were found. false if no removable short segments were found.
See Also
Reference
Curve Class
Rhino.Geometry Namespace