RhinoCommon SDK
Text3d.Italic Property
Rhino for Mac 5.1
 Gets or sets whether this Text3d object will be drawn in Italics.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Italic { get; set; }
Public Property Italic As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Text3d Class
Rhino.Display Namespace