RhinoCommon SDK
ViewportInfo.FrustumMinimumDiameter Property
Rhino for Mac 5.1
 Gets the frustum minimum diameter, or the minimum between FrustumWidth and FrustumHeight.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double FrustumMinimumDiameter { get; }
Public ReadOnly Property FrustumMinimumDiameter As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace