RhinoCommon SDK
ViewportInfo.DollyExtents Method (BoundingBox, Double)
Rhino for Mac 5.1
 Dolly the camera location and so that the view frustum contains all of the document objects that can be seen in view. If the projection is perspective, the camera angle is not changed.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DollyExtents(
	BoundingBox cameraCoordinateBoundingBox,
	double border
)
Public Function DollyExtents (
	cameraCoordinateBoundingBox As BoundingBox,
	border As Double
) As Boolean
Parameters
cameraCoordinateBoundingBox
Type: Rhino.Geometry.BoundingBox
[Missing <param name="cameraCoordinateBoundingBox"/> documentation for "M:Rhino.DocObjects.ViewportInfo.DollyExtents(Rhino.Geometry.BoundingBox,System.Double)"]
border
Type: System.Double
 If border > 1.0, then the fustum in enlarged by this factor to provide a border around the view. 1.1 works well for parallel projections; 0.0 is suggested for perspective projections.
Return Value
Type: Boolean
True if successful.
See Also
Reference
ViewportInfo Class
DollyExtents Overload
Rhino.DocObjects Namespace