RhinoCommon SDK
ControlPoint.Unset Property
Rhino for Mac 5.1
 Gets the predefined unset control point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ControlPoint Unset { get; }
Public Shared ReadOnly Property Unset As ControlPoint
	Get
Property Value
Type: ControlPoint
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace