RhinoCommon SDK
BrepTrimList Class
Rhino for Mac 5.1
 Provides access to all the Trims in a Brep object
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.BrepTrimList
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class BrepTrimList : IEnumerable<BrepTrim>,
	IEnumerable
Public Class BrepTrimList
	Implements IEnumerable(Of BrepTrim), IEnumerable
The BrepTrimList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of brep trims.
Item
 Gets the BrepTrim at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
Methods
Name | Description
Add(Int32)
 Add a new trim that will be part of an inner, outer, or slit loop to the brep.
Add(Boolean, BrepEdge, Int32)
 Add a new trim that will be part of an inner, outer, or slit loop to the brep
Add(Boolean, BrepLoop, Int32)
 Add a new trim that will be part of an inner, outer, or slit loop to the brep
Add(BrepEdge, Boolean, BrepLoop, Int32)
 Add a new trim that will be part of an inner, outer, or slit loop to the brep.
AddCurveOnFace
Add a new curve on face to the brep
AddSingularTrim
 Add a new singular trim to the brep.
GetEnumerator
 Gets an enumerator that visits all edges.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace