RhinoCommon SDK
RhinoList<T> Class
Rhino for Mac 5.1
 Represents a list of generic data. This class is similar to System.Collections.Generic.List(T) but exposes a few more methods.
Inheritance Hierarchy
System.Object
 Rhino.Collections.RhinoList<T>
 Rhino.Collections.CurveList
 Rhino.Collections.Point3dList
 Rhino.Geometry.Interpolator
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class RhinoList<T> : IList<T>,
	IList, ICollection<T>, IEnumerable<T>, IEnumerable, ICollection
<SerializableAttribute>
Public Class RhinoList(Of T)
	Implements IList(Of T), IList, ICollection(Of T),
	IEnumerable(Of T), IEnumerable, ICollection
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "T:Rhino.Collections.RhinoList`1"]
The RhinoList<T> type exposes the following members.
Constructors
Name | Description
RhinoList<T>()
 Initializes a new, empty list.
RhinoList<T>(IEnumerable<T>)
 Initializes this list as a shallow duplicate of another list, array or any other enumerable set of T.
RhinoList<T>(Int32)
 Initializes an empty list with a certain capacity.
RhinoList<T>(RhinoList<T>)
 Initializes an new list by shallow duplicating another list.
RhinoList<T>(Int32, T)
 Initializes a new list with a specified amount of values.
Top
Properties
Name | Description
Capacity
 Gets or sets the total number of elements the internal data structure can hold without resizing.
Count
 Gets the number of elements actually contained in the List.
First
 Gets or sets the first item in the list. This is synonymous to calling List[0].
Item
 Gets or sets the element at the specified index.
Last
 Gets or sets the last item in the list. This is synonymous to calling List[Count-1].
NullCount
 Gets the number of null references (Nothing in Visual Basic) in this list. If T is a ValueType, this property always return zero.
Top
Methods
Name | Description
Add
 Adds an object to the end of the List.
AddRange(IEnumerable<T>)
 Adds the elements of the specified collection to the end of the List.
AddRange(IEnumerable)
 Adds the elements of the specified collection to the end of the List.
AsReadOnly
 Constructs a read-only wrapper of this class.
BinarySearch(T)
 Searches the entire sorted List for an element using the default comparer and returns the zero-based index of the element.
BinarySearch(T, IComparer<T>)
 Searches the entire sorted List for an element using the specified comparer and returns the zero-based index of the element.
BinarySearch(Int32, Int32, T, IComparer<T>)
 Searches the entire sorted List for an element using the specified comparer and returns the zero-based index of the element.
Clear
 Removes all elements from the List.
Contains
 Determines whether an element is in the List.
ConvertAll<TOutput>
 Aggregates all results of a conversion function over this table into a new list.
CopyTo(T[])
 Copies the entire List to a compatible one-dimensional array, starting at the beginning of the target array.
CopyTo(T[], Int32)
 Copies the entire List to a compatible one-dimensional array, starting at the specified index of the target array.
CopyTo(Int32, T[], Int32, Int32)
 Copies a range of elements from the List to a compatible one-dimensional array, starting at the specified index of the target array.
Exists
 Determines whether the List contains elements that match the conditions defined by the specified predicate.
Find
 Searches for an element that matches the conditions defined by the specified predicate, and returns the first occurrence within the entire List.
FindAll
 Retrieves all the elements that match the conditions defined by the specified predicate.
FindIndex(Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the first occurrence within the entire List.
FindIndex(Int32, Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the first occurrence within the entire List.
FindIndex(Int32, Int32, Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the first occurrence within the range of elements in the List that extends from the specified index to the last element.
FindLast
 Searches for an element that matches the conditions defined by the specified predicate, and returns the last occurrence within the entire List.
FindLastIndex(Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the last occurrence within the entire List.
FindLastIndex(Int32, Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the last occurrence within the entire List.
FindLastIndex(Int32, Int32, Predicate<T>)
 Searches for an element that matches the conditions defined by the specified predicate, and returns the zero-based index of the last occurrence within the entire List.
ForEach
 Performs the specified action on each element of the List.
GetEnumerator
 Constructs an enumerator that is capable of iterating over all items in this list.
GetRange
 Constructs a shallow copy of a range of elements in the source List.
IndexOf(T)
 Searches for the specified object and returns the zero-based index of the first occurrence within the entire List.
IndexOf(T, Int32)
 Searches for the specified object and returns the zero-based index of the first occurrence within the range of elements in the List that extends from the specified index to the last element.
IndexOf(T, Int32, Int32)
 Searches for the specified object and returns the zero-based index of the first occurrence within the range of elements in the List that starts at the specified index and contains the specified number of elements.
Insert
 Inserts an element into the List at the specified index.
InsertRange
 Inserts the elements of a collection into the List at the specified index.
LastIndexOf(T)
 Searches for the specified object and returns the zero-based index of the last occurrence within the entire List.
LastIndexOf(T, Int32)
 Searches for the specified object and returns the zero-based index of the last occurrence within the range of elements in the List that extends from the first element to the specified index.
LastIndexOf(T, Int32, Int32)
 Searches for the specified object and returns the zero-based index of the last occurrence within the range of elements in the List that contains the specified number of elements and ends at the specified index.
RemapIndex
 Remap an index in the infinite range onto the List index range.
Remove
 Removes the first occurrence of a specific object from the List.
RemoveAll
 Removes the all the elements that match the conditions defined by the specified predicate.
RemoveAt
 Removes the element at the specified index of the List.
RemoveNulls
 Removes all elements from the List that are null references (Nothing in Visual Basic). This function will not do anything if T is not a Reference type.
RemoveRange
 Removes a range of elements from the List.
Reverse()
 Reverses the order of the elements in the entire List.
Reverse(Int32, Int32)
 Reverses the order of the elements in the specified range.
Sort()
 Sorts the elements in the entire List using the default comparer.
Sort(IComparer<T>)
 Sorts the elements in the entire list using the specified System.Comparison(T)
Sort(Comparison<T>)
 Sorts the elements in the entire list using the specified comparer.
Sort(Double[])
 Sort this list based on a list of numeric keys of equal length. The keys array will not be altered.
Sort(Int32[])
 Sort this list based on a list of numeric keys of equal length. The keys array will not be altered.
Sort(Int32, Int32, IComparer<T>)
 Sorts the elements in a range of elements in list using the specified comparer.
ToArray
 Constructs an array that contains all items in this list.
TrimExcess
 Sets the capacity to the actual number of elements in the List, if that number is less than a threshold value.
TrueForAll
 Determines whether every element in the List matches the conditions defined by the specified predicate.
Top
See Also
Reference
Rhino.Collections Namespace