RhinoCommon SDK
ShowPanelEventArgs Properties
Rhino for Mac 5.1
The ShowPanelEventArgs type exposes the following members.
Properties
Name | Description
PanelId
 Class Id for panel being shown or hidden
Show
 Will be true if showing or false if hiding
Top
See Also
Reference
ShowPanelEventArgs Class
Rhino.UI Namespace