RhinoCommon SDK
NurbsSurfacePointList Methods
Rhino for Mac 5.1
The NurbsSurfacePointList type exposes the following members.
Methods
Name | Description
EnsurePrivateCopy
 If you want to keep a copy of this class around by holding onto it in a variable after a command completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can call this function as many times as you want.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
GetControlPoint
 Gets the control point at the given (u, v) index.
GetGrevillePoint
 Gets the Greville point (u, v) coordinates associated with the control point at the given indices.
SetControlPoint(Int32, Int32, ControlPoint)
 Sets the control point at the given (u, v) index.
SetControlPoint(Int32, Int32, Point3d)
 Sets the control point at the given (u, v) index.
Top
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace