RhinoCommon SDK
Surface.Reverse Method (Int32)
Rhino for Mac 5.1
 Reverses parameterization Domain changes from [a,b] to [-b,-a]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface Reverse(
	int direction
)
Public Function Reverse (
	direction As Integer
) As Surface
Parameters
direction
Type: System.Int32
 0 for first parameter's domain, 1 for second parameter's domain.
Return Value
Type: Surface
a new reversed surface on success.
See Also
Reference
Surface Class
Reverse Overload
Rhino.Geometry Namespace