RhinoCommon SDK
ObjectAttributes.PlotColor Property
Rhino for Mac 5.1
 If plot_color_from_object == PlotColorSource, then PlotColor is the object's plotting color.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color PlotColor { get; set; }
Public Property PlotColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace