RhinoCommon SDK
ObjectTable.AddLine Method (Point3d, Point3d, ObjectAttributes)
Rhino for Mac 5.1
Adds a line object to Rhino.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddLine(
	Point3d from,
	Point3d to,
	ObjectAttributes attributes
)
Public Function AddLine (
	from As Point3d,
	to As Point3d,
	attributes As ObjectAttributes
) As Guid
Parameters
from
Type: Rhino.Geometry.Point3d
The line origin.
to
Type: Rhino.Geometry.Point3d
The line end.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to line.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddLine Overload
Rhino.DocObjects.Tables Namespace