RhinoCommon SDK
ObjectTable.AddLine Method (Line, ObjectAttributes)
Rhino for Mac 5.1
Adds a line object to Rhino.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddLine(
	Line line,
	ObjectAttributes attributes
)
Public Function AddLine (
	line As Line,
	attributes As ObjectAttributes
) As Guid
Parameters
line
Type: Rhino.Geometry.Line
The line value.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to line.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddLine Overload
Rhino.DocObjects.Tables Namespace