RhinoCommon SDK
ObjectAttributes.RemoveDisplayModeOverride Method
Rhino for Mac 5.1
 By default, objects are drawn using the display mode of the viewport that the object is being drawn in. Setting a specific display mode, instructs Rhino to always use that display mode, regardless of the viewport's mode. This function resets an object to use the viewport's display mode for all viewports.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void RemoveDisplayModeOverride()
Public Sub RemoveDisplayModeOverride
See Also
Reference
ObjectAttributes Class
RemoveDisplayModeOverride Overload
Rhino.DocObjects Namespace