RhinoCommon SDK
ZBufferCapture.ZValueAt Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ZValueAt(System.Int32,System.Int32)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public float ZValueAt(
	int x,
	int y
)
Public Function ZValueAt (
	x As Integer,
	y As Integer
) As Single
Parameters
x
Type: System.Int32
[Missing <param name="x"/> documentation for "M:Rhino.Display.ZBufferCapture.ZValueAt(System.Int32,System.Int32)"]
y
Type: System.Int32
[Missing <param name="y"/> documentation for "M:Rhino.Display.ZBufferCapture.ZValueAt(System.Int32,System.Int32)"]
Return Value
Type: Single
[Missing <returns> documentation for "M:Rhino.Display.ZBufferCapture.ZValueAt(System.Int32,System.Int32)"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace