RhinoCommon SDK
LOC.STR Method (String, Object)
Rhino for Mac 5.1
 Similar to Format(String, Object) function.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string STR(
	string english,
	Object assemblyOrObject
)
Public Shared Function STR (
	english As String,
	assemblyOrObject As Object
) As String
Parameters
english
Type: System.String
The English name.
assemblyOrObject
Type: System.Object
Unused.
Return Value
Type: String
English name.
See Also
Reference
LOC Class
STR Overload
Rhino.UI Namespace