RhinoCommon SDK
Vector2d.Y Property
Rhino for Mac 5.1
 Gets or sets the Y (second) component of this vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Y { get; set; }
Public Property Y As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace