RhinoCommon SDK
Unroller.AddFollowingGeometry Method (TextDot)
Rhino for Mac 5.1
 Adds a text dot that should be unrolled along with the surface/brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddFollowingGeometry(
	TextDot dot
)
Public Sub AddFollowingGeometry (
	dot As TextDot
)
Parameters
dot
Type: Rhino.Geometry.TextDot
A text dot.
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace