RhinoCommon SDK
FileWriteOptions Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.FileIO.FileWriteOptions"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileWriteOptions
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class FileWriteOptions : IDisposable
Public Class FileWriteOptions
	Implements IDisposable
The FileWriteOptions type exposes the following members.
Constructors
Name | Description
FileWriteOptions
Initializes a new instance of the FileWriteOptions class
Top
Properties
Name | Description
ApplyTransform
FileVersion
IncludeBitmapTable
IncludeHistory
IncludePreviewImage
IncludeRenderMeshes
SuppressDialogBoxes
WriteAsTemplate
WriteGeometryOnly
WriteSelectedObjectsOnly
WriteUserData
Xform
Top
Methods
Name | Description
Dispose()
Releases all resources used by the FileWriteOptions
Dispose(Boolean)
Releases the unmanaged resources used by the FileWriteOptions and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.FileIO Namespace