RhinoCommon SDK
CustomDisplay.AddText Method (String, Plane, Double)
Rhino for Mac 5.1
 Adds a new, black 3D text object to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddText(
	string text,
	Plane plane,
	double size
)
Public Sub AddText (
	text As String,
	plane As Plane,
	size As Double
)
Parameters
text
Type: System.String
Text to add.
plane
Type: Rhino.Geometry.Plane
Plane for text orientation.
size
Type: System.Double
Height (in units) of font.
See Also
Reference
CustomDisplay Class
AddText Overload
Rhino.Display Namespace