RhinoCommon SDK
RhinoDoc.SetCustomMeshingParameters Method
Rhino for Mac 5.1
 Set the custom meshing parameters that this document will use. You must also modify the MeshingParameterStyle property on the document to Custom if you want these meshing parameters to be used
Namespace: Rhino
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetCustomMeshingParameters(
	MeshingParameters mp
)
Public Sub SetCustomMeshingParameters (
	mp As MeshingParameters
)
Parameters
mp
Type: Rhino.Geometry.MeshingParameters
[Missing <param name="mp"/> documentation for "M:Rhino.RhinoDoc.SetCustomMeshingParameters(Rhino.Geometry.MeshingParameters)"]
See Also
Reference
RhinoDoc Class
Rhino Namespace