RhinoCommon SDK
LinetypeTable.CurrentLinetypeIndex Property
Rhino for Mac 5.1
 At all times, there is a "current" linetype. Unless otherwise specified, new objects are assigned to the current linetype. If the current linetype source is LinetypeFromLayer the object's layer's linetype is used instead.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int CurrentLinetypeIndex { get; }
Public ReadOnly Property CurrentLinetypeIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace