RhinoCommon SDK
GetLine.GetLineMode Property
Rhino for Mac 5.1
 Mode used
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GetLineMode GetLineMode { get; set; }
Public Property GetLineMode As GetLineMode
	Get
	Set
Property Value
Type: GetLineMode
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace