RhinoCommon SDK
IPanelsService.OpenPanel Method
Rhino for Mac 5.1
Overload List
Name | Description
OpenPanel(Guid)
OpenPanel(Guid, Guid)
Top
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace