RhinoCommon SDK
DisplayBitmapDrawList Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.DisplayBitmapDrawList"]
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayBitmapDrawList
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class DisplayBitmapDrawList
Public Class DisplayBitmapDrawList
The DisplayBitmapDrawList type exposes the following members.
Constructors
Name | Description
DisplayBitmapDrawList
Initializes a new instance of the DisplayBitmapDrawList class
Top
Properties
Name | Description
BoundingBox
MaximumCachedSortLists
 Maximum number of cached sort order index lists stored on this class. Default is 10, but depending on the number of points in this list you may get better performance by setting this value to a certain percentage of the point count.
SortAngleTolerance
 Angle in radians used to determine if an index list is "parallel enough" to a viewports camera angle. Default is 0.0873 radians (5 degrees)
Top
Methods
Name | Description
SetPoints(IEnumerable<Point3d>)
SetPoints(IEnumerable<Point3d>, IEnumerable<Color>)
SetPoints(IEnumerable<Point3d>, Color)
Sort
Top
See Also
Reference
Rhino.Display Namespace