RhinoCommon SDK
ComponentIndexType Enumeration
Rhino for Mac 5.1
 Defines enumerated values to represent component index types.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum ComponentIndexType
Public Enumeration ComponentIndexType
Members
Member name | Value | Description
InvalidType | 0 |  Not used. This is the default value of the enumeration type.
BrepVertex | 1 |  Targets a brep vertex index.
BrepEdge | 2 |  Targets a brep edge index.
BrepFace | 3 |  Targets a brep face index.
BrepTrim | 4 |  Targets a brep trim index.
BrepLoop | 5 |  Targets a brep loop index.
MeshVertex | 11 |  Targets a mesh vertex index.
MeshTopologyVertex | 12 |  Targets a mesh topology vertex index.
MeshTopologyEdge | 13 |  Targets a mesh topology edge index.
MeshFace | 14 |  Targets a mesh face index.
InstanceDefinitionPart | 21 |  Targets an instance definition part index.
PolycurveSegment | 31 |  Targets a polycurve segment index.
PointCloudPoint | 41 |  Targets a pointcloud point index.
GroupMember | 51 |  Targets a group member index.
DimLinearPoint | 100 |  Targets a linear dimension point index.
DimRadialPoint | 101 |  Targets a radial dimension point index.
DimAngularPoint | 102 |  Targets an angular dimension point index.
DimOrdinatePoint | 103 |  Targets an ordinate dimension point index.
DimTextPoint | 104 |  Targets a text point index.
NoType | 268435455 |  Targets no specific type.
See Also
Reference
Rhino.Geometry Namespace