RhinoCommon SDK
Extrusion Class
Rhino for Mac 5.1
 Represents an extrusion, or objects such as beams or linearly extruded elements, that can be represented by profile curves and two miter planes at the extremes.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.Extrusion
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class Extrusion : Surface
<SerializableAttribute>
Public Class Extrusion
	Inherits Surface
The Extrusion type exposes the following members.
Constructors
Name | Description
Extrusion()
 Initializes a new instance of the Extrusion class.
Extrusion(SerializationInfo, StreamingContext)
 Protected serialization constructor.
Top
Properties
Name | Description
CapCount
 Gets the amount of capping surfaces.
IsCappedAtBottom
 Gets a value indicating whether the surface that fills the bottom profile is existing.
IsCappedAtTop
 Gets a value indicating whether the surface that fills the top profile is existing.
IsMiteredAtEnd
 Gets a value indicating whether a miter plane at the end is defined.
IsMiteredAtStart
 Returns a value indicating whether a miter plane at start is defined.
IsSolid
 Gets a value indicating whether there is no gap among all surfaces constructing this object.
 (Overrides Surface.IsSolid.)
MiterPlaneNormalAtEnd
 Gets or sets the normal of the miter plane at the end in profile coordinates. In profile coordinates, 0,0,1 always maps to the extrusion axis
MiterPlaneNormalAtStart
 Gets or sets the normal of the miter plane at the start in profile coordinates. In profile coordinates, 0,0,1 always maps to the extrusion axis
PathEnd
 Gets the end point of the path.
PathStart
 Gets the start point of the path.
PathTangent
 Gets the up vector of the path.
ProfileCount
 Gets the amount of profile curves.
Top
Methods
Name | Description
AddInnerProfile
 Adds an inner profile.
Create
 Creates an extrusion of a 3d curve (which must be planar) and a height.
CreateCylinderExtrusion
 Gets an extrusion form of a cylinder.
CreatePipeExtrusion
 Gets an extrusion form of a pipe.
GetMesh
 Obtains a reference to a specified type of mesh for this extrusion.
GetPathPlane
 Gets the 3D plane perpendicular to the path at a normalized path parameter.
GetProfilePlane
 Gets the 3D plane containing the profile curve at a normalized path parameter.
GetProfileTransformation
 Gets the transformation that maps the xy profile curve to its 3d location.
GetWireframe
 Constructs all the Wireframe curves for this Extrusion.
PathLineCurve
 Gets the line-like curve that is the conceptual axis of the extrusion.
Profile3d(ComponentIndex)
 Gets one of the profiles.
Profile3d(Int32, Double)
 Gets a transversal isocurve of the extruded profile.
ProfileIndex
 Gets the index of the profile curve at a domain related to a parameter.
SetOuterProfile
 Sets the outer profile of the extrusion.
SetPathAndUp
 Allows to set the two points at the extremes and the up vector.
ToBrep(Boolean)
 Constructs a brep form of the extrusion. The outer profile is always the first face of the brep. If there are inner profiles, additional brep faces are created for each profile. If the outer profile is closed, then end caps are added as the last two faces of the brep.
WallEdge
 Gets one of the longitudinal curves along the beam or extrusion.
WallSurface
 Gets one of the longitudinal surfaces of the extrusion.
Top
See Also
Reference
Rhino.Geometry Namespace