RhinoCommon SDK
BitmapEntry Methods
Rhino for Mac 5.1
The BitmapEntry type exposes the following members.
Methods
Name | Description
Save
Top
See Also
Reference
BitmapEntry Class
Rhino.DocObjects Namespace