RhinoCommon SDK
ControlPoint Constructor (Point3d)
Rhino for Mac 5.1
 Constructs a new unweighted control point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ControlPoint(
	Point3d pt
)
Public Sub New (
	pt As Point3d
)
Parameters
pt
Type: Rhino.Geometry.Point3d
Coordinate of Control Point.
See Also
Reference
ControlPoint Structure
ControlPoint Overload
Rhino.Geometry Namespace