RhinoCommon SDK
MeshFaceList.GetEnumerator Method
Rhino for Mac 5.1
 Gets an enumerator that yields all faces in this collection.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<MeshFace> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of MeshFace)
Return Value
Type: IEnumerator<MeshFace>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace