RhinoCommon SDK
DisplayPipeline.DrawMeshVertices Method
Rhino for Mac 5.1
 Draws all the vertices in a given mesh.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawMeshVertices(
	Mesh mesh,
	Color color
)
Public Sub DrawMeshVertices (
	mesh As Mesh,
	color As Color
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh for vertex drawing.
color
Type: System.Drawing.Color
Color of mesh vertices.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace