RhinoCommon SDK
ObjectTable.Find Method (UInt32)
Rhino for Mac 5.1
 Use the object runtime serial number to find a rhino object in the document. This is the value stored on RhinoObject.RuntimeObjectSerialNumber. The RhinoObject constructor sets the runtime serial number and every instance of a RhinoObject class will have a unique serial number for the duration of the Rhino application. If an object is replaced with a new object, then the new object will have a different runtime serial number. Deleted objects stored in the undo list maintain their runtime serial numbers and this funtion will return pointers to these objects. Call RhinoObject.IsDeleted if you need to determine if the returned object is active or deleted. The runtime serial number is not saved in files.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject Find(
	uint runtimeSerialNumber
)
Public Function Find (
	runtimeSerialNumber As UInteger
) As RhinoObject
Parameters
runtimeSerialNumber
Type: System.UInt32
Runtime serial number to search for.
Return Value
Type: RhinoObject
Reference to the rhino object with the objectId or null if no such object could be found.
See Also
Reference
ObjectTable Class
Find Overload
Rhino.DocObjects.Tables Namespace