RhinoCommon SDK
NurbsSurfaceKnotList Properties
Rhino for Mac 5.1
The NurbsSurfaceKnotList type exposes the following members.
Properties
Name | Description
ClampedAtEnd
Determines if a knot vector is clamped.
ClampedAtStart
Determines if a knot vector is clamped.
Count
Gets the total number of knots in this curve.
Item
 Gets or sets the knot vector value at the given index.
Top
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace