RhinoCommon SDK
Point2d.Add Method (Point2d, Point2d)
Rhino for Mac 5.1
 Adds a point with a point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point2d Add(
	Point2d point1,
	Point2d point2
)
Public Shared Function Add (
	point1 As Point2d,
	point2 As Point2d
) As Point2d
Parameters
point1
Type: Rhino.Geometry.Point2d
A point.
point2
Type: Rhino.Geometry.Point2d
A point.
Return Value
Type: Point2d
A new point that is coordinatewise summed with the other point.
See Also
Reference
Point2d Structure
Add Overload
Rhino.Geometry Namespace