RhinoCommon SDK
MappingTag Properties
Rhino for Mac 5.1
The MappingTag type exposes the following members.
Properties
Name | Description
Id
 Gets or sets a map globally unique identifier.
MappingCRC
 Gets or sets the cyclic redundancy check on the mapping. See also CRC32(UInt32, Byte[]).
MappingType
 Gets or sets a texture mapping type: linear, cylinder, etc...
MeshTransform
 Gets or sets a 4x4 matrix tranform.
Top
See Also
Reference
MappingTag Class
Rhino.Render Namespace