RhinoCommon SDK
Vector3d.Equals Method (Vector3d)
Rhino for Mac 5.1
 Determines whether the specified vector has the same value as the present vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Equals(
	Vector3d vector
)
Public Function Equals (
	vector As Vector3d
) As Boolean
Parameters
vector
Type: Rhino.Geometry.Vector3d
The specified vector.
Return Value
Type: Boolean
true if vector has the same coordinates as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Vector3d Structure
Equals Overload
Rhino.Geometry Namespace