RhinoCommon SDK
ObjectAttributes.ObjectId Property
Rhino for Mac 5.1
 Every object has a Guid (globally unique identifier, also known as UUID, or universally unique identifier). The default value is Guid.Empty.
 When an object is added to a model, the value is checked. If the value is Guid.Empty, a new Guid is created. If the value is not null but it is already used by another object in the model, a new Guid is created. If the value is not Guid.Empty and it is not used by another object in the model, then that value persists. When an object is updated, by a move for example, the value of ObjectId persists.
This value is the same as the one returned by object.Id.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid ObjectId { get; set; }
Public Property ObjectId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace