RhinoCommon SDK
Brep.CreateFromSphere Method
Rhino for Mac 5.1
 Constructs a Brep definition of a sphere.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep CreateFromSphere(
	Sphere sphere
)
Public Shared Function CreateFromSphere (
	sphere As Sphere
) As Brep
Parameters
sphere
Type: Rhino.Geometry.Sphere
[Missing <param name="sphere"/> documentation for "M:Rhino.Geometry.Brep.CreateFromSphere(Rhino.Geometry.Sphere)"]
Return Value
Type: Brep
[Missing <returns> documentation for "M:Rhino.Geometry.Brep.CreateFromSphere(Rhino.Geometry.Sphere)"]
See Also
Reference
Brep Class
Rhino.Geometry Namespace