RhinoCommon SDK
Arc.ClosestParameter Method
Rhino for Mac 5.1
 Gets parameter on the arc closest to a test point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ClosestParameter(
	Point3d testPoint
)
Public Function ClosestParameter (
	testPoint As Point3d
) As Double
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to get close to.
Return Value
Type: Double
Parameter (in radians) of the point on the arc that is closest to the test point. If testPoint is the center of the arc, then the starting point of the arc is (arc.Domain()[0]) returned. If no parameter could be found, RhinoMath.UnsetValue is returned.
See Also
Reference
Arc Structure
Rhino.Geometry Namespace