RhinoCommon SDK
Hatch Properties
Rhino for Mac 5.1
The Hatch type exposes the following members.
Properties
Name | Description
PatternIndex
 Gets or sets the index of the pattern in the document hatch pattern table.
PatternRotation
 Gets or sets the relative rotation of the pattern.
PatternScale
 Gets or sets the scaling factor of the pattern.
Top
See Also
Reference
Hatch Class
Rhino.Geometry Namespace