RhinoCommon SDK
PickStyle Enumeration
Rhino for Mac 5.1
 Provides picking values that describe common CAD picking behavior.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum PickStyle
Public Enumeration PickStyle
Members
Member name | Value | Description
None | 0
PointPick | 1
WindowPick | 2
CrossingPick | 3
See Also
Reference
Rhino.Input.Custom Namespace