RhinoCommon SDK
RhinoViewport.SetProjection Method
Rhino for Mac 5.1
 Set viewport to a defined projection.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetProjection(
	DefinedViewportProjection projection,
	string viewName,
	bool updateConstructionPlane
)
Public Function SetProjection (
	projection As DefinedViewportProjection,
	viewName As String,
	updateConstructionPlane As Boolean
) As Boolean
Parameters
projection
Type: Rhino.Display.DefinedViewportProjection
The "standard" projection type.
viewName
Type: System.String
If not null or empty, the name is set.
updateConstructionPlane
Type: System.Boolean
If true, the construction plane is set to the viewport plane.
Return Value
Type: Boolean
true if successful.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace