RhinoCommon SDK
Surface.Pushup Method (Curve, Double)
Rhino for Mac 5.1
 Computes a 3d curve that is the composite of a 2d curve and the surface map.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve Pushup(
	Curve curve2d,
	double tolerance
)
Public Function Pushup (
	curve2d As Curve,
	tolerance As Double
) As Curve
Parameters
curve2d
Type: Rhino.Geometry.Curve
a 2d curve whose image is in the surface's domain.
tolerance
Type: System.Double
 the maximum acceptable distance from the returned 3d curve to the image of curve_2d on the surface.
Return Value
Type: Curve
3d curve.
See Also
Reference
Surface Class
Pushup Overload
Rhino.Geometry Namespace