RhinoCommon SDK
File3dm.Audit Method
Rhino for Mac 5.1
 Check a model to make sure it is valid and, if possible and requested, attempt to repair.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Audit(
	bool attemptRepair,
	out int repairCount,
	out string errors,
	out int[] warnings
)
Public Function Audit (
	attemptRepair As Boolean,
	<OutAttribute> ByRef repairCount As Integer,
	<OutAttribute> ByRef errors As String,
	<OutAttribute> ByRef warnings As Integer()
) As Integer
Parameters
attemptRepair
Type: System.Boolean
 if true and a problem is found, the problem is repaired.
repairCount
Type: System.Int32
number of successful repairs.
errors
Type: System.String
 if errors are found, a description of the problem is put in this.
warnings
Type: System.Int32[]
 If problems were found, warning ids are appended to this list. 1 (MaterialTable flaws), 2 (LayerTable is not perfect), 3 (some ObjectTable.Attributes.Id was nil or not unique), 4 (ObjectTable.IsValid() is false), 5 (some IDefTable entry has an invalid or duplicate name), 6 (some IDefTable.ObjectId is not valid), 7 (some ObjectTable.Geometry is null), 8 (some ObjectTable.Geometry.IsValid is false), 9 (some ObjectTable.Attributes is not valid), 10 (LinetypeTable is not perfect), 11 (LinetypeTable is not perfect), 12 (some IDefTable.Id was Empty or not unique), 13 (some TextureMappingTable.MappingId was Empty or not unique), 14 (some MaterialTable.Id was Empty or not unique), 15 (some LightTable.LightId was Empty or not unique)
Return Value
Type: Int32
 <0 (model has serious errors), 0 (model is ok), >0 (number of problems that were found)
See Also
Reference
File3dm Class
Rhino.FileIO Namespace