RhinoCommon SDK
MouseCursor Class
Rhino for Mac 5.1
 Contains static methods to control the mouse icon.
Inheritance Hierarchy
System.Object
 Rhino.UI.MouseCursor
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static class MouseCursor
Public NotInheritable Class MouseCursor
The MouseCursor type exposes the following members.
Properties
Name | Description
Location
 Retrieves the position of the mouse cursor, in screen coordinates
Top
Methods
Name | Description
SetToolTip
 Sets a cursor tooltip string shown next to the mouse cursor. Overrides all cursor tooltip panes.
Top
See Also
Reference
Rhino.UI Namespace