RhinoCommon SDK
Quaternion.Zero Property
Rhino for Mac 5.1
 Returns the dafault quaternion, where all coefficients are 0.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Quaternion Zero { get; }
Public Shared ReadOnly Property Zero As Quaternion
	Get
Property Value
Type: Quaternion
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace