RhinoCommon SDK
DrawEventArgs.Display Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DrawEventArgs.Display"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DisplayPipeline Display { get; }
Public ReadOnly Property Display As DisplayPipeline
	Get
Property Value
Type: DisplayPipeline
See Also
Reference
DrawEventArgs Class
Rhino.Display Namespace