RhinoCommon SDK
VisualAnalysisMode.Find Method
Rhino for Mac 5.1
Overload List
Name | Description
Find(Guid)
 Finds a visual analysis mode by guid.
Find(Type)
 Finds a visual analysis mode by type.
Top
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace