RhinoCommon SDK
RhinoGet.GetOneObject Method (String, Boolean, GetObjectGeometryFilter, ObjRef)
Rhino for Mac 5.1
Easy to use object getter.
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetOneObject(
	string prompt,
	bool acceptNothing,
	GetObjectGeometryFilter filter,
	out ObjRef objref
)
Public Shared Function GetOneObject (
	prompt As String,
	acceptNothing As Boolean,
	filter As GetObjectGeometryFilter,
	<OutAttribute> ByRef objref As ObjRef
) As Result
Parameters
prompt
Type: System.String
command prompt.
acceptNothing
Type: System.Boolean
if true, the user can press enter.
filter
Type: Rhino.Input.Custom.GetObjectGeometryFilter
geometry filter to use when getting objects.
objref
Type: Rhino.DocObjects.ObjRef
result of the get. may be null.
Return Value
Type: Result
 Commands.Result.Success - got object Commands.Result.Nothing - user pressed enter Commands.Result.Cancel - user cancel object getting.
Remarks
 If you need options or more advanced user interface, then use GetObject class.
See Also
Reference
RhinoGet Class
GetOneObject Overload
Rhino.Input Namespace