RhinoCommon SDK
Surface.TryGetTorus Method (Torus)
Rhino for Mac 5.1
Tests a surface to see if it is a portion of a torus within RhinoMath.ZeroTolerance and returns the torus.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetTorus(
	out Torus torus
)
Public Function TryGetTorus (
	<OutAttribute> ByRef torus As Torus
) As Boolean
Parameters
torus
Type: Rhino.Geometry.Torus
On success, the torus parameters are filled in.
Return Value
Type: Boolean
true if the surface is a portion of a torus.
See Also
Reference
Surface Class
TryGetTorus Overload
Rhino.Geometry Namespace