RhinoCommon SDK
RhinoObject.Select Method
Rhino for Mac 5.1
Overload List
Name | Description
Select(Boolean)
Selects an object.
Select(Boolean, Boolean)
Selects an object.
Select(Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
Selects an object.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace