RhinoCommon SDK
GetLine.Dispose Method
Rhino for Mac 5.1
 Actively reclaims unmanaged resources that this instance uses.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
GetLine Class
Dispose Overload
Rhino.Input.Custom Namespace