RhinoCommon SDK
MeshVertexList.AddVertices Method (IEnumerable<Point3f>)
Rhino for Mac 5.1
 Adds a series of new vertices to the end of the vertex list.
This overload accepts single-precision points.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddVertices(
	IEnumerable<Point3f> vertices
)
Public Sub AddVertices (
	vertices As IEnumerable(Of Point3f)
)
Parameters
vertices
Type: System.Collections.Generic.IEnumerable<Point3f>
A list, an array or any enumerable set of Point3f.
See Also
Reference
MeshVertexList Class
AddVertices Overload
Rhino.Geometry.Collections Namespace