RhinoCommon SDK
SweepOneRail.PerformSweepRebuild Method (Curve, IEnumerable<Curve>, IEnumerable<Double>, Int32)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Int32)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] PerformSweepRebuild(
	Curve rail,
	IEnumerable<Curve> crossSections,
	IEnumerable<double> crossSectionParameters,
	int rebuildCount
)
Public Function PerformSweepRebuild (
	rail As Curve,
	crossSections As IEnumerable(Of Curve),
	crossSectionParameters As IEnumerable(Of Double),
	rebuildCount As Integer
) As Brep()
Parameters
rail
Type: Rhino.Geometry.Curve
[Missing <param name="rail"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Int32)"]
crossSections
Type: System.Collections.Generic.IEnumerable<Curve>
[Missing <param name="crossSections"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Int32)"]
crossSectionParameters
Type: System.Collections.Generic.IEnumerable<Double>
[Missing <param name="crossSectionParameters"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Int32)"]
rebuildCount
Type: System.Int32
[Missing <param name="rebuildCount"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Int32)"]
Return Value
Type: Brep[]
[Missing <returns> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Int32)"]
See Also
Reference
SweepOneRail Class
PerformSweepRebuild Overload
Rhino.Geometry Namespace