RhinoCommon SDK
InstanceDefinitionGeometry Methods
Rhino for Mac 5.1
The InstanceDefinitionGeometry type exposes the following members.
Methods
Name | Description
GetObjectIds
 list of object ids in the instance geometry table
Top
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace