RhinoCommon SDK
Material.IndexOfRefraction Property
Rhino for Mac 5.1
 Gets or sets the index of refraction of the material, generally >= 1.0 (speed of light in vacuum)/(speed of light in material)
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double IndexOfRefraction { get; set; }
Public Property IndexOfRefraction As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Material Class
Rhino.DocObjects Namespace