RhinoCommon SDK
Curve.CreateInterpolatedCurve Method (IEnumerable<Point3d>, Int32, CurveKnotStyle, Vector3d, Vector3d)
Rhino for Mac 5.1
 Interpolates a sequence of points. Used by InterpCurve Command This routine works best when degree=3.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve CreateInterpolatedCurve(
	IEnumerable<Point3d> points,
	int degree,
	CurveKnotStyle knots,
	Vector3d startTangent,
	Vector3d endTangent
)
Public Shared Function CreateInterpolatedCurve (
	points As IEnumerable(Of Point3d),
	degree As Integer,
	knots As CurveKnotStyle,
	startTangent As Vector3d,
	endTangent As Vector3d
) As Curve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
 Points to interpolate. For periodic curves if the final point is a duplicate of the initial point it is ignored. (Count must be >=2)
degree
Type: System.Int32
The degree of the curve >=1. Degree must be odd.
knots
Type: Rhino.Geometry.CurveKnotStyle
 Knot-style to use and specifies if the curve should be periodic.
startTangent
Type: Rhino.Geometry.Vector3d
A starting tangent.
endTangent
Type: Rhino.Geometry.Vector3d
An ending tangent.
Return Value
Type: Curve
interpolated curve on success. null on failure.
See Also
Reference
Curve Class
CreateInterpolatedCurve Overload
Rhino.Geometry Namespace