RhinoCommon SDK
DisplayPipeline.DrawCone Method (Cone, Color, Int32)
Rhino for Mac 5.1
 Draw a wireframe cone.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawCone(
	Cone cone,
	Color color,
	int thickness
)
Public Sub DrawCone (
	cone As Cone,
	color As Color,
	thickness As Integer
)
Parameters
cone
Type: Rhino.Geometry.Cone
Cone to draw.
color
Type: System.Drawing.Color
Color to draw with.
thickness
Type: System.Int32
Thickness (in pixels) of Cone wires.
See Also
Reference
DisplayPipeline Class
DrawCone Overload
Rhino.Display Namespace