RhinoCommon SDK
UnknownUserData Constructor
Rhino for Mac 5.1
 Constructs a new unknown data entity.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public UnknownUserData(
	IntPtr pointerNativeUserData
)
Public Sub New (
	pointerNativeUserData As IntPtr
)
Parameters
pointerNativeUserData
Type: System.IntPtr
A pointer to the entity.
See Also
Reference
UnknownUserData Class
Rhino.DocObjects.Custom Namespace