RhinoCommon SDK
BitmapEntry Class
Rhino for Mac 5.1
 Rhino.DocObjects.Tables.BitmapTable entry
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.BitmapEntry
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class BitmapEntry : CommonObject
<SerializableAttribute>
Public Class BitmapEntry
	Inherits CommonObject
The BitmapEntry type exposes the following members.
Constructors
Name | Description
BitmapEntry
 serialization constructor
Top
Properties
Name | Description
FileName
The name of this bitmap.
IsReference
 Gets a value indicting whether this bitmap is a referenced bitmap. Referenced bitmaps are part of referenced documents.
Top
Methods
Name | Description
Save
Top
See Also
Reference
Rhino.DocObjects Namespace