RhinoCommon SDK
BrepLoopList.AddOuterLoop Method
Rhino for Mac 5.1
 Create a new outer boundary loop that runs along the sides of the face's surface. All the necessary trims, edges, and vertices are created and added to the brep.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepLoop AddOuterLoop(
	int faceIndex
)
Public Function AddOuterLoop (
	faceIndex As Integer
) As BrepLoop
Parameters
faceIndex
Type: System.Int32
 index of face that needs an outer boundary that runs along the sides of its surface.
Return Value
Type: BrepLoop
New outer boundary loop that is complete.
See Also
Reference
BrepLoopList Class
Rhino.Geometry.Collections Namespace