RhinoCommon SDK
Surface.IsPlanar Method
Rhino for Mac 5.1
Overload List
Name | Description
IsPlanar()
 Tests a surface to see if it is planar to zero tolerance.
IsPlanar(Double)
 Tests a surface to see if it is planar to a given tolerance.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace