RhinoCommon SDK
MeshTextureCoordinateList.SetTextureCoordinate Method (Int32, Point2f)
Rhino for Mac 5.1
 Sets or adds a texture coordinate to the Texture Coordinate List.
If [index] is less than [Count], the existing coordinate at [index] will be modified.
If [index] equals [Count], a new coordinate is appended to the end of the coordinate list.
If [index] is larger than [Count], the function will return false.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetTextureCoordinate(
	int index,
	Point2f tc
)
Public Function SetTextureCoordinate (
	index As Integer,
	tc As Point2f
) As Boolean
Parameters
index
Type: System.Int32
Index of texture coordinate to set.
tc
Type: Rhino.Geometry.Point2f
Texture coordinate point.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshTextureCoordinateList Class
SetTextureCoordinate Overload
Rhino.Geometry.Collections Namespace