RhinoCommon SDK
RhinoApp Class
Rhino for Mac 5.1
.NET RhinoApp is parallel to C++ CRhinoApp.
Inheritance Hierarchy
System.Object
 Rhino.RhinoApp
Namespace: Rhino
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static class RhinoApp
Public NotInheritable Class RhinoApp
The RhinoApp type exposes the following members.
Properties
Name | Description
BuildDate
 Gets the build date.
CommandHistoryWindowText
 Text in Rhino's command history window.
CommandPrompt
Rhino command prompt.
CurrentRhinoId
Gets the current ID of Rhino.
DaysUntilExpiration
 Returns number of days until license expires. Zero when license is expired. Raises InvalidLicenseTypeException if LicenseExpires would return false.
ExeServiceRelease
 Service release version of Rhino executable (0, 1, 2, ...) The integer is the service release number of Rhino. For example, this function returns "0" if Rhino V4SR0 is running and returns "1" if Rhino V4SR1 is running.
ExeVersion
 Major version of Rhino executable 4, 5, ...
InstallationType
Gets the product installation type, as seen in Rhino's ABOUT dialog box.
InvokeRequired
 Returns true if we are currently not running on the main user interface thread
IsLicenseValidated
 Returns true if the license is validated false otherwise
IsRunningAutomated
Is Rhino currently being executed through automation
LicenseExpires
 Returns true if the license will expire false otherwise
LicenseSavesLeft
 Returns number of saves left in save-limited Evaluation. Zero when evaluation is expired. Raises InvalidLicenseTypeException if LicenseType != EvaluationSaveLimited
Name
Gets the application name.
NodeType
Gets license the node type.
Rhino2Id
Gets the ID of Rhino 2.
Rhino3Id
Gets the ID of Rhino 3.
Rhino4Id
Gets the ID of Rhino 4.
Rhino5Id
Gets the ID of Rhino 5.
SdkServiceRelease
 Rhino SDK 9 digit SDK service release number in the form YYYYMMDDn Service service release of the Rhino SDK supported by this executable. Rhino will only load plug-ins that require a service release of <= this release number. For example, SR1 will load all plug-ins made with any SDK released up through and including the SR1 SDK. But, SR1 will not load a plug-in built using the SR2 SDK. If an "old" Rhino tries to load a "new" plug-in, the user is told that they have to get a free Rhino.exe update in order for the plug-in to load. Rhino.exe updates are available from http://www.rhino3d.com.
SdkVersion
 Rhino SDK 9 digit SDK version number in the form YYYYMMDDn Rhino will only load plug-ins that were build with exactly the same version of the SDK.
SerialNumber
Gets the product serial number, as seen in Rhino's ABOUT dialog box.
ToolbarFiles
 Collection of currently open toolbar files in the application
ValidationGracePeriodDaysLeft
 Returns number of days within which validation must occur. Zero when validation grace period has expired. Raises InvalidLicenseTypeException if LicenseType is one of: EvaluationSaveLimited EvaluationTimeLimited Viewer Unknown
Version
 File version of the main Rhino process
VersionControlRevision
 McNeel version control revision identifier at the time this version of Rhino was built.
Top
Methods
Name | Description
AskUserForRhinoLicense
 Display UI asking the user to enter a license for Rhino or use one from the Zoo.
ClearCommandHistoryWindow
 Clear the text in Rhino's command history window.
ExecuteCommand
 Execute a Rhino command.
Exit
Exits, or closes, Rhino.
GetDataDirectory(Boolean, Boolean)
 Gets the data directory.
GetDataDirectory(Boolean, Boolean, String)
 Gets the data directory.
GetPlugInObject(Guid)
 Gets the object that is returned by PlugIn.GetPlugInObject for a given plug-in. This function attempts to find and load a plug-in with a given Id. When a plug-in is found, it's GetPlugInObject function is called and the result is returned here. Note the plug-in must have already been installed in Rhino or the plug-in manager will not know where to look for a plug-in with a matching id.
GetPlugInObject(String)
 Gets the object that is returned by PlugIn.GetPlugInObject for a given plug-in. This function attempts to find and load a plug-in with a given name. When a plug-in is found, it's GetPlugInObject function is called and the result is returned here. Note the plug-in must have already been installed in Rhino or the plug-in manager will not know where to look for a plug-in with a matching name.
InvokeOnUiThread
IsInstallationBeta
 If licenseType is a beta license, returns true. A beta license grants full use of the product during the pre-release development period.
IsInstallationCommercial
 If licenseType is a commercial license, returns true. A commercial license grants full use of the product.
IsInstallationEvaluation
 If licenseType is an evaluation license, returns true. An evaluation license limits the ability of Rhino to save based on either the number of saves or a fixed period of time.
MainWindowHandle
 Gets the WindowHandle of the Rhino main window.
ReleaseMouseCapture
Releases the mouse capture.
RunScript(String, Boolean)
Runs a Rhino command script.
RunScript(String, String, Boolean)
Runs a Rhino command script.
SendKeystrokes
Sends a string of printable characters, including spaces, to Rhino's command line.
SetCommandPrompt(String)
Set Rhino command prompt.
SetCommandPrompt(String, String)
Sets the command prompt in Rhino.
SetFocusToMainWindow
Sets the focus to the main window.
Wait
 Pauses to keep Windows message pump alive so views will update and windows will repaint.
Write(String)
Print formatted text in the command window.
Write(String, Object)
Print formatted text in the command window.
Write(String, Object, Object)
Print formatted text in the command window.
Write(String, Object, Object, Object)
Print formatted text in the command window.
WriteLine()
Print a newline in the command window.
WriteLine(String)
Print text in the command window.
WriteLine(String, Object)
Print formatted text with a newline in the command window.
WriteLine(String, Object, Object)
Print formatted text with a newline in the command window.
WriteLine(String, Object, Object, Object)
Print formatted text with a newline in the command window.
Top
Events
Name | Description
AppSettingsChanged
 Is raised when settings are changed.
Closing
 Is raised when the application is about to close.
EscapeKeyPressed
 Can add or removed delegates that are raised when the escape key is clicked.
Idle
 Occurs when the application finishes processing and is about to enter the idle state
Initialized
 Is raised when the apllication is fully initialized.
KeyboardEvent
 Can add or removed delegates that are raised by a keyboard event.
Top
See Also
Reference
Rhino Namespace