RhinoCommon SDK
Extrusion.Profile3d Method (Int32, Double)
Rhino for Mac 5.1
 Gets a transversal isocurve of the extruded profile.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve Profile3d(
	int profileIndex,
	double s
)
Public Function Profile3d (
	profileIndex As Integer,
	s As Double
) As Curve
Parameters
profileIndex
Type: System.Int32
 0 <= profileIndex < ProfileCount The outer profile has index 0.
s
Type: System.Double
 0.0 <= s <= 1.0 A relative parameter controling which profile is returned. 0 = bottom profile and 1 = top profile.
Return Value
Type: Curve
The profile.
See Also
Reference
Extrusion Class
Profile3d Overload
Rhino.Geometry Namespace