RhinoCommon SDK
GripObject.NeighborGrip Method
Rhino for Mac 5.1
 Used to get a grip's logical neighbors, like NURBS curve, suface, and cage control point grips.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GripObject NeighborGrip(
	int directionR,
	int directionS,
	int directionT,
	bool wrap
)
Public Function NeighborGrip (
	directionR As Integer,
	directionS As Integer,
	directionT As Integer,
	wrap As Boolean
) As GripObject
Parameters
directionR
Type: System.Int32
 -1 to go back one grip, +1 to move forward one grip. For curves, surfaces and cages, this is the first parameter direction.
directionS
Type: System.Int32
 -1 to go back one grip, +1 to move forward one grip. For surfaces and cages this is the second parameter direction.
directionT
Type: System.Int32
 For cages this is the third parameter direction
wrap
Type: System.Boolean
[Missing <param name="wrap"/> documentation for "M:Rhino.DocObjects.GripObject.NeighborGrip(System.Int32,System.Int32,System.Int32,System.Boolean)"]
Return Value
Type: GripObject
logical neighbor or null if the is no logical neighbor
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace