RhinoCommon SDK
GetBaseClass.ClearDefault Method
Rhino for Mac 5.1
 Clears any defaults set using SetDefaultPoint, SetDefaultNumber, SetDefaultString, or SetCommandPromptDefault.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void ClearDefault()
Public Sub ClearDefault
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace