RhinoCommon SDK
Interop.ToOnCurve Method
Rhino for Mac 5.1
 Constructs a Rhino_DotNet OnCurve that is a copy of a given curve.
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Object ToOnCurve(
	Curve source
)
Public Shared Function ToOnCurve (
	source As Curve
) As Object
Parameters
source
Type: Rhino.Geometry.Curve
A RhinoCommon source curve.
Return Value
Type: Object
 Rhino_DotNet object on success. This will be an independent copy.
See Also
Reference
Interop Class
Rhino.Runtime Namespace