RhinoCommon SDK
ObjectDecoration Enumeration
Rhino for Mac 5.1
 Defines bit mask values to represent object decorations.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[FlagsAttribute]
public enum ObjectDecoration
<FlagsAttribute>
Public Enumeration ObjectDecoration
Members
Member name | Value | Description
None | 0 | There are no object decorations.
StartArrowhead | 8 | Arrow head at start.
EndArrowhead | 16 | Arrow head at end.
BothArrowhead | 24 | Arrow head at start and end.
See Also
Reference
Rhino.DocObjects Namespace