RhinoCommon SDK
Quaternion.MatrixForm Method
Rhino for Mac 5.1
 Returns 4x4 real valued matrix form of the quaternion a b c d -b a -d c -c d a -b -d -c b a which has the same arithmetic properties as the quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform MatrixForm()
Public Function MatrixForm As Transform
Return Value
Type: Transform
A transform value.
Remarks
 Do not confuse this with the rotation defined by the quaternion. This function will only be interesting to math nerds and is not useful in rendering or animation applications.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace