RhinoCommon SDK
ReplayHistoryData.TryGetColor Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetColor(System.Int32,System.Drawing.Color@)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetColor(
	int id,
	out Color value
)
Public Function TryGetColor (
	id As Integer,
	<OutAttribute> ByRef value As Color
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetColor(System.Int32,System.Drawing.Color@)"]
value
Type: System.Drawing.Color
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetColor(System.Int32,System.Drawing.Color@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetColor(System.Int32,System.Drawing.Color@)"]
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace