RhinoCommon SDK
ReplayHistoryResult.UpdateToEllipse Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToEllipse(Rhino.Geometry.Ellipse,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToEllipse(
	Ellipse ellipse,
	ObjectAttributes attributes
)
Public Function UpdateToEllipse (
	ellipse As Ellipse,
	attributes As ObjectAttributes
) As Boolean
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
[Missing <param name="ellipse"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToEllipse(Rhino.Geometry.Ellipse,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToEllipse(Rhino.Geometry.Ellipse,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToEllipse(Rhino.Geometry.Ellipse,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace