RhinoCommon SDK
RhinoObject.GetMeshes Method
Rhino for Mac 5.1
 Get existing meshes used to render and analyze surface and polysrf objects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual Mesh[] GetMeshes(
	MeshType meshType
)
Public Overridable Function GetMeshes (
	meshType As MeshType
) As Mesh()
Parameters
meshType
Type: Rhino.Geometry.MeshType
[Missing <param name="meshType"/> documentation for "M:Rhino.DocObjects.RhinoObject.GetMeshes(Rhino.Geometry.MeshType)"]
Return Value
Type: Mesh[]
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.GetMeshes(Rhino.Geometry.MeshType)"]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace