RhinoCommon SDK
RhinoGet.InGet Method
Rhino for Mac 5.1
 Returns true if the document is current in a "Get" operation.
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool InGet(
	RhinoDoc doc
)
Public Shared Function InGet (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Input.RhinoGet.InGet(Rhino.RhinoDoc)"]
Return Value
Type: Boolean
true if a getter is currently active.
See Also
Reference
RhinoGet Class
Rhino.Input Namespace