RhinoCommon SDK
Mesh.NormalAt Method (MeshPoint)
Rhino for Mac 5.1
 Evaluate a mesh normal at a set of barycentric coordinates.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d NormalAt(
	MeshPoint meshPoint
)
Public Function NormalAt (
	meshPoint As MeshPoint
) As Vector3d
Parameters
meshPoint
Type: Rhino.Geometry.MeshPoint
MeshPoint instance contiaining a valid Face Index and Barycentric coordinates.
Return Value
Type: Vector3d
A Normal vector to the mesh or Vector3d.Unset if the faceIndex is not valid or if the barycentric coordinates could not be evaluated.
See Also
Reference
Mesh Class
NormalAt Overload
Rhino.Geometry Namespace