RhinoCommon SDK
GumballDisplayConduit.SetBaseGumball Method (GumballObject, GumballAppearanceSettings)
Rhino for Mac 5.1
 Contents of the gumball are copied to the base gumball of this class.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetBaseGumball(
	GumballObject gumball,
	GumballAppearanceSettings appearanceSettings
)
Public Sub SetBaseGumball (
	gumball As GumballObject,
	appearanceSettings As GumballAppearanceSettings
)
Parameters
gumball
Type: Rhino.UI.Gumball.GumballObject
The gumball source.
appearanceSettings
Type: Rhino.UI.Gumball.GumballAppearanceSettings
The gumball appearance and behavior settings.
See Also
Reference
GumballDisplayConduit Class
SetBaseGumball Overload
Rhino.UI.Gumball Namespace