RhinoCommon SDK
GripObject.OriginalLocation Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.GripObject.OriginalLocation"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d OriginalLocation { get; }
Public ReadOnly Property OriginalLocation As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace