RhinoCommon SDK
LinetypeTable.UndoModify Method
Rhino for Mac 5.1
 If the linetype has been modified and the modifcation can be undone, then UndoModify() will restore the linetype to its previous state.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UndoModify(
	int index
)
Public Function UndoModify (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
Zero based index of linetype for which to undo changes.
Return Value
Type: Boolean
 true if this linetype had been modified and the modifications were undone.
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace