RhinoCommon SDK
DisplayPipelineAttributes.Dispose Method
Rhino for Mac 5.1
Overload List
Name | Description
Dispose()
Releases all resources used by the DisplayPipelineAttributes
Dispose(Boolean)
Releases the unmanaged resources used by the DisplayPipelineAttributes and optionally releases the managed resources
Top
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace