RhinoCommon SDK
BitmapTable.Find Method
Rhino for Mac 5.1
 This function first attempts to find the file with "name" on the disk. If it does find it, "fileName" is set to the full path of the file and the BitmapEntry returned will be null, even if there was a BitmapEntry with "name" in the bitmap table. If the function cannot find the file on the disk, it searches the bitmap table. If it finds it, the returned BitmapEntry entry will be the entry in the table with that name. Additionally, if "createFile" is true, and an entry is found, the file will be written to the disk and it's full path will be contained in "fileName".
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BitmapEntry Find(
	string name,
	bool createFile,
	out string fileName
)
Public Function Find (
	name As String,
	createFile As Boolean,
	<OutAttribute> ByRef fileName As String
) As BitmapEntry
Parameters
name
Type: System.String
 Name of the file to search for including file extension.
createFile
Type: System.Boolean
 If this is true, and the file is not found on the disk but is found in the BitmapTable, then the BitmapEntry will get saved to the Rhino bitmap file cache and fileName will contain the full path to the cached file.
fileName
Type: System.String
 The full path to the current location of this file or an empty string if the file was not found and/or not extracted successfully.
Return Value
Type: BitmapEntry
 Returns null if "name" was found on the disk. If name was not found on the disk, returns the BitmapEntry with the specified name if it is found in the bitmap table and null if it was not found in the bitmap table.
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace