RhinoCommon SDK
DimStyleTable.CurrentDimensionStyle Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTable.CurrentDimensionStyle"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DimensionStyle CurrentDimensionStyle { get; }
Public ReadOnly Property CurrentDimensionStyle As DimensionStyle
	Get
Property Value
Type: DimensionStyle
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace