RhinoCommon SDK
Texture.Id Property
Rhino for Mac 5.1
 Gets the globally unique identifier of this texture.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
Texture Class
Rhino.DocObjects Namespace