RhinoCommon SDK
PointCloudObject Methods
Rhino for Mac 5.1
The PointCloudObject type exposes the following members.
Methods
Name | Description
DuplicatePointCloudGeometry
Top
See Also
Reference
PointCloudObject Class
Rhino.DocObjects Namespace