RhinoCommon SDK
InstanceReferenceGeometry Class
Rhino for Mac 5.1
 Represents a reference to the geometry in a block definition.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.InstanceReferenceGeometry
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class InstanceReferenceGeometry : GeometryBase
Public Class InstanceReferenceGeometry
	Inherits GeometryBase
The InstanceReferenceGeometry type exposes the following members.
Constructors
Name | Description
InstanceReferenceGeometry
 Constructor used when creating nested instance references.
Top
Properties
Name | Description
ParentIdefId
 The unique id for the parent instance definition of this instance reference.
Xform
Transformation for this reference.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace