RhinoCommon SDK
Command.IsValidCommandName Method
Rhino for Mac 5.1
 Determines if a string is a valid command name.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool IsValidCommandName(
	string name
)
Public Shared Function IsValidCommandName (
	name As String
) As Boolean
Parameters
name
Type: System.String
A string.
Return Value
Type: Boolean
true if the string is a valid command name.
See Also
Reference
Command Class
Rhino.Commands Namespace