RhinoCommon SDK
Mesh.CreatePartitions Method
Rhino for Mac 5.1
 In ancient times (or modern smartphone times), some rendering engines were only able to process small batches of triangles and the CreatePartitions() function was provided to partition the mesh into subsets of vertices and faces that those rendering engines could handle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool CreatePartitions(
	int maximumVertexCount,
	int maximumTriangleCount
)
Public Function CreatePartitions (
	maximumVertexCount As Integer,
	maximumTriangleCount As Integer
) As Boolean
Parameters
maximumVertexCount
Type: System.Int32
[Missing <param name="maximumVertexCount"/> documentation for "M:Rhino.Geometry.Mesh.CreatePartitions(System.Int32,System.Int32)"]
maximumTriangleCount
Type: System.Int32
[Missing <param name="maximumTriangleCount"/> documentation for "M:Rhino.Geometry.Mesh.CreatePartitions(System.Int32,System.Int32)"]
Return Value
Type: Boolean
true on success
See Also
Reference
Mesh Class
Rhino.Geometry Namespace