RhinoCommon SDK
Vector2d.Inequality Operator
Rhino for Mac 5.1
 Determines whether two vectors have different values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator !=(
	Vector2d a,
	Vector2d b
)
Public Shared Operator <> (
	a As Vector2d,
	b As Vector2d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector2d
The first vector.
b
Type: Rhino.Geometry.Vector2d
The second vector.
Return Value
Type: Boolean
true if any component of the two vectors is pairwise different; otherwise false.
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace