RhinoCommon SDK
NeverRepeatList Class
Rhino for Mac 5.1
 Contains static methods and properties relating to the list of commands that are never repeated.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.NeverRepeatList
Namespace: Rhino.ApplicationSettings
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static class NeverRepeatList
Public NotInheritable Class NeverRepeatList
The NeverRepeatList type exposes the following members.
Properties
Name | Description
UseNeverRepeatList
 Only use the list if somebody modifies it via CRhinoAppSettings::SetDontRepeatCommands(). Return value of true means CRhinoCommand don't repeat flags will be ignored and the m_dont_repeat_list will be used instead. false means the individual CRhinoCommands will determine if they are repeatable.
Top
Methods
Name | Description
CommandNames
The list of commands to not repeat.
SetList
Puts the command name tokens in m_dont_repeat_list.
Top
See Also
Reference
Rhino.ApplicationSettings Namespace