RhinoCommon SDK
MeshVertexColorList Class
Rhino for Mac 5.1
 Provides access to the vertex colors of a mesh object.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.MeshVertexColorList
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MeshVertexColorList : IEnumerable<Color>,
	IEnumerable
Public Class MeshVertexColorList
	Implements IEnumerable(Of Color), IEnumerable
The MeshVertexColorList type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of mesh colors.
Item
 Gets or sets the vertex color at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Tag
 Gets or sets a mapping information for the mesh associated with these vertex colors.
Top
Methods
Name | Description
Add(Color)
 Adds a new vertex color to the end of the color list.
Add(Int32, Int32, Int32)
 Adds a new vertex color to the end of the color list.
AppendColors
 Appends a collection of colors to the vertex color list. For the Mesh to be valid, the number of colors must match the number of vertices.
Clear
 Clears the vertex color list on the mesh.
CreateMonotoneMesh
 Constructs a valid vertex color list consisting of a single color.
GetEnumerator
 Gets an enumerator that yields all colors in this collection.
SetColor(Int32, Color)
 Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
SetColor(MeshFace, Color)
 Sets a color at the three or four vertex indices of a specified face.
SetColor(Int32, Int32, Int32, Int32)
 Sets or adds a vertex color to the color List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
SetColors
 Sets all the vertex colors in one go. For the Mesh to be valid, the number of colors must match the number of vertices.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace