RhinoCommon SDK
EarthAnchorPoint.ModelBasePoint Property
Rhino for Mac 5.1
Corresponding model point in model coordinates.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d ModelBasePoint { get; set; }
Public Property ModelBasePoint As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace