RhinoCommon SDK
Material.IsDocumentControlled Property
Rhino for Mac 5.1
 If true this object may not be modified. Any properties or functions that attempt to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override bool IsDocumentControlled { get; }
Public Overrides ReadOnly Property IsDocumentControlled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Material Class
Rhino.DocObjects Namespace