RhinoCommon SDK
ObjectTable.AddMesh Method (Mesh, ObjectAttributes)
Rhino for Mac 5.1
Adds a mesh object to Rhino.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddMesh(
	Mesh mesh,
	ObjectAttributes attributes
)
Public Function AddMesh (
	mesh As Mesh,
	attributes As ObjectAttributes
) As Guid
Parameters
mesh
Type: Rhino.Geometry.Mesh
A duplicate of this mesh is added to Rhino.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes that will be linked with the mesh object.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddMesh Overload
Rhino.DocObjects.Tables Namespace