RhinoCommon SDK
CustomDisplay.Clear Method
Rhino for Mac 5.1
 Clear the drawing lists.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace