RhinoCommon SDK
Point3d Operators and Type Conversions
Rhino for Mac 5.1
The Point3d type exposes the following members.
Operators
Name | Description
Addition(Point3d, Point3d)
 Sums two Point3d instances.
Addition(Point3d, Vector3d)
 Sums up a point and a vector, and returns a new point.
Addition(Point3d, Vector3f)
 Sums up a point and a vector, and returns a new point.
Addition(Vector3d, Point3d)
 Sums up a point and a vector, and returns a new point.
Division
 Divides a Point3d by a number.
Equality
 Determines whether two Point3d have equal values.
Explicit(Point3d to Vector3d)
 Converts a point in a vector, needing casting.
Explicit(Vector3d to Point3d)
 Converts a vector in a point, needing casting.
GreaterThan
 Determines whether the first specified point comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
GreaterThanOrEqual
 Determines whether the first specified point comes after (has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then Z.
Implicit(Point3d to ControlPoint)
 Converts a point in a control point, without needing casting.
Implicit(Point3f to Point3d)
 Converts a single-precision point in a double-precision point, without needing casting.
Inequality
 Determines whether two Point3d have different values.
LessThan
 Determines whether the first specified point comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
LessThanOrEqual
 Determines whether the first specified point comes before (has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then Z.
Multiply(Double, Point3d)
 Multiplies a Point3d by a number.
Multiply(Point3d, Double)
 Multiplies a Point3d by a number.
Subtraction(Point3d, Point3d)
 Subtracts a point from another point.
Subtraction(Point3d, Vector3d)
 Subtracts a vector from a point.
UnaryNegation
 Computes the additive inverse of all coordinates in the point, and returns the new point.
Top
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace