RhinoCommon SDK
Point2d Operators
Rhino for Mac 5.1
The Point2d type exposes the following members.
Operators
Name | Description
Addition(Point2d, Point2d)
 Adds a point with a point.
Addition(Point2d, Vector2d)
 Adds a point with a vector.
Addition(Vector2d, Point2d)
 Adds a vector with a point.
Division
 Divides a Point2d by a number.
Equality
 Determines whether two Point2d have equal values.
GreaterThan
 Determines whether the first specified Point2d comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
GreaterThanOrEqual
 Determines whether the first specified Point2d comes after (has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
Inequality
 Determines whether two Point2d have different values.
LessThan
 Determines whether the first specified point comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
LessThanOrEqual
 Determines whether the first specified point comes before (has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
Multiply(Double, Point2d)
 Multiplies a Point2d by a number.
Multiply(Point2d, Double)
 Multiplies a Point2d by a number.
Subtraction(Point2d, Point2d)
 Subtracts point2 from point1.
Subtraction(Point2d, Vector2d)
 Subtracts a vector from a point.
Top
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace