RhinoCommon SDK
Point4d Operators
Rhino for Mac 5.1
The Point4d type exposes the following members.
Operators
Name | Description
Addition
 Sums two Point4d together.
Equality
 Determines whether two Point4d have equal values.
Inequality
 Determines whether two Point4d have different values.
Multiply(Point4d, Point4d)
 Multiplies two Point4d together, returning the dot (internal) product of the two. This is not the cross product.
Multiply(Point4d, Double)
 Multiplies a point by a number.
Subtraction
 Subtracts the second point from the first point.
Top
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace