RhinoCommon SDK
GroupTable.Find Method
Rhino for Mac 5.1
Finds a group with a given name.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Find(
	string groupName,
	bool ignoreDeletedGroups
)
Public Function Find (
	groupName As String,
	ignoreDeletedGroups As Boolean
) As Integer
Parameters
groupName
Type: System.String
 Name of group to search for. Ignores case.
ignoreDeletedGroups
Type: System.Boolean
 true means don't search deleted groups.
Return Value
Type: Int32
 >=0 index of the group with the given name. -1 no group found with the given name.
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace