RhinoCommon SDK
BoundingBox Constructor (IEnumerable<Point3d>)
Rhino for Mac 5.1
 Constructs a boundingbox from a collection of points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox(
	IEnumerable<Point3d> points
)
Public Sub New (
	points As IEnumerable(Of Point3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to include in the boundingbox.
See Also
Reference
BoundingBox Structure
BoundingBox Overload
Rhino.Geometry Namespace