RhinoCommon SDK
ColorHSL Constructor (Double, Double, Double)
Rhino for Mac 5.1
 Constructs a new instance of ColorHSL with custom channel values.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ColorHSL(
	double hue,
	double saturation,
	double luminance
)
Public Sub New (
	hue As Double,
	saturation As Double,
	luminance As Double
)
Parameters
hue
Type: System.Double
Hue channel value. Hue channels rotate between 0.0 and 1.0.
saturation
Type: System.Double
Saturation channel value. Channel will be limited to 0~1.
luminance
Type: System.Double
Luminance channel value. Channel will be limited to 0~1.
See Also
Reference
ColorHSL Structure
ColorHSL Overload
Rhino.Display Namespace