RhinoCommon SDK
DisplayPipeline.DrawArc Method
Rhino for Mac 5.1
Overload List
Name | Description
DrawArc(Arc, Color)
 Draw a single arc object.
DrawArc(Arc, Color, Int32)
 Draw a single arc object.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace