RhinoCommon SDK
TextureMapping.PrimativeTransform Property
Rhino for Mac 5.1
 For primitive based mappings, these transformations are used to map the world coordinate (x,y,z) point P and surface normal N before it is projected to the normalized mapping primitive. The surface normal transformation, m_Nxyz, is always calculated from m_Pxyz. It is a runtime setting that is not saved in 3dm files. If m_type is srfp_mapping, then m_Pxyz and m_Nxyz are ignored.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform PrimativeTransform { get; set; }
Public Property PrimativeTransform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
TextureMapping Class
Rhino.Render Namespace