RhinoCommon SDK
RTree Methods
Rhino for Mac 5.1
The RTree type exposes the following members.
Methods
Name | Description
Clear
 Removes all elements.
CreateMeshFaceTree
 Constructs a new tree with an element for each face in the mesh. The element id is set to the index of the face.
CreatePointCloudTree
 Constructs a new tree with an element for each pointcloud point.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Insert(BoundingBox, Int32)
Inserts an element into the tree.
Insert(BoundingBox, IntPtr)
Inserts an element into the tree.
Insert(Point2d, Int32)
Inserts an element into the tree.
Insert(Point2d, IntPtr)
Inserts an element into the tree.
Insert(Point3d, Int32)
Inserts an element into the tree.
Insert(Point3d, IntPtr)
Inserts an element into the tree.
Remove(BoundingBox, Int32)
Removes an element from the tree.
Remove(BoundingBox, IntPtr)
Removes an element from the tree.
Remove(Point2d, Int32)
Removes an element from the tree.
Remove(Point3d, Int32)
Removes an element from the tree.
Remove(Point3d, IntPtr)
Removes an element from the tree.
Search(BoundingBox, EventHandler<RTreeEventArgs>)
 Searches for items in a bounding box.
The bounding box can be singular and contain exactly one single point.
Search(Sphere, EventHandler<RTreeEventArgs>)
 Searches for items in a sphere.
Search(BoundingBox, EventHandler<RTreeEventArgs>, Object)
 Searches for items in a bounding box.
The bounding box can be singular and contain exactly one single point.
Search(Sphere, EventHandler<RTreeEventArgs>, Object)
 Searches for items in a sphere.
SearchOverlaps
 Searches two R-trees for all pairs elements whose bounding boxes overlap.
Top
See Also
Reference
RTree Class
Rhino.Geometry Namespace