RhinoCommon SDK
MaelstromSpaceMorph.MorphPoint Method
Rhino for Mac 5.1
Morphs an Euclidean point.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override Point3d MorphPoint(
	Point3d point
)
Public Overrides Function MorphPoint (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point that will be morphed by this object.
Return Value
Type: Point3d
Resulting morphed point.
See Also
Reference
MaelstromSpaceMorph Class
Rhino.Geometry.Morphs Namespace