RhinoCommon SDK
Point2d.Origin Property
Rhino for Mac 5.1
 Gets a point at 0,0.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point2d Origin { get; }
Public Shared ReadOnly Property Origin As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace