RhinoCommon SDK
Point3d.Origin Property
Rhino for Mac 5.1
 Gets the value of a point at location 0,0,0.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d Origin { get; }
Public Shared ReadOnly Property Origin As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace