RhinoCommon SDK
PointCloudObject Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.PointCloudObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.PointCloudObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class PointCloudObject : RhinoObject
Public Class PointCloudObject
	Inherits RhinoObject
The PointCloudObject type exposes the following members.
Properties
Name | Description
PointCloudGeometry
Top
Methods
Name | Description
DuplicatePointCloudGeometry
Top
See Also
Reference
Rhino.DocObjects Namespace