RhinoCommon SDK
BoundingBox.GetEdges Method
Rhino for Mac 5.1
 Gets an array of the 12 edges of this box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line[] GetEdges()
Public Function GetEdges As Line()
Return Value
Type: Line[]
If the boundingbox IsValid, the 12 edges; otherwise, null.
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace