RhinoCommon SDK
BrepRegionFaceSide Class
Rhino for Mac 5.1
 Represents a side of a BrepRegion entity.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.BrepRegionFaceSide
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class BrepRegionFaceSide
Public Class BrepRegionFaceSide
The BrepRegionFaceSide type exposes the following members.
Properties
Name | Description
Brep
 The brep this side belongs to.
Face
Gets the face this side belongs to.
Region
 The region this side belongs to.
SurfaceNormalPointsIntoRegion
 Gets true if BrepFace's surface normal points into region; false otherwise.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace