RhinoCommon SDK
VisualAnalysisMode.RhinoThicknessAnalysisModeId Property
Rhino for Mac 5.1
 Id for Rhino's built-in thickness analysis mode.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid RhinoThicknessAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoThicknessAnalysisModeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace