RhinoCommon SDK
DisplayPipeline.Measure2dText Method
Rhino for Mac 5.1
 Determines screen rectangle that would be drawn to using the Draw2dText(..) function with the same parameters.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Rectangle Measure2dText(
	string text,
	Point2d definitionPoint,
	bool middleJustified,
	double rotationRadians,
	int height,
	string fontFace
)
Public Function Measure2dText (
	text As String,
	definitionPoint As Point2d,
	middleJustified As Boolean,
	rotationRadians As Double,
	height As Integer,
	fontFace As String
) As Rectangle
Parameters
text
Type: System.String
text to measure.
definitionPoint
Type: Rhino.Geometry.Point2d
either lower-left or middle of text.
middleJustified
Type: System.Boolean
true=middle justified. false=lower-left justified.
rotationRadians
Type: System.Double
text rotation in radians
height
Type: System.Int32
height in pixels (good default is 12)
fontFace
Type: System.String
font name (good default is "Arial")
Return Value
Type: Rectangle
rectangle in the viewport's screen coordinates on success.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace