RhinoCommon SDK
Rectangle3d.Width Property
Rhino for Mac 5.1
 Gets the signed width of the rectangle. If the X dimension is decreasing, the width will be negative.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Width { get; }
Public ReadOnly Property Width As Double
	Get
Property Value
Type: Double
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace