RhinoCommon SDK
ObjRef.Light Method
Rhino for Mac 5.1
 Gets the light if the referenced geometry is one.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Light Light()
Public Function Light As Light
Return Value
Type: Light
A light; or null if the referenced object is not a light, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace