RhinoCommon SDK
Brep Methods
Rhino for Mac 5.1
The Brep type exposes the following members.
Methods
Name | Description
AddEdgeCurve
 Add a 3d curve used by the brep edges
AddSurface
 Adds a 3D surface used by BrepFace.
AddTrimCurve
 Add a 2d curve used by the brep trims
Append
 Appends a copy of another brep to this and updates indices of appended brep parts. Duplicates are not removed
CapPlanarHoles
 Returns a new Brep that is equivalent to this Brep with all planar holes capped.
ClosestPoint(Point3d)
 Finds a point on the brep that is closest to testPoint.
ClosestPoint(Point3d, Point3d, ComponentIndex, Double, Double, Double, Vector3d)
 Finds a point on a brep that is closest to testPoint.
Compact
 Deletes any unreferenced objects from arrays, reindexes as needed, and shrinks arrays to minimum required size. Uses CUllUnused* members to delete any unreferenced objects from arrays.
CopyTrimCurves
 Copy all trims from a Brep face onto a surface.
CreateBooleanDifference(Brep, Brep, Double)
 Compute the Solid Difference of two Breps.
CreateBooleanDifference(IEnumerable<Brep>, IEnumerable<Brep>, Double)
 Compute the Solid Difference of two sets of Breps.
CreateBooleanIntersection(Brep, Brep, Double)
 Compute the Solid Intersection of two Breps.
CreateBooleanIntersection(IEnumerable<Brep>, IEnumerable<Brep>, Double)
 Compute the Solid Intersection of two sets of Breps.
CreateBooleanUnion
 Compute the Boolean Union of a set of Breps.
CreateContourCurves(Brep, Plane)
 Constructs the contour curves for a brep, using a slicing plane.
CreateContourCurves(Brep, Point3d, Point3d, Double)
 Constructs the contour curves for a brep at a specified interval.
CreateEdgeSurface
 Constructs a coons patch from 2, 3, or 4 curves.
CreateFromBox(BoundingBox)
 Constructs new brep that matches a bounding box.
CreateFromBox(Box)
 Constructs new brep that matches an aligned box.
CreateFromBox(IEnumerable<Point3d>)
 Constructs new brep from 8 corner points.
CreateFromCone
 Constructs a Brep representation of the cone with a single face for the cone, an edge along the cone seam, and vertices at the base and apex ends of this seam edge. The optional cap is a single face with one circular edge starting and ending at the base vertex.
CreateFromCornerPoints(Point3d, Point3d, Point3d, Double)
 Makes a brep with one face.
CreateFromCornerPoints(Point3d, Point3d, Point3d, Point3d, Double)
 make a Brep with one face.
CreateFromCylinder
 Constructs a Brep definition of a cylinder.
CreateFromLoft
 Constructs one or more Breps by lofting through a set of curves.
CreateFromLoftRebuild
 Constructs one or more Breps by lofting through a set of curves. Input for the loft is simplified by rebuilding to a specified number of control points.
CreateFromLoftRefit
 Constructs one or more Breps by lofting through a set of curves. Input for the loft is simplified by refitting to a specified tolerance.
CreateFromMesh
 Create a brep representation of a mesh
CreateFromOffsetFace
 Offsets a face including trim information to create a new brep.
CreateFromRevSurface
 Constructs a brep form of a surface of revolution.
CreateFromSphere
 Constructs a Brep definition of a sphere.
CreateFromSurface
 Constructs a Brep from a surface. The resulting Brep has an outer boundary made from four trims. The trims are ordered so that they run along the south, east, north, and then west side of the surface's parameter space.
CreateFromSweep(Curve, Curve, Boolean, Double)
 General 1 rail sweep. If you are not producing the sweep results that you are after, then use the SweepOneRail class with options to generate the swept geometry
CreateFromSweep(Curve, IEnumerable<Curve>, Boolean, Double)
 General 1 rail sweep. If you are not producing the sweep results that you are after, then use the SweepOneRail class with options to generate the swept geometry
CreateFromSweep(Curve, Curve, Curve, Boolean, Double)
 General 2 rail sweep. If you are not producing the sweep results that you are after, then use the SweepTwoRail class with options to generate the swept geometry
CreateFromSweep(Curve, Curve, IEnumerable<Curve>, Boolean, Double)
 General 2 rail sweep. If you are not producing the sweep results that you are after, then use the SweepTwoRail class with options to generate the swept geometry
CreateFromTaperedExtrude
 Extrude a curve to a taper making a brep (potentially more than 1)
CreatePatch(IEnumerable<GeometryBase>, Surface, Double)
 Constructs a brep patch.
This is the simple version of fit that uses a specified starting surface.
CreatePatch(IEnumerable<GeometryBase>, Int32, Int32, Double)
 Constructs a brep patch.
This is the simple version of fit that uses a plane with u x v spans. It makes a plane by fitting to the points from the input geometry to use as the starting surface. The surface has the specified u and v span count.
CreatePatch(IEnumerable<GeometryBase>, Surface, Int32, Int32, Boolean, Boolean, Double, Double, Double, Boolean[], Double)
 Constructs a brep patch using all controls
CreatePipe(Curve, Double, Boolean, PipeCapMode, Boolean, Double, Double)
 Creates a single walled pipe
CreatePipe(Curve, IEnumerable<Double>, IEnumerable<Double>, Boolean, PipeCapMode, Boolean, Double, Double)
 Creates a single walled pipe
CreatePlanarBreps(Curve)
 Constructs a set of planar breps as outlines by the loops.
CreatePlanarBreps(IEnumerable<Curve>)
 Constructs a set of planar breps as outlines by the loops.
CreatePlanarBreps(CurveList)
 Constructs a set of planar Breps as outlines by the loops.
CreateShell
 Creates a hollowed out shell from a solid Brep. Function only operates on simple, solid, manifold Breps.
CreateSolid
 Constructs closed polysurfaces from surfaces and polysurfaces that bound a region in space.
CreateTrimmedSurface
 Constructs a Brep using the trimming information of a brep face and a surface. Surface must be roughly the same shape and in the same location as the trimming brep face.
CullUnused2dCurves
Culls 3d curves not referenced by an edge.
CullUnused3dCurves
Culls 2d curves not referenced by a trim.
CullUnusedEdges
Culls edges with m_edge_index == -1.
CullUnusedFaces
Culls faces with m_face_index == -1.
CullUnusedLoops
Culls loops with m_loop_index == -1.
CullUnusedSurfaces
Culls surfaces not referenced by a face.
CullUnusedTrims
Culls trims with m_trim_index == -1.
CullUnusedVertices
Culls vertices with m_vertex_index == -1.
Duplicate
 Copies this brep.
 (Overrides GeometryBase.Duplicate().)
DuplicateBrep
 Same as Duplicate(), but already performs a cast to a brep.
This cast always succeeds.
DuplicateEdgeCurves()
 Duplicate all the edges of this Brep.
DuplicateEdgeCurves(Boolean)
 Duplicate edges of this Brep.
DuplicateNakedEdgeCurves
 Duplicate naked edges of this Brep
DuplicateSubBrep
 Copy a subset of this Brep into another Brep.
DuplicateVertices
 Duplicate all the corner vertices of this Brep.
Flip
 Reverses entire brep orientation of all faces.
GetArea()
 Compute the Area of the Brep. If you want proper Area data with moments and error information, use the AreaMassProperties class.
GetArea(Double, Double)
 Compute the Area of the Brep. If you want proper Area data with moments and error information, use the AreaMassProperties class.
GetRegions
 Gets an array containing all regions in this brep.
GetVolume()
 Compute the Volume of the Brep. If you want proper Volume data with moments and error information, use the VolumeMassProperties class.
GetVolume(Double, Double)
 Compute the Volume of the Brep. If you want proper Volume data with moments and error information, use the VolumeMassProperties class.
GetWireframe
 Constructs all the Wireframe curves for this Brep.
IsDuplicate
See if this and other are same brep geometry.
IsPointInside
 Determines if point is inside Brep. This question only makes sense when the brep is a closed manifold. This function does not not check for closed or manifold, so result is not valid in those cases. Intersects a line through point with brep, finds the intersection point Q closest to point, and looks at face normal at Q. If the point Q is on an edge or the intersection is not transverse at Q, then another line is used.
IsValidGeometry
 Expert user function that tests the brep to see if its geometry information is valid. The value of brep.IsValidTopology() must be true before brep.IsValidGeometry() can be safely called.
IsValidTolerancesAndFlags
 Expert user function that tests the brep to see if its tolerances and flags are valid. The values of brep.IsValidTopology() and brep.IsValidGeometry() must be true before brep.IsValidTolerancesAndFlags() can be safely called.
IsValidTopology
 Tests the brep to see if its topology information is valid.
Join
 If any edges of this brep overlap edges of otherBrep, merge a copy of otherBrep into this brep joining all edges that overlap within tolerance.
JoinBreps
 Joins the breps in the input array at any overlapping edges to form as few as possible resulting breps. There may be more than one brep in the result array.
JoinNakedEdges
 Joins naked edge pairs within the same brep that overlap within tolerance.
MergeBreps
 Combines two or more breps into one. A merge is like a boolean union that keeps the inside pieces. This function creates non-manifold Breps which in general are unusual in Rhino. You may want to consider using JoinBreps or CreateBooleanUnion functions instead.
MergeCoplanarFaces
 Merges adjacent coplanar faces into single faces.
RebuildTrimsForV2
 No support is available for this function.
Expert user function used by MakeValidForV2 to convert trim curves from one surface to its NURBS form. After calling this function, you need to change the surface of the face to a NurbsSurface.
SetTrimIsoFlags
 This function can be used to set the BrepTrim::m_iso flag. It is intended to be used when creating a Brep from a definition that does not include compatible parameter space type information.
SetVertices
 This function can be used to compute vertex information for a b-rep when everything but the Vertices array is properly filled in. It is intended to be used when creating a Brep from a definition that does not include explicit vertex information.
Split(Brep, Double)
 Splits a Brep into pieces.
Split(Brep, Double, Boolean)
 Splits a Brep into pieces.
Standardize
 Standardizes all trims, edges, and faces in the brep. After standardizing, there may be unused curves and surfaces in the brep. Call Brep.Compact to remove these unused curves and surfaces.
Trim(Brep, Double)
 Trims a brep with an oriented cutter. The parts of the brep that lie inside (opposite the normal) of the cutter are retained while the parts to the outside (in the direction of the normal) are discarded. If the Cutter is closed, then a connected component of the Brep that does not intersect the cutter is kept if and only if it is contained in the inside of cutter. That is the region bounded by cutter opposite from the normal of cutter, If cutter is not closed all these components are kept.
Trim(Plane, Double)
 Trims a Brep with an oriented cutter. The parts of Brep that lie inside (opposite the normal) of the cutter are retained while the parts to the outside ( in the direction of the normal ) are discarded. A connected component of Brep that does not intersect the cutter is kept if and only if it is contained in the inside of Cutter. That is the region bounded by cutter opposite from the normal of cutter, or in the case of a Plane cutter the halfspace opposite from the plane normal.
TryConvertBrep
 Attempts to convert a generic Geometry object into a Brep.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace