RhinoCommon SDK
Extrusion.IsMiteredAtEnd Property
Rhino for Mac 5.1
 Gets a value indicating whether a miter plane at the end is defined.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsMiteredAtEnd { get; }
Public ReadOnly Property IsMiteredAtEnd As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace