RhinoCommon SDK
Surface.ToNurbsSurface Method
Rhino for Mac 5.1
Overload List
Name | Description
ToNurbsSurface()
 Gets a NURBS surface representation of this surface. Default tolerance of 0.0 is used.
ToNurbsSurface(Double, Int32)
 Gets a NURBS surface representation of this surface.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace