RhinoCommon SDK
BinaryArchiveWriter.WriteSByteArray Method
Rhino for Mac 5.1
 Writes a list, an array, or any enumerable of SByte to the archive.
The return will always be an array.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteSByteArray(
	IEnumerable<sbyte> value
)
Public Sub WriteSByteArray (
	value As IEnumerable(Of SByte)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<SByte>
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace