RhinoCommon SDK
BezierCurve.ToNurbsCurve Method
Rhino for Mac 5.1
 Constructs a NURBS curve representation of this curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsCurve ToNurbsCurve()
Public Function ToNurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
NURBS representation of the curve on success, null on failure.
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace