RhinoCommon SDK
File3dm.NamedViews Property
Rhino for Mac 5.1
 Named view list
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IList<ViewInfo> NamedViews { get; }
Public ReadOnly Property NamedViews As IList(Of ViewInfo)
	Get
Property Value
Type: IList<ViewInfo>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace