RhinoCommon SDK
ViewportInfo.FrustumBottom Property
Rhino for Mac 5.1
 Gets the frustum bottom value. This is -top if the frustum has a horizontal symmetry axis.
This number is usually negative.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double FrustumBottom { get; }
Public ReadOnly Property FrustumBottom As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace