RhinoCommon SDK
Panels.IsPanelVisible Method (Type)
Rhino for Mac 5.1
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool IsPanelVisible(
	Type panelType
)
Public Shared Function IsPanelVisible (
	panelType As Type
) As Boolean
Parameters
panelType
Type: System.Type
 Type of panel to check for, this type must include a GUID attribute.
Return Value
Type: Boolean
 Returns true if panelType is non null and the tab is visible otherwise it returns false.
See Also
Reference
Panels Class
IsPanelVisible Overload
Rhino.UI Namespace