RhinoCommon SDK
MeshTextureCoordinateList.AddRange Method
Rhino for Mac 5.1
 Appends an array of texture coordinates.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool AddRange(
	Point2f[] textureCoordinates
)
Public Function AddRange (
	textureCoordinates As Point2f()
) As Boolean
Parameters
textureCoordinates
Type: Rhino.Geometry.Point2f[]
Texture coordinates to append.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace