RhinoCommon SDK
DetailViewObject.DetailGeometry Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.DetailViewObject.DetailGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DetailView DetailGeometry { get; }
Public ReadOnly Property DetailGeometry As DetailView
	Get
Property Value
Type: DetailView
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace