RhinoCommon SDK
LinetypeTable.Modify Method
Rhino for Mac 5.1
Modify linetype settings.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Modify(
	Linetype linetype,
	int index,
	bool quiet
)
Public Function Modify (
	linetype As Linetype,
	index As Integer,
	quiet As Boolean
) As Boolean
Parameters
linetype
Type: Rhino.DocObjects.Linetype
New linetype settings. This information is copied.
index
Type: System.Int32
Zero based index of linetype to set.
quiet
Type: System.Boolean
 if true, information message boxes pop up when illegal changes are attempted.
Return Value
Type: Boolean
 true if successful. false if linetype_index is out of range or the settings attempt to lock or hide the current linetype.
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace