RhinoCommon SDK
NurbsSurface.CreateRailRevolvedSurface Method
Rhino for Mac 5.1
 Constructs a railed Surface-of-Revolution.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static NurbsSurface CreateRailRevolvedSurface(
	Curve profile,
	Curve rail,
	Line axis,
	bool scaleHeight
)
Public Shared Function CreateRailRevolvedSurface (
	profile As Curve,
	rail As Curve,
	axis As Line,
	scaleHeight As Boolean
) As NurbsSurface
Parameters
profile
Type: Rhino.Geometry.Curve
Profile curve for revolution.
rail
Type: Rhino.Geometry.Curve
Rail curve for revolution.
axis
Type: Rhino.Geometry.Line
Axis of revolution.
scaleHeight
Type: System.Boolean
If true, surface will be locally scaled.
Return Value
Type: NurbsSurface
A NurbsSurface or null on failure.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace