RhinoCommon SDK
Quaternion.J Property
Rhino for Mac 5.1
 Returns the (0,0,1,0) quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Quaternion J { get; }
Public Shared ReadOnly Property J As Quaternion
	Get
Property Value
Type: Quaternion
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace