RhinoCommon SDK
Quaternion.B Property
Rhino for Mac 5.1
 Gets or sets the first imaginary coefficient of the quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double B { get; set; }
Public Property B As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace