RhinoCommon SDK
Quaternion.C Property
Rhino for Mac 5.1
 Gets or sets the second imaginary coefficient of the quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double C { get; set; }
Public Property C As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace