RhinoCommon SDK
Point4d.Multiply Operator
Rhino for Mac 5.1
Overload List
Name | Description
Multiply(Point4d, Point4d)
 Multiplies two Point4d together, returning the dot (internal) product of the two. This is not the cross product.
Multiply(Point4d, Double)
 Multiplies a point by a number.
Top
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace