RhinoCommon SDK
ParticleSystem.BoundingBox Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Geometry.ParticleSystem.BoundingBox"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace