RhinoCommon SDK
LinetypeTable.ByLayerLinetypeName Property
Rhino for Mac 5.1
 Returns the text name of the bylayer linetype.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string ByLayerLinetypeName { get; }
Public ReadOnly Property ByLayerLinetypeName As String
	Get
Property Value
Type: String
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace