RhinoCommon SDK
InstanceDefinitionGeometry Constructor
Rhino for Mac 5.1
 Initializes a new block definition.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public InstanceDefinitionGeometry()
Public Sub New
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace