RhinoCommon SDK
File3dm Constructor
Rhino for Mac 5.1
 Initializes a new instance of a 3dm file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public File3dm()
Public Sub New
See Also
Reference
File3dm Class
Rhino.FileIO Namespace