RhinoCommon SDK
MaterialRefCreateParams.FrontFaceMaterialIndex Property
Rhino for Mac 5.1
 The index of the material used to render the front of an object
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int FrontFaceMaterialIndex { get; set; }
Public Property FrontFaceMaterialIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace