RhinoCommon SDK
RhinoObject.GetTextureMapping Method
Rhino for Mac 5.1
Overload List
Name | Description
GetTextureMapping(Int32)
GetTextureMapping(Int32, Transform)
 Get objects texture mapping
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace