RhinoCommon SDK
DimensionStyle.LengthResolution Property
Rhino for Mac 5.1
Linear display precision.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int LengthResolution { get; set; }
Public Property LengthResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace