RhinoCommon SDK
ObjectTable.FindByWindowRegion Method
Rhino for Mac 5.1
Overload List
Name | Description
FindByWindowRegion(RhinoViewport, IEnumerable<Point3d>, Boolean, ObjectType)
 Finds objects bounded by a polyline region
FindByWindowRegion(RhinoViewport, Point2d, Point2d, Boolean, ObjectType)
 Finds objects bounded by a polyline region
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace