RhinoCommon SDK
ObjectTable.AddRadialDimension Method
Rhino for Mac 5.1
Overload List
Name | Description
AddRadialDimension(RadialDimension)
AddRadialDimension(RadialDimension, ObjectAttributes)
AddRadialDimension(RadialDimension, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace