RhinoCommon SDK
BrepEdge Methods
Rhino for Mac 5.1
The BrepEdge type exposes the following members.
Methods
Name | Description
AdjacentFaces
 Gets the indices of all the BrepFaces that use this edge.
GetEdgeParameter
 Get corresponding edge parameter for given trim at given trim parameter.
IsSmoothManifoldEdge
 For a manifold, non-boundary edge, decides whether or not the two surfaces on either side meet smoothly.
SetEdgeCurve(Int32)
 Set 3d curve geometry used by a b-rep edge.
SetEdgeCurve(Int32, Interval)
 Set 3d curve geometry used by a b-rep edge.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The Nurbs Curves segments do not have fully multiple interior knots.
 3. Rational Nurbs curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent Colinear or Cocircular segments are combined.
TrimIndices
 Gets the indices of all trims associated with this edge.
Top
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace