RhinoCommon SDK
Point2d.Multiply Operator
Rhino for Mac 5.1
Overload List
Name | Description
Multiply(Double, Point2d)
 Multiplies a Point2d by a number.
Multiply(Point2d, Double)
 Multiplies a Point2d by a number.
Top
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace