RhinoCommon SDK
LineCurve Constructor (LineCurve)
Rhino for Mac 5.1
 Initializes a new instance of the LineCurve class, by copying values from another linear curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public LineCurve(
	LineCurve other
)
Public Sub New (
	other As LineCurve
)
Parameters
other
Type: Rhino.Geometry.LineCurve
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.LineCurve.#ctor(Rhino.Geometry.LineCurve)"]
See Also
Reference
LineCurve Class
LineCurve Overload
Rhino.Geometry Namespace