RhinoCommon SDK
Quaternion.IsVector Property
Rhino for Mac 5.1
 true if a = 0 and at least one of b, c, or d is not zero.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsVector { get; }
Public ReadOnly Property IsVector As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace