RhinoCommon SDK
Mesh.IsManifold Method
Rhino for Mac 5.1
 Gets a value indicating whether or not the mesh is manifold. A manifold mesh does not have any edge that borders more than two faces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsManifold(
	bool topologicalTest,
	out bool isOriented,
	out bool hasBoundary
)
Public Function IsManifold (
	topologicalTest As Boolean,
	<OutAttribute> ByRef isOriented As Boolean,
	<OutAttribute> ByRef hasBoundary As Boolean
) As Boolean
Parameters
topologicalTest
Type: System.Boolean
 If true, the query treats coincident vertices as the same.
isOriented
Type: System.Boolean
 isOriented will be set to true if the mesh is a manifold and adjacent faces have compatible face normals.
hasBoundary
Type: System.Boolean
 hasBoundary will be set to true if the mesh is a manifold and there is at least one "edge" with no more than one adjacent face.
Return Value
Type: Boolean
true if every mesh "edge" has at most two adjacent faces.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace