RhinoCommon SDK
OptionColor.InitialValue Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.OptionColor.InitialValue"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color InitialValue { get; }
Public ReadOnly Property InitialValue As Color
	Get
Property Value
Type: Color
See Also
Reference
OptionColor Class
Rhino.Input.Custom Namespace