RhinoCommon SDK
GetInteger.Get Method
Rhino for Mac 5.1
 Call to get an integer.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GetResult Get()
Public Function Get As GetResult
Return Value
Type: GetResult
If the user chose a number, then Number; another enumeration value otherwise.
See Also
Reference
GetInteger Class
Rhino.Input.Custom Namespace