RhinoCommon SDK
StatusBar.UpdateProgressMeter Method
Rhino for Mac 5.1
 Sets the current position of Rhino's status bar progress meter.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static int UpdateProgressMeter(
	int position,
	bool absolute
)
Public Shared Function UpdateProgressMeter (
	position As Integer,
	absolute As Boolean
) As Integer
Parameters
position
Type: System.Int32
The new value. This can be stated in absolute terms, or relative compared to the current position.
The interval bounds are specified when you first show the bar using ShowProgressMeter(Int32, Int32, String, Boolean, Boolean).
absolute
Type: System.Boolean
 If true, then the progress meter is moved to position. If false, then the progress meter is moved position from the current position (relative).
Return Value
Type: Int32
 The previous position if successful.
See Also
Reference
StatusBar Class
Rhino.UI Namespace