RhinoCommon SDK
CachedTextureCoordinates.RemoveAt Method
Rhino for Mac 5.1
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void RemoveAt(
	int index
)
Public Sub RemoveAt (
	index As Integer
)
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Render.CachedTextureCoordinates.RemoveAt(System.Int32)"]
Implements
IList<T>.RemoveAt(Int32)
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace