RhinoCommon SDK
Cylinder Methods
Rhino for Mac 5.1
The Cylinder type exposes the following members.
Methods
Name | Description
CircleAt
 Compute the circle at the given elevation parameter.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
LineAt
 Compute the line at the given angle parameter. This line will be degenerate if the cylinder is infite.
ToBrep
 Constructs a Brep representation of this Cylinder. This is synonymous with calling NurbsSurface.CreateFromCylinder().
ToNurbsSurface
 Constructs a Nurbs surface representation of this cylinder. This is synonymous with calling NurbsSurface.CreateFromCylinder().
ToRevSurface
 Constructs a RevSurface representation of this Cylinder. This is synonymous with calling RevSurface.CreateFromCylinder().
Top
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace