RhinoCommon SDK
HistoryRecord.SetGuid Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetGuid(System.Int32,System.Guid)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetGuid(
	int id,
	Guid value
)
Public Function SetGuid (
	id As Integer,
	value As Guid
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetGuid(System.Int32,System.Guid)"]
value
Type: System.Guid
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetGuid(System.Int32,System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetGuid(System.Int32,System.Guid)"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace