RhinoCommon SDK
ToolbarFileCollection.FindByName Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFileCollection.FindByName(System.String,System.Boolean)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ToolbarFile FindByName(
	string name,
	bool ignoreCase
)
Public Function FindByName (
	name As String,
	ignoreCase As Boolean
) As ToolbarFile
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.UI.ToolbarFileCollection.FindByName(System.String,System.Boolean)"]
ignoreCase
Type: System.Boolean
[Missing <param name="ignoreCase"/> documentation for "M:Rhino.UI.ToolbarFileCollection.FindByName(System.String,System.Boolean)"]
Return Value
Type: ToolbarFile
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFileCollection.FindByName(System.String,System.Boolean)"]
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace