RhinoCommon SDK
Point3d.Multiply Operator (Double, Point3d)
Rhino for Mac 5.1
 Multiplies a Point3d by a number.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d operator *(
	double t,
	Point3d point
)
Public Shared Operator * (
	t As Double,
	point As Point3d
) As Point3d
Parameters
t
Type: System.Double
A number.
point
Type: Rhino.Geometry.Point3d
A point.
Return Value
Type: Point3d
A new point that is coordinatewise multiplied by t.
See Also
Reference
Point3d Structure
Multiply Overload
Rhino.Geometry Namespace