RhinoCommon SDK
Quaternion.Set Method
Rhino for Mac 5.1
 Sets all coefficients of the quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Set(
	double a,
	double b,
	double c,
	double d
)
Public Sub Set (
	a As Double,
	b As Double,
	c As Double,
	d As Double
)
Parameters
a
Type: System.Double
[Missing <param name="a"/> documentation for "M:Rhino.Geometry.Quaternion.Set(System.Double,System.Double,System.Double,System.Double)"]
b
Type: System.Double
[Missing <param name="b"/> documentation for "M:Rhino.Geometry.Quaternion.Set(System.Double,System.Double,System.Double,System.Double)"]
c
Type: System.Double
[Missing <param name="c"/> documentation for "M:Rhino.Geometry.Quaternion.Set(System.Double,System.Double,System.Double,System.Double)"]
d
Type: System.Double
[Missing <param name="d"/> documentation for "M:Rhino.Geometry.Quaternion.Set(System.Double,System.Double,System.Double,System.Double)"]
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace