RhinoCommon SDK
GetBaseClass.AddOptionEnumSelectionList<T> Method
Rhino for Mac 5.1
 Add a list of enum values as option list. Use enumSelection[go.Option.CurrentListOptionIndex] to retrieve selection.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddOptionEnumSelectionList<T>(
	string englishOptionName,
	IEnumerable<T> enumSelection,
	int listCurrentIndex
)
where T : struct, new(), IConvertible
Public Function AddOptionEnumSelectionList(Of T As {Structure, New, IConvertible}) (
	englishOptionName As String,
	enumSelection As IEnumerable(Of T),
	listCurrentIndex As Integer
) As Integer
Parameters
englishOptionName
Type: System.String
[Missing <param name="englishOptionName"/> documentation for "M:Rhino.Input.Custom.GetBaseClass.AddOptionEnumSelectionList``1(System.String,System.Collections.Generic.IEnumerable{``0},System.Int32)"]
enumSelection
Type: System.Collections.Generic.IEnumerable<T>
[Missing <param name="enumSelection"/> documentation for "M:Rhino.Input.Custom.GetBaseClass.AddOptionEnumSelectionList``1(System.String,System.Collections.Generic.IEnumerable{``0},System.Int32)"]
listCurrentIndex
Type: System.Int32
[Missing <param name="listCurrentIndex"/> documentation for "M:Rhino.Input.Custom.GetBaseClass.AddOptionEnumSelectionList``1(System.String,System.Collections.Generic.IEnumerable{``0},System.Int32)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.Input.Custom.GetBaseClass.AddOptionEnumSelectionList``1(System.String,System.Collections.Generic.IEnumerable{``0},System.Int32)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetBaseClass.AddOptionEnumSelectionList``1(System.String,System.Collections.Generic.IEnumerable{``0},System.Int32)"]
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace