RhinoCommon SDK
BrepEdge.EndVertex Property
Rhino for Mac 5.1
 BrepVertex at end of edge
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepVertex EndVertex { get; }
Public ReadOnly Property EndVertex As BrepVertex
	Get
Property Value
Type: BrepVertex
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace