RhinoCommon SDK
VolumeMassProperties.WorldCoordinatesProductMoments Property
Rhino for Mac 5.1
 Returns the world coordinate product moments if they were able to be calculated. X is integral of "xy dm" over the area Y is integral of "yz dm" over the area Z is integral of "zx dm" over the area.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d WorldCoordinatesProductMoments { get; }
Public ReadOnly Property WorldCoordinatesProductMoments As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace