RhinoCommon SDK
Point3d.Subtraction Operator (Point3d, Vector3d)
Rhino for Mac 5.1
 Subtracts a vector from a point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d operator -(
	Point3d point,
	Vector3d vector
)
Public Shared Operator - (
	point As Point3d,
	vector As Vector3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
vector
Type: Rhino.Geometry.Vector3d
A vector.
Return Value
Type: Point3d
A new point that is the difference of point minus vector.
See Also
Reference
Point3d Structure
Subtraction Overload
Rhino.Geometry Namespace