RhinoCommon SDK
Circle.Circumference Property
Rhino for Mac 5.1
 Gets or sets the circumference of this circle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Circumference { get; set; }
Public Property Circumference As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Circle Structure
Rhino.Geometry Namespace