RhinoCommon SDK
Localization.CurrentLanguageId Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.Localization.CurrentLanguageId"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static int CurrentLanguageId { get; }
Public Shared ReadOnly Property CurrentLanguageId As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Localization Class
Rhino.UI Namespace