RhinoCommon SDK
VisualAnalysisMode Class
Rhino for Mac 5.1
 Represents a base class for visual analysis modes.
This class is abstract.
Inheritance Hierarchy
System.Object
 Rhino.Display.VisualAnalysisMode
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class VisualAnalysisMode
Public MustInherit Class VisualAnalysisMode
The VisualAnalysisMode type exposes the following members.
Constructors
Name | Description
VisualAnalysisMode
Initializes a new instance of the VisualAnalysisMode class
Top
Properties
Name | Description
Id
 Gets the visual analysis mode GUID. The Guid is specified with the GuidAttribute applied to the class.
Name
 Gets the name of the analysis mode. It is used by the _What command and the object properties details window to describe the object.
RhinoCurvatureColorAnalyisModeId
 Id for Rhino's built-in curvature color analysis mode. Surface curvature is shown using false color mapping.
RhinoCurvatureGraphAnalysisModeId
 Id for Rhino's built-in curvature graphs analysis mode. Curvature hair is shown on curves and surfaces.
RhinoDraftAngleAnalysisModeId
 Id for Rhino's built-in draft angle analysis mode. Draft angle is displayed using false colors.
RhinoEdgeAnalysisModeId
 Id for Rhino's built-in edge analysis mode. Brep and mesh edges are shown in a selected color.
RhinoEmapAnalysisModeId
 Id for Rhino's built-in emap analysis mode. An environment map is shown on sufaces and meshes.
RhinoThicknessAnalysisModeId
 Id for Rhino's built-in thickness analysis mode.
RhinoZebraStripeAnalysisModeId
 Id for Rhino's built-in zebra stripe analysis mode. Zebra stripes are shown on surfaces and meshes.
ShowIsoCurves
 Gets true if this visual analysis mode will show isocuves on shaded surface objects. Often a mode's user interface will provide a way to change this setting.
The default is false.
Style
 Gets the visual analysis mode style.
Top
Methods
Name | Description
DrawBrepObject
 Draws one brep. Override this method to add your custom behavior.
The default implementation does nothing.
DrawCurveObject
 If Style==Wireframe, then the default decomposes the curve object into nurbs curve segments and calls the virtual DrawNurbsCurve for each segment.
DrawMesh
 Draws a mesh.
The default implementation does nothing.
DrawMeshObject
 Draws one mesh. Override this method to add your custom behavior.
The default implementation does nothing.
DrawNurbsCurve
 Draws a NURBS curve. This is a good function to override for analysis modes like curvature hair display.
The default implementation does nothing.
DrawNurbsSurface
 Draws a NURBS surface. This is a good function to override to display object-related meshes.
The default implementation does nothing.
DrawPointCloudObject
 Draws one point cloud. Override this method to add your custom behavior.
The default implementation does nothing.
DrawPointObject
 Draws one point. Override this method to add your custom behavior.
The default implementation does nothing.
EnableUserInterface
 Turns the analysis mode's user interface on and off. For Rhino's built in modes this opens or closes the modeless dialog that controls the analysis mode's display settings.
Find(Guid)
 Finds a visual analysis mode by guid.
Find(Type)
 Finds a visual analysis mode by type.
ObjectSupportsAnalysisMode
 Gets a value indicating if this visual analysis mode can be used on a given Rhino object.
Register
 Registers a custom visual analysis mode for use in Rhino. It is OK to call register multiple times for a single custom analysis mode type, since subsequent register calls will notice that the type has already been registered.
SetUpDisplayAttributes
 If an analysis mode needs to modify display attributes, this is the place to do it. In particular, Style==Texture, then this function must be overridden.
UpdateVertexColors
 If Style==falseColor, then this virtual function must be overridden. Rhino calls this function when it is time for to set the false colors on the analysis mesh vertices. For breps, there is one mesh per face. For mesh objects there is a single mesh.
Top
See Also
Reference
Rhino.Display Namespace