RhinoCommon SDK
LightObject Methods
Rhino for Mac 5.1
The LightObject type exposes the following members.
Methods
Name | Description
DuplicateLightGeometry
Top
See Also
Reference
LightObject Class
Rhino.DocObjects Namespace