RhinoCommon SDK
Curve.Extend Method (Double, Double)
Rhino for Mac 5.1
 Where possible, analytically extends curve to include the given domain. This will not work on closed curves. The original curve will be identical to the restriction of the resulting curve to the original curve domain.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve Extend(
	double t0,
	double t1
)
Public Function Extend (
	t0 As Double,
	t1 As Double
) As Curve
Parameters
t0
Type: System.Double
Start of extension domain, if the start is not inside the Domain of this curve, an attempt will be made to extend the curve.
t1
Type: System.Double
End of extension domain, if the end is not inside the Domain of this curve, an attempt will be made to extend the curve.
Return Value
Type: Curve
Extended curve on success, null on failure.
See Also
Reference
Curve Class
Extend Overload
Rhino.Geometry Namespace