RhinoCommon SDK
Curve.Extend Method (Interval)
Rhino for Mac 5.1
 Where possible, analytically extends curve to include the given domain. This will not work on closed curves. The original curve will be identical to the restriction of the resulting curve to the original curve domain.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve Extend(
	Interval domain
)
Public Function Extend (
	domain As Interval
) As Curve
Parameters
domain
Type: Rhino.Geometry.Interval
Extension domain.
Return Value
Type: Curve
Extended curve on success, null on failure.
See Also
Reference
Curve Class
Extend Overload
Rhino.Geometry Namespace