RhinoCommon SDK
Curve.Extend Method (CurveEnd, Double, CurveExtensionStyle)
Rhino for Mac 5.1
 Extends a curve by a specific length.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve Extend(
	CurveEnd side,
	double length,
	CurveExtensionStyle style
)
Public Function Extend (
	side As CurveEnd,
	length As Double,
	style As CurveExtensionStyle
) As Curve
Parameters
side
Type: Rhino.Geometry.CurveEnd
Curve end to extend.
length
Type: System.Double
Length to add to the curve end.
style
Type: Rhino.Geometry.CurveExtensionStyle
Extension style.
Return Value
Type: Curve
A curve with extended ends or null on failure.
See Also
Reference
Curve Class
Extend Overload
Rhino.Geometry Namespace