RhinoCommon SDK
CurveIntersections.GetEnumerator Method
Rhino for Mac 5.1
 Returns an enumerator that is capable of yielding all IntersectionEvents in the collection.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<IntersectionEvent> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of IntersectionEvent)
Return Value
Type: IEnumerator<IntersectionEvent>
The constructed enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
CurveIntersections Class
Rhino.Geometry.Intersect Namespace