RhinoCommon SDK
BinaryArchiveWriter.WriteRectangleF Method
Rhino for Mac 5.1
 Writes a RectangleF value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteRectangleF(
	RectangleF value
)
Public Sub WriteRectangleF (
	value As RectangleF
)
Parameters
value
Type: System.Drawing.RectangleF
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace