RhinoCommon SDK
NurbsSurface.IsRational Property
Rhino for Mac 5.1
 Gets a value indicating whether or not the nurbs surface is rational.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsRational { get; }
Public ReadOnly Property IsRational As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace