RhinoCommon SDK
RTreeEventArgs Class
Rhino for Mac 5.1
 Represents event data that is passed when when an item that meets certain criteria is found and the passed RTree event is raised.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Geometry.RTreeEventArgs
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class RTreeEventArgs : EventArgs
Public Class RTreeEventArgs
	Inherits EventArgs
The RTreeEventArgs type exposes the following members.
Properties
Name | Description
Cancel
 Gets or sets a value that determines if the search should be conducted farther.
Id
 Gets the identifier of the found item.
IdB
 If search is using two r-trees, IdB is element b in the search.
IdBPtr
 If search is using two r-trees, IdB is the element b pointer in the search.
IdPtr
 Gets the identifier pointer of the found item.
SearchBoundingBox
 Bounding box bounds used during a search. You may modify the box in a search callback to help reduce the bounds to search.
SearchSphere
 Sphere bounds used during a search. You can modify the sphere in a search callback to help reduce the bounds to search.
Tag
 Gets or sets an arbitrary object that can be attached to this event args. This object will "stick" through a single search and can represent user-defined state.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace