RhinoCommon SDK
Hatch Methods
Rhino for Mac 5.1
The Hatch type exposes the following members.
Methods
Name | Description
Create(Curve, Int32, Double, Double)
 Constructs an array of hatches from one curve.
Create(IEnumerable<Curve>, Int32, Double, Double)
 Constructs an array of hatches from a set of curves.
CreateDisplayGeometry
 Generate geometry that would be used to draw the hatch with a given hatch pattern
Explode
 Decomposes the hatch pattern into an array of geometry.
Get3dCurves
 Gets 3d curves that define the boundaries of the hatch
Top
See Also
Reference
Hatch Class
Rhino.Geometry Namespace