RhinoCommon SDK
ViewportInfo.GetSphereDepth Method
Rhino for Mac 5.1
 Gets near and far clipping distances of a bounding sphere.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetSphereDepth(
	Sphere sphere,
	out double nearDistance,
	out double farDistance
)
Public Function GetSphereDepth (
	sphere As Sphere,
	<OutAttribute> ByRef nearDistance As Double,
	<OutAttribute> ByRef farDistance As Double
) As Boolean
Parameters
sphere
Type: Rhino.Geometry.Sphere
The sphere to sample.
nearDistance
Type: System.Double
Near distance of the sphere (can be < 0)
farDistance
Type: System.Double
Far distance of the sphere (can be equal to near_dist)
Return Value
Type: Boolean
true if the sphere intersects the view frustum and near_dist/far_dist were set. false if the sphere does not intesect the view frustum.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace