RhinoCommon SDK
File3dm.DumpToTextLog Method
Rhino for Mac 5.1
Prepares a text dump of the entire model.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DumpToTextLog(
	TextLog log
)
Public Sub DumpToTextLog (
	log As TextLog
)
Parameters
log
Type: Rhino.FileIO.TextLog
[Missing <param name="log"/> documentation for "M:Rhino.FileIO.File3dm.DumpToTextLog(Rhino.FileIO.TextLog)"]
See Also
Reference
File3dm Class
Rhino.FileIO Namespace