RhinoCommon SDK
GetPoint.PermitConstraintOptions Method
Rhino for Mac 5.1
 Control the availability of the built-in linear, planar, curve, and surface constraint options like "Along", "AlongPerp", "AlongTan", "AlongParallel", "Between", "OnCrv", "OnSrf", ".x", ".y", ".z", ".xy", etc.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PermitConstraintOptions(
	bool permit
)
Public Sub PermitConstraintOptions (
	permit As Boolean
)
Parameters
permit
Type: System.Boolean
 if true, then the built-in contraint options are automatically avaiable in GetPoint.
Remarks
 By default, these built-in constraint options are availble unless an explicit constraint is added by calling one of the GetPoint::Constrain functions. Calling GetPoint::ClearConstraints automatically enables the built-in constraint options. The built-in constraint options are never visible on the command line and the user must type the complete option name to activate these options.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace