RhinoCommon SDK
Line.Equality Operator
Rhino for Mac 5.1
 Determines whether two lines have the same value.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator ==(
	Line a,
	Line b
)
Public Shared Operator = (
	a As Line,
	b As Line
) As Boolean
Parameters
a
Type: Rhino.Geometry.Line
A line.
b
Type: Rhino.Geometry.Line
Another line.
Return Value
Type: Boolean
true if a has the same coordinates as b; otherwise false.
See Also
Reference
Line Structure
Rhino.Geometry Namespace