RhinoCommon SDK
Rectangle3d.PointAt Method
Rhino for Mac 5.1
Overload List
Name | Description
PointAt(Double)
 Gets a point along the rectangle boundary.
PointAt(Double, Double)
 Gets a point in Rectangle space.
Top
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace