RhinoCommon SDK
Mesh.CreateBooleanIntersection Method
Rhino for Mac 5.1
 Computes the solid intersection of two sets of meshes.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Mesh[] CreateBooleanIntersection(
	IEnumerable<Mesh> firstSet,
	IEnumerable<Mesh> secondSet
)
Public Shared Function CreateBooleanIntersection (
	firstSet As IEnumerable(Of Mesh),
	secondSet As IEnumerable(Of Mesh)
) As Mesh()
Parameters
firstSet
Type: System.Collections.Generic.IEnumerable<Mesh>
First set of Meshes.
secondSet
Type: System.Collections.Generic.IEnumerable<Mesh>
Second set of Meshes.
Return Value
Type: Mesh[]
An array of Mesh results or null on failure.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace