RhinoCommon SDK
File3dm.Write Method (String, File3dmWriteOptions)
Rhino for Mac 5.1
 Writes contents of this model to an openNURBS archive. I STRONGLY suggested that you call Polish() before calling Write so that your file has all the "fluff" that makes it complete. If the model is not valid, then Write will refuse to write it.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Write(
	string path,
	File3dmWriteOptions options
)
Public Function Write (
	path As String,
	options As File3dmWriteOptions
) As Boolean
Parameters
path
Type: System.String
The file name to use for writing.
options
Type: Rhino.FileIO.File3dmWriteOptions
[Missing <param name="options"/> documentation for "M:Rhino.FileIO.File3dm.Write(System.String,Rhino.FileIO.File3dmWriteOptions)"]
Return Value
Type: Boolean
 true if archive is written with no error. false if errors occur.
See Also
Reference
File3dm Class
Write Overload
Rhino.FileIO Namespace