RhinoCommon SDK
Quaternion.Equals Method (Quaternion)
Rhino for Mac 5.1
 Determines whether this quaternion has the same value of another quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Equals(
	Quaternion other
)
Public Function Equals (
	other As Quaternion
) As Boolean
Parameters
other
Type: Rhino.Geometry.Quaternion
Another quaternion to compare.
Return Value
Type: Boolean
true if the quaternions have exactly equal coefficients; otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Quaternion Structure
Equals Overload
Rhino.Geometry Namespace