RhinoCommon SDK
InstanceReferenceGeometry.ParentIdefId Property
Rhino for Mac 5.1
 The unique id for the parent instance definition of this instance reference.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid ParentIdefId { get; }
Public ReadOnly Property ParentIdefId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
InstanceReferenceGeometry Class
Rhino.Geometry Namespace