RhinoCommon SDK
BinaryArchiveWriter.WriteErrorOccured Property
Rhino for Mac 5.1
 Gets or sets whether an error occurred.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool WriteErrorOccured { get; set; }
Public Property WriteErrorOccured As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace