RhinoCommon SDK
DisplayPipeline.IsOpenGL Property
Rhino for Mac 5.1
 Gets a value indicating whether or not this pipeline is drawing into an OpenGL context.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsOpenGL { get; }
Public ReadOnly Property IsOpenGL As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace