RhinoCommon SDK
StringTable.GetEntryNames Method
Rhino for Mac 5.1
 Return list of all entry names for a given section of user data strings in the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string[] GetEntryNames(
	string section
)
Public Function GetEntryNames (
	section As String
) As String()
Parameters
section
Type: System.String
The section from which to retrieve section names.
Return Value
Type: String[]
An array of section names. This can be empty, but not null.
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace