RhinoCommon SDK
PointCloud.AddRange Method
Rhino for Mac 5.1
 Append a collection of points to this point cloud.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddRange(
	IEnumerable<Point3d> points
)
Public Sub AddRange (
	points As IEnumerable(Of Point3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to append.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace