RhinoCommon SDK
Brep.CreateShell Method
Rhino for Mac 5.1
 Creates a hollowed out shell from a solid Brep. Function only operates on simple, solid, manifold Breps.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep[] CreateShell(
	Brep brep,
	IEnumerable<int> facesToRemove,
	double distance,
	double tolerance
)
Public Shared Function CreateShell (
	brep As Brep,
	facesToRemove As IEnumerable(Of Integer),
	distance As Double,
	tolerance As Double
) As Brep()
Parameters
brep
Type: Rhino.Geometry.Brep
The solid Brep to shell.
facesToRemove
Type: System.Collections.Generic.IEnumerable<Int32>
The indices of the Brep faces to remove. These surfaces are removed and the remainder is offset inward, using the outer parts of the removed surfaces to join the inner and outer parts.
distance
Type: System.Double
The distance, or thickness, for the shell. This is a signed distance value with respect to face normals and flipped faces.
tolerance
Type: System.Double
The offset tolerane. When in doubt, use the document's absolute tolerance.
Return Value
Type: Brep[]
An array of Brep results or null on failure.
See Also
Reference
Brep Class
Rhino.Geometry Namespace