RhinoCommon SDK
Arc Constructor (Plane, Double, Double)
Rhino for Mac 5.1
 Initializes a new arc from a base plane, a radius value and an angle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Arc(
	Plane plane,
	double radius,
	double angleRadians
)
Public Sub New (
	plane As Plane,
	radius As Double,
	angleRadians As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
The plane of the arc (arc center will be located at plane origin)
radius
Type: System.Double
Radius of arc.
angleRadians
Type: System.Double
Sweep angle of arc (in radians)
See Also
Reference
Arc Structure
Arc Overload
Rhino.Geometry Namespace