RhinoCommon SDK
ObjectAttributes.PlotWeightSource Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectAttributes.PlotWeightSource"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectPlotWeightSource PlotWeightSource { get; set; }
Public Property PlotWeightSource As ObjectPlotWeightSource
	Get
	Set
Property Value
Type: ObjectPlotWeightSource
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace