RhinoCommon SDK
Curve.CreateFillet Method
Rhino for Mac 5.1
 Computes the fillet arc for a curve filleting operation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Arc CreateFillet(
	Curve curve0,
	Curve curve1,
	double radius,
	double t0Base,
	double t1Base
)
Public Shared Function CreateFillet (
	curve0 As Curve,
	curve1 As Curve,
	radius As Double,
	t0Base As Double,
	t1Base As Double
) As Arc
Parameters
curve0
Type: Rhino.Geometry.Curve
First curve to fillet.
curve1
Type: Rhino.Geometry.Curve
Second curve to fillet.
radius
Type: System.Double
Fillet radius.
t0Base
Type: System.Double
Parameter on curve0 where the fillet ought to start (approximately).
t1Base
Type: System.Double
Parameter on curve1 where the fillet ought to end (approximately).
Return Value
Type: Arc
The fillet arc on success, or Arc.Unset on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace