RhinoCommon SDK
GetInteger.SetLowerLimit Method
Rhino for Mac 5.1
 Sets a lower limit on the number that can be returned. By default there is no lower limit.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetLowerLimit(
	int lowerLimit,
	bool strictlyGreaterThan
)
Public Sub SetLowerLimit (
	lowerLimit As Integer,
	strictlyGreaterThan As Boolean
)
Parameters
lowerLimit
Type: System.Int32
smallest acceptable number.
strictlyGreaterThan
Type: System.Boolean
 If true, then the returned number will be > lower_limit.
See Also
Reference
GetInteger Class
Rhino.Input.Custom Namespace