RhinoCommon SDK
GetInteger.Number Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetInteger.Number"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Number()
Public Function Number As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetInteger.Number"]
See Also
Reference
GetInteger Class
Rhino.Input.Custom Namespace