RhinoCommon SDK
Interval.Equality Operator
Rhino for Mac 5.1
 Determines whether the two Intervals have equal values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator ==(
	Interval a,
	Interval b
)
Public Shared Operator = (
	a As Interval,
	b As Interval
) As Boolean
Parameters
a
Type: Rhino.Geometry.Interval
The first interval.
b
Type: Rhino.Geometry.Interval
The second interval.
Return Value
Type: Boolean
true if the components of the two intervals are exactly equal; otherwise false.
See Also
Reference
Interval Structure
Rhino.Geometry Namespace