RhinoCommon SDK
GetBaseClass.AddOptionColor Method
Rhino for Mac 5.1
Overload List
Name | Description
AddOptionColor(String, OptionColor)
 Add a command line option to get colors and automatically save the value.
AddOptionColor(LocalizeStringPair, OptionColor)
 Add a command line option to get colors and automatically save the value.
AddOptionColor(String, OptionColor, String)
 Add a command line option to get colors and automatically save the value.
AddOptionColor(LocalizeStringPair, OptionColor, String)
 Add a command line option to get colors and automatically save the value.
Top
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace