RhinoCommon SDK
Box.Contains Method (Box, Boolean)
Rhino for Mac 5.1
 Test a box for Box inclusion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Contains(
	Box box,
	bool strict
)
Public Function Contains (
	box As Box,
	strict As Boolean
) As Boolean
Parameters
box
Type: Rhino.Geometry.Box
Box to test.
strict
Type: System.Boolean
If true, the box needs to be fully on the inside of this Box. I.e. coincident boxes will be considered 'outside'.
Return Value
Type: Boolean
true if the box is (strictly) on the inside of this Box.
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace