RhinoCommon SDK
Box.Contains Method (Point3d)
Rhino for Mac 5.1
 Determines whether a point is included in this box. This is the same as calling Contains(point,false)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Contains(
	Point3d point
)
Public Function Contains (
	point As Point3d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
Point to test.
Return Value
Type: Boolean
true if the point is on the inside of or coincident with this Box.
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace