RhinoCommon SDK
Box.Contains Method (Point3d, Boolean)
Rhino for Mac 5.1
 Determines whether a point is included in this box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Contains(
	Point3d point,
	bool strict
)
Public Function Contains (
	point As Point3d,
	strict As Boolean
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
Point to test.
strict
Type: System.Boolean
If true, the point needs to be fully on the inside of the Box. I.e. coincident points will be considered 'outside'.
Return Value
Type: Boolean
true if the point is (strictly) on the inside of this Box.
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace