RhinoCommon SDK
Box.Contains Method (Box)
Rhino for Mac 5.1
 Test a box for Box inclusion. This is the same as calling Contains(box,false)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Contains(
	Box box
)
Public Function Contains (
	box As Box
) As Boolean
Parameters
box
Type: Rhino.Geometry.Box
Box to test.
Return Value
Type: Boolean
true if the box is on the inside of or coincident with this Box.
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace