RhinoCommon SDK
DisplayPipeline.DrawPoints Method
Rhino for Mac 5.1
Draw a set of points with a given radius, style and color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawPoints(
	IEnumerable<Point3d> points,
	PointStyle style,
	int radius,
	Color color
)
Public Sub DrawPoints (
	points As IEnumerable(Of Point3d),
	style As PointStyle,
	radius As Integer,
	color As Color
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Location of points in world coordinates.
style
Type: Rhino.Display.PointStyle
Point display style.
radius
Type: System.Int32
Point size in pixels.
color
Type: System.Drawing.Color
 Color of points. If style is ControlPoint, this will be the border color.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace