RhinoCommon SDK
MeshVertexList.Remove Method
Rhino for Mac 5.1
Overload List
Name | Description
Remove(IEnumerable<Int32>, Boolean)
 Removes the vertices at the given indices and all faces that reference those vertices.
Remove(Int32, Boolean)
 Removes the vertex at the given index and all faces that reference that index.
Top
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace