RhinoCommon SDK
ReplayHistoryData.TryGetString Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetString(System.Int32,System.String@)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetString(
	int id,
	out string value
)
Public Function TryGetString (
	id As Integer,
	<OutAttribute> ByRef value As String
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetString(System.Int32,System.String@)"]
value
Type: System.String
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetString(System.Int32,System.String@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetString(System.Int32,System.String@)"]
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace