RhinoCommon SDK
HatchPattern.ReadFromFile Method
Rhino for Mac 5.1
 Reads hatch pattern definitions from a file.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static HatchPattern[] ReadFromFile(
	string filename,
	bool quiet
)
Public Shared Function ReadFromFile (
	filename As String,
	quiet As Boolean
) As HatchPattern()
Parameters
filename
Type: System.String
 Name of an existing file. If filename is null or empty, default hatch pattern filename is used.
quiet
Type: System.Boolean
 If file doesn't exist, and quiet is false, an error meesage box is shown.
Return Value
Type: HatchPattern[]
An array of hatch patterns. This can be null, but not empty.
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace