RhinoCommon SDK
Vector3d.GreaterThan Operator
Rhino for Mac 5.1
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector.
Components evaluation priority is first X, then Y, then Z.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator >(
	Vector3d a,
	Vector3d b
)
Public Shared Operator > (
	a As Vector3d,
	b As Vector3d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector3d
The first vector.
b
Type: Rhino.Geometry.Vector3d
The second vector.
Return Value
Type: Boolean
true if a.X is larger than b.X, or a.X == b.X and a.Y is larger than b.Y, or a.X == b.X and a.Y == b.Y and a.Z is larger than b.Z; otherwise, false.
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace