RhinoCommon SDK
BrepFaceList.ExtractFace Method
Rhino for Mac 5.1
 Extracts a face from a Brep.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep ExtractFace(
	int faceIndex
)
Public Function ExtractFace (
	faceIndex As Integer
) As Brep
Parameters
faceIndex
Type: System.Int32
A face index
Return Value
Type: Brep
A brep. This can be null.
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace