RhinoCommon SDK
Point3dGrid Constructor (Int32, Int32)
Rhino for Mac 5.1
 Initializes a rectangular grid of points with a given number of columns and rows.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3dGrid(
	int rows,
	int columns
)
Public Sub New (
	rows As Integer,
	columns As Integer
)
Parameters
rows
Type: System.Int32
An amount of rows.
columns
Type: System.Int32
An amount of columns.
See Also
Reference
Point3dGrid Class
Point3dGrid Overload
Rhino.Geometry Namespace