RhinoCommon SDK
File3dmObjectTable.AddCurve Method (Curve)
Rhino for Mac 5.1
Adds a curve object to the table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddCurve(
	Curve curve
)
Public Function AddCurve (
	curve As Curve
) As Guid
Parameters
curve
Type: Rhino.Geometry.Curve
A curve to add.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddCurve Overload
Rhino.FileIO Namespace