RhinoCommon SDK
StackedDialogPage.OnSizeParent Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.StackedDialogPage.OnSizeParent(System.Int32,System.Int32)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual void OnSizeParent(
	int width,
	int height
)
Public Overridable Sub OnSizeParent (
	width As Integer,
	height As Integer
)
Parameters
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.UI.StackedDialogPage.OnSizeParent(System.Int32,System.Int32)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.UI.StackedDialogPage.OnSizeParent(System.Int32,System.Int32)"]
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace