RhinoCommon SDK
PolyCurve.Append Method (Line)
Rhino for Mac 5.1
 Appends and matches the start of the line to the end of polycurve. This function will fail if the polycurve is closed.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Append(
	Line line
)
Public Function Append (
	line As Line
) As Boolean
Parameters
line
Type: Rhino.Geometry.Line
Line segment to append.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
PolyCurve Class
Append Overload
Rhino.Geometry Namespace