RhinoCommon SDK
PolyCurve.Append Method (Curve)
Rhino for Mac 5.1
 Appends and matches the start of the curve to the end of polycurve. This function will fail if the PolyCurve is closed or if SegmentCount > 0 and the new segment is closed.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Append(
	Curve curve
)
Public Function Append (
	curve As Curve
) As Boolean
Parameters
curve
Type: Rhino.Geometry.Curve
Segment to append.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
PolyCurve Class
Append Overload
Rhino.Geometry Namespace