RhinoCommon SDK
Curve.Simplify Method
Rhino for Mac 5.1
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The Nurbs Curves segments do not have fully multiple interior knots.
 3. Rational Nurbs curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent Colinear or Cocircular segments are combined.
 6. Segments that meet with G1-continuity have there ends tuned up so that they meet with G1-continuity to within machine precision.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve Simplify(
	CurveSimplifyOptions options,
	double distanceTolerance,
	double angleToleranceRadians
)
Public Function Simplify (
	options As CurveSimplifyOptions,
	distanceTolerance As Double,
	angleToleranceRadians As Double
) As Curve
Parameters
options
Type: Rhino.Geometry.CurveSimplifyOptions
Simplification options.
distanceTolerance
Type: System.Double
A distance tolerance for the simplification.
angleToleranceRadians
Type: System.Double
An angle tolerance for the simplification.
Return Value
Type: Curve
New simplified curve on success, null on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace