RhinoCommon SDK
UndoRedoEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Commands.UndoRedoEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Commands.UndoRedoEventArgs
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class UndoRedoEventArgs : EventArgs
Public Class UndoRedoEventArgs
	Inherits EventArgs
The UndoRedoEventArgs type exposes the following members.
Properties
Name | Description
CommandId
IsBeginRecording
IsBeginRedo
IsBeginUndo
IsEndRecording
IsEndRedo
IsEndUndo
IsPurgeRecord
UndoSerialNumber
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Commands Namespace