RhinoCommon SDK
Extrusion.Profile3d Method
Rhino for Mac 5.1
Overload List
Name | Description
Profile3d(ComponentIndex)
 Gets one of the profiles.
Profile3d(Int32, Double)
 Gets a transversal isocurve of the extruded profile.
Top
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace