RhinoCommon SDK
Quaternion.IsScalar Property
Rhino for Mac 5.1
 true if b, c, and d are all zero.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsScalar { get; }
Public ReadOnly Property IsScalar As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace