RhinoCommon SDK
Brep.DuplicateBrep Method
Rhino for Mac 5.1
 Same as Duplicate(), but already performs a cast to a brep.
This cast always succeeds.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep DuplicateBrep()
Public Function DuplicateBrep As Brep
Return Value
Type: Brep
A brep.
See Also
Reference
Brep Class
Rhino.Geometry Namespace