RhinoCommon SDK
ViewportInfo.ZoomToScreenRect Method (Int32, Int32, Int32, Int32)
Rhino for Mac 5.1
 Zooms to a screen zone.
View changing from screen input points. Handy for using a mouse to manipulate a view. ZoomToScreenRect() may change camera and frustum settings.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ZoomToScreenRect(
	int left,
	int top,
	int right,
	int bottom
)
Public Function ZoomToScreenRect (
	left As Integer,
	top As Integer,
	right As Integer,
	bottom As Integer
) As Boolean
Parameters
left
Type: System.Int32
Screen coord.
top
Type: System.Int32
Screen coord.
right
Type: System.Int32
Screen coord.
bottom
Type: System.Int32
Screen coord.
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
ZoomToScreenRect Overload
Rhino.DocObjects Namespace