RhinoCommon SDK
File3dmObjectTable.AddLine Method (Point3d, Point3d)
Rhino for Mac 5.1
Adds a line object to Rhino.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddLine(
	Point3d from,
	Point3d to
)
Public Function AddLine (
	from As Point3d,
	to As Point3d
) As Guid
Parameters
from
Type: Rhino.Geometry.Point3d
A line start point.
to
Type: Rhino.Geometry.Point3d
A line end point.
Return Value
Type: Guid
A unique identifier of new rhino object.
See Also
Reference
File3dmObjectTable Class
AddLine Overload
Rhino.FileIO Namespace