RhinoCommon SDK
NamedViewTable.Item Property
Rhino for Mac 5.1
 Conceptually, the named view table is an array of ViewInfo and their associated names. The indexing operator ([] in C#) can be used to get individual ViewInfo items.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ViewInfo this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As ViewInfo
	Get
Parameters
index
Type: System.Int32
Zero based array index.
Return Value
Type: ViewInfo
The view that was found.
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace