RhinoCommon SDK
GripsDrawEventArgs.GripStatusCount Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripsDrawEventArgs.GripStatusCount"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int GripStatusCount { get; }
Public ReadOnly Property GripStatusCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace