RhinoCommon SDK
CustomDisplay.AddPoint Method (Point3d)
Rhino for Mac 5.1
 Adds a new, black point to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddPoint(
	Point3d point
)
Public Sub AddPoint (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to add.
See Also
Reference
CustomDisplay Class
AddPoint Overload
Rhino.Display Namespace