RhinoCommon SDK
Cone.AngleInRadians Method
Rhino for Mac 5.1
 Computes the angle (in radians) between the axis and the side of the cone. The angle and the height have the same sign.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double AngleInRadians()
Public Function AngleInRadians As Double
Return Value
Type: Double
Math.Atan(Radius / Height) if the height is not 0; 0 if the radius is 0; Math.PI otherwise.
See Also
Reference
Cone Structure
Rhino.Geometry Namespace