RhinoCommon SDK
RenderPlugIn.Render Method
Rhino for Mac 5.1
 Called by Render and RenderPreview commands if this plug-in is set as the default render engine.
Namespace: Rhino.PlugIns
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected abstract Result Render(
	RhinoDoc doc,
	RunMode mode,
	bool fastPreview
)
Protected MustOverride Function Render (
	doc As RhinoDoc,
	mode As RunMode,
	fastPreview As Boolean
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
A document.
mode
Type: Rhino.Commands.RunMode
A command running mode.
fastPreview
Type: System.Boolean
If true, lower quality faster render expected.
Return Value
Type: Result
If true, then the renderer is reuired to construct a rapid preview and not the high-quality final result.
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace