RhinoCommon SDK
HistoryRecord.SetMesh Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetMesh(System.Int32,Rhino.Geometry.Mesh)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetMesh(
	int id,
	Mesh value
)
Public Function SetMesh (
	id As Integer,
	value As Mesh
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetMesh(System.Int32,Rhino.Geometry.Mesh)"]
value
Type: Rhino.Geometry.Mesh
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetMesh(System.Int32,Rhino.Geometry.Mesh)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetMesh(System.Int32,Rhino.Geometry.Mesh)"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace