RhinoCommon SDK
Surface.IsCone Method (Double)
Rhino for Mac 5.1
Determines if the surface is a portion of a cone within a given tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsCone(
	double tolerance
)
Public Function IsCone (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the surface is a portion of a cone.
See Also
Reference
Surface Class
IsCone Overload
Rhino.Geometry Namespace