RhinoCommon SDK
IStackedDialogPageService.SelectedObjects Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjects(Rhino.UI.ObjectPropertiesPage)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
RhinoObject[] SelectedObjects(
	ObjectPropertiesPage page
)
Function SelectedObjects (
	page As ObjectPropertiesPage
) As RhinoObject()
Parameters
page
Type: Rhino.UI.ObjectPropertiesPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjects(Rhino.UI.ObjectPropertiesPage)"]
Return Value
Type: RhinoObject[]
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjects(Rhino.UI.ObjectPropertiesPage)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace