RhinoCommon SDK
RhinoViewport.GetFrustumNearPlane Method
Rhino for Mac 5.1
Get near clipping plane.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetFrustumNearPlane(
	out Plane plane
)
Public Function GetFrustumNearPlane (
	<OutAttribute> ByRef plane As Plane
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
 near clipping plane if camera and frustum are valid. The plane's frame is the same as the camera's frame. The origin is located at the intersection of the camera direction ray and the near clipping plane.
Return Value
Type: Boolean
 true if camera and frustum are valid.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace