RhinoCommon SDK
MeshVertexList.Show Method
Rhino for Mac 5.1
 Shows the vertex at the given index.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Show(
	int vertexIndex
)
Public Sub Show (
	vertexIndex As Integer
)
Parameters
vertexIndex
Type: System.Int32
Index of vertex to show.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace