RhinoCommon SDK
MouseCursor Properties
Rhino for Mac 5.1
The MouseCursor type exposes the following members.
Properties
Name | Description
Location
 Retrieves the position of the mouse cursor, in screen coordinates
Top
See Also
Reference
MouseCursor Class
Rhino.UI Namespace