RhinoCommon SDK
InstanceDefinitionTable.ModifyGeometry Method (Int32, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
Rhino for Mac 5.1
 Modifies the instance definition geometry and replaces all references to the current definition with references to the new definition.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ModifyGeometry(
	int idefIndex,
	IEnumerable<GeometryBase> newGeometry,
	IEnumerable<ObjectAttributes> newAttributes
)
Public Function ModifyGeometry (
	idefIndex As Integer,
	newGeometry As IEnumerable(Of GeometryBase),
	newAttributes As IEnumerable(Of ObjectAttributes)
) As Boolean
Parameters
idefIndex
Type: System.Int32
The index of the instance definition to be modified.
newGeometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
The new geometry.
newAttributes
Type: System.Collections.Generic.IEnumerable<ObjectAttributes>
The new attributes.
Return Value
Type: Boolean
true if operation succeeded.
See Also
Reference
InstanceDefinitionTable Class
ModifyGeometry Overload
Rhino.DocObjects.Tables Namespace