RhinoCommon SDK
RhinoView.ClientRectangle Property
Rhino for Mac 5.1
 Gets the rectangle that represents the client area of the view.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Rectangle ClientRectangle { get; }
Public ReadOnly Property ClientRectangle As Rectangle
	Get
Property Value
Type: Rectangle
See Also
Reference
RhinoView Class
Rhino.Display Namespace