RhinoCommon SDK
GumballDisplayConduit.TotalTransform Property
Rhino for Mac 5.1
 The total transformation is GumballTransform * PreTransform.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform TotalTransform { get; }
Public ReadOnly Property TotalTransform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace