RhinoCommon SDK
MeshFaceNormalList Class
Rhino for Mac 5.1
 Provides access to the Face normals of a Mesh.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.MeshFaceNormalList
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MeshFaceNormalList : IEnumerable<Vector3f>,
	IEnumerable
Public Class MeshFaceNormalList
	Implements IEnumerable(Of Vector3f), IEnumerable
The MeshFaceNormalList type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of mesh face normals.
Item
 Gets or sets the face normal at the given face index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
Methods
Name | Description
AddFaceNormal(Vector3d)
 Appends a face normal to the list of mesh face normals.
AddFaceNormal(Vector3f)
 Appends a face normal to the list of mesh face normals.
AddFaceNormal(Double, Double, Double)
 Appends a face normal to the list of mesh face normals.
AddFaceNormal(Single, Single, Single)
 Appends a face normal to the list of mesh face normals.
Clear
 Clears the Face Normal list on the mesh.
ComputeFaceNormals
 Computes all the face normals for this mesh based on the physical shape of the mesh.
GetEnumerator
 Gets an enumerator that yields all normals in this collection.
SetFaceNormal(Int32, Vector3d)
 Sets a face normal vector at an index using a single-precision vector.
SetFaceNormal(Int32, Vector3f)
 Sets a face normal vector at an index using a single-precision vector.
SetFaceNormal(Int32, Double, Double, Double)
 Sets a face normal vector at an index using three double-precision numbers.
SetFaceNormal(Int32, Single, Single, Single)
 Sets a face normal vector at an index using three single-precision numbers.
UnitizeFaceNormals
 Unitizes all the existing face normals.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace