RhinoCommon SDK
Curve.TryGetPolyline Method (Polyline)
Rhino for Mac 5.1
 Several types of Curve can have the form of a polyline including a degree 1 NurbsCurve, a PolylineCurve, and a PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetPolyline(
	out Polyline polyline
)
Public Function TryGetPolyline (
	<OutAttribute> ByRef polyline As Polyline
) As Boolean
Parameters
polyline
Type: Rhino.Geometry.Polyline
 If true is returned, then the polyline form is returned here.
Return Value
Type: Boolean
true if this curve can be represented as a polyline; otherwise, false.
See Also
Reference
Curve Class
TryGetPolyline Overload
Rhino.Geometry Namespace