RhinoCommon SDK
Brep.CullUnused3dCurves Method
Rhino for Mac 5.1
Culls 2d curves not referenced by a trim.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool CullUnused3dCurves()
Public Function CullUnused3dCurves As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace