RhinoCommon SDK
Brep.Join Method
Rhino for Mac 5.1
 If any edges of this brep overlap edges of otherBrep, merge a copy of otherBrep into this brep joining all edges that overlap within tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Join(
	Brep otherBrep,
	double tolerance,
	bool compact
)
Public Function Join (
	otherBrep As Brep,
	tolerance As Double,
	compact As Boolean
) As Boolean
Parameters
otherBrep
Type: Rhino.Geometry.Brep
Brep to be added to this brep.
tolerance
Type: System.Double
3d distance tolerance for detecting overlapping edges.
compact
Type: System.Boolean
if true, set brep flags and tolerances, remove unused faces and edges.
Return Value
Type: Boolean
true if any edges were joined.
Remarks
 if no edges overlap, this brep is unchanged. otherBrep is copied if it is merged with this, and otherBrep is always unchanged Use this to join a list of breps in a series. When joining multiple breps in series, compact should be set to false. Call compact on the last Join.
See Also
Reference
Brep Class
Rhino.Geometry Namespace