RhinoCommon SDK
MeshTextureCoordinateList Properties
Rhino for Mac 5.1
The MeshTextureCoordinateList type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of texture coordinates.
Item
 Gets or sets the texture coordinate at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace