RhinoCommon SDK
AreaMassProperties.Compute Method (Surface)
Rhino for Mac 5.1
 Computes an AreaMassProperties for a surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static AreaMassProperties Compute(
	Surface surface
)
Public Shared Function Compute (
	surface As Surface
) As AreaMassProperties
Parameters
surface
Type: Rhino.Geometry.Surface
Surface to measure.
Return Value
Type: AreaMassProperties
The AreaMassProperties for the given Surface or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When surface is null.
See Also
Reference
AreaMassProperties Class
Compute Overload
Rhino.Geometry Namespace