RhinoCommon SDK
AreaMassProperties.Compute Method (Curve, Double)
Rhino for Mac 5.1
 Computes an AreaMassProperties for a closed planar curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static AreaMassProperties Compute(
	Curve closedPlanarCurve,
	double planarTolerance
)
Public Shared Function Compute (
	closedPlanarCurve As Curve,
	planarTolerance As Double
) As AreaMassProperties
Parameters
closedPlanarCurve
Type: Rhino.Geometry.Curve
Curve to measure.
planarTolerance
Type: System.Double
absolute tolerance used to insure the closed curve is planar
Return Value
Type: AreaMassProperties
The AreaMassProperties for the given curve or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When closedPlanarCurve is null.
See Also
Reference
AreaMassProperties Class
Compute Overload
Rhino.Geometry Namespace