RhinoCommon SDK
AreaMassProperties.Compute Method (Curve)
Rhino for Mac 5.1
 Computes an AreaMassProperties for a closed planar curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static AreaMassProperties Compute(
	Curve closedPlanarCurve
)
Public Shared Function Compute (
	closedPlanarCurve As Curve
) As AreaMassProperties
Parameters
closedPlanarCurve
Type: Rhino.Geometry.Curve
Curve to measure.
Return Value
Type: AreaMassProperties
The AreaMassProperties for the given curve or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When closedPlanarCurve is null.
See Also
Reference
AreaMassProperties Class
Compute Overload
Rhino.Geometry Namespace