RhinoCommon SDK
AreaMassProperties.Compute Method (Hatch)
Rhino for Mac 5.1
 Computes an AreaMassProperties for a hatch.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static AreaMassProperties Compute(
	Hatch hatch
)
Public Shared Function Compute (
	hatch As Hatch
) As AreaMassProperties
Parameters
hatch
Type: Rhino.Geometry.Hatch
Hatch to measure.
Return Value
Type: AreaMassProperties
The AreaMassProperties for the given hatch or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When hatch is null.
See Also
Reference
AreaMassProperties Class
Compute Overload
Rhino.Geometry Namespace