RhinoCommon SDK
AreaMassProperties.Compute Method (IEnumerable<GeometryBase>)
Rhino for Mac 5.1
 Computes the Area properties for a collection of geometric objects. At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static AreaMassProperties Compute(
	IEnumerable<GeometryBase> geometry
)
Public Shared Function Compute (
	geometry As IEnumerable(Of GeometryBase)
) As AreaMassProperties
Parameters
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
Objects to include in the area computation.
Return Value
Type: AreaMassProperties
The Area properties for the entire collection or null on failure.
See Also
Reference
AreaMassProperties Class
Compute Overload
Rhino.Geometry Namespace