RhinoCommon SDK
AreaMassProperties.Compute Method (Mesh)
Rhino for Mac 5.1
 Computes an AreaMassProperties for a mesh.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static AreaMassProperties Compute(
	Mesh mesh
)
Public Shared Function Compute (
	mesh As Mesh
) As AreaMassProperties
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to measure.
Return Value
Type: AreaMassProperties
The AreaMassProperties for the given Mesh or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When mesh is null.
See Also
Reference
AreaMassProperties Class
Compute Overload
Rhino.Geometry Namespace