RhinoCommon SDK
Material.CommitChanges Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.CommitChanges"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool CommitChanges()
Public Function CommitChanges As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.CommitChanges"]
See Also
Reference
Material Class
Rhino.DocObjects Namespace