RhinoCommon SDK
Vector3d.IsPerpendicularTo Method (Vector3d, Double)
Rhino for Mac 5.1
 Determines whether this vector is perpendicular to another vector, within a provided angle tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsPerpendicularTo(
	Vector3d other,
	double angleTolerance
)
Public Function IsPerpendicularTo (
	other As Vector3d,
	angleTolerance As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.Vector3d
Vector to use for comparison.
angleTolerance
Type: System.Double
Angle tolerance (in radians).
Return Value
Type: Boolean
true if vectors form Pi-radians (90-degree) angles with each other; otherwise false.
See Also
Reference
Vector3d Structure
IsPerpendicularTo Overload
Rhino.Geometry Namespace