RhinoCommon SDK
GetObject.ObjectsWerePreselected Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetObject.ObjectsWerePreselected"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ObjectsWerePreselected { get; }
Public ReadOnly Property ObjectsWerePreselected As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace