RhinoCommon SDK
NurbsSurfaceKnotList.Item Property
Rhino for Mac 5.1
 Gets or sets the knot vector value at the given index.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Double
	Get
	Set
Parameters
index
Type: System.Int32
Index of knot to access.
Return Value
Type: Double
The knot value at [index]
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace