RhinoCommon SDK
File3dm.Layers Property
Rhino for Mac 5.1
 Layers in this file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IList<Layer> Layers { get; }
Public ReadOnly Property Layers As IList(Of Layer)
	Get
Property Value
Type: IList<Layer>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace