RhinoCommon SDK
Interval.Swap Method
Rhino for Mac 5.1
 Exchanges T0 and T1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Swap()
Public Sub Swap
See Also
Reference
Interval Structure
Rhino.Geometry Namespace