RhinoCommon SDK
HatchPattern Constructor
Rhino for Mac 5.1
Overload List
Name | Description
HatchPattern()
Initializes a new instance of the HatchPattern class
HatchPattern(SerializationInfo, StreamingContext)
Initializes a new instance of the HatchPattern class
Top
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace