RhinoCommon SDK
RhinoObject.CreateMeshes Method
Rhino for Mac 5.1
 Create meshes used to render and analyze surface and polysrf objects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual int CreateMeshes(
	MeshType meshType,
	MeshingParameters parameters,
	bool ignoreCustomParameters
)
Public Overridable Function CreateMeshes (
	meshType As MeshType,
	parameters As MeshingParameters,
	ignoreCustomParameters As Boolean
) As Integer
Parameters
meshType
Type: Rhino.Geometry.MeshType
type of meshes to create
parameters
Type: Rhino.Geometry.MeshingParameters
 in parameters that control the quality of the meshes that are created
ignoreCustomParameters
Type: System.Boolean
 Default should be false. Should the object ignore any custom meshing parameters on the object's attributes
Return Value
Type: Int32
number of meshes created
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace