RhinoCommon SDK
Interval.T0 Property
Rhino for Mac 5.1
 Gets or sets the lower bound of the Interval.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double T0 { get; set; }
Public Property T0 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Interval Structure
Rhino.Geometry Namespace