RhinoCommon SDK
BrepLoop.Trims Property
Rhino for Mac 5.1
 List of trims for this loop
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepTrimList Trims { get; }
Public ReadOnly Property Trims As BrepTrimList
	Get
Property Value
Type: BrepTrimList
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace