RhinoCommon SDK
RhinoViewport.IsVisible Method (Point3d)
Rhino for Mac 5.1
 Deterines if a world coordinate point is visible in the viewing frustum.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsVisible(
	Point3d point
)
Public Function IsVisible (
	point As Point3d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
A point that is tested for visibility.
Return Value
Type: Boolean
true if the point is visible; otherwise false.
See Also
Reference
RhinoViewport Class
IsVisible Overload
Rhino.Display Namespace