RhinoCommon SDK
BinaryArchiveWriter.WriteTransform Method
Rhino for Mac 5.1
 Writes a Transform value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteTransform(
	Transform value
)
Public Sub WriteTransform (
	value As Transform
)
Parameters
value
Type: Rhino.Geometry.Transform
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace