RhinoCommon SDK
ToolbarFile.GetGroup Method (Int32)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFile.GetGroup(System.Int32)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ToolbarGroup GetGroup(
	int index
)
Public Function GetGroup (
	index As Integer
) As ToolbarGroup
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.ToolbarFile.GetGroup(System.Int32)"]
Return Value
Type: ToolbarGroup
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFile.GetGroup(System.Int32)"]
See Also
Reference
ToolbarFile Class
GetGroup Overload
Rhino.UI Namespace