RhinoCommon SDK
SweepOneRail.SetToRoadlikeTop Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.SetToRoadlikeTop"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetToRoadlikeTop()
Public Sub SetToRoadlikeTop
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace