RhinoCommon SDK
GetPoint.DynamicDrawColor Property
Rhino for Mac 5.1
 Color used by CRhinoGetPoint::DynamicDraw to draw the current point and the line from the base point to the current point.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color DynamicDrawColor { get; set; }
Public Property DynamicDrawColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace