RhinoCommon SDK
RhinoViewport.GetScreenPort Method
Rhino for Mac 5.1
 Location of viewport in pixels. These are provided so you can set the port you are using and get the appropriate transformations to and from screen space.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetScreenPort(
	out int portLeft,
	out int portRight,
	out int portBottom,
	out int portTop,
	out int portNear,
	out int portFar
)
Public Function GetScreenPort (
	<OutAttribute> ByRef portLeft As Integer,
	<OutAttribute> ByRef portRight As Integer,
	<OutAttribute> ByRef portBottom As Integer,
	<OutAttribute> ByRef portTop As Integer,
	<OutAttribute> ByRef portNear As Integer,
	<OutAttribute> ByRef portFar As Integer
) As Boolean
Parameters
portLeft
Type: System.Int32
portLeft != portRight.
portRight
Type: System.Int32
portLeft != portRight.
portBottom
Type: System.Int32
portTop != portBottom.
portTop
Type: System.Int32
portTop != portBottom.
portNear
Type: System.Int32
The viewport near value.
portFar
Type: System.Int32
The viewport far value.
Return Value
Type: Boolean
true if the operation is successful.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace