RhinoCommon SDK
ObjectAttributes.ComputedPlotWeight Method
Rhino for Mac 5.1
Overload List
Name | Description
ComputedPlotWeight(RhinoDoc)
ComputedPlotWeight(RhinoDoc, Guid)
Top
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace