RhinoCommon SDK
Rectangle3d.Y Property
Rhino for Mac 5.1
 Gets or sets the dimensions of the rectangle along the base plane Y-Axis (i.e. the height).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interval Y { get; set; }
Public Property Y As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace