RhinoCommon SDK
Curve.PointAtNormalizedLength Method
Rhino for Mac 5.1
 Gets a point at a certain normalized length along the curve. The length must be between or including 0.0 and 1.0, where 0.0 equals the start of the curve and 1.0 equals the end of the curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAtNormalizedLength(
	double length
)
Public Function PointAtNormalizedLength (
	length As Double
) As Point3d
Parameters
length
Type: System.Double
Normalized length along the curve between the start point and the returned point.
Return Value
Type: Point3d
Point on the curve at the specified normalized length from the start point or Poin3d.Unset on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace