RhinoCommon SDK
Point3dList Constructor (IEnumerable<Point3d>)
Rhino for Mac 5.1
 Initializes a new point list by copying the values from another set.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3dList(
	IEnumerable<Point3d> collection
)
Public Sub New (
	collection As IEnumerable(Of Point3d)
)
Parameters
collection
Type: System.Collections.Generic.IEnumerable<Point3d>
The collection to copy from.
See Also
Reference
Point3dList Class
Point3dList Overload
Rhino.Collections Namespace