RhinoCommon SDK
Point3dList Constructor (Point3d[])
Rhino for Mac 5.1
 Constructs a new point list from values in a point array.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3dList(
	params Point3d[] initialPoints
)
Public Sub New (
	ParamArray initialPoints As Point3d()
)
Parameters
initialPoints
Type: Rhino.Geometry.Point3d[]
Points to add to the list.
See Also
Reference
Point3dList Class
Point3dList Overload
Rhino.Collections Namespace