RhinoCommon SDK
RhinoViewport Constructor
Rhino for Mac 5.1
Initializes a new instance of the RhinoViewport class
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoViewport()
Public Sub New
See Also
Reference
RhinoViewport Class
RhinoViewport Overload
Rhino.Display Namespace