RhinoCommon SDK
NurbsCurve.GrevilleParameter Method
Rhino for Mac 5.1
 Gets the greville (edit point) parameter that belongs to the control point at the specified index.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double GrevilleParameter(
	int index
)
Public Function GrevilleParameter (
	index As Integer
) As Double
Parameters
index
Type: System.Int32
Index of Greville (Edit) point.
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurve.GrevilleParameter(System.Int32)"]
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace