RhinoCommon SDK
ObjectAttributes.RemoveFromGroup Method
Rhino for Mac 5.1
 removes object from the group with specified index.
If the object is not in the group, nothing is changed.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void RemoveFromGroup(
	int groupIndex
)
Public Sub RemoveFromGroup (
	groupIndex As Integer
)
Parameters
groupIndex
Type: System.Int32
The index that will be removed.
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace