RhinoCommon SDK
Brep.CreateFromCylinder Method
Rhino for Mac 5.1
 Constructs a Brep definition of a cylinder.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep CreateFromCylinder(
	Cylinder cylinder,
	bool capBottom,
	bool capTop
)
Public Shared Function CreateFromCylinder (
	cylinder As Cylinder,
	capBottom As Boolean,
	capTop As Boolean
) As Brep
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
cylinder.IsFinite() must be true.
capBottom
Type: System.Boolean
if true end at cylinder.m_height[0] should be capped.
capTop
Type: System.Boolean
if true end at cylinder.m_height[1] should be capped.
Return Value
Type: Brep
 A Brep representation of the cylinder with a single face for the cylinder, an edge along the cylinder seam, and vertices at the bottom and top ends of this seam edge. The optional bottom/top caps are single faces with one circular edge starting and ending at the bottom/top vertex.
See Also
Reference
Brep Class
Rhino.Geometry Namespace