RhinoCommon SDK
PointCloud.Insert Method (Int32, Point3d, Vector3d, Color)
Rhino for Mac 5.1
 Inserts a new point into the point list.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Insert(
	int index,
	Point3d point,
	Vector3d normal,
	Color color
)
Public Sub Insert (
	index As Integer,
	point As Point3d,
	normal As Vector3d,
	color As Color
)
Parameters
index
Type: System.Int32
Insertion index.
point
Type: Rhino.Geometry.Point3d
Point to append.
normal
Type: Rhino.Geometry.Vector3d
Normal vector of new point.
color
Type: System.Drawing.Color
Color of new point.
See Also
Reference
PointCloud Class
Insert Overload
Rhino.Geometry Namespace