RhinoCommon SDK
MeshVertexNormalList.Add Method (Vector3d)
Rhino for Mac 5.1
 Adds a new vertex normal at the end of the list.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	Vector3d normal
)
Public Function Add (
	normal As Vector3d
) As Integer
Parameters
normal
Type: Rhino.Geometry.Vector3d
new vertex normal.
Return Value
Type: Int32
The index of the newly added vertex normal.
See Also
Reference
MeshVertexNormalList Class
Add Overload
Rhino.Geometry.Collections Namespace