RhinoCommon SDK
Layer Properties
Rhino for Mac 5.1
The Layer type exposes the following members.
Properties
Name | Description
Color
 Gets or sets the display color for this layer.
FullPath
 Gets the full path to this layer. The full path includes nesting information.
Id
 Gets or sets the ID of this layer object. You typically do not need to assign a custom ID.
IgesLevel
 Gets or sets the IGES level for this layer.
IsDeleted
 Gets a value indicating whether this layer has been deleted and is currently in the Undo buffer.
IsExpanded
 Gets or sets a value indicating whether this layer is expanded in the Rhino Layer dialog.
IsLocked
 Gets or sets a value indicating the locked state of this layer.
IsReference
 Gets a value indicting whether this layer is a referenced layer. Referenced layers are part of referenced documents.
IsVisible
 Gets or sets the visibility of this layer.
LayerIndex
 Gets or sets the index of this layer.
LinetypeIndex
 Gets or sets the line-type index for this layer.
Name
Gets or sets the name of this layer.
ParentLayerId
 Gets the ID of the parent layer. Layers can be origanized in a hierarchical structure, in which case this returns the parent layer ID. If the layer has no parent, Guid.Empty will be returned.
PlotColor
 Gets or sets the plot color for this layer.
PlotWeight
 Gets or sets the thickness of the plotting pen in millimeters. A thickness of 0.0 indicates the "default" pen weight should be used.
RenderMaterialIndex
 Gets or sets the index of render material for objects on this layer that have MaterialSource() == MaterialFromLayer. A material index of -1 indicates no material has been assigned and the material created by the default Material constructor should be used.
SortIndex
 Runtime index used to sort layers in layer dialog.
UserStringCount
 Gets the amount of user strings.
Top
See Also
Reference
Layer Class
Rhino.DocObjects Namespace