RhinoCommon SDK
MaterialRefs.Create Method
Rhino for Mac 5.1
 Call this method to create a MaterialRef which can be used when calling one of the Add methods.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MaterialRef Create(
	MaterialRefCreateParams createParams
)
Public Function Create (
	createParams As MaterialRefCreateParams
) As MaterialRef
Parameters
createParams
Type: Rhino.DocObjects.MaterialRefCreateParams
 Values used to initialize the MaterialRef
Return Value
Type: MaterialRef
 A temporary MaterialRef object, the caller is responsible for disposing of this object.
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace