RhinoCommon SDK
Curve.JoinCurves Method (IEnumerable<Curve>)
Rhino for Mac 5.1
 Joins a collection of curve segments together.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] JoinCurves(
	IEnumerable<Curve> inputCurves
)
Public Shared Function JoinCurves (
	inputCurves As IEnumerable(Of Curve)
) As Curve()
Parameters
inputCurves
Type: System.Collections.Generic.IEnumerable<Curve>
Curve segments to join.
Return Value
Type: Curve[]
An array of curves which contains.
See Also
Reference
Curve Class
JoinCurves Overload
Rhino.Geometry Namespace