RhinoCommon SDK
Rectangle3d Structure
Rhino for Mac 5.1
 Represents the values of a plane and two intervals that form an oriented rectangle in three dimensions.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct Rectangle3d : IEpsilonComparable<Rectangle3d>
<SerializableAttribute>
Public Structure Rectangle3d
	Implements IEpsilonComparable(Of Rectangle3d)
The Rectangle3d type exposes the following members.
Constructors
Name | Description
Rectangle3d(Plane, Interval, Interval)
 Initializes a new rectangle from dimensions.
Rectangle3d(Plane, Point3d, Point3d)
 Initializes a new rectangle from a base plane and two corner points.
Rectangle3d(Plane, Double, Double)
 Initializes a new rectangle from width and height.
Top
Properties
Name | Description
Area
 Gets the unsigned Area of the rectangle.
BoundingBox
 Gets the world aligned boundingbox for this rectangle.
Center
 Gets the point in the center of the rectangle.
Circumference
 Gets the circumference of the rectangle.
Height
 Gets the signed height of the rectangle. If the Y dimension is decreasing, the height will be negative.
IsValid
 Gets a value indicating whether or not this is a valid rectangle. A rectangle is considered to be valid when the base plane and both dimensions are valid.
Plane
 Gets or sets the base plane of the rectangle.
Unset
 Gets a rectangle with Unset components.
Width
 Gets the signed width of the rectangle. If the X dimension is decreasing, the width will be negative.
X
 Gets or sets the dimensions of the rectangle along the base plane X-Axis (i.e. the width).
Y
 Gets or sets the dimensions of the rectangle along the base plane Y-Axis (i.e. the height).
Top
Methods
Name | Description
ClosestPoint(Point3d)
 Gets the point on the rectangle that is closest to a test-point.
ClosestPoint(Point3d, Boolean)
 Gets the point on the rectangle that is closest to a test-point.
Contains(Point3d)
 Determines if a point is included in this rectangle.
Contains(Double, Double)
 Determines if two plane parameters are included in this rectangle.
Corner
 Gets the corner at the given index.
CreateFromPolyline(IEnumerable<Point3d>)
 Attempts to create a rectangle from a polyline. In order for the polyline to qualify as a rectangle, it must have 4 or 5 corner points (i.e. it need not be closed).
CreateFromPolyline(IEnumerable<Point3d>, Double, Double)
 Attempts to create a Rectangle from a Polyline. In order for a polyline to qualify as a rectangle, it must have 4 or 5 corner points (i.e. it need not be closed).
This overload also returns deviations.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
MakeIncreasing
 Ensures the X and Y dimensions are increasing or singleton intervals.
PointAt(Double)
 Gets a point along the rectangle boundary.
PointAt(Double, Double)
 Gets a point in Rectangle space.
RecenterPlane(Int32)
 Recenters the base plane on one of the corners.
RecenterPlane(Point3d)
 Recenters the base plane on a new origin.
ToNurbsCurve
 Constructs a nurbs curve representation of this rectangle.
ToPolyline
 Constructs a polyline from this rectangle.
Transform
 Transforms this rectangle. Note that rectangles cannot be skewed or tapered.
Top
See Also
Reference
Rhino.Geometry Namespace