RhinoCommon SDK
BinaryArchiveFile Properties
Rhino for Mac 5.1
The BinaryArchiveFile type exposes the following members.
Properties
Name | Description
Reader
Writer
Top
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace