RhinoCommon SDK
HistoryRecord.SetColors Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetColors(System.Int32,System.Collections.Generic.IEnumerable{System.Drawing.Color})"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetColors(
	int id,
	IEnumerable<Color> values
)
Public Function SetColors (
	id As Integer,
	values As IEnumerable(Of Color)
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetColors(System.Int32,System.Collections.Generic.IEnumerable{System.Drawing.Color})"]
values
Type: System.Collections.Generic.IEnumerable<Color>
[Missing <param name="values"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetColors(System.Int32,System.Collections.Generic.IEnumerable{System.Drawing.Color})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetColors(System.Int32,System.Collections.Generic.IEnumerable{System.Drawing.Color})"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace