RhinoCommon SDK
Curve.TryGetEllipse Method (Plane, Ellipse)
Rhino for Mac 5.1
 Try to convert this curve into an Ellipse within RhinoMath.ZeroTolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetEllipse(
	Plane plane,
	out Ellipse ellipse
)
Public Function TryGetEllipse (
	plane As Plane,
	<OutAttribute> ByRef ellipse As Ellipse
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
Plane in which the comparison is performed.
ellipse
Type: Rhino.Geometry.Ellipse
On success, the Ellipse will be filled in.
Return Value
Type: Boolean
true if the curve could be converted into an Ellipse within the given plane.
See Also
Reference
Curve Class
TryGetEllipse Overload
Rhino.Geometry Namespace