RhinoCommon SDK
Curve.CreateBooleanIntersection Method
Rhino for Mac 5.1
 Calculates the boolean intersection of two closed, planar curves. Note, curves must be co-planar.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] CreateBooleanIntersection(
	Curve curveA,
	Curve curveB
)
Public Shared Function CreateBooleanIntersection (
	curveA As Curve,
	curveB As Curve
) As Curve()
Parameters
curveA
Type: Rhino.Geometry.Curve
The first closed, planar curve.
curveB
Type: Rhino.Geometry.Curve
The second closed, planar curve.
Return Value
Type: Curve[]
Result curves on success, empty array if no intersection could be calculated.
See Also
Reference
Curve Class
Rhino.Geometry Namespace