RhinoCommon SDK
BinaryArchiveReader.ReadString Method
Rhino for Mac 5.1
 Reads a String from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string ReadString()
Public Function ReadString As String
Return Value
Type: String
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace