RhinoCommon SDK
HatchPatternFillType Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.HatchPatternFillType"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum HatchPatternFillType
Public Enumeration HatchPatternFillType
Members
Member name | Value | Description
Solid | 0
Lines | 1
Gradient | 2
See Also
Reference
Rhino.DocObjects Namespace