RhinoCommon SDK
MeshFaceNormalList.AddFaceNormal Method (Vector3f)
Rhino for Mac 5.1
 Appends a face normal to the list of mesh face normals.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddFaceNormal(
	Vector3f normal
)
Public Function AddFaceNormal (
	normal As Vector3f
) As Integer
Parameters
normal
Type: Rhino.Geometry.Vector3f
New face normal.
Return Value
Type: Int32
The index of the newly added face normal.
See Also
Reference
MeshFaceNormalList Class
AddFaceNormal Overload
Rhino.Geometry.Collections Namespace