RhinoCommon SDK
MeshFaceNormalList.AddFaceNormal Method (Double, Double, Double)
Rhino for Mac 5.1
 Appends a face normal to the list of mesh face normals.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddFaceNormal(
	double x,
	double y,
	double z
)
Public Function AddFaceNormal (
	x As Double,
	y As Double,
	z As Double
) As Integer
Parameters
x
Type: System.Double
X component of face normal.
y
Type: System.Double
Y component of face normal.
z
Type: System.Double
Z component of face normal.
Return Value
Type: Int32
The index of the newly added face normal.
See Also
Reference
MeshFaceNormalList Class
AddFaceNormal Overload
Rhino.Geometry.Collections Namespace