RhinoCommon SDK
CustomDisplay.AddArc Method (Arc)
Rhino for Mac 5.1
 Adds a new, black arc to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddArc(
	Arc arc
)
Public Sub AddArc (
	arc As Arc
)
Parameters
arc
Type: Rhino.Geometry.Arc
Arc to add.
See Also
Reference
CustomDisplay Class
AddArc Overload
Rhino.Display Namespace