RhinoCommon SDK
MeshVertexNormalList.Add Method (Double, Double, Double)
Rhino for Mac 5.1
 Adds a new vertex normal at the end of the list.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	double x,
	double y,
	double z
)
Public Function Add (
	x As Double,
	y As Double,
	z As Double
) As Integer
Parameters
x
Type: System.Double
X component of new vertex normal.
y
Type: System.Double
Y component of new vertex normal.
z
Type: System.Double
Z component of new vertex normal.
Return Value
Type: Int32
The index of the newly added vertex normal.
See Also
Reference
MeshVertexNormalList Class
Add Overload
Rhino.Geometry.Collections Namespace