RhinoCommon SDK
MeshVertexNormalList.Add Method (Single, Single, Single)
Rhino for Mac 5.1
 Adds a new vertex normal at the end of the list.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	float x,
	float y,
	float z
)
Public Function Add (
	x As Single,
	y As Single,
	z As Single
) As Integer
Parameters
x
Type: System.Single
X component of new vertex normal.
y
Type: System.Single
Y component of new vertex normal.
z
Type: System.Single
Z component of new vertex normal.
Return Value
Type: Int32
The index of the newly added vertex normal.
See Also
Reference
MeshVertexNormalList Class
Add Overload
Rhino.Geometry.Collections Namespace