RhinoCommon SDK
InstanceDefinitionTable.Add Method (String, String, Point3d, GeometryBase, ObjectAttributes)
Rhino for Mac 5.1
 Adds an instance definition to the instance definition table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	string name,
	string description,
	Point3d basePoint,
	GeometryBase geometry,
	ObjectAttributes attributes
)
Public Function Add (
	name As String,
	description As String,
	basePoint As Point3d,
	geometry As GeometryBase,
	attributes As ObjectAttributes
) As Integer
Parameters
name
Type: System.String
The definition name.
description
Type: System.String
The definition description.
basePoint
Type: Rhino.Geometry.Point3d
A base point.
geometry
Type: Rhino.Geometry.GeometryBase
An element.
attributes
Type: Rhino.DocObjects.ObjectAttributes
An attribute.
Return Value
Type: Int32
 >=0 index of instance definition in the instance definition table. -1 on failure.
See Also
Reference
InstanceDefinitionTable Class
Add Overload
Rhino.DocObjects.Tables Namespace