RhinoCommon SDK
BinaryArchiveWriter.WritePlane Method
Rhino for Mac 5.1
 Writes a Plane value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WritePlane(
	Plane value
)
Public Sub WritePlane (
	value As Plane
)
Parameters
value
Type: Rhino.Geometry.Plane
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace