RhinoCommon SDK
GroupTableEventArgs.EventType Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.GroupTableEventArgs.EventType"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GroupTableEventType EventType { get; }
Public ReadOnly Property EventType As GroupTableEventType
	Get
Property Value
Type: GroupTableEventType
See Also
Reference
GroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace