RhinoCommon SDK
RhinoView Methods
Rhino for Mac 5.1
The RhinoView type exposes the following members.
Methods
Name | Description
CaptureToBitmap()
 Capture View contents to a bitmap.
CaptureToBitmap(Size)
 Capture View contents to a bitmap.
CaptureToBitmap(DisplayModeDescription)
 Capture View contents to a bitmap using a display mode description to define how drawing is performed.
CaptureToBitmap(DisplayPipelineAttributes)
 Captures view contents to a bitmap using display attributes to define how drawing is performed.
CaptureToBitmap(Size, DisplayModeDescription)
 Capture View contents to a bitmap using a display mode description to define how drawing is performed.
CaptureToBitmap(Size, DisplayPipelineAttributes)
 Capture View contents to a bitmap using display attributes to define how drawing is performed.
CaptureToBitmap(Boolean, Boolean, Boolean)
 Captures the view contents to a bitmap allowing for visibility of grid and axes.
CaptureToBitmap(Size, Boolean, Boolean, Boolean)
 Captures a part of the view contents to a bitmap allowing for visibility of grid and axes.
ClientToScreen(Point)
ClientToScreen(Point2d)
Close
 Remove this View from Rhino. DO NOT attempt to use this instance of this class after calling Close.
CreateShadedPreviewImage
Creates a bitmap preview image of model.
CreateWireframePreviewImage
Creates a bitmap preview image of model.
Redraw
Redraws this view.
ScreenToClient(Point)
 Converts a point in screen coordinates to client coordinates for this view.
ScreenToClient(Point2d)
SpeedTest
Top
See Also
Reference
RhinoView Class
Rhino.Display Namespace