RhinoCommon SDK
ObjectEnumeratorSettings.ClassTypeFilter Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.ClassTypeFilter"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Type ClassTypeFilter { get; set; }
Public Property ClassTypeFilter As Type
	Get
	Set
Property Value
Type: Type
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace