RhinoCommon SDK
LayerTable.GetEnumerator Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LayerTable.GetEnumerator"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<Layer> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Layer)
Return Value
Type: IEnumerator<Layer>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LayerTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace