RhinoCommon SDK
Line.MinimumDistanceTo Method (Point3d)
Rhino for Mac 5.1
 Finds the shortest distance between this line as a finite segment and a test point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double MinimumDistanceTo(
	Point3d testPoint
)
Public Function MinimumDistanceTo (
	testPoint As Point3d
) As Double
Parameters
testPoint
Type: Rhino.Geometry.Point3d
A point to test.
Return Value
Type: Double
The minimum distance.
See Also
Reference
Line Structure
MinimumDistanceTo Overload
Rhino.Geometry Namespace