RhinoCommon SDK
PickContext.Dispose Method
Rhino for Mac 5.1
Overload List
Name | Description
Dispose()
Releases all resources used by the PickContext
Dispose(Boolean)
Releases the unmanaged resources used by the PickContext and optionally releases the managed resources
Top
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace