RhinoCommon SDK
Interpolator.InterpolateLinear Method
Rhino for Mac 5.1
 Sample the list of numbers with linear interpolation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double InterpolateLinear(
	double t
)
Public Function InterpolateLinear (
	t As Double
) As Double
Parameters
t
Type: System.Double
Parameter to sample at. The integer portion of the parameter indicates the index of the left-hand value. If this Interpolator is cyclical, parameters will be wrapped.
Return Value
Type: Double
The sampled value at t.
See Also
Reference
Interpolator Class
Rhino.Geometry Namespace