RhinoCommon SDK
LinetypeTable Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.LinetypeTable"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.LinetypeTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class LinetypeTable : IEnumerable<Linetype>,
	IEnumerable
Public NotInheritable Class LinetypeTable
	Implements IEnumerable(Of Linetype), IEnumerable
The LinetypeTable type exposes the following members.
Properties
Name | Description
ActiveCount
 Returns number of linetypes in the linetypes table, excluding deleted linetypes.
ByLayerLinetypeName
 Returns the text name of the bylayer linetype.
ContinuousLinetypeName
 Returns the text name of the continuous linetype.
Count
 Returns number of linetypes in the linetypes table, including deleted linetypes.
CurrentLinetype
 Returns reference to the current linetype. Note that this reference may become invalid after a call to AddLinetype().
CurrentLinetypeIndex
 At all times, there is a "current" linetype. Unless otherwise specified, new objects are assigned to the current linetype. If the current linetype source is LinetypeFromLayer the object's layer's linetype is used instead.
CurrentLinetypeSource
 Source used by an object to determine its current linetype to be used by new objects.
Document
Document that owns this table.
Item
 Conceptually, the linetype table is an array of linetypes. The operator[] can be used to get individual linetypes. A linetype is either active or deleted and this state is reported by Linetype.IsDeleted.
LinetypeScale
 For display in Rhino viewports, the linetypes are scaled by a single scale factor for all viewports. This is not used for printing, where all linetype patterns are scaled to print in their defined size 1:1 on the paper.
Top
Methods
Name | Description
Add(Linetype)
 Adds a new linetype with specified definition to the linetype table.
Add(String, IEnumerable<Double>)
 Adds a new linetype with specified definition to the linetype table.
AddReferenceLinetype
 Adds a reference linetypes that will not be saved in files.
Delete(IEnumerable<Int32>, Boolean)
Deletes multiple linetypes.
Delete(Int32, Boolean)
Deletes linetype.
Find(Guid, Boolean)
Finds a linetype with a matching ID.
Find(String, Boolean)
Finds the linetype with a given name.
GetEnumerator
GetUnusedLinetypeName
 Gets unused linetype name used as default when creating new linetypes.
LinetypeIndexForObject
 Returns the effective linetype index to be used to find the linetype definition to draw an object. If an object's linetype source is LinetypeFromObject, the linetype index in the object's attributes is used. If an object's linetype source is LinetypeFromLayer the linetype index from the object's layer is used.
Modify
Modify linetype settings.
SetCurrentLinetypeIndex
 At all times, there is a "current" linetype. Unless otherwise specified, new objects are assigned to the current linetype. The current linetype is never deleted.
Undelete
Restores a linetype that has been deleted.
UndoModify
 If the linetype has been modified and the modifcation can be undone, then UndoModify() will restore the linetype to its previous state.
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace