RhinoCommon SDK
Unroller.RelativeTolerance Property
Rhino for Mac 5.1
 Gets or sets the relative tolerance for the unrolling operation.
Relative tolerance is used in the evaluation of intrinsic properties, such as computations "along" the surface or brep.
In the current implementation, relative tolerance is used to decide if a surface is flat enough to try to unroll. That helps ease the scale dependency. The surface has to be linear in one direction within (length * RelativeTolerance) to be considered linear for that purpose. Otherwise smash will ignore that tolerance and unroll anything.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double RelativeTolerance { get; set; }
Public Property RelativeTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Unroller Class
Rhino.Geometry Namespace