RhinoCommon SDK
Line Constructor (Point3d, Vector3d, Double)
Rhino for Mac 5.1
 Constructs a new line segment from start point, direction and length.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line(
	Point3d start,
	Vector3d direction,
	double length
)
Public Sub New (
	start As Point3d,
	direction As Vector3d,
	length As Double
)
Parameters
start
Type: Rhino.Geometry.Point3d
Start point of line segment.
direction
Type: Rhino.Geometry.Vector3d
Direction of line segment.
length
Type: System.Double
Length of line segment.
See Also
Reference
Line Structure
Line Overload
Rhino.Geometry Namespace