RhinoCommon SDK
Line Constructor (Double, Double, Double, Double, Double, Double)
Rhino for Mac 5.1
 Constructs a new line segment between two points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line(
	double x0,
	double y0,
	double z0,
	double x1,
	double y1,
	double z1
)
Public Sub New (
	x0 As Double,
	y0 As Double,
	z0 As Double,
	x1 As Double,
	y1 As Double,
	z1 As Double
)
Parameters
x0
Type: System.Double
The X coordinate of the first point.
y0
Type: System.Double
The Y coordinate of the first point.
z0
Type: System.Double
The Z coordinate of the first point.
x1
Type: System.Double
The X coordinate of the second point.
y1
Type: System.Double
The Y coordinate of the second point.
z1
Type: System.Double
The Z coordinate of the second point.
See Also
Reference
Line Structure
Line Overload
Rhino.Geometry Namespace