RhinoCommon SDK
LayerTableEventArgs.NewState Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LayerTableEventArgs.NewState"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Layer NewState { get; }
Public ReadOnly Property NewState As Layer
	Get
Property Value
Type: Layer
See Also
Reference
LayerTableEventArgs Class
Rhino.DocObjects.Tables Namespace