RhinoCommon SDK
DisplayPipeline.DrawArrows Method
Rhino for Mac 5.1
Overload List
Name | Description
DrawArrows(Line[], Color)
 Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
DrawArrows(IEnumerable<Line>, Color)
 Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace