RhinoCommon SDK
RhinoGet.GetOneObject Method
Rhino for Mac 5.1
Overload List
Name | Description
GetOneObject(String, Boolean, ObjectType, ObjRef)
Easy to use object getter.
GetOneObject(String, Boolean, GetObjectGeometryFilter, ObjRef)
Easy to use object getter.
Top
See Also
Reference
RhinoGet Class
Rhino.Input Namespace