RhinoCommon SDK
Color4f Constructor (Single, Single, Single, Single)
Rhino for Mac 5.1
Initializes a new instance of the Color4f class
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color4f(
	float red,
	float green,
	float blue,
	float alpha
)
Public Sub New (
	red As Single,
	green As Single,
	blue As Single,
	alpha As Single
)
Parameters
red
Type: System.Single
[Missing <param name="red"/> documentation for "M:Rhino.Display.Color4f.#ctor(System.Single,System.Single,System.Single,System.Single)"]
green
Type: System.Single
[Missing <param name="green"/> documentation for "M:Rhino.Display.Color4f.#ctor(System.Single,System.Single,System.Single,System.Single)"]
blue
Type: System.Single
[Missing <param name="blue"/> documentation for "M:Rhino.Display.Color4f.#ctor(System.Single,System.Single,System.Single,System.Single)"]
alpha
Type: System.Single
[Missing <param name="alpha"/> documentation for "M:Rhino.Display.Color4f.#ctor(System.Single,System.Single,System.Single,System.Single)"]
See Also
Reference
Color4f Structure
Color4f Overload
Rhino.Display Namespace