RhinoCommon SDK
Color4f Constructor (Color)
Rhino for Mac 5.1
Initializes a new instance of the Color4f class
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color4f(
	Color color
)
Public Sub New (
	color As Color
)
Parameters
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.Color4f.#ctor(System.Drawing.Color)"]
See Also
Reference
Color4f Structure
Color4f Overload
Rhino.Display Namespace