RhinoCommon SDK
RhinoViewport.WorldToClient Method
Rhino for Mac 5.1
 Convert a point from world coordinates in the viewport to a 2d screen point in the local coordinates of the viewport (X/Y of point is relative to top left corner of viewport on screen)
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2d WorldToClient(
	Point3d worldPoint
)
Public Function WorldToClient (
	worldPoint As Point3d
) As Point2d
Parameters
worldPoint
Type: Rhino.Geometry.Point3d
The 3D point in world coordinates.
Return Value
Type: Point2d
The 2D point on the screen.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace