RhinoCommon SDK
Color4f.Equals Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.Color4f.Equals(System.Object)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
[Missing <param name="obj"/> documentation for "M:Rhino.Display.Color4f.Equals(System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.Color4f.Equals(System.Object)"]
See Also
Reference
Color4f Structure
Rhino.Display Namespace