RhinoCommon SDK
LinearDimension.SetLocations Method
Rhino for Mac 5.1
 Sets the three locations of the point, using two-dimensional points that refer to the plane of the annotation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetLocations(
	Point2d extensionLine1End,
	Point2d extensionLine2End,
	Point2d pointOnDimensionLine
)
Public Sub SetLocations (
	extensionLine1End As Point2d,
	extensionLine2End As Point2d,
	pointOnDimensionLine As Point2d
)
Parameters
extensionLine1End
Type: Rhino.Geometry.Point2d
[Missing <param name="extensionLine1End"/> documentation for "M:Rhino.Geometry.LinearDimension.SetLocations(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)"]
extensionLine2End
Type: Rhino.Geometry.Point2d
[Missing <param name="extensionLine2End"/> documentation for "M:Rhino.Geometry.LinearDimension.SetLocations(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)"]
pointOnDimensionLine
Type: Rhino.Geometry.Point2d
[Missing <param name="pointOnDimensionLine"/> documentation for "M:Rhino.Geometry.LinearDimension.SetLocations(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)"]
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace