RhinoCommon SDK
Point Properties
Rhino for Mac 5.1
The Point type exposes the following members.
Properties
Name | Description
Location
 Gets or sets the location (position) of this point.
Top
See Also
Reference
Point Class
Rhino.Geometry Namespace