RhinoCommon SDK
Quaternion.Vector Property
Rhino for Mac 5.1
 The imaginary part of the quaternion
(B,C,D)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d Vector { get; }
Public ReadOnly Property Vector As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace