RhinoCommon SDK
HatchPatternTable Properties
Rhino for Mac 5.1
The HatchPatternTable type exposes the following members.
Properties
Name | Description
Count
Number of patterns in the table.
CurrentHatchPatternIndex
 At all times, there is a "current" hatch pattern. Unless otherwise specified, new objects are assigned to the current hatch pattern. The current hatch pattern is never locked, hidden, or deleted.
Document
Document that owns this table.
Item
 Conceptually, the hatch pattern table is an array of hatch patterns. The operator[] can be used to get individual hatch patterns. A hatch pattern is either active or deleted and this state is reported by HatchPattern.IsDeleted.
Top
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace