RhinoCommon SDK
RhinoGet.GetNumber Method
Rhino for Mac 5.1
Overload List
Name | Description
GetNumber(String, Boolean, Double)
 Easy to use number getter.
GetNumber(String, Boolean, Double, Double, Double)
 Easy to use number getter.
Top
See Also
Reference
RhinoGet Class
Rhino.Input Namespace