RhinoCommon SDK
RhinoObject.GetGrips Method
Rhino for Mac 5.1
 Returns grips for this object If grips are enabled. If grips are not enabled, returns null.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GripObject[] GetGrips()
Public Function GetGrips As GripObject()
Return Value
Type: GripObject[]
An array of grip objects; or null if there are no grips.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace