RhinoCommon SDK
Material.RenderPlugInId Property
Rhino for Mac 5.1
 The Id of the RenderPlugIn that is associated with this material.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid RenderPlugInId { get; set; }
Public Property RenderPlugInId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Material Class
Rhino.DocObjects Namespace