RhinoCommon SDK
BezierCurve.IsRational Property
Rhino for Mac 5.1
 Gets a value indicating whether or not the curve is rational. Rational curves have control-points with custom weights.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsRational { get; }
Public ReadOnly Property IsRational As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace