RhinoCommon SDK
UserDictionary.ShouldWrite Property
Rhino for Mac 5.1
 Writes this entity if the count is larger than 0.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override bool ShouldWrite { get; }
Public Overrides ReadOnly Property ShouldWrite As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace