RhinoCommon SDK
DisplayPipeline.DrawCone Method
Rhino for Mac 5.1
Overload List
Name | Description
DrawCone(Cone, Color)
 Draw a wireframe cone.
DrawCone(Cone, Color, Int32)
 Draw a wireframe cone.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace