RhinoCommon SDK
BezierCurve.CreateLoftedBezier Method (IEnumerable<Point3d>)
Rhino for Mac 5.1
 Loft a bezier through a list of points
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static BezierCurve CreateLoftedBezier(
	IEnumerable<Point3d> points
)
Public Shared Function CreateLoftedBezier (
	points As IEnumerable(Of Point3d)
) As BezierCurve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
2 or more points to interpolate
Return Value
Type: BezierCurve
new bezier curve if successful
See Also
Reference
BezierCurve Class
CreateLoftedBezier Overload
Rhino.Geometry Namespace