RhinoCommon SDK
ViewportType Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.ViewportType"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum ViewportType
Public Enumeration ViewportType
Members
Member name | Value | Description
StandardModelingViewport | 0
PageViewMainViewport | 1
DetailViewport | 2
See Also
Reference
Rhino.Display Namespace