RhinoCommon SDK
Particle.Color Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Geometry.Particle.Color"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color Color { get; set; }
Public Property Color As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Particle Class
Rhino.Geometry Namespace