RhinoCommon SDK
RhinoGet.GetMultipleObjects Method
Rhino for Mac 5.1
Overload List
Name | Description
GetMultipleObjects(String, Boolean, ObjectType, ObjRef[])
Easy to use object getter for getting multiple objects.
GetMultipleObjects(String, Boolean, GetObjectGeometryFilter, ObjRef[])
Easy to use object getter for getting multiple objects.
Top
See Also
Reference
RhinoGet Class
Rhino.Input Namespace