RhinoCommon SDK
BinaryArchiveReader.ReadSingle Method
Rhino for Mac 5.1
 Reads a Single from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public float ReadSingle()
Public Function ReadSingle As Single
Return Value
Type: Single
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace