RhinoCommon SDK
Mesh.ExplodeAtUnweldedEdges Method
Rhino for Mac 5.1
 Explode the mesh into submeshes where a submesh is a collection of faces that are contained within a closed loop of "unwelded" edges. Unwelded edges are edges where the faces that share the edge have unique mesh vertexes (not mesh topology vertexes) at both ends of the edge.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Mesh[] ExplodeAtUnweldedEdges()
Public Function ExplodeAtUnweldedEdges As Mesh()
Return Value
Type: Mesh[]
 Array of submeshes on success; null on error. If the count in the returned array is 1, then nothing happened and the ouput is essentially a copy of the input.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace