RhinoCommon SDK
Rectangle3d.Contains Method (Double, Double)
Rhino for Mac 5.1
 Determines if two plane parameters are included in this rectangle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PointContainment Contains(
	double x,
	double y
)
Public Function Contains (
	x As Double,
	y As Double
) As PointContainment
Parameters
x
Type: System.Double
Parameter along base plane X direction.
y
Type: System.Double
Parameter along base plane Y direction.
Return Value
Type: PointContainment
Parameter Rectangle relationship.
See Also
Reference
Rectangle3d Structure
Contains Overload
Rhino.Geometry Namespace