RhinoCommon SDK
VisualAnalysisMode.UpdateVertexColors Method
Rhino for Mac 5.1
 If Style==falseColor, then this virtual function must be overridden. Rhino calls this function when it is time for to set the false colors on the analysis mesh vertices. For breps, there is one mesh per face. For mesh objects there is a single mesh.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void UpdateVertexColors(
	RhinoObject obj,
	Mesh[] meshes
)
Protected Overridable Sub UpdateVertexColors (
	obj As RhinoObject,
	meshes As Mesh()
)
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
The object for which to update vertex colors.
meshes
Type: Rhino.Geometry.Mesh[]
An array of meshes that should be updated.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace