RhinoCommon SDK
GripObject.Weight Property
Rhino for Mac 5.1
 The weight of a NURBS control point grip or RhinoMath.UnsetValue if the grip is not a NURBS control point grip.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual double Weight { get; set; }
Public Overridable Property Weight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace