RhinoCommon SDK
DisplayPipeline.PopDepthWriting Method
Rhino for Mac 5.1
 Pop a DepthWriting flag off the engine's stack.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PopDepthWriting()
Public Sub PopDepthWriting
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace