RhinoCommon SDK
TextLog.Print Method (String, Object)
Rhino for Mac 5.1
 Send formatted text to the textlog
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Print(
	string format,
	Object arg0
)
Public Sub Print (
	format As String,
	arg0 As Object
)
Parameters
format
Type: System.String
[Missing <param name="format"/> documentation for "M:Rhino.FileIO.TextLog.Print(System.String,System.Object)"]
arg0
Type: System.Object
[Missing <param name="arg0"/> documentation for "M:Rhino.FileIO.TextLog.Print(System.String,System.Object)"]
See Also
Reference
TextLog Class
Print Overload
Rhino.FileIO Namespace