RhinoCommon SDK
LOC.COMMANDNAME Method
Rhino for Mac 5.1
 Command names that need to be localized should call this function. The COMMANDNAME function doesn't actually do anything but return the original string. The LocalizationProcessor application walks through the source code of a project and looks for LOC.COMMANDNAME and builds a record for each command name for the translators that can be used by developers in a commands overridden Rhino.Commands.Command.LocalName which should call Rhino.UI.Localization.LocalizeCommandName(EnglishName)
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string COMMANDNAME(
	string english
)
Public Shared Function COMMANDNAME (
	english As String
) As String
Parameters
english
Type: System.String
[in] The English string to localize.
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.LOC.COMMANDNAME(System.String)"]
See Also
Reference
LOC Class
Rhino.UI Namespace