RhinoCommon SDK
ReplayHistoryData Properties
Rhino for Mac 5.1
The ReplayHistoryData type exposes the following members.
Properties
Name | Description
Document
The document this record belongs to
HistoryVersion
 ReplayHistory overrides check the version number to insure the information saved in the history record is compatible with the current implementation of ReplayHistory
RecordId
 Each history record has a unique id that Rhino assigns when it adds the history record to the history record table
Results
Top
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace