RhinoCommon SDK
Linetype.LinetypeIndex Property
Rhino for Mac 5.1
The index of this linetype.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int LinetypeIndex { get; set; }
Public Property LinetypeIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace