RhinoCommon SDK
Mesh.IsPointInside Method
Rhino for Mac 5.1
 Determines if a point is inside a solid mesh.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsPointInside(
	Point3d point,
	double tolerance,
	bool strictlyIn
)
Public Function IsPointInside (
	point As Point3d,
	tolerance As Double,
	strictlyIn As Boolean
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
3d point to test.
tolerance
Type: System.Double
 (>=0) 3d distance tolerance used for ray-mesh intersection and determining strict inclusion.
strictlyIn
Type: System.Boolean
 If strictlyIn is true, then point must be inside mesh by at least tolerance in order for this function to return true. If strictlyIn is false, then this function will return true if point is inside or the distance from point to a mesh face is <= tolerance.
Return Value
Type: Boolean
 true if point is inside the solid mesh, false if not.
Remarks
 The caller is responsible for making certing the mesh is solid before calling this function. If the mesh is not solid, the behavior is unpredictable.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace