RhinoCommon SDK
SurfaceObject.DuplicateSurfaceGeometry Method
Rhino for Mac 5.1
 Constructs a new deep copy of the surface geometry.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface DuplicateSurfaceGeometry()
Public Function DuplicateSurfaceGeometry As Surface
Return Value
Type: Surface
The copy of the geometry.
See Also
Reference
SurfaceObject Class
Rhino.DocObjects Namespace