RhinoCommon SDK
MeshFaceList.Insert Method
Rhino for Mac 5.1
 Inserts a mesh face at a defined index in this list.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Insert(
	int index,
	MeshFace face
)
Public Sub Insert (
	index As Integer,
	face As MeshFace
)
Parameters
index
Type: System.Int32
An index.
face
Type: Rhino.Geometry.MeshFace
A face.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If index is negative or >= Count.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace