RhinoCommon SDK
OptionColor.Dispose Method (Boolean)
Rhino for Mac 5.1
Releases the unmanaged resources used by the OptionColor and optionally releases the managed resources
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected void Dispose(
	bool disposing
)
Protected Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
OptionColor Class
Dispose Overload
Rhino.Input.Custom Namespace