RhinoCommon SDK
InstanceDefinition.Object Method
Rhino for Mac 5.1
 returns an object used as part of this definition.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject Object(
	int index
)
Public Function Object (
	index As Integer
) As RhinoObject
Parameters
index
Type: System.Int32
0 <= index < ObjectCount.
Return Value
Type: RhinoObject
 Returns an object that is used to define the geometry. Does NOT return an object that references this definition.count the number of references to this instance.
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace