RhinoCommon SDK
RadialDimension Constructor
Rhino for Mac 5.1
Overload List
Name | Description
RadialDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
RadialDimension(Circle, Point3d, Double)
 Construct a radial dimension from 3d input
RadialDimension(Point3d, Point3d, Vector3d, Vector3d, Double)
 Construct a radial dimension from 3d input
Top
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace