RhinoCommon SDK
ObjectTable.Replace Method (ObjRef, TextEntity)
Rhino for Mac 5.1
 Replaces one object with new text object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	ObjRef objref,
	TextEntity text
)
Public Function Replace (
	objref As ObjRef,
	text As TextEntity
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
reference to old object to be replaced. The objref.Object() will be deleted.
text
Type: Rhino.Geometry.TextEntity
 new text to be added A duplicate of the text is added to the Rhino model.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace