RhinoCommon SDK
OptionInteger Constructor (Int32)
Rhino for Mac 5.1
Initializes a new instance of the OptionInteger class
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public OptionInteger(
	int initialValue
)
Public Sub New (
	initialValue As Integer
)
Parameters
initialValue
Type: System.Int32
[Missing <param name="initialValue"/> documentation for "M:Rhino.Input.Custom.OptionInteger.#ctor(System.Int32)"]
See Also
Reference
OptionInteger Class
OptionInteger Overload
Rhino.Input.Custom Namespace