RhinoCommon SDK
SimpleArrayCurvePointer Constructor (IEnumerable<Curve>)
Rhino for Mac 5.1
 Initializes a new SimpleArrayCurvePointer instance, from a set of input curves.
Namespace: Rhino.Runtime.InteropWrappers
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public SimpleArrayCurvePointer(
	IEnumerable<Curve> curves
)
Public Sub New (
	curves As IEnumerable(Of Curve)
)
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
A list, an array or any collection of curves that implements the enumerable interface.
See Also
Reference
SimpleArrayCurvePointer Class
SimpleArrayCurvePointer Overload
Rhino.Runtime.InteropWrappers Namespace