RhinoCommon SDK
BoundingBox.Unset Property
Rhino for Mac 5.1
 Gets a boundingbox that has Unset coordinates for Min and Max.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static BoundingBox Unset { get; }
Public Shared ReadOnly Property Unset As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace