RhinoCommon SDK
UserDataList Class
Rhino for Mac 5.1
Represents a collection of user data.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Custom.UserDataList
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class UserDataList
Public Class UserDataList
The UserDataList type exposes the following members.
Properties
Name | Description
Count
Number of UserData objects in this list.
Top
Methods
Name | Description
Add
 If the userdata is already in a different UserDataList, it will be removed from that list and added to this list.
Find
 Finds a specific data type in this regulated collection.
Remove
 Remove the userdata from this list
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace