RhinoCommon SDK
Brep.CreateFromCone Method
Rhino for Mac 5.1
 Constructs a Brep representation of the cone with a single face for the cone, an edge along the cone seam, and vertices at the base and apex ends of this seam edge. The optional cap is a single face with one circular edge starting and ending at the base vertex.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep CreateFromCone(
	Cone cone,
	bool capBottom
)
Public Shared Function CreateFromCone (
	cone As Cone,
	capBottom As Boolean
) As Brep
Parameters
cone
Type: Rhino.Geometry.Cone
A cone value.
capBottom
Type: System.Boolean
if true the base of the cone should be capped.
Return Value
Type: Brep
A new brep, on null on error.
See Also
Reference
Brep Class
Rhino.Geometry Namespace