RhinoCommon SDK
RhinoGet.GetArc Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetArc(Rhino.Geometry.Arc@)"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetArc(
	out Arc arc
)
Public Shared Function GetArc (
	<OutAttribute> ByRef arc As Arc
) As Result
Parameters
arc
Type: Rhino.Geometry.Arc
[Missing <param name="arc"/> documentation for "M:Rhino.Input.RhinoGet.GetArc(Rhino.Geometry.Arc@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetArc(Rhino.Geometry.Arc@)"]
See Also
Reference
RhinoGet Class
Rhino.Input Namespace