RhinoCommon SDK
InstanceDefinitionTable.Add Method (String, String, Point3d, IEnumerable<GeometryBase>)
Rhino for Mac 5.1
 Adds an instance definition to the instance definition table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	string name,
	string description,
	Point3d basePoint,
	IEnumerable<GeometryBase> geometry
)
Public Function Add (
	name As String,
	description As String,
	basePoint As Point3d,
	geometry As IEnumerable(Of GeometryBase)
) As Integer
Parameters
name
Type: System.String
The definition name.
description
Type: System.String
The definition description.
basePoint
Type: Rhino.Geometry.Point3d
A base point.
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
An array, a list or any enumerable set of geometry.
Return Value
Type: Int32
 >=0 index of instance definition in the instance definition table. -1 on failure.
Examples
using System;
using Rhino;
using Rhino.Geometry;
partial class Examples
{
  public static Rhino.Commands.Result AddNestedBlock(RhinoDoc doc)
  {
    var circle = new Circle(Point3d.Origin, 5);
    Curve[] curveList = { new ArcCurve(circle) };
    var circleIndex = doc.InstanceDefinitions.Add("Circle", "Circle with radius of 5", Point3d.Origin, curveList);
    var transform = Transform.Identity;
    var irefId = doc.InstanceDefinitions[circleIndex].Id;
    var iref = new InstanceReferenceGeometry(irefId, transform);
    circle.Radius = circle.Radius * 2.0;
    GeometryBase[] blockList = { iref, new ArcCurve(circle) };
    var circle2Index = doc.InstanceDefinitions.Add("TwoCircles", "Nested block test", Point3d.Origin, blockList);
    doc.Objects.AddInstanceObject(circle2Index, transform);
    doc.Views.Redraw();
    return Rhino.Commands.Result.Success;
  }
}
See Also
Reference
InstanceDefinitionTable Class
Add Overload
Rhino.DocObjects.Tables Namespace