RhinoCommon SDK
MaterialTable.Add Method (Material)
Rhino for Mac 5.1
 Adds a new material to the table based on a given material.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	Material material
)
Public Function Add (
	material As Material
) As Integer
Parameters
material
Type: Rhino.DocObjects.Material
A model of the material to be added.
Return Value
Type: Int32
The position of the new material in the table.
See Also
Reference
MaterialTable Class
Add Overload
Rhino.DocObjects.Tables Namespace