RhinoCommon SDK
Ellipse.Radius1 Property
Rhino for Mac 5.1
 Gets or sets the radius of the ellipse along the base plane X semiaxis.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Radius1 { get; set; }
Public Property Radius1 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace