RhinoCommon SDK
LightTable.Modify Method (Int32, Light)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LightTable.Modify(System.Int32,Rhino.Geometry.Light)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Modify(
	int index,
	Light light
)
Public Function Modify (
	index As Integer,
	light As Light
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.LightTable.Modify(System.Int32,Rhino.Geometry.Light)"]
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.DocObjects.Tables.LightTable.Modify(System.Int32,Rhino.Geometry.Light)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LightTable.Modify(System.Int32,Rhino.Geometry.Light)"]
See Also
Reference
LightTable Class
Modify Overload
Rhino.DocObjects.Tables Namespace