RhinoCommon SDK
GetPointDrawEventArgs.CurrentPoint Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointDrawEventArgs.CurrentPoint"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d CurrentPoint { get; }
Public ReadOnly Property CurrentPoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
GetPointDrawEventArgs Class
Rhino.Input.Custom Namespace