RhinoCommon SDK
NurbsCurveKnotList.IsClampedStart Property
Rhino for Mac 5.1
 Gets a value indicating whether or not the knot vector is clamped at the start of the curve. Clamped curves start at the first control-point. This requires fully multiple knots.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsClampedStart { get; }
Public ReadOnly Property IsClampedStart As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace