RhinoCommon SDK
Transform.ChangeBasis Method (Vector3d, Vector3d, Vector3d, Vector3d, Vector3d, Vector3d)
Rhino for Mac 5.1
 Computes a change of basis transformation. A basis change is essentially a remapping of geometry from one coordinate system to another.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform ChangeBasis(
	Vector3d initialBasisX,
	Vector3d initialBasisY,
	Vector3d initialBasisZ,
	Vector3d finalBasisX,
	Vector3d finalBasisY,
	Vector3d finalBasisZ
)
Public Shared Function ChangeBasis (
	initialBasisX As Vector3d,
	initialBasisY As Vector3d,
	initialBasisZ As Vector3d,
	finalBasisX As Vector3d,
	finalBasisY As Vector3d,
	finalBasisZ As Vector3d
) As Transform
Parameters
initialBasisX
Type: Rhino.Geometry.Vector3d
can be any 3d basis.
initialBasisY
Type: Rhino.Geometry.Vector3d
can be any 3d basis.
initialBasisZ
Type: Rhino.Geometry.Vector3d
can be any 3d basis.
finalBasisX
Type: Rhino.Geometry.Vector3d
can be any 3d basis.
finalBasisY
Type: Rhino.Geometry.Vector3d
can be any 3d basis.
finalBasisZ
Type: Rhino.Geometry.Vector3d
can be any 3d basis.
Return Value
Type: Transform
 A transformation matrix which orients geometry from one coordinate system to another on success. Transform.Unset on failure.
See Also
Reference
Transform Structure
ChangeBasis Overload
Rhino.Geometry Namespace