RhinoCommon SDK
Transform.M01 Property
Rhino for Mac 5.1
Gets or sets this[0,1].
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double M01 { get; set; }
Public Property M01 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Transform Structure
Rhino.Geometry Namespace