RhinoCommon SDK
Light.HotSpot Property
Rhino for Mac 5.1
 The hot spot setting runs from 0.0 to 1.0 and is used to provides a linear interface for controling the focus or concentration of a spotlight. A hot spot setting of 0.0 corresponds to a spot exponent of 128. A hot spot setting of 1.0 corresponds to a spot exponent of 0.0.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double HotSpot { get; set; }
Public Property HotSpot As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Light Class
Rhino.Geometry Namespace