RhinoCommon SDK
HatchPatternTable.Add Method
Rhino for Mac 5.1
 Adds a new hatch pattern with specified definition to the table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	HatchPattern pattern
)
Public Function Add (
	pattern As HatchPattern
) As Integer
Parameters
pattern
Type: Rhino.DocObjects.HatchPattern
 definition of new hatch pattern. The information in pattern is copied. If patern.Name is empty the a unique name of the form "HatchPattern 01" will be automatically created.
Return Value
Type: Int32
 >=0 index of new hatch pattern -1 not added because a hatch pattern with that name already exists or some other problem occured.
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace