RhinoCommon SDK
TextJustification Enumeration
Rhino for Mac 5.1
 Specifies enumerated constants used to indicate the internal alignment and justification of text.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[FlagsAttribute]
public enum TextJustification
<FlagsAttribute>
Public Enumeration TextJustification
Members
Member name | Value | Description
None | 0 |  The default justification.
Left | 1 |  Left justification.
Center | 2 |  Center justification.
Right | 4 |  Right justification.
Bottom | 65536 |  Bottom inner alignment.
Middle | 131072 |  Middle inner alignment.
Top | 262144 |  Top inner alignment.
BottomLeft | 65537 |  Combination of left justification and bottom alignment.
BottomCenter | 65538 |  Combination of center justification and bottom alignment.
BottomRight | 65540 |  Combination of right justification and bottom alignment.
MiddleLeft | 131073 |  Combination of left justification and middle alignment.
MiddleCenter | 131074 |  Combination of center justification and middle alignment.
MiddleRight | 131076 |  Combination of right justification and middle alignment.
TopLeft | 262145 |  Combination of left justification and top alignment.
TopCenter | 262146 |  Combination of center justification and top alignment.
TopRight | 262148 |  Combination of right justification and top alignment.
See Also
Reference
Rhino.Geometry Namespace