RhinoCommon SDK
Vector2f Methods
Rhino for Mac 5.1
The Vector2f type exposes the following members.
Methods
Name | Description
CompareTo
 Compares this Vector2f with another Vector2f.
Components evaluation priority is first X, then Y.
EpsilonEquals
 Check that all values in other are withing epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Vector2f and has the same values as the present vector.
 (Overrides ValueType.Equals(Object).)
Equals(Vector2f)
 Determines whether the specified vector has the same values as the present vector.
GetHashCode
 Computes a hash number that represents the current vector.
 (Overrides ValueType.GetHashCode().)
ToString
 Constructs the string representation of the current vector.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace