RhinoCommon SDK
Vector2d Methods
Rhino for Mac 5.1
The Vector2d type exposes the following members.
Methods
Name | Description
CompareTo
 Compares this Vector2d with another Vector2d.
Components evaluation priority is first X, then Y.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Vector2d and has the same value as the present vector.
 (Overrides ValueType.Equals(Object).)
Equals(Vector2d)
 Determines whether the specified vector has the same value as the present vector.
GetHashCode
 Provides a hashing value for the present vector.
 (Overrides ValueType.GetHashCode().)
ToString
 Constructs a string representation of the current vector.
 (Overrides ValueType.ToString().)
Unitize
 Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
Top
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace