RhinoCommon SDK
BoundingBox.PointAt Method
Rhino for Mac 5.1
 Evaluates the boundingbox with normalized parameters.
The box has idealized side length of 1x1x1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAt(
	double tx,
	double ty,
	double tz
)
Public Function PointAt (
	tx As Double,
	ty As Double,
	tz As Double
) As Point3d
Parameters
tx
Type: System.Double
Normalized (between 0 and 1 is inside the box) parameter along the X direction.
ty
Type: System.Double
Normalized (between 0 and 1 is inside the box) parameter along the Y direction.
tz
Type: System.Double
Normalized (between 0 and 1 is inside the box) parameter along the Z direction.
Return Value
Type: Point3d
The point at the {tx, ty, tz} parameters.
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace