RhinoCommon SDK
Surface.IsPeriodic Method
Rhino for Mac 5.1
 Gets a value indicating if thr surface is periodic in a direction (default is false).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsPeriodic(
	int direction
)
Public Function IsPeriodic (
	direction As Integer
) As Boolean
Parameters
direction
Type: System.Int32
0 = U, 1 = V.
Return Value
Type: Boolean
The indicating boolean value.
See Also
Reference
Surface Class
Rhino.Geometry Namespace