RhinoCommon SDK
Transform.Inequality Operator
Rhino for Mac 5.1
 Determines if two transformations are different in value.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator !=(
	Transform a,
	Transform b
)
Public Shared Operator <> (
	a As Transform,
	b As Transform
) As Boolean
Parameters
a
Type: Rhino.Geometry.Transform
A tranform.
b
Type: Rhino.Geometry.Transform
Another tranform.
Return Value
Type: Boolean
true if transforms are different; otherwise false.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace