RhinoCommon SDK
PolyCurve.SegmentCurve Method
Rhino for Mac 5.1
 Gets the segment curve at the given index.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve SegmentCurve(
	int index
)
Public Function SegmentCurve (
	index As Integer
) As Curve
Parameters
index
Type: System.Int32
Index of segment to retrieve.
Return Value
Type: Curve
The segment at the given index or null on failure.
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace