RhinoCommon SDK
RhinoObject.Document Property
Rhino for Mac 5.1
 Gets the document that owns this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace