RhinoCommon SDK
ObjRef.SetSelectionComponent Method
Rhino for Mac 5.1
 When an object is selected by picking a sub-object, SetSelectionComponent may be used to identify the sub-object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetSelectionComponent(
	ComponentIndex componentIndex
)
Public Sub SetSelectionComponent (
	componentIndex As ComponentIndex
)
Parameters
componentIndex
Type: Rhino.Geometry.ComponentIndex
[Missing <param name="componentIndex"/> documentation for "M:Rhino.DocObjects.ObjRef.SetSelectionComponent(Rhino.Geometry.ComponentIndex)"]
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace