RhinoCommon SDK
NurbsCurvePointList Methods
Rhino for Mac 5.1
The NurbsCurvePointList type exposes the following members.
Methods
Name | Description
ChangeEndWeights
 Use a combination of scaling and reparameterization to change the end weights to the specified values.
ControlPolygon
 Constructs a polyline through all the control points. Note that periodic curves generate a closed polyline with fewer points than control-points.
EnsurePrivateCopy
 If you want to keep a copy of this class around by holding onto it in a variable after a command completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can call this function as many times as you want.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
MakeNonRational
 Sets all the control points to 1.0.
MakeRational
 Turns the curve into a Rational nurbs curve.
SetPoint(Int32, Point3d)
 Sets a specific control-point.
SetPoint(Int32, Point4d)
 Sets a specific weighted control-point.
SetPoint(Int32, Double, Double, Double, Double)
 Sets a specific control-point.
Top
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace