RhinoCommon SDK
BrepCurveList Class
Rhino for Mac 5.1
 Provides access to all the underlying curves in a Brep object.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.BrepCurveList
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class BrepCurveList : IEnumerable<Curve>,
	IEnumerable
Public Class BrepCurveList
	Implements IEnumerable(Of Curve), IEnumerable
The BrepCurveList type exposes the following members.
Properties
Name | Description
Count
Gets the number of curves in this list.
Item
 Gets the Curve at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
Methods
Name | Description
Add
Adds a curve
GetEnumerator
Get an enumerator that visits all curves.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace