RhinoCommon SDK
UserDictionary.Dictionary Property
Rhino for Mac 5.1
 Gets the dictionary that is associated with this class.
This dictionary is unique.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ArchivableDictionary Dictionary { get; }
Public ReadOnly Property Dictionary As ArchivableDictionary
	Get
Property Value
Type: ArchivableDictionary
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace