RhinoCommon SDK
SurfaceObject.SurfaceGeometry Property
Rhino for Mac 5.1
 Gets the surface geometry linked with this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface SurfaceGeometry { get; }
Public ReadOnly Property SurfaceGeometry As Surface
	Get
Property Value
Type: Surface
See Also
Reference
SurfaceObject Class
Rhino.DocObjects Namespace