RhinoCommon SDK
BinaryArchiveReader.ReadInt64 Method
Rhino for Mac 5.1
 Reads a Int64 from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public long ReadInt64()
Public Function ReadInt64 As Long
Return Value
Type: Int64
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace