RhinoCommon SDK
BinaryArchiveReader.ReadByte Method
Rhino for Mac 5.1
 Reads a Byte from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public byte ReadByte()
Public Function ReadByte As Byte
Return Value
Type: Byte
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace