RhinoCommon SDK
Material.GetTextures Method
Rhino for Mac 5.1
 Get array of textures that this material uses
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Texture[] GetTextures()
Public Function GetTextures As Texture()
Return Value
Type: Texture[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.GetTextures"]
See Also
Reference
Material Class
Rhino.DocObjects Namespace