RhinoCommon SDK
ColorLCH.CreateFromLAB Method
Rhino for Mac 5.1
 Create the nearest LCH equivalent of a LAB color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorLCH CreateFromLAB(
	ColorLAB lab
)
Public Shared Function CreateFromLAB (
	lab As ColorLAB
) As ColorLCH
Parameters
lab
Type: Rhino.Display.ColorLAB
Target color in LAB space.
Return Value
Type: ColorLCH
The LCH equivalent of the LAB color.
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace