RhinoCommon SDK
BinaryArchiveWriter.WritePoint Method
Rhino for Mac 5.1
 Writes a Point value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WritePoint(
	Point value
)
Public Sub WritePoint (
	value As Point
)
Parameters
value
Type: System.Drawing.Point
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace