RhinoCommon SDK
File3dmTypeCodes.TCODE_ENDOFFILE Field
Rhino for Mac 5.1
 (0x00007FFF) The TCODE_ENDOFFILE is the last chunk in the file and the first 4 bytes of information in this chunk is an integer that contains the file length. This chunk was added in February 2000 and files written with code released earlier than this will not have this termination block.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_ENDOFFILE
Public Const TCODE_ENDOFFILE As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace