RhinoCommon SDK
File3dmObjectTable Class
Rhino for Mac 5.1
 Represents a simple object table for a file that is open externally.
This class mimics Rhino.DocObjects.Tables.ObjectTable while providing external eccess to the file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmObjectTable
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class File3dmObjectTable : IEnumerable<File3dmObject>,
	IEnumerable
Public Class File3dmObjectTable
	Implements IEnumerable(Of File3dmObject), IEnumerable
The File3dmObjectTable type exposes the following members.
Properties
Name | Description
Count
 Gets the number of File3dmObjects in this table.
Item
 Gets the File3dmObject at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
Methods
Name | Description
AddArc(Arc)
Adds a curve object to the document representing an arc.
AddArc(Arc, ObjectAttributes)
Adds a curve object to the document representing an arc.
AddBrep(Brep)
Adds a brep object to Rhino.
AddBrep(Brep, ObjectAttributes)
Adds a brep object to Rhino.
AddCircle(Circle)
Adds a curve object to the document representing a circle.
AddCircle(Circle, ObjectAttributes)
Adds a curve object to the document representing a circle.
AddClippingPlane(Plane, Double, Double, IEnumerable<Guid>)
 Adds a clipping plane object to Rhino.
AddClippingPlane(Plane, Double, Double, Guid)
 Adds a clipping plane object to Rhino.
AddClippingPlane(Plane, Double, Double, IEnumerable<Guid>, ObjectAttributes)
 Adds a clipping plane object to Rhino.
AddCurve(Curve)
Adds a curve object to the table.
AddCurve(Curve, ObjectAttributes)
Adds a curve object to the table.
AddEllipse(Ellipse)
Adds a curve object to the document representing an ellipse.
AddEllipse(Ellipse, ObjectAttributes)
Adds a curve object to the document representing an ellipse.
AddExtrusion(Extrusion)
Adds an extrusion object to Rhino.
AddExtrusion(Extrusion, ObjectAttributes)
Adds an extrusion object to Rhino.
AddHatch(Hatch)
 Adds a hatch to the document.
AddHatch(Hatch, ObjectAttributes)
 Adds a hatch to the document.
AddLeader(IEnumerable<Point3d>)
 Adds an annotation leader to the document. This overload is only provided in the Rhino SDK.
AddLeader(String, IEnumerable<Point3d>)
 Adds an annotation leader to the document. This overload is only provided in the Rhino SDK.
AddLeader(Plane, IEnumerable<Point2d>)
 Adds an annotation leader to the document.
AddLeader(String, Plane, IEnumerable<Point2d>)
 Adds an annotation leader to the document.
AddLeader(Plane, IEnumerable<Point2d>, ObjectAttributes)
 Adds an annotation leader to the document.
AddLeader(String, Plane, IEnumerable<Point2d>, ObjectAttributes)
 Adds an annotation leader to the document.
AddLine(Line)
Adds a line object to Rhino.
AddLine(Line, ObjectAttributes)
Adds a line object to Rhino.
AddLine(Point3d, Point3d)
Adds a line object to Rhino.
AddLine(Point3d, Point3d, ObjectAttributes)
Adds a line object to Rhino.
AddLinearDimension(LinearDimension)
 Adds a linear dimension to the 3dm file object table.
AddLinearDimension(LinearDimension, ObjectAttributes)
 Adds a linear dimension to the 3dm file object table.
AddMesh(Mesh)
Adds a mesh object to Rhino.
AddMesh(Mesh, ObjectAttributes)
Adds a mesh object to Rhino.
AddPoint(Point3d)
Adds a point object to the table.
AddPoint(Point3f)
Adds a point object to the document.
AddPoint(Point3d, ObjectAttributes)
Adds a point object to the document.
AddPoint(Point3f, ObjectAttributes)
Adds a point object to the document.
AddPoint(Double, Double, Double)
 Adds a point object to the table.
AddPointCloud(IEnumerable<Point3d>)
Adds a point cloud object to the document.
AddPointCloud(PointCloud)
Adds a point cloud object to the document.
AddPointCloud(IEnumerable<Point3d>, ObjectAttributes)
Adds a point cloud object to the document.
AddPointCloud(PointCloud, ObjectAttributes)
Adds a point cloud object to the document.
AddPoints(IEnumerable<Point3d>)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3f>)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3d>, ObjectAttributes)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3f>, ObjectAttributes)
 Adds multiple points to the document.
AddPolyline(IEnumerable<Point3d>)
Adds a polyline object to Rhino.
AddPolyline(IEnumerable<Point3d>, ObjectAttributes)
Adds a polyline object to Rhino.
AddSphere(Sphere)
 Adds a surface object to the document representing a sphere.
AddSphere(Sphere, ObjectAttributes)
 Adds a surface object to the document representing a sphere.
AddSurface(Surface)
Adds a surface object to Rhino.
AddSurface(Surface, ObjectAttributes)
Adds a surface object to Rhino.
AddText(Text3d)
 Adds an annotation text object to the document.
AddText(Text3d, ObjectAttributes)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean, ObjectAttributes)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean, TextJustification)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean, TextJustification, ObjectAttributes)
 Adds an annotation text object to the document.
AddTextDot(TextDot)
Adds a text dot object to Rhino.
AddTextDot(String, Point3d)
Adds a text dot object to the table.
AddTextDot(TextDot, ObjectAttributes)
Adds a text dot object to Rhino.
AddTextDot(String, Point3d, ObjectAttributes)
Adds a text dot object to the table.
Delete(IEnumerable<Guid>)
 Deletes a collection of objects from the document.
Delete(Guid)
 Deletes object from document.
Delete(File3dmObject)
 Deletes object from document.
Dump
Prepares a text dump of object table.
FindByLayer
 Finds all File3dmObject that are in a given layer.
GetBoundingBox
Gets the bounding box containing every object in this table.
GetEnumerator
 Gets the enumerator that visits any File3dmObject in this table.
Top
See Also
Reference
Rhino.FileIO Namespace