RhinoCommon SDK
RhinoObject.Attributes Property
Rhino for Mac 5.1
 Gets or sets the object attributes.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectAttributes Attributes { get; set; }
Public Property Attributes As ObjectAttributes
	Get
	Set
Property Value
Type: ObjectAttributes
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace