RhinoCommon SDK
BrepTrim Class
Rhino for Mac 5.1
 Brep trim information is stored in BrepTrim classes. Brep.Trims is an array of all the trims in the brep. A BrepTrim is derived from CurveProxy so the trim can supply easy to use evaluation tools via the Curve virtual member functions. Note well that the domains and orientations of the curve m_C2[trim.m_c2i] and the trim as a curve may not agree.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Curve
 Rhino.Geometry.CurveProxy
 Rhino.Geometry.BrepTrim
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class BrepTrim : CurveProxy
Public Class BrepTrim
	Inherits CurveProxy
The BrepTrim type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this trim.
Edge
 Brep edge this trim belongs to. This will be null for singular trims
Face
 Brep face this trim belongs to
IsoStatus
Loop
 Loop that this trim belongs to
TrimIndex
 Gets the index of this trim in the Brep.Trims collection.
TrimType
Type of trim
Top
Methods
Name | Description
GetTolerances
 The values in tolerance[] record the accuracy of the parameter space trimming curves.
GetTrimParameter
 Get corresponding trim parameter at given edge parameter.
IsReversed
 Get orientation of trim with respect to it's corresponding edge.
SetTolerances
 The values in tolerance[] record the accuracy of the parameter space trimming curves.
SetTrimCurve(Int32)
 Set 2d curve geometry used by a b-rep trim.
SetTrimCurve(Int32, Interval)
 Set 2d curve geometry used by a b-rep trim.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The Nurbs Curves segments do not have fully multiple interior knots.
 3. Rational Nurbs curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent Colinear or Cocircular segments are combined.
Top
See Also
Reference
Rhino.Geometry Namespace