RhinoCommon SDK
GetObject.PassesGeometryAttributeFilter Method
Rhino for Mac 5.1
 Checks geometry to see if it passes the basic GeometryAttributeFilter.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PassesGeometryAttributeFilter(
	RhinoObject rhObject,
	GeometryBase geometry,
	ComponentIndex componentIndex
)
Public Function PassesGeometryAttributeFilter (
	rhObject As RhinoObject,
	geometry As GeometryBase,
	componentIndex As ComponentIndex
) As Boolean
Parameters
rhObject
Type: Rhino.DocObjects.RhinoObject
parent object being considered.
geometry
Type: Rhino.Geometry.GeometryBase
geometry being considered.
componentIndex
Type: Rhino.Geometry.ComponentIndex
if >= 0, geometry is a proper sub-part of object->Geometry() with componentIndex.
Return Value
Type: Boolean
 true if the geometry passes the filter returned by GeometryAttributeFilter().
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace