RhinoCommon SDK
BrepEdge Properties
Rhino for Mac 5.1
The BrepEdge type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this edge.
EdgeIndex
 Gets the index of this edge in the Brep.Edges collection.
EndVertex
 BrepVertex at end of edge
StartVertex
 BrepVertex at start of edge
Tolerance
 Gets or sets the accuracy of the edge curve (>=0.0 or RhinoMath.UnsetValue) A value of UnsetValue indicates that the tolerance should be computed. The maximum distance from the edge's 3d curve to any surface of a face that has this edge as a portion of its boundary must be <= this tolerance.
TrimCount
 Gets the number of trim-curves that use this edge.
Valence
 Gets the topological valency of this edge. The topological valency is defined by how many adjacent faces share this edge.
Top
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace