RhinoCommon SDK
Curve.JoinCurves Method (IEnumerable<Curve>, Double, Boolean)
Rhino for Mac 5.1
 Joins a collection of curve segments together.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] JoinCurves(
	IEnumerable<Curve> inputCurves,
	double joinTolerance,
	bool preserveDirection
)
Public Shared Function JoinCurves (
	inputCurves As IEnumerable(Of Curve),
	joinTolerance As Double,
	preserveDirection As Boolean
) As Curve()
Parameters
inputCurves
Type: System.Collections.Generic.IEnumerable<Curve>
An array, a list or any enumerable set of curve segments to join.
joinTolerance
Type: System.Double
Joining tolerance, i.e. the distance between segment end-points that is allowed.
preserveDirection
Type: System.Boolean
If true, curve endpoints will be compared to curve startpoints.
If false, all start and endpoints will be compared and copies of input curves may be reversed in output.
Return Value
Type: Curve[]
An array of joint curves. This array can be empty.
Exceptions
Exception | Condition
ArgumentNullException | If inputCurves is null.
See Also
Reference
Curve Class
JoinCurves Overload
Rhino.Geometry Namespace