RhinoCommon SDK
Surface.InterpolatedCurveOnSurface Method
Rhino for Mac 5.1
 Constructs an interpolated curve on a surface, using 3D points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsCurve InterpolatedCurveOnSurface(
	IEnumerable<Point3d> points,
	double tolerance
)
Public Function InterpolatedCurveOnSurface (
	points As IEnumerable(Of Point3d),
	tolerance As Double
) As NurbsCurve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable set of points.
tolerance
Type: System.Double
A tolerance value.
Return Value
Type: NurbsCurve
A new nurbs curve, or null on error.
See Also
Reference
Surface Class
Rhino.Geometry Namespace