RhinoCommon SDK
Material Properties
Rhino for Mac 5.1
The Material type exposes the following members.
Properties
Name | Description
AmbientColor
DefaultMaterial
DiffuseColor
EmissionColor
Id
Gets or sets the ID of this material.
IndexOfRefraction
 Gets or sets the index of refraction of the material, generally >= 1.0 (speed of light in vacuum)/(speed of light in material)
IsDefaultMaterial
 By default Rhino layers and objects are assigned the default rendering material.
IsDeleted
 Deleted materials are kept in the runtime material table so that undo will work with materials. Call IsDeleted to determine to determine if a material is deleted.
IsDocumentControlled
 If true this object may not be modified. Any properties or functions that attempt to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.
 (Overrides CommonObject.IsDocumentControlled.)
IsReference
 Rhino allows multiple files to be viewed simultaneously. Materials in the document are "normal" or "reference". Reference materials are not saved.
MaterialIndex
MaxShine
Name
ReflectionColor
Reflectivity
 Gets or sets how reflective a material is, 0f is no reflection 1f is 100% reflective.
RenderPlugInId
 The Id of the RenderPlugIn that is associated with this material.
Shine
 Gets or sets the shine factor of the material.
SpecularColor
Transparency
 Gets or sets the transparency of the material (0.0 = opaque to 1.0 = transparent)
TransparentColor
UseCount
 Number of objects and layers that use this material.
UserStringCount
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace