RhinoCommon SDK
Extrusion.IsMiteredAtStart Property
Rhino for Mac 5.1
 Returns a value indicating whether a miter plane at start is defined.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsMiteredAtStart { get; }
Public ReadOnly Property IsMiteredAtStart As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace