RhinoCommon SDK
FileType Constructor
Rhino for Mac 5.1
Initializes a new instance of the FileType class
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public FileType(
	string extension,
	string description
)
Public Sub New (
	extension As String,
	description As String
)
Parameters
extension
Type: System.String
[Missing <param name="extension"/> documentation for "M:Rhino.FileIO.FileType.#ctor(System.String,System.String)"]
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.FileIO.FileType.#ctor(System.String,System.String)"]
See Also
Reference
FileType Class
Rhino.FileIO Namespace