RhinoCommon SDK
Vector3d.XAxis Property
Rhino for Mac 5.1
 Gets the value of the vector with components 1,0,0.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Vector3d XAxis { get; }
Public Shared ReadOnly Property XAxis As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace