RhinoCommon SDK
Plane.WorldYZ Property
Rhino for Mac 5.1
 plane coincident with the World YZ plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Plane WorldYZ { get; }
Public Shared ReadOnly Property WorldYZ As Plane
	Get
Property Value
Type: Plane
See Also
Reference
Plane Structure
Rhino.Geometry Namespace