RhinoCommon SDK
InstanceDefinitionArchiveFileStatus Enumeration
Rhino for Mac 5.1
 The archive file of a linked instance definition can have the following possible states. Use InstanceObject.ArchiveFileStatus to query a instance definition's archive file status.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum InstanceDefinitionArchiveFileStatus
Public Enumeration InstanceDefinitionArchiveFileStatus
Members
Member name | Value | Description
NotALinkedInstanceDefinition | -3 |  The instance definition is not a linked instance definition.
LinkedFileNotReadable | -2 |  The instance definition's archive file is not readable.
LinkedFileNotFound | -1 |  The instance definition's archive file cannot be found.
LinkedFileIsUpToDate | 0 |  The instance definition's archive file is up-to-date.
LinkedFileIsNewer | 1 |  The instance definition's archive file is newer.
LinkedFileIsOlder | 2 |  The instance definition's archive file is older.
LinkedFileIsDifferent | 3 |  The instance definition's archive file is different.
See Also
Reference
Rhino.DocObjects Namespace