RhinoCommon SDK
Unroller.AddFollowingGeometry Method (IEnumerable<Point3d>, IEnumerable<String>)
Rhino for Mac 5.1
 Adds text dots that should be unrolled along with the surface/brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddFollowingGeometry(
	IEnumerable<Point3d> dotLocations,
	IEnumerable<string> dotText
)
Public Sub AddFollowingGeometry (
	dotLocations As IEnumerable(Of Point3d),
	dotText As IEnumerable(Of String)
)
Parameters
dotLocations
Type: System.Collections.Generic.IEnumerable<Point3d>
An array, a list, or any enumerable set of dot locations.
dotText
Type: System.Collections.Generic.IEnumerable<String>
An array, a list, or any enumerable set of dot strings.
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace