RhinoCommon SDK
Brep.IsValidGeometry Method
Rhino for Mac 5.1
 Expert user function that tests the brep to see if its geometry information is valid. The value of brep.IsValidTopology() must be true before brep.IsValidGeometry() can be safely called.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValidGeometry(
	out string log
)
Public Function IsValidGeometry (
	<OutAttribute> ByRef log As String
) As Boolean
Parameters
log
Type: System.String
 If the brep geometry is not valid, then a brief description of the problem in English is assigned to this out parameter. The information is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool. Otherwise, Empty.
Return Value
Type: Boolean
A value that indicates whether the geometry is valid.
See Also
Reference
Brep Class
Rhino.Geometry Namespace