RhinoCommon SDK
Brep.IsManifold Property
Rhino for Mac 5.1
 Gets a value indicating whether or not the Brep is manifold. Non-Manifold breps have at least one edge that is shared among three or more faces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsManifold { get; }
Public ReadOnly Property IsManifold As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Brep Class
Rhino.Geometry Namespace