RhinoCommon SDK
RhinoView.Maximized Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.RhinoView.Maximized"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Maximized { get; set; }
Public Property Maximized As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoView Class
Rhino.Display Namespace