RhinoCommon SDK
Curve.ChangeClosedCurveSeam Method
Rhino for Mac 5.1
 If this curve is closed, then modify it so that the start/end point is at curve parameter t.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ChangeClosedCurveSeam(
	double t
)
Public Function ChangeClosedCurveSeam (
	t As Double
) As Boolean
Parameters
t
Type: System.Double
 Curve parameter of new start/end point. The returned curves domain will start at t.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace