RhinoCommon SDK
BinaryArchiveReader.ReadPoint Method
Rhino for Mac 5.1
 Reads a Point from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point ReadPoint()
Public Function ReadPoint As Point
Return Value
Type: Point
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace