RhinoCommon SDK
InstanceDefinition.UrlDescription Property
Rhino for Mac 5.1
 The URL description displayed as a hyperlink in the Insert and Block UI
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string UrlDescription { get; }
Public ReadOnly Property UrlDescription As String
	Get
Property Value
Type: String
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace