RhinoCommon SDK
AreaMassProperties.WorldCoordinatesRadiiOfGyration Property
Rhino for Mac 5.1
 Radii of gyration with respect to world coordinate system. X = sqrt(integral of (y^2 + z^2) dm/M) Y = sqrt(integral of (z^2 + x^2) dm/M) Z = sqrt(integral of (z^2 + y^2) dm/M)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d WorldCoordinatesRadiiOfGyration { get; }
Public ReadOnly Property WorldCoordinatesRadiiOfGyration As Vector3d
	Get
Property Value
Type: Vector3d
Remarks
 What is meant by "radii of gyration" varies widely in textbooks and papers. The values returned here are the integrals listed in the Returns section.
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace