RhinoCommon SDK
Color4f.White Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.Color4f.White"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Color4f White { get; }
Public Shared ReadOnly Property White As Color4f
	Get
Property Value
Type: Color4f
See Also
Reference
Color4f Structure
Rhino.Display Namespace