RhinoCommon SDK
MeshFaceList Properties
Rhino for Mac 5.1
The MeshFaceList type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of mesh faces.
Item
 Returns the mesh face at the given index.
QuadCount
 Gets the number of faces that are quads (4 corners).
TriangleCount
 Gets the number of faces that are triangles (3 corners).
Top
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace