RhinoCommon SDK
Surface.IsCylinder Method
Rhino for Mac 5.1
 Determines if the surface is a portion of a cylinder within RhinoMath.ZeroTolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsCylinder()
Public Function IsCylinder As Boolean
Return Value
Type: Boolean
true if the surface is a portion of a cylinder.
See Also
Reference
Surface Class
IsCylinder Overload
Rhino.Geometry Namespace