RhinoCommon SDK
RhinoModifyObjectAttributesEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.RhinoModifyObjectAttributesEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoModifyObjectAttributesEventArgs
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class RhinoModifyObjectAttributesEventArgs : EventArgs
Public Class RhinoModifyObjectAttributesEventArgs
	Inherits EventArgs
The RhinoModifyObjectAttributesEventArgs type exposes the following members.
Properties
Name | Description
Document
NewAttributes
OldAttributes
RhinoObject
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace