RhinoCommon SDK
ObjectAttributes.HasMapping Property
Rhino for Mac 5.1
 A mapping from any plugin source is associated with these attributes Need to do this here to respond correctly to ModifyObjectAttributes event
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool HasMapping { get; }
Public ReadOnly Property HasMapping As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace