RhinoCommon SDK
BrepFace.RebuildEdges Method
Rhino for Mac 5.1
 Rebuild the edges used by a face so they lie on the surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool RebuildEdges(
	double tolerance,
	bool rebuildSharedEdges,
	bool rebuildVertices
)
Public Function RebuildEdges (
	tolerance As Double,
	rebuildSharedEdges As Boolean,
	rebuildVertices As Boolean
) As Boolean
Parameters
tolerance
Type: System.Double
tolerance for fitting 3d edge curves.
rebuildSharedEdges
Type: System.Boolean
 if false and and edge is used by this face and a neighbor, then the edge will be skipped.
rebuildVertices
Type: System.Boolean
 if true, vertex locations are updated to lie on the surface.
Return Value
Type: Boolean
true on success.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace