RhinoCommon SDK
Curve.Rebuild Method
Rhino for Mac 5.1
 Rebuild a curve with a specific point count.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsCurve Rebuild(
	int pointCount,
	int degree,
	bool preserveTangents
)
Public Function Rebuild (
	pointCount As Integer,
	degree As Integer,
	preserveTangents As Boolean
) As NurbsCurve
Parameters
pointCount
Type: System.Int32
Number of control points in the rebuild curve.
degree
Type: System.Int32
Degree of curve. Valid values are between and including 1 and 11.
preserveTangents
Type: System.Boolean
If true, the end tangents of the input curve will be preserved.
Return Value
Type: NurbsCurve
A Nurbs curve on success or null on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace