RhinoCommon SDK
Box.ClosestPoint Method
Rhino for Mac 5.1
 Finds the closest point on or in the Box. The box should be Valid for this to work.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d ClosestPoint(
	Point3d point
)
Public Function ClosestPoint (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
Sample point.
Return Value
Type: Point3d
The point on or in the box that is closest to the sample point.
See Also
Reference
Box Structure
Rhino.Geometry Namespace