RhinoCommon SDK
MeshVertexList Properties
Rhino for Mac 5.1
The MeshVertexList type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of mesh vertices.
Item
 Gets or sets the vertex at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace