RhinoCommon SDK
MeshTopologyVertexList.SortEdges Method
Rhino for Mac 5.1
 Sorts the edge list for the mesh topology vertex list so that the edges are in radial order when you call ConnectedTopologyVertices. A nonmanifold edge is treated as a boundary edge with respect to sorting. If any boundary or nonmanifold edges end at the vertex, then the first edge will be a boundary or nonmanifold edge.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SortEdges()
Public Function SortEdges As Boolean
Return Value
Type: Boolean
true on success.
See Also
Reference
MeshTopologyVertexList Class
SortEdges Overload
Rhino.Geometry.Collections Namespace