RhinoCommon SDK
GetPoint.GetSnapPoints Method
Rhino for Mac 5.1
 Gets current snap points.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d[] GetSnapPoints()
Public Function GetSnapPoints As Point3d()
Return Value
Type: Point3d[]
An array of points.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace