RhinoCommon SDK
BinaryArchiveFile.Reader Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.FileIO.BinaryArchiveFile.Reader"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BinaryArchiveReader Reader { get; }
Public ReadOnly Property Reader As BinaryArchiveReader
	Get
Property Value
Type: BinaryArchiveReader
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace