RhinoCommon SDK
File3dmPlugInData Class
Rhino for Mac 5.1
 Custom data in the file supplied by a plug-in
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmPlugInData
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class File3dmPlugInData
Public Class File3dmPlugInData
The File3dmPlugInData type exposes the following members.
Properties
Name | Description
PlugInId
 Plug-in this data is associated with
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace