RhinoCommon SDK
DisplayPipeline.DrawPointCloud Method (PointCloud, Int32)
Rhino for Mac 5.1
 Draws a point cloud.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawPointCloud(
	PointCloud cloud,
	int size
)
Public Sub DrawPointCloud (
	cloud As PointCloud,
	size As Integer
)
Parameters
cloud
Type: Rhino.Geometry.PointCloud
Point cloud to draw, if the cloud has a color array, it will be used, otherwise the points will be black.
size
Type: System.Int32
Size of points.
See Also
Reference
DisplayPipeline Class
DrawPointCloud Overload
Rhino.Display Namespace