RhinoCommon SDK
InstanceDefinitionTableEventArgs.NewState Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs.NewState"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public InstanceDefinition NewState { get; }
Public ReadOnly Property NewState As InstanceDefinition
	Get
Property Value
Type: InstanceDefinition
See Also
Reference
InstanceDefinitionTableEventArgs Class
Rhino.DocObjects.Tables Namespace