RhinoCommon SDK
ArchivableDictionary.TryGetPoint3f Method
Rhino for Mac 5.1
 Get value as Point3f, will only succeed if value was created using Set(string key, Point3f value)
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetPoint3f(
	string key,
	out Point3f value
)
Public Function TryGetPoint3f (
	key As String,
	<OutAttribute> ByRef value As Point3f
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetPoint3f(System.String,Rhino.Geometry.Point3f@)"]
value
Type: Rhino.Geometry.Point3f
[Missing <param name="value"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetPoint3f(System.String,Rhino.Geometry.Point3f@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetPoint3f(System.String,Rhino.Geometry.Point3f@)"]
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace