RhinoCommon SDK
Interval.FromUnion Method
Rhino for Mac 5.1
 Returns a new Interval which contains both inputs.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Interval FromUnion(
	Interval a,
	Interval b
)
Public Shared Function FromUnion (
	a As Interval,
	b As Interval
) As Interval
Parameters
a
Type: Rhino.Geometry.Interval
The first input interval.
b
Type: Rhino.Geometry.Interval
The second input interval.
Return Value
Type: Interval
The union of an empty set and an increasing interval is the increasing interval.
The union of two empty sets is empty.
The union of an empty set an a non-empty interval is the non-empty interval.
The union of two non-empty intervals is [min(a.Min(),b.Min()), max(a.Max(),b.Max())]
See Also
Reference
Interval Structure
Rhino.Geometry Namespace