RhinoCommon SDK
Sphere Structure
Rhino for Mac 5.1
 Represents the plane and radius values of a sphere.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct Sphere : IEpsilonComparable<Sphere>
<SerializableAttribute>
Public Structure Sphere
	Implements IEpsilonComparable(Of Sphere)
The Sphere type exposes the following members.
Constructors
Name | Description
Sphere(Plane, Double)
 Initializes a new sphere given the plane of the equator circle and radius.
Sphere(Point3d, Double)
 Initializes a new sphere given center point and radius.
Top
Properties
Name | Description
BoundingBox
 Gets the world aligned boundingbox for this Sphere. If the Sphere is Invalid, an empty box is returned.
Center
 Gets or sets the center point of the sphere.
Diameter
 Gets or sets the diameter for this sphere.
EquitorialPlane
 Gets or sets the Equatorial plane for this sphere.
IsValid
 Gets a value that indicates whether the sphere is valid.
NorthPole
 Gets the point at the North Pole of the sphere.
This is the parameterization singularity that can be obtained, at V value +Math.Pi/2.
Radius
 Gets or sets the Radius for this sphere.
SouthPole
 Gets the point at the South Pole of the sphere.
This is the parameterization singularity that can be obtained, at V value -Math.Pi/2.
Unset
 Gets a sphere with invalid members.
Top
Methods
Name | Description
ClosestParameter
 Finds the angle parameters on this sphere that are closest to a test point.
ClosestPoint
 Returns point on sphere that is closest to given point.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
FitSphereToPoints
 Attempts to fit a sphere to a collection of points.
LatitudeDegrees
 Computes the parallel at a specific latitude angle.
The angle is specified in degrees.
LatitudeRadians
 Computes the parallel at a specific latitude angle.
The angle is specified in radians.
LongitudeDegrees
 Computes the meridian at a specific longitude angle.
The angle is specified in degrees.
LongitudeRadians
 Computes the meridian at a specific longitude angle.
The angle is specified in radians.
NormalAt
 Computes the normal at a specific angular location on the sphere.
PointAt
Evaluates the sphere at specific longitude and latitude angles.
Rotate(Double, Vector3d)
 Rotates the sphere about the center point.
Rotate(Double, Vector3d, Point3d)
 Rotates this sphere about a point and an axis.
Rotate(Double, Double, Vector3d)
 Rotates this sphere about the center point.
Rotate(Double, Double, Vector3d, Point3d)
 Rotates this sphere about a point and an axis.
ToBrep
 Converts this sphere is it Brep representation
ToNurbsSurface
 Converts this sphere to its NurbsSurface representation. This is synonymous with calling NurbsSurface.CreateFromSphere().
ToRevSurface
 Converts this Sphere to a RevSurface representation. This is synonymous with calling RevSurface.CreateFromSphere().
Transform
 Transforms this sphere. Note that non-similarity preserving transformations cannot be applied to a sphere as that would result in an ellipsoid.
Translate
 Moves this sphere along a motion vector.
Top
See Also
Reference
Rhino.Geometry Namespace