RhinoCommon SDK
Intersection.MeshLine Method
Rhino for Mac 5.1
 Finds the intersection of a mesh and a line
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d[] MeshLine(
	Mesh mesh,
	Line line,
	out int[] faceIds
)
Public Shared Function MeshLine (
	mesh As Mesh,
	line As Line,
	<OutAttribute> ByRef faceIds As Integer()
) As Point3d()
Parameters
mesh
Type: Rhino.Geometry.Mesh
A mesh to intersect
line
Type: Rhino.Geometry.Line
The line to intersect with the mesh
faceIds
Type: System.Int32[]
The indices of the intersecting faces. This out reference is assigned during the call.
Return Value
Type: Point3d[]
An array of points: one for each face that was passed by the faceIds out reference.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace