RhinoCommon SDK
CommandStyleAttribute Constructor
Rhino for Mac 5.1
 Initializes a new command style attribute class.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public CommandStyleAttribute(
	Style styles
)
Public Sub New (
	styles As Style
)
Parameters
styles
Type: Rhino.Commands.Style
 Set of values combined using a bitwise OR operation to get the desired combination of command styles.
See Also
Reference
CommandStyleAttribute Class
Rhino.Commands Namespace