RhinoCommon SDK
Color4f Methods
Rhino for Mac 5.1
The Color4f type exposes the following members.
Methods
Name | Description
AsSystemColor
BlendTo
Equals |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
Top
See Also
Reference
Color4f Structure
Rhino.Display Namespace