RhinoCommon SDK
ViewportInfo.FrustumAspect Property
Rhino for Mac 5.1
 Setting FrustumAspect changes the larger of the frustum's width/height so that the resulting value of width/height matches the requested aspect. The camera angle is not changed. If you change the shape of the view port with a call SetScreenPort(), then you generally want to call SetFrustumAspect() with the value returned by GetScreenPortAspect().
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double FrustumAspect { get; set; }
Public Property FrustumAspect As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace