RhinoCommon SDK
NurbsSurface.CreateNetworkSurface Method (IEnumerable<Curve>, Int32, Double, Double, Double, Int32)
Rhino for Mac 5.1
 Builds a surface from an autosorted network of curves/edges.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static NurbsSurface CreateNetworkSurface(
	IEnumerable<Curve> curves,
	int continuity,
	double edgeTolerance,
	double interiorTolerance,
	double angleTolerance,
	out int error
)
Public Shared Function CreateNetworkSurface (
	curves As IEnumerable(Of Curve),
	continuity As Integer,
	edgeTolerance As Double,
	interiorTolerance As Double,
	angleTolerance As Double,
	<OutAttribute> ByRef error As Integer
) As NurbsSurface
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
An array, a list or any enumerable set of curves/edges, sorted automatically into U and V curves.
continuity
Type: System.Int32
continuity along edges, 0 = loose, 1 = pos, 2 = tan, 3 = curvature.
edgeTolerance
Type: System.Double
tolerance to use along network surface edge.
interiorTolerance
Type: System.Double
tolerance to use for the interior curves.
angleTolerance
Type: System.Double
angle tolerance to use.
error
Type: System.Int32
 If the NurbsSurface could not be created, the error value describes where the failure occured. 0 = success, 1 = curve sorter failed, 2 = network initializing failed, 3 = failed to build surface, 4 = network surface is not valid.
Return Value
Type: NurbsSurface
A NurbsSurface or null on failure.
See Also
Reference
NurbsSurface Class
CreateNetworkSurface Overload
Rhino.Geometry Namespace