RhinoCommon SDK
InstanceDefinition.GetContainers Method
Rhino for Mac 5.1
 Gets a list of all the InstanceDefinitions that contain a reference this InstanceDefinition.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public InstanceDefinition[] GetContainers()
Public Function GetContainers As InstanceDefinition()
Return Value
Type: InstanceDefinition[]
An array of instance definitions. The returned array can be empty, but not null.
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace