RhinoCommon SDK
BinaryArchiveFile Constructor
Rhino for Mac 5.1
Initializes a new instance of the BinaryArchiveFile class
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BinaryArchiveFile(
	string filename,
	BinaryArchiveMode mode
)
Public Sub New (
	filename As String,
	mode As BinaryArchiveMode
)
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.FileIO.BinaryArchiveFile.#ctor(System.String,Rhino.FileIO.BinaryArchiveMode)"]
mode
Type: Rhino.FileIO.BinaryArchiveMode
[Missing <param name="mode"/> documentation for "M:Rhino.FileIO.BinaryArchiveFile.#ctor(System.String,Rhino.FileIO.BinaryArchiveMode)"]
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace