RhinoCommon SDK
LayerTable.Find Method
Rhino for Mac 5.1
Overload List
Name | Description
Find(Guid, Boolean)
Finds a layer with a matching ID.
Find(String, Boolean)
 Finds the layer with a given name. If multiple layers exist that have the same name, the first match layer index will be returned.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace