RhinoCommon SDK
Curve.DivideAsContour Method
Rhino for Mac 5.1
 Divides this curve at fixed steps along a defined contour line.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d[] DivideAsContour(
	Point3d contourStart,
	Point3d contourEnd,
	double interval
)
Public Function DivideAsContour (
	contourStart As Point3d,
	contourEnd As Point3d,
	interval As Double
) As Point3d()
Parameters
contourStart
Type: Rhino.Geometry.Point3d
The start of the contouring line.
contourEnd
Type: Rhino.Geometry.Point3d
The end of the contouring line.
interval
Type: System.Double
A distance to measure on the contouring axis.
Return Value
Type: Point3d[]
An array of points; or null on error.
See Also
Reference
Curve Class
Rhino.Geometry Namespace