RhinoCommon SDK
Arc.Equality Operator
Rhino for Mac 5.1
 Determines whether two arcs have equal values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator ==(
	Arc a,
	Arc b
)
Public Shared Operator = (
	a As Arc,
	b As Arc
) As Boolean
Parameters
a
Type: Rhino.Geometry.Arc
The first arc.
b
Type: Rhino.Geometry.Arc
The second arc.
Return Value
Type: Boolean
true if all values of the two arcs are exactly equal; otherwise false.
See Also
Reference
Arc Structure
Rhino.Geometry Namespace