RhinoCommon SDK
RenderSettings.BackgroundStyle Property
Rhino for Mac 5.1
 How the viewport's backgroun should be filled.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BackgroundStyle BackgroundStyle { get; set; }
Public Property BackgroundStyle As BackgroundStyle
	Get
	Set
Property Value
Type: BackgroundStyle
See Also
Reference
RenderSettings Class
Rhino.Render Namespace