RhinoCommon SDK
Box.PointAt Method
Rhino for Mac 5.1
 Evaluates the box volume at the given unitized parameters.
The box has idealized side length of 1x1x1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAt(
	double x,
	double y,
	double z
)
Public Function PointAt (
	x As Double,
	y As Double,
	z As Double
) As Point3d
Parameters
x
Type: System.Double
Unitized parameter (between 0 and 1 is inside the box) along box X direction.
y
Type: System.Double
Unitized parameter (between 0 and 1 is inside the box) along box Y direction.
z
Type: System.Double
Unitized parameter (between 0 and 1 is inside the box) along box Z direction.
Return Value
Type: Point3d
The point at (x,y,z).
See Also
Reference
Box Structure
Rhino.Geometry Namespace