RhinoCommon SDK
Matrix Constructor (Int32, Int32)
Rhino for Mac 5.1
 Initializes a new instance of the matrix.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Matrix(
	int rowCount,
	int columnCount
)
Public Sub New (
	rowCount As Integer,
	columnCount As Integer
)
Parameters
rowCount
Type: System.Int32
A positive integer, or 0, for the number of rows.
columnCount
Type: System.Int32
A positive integer, or 0, for the number of columns.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If either rowCount, or columnCount or both are negative.
See Also
Reference
Matrix Class
Matrix Overload
Rhino.Geometry Namespace