RhinoCommon SDK
Vector3d.Transform Method
Rhino for Mac 5.1
 Transforms the vector in place.
The transformation matrix acts on the left of the vector; i.e.,
result = transformation*vector
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Transform(
	Transform transformation
)
Public Sub Transform (
	transformation As Transform
)
Parameters
transformation
Type: Rhino.Geometry.Transform
Transformation matrix to apply.
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace