RhinoCommon SDK
Interval.ParameterAt Method
Rhino for Mac 5.1
Converts normalized parameter to interval value, or pair of values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ParameterAt(
	double normalizedParameter
)
Public Function ParameterAt (
	normalizedParameter As Double
) As Double
Parameters
normalizedParameter
Type: System.Double
[Missing <param name="normalizedParameter"/> documentation for "M:Rhino.Geometry.Interval.ParameterAt(System.Double)"]
Return Value
Type: Double
Interval parameter min*(1.0-normalizedParameter) + max*normalizedParameter.
See Also
Reference
Interval Structure
Rhino.Geometry Namespace
NormalizedParameterAt