RhinoCommon SDK
CustomGripObject.Dispose Method
Rhino for Mac 5.1
Overload List
Name | Description
Dispose()
Releases all resources used by the CustomGripObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomGripObject and optionally releases the managed resources
Top
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace