RhinoCommon SDK
PlaneCircleIntersection Enumeration
Rhino for Mac 5.1
 Represents all possible cases of a Plane|Circle intersection event.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum PlaneCircleIntersection
Public Enumeration PlaneCircleIntersection
Members
Member name | Value | Description
None | 0 |  No intersections. Either because radius is too small or because circle plane is parallel but not coincident with the intersection plane.
Tangent | 1 |  Tangent (one point) intersection.
Secant | 2 |  Secant (two point) intersection.
Parallel | 3 |  Circle and plane are planar but not coincident. Parallel indicates no intersection took place.
Coincident | 4 |  Circle and plane are co-planar, they intersect everywhere.
See Also
Reference
Rhino.Geometry.Intersect Namespace