RhinoCommon SDK
BinaryArchiveReader.ReadPointF Method
Rhino for Mac 5.1
 Reads a PointF from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PointF ReadPointF()
Public Function ReadPointF As PointF
Return Value
Type: PointF
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace