RhinoCommon SDK
Linetype.RemoveSegment Method
Rhino for Mac 5.1
Removes a segment in the linetype.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool RemoveSegment(
	int index
)
Public Function RemoveSegment (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
Zero based index of the segment to remove.
Return Value
Type: Boolean
true if the segment index was removed.
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace