RhinoCommon SDK
GumballAppearanceSettings.ScaleZEnabled Property
Rhino for Mac 5.1
 When ScaleZEnabled is true, the Z scale control is available. The default setting is true.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ScaleZEnabled { get; set; }
Public Property ScaleZEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace