RhinoCommon SDK
FileExportPlugIn.WriteFile Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.PlugIns.FileExportPlugIn.WriteFile(System.String,System.Int32,Rhino.RhinoDoc,Rhino.FileIO.FileWriteOptions)"]
Namespace: Rhino.PlugIns
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected abstract WriteFileResult WriteFile(
	string filename,
	int index,
	RhinoDoc doc,
	FileWriteOptions options
)
Protected MustOverride Function WriteFile (
	filename As String,
	index As Integer,
	doc As RhinoDoc,
	options As FileWriteOptions
) As WriteFileResult
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.PlugIns.FileExportPlugIn.WriteFile(System.String,System.Int32,Rhino.RhinoDoc,Rhino.FileIO.FileWriteOptions)"]
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.PlugIns.FileExportPlugIn.WriteFile(System.String,System.Int32,Rhino.RhinoDoc,Rhino.FileIO.FileWriteOptions)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.PlugIns.FileExportPlugIn.WriteFile(System.String,System.Int32,Rhino.RhinoDoc,Rhino.FileIO.FileWriteOptions)"]
options
Type: Rhino.FileIO.FileWriteOptions
[Missing <param name="options"/> documentation for "M:Rhino.PlugIns.FileExportPlugIn.WriteFile(System.String,System.Int32,Rhino.RhinoDoc,Rhino.FileIO.FileWriteOptions)"]
Return Value
Type: WriteFileResult
[Missing <returns> documentation for "M:Rhino.PlugIns.FileExportPlugIn.WriteFile(System.String,System.Int32,Rhino.RhinoDoc,Rhino.FileIO.FileWriteOptions)"]
See Also
Reference
FileExportPlugIn Class
Rhino.PlugIns Namespace