RhinoCommon SDK
Circle.TryFitCircleTTT Method
Rhino for Mac 5.1
 Try to fit a circle to three curves using tangent relationships.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Circle TryFitCircleTTT(
	Curve c1,
	Curve c2,
	Curve c3,
	double t1,
	double t2,
	double t3
)
Public Shared Function TryFitCircleTTT (
	c1 As Curve,
	c2 As Curve,
	c3 As Curve,
	t1 As Double,
	t2 As Double,
	t3 As Double
) As Circle
Parameters
c1
Type: Rhino.Geometry.Curve
First curve to touch.
c2
Type: Rhino.Geometry.Curve
Second curve to touch.
c3
Type: Rhino.Geometry.Curve
Third curve to touch.
t1
Type: System.Double
Parameter on first curve close to desired solution.
t2
Type: System.Double
Parameter on second curve closet to desired solution.
t3
Type: System.Double
Parameter on third curve close to desired solution.
Return Value
Type: Circle
Valid circle on success, Circle.Unset on failure.
See Also
Reference
Circle Structure
Rhino.Geometry Namespace