RhinoCommon SDK
Hatch.Get3dCurves Method
Rhino for Mac 5.1
 Gets 3d curves that define the boundaries of the hatch
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] Get3dCurves(
	bool outer
)
Public Function Get3dCurves (
	outer As Boolean
) As Curve()
Parameters
outer
Type: System.Boolean
true to get the outer curves, false to get the inner curves
Return Value
Type: Curve[]
[Missing <returns> documentation for "M:Rhino.Geometry.Hatch.Get3dCurves(System.Boolean)"]
See Also
Reference
Hatch Class
Rhino.Geometry Namespace