RhinoCommon SDK
CustomMeshObject Constructor
Rhino for Mac 5.1
Initializes a new instance of the CustomMeshObject class
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected CustomMeshObject()
Protected Sub New
See Also
Reference
CustomMeshObject Class
CustomMeshObject Overload
Rhino.DocObjects.Custom Namespace