RhinoCommon SDK
MaterialRefs.Contains Method
Rhino for Mac 5.1
 Determines whether this dictionary contains a specific value.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Contains(
	KeyValuePair<Guid, MaterialRef> item
)
Public Function Contains (
	item As KeyValuePair(Of Guid, MaterialRef)
) As Boolean
Parameters
item
Type: System.Collections.Generic.KeyValuePair<Guid, MaterialRef>
 The object to locate in this dictionary.
Return Value
Type: Boolean
 true if item is found in this dictionary; otherwise, false.
Implements
ICollection<T>.Contains(T)
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace