RhinoCommon SDK
DisplayConduit.DrawForeground Method
Rhino for Mac 5.1
 Called after all non-highlighted objects have been drawn and PostDrawObjects has been called. Depth writing and testing are turned OFF. If you want to draw with depth writing/testing, see PostDrawObjects.
The default implementation does nothing.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void DrawForeground(
	DrawEventArgs e
)
Protected Overridable Sub DrawForeground (
	e As DrawEventArgs
)
Parameters
e
Type: Rhino.Display.DrawEventArgs
The event argument contains the current viewport and display state.
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace