RhinoCommon SDK
BinaryArchiveReader.ReadShort Method
Rhino for Mac 5.1
 Reads a Int16 from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public short ReadShort()
Public Function ReadShort As Short
Return Value
Type: Int16
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace