RhinoCommon SDK
InstanceDefinitionTable.UpdateLinkedInstanceDefinition Method
Rhino for Mac 5.1
 Read the objects from a file and use them as the instance's definition geometry.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateLinkedInstanceDefinition(
	int idefIndex,
	string filename,
	bool updateNestedLinks,
	bool quiet
)
Public Function UpdateLinkedInstanceDefinition (
	idefIndex As Integer,
	filename As String,
	updateNestedLinks As Boolean,
	quiet As Boolean
) As Boolean
Parameters
idefIndex
Type: System.Int32
 zero based index of instance definition to delete. This must be in the range 0 <= idefIndex < InstanceDefinitionTable.Count.
filename
Type: System.String
 name of file (can be any type of file that Rhino or a plug-in can read)
updateNestedLinks
Type: System.Boolean
 If true and the instance definition referes to a linked instance definition, that needs to be updated, then the nested defition is also updated. If false, nested updates are skipped.
quiet
Type: System.Boolean
[Missing <param name="quiet"/> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.UpdateLinkedInstanceDefinition(System.Int32,System.String,System.Boolean,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.UpdateLinkedInstanceDefinition(System.Int32,System.String,System.Boolean,System.Boolean)"]
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace