RhinoCommon SDK
GetPointMouseEventArgs.LeftButtonDown Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.LeftButtonDown"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool LeftButtonDown { get; }
Public ReadOnly Property LeftButtonDown As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace