RhinoCommon SDK
BinaryArchiveWriter.BeginWrite3dmChunk Method (UInt32, Int64)
Rhino for Mac 5.1
 Begins writing a chunk
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool BeginWrite3dmChunk(
	uint typecode,
	long value
)
Public Function BeginWrite3dmChunk (
	typecode As UInteger,
	value As Long
) As Boolean
Parameters
typecode
Type: System.UInt32
[Missing <param name="typecode"/> documentation for "M:Rhino.FileIO.BinaryArchiveWriter.BeginWrite3dmChunk(System.UInt32,System.Int64)"]
value
Type: System.Int64
[Missing <param name="value"/> documentation for "M:Rhino.FileIO.BinaryArchiveWriter.BeginWrite3dmChunk(System.UInt32,System.Int64)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveWriter.BeginWrite3dmChunk(System.UInt32,System.Int64)"]
See Also
Reference
BinaryArchiveWriter Class
BeginWrite3dmChunk Overload
Rhino.FileIO Namespace