RhinoCommon SDK
MaelstromSpaceMorph Constructor
Rhino for Mac 5.1
 Constructs a maelstrom space morph.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MaelstromSpaceMorph(
	Plane plane,
	double radius0,
	double radius1,
	double angle
)
Public Sub New (
	plane As Plane,
	radius0 As Double,
	radius1 As Double,
	angle As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
Plane on which the base circle will lie. Origin of the plane will be the center point of the circle.
radius0
Type: System.Double
First radius.
radius1
Type: System.Double
Second radius.
angle
Type: System.Double
Coil angle in radians.
Remarks
 If radius0 = radius1 > 0, then the morph is a rotation where the angle of rotation is proportional to the radius. If radius0 < radius1, then everything inside of the circle of radius radius0 if fixed, the rotation angle increases smoothly from 0 at radius0 to m_a at radius1, and everything outside of the circle of radius radius1 is rotated by angle. If radius0 > radius1, then everything outside of the circle of radius radius0 if fixed, the rotation angle increases smoothly from 0 at radius0 to m_a at radius1, and everything inside of the circle of radius radius1 is rotated by angle.
See Also
Reference
MaelstromSpaceMorph Class
Rhino.Geometry.Morphs Namespace