RhinoCommon SDK
OptionColor Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Input.Custom.OptionColor"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.OptionColor
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class OptionColor : IDisposable
Public Class OptionColor
	Implements IDisposable
The OptionColor type exposes the following members.
Constructors
Name | Description
OptionColor
Initializes a new instance of the OptionColor class
Top
Properties
Name | Description
CurrentValue
InitialValue
Top
Methods
Name | Description
Dispose()
Releases all resources used by the OptionColor
Dispose(Boolean)
Releases the unmanaged resources used by the OptionColor and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Input.Custom Namespace