RhinoCommon SDK
ColorLAB Type Conversions
Rhino for Mac 5.1
The ColorLAB type exposes the following members.
Operators
Name | Description
Implicit(ColorLAB to Color)
 Implicitly converts a LAB color into a .Net library color.
Top
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace