RhinoCommon SDK
AppearanceSettingsState.PageviewPaperColor Property
Rhino for Mac 5.1
 CRhinoPageView paper background. A rectangle is drawn into the background of page views to represent the printed area. The alpha portion of the color is used to draw the paper blended into the background
Namespace: Rhino.ApplicationSettings
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color PageviewPaperColor { get; set; }
Public Property PageviewPaperColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace