RhinoCommon SDK
GetPointMouseEventArgs Properties
Rhino for Mac 5.1
The GetPointMouseEventArgs type exposes the following members.
Properties
Name | Description
ControlKeyDown
LeftButtonDown
MiddleButtonDown
Point
RightButtonDown
ShiftKeyDown
Source
Viewport
WindowPoint
Top
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace