RhinoCommon SDK
Brep.Loops Property
Rhino for Mac 5.1
 Gets the brep loop list accessor.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepLoopList Loops { get; }
Public ReadOnly Property Loops As BrepLoopList
	Get
Property Value
Type: BrepLoopList
See Also
Reference
Brep Class
Rhino.Geometry Namespace