RhinoCommon SDK
Brep.Trims Property
Rhino for Mac 5.1
 Gets the brep trims list accessor.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepTrimList Trims { get; }
Public ReadOnly Property Trims As BrepTrimList
	Get
Property Value
Type: BrepTrimList
See Also
Reference
Brep Class
Rhino.Geometry Namespace