RhinoCommon SDK
AreaMassProperties Methods
Rhino for Mac 5.1
The AreaMassProperties type exposes the following members.
Methods
Name | Description
Compute(Brep)
 Computes an AreaMassProperties for a brep.
Compute(Curve)
 Computes an AreaMassProperties for a closed planar curve.
Compute(IEnumerable<GeometryBase>)
 Computes the Area properties for a collection of geometric objects. At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
Compute(Hatch)
 Computes an AreaMassProperties for a hatch.
Compute(Mesh)
 Computes an AreaMassProperties for a mesh.
Compute(Surface)
 Computes an AreaMassProperties for a surface.
Compute(Curve, Double)
 Computes an AreaMassProperties for a closed planar curve.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Top
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace