RhinoCommon SDK
Text3d.FontFace Property
Rhino for Mac 5.1
 Gets or sets the FontFace name.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string FontFace { get; set; }
Public Property FontFace As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Text3d Class
Rhino.Display Namespace