RhinoCommon SDK
GetObject.SetPressEnterWhenDonePrompt Method
Rhino for Mac 5.1
 The default prompt when EnablePressEnterWhenDonePrompt is enabled is "Press Enter when done". Use this function to specify a different string to be appended.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetPressEnterWhenDonePrompt(
	string prompt
)
Public Sub SetPressEnterWhenDonePrompt (
	prompt As String
)
Parameters
prompt
Type: System.String
The text that will be displayed just after the prompt, after the selection has been made.
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace