RhinoCommon SDK
NurbsSurfacePointList.SetControlPoint Method
Rhino for Mac 5.1
Overload List
Name | Description
SetControlPoint(Int32, Int32, ControlPoint)
 Sets the control point at the given (u, v) index.
SetControlPoint(Int32, Int32, Point3d)
 Sets the control point at the given (u, v) index.
Top
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace