RhinoCommon SDK
DisplayPipeline.PushCullFaceMode Method
Rhino for Mac 5.1
 Push a FaceCull flag on the engine's stack.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PushCullFaceMode(
	CullFaceMode mode
)
Public Sub PushCullFaceMode (
	mode As CullFaceMode
)
Parameters
mode
Type: Rhino.Display.CullFaceMode
FaceCull flag.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace