RhinoCommon SDK
File3dmSettings.PageUnitSystem Property
Rhino for Mac 5.1
 Gets or sets the page unit system, using UnitSystem enumeration.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public UnitSystem PageUnitSystem { get; set; }
Public Property PageUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace