RhinoCommon SDK
GetPoint.EnableCurveSnapArrow Method
Rhino for Mac 5.1
 Controls display of the curve snap arrow icon.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableCurveSnapArrow(
	bool drawDirectionArrowAtSnapPoint,
	bool reverseArrow
)
Public Sub EnableCurveSnapArrow (
	drawDirectionArrowAtSnapPoint As Boolean,
	reverseArrow As Boolean
)
Parameters
drawDirectionArrowAtSnapPoint
Type: System.Boolean
 true to draw arrow icon whenever GetPoint snaps to a curve.
reverseArrow
Type: System.Boolean
 true if arrow icon direction should be the reverse of the first derivative direction.
Remarks
 The tangent bar is drawn by GetPoint::DynamicDraw. If you override GetPoint::DynamicDraw, then you must call the base class function.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace