RhinoCommon SDK
ColorCMYK Structure
Rhino for Mac 5.1
 Represents a CMYK (Cyan, Magenta, Yellow, Key) color with double precision floating point channels. CMYK colors are used primarily in printing environments as they provide a good simulation of physical ink.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct ColorCMYK
<SerializableAttribute>
Public Structure ColorCMYK
The ColorCMYK type exposes the following members.
Constructors
Name | Description
ColorCMYK(Color)
 Initializes a new instance of ColorCMYK that is equivalent to an RGB color.
ColorCMYK(Double, Double, Double)
 Initializes a new instance of ColorCMYK with custom channel values. The cyan, magenta and yellow values will be adjusted based on their combined darkness.
ColorCMYK(Double, Double, Double, Double)
 Initializes a new instance of ColorCMYK with custom channel values.
ColorCMYK(Double, Double, Double, Double, Double)
 Initializes a new instance of ColorCMYK with custom channel values.
Top
Properties
Name | Description
A
 Gets or sets the Alpha channel value. Alpha channels are limited to the 0~1 range.
C
 Gets or sets the Cyan channel value. Cyan channels are limited to the 0~1 range.
K
 Gets or sets the Key channel value. Key channels are limited to the 0~1 range.
M
 Gets or sets the Magenta channel value. Magenta channels are limited to the 0~1 range.
Y
 Gets or sets the Yellow channel value. Yellow channels are limited to the 0~1 range.
Top
Methods
Name | Description
CreateFromHSL
 Constructs the nearest CMYK equivalent of an HSL color.
CreateFromLAB
 Constructs the nearest CMYK equivalent of a LAB color.
CreateFromLCH
 Constructs the nearest CMYK equivalent of a LCH color.
CreateFromXYZ
 Constructs the nearest CMYK equivalent of an XYZ color.
Top
Operators
Name | Description
Implicit(ColorCMYK to Color)
 Implicitly converts a CMYK color into a .Net library color.
Top
See Also
Reference
Rhino.Display Namespace