RhinoCommon SDK
Panels.RegisterPanel Method
Rhino for Mac 5.1
 You typically register your panel class in your plug-in's OnLoad function. This will register your custom call with Rhino, Rhino will create an instance of your class the first time your panel is created and embed this instance of your class in a panel container.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void RegisterPanel(
	PlugIn plugin,
	Type panelType,
	string caption,
	Icon icon
)
Public Shared Sub RegisterPanel (
	plugin As PlugIn,
	panelType As Type,
	caption As String,
	icon As Icon
)
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
Plug-in this panel is associated with
panelType
Type: System.Type
 Class type to construct when a panel is shown. If your class is derived from Eto.Forms.Control it will work on both the Mac and Windows version of Rhino. In addition Windows Rhino will support any class types that implement the IWin32Window interface or that are derived from System.Windows.FrameworkElement. Mac Rhino will also support classes that are derived from NsView. In addition to the type requirements the class must have a public constructor with no parameters and and have a GuidAttribute applied with a unique Id.
caption
Type: System.String
 Displays in the panel tab on Windows or at the top of the modeless window on Mac.
icon
Type: System.Drawing.Icon
 Currently only used in Windows, use a 32bit depth icon in order to get proper transparency.
See Also
Reference
Panels Class
Rhino.UI Namespace