RhinoCommon SDK
ColorHSL.CreateFromLAB Method
Rhino for Mac 5.1
 Create the nearest HSL equivalent of a LAB color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorHSL CreateFromLAB(
	ColorLAB lab
)
Public Shared Function CreateFromLAB (
	lab As ColorLAB
) As ColorHSL
Parameters
lab
Type: Rhino.Display.ColorLAB
Target color in LAB space.
Return Value
Type: ColorHSL
The HSL equivalent of the LAB color.
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace