RhinoCommon SDK
Cylinder.LineAt Method
Rhino for Mac 5.1
 Compute the line at the given angle parameter. This line will be degenerate if the cylinder is infite.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line LineAt(
	double angularParameter
)
Public Function LineAt (
	angularParameter As Double
) As Line
Parameters
angularParameter
Type: System.Double
Angle parameter for line section.
Return Value
Type: Line
[Missing <returns> documentation for "M:Rhino.Geometry.Cylinder.LineAt(System.Double)"]
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace