RhinoCommon SDK
Vector3d.IsUnitVector Property
Rhino for Mac 5.1
 Gets a value indicating whether or not this is a unit vector. A unit vector has length 1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsUnitVector { get; }
Public ReadOnly Property IsUnitVector As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace