RhinoCommon SDK
MaterialTable.Count Property
Rhino for Mac 5.1
 Returns number of materials in the material table, including deleted materials.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace