RhinoCommon SDK
MeshingParameters.RefineAngle Property
Rhino for Mac 5.1
 Gets or sets the mesh parameter refine angle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double RefineAngle { get; set; }
Public Property RefineAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace