RhinoCommon SDK
Cone.AngleInDegrees Method
Rhino for Mac 5.1
 Computes the angle (in degrees) between the axis and the side of the cone. The angle and the height have the same sign.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double AngleInDegrees()
Public Function AngleInDegrees As Double
Return Value
Type: Double
An angle in degrees.
See Also
Reference
Cone Structure
Rhino.Geometry Namespace