RhinoCommon SDK
Texture.ApplyUvwTransform Property
Rhino for Mac 5.1
 If true then the UVW transform is applied to the texture otherwise the UVW transform is ignored.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ApplyUvwTransform { get; set; }
Public Property ApplyUvwTransform As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Texture Class
Rhino.DocObjects Namespace