RhinoCommon SDK
BinaryArchiveReader.ReadVector3f Method
Rhino for Mac 5.1
 Reads a Vector3f from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3f ReadVector3f()
Public Function ReadVector3f As Vector3f
Return Value
Type: Vector3f
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace