RhinoCommon SDK
Rectangle3d.CreateFromPolyline Method (IEnumerable<Point3d>)
Rhino for Mac 5.1
 Attempts to create a rectangle from a polyline. In order for the polyline to qualify as a rectangle, it must have 4 or 5 corner points (i.e. it need not be closed).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Rectangle3d CreateFromPolyline(
	IEnumerable<Point3d> polyline
)
Public Shared Function CreateFromPolyline (
	polyline As IEnumerable(Of Point3d)
) As Rectangle3d
Parameters
polyline
Type: System.Collections.Generic.IEnumerable<Point3d>
Polyline to parse.
Return Value
Type: Rectangle3d
A rectangle that is shaped similarly to the polyline or Rectangle3d.Unset if the polyline does not represent a rectangle.
See Also
Reference
Rectangle3d Structure
CreateFromPolyline Overload
Rhino.Geometry Namespace