RhinoCommon SDK
SurfaceObject Class
Rhino for Mac 5.1
 Represents a surface in a document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.SurfaceObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class SurfaceObject : RhinoObject
Public Class SurfaceObject
	Inherits RhinoObject
The SurfaceObject type exposes the following members.
Properties
Name | Description
SurfaceGeometry
 Gets the surface geometry linked with this object.
Top
Methods
Name | Description
DuplicateSurfaceGeometry
 Constructs a new deep copy of the surface geometry.
Top
See Also
Reference
Rhino.DocObjects Namespace