RhinoCommon SDK
StatusBar.HideProgressMeter Method
Rhino for Mac 5.1
 Ends, or hides, Rhino's status bar progress meter.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void HideProgressMeter()
Public Shared Sub HideProgressMeter
See Also
Reference
StatusBar Class
Rhino.UI Namespace