RhinoCommon SDK
DisplayPipelineAttributes.LocalName Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.LocalName"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string LocalName { get; }
Public ReadOnly Property LocalName As String
	Get
Property Value
Type: String
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace