RhinoCommon SDK
LinetypeTable.Add Method (Linetype)
Rhino for Mac 5.1
 Adds a new linetype with specified definition to the linetype table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	Linetype linetype
)
Public Function Add (
	linetype As Linetype
) As Integer
Parameters
linetype
Type: Rhino.DocObjects.Linetype
 Definition of new linetype. The information in linetype is copied. If linetype.Name is empty then a unique name of the form "Linetype 01" will be automatically created.
Return Value
Type: Int32
 Index of newline type or -1 on error.
See Also
Reference
LinetypeTable Class
Add Overload
Rhino.DocObjects.Tables Namespace