RhinoCommon SDK
LightObject.DuplicateLightGeometry Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.LightObject.DuplicateLightGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Light DuplicateLightGeometry()
Public Function DuplicateLightGeometry As Light
Return Value
Type: Light
[Missing <returns> documentation for "M:Rhino.DocObjects.LightObject.DuplicateLightGeometry"]
See Also
Reference
LightObject Class
Rhino.DocObjects Namespace