RhinoCommon SDK
GetBaseClass.Line2d Method
Rhino for Mac 5.1
 Returns two points defining the location in the view window of the 2d line selected in GetPoint::Get2dLine().
(0,0) = upper left corner of window.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point[] Line2d()
Public Function Line2d As Point()
Return Value
Type: Point[]
An array with two 2D points.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace