RhinoCommon SDK
ObjectTable.Duplicate Method (ObjRef)
Rhino for Mac 5.1
 Duplicates the object that is referenced by objref.
Same as Transform(objref, Transform.Identity, false)
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Duplicate(
	ObjRef objref
)
Public Function Duplicate (
	objref As ObjRef
) As Guid
Parameters
objref
Type: Rhino.DocObjects.ObjRef
A Rhino object reference to follow for object duplication.
Return Value
Type: Guid
The new object ID.
See Also
Reference
ObjectTable Class
Duplicate Overload
Rhino.DocObjects.Tables Namespace