RhinoCommon SDK
Particle.ParentSystem Property
Rhino for Mac 5.1
 Gets the parent particle system of this particle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ParticleSystem ParentSystem { get; }
Public ReadOnly Property ParentSystem As ParticleSystem
	Get
Property Value
Type: ParticleSystem
See Also
Reference
Particle Class
Rhino.Geometry Namespace