RhinoCommon SDK
File3dmObjectTable.AddSphere Method (Sphere, ObjectAttributes)
Rhino for Mac 5.1
 Adds a surface object to the document representing a sphere.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddSphere(
	Sphere sphere,
	ObjectAttributes attributes
)
Public Function AddSphere (
	sphere As Sphere,
	attributes As ObjectAttributes
) As Guid
Parameters
sphere
Type: Rhino.Geometry.Sphere
A sphere to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to link with the sphere.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddSphere Overload
Rhino.FileIO Namespace