RhinoCommon SDK
GripObject.CurrentLocation Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.GripObject.CurrentLocation"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d CurrentLocation { get; set; }
Public Property CurrentLocation As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace