RhinoCommon SDK
SweepTwoRail.PerformSweep Method (Curve, Curve, Curve)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] PerformSweep(
	Curve rail1,
	Curve rail2,
	Curve crossSection
)
Public Function PerformSweep (
	rail1 As Curve,
	rail2 As Curve,
	crossSection As Curve
) As Brep()
Parameters
rail1
Type: Rhino.Geometry.Curve
[Missing <param name="rail1"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve)"]
rail2
Type: Rhino.Geometry.Curve
[Missing <param name="rail2"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve)"]
crossSection
Type: Rhino.Geometry.Curve
[Missing <param name="crossSection"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve)"]
Return Value
Type: Brep[]
[Missing <returns> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve)"]
See Also
Reference
SweepTwoRail Class
PerformSweep Overload
Rhino.Geometry Namespace