RhinoCommon SDK
GripsDrawEventArgs.ControlPolygonStyle Property
Rhino for Mac 5.1
 What kind of line is used to display things like control polygons. 0 = no control polygon, 1 = solid control polygon, 2 = dotted control polygon.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ControlPolygonStyle { get; set; }
Public Property ControlPolygonStyle As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace