RhinoCommon SDK
Line.TryFitLineToPoints Method
Rhino for Mac 5.1
 Attempt to fit a line through a set of points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool TryFitLineToPoints(
	IEnumerable<Point3d> points,
	out Line fitLine
)
Public Shared Function TryFitLineToPoints (
	points As IEnumerable(Of Point3d),
	<OutAttribute> ByRef fitLine As Line
) As Boolean
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
The points through which to fit.
fitLine
Type: Rhino.Geometry.Line
The resulting line on success.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Line Structure
Rhino.Geometry Namespace