RhinoCommon SDK
GumballPickResult Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.Gumball.GumballPickResult"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Gumball.GumballPickResult
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class GumballPickResult
Public Class GumballPickResult
The GumballPickResult type exposes the following members.
Properties
Name | Description
Mode
Top
Methods
Name | Description
SetToDefault
Top
See Also
Reference
Rhino.UI.Gumball Namespace