RhinoCommon SDK
Polyline.ClosestParameter Method
Rhino for Mac 5.1
 Gets the parameter along the polyline which is closest to a test-point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ClosestParameter(
	Point3d testPoint
)
Public Function ClosestParameter (
	testPoint As Point3d
) As Double
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to approximate.
Return Value
Type: Double
The parameter along the polyline closest to testPoint.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace