RhinoCommon SDK
Brep.AddEdgeCurve Method
Rhino for Mac 5.1
 Add a 3d curve used by the brep edges
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddEdgeCurve(
	Curve curve
)
Public Function AddEdgeCurve (
	curve As Curve
) As Integer
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.Geometry.Brep.AddEdgeCurve(Rhino.Geometry.Curve)"]
Return Value
Type: Int32
 Index used to reference this geometry in the edge curve list
See Also
Reference
Brep Class
Rhino.Geometry Namespace