RhinoCommon SDK
RhinoObject.GetSubObjects Method
Rhino for Mac 5.1
 Gets an array of sub-objects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject[] GetSubObjects()
Public Function GetSubObjects As RhinoObject()
Return Value
Type: RhinoObject[]
An array of subobjects, or null if there are none.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace