RhinoCommon SDK
RhinoObject.HasDynamicTransform Property
Rhino for Mac 5.1
 True if the object has a dynamic transformation
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool HasDynamicTransform { get; }
Public ReadOnly Property HasDynamicTransform As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace