RhinoCommon SDK
Curve.GetPerpendicularFrames Method
Rhino for Mac 5.1
 Gets a collection of perpendicular frames along the curve. Perpendicular frames are also known as 'Zero-twisting frames' and they minimize rotation from one frame to the next.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Plane[] GetPerpendicularFrames(
	IEnumerable<double> parameters
)
Public Function GetPerpendicularFrames (
	parameters As IEnumerable(Of Double)
) As Plane()
Parameters
parameters
Type: System.Collections.Generic.IEnumerable<Double>
A collection of strictly increasing curve parameters to place perpendicular frames on.
Return Value
Type: Plane[]
An array of perpendicular frames on success or null on failure.
Exceptions
Exception | Condition
InvalidOperationException | Thrown when the curve parameters are not increasing.
See Also
Reference
Curve Class
Rhino.Geometry Namespace