RhinoCommon SDK
CustomObjectGrips Constructor
Rhino for Mac 5.1
Initializes a new instance of the CustomObjectGrips class
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected CustomObjectGrips()
Protected Sub New
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace