RhinoCommon SDK
Surface.Split Method
Rhino for Mac 5.1
 Splits (divides) the surface into two parts at the specified parameter
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface[] Split(
	int direction,
	double parameter
)
Public Function Split (
	direction As Integer,
	parameter As Double
) As Surface()
Parameters
direction
Type: System.Int32
 0 = The surface is split vertically. The "west" side is returned as the first surface in the array and the "east" side is returned as the second surface in the array. 1 = The surface is split horizontally. The "south" side is returned as the first surface in the array and the "north" side is returned as the second surfae in the array
parameter
Type: System.Double
 value of constant parameter in interval returned by Domain(direction)
Return Value
Type: Surface[]
Array of two surfaces on success
See Also
Reference
Surface Class
Rhino.Geometry Namespace