RhinoCommon SDK
LinetypeTable.Count Property
Rhino for Mac 5.1
 Returns number of linetypes in the linetypes table, including deleted linetypes.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace