RhinoCommon SDK
Vector3d.CrossProduct Method
Rhino for Mac 5.1
 Computes the cross product (or vector product, or exterior product) of two vectors.
This operation is not commutative.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Vector3d CrossProduct(
	Vector3d a,
	Vector3d b
)
Public Shared Function CrossProduct (
	a As Vector3d,
	b As Vector3d
) As Vector3d
Parameters
a
Type: Rhino.Geometry.Vector3d
First vector.
b
Type: Rhino.Geometry.Vector3d
Second vector.
Return Value
Type: Vector3d
A new vector that is perpendicular to both a and b,
has Length == a.Length * b.Length and
with a result that is oriented following the right hand rule.
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace