RhinoCommon SDK
Interval.IsDecreasing Property
Rhino for Mac 5.1
 Returns true if T[0] > T[1].
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsDecreasing { get; }
Public ReadOnly Property IsDecreasing As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Interval Structure
Rhino.Geometry Namespace