RhinoCommon SDK
NurbsSurface.OrderV Property
Rhino for Mac 5.1
 Gets the order in the V direction.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int OrderV { get; }
Public ReadOnly Property OrderV As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace