RhinoCommon SDK
MeshFaceList.ToIntArray Method
Rhino for Mac 5.1
 Copies all of the faces to a linear integer of indices
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] ToIntArray(
	bool asTriangles
)
Public Function ToIntArray (
	asTriangles As Boolean
) As Integer()
Parameters
asTriangles
Type: System.Boolean
If set to true as triangles.
Return Value
Type: Int32[]
The int array.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace