RhinoCommon SDK
Box.Volume Property
Rhino for Mac 5.1
 Gets the total volume of this box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Volume { get; }
Public ReadOnly Property Volume As Double
	Get
Property Value
Type: Double
See Also
Reference
Box Structure
Rhino.Geometry Namespace