RhinoCommon SDK
RhinoViewport.GetFrustumLine Method
Rhino for Mac 5.1
 Gets the world coordinate line in the view frustum that projects to a point on the screen.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetFrustumLine(
	double screenX,
	double screenY,
	out Line worldLine
)
Public Function GetFrustumLine (
	screenX As Double,
	screenY As Double,
	<OutAttribute> ByRef worldLine As Line
) As Boolean
Parameters
screenX
Type: System.Double
(screenx,screeny) = screen location.
screenY
Type: System.Double
(screenx,screeny) = screen location.
worldLine
Type: Rhino.Geometry.Line
 3d world coordinate line segment starting on the near clipping plane and ending on the far clipping plane.
Return Value
Type: Boolean
 true if successful. false if view projection or frustum is invalid.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace