RhinoCommon SDK
ToolbarFile Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.ToolbarFile"]
Inheritance Hierarchy
System.Object
 Rhino.UI.ToolbarFile
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class ToolbarFile
Public NotInheritable Class ToolbarFile
The ToolbarFile type exposes the following members.
Properties
Name | Description
GroupCount
Id
Name
Path
Full path to this file on disk
ToolbarCount
Top
Methods
Name | Description
Close
GetGroup(Int32)
GetGroup(String)
GetToolbar
Save
SaveAs
Top
See Also
Reference
Rhino.UI Namespace