RhinoCommon SDK
Ellipse Structure
Rhino for Mac 5.1
 Represents the values of a plane and the two semiaxes radii in an ellipse.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct Ellipse : IEpsilonComparable<Ellipse>
<SerializableAttribute>
Public Structure Ellipse
	Implements IEpsilonComparable(Of Ellipse)
The Ellipse type exposes the following members.
Constructors
Name | Description
Ellipse(Plane, Double, Double)
 Initializes a new ellipse from base plane and both principal radii.
Ellipse(Point3d, Point3d, Point3d)
 Initializes a new ellipse from a center point and the two semiaxes intersections.
Top
Properties
Name | Description
Plane
 Gets or sets the base plane of the ellipse.
Radius1
 Gets or sets the radius of the ellipse along the base plane X semiaxis.
Radius2
 Gets or sets the radius of the ellipse along the base plane Y semiaxis.
Top
Methods
Name | Description
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
ToNurbsCurve
 Constructs a nurbs curve representation of this ellipse.
This is equivalent to calling NurbsCurve.CreateFromEllipse().
Top
See Also
Reference
Rhino.Geometry Namespace