RhinoCommon SDK
LinetypeTable.CurrentLinetype Property
Rhino for Mac 5.1
 Returns reference to the current linetype. Note that this reference may become invalid after a call to AddLinetype().
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Linetype CurrentLinetype { get; }
Public ReadOnly Property CurrentLinetype As Linetype
	Get
Property Value
Type: Linetype
Remarks
 At all times, there is a "current" linetype. Unless otherwise specified, new objects are assigned to the current linetype. The current linetype is never deleted.
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace