RhinoCommon SDK
GetLine Class
Rhino for Mac 5.1
 Use to interactively get a line. The Rhino "Line" command uses GetLine.
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetLine
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class GetLine : IDisposable
Public Class GetLine
	Implements IDisposable
The GetLine type exposes the following members.
Constructors
Name | Description
GetLine
Initializes a new instance of the GetLine class
Top
Properties
Name | Description
AcceptZeroLengthLine
 Controls whether or not a zero length line is acceptable. The default is to require the user to keep picking the end point until we get a point different than the start point.
FeedbackColor
 If set, the feedback color is used to draw the dynamic line when the second point is begin picked. If not set, the active layer color is used.
FirstPointPrompt
Prompt when getting first point
FixedLength
 If FixedLength > 0, the line must have the specified length
GetLineMode
 Mode used
HaveFeedbackColor
 If true, the feedback color is used to draw the dynamic line when the second point is begin picked. If false, the active layer color is used.
MidPointPrompt
Prompt when getting midpoint
SecondPointPrompt
Prompt when getting second point
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
EnableAllVariations
 If true, then all line variations are shown if the default line mode is used
EnableFromBothSidesOption
 If true, then the "BothSides" option shows up when the start point is inteactively picked.
EnableFromMidPointOption
 If true, the the "MidPoint" options shows up
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Get
 Perform the 'get' operation.
SetFirstPoint
 Use SetFirstPoint to specify the line's starting point and skip the start point interactive picking
Top
See Also
Reference
Rhino.Input.Custom Namespace