RhinoCommon SDK
LineCurve Constructor (Point2d, Point2d)
Rhino for Mac 5.1
 Initializes a new instance of the LineCurve class, by setting start and end point from two 2D points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public LineCurve(
	Point2d from,
	Point2d to
)
Public Sub New (
	from As Point2d,
	to As Point2d
)
Parameters
from
Type: Rhino.Geometry.Point2d
A start point.
to
Type: Rhino.Geometry.Point2d
An end point.
See Also
Reference
LineCurve Class
LineCurve Overload
Rhino.Geometry Namespace