RhinoCommon SDK
ColorLAB Constructor (Double, Double, Double)
Rhino for Mac 5.1
 Constructs a new instance of ColorLAB with custom channel values.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ColorLAB(
	double lightness,
	double a,
	double b
)
Public Sub New (
	lightness As Double,
	a As Double,
	b As Double
)
Parameters
lightness
Type: System.Double
[Missing <param name="lightness"/> documentation for "M:Rhino.Display.ColorLAB.#ctor(System.Double,System.Double,System.Double)"]
a
Type: System.Double
[Missing <param name="a"/> documentation for "M:Rhino.Display.ColorLAB.#ctor(System.Double,System.Double,System.Double)"]
b
Type: System.Double
[Missing <param name="b"/> documentation for "M:Rhino.Display.ColorLAB.#ctor(System.Double,System.Double,System.Double)"]
See Also
Reference
ColorLAB Structure
ColorLAB Overload
Rhino.Display Namespace