RhinoCommon SDK
UserData.OnTransform Method
Rhino for Mac 5.1
 Is called when the object associated with this data is transformed. If you override this function, make sure to call the base class if you want the stored Transform to be updated.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnTransform(
	Transform transform
)
Protected Overridable Sub OnTransform (
	transform As Transform
)
Parameters
transform
Type: Rhino.Geometry.Transform
The transform being applied.
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace