RhinoCommon SDK
MeshVertexNormalList Properties
Rhino for Mac 5.1
The MeshVertexNormalList type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of mesh vertex normals.
Item
 Gets or sets the vertex at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace