RhinoCommon SDK
Point2d.MaximumCoordinate Property
Rhino for Mac 5.1
 Gets the largest valid coordinate, or RhinoMath.UnsetValue if no coordinate is valid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double MaximumCoordinate { get; }
Public ReadOnly Property MaximumCoordinate As Double
	Get
Property Value
Type: Double
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace