RhinoCommon SDK
ConstructionPlane.ThickLineFrequency Property
Rhino for Mac 5.1
 Gets or sets the recurrence of a wider line on the grid.
0: No lines are thick, all are drawn thin.
1: All lines are thick.
2: Every other line is thick.
3: One line in three lines is thick (and two are thin).
4: ...
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ThickLineFrequency { get; set; }
Public Property ThickLineFrequency As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace