RhinoCommon SDK
GumballDisplayConduit.InRelocate Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballDisplayConduit.InRelocate"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool InRelocate { get; }
Public ReadOnly Property InRelocate As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace