RhinoCommon SDK
ObjectAttributes.ComputedPlotColor Method (RhinoDoc)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedPlotColor(Rhino.RhinoDoc)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color ComputedPlotColor(
	RhinoDoc document
)
Public Function ComputedPlotColor (
	document As RhinoDoc
) As Color
Parameters
document
Type: Rhino.RhinoDoc
[Missing <param name="document"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedPlotColor(Rhino.RhinoDoc)"]
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedPlotColor(Rhino.RhinoDoc)"]
See Also
Reference
ObjectAttributes Class
ComputedPlotColor Overload
Rhino.DocObjects Namespace