RhinoCommon SDK
DisplayPipelineAttributes.DisableConduits Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.DisableConduits"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DisableConduits { get; set; }
Public Property DisableConduits As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace