RhinoCommon SDK
Sphere.Rotate Method (Double, Double, Vector3d)
Rhino for Mac 5.1
 Rotates this sphere about the center point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Rotate(
	double sinAngle,
	double cosAngle,
	Vector3d axisOfRotation
)
Public Function Rotate (
	sinAngle As Double,
	cosAngle As Double,
	axisOfRotation As Vector3d
) As Boolean
Parameters
sinAngle
Type: System.Double
sin(angle)
cosAngle
Type: System.Double
cos(angle)
axisOfRotation
Type: Rhino.Geometry.Vector3d
The direction of the axis of rotation.
Return Value
Type: Boolean
true on success; false on failure.
See Also
Reference
Sphere Structure
Rotate Overload
Rhino.Geometry Namespace