RhinoCommon SDK
DisplayPipeline.DrawSprites Method (DisplayBitmap, DisplayBitmapDrawList, Single, Boolean)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprites(Rhino.Display.DisplayBitmap,Rhino.Display.DisplayBitmapDrawList,System.Single,System.Boolean)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawSprites(
	DisplayBitmap bitmap,
	DisplayBitmapDrawList items,
	float size,
	bool sizeInWorldSpace
)
Public Sub DrawSprites (
	bitmap As DisplayBitmap,
	items As DisplayBitmapDrawList,
	size As Single,
	sizeInWorldSpace As Boolean
)
Parameters
bitmap
Type: Rhino.Display.DisplayBitmap
[Missing <param name="bitmap"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprites(Rhino.Display.DisplayBitmap,Rhino.Display.DisplayBitmapDrawList,System.Single,System.Boolean)"]
items
Type: Rhino.Display.DisplayBitmapDrawList
[Missing <param name="items"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprites(Rhino.Display.DisplayBitmap,Rhino.Display.DisplayBitmapDrawList,System.Single,System.Boolean)"]
size
Type: System.Single
[Missing <param name="size"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprites(Rhino.Display.DisplayBitmap,Rhino.Display.DisplayBitmapDrawList,System.Single,System.Boolean)"]
sizeInWorldSpace
Type: System.Boolean
[Missing <param name="sizeInWorldSpace"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprites(Rhino.Display.DisplayBitmap,Rhino.Display.DisplayBitmapDrawList,System.Single,System.Boolean)"]
See Also
Reference
DisplayPipeline Class
DrawSprites Overload
Rhino.Display Namespace