RhinoCommon SDK
Torus.ToNurbsSurface Method
Rhino for Mac 5.1
 Converts this torus to its nurbs surface representation. This is synonymous with calling NurbsSurface.CreateFromTorus().
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsSurface ToNurbsSurface()
Public Function ToNurbsSurface As NurbsSurface
Return Value
Type: NurbsSurface
A nurbs surface representation of this torus, or null on error.
See Also
Reference
Torus Structure
Rhino.Geometry Namespace