RhinoCommon SDK
Line.ClosestPoint Method
Rhino for Mac 5.1
 Finds the point on the (in)finite line segment that is closest to a test point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d ClosestPoint(
	Point3d testPoint,
	bool limitToFiniteSegment
)
Public Function ClosestPoint (
	testPoint As Point3d,
	limitToFiniteSegment As Boolean
) As Point3d
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to project onto the line.
limitToFiniteSegment
Type: System.Boolean
If true, the projection is limited to the finite line segment.
Return Value
Type: Point3d
The point on the (in)finite line that is closest to testPoint.
See Also
Reference
Line Structure
Rhino.Geometry Namespace