RhinoCommon SDK
ObjectEnumeratorSettings.IdefObjects Property
Rhino for Mac 5.1
 When true, ONLY Instance Definitions will be returned
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IdefObjects { get; set; }
Public Property IdefObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace