RhinoCommon SDK
BinaryArchiveReader.Read3dmChunkVersion Method
Rhino for Mac 5.1
 A chunk version is a single byte that encodes a major.minor version number. Useful when creating I/O code for 3dm chunks that may change in the future. Increment the minor version number if new information is added to the end of the chunk. Increment the major version if the format of the chunk changes in some other way.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Read3dmChunkVersion(
	out int major,
	out int minor
)
Public Sub Read3dmChunkVersion (
	<OutAttribute> ByRef major As Integer,
	<OutAttribute> ByRef minor As Integer
)
Parameters
major
Type: System.Int32
0 to 15.
minor
Type: System.Int32
0 to 16.
Return Value
Type:
true on successful read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace