RhinoCommon SDK
GetFileNameMode Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Input.Custom.GetFileNameMode"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum GetFileNameMode
Public Enumeration GetFileNameMode
Members
Member name | Value | Description
Open | 0
OpenTemplate | 1
OpenImage | 2
OpenRhinoOnly | 3
OpenTextFile | 5
OpenWorksession | 6
Import | 7
Attach | 8
Save | 10
SaveSmall | 11
SaveTemplate | 12
SaveImage | 13
Export | 14
SaveTextFile | 17
SaveWorksession | 18
See Also
Reference
Rhino.Input.Custom Namespace