RhinoCommon SDK
Vector2f.GreaterThanOrEqual Operator
Rhino for Mac 5.1
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator >=(
	Vector2f a,
	Vector2f b
)
Public Shared Operator >= (
	a As Vector2f,
	b As Vector2f
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector2f
First vector.
b
Type: Rhino.Geometry.Vector2f
Second vector.
Return Value
Type: Boolean
true if a.X is larger than b.X, or a.X == b.X and a.Y >= b.Y; otherwise, false.
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace