RhinoCommon SDK
BrepFace.Loops Property
Rhino for Mac 5.1
 Loops in this face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepLoopList Loops { get; }
Public ReadOnly Property Loops As BrepLoopList
	Get
Property Value
Type: BrepLoopList
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace