RhinoCommon SDK
Mesh.ClosestPoint Method (Point3d, Point3d, Double)
Rhino for Mac 5.1
 Gets the point on the mesh that is closest to a given test point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ClosestPoint(
	Point3d testPoint,
	out Point3d pointOnMesh,
	double maximumDistance
)
Public Function ClosestPoint (
	testPoint As Point3d,
	<OutAttribute> ByRef pointOnMesh As Point3d,
	maximumDistance As Double
) As Integer
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to seach for.
pointOnMesh
Type: Rhino.Geometry.Point3d
Point on the mesh closest to testPoint.
maximumDistance
Type: System.Double
 Optional upper bound on the distance from test point to the mesh. If you are only interested in finding a point Q on the mesh when testPoint.DistanceTo(Q) < maximumDistance, then set maximumDistance to that value. This parameter is ignored if you pass 0.0 for a maximumDistance.
Return Value
Type: Int32
 Index of face that the closest point lies on if successful. -1 if not successful; the value of pointOnMesh is undefined.
See Also
Reference
Mesh Class
ClosestPoint Overload
Rhino.Geometry Namespace