RhinoCommon SDK
Torus Structure
Rhino for Mac 5.1
 Represents the value of a plane and two radii in a torus that is oriented in three-dimensional space.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct Torus : IEpsilonComparable<Torus>
<SerializableAttribute>
Public Structure Torus
	Implements IEpsilonComparable(Of Torus)
The Torus type exposes the following members.
Constructors
Name | Description
Torus
 Initializes a new Torus from base pane and two radii.
Top
Properties
Name | Description
IsValid
 Gets a value indicating whether this torus is valid.
MajorRadius
 Gets or sets the radius of the circle that lies at the heart of the torus.
MinorRadius
 Gets or sets the radius of the torus section.
Plane
 Gets or sets the plane for the torus large circle.
Unset
 Gets an invalid Torus.
Top
Methods
Name | Description
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
ToNurbsSurface
 Converts this torus to its nurbs surface representation. This is synonymous with calling NurbsSurface.CreateFromTorus().
ToRevSurface
 Convert this torus to a surface of revolution representation. This is synonymous with calling RevSurface.CreateFromTorus().
Top
See Also
Reference
Rhino.Geometry Namespace