RhinoCommon SDK
BrepVertex.EdgeIndices Method
Rhino for Mac 5.1
 Gets the indices of all edges associated with this vertex.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] EdgeIndices()
Public Function EdgeIndices As Integer()
Return Value
Type: Int32[]
Empty array on failure.
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace