RhinoCommon SDK
ParticleSystem.Clear Method
Rhino for Mac 5.1
 Remove all Particles from this system.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual void Clear()
Public Overridable Sub Clear
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace