RhinoCommon SDK
PickContext Properties
Rhino for Mac 5.1
The PickContext type exposes the following members.
Properties
Name | Description
GetObjectUsed
PickGroupsEnabled
 Thue if GroupObjects should be added to the pick list
PickLine
 pick chord starts on near clipping plane and ends on far clipping plane.
PickMode
PickStyle
SubObjectSelectionEnabled
 True if the user had activated subobject selection
View
 This view can be a model view or a page view. When view is a page view, then you need to distingish between the viewports MainViewport() and ActiveViewport(). When m_view is a model view, both MainViewport() and ActiveViewport() return the world view's viewport.
Top
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace