RhinoCommon SDK
MeshFace.Flip Method
Rhino for Mac 5.1
 Reverses the orientation of the face by swapping corners. The first corner is always maintained.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MeshFace Flip()
Public Function Flip As MeshFace
Return Value
Type: MeshFace
[Missing <returns> documentation for "M:Rhino.Geometry.MeshFace.Flip"]
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace