RhinoCommon SDK
RhinoObject.InVisualAnalysisMode Method
Rhino for Mac 5.1
 Reports if any visual analysis mode is currently active for an object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool InVisualAnalysisMode()
Public Function InVisualAnalysisMode As Boolean
Return Value
Type: Boolean
true if an analysis mode is active; otherwise false.
See Also
Reference
RhinoObject Class
InVisualAnalysisMode Overload
Rhino.DocObjects Namespace