RhinoCommon SDK
TextureCombineMode Enumeration
Rhino for Mac 5.1
 Determines how this texture is combined with others in a material's texture list.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum TextureCombineMode
Public Enumeration TextureCombineMode
Members
Member name | Value | Description
None | 0
Modulate | 1 |  Modulate with material diffuse color
Decal | 2 |  Decal
Blend | 3 |  Blend texture with others in the material To "add" a texture, set BlendAmount = +1 To "subtract" a texture, set BlendAmount = -1
See Also
Reference
Rhino.DocObjects Namespace