RhinoCommon SDK
PointCloud.Add Method (Point3d)
Rhino for Mac 5.1
 Append a new point to the end of the list.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Add(
	Point3d point
)
Public Sub Add (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to append.
See Also
Reference
PointCloud Class
Add Overload
Rhino.Geometry Namespace