RhinoCommon SDK
LightTable Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.LightTable"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.LightTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class LightTable : IEnumerable<LightObject>,
	IEnumerable
Public Class LightTable
	Implements IEnumerable(Of LightObject), IEnumerable
The LightTable type exposes the following members.
Properties
Name | Description
Count
Number of lights in the light table. Does not include Sun or Skylight.
Document
Document that owns this light table.
Item
Top
Methods
Name | Description
Add(Light)
Add(Light, ObjectAttributes)
Find
GetEnumerator
Modify(Guid, Light)
Modify(Int32, Light)
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace