RhinoCommon SDK
PolyCurve Constructor
Rhino for Mac 5.1
 Initializes a new, empty polycurve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PolyCurve()
Public Sub New
See Also
Reference
PolyCurve Class
PolyCurve Overload
Rhino.Geometry Namespace