RhinoCommon SDK
DisplayPipeline.IsVisible Method (Point3d)
Rhino for Mac 5.1
 Test a given 3d world coordinate point for visibility inside the view frustum under the current viewport and model transformation settings.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsVisible(
	Point3d worldCoordinate
)
Public Function IsVisible (
	worldCoordinate As Point3d
) As Boolean
Parameters
worldCoordinate
Type: Rhino.Geometry.Point3d
Point to test for visibility.
Return Value
Type: Boolean
true if the point is visible, false if it is not.
See Also
Reference
DisplayPipeline Class
IsVisible Overload
Rhino.Display Namespace