RhinoCommon SDK
DisplayPipeline.IsVisible Method (BoundingBox)
Rhino for Mac 5.1
 Test a given box for visibility inside the view frustum under the current viewport and model transformation settings.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsVisible(
	BoundingBox bbox
)
Public Function IsVisible (
	bbox As BoundingBox
) As Boolean
Parameters
bbox
Type: Rhino.Geometry.BoundingBox
Box to test for visibility.
Return Value
Type: Boolean
true if at least some portion of the box is visible, false if not.
See Also
Reference
DisplayPipeline Class
IsVisible Overload
Rhino.Display Namespace