RhinoCommon SDK
BinaryArchiveReader Class
Rhino for Mac 5.1
 Represents an entity that is capable of reading a binary archive and instantiating strongly-typed objects.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.BinaryArchiveReader
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class BinaryArchiveReader
Public Class BinaryArchiveReader
The BinaryArchiveReader type exposes the following members.
Properties
Name | Description
Archive3dmVersion
 If a 3dm archive is being read or written, then this is the version of the 3dm archive format (1, 2, 3, 4 or 5). 0 a 3dm archive is not being read/written 1 a version 1 3dm archive is being read/written 2 a version 2 3dm archive is being read/written 3 a version 3 3dm archive is being read/written 4 a version 4 3dm archive is being read/written 5 an old version 5 3dm archive is being read 50 a version 5 3dm archive is being read/written.
CurrentPosition
current offset (in bytes) into archive ( like ftell() )
ReadErrorOccured
 Gets or sets whether en error occurred during reading.
Top
Methods
Name | Description
AtEnd
 true if at end of a file
BeginRead3dmChunk(UInt32, Int64)
 Begins reading a chunk that must be in the archive at this location.
BeginRead3dmChunk(UInt32, Int32, Int32)
 Begins reading a chunk that must be in the archive at this location.
Dump3dmChunk
 Fnction for studying contents of a file. The primary use is as an aid to help dig through files that have been damaged (bad disks, transmission errors, etc.) If an error is found, a line that begins with the word "ERROR" is printed.
EnableCRCCalculation
 Expert user function to control CRC calculation while reading and writing. Typically this is used when seeking around and reading/writing information in non-serial order.
EndRead3dmChunk
 Calling this will skip rest of stuff in chunk if it was only partially read.
Read3dmChunkVersion
 A chunk version is a single byte that encodes a major.minor version number. Useful when creating I/O code for 3dm chunks that may change in the future. Increment the minor version number if new information is added to the end of the chunk. Increment the major version if the format of the chunk changes in some other way.
Read3dmStartSection
ReadBool
 Reads a Boolean from the archive.
ReadBoolArray
 Reads an array of Boolean from the archive.
An array is returned even if the input was another enumerable type.
ReadBoundingBox
 Reads a BoundingBox from the archive.
ReadByte
 Reads a Byte from the archive.
ReadByteArray
 Reads an array of Byte from the archive.
An array is returned even if the input was another enumerable type.
ReadColor
 Reads a Color from the archive.
ReadCompressedBuffer
 Reads an array of compressed Byte information from the archive and uncompresses it.
An array is returned even if the input was another enumerable type.
ReadDictionary
 Reads a complete ArchivableDictionary from the archive.
ReadDouble
 Reads a Double from the archive.
ReadDoubleArray
 Reads an array of Double from the archive.
An array is returned even if the input was another enumerable type.
ReadFont
 Reads a Font from the archive.
ReadGeometry
 Reads a GeometryBase-derived object from the archive.
The GeometryBase class is abstract.
ReadGuid
 Reads a Guid from the archive.
ReadGuidArray
 Reads an array of Guid from the archive.
An array is returned even if the input was another enumerable type.
ReadInt
 Reads a Int32 from the archive.
ReadInt64
 Reads a Int64 from the archive.
ReadIntArray
 Reads an array of Int32 from the archive.
An array is returned even if the input was another enumerable type.
ReadInterval
 Reads a Interval from the archive.
ReadLine
 Reads a Line from the archive.
ReadMeshingParameters
 Reads a MeshingParameters from the archive.
ReadObjRef
 Reads a ObjRef from the archive
ReadObjRefArray
 Reads an array of Double from the archive.
An array is returned even if the input was another enumerable type.
ReadPlane
 Reads a Plane from the archive.
ReadPoint
 Reads a Point from the archive.
ReadPoint2d
 Reads a Point2d from the archive.
ReadPoint3d
 Reads a Point3d from the archive.
ReadPoint3f
 Reads a Point3f from the archive.
ReadPoint4d
 Reads a Point4d from the archive.
ReadPointF
 Reads a PointF from the archive.
ReadRay3d
 Reads a Ray3d from the archive.
ReadRectangle
 Reads a Rectangle from the archive.
ReadRectangleF
 Reads a RectangleF from the archive.
ReadSByte
 Reads a SByte from the archive.
ReadSByteArray
 Reads an array of SByte from the archive.
An array is returned even if the input was another enumerable type.
ReadShort
 Reads a Int16 from the archive.
ReadShortArray
 Reads an array of Int16 from the archive.
An array is returned even if the input was another enumerable type.
ReadSingle
 Reads a Single from the archive.
ReadSingleArray
 Reads an array of Single from the archive.
An array is returned even if the input was another enumerable type.
ReadSize
 Reads a Size from the archive.
ReadSizeF
 Reads a SizeF from the archive.
ReadString
 Reads a String from the archive.
ReadStringArray
 Reads an array of String from the archive.
An array is returned even if the input was another enumerable type.
ReadTransform
 Reads a Transform from the archive.
ReadUInt
 Reads a UInt32 from the archive.
ReadUShort
 Reads a UInt16 from the archive.
ReadVector2d
 Reads a Vector2d from the archive.
ReadVector3d
 Reads a Vector3d from the archive.
ReadVector3f
 Reads a Vector3f from the archive.
SeekFromCurrentPosition(Int64)
 seek from current position ( like fseek( ,SEEK_CUR) )
SeekFromCurrentPosition(UInt64, Boolean)
 seek from current position ( like fseek( ,SEEK_CUR) )
SeekFromStart
 seek from start position ( like fseek( ,SEEK_SET) )
Top
See Also
Reference
Rhino.FileIO Namespace