RhinoCommon SDK
FileExportPlugIn.AddFileTypes Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.PlugIns.FileExportPlugIn.AddFileTypes(Rhino.FileIO.FileWriteOptions)"]
Namespace: Rhino.PlugIns
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected abstract FileTypeList AddFileTypes(
	FileWriteOptions options
)
Protected MustOverride Function AddFileTypes (
	options As FileWriteOptions
) As FileTypeList
Parameters
options
Type: Rhino.FileIO.FileWriteOptions
[Missing <param name="options"/> documentation for "M:Rhino.PlugIns.FileExportPlugIn.AddFileTypes(Rhino.FileIO.FileWriteOptions)"]
Return Value
Type: FileTypeList
[Missing <returns> documentation for "M:Rhino.PlugIns.FileExportPlugIn.AddFileTypes(Rhino.FileIO.FileWriteOptions)"]
See Also
Reference
FileExportPlugIn Class
Rhino.PlugIns Namespace