RhinoCommon SDK
Circle.TryFitCircleTT Method
Rhino for Mac 5.1
 Try to fit a circle to two curves using tangent relationships.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Circle TryFitCircleTT(
	Curve c1,
	Curve c2,
	double t1,
	double t2
)
Public Shared Function TryFitCircleTT (
	c1 As Curve,
	c2 As Curve,
	t1 As Double,
	t2 As Double
) As Circle
Parameters
c1
Type: Rhino.Geometry.Curve
First curve to touch.
c2
Type: Rhino.Geometry.Curve
Second curve to touch.
t1
Type: System.Double
Parameter on first curve close to desired solution.
t2
Type: System.Double
Parameter on second curve closet to desired solution.
Return Value
Type: Circle
Valid circle on success, Circle.Unset on failure.
See Also
Reference
Circle Structure
Rhino.Geometry Namespace