RhinoCommon SDK
Circle.TangentAt Method
Rhino for Mac 5.1
 Circles use trigonometric parameterization: t -> center + cos(t)*radius*xaxis + sin(t)*radius*yaxis.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d TangentAt(
	double t
)
Public Function TangentAt (
	t As Double
) As Vector3d
Parameters
t
Type: System.Double
Parameter of tangent to evaluate.
Return Value
Type: Vector3d
The tangent at the circle at the given parameter.
See Also
Reference
Circle Structure
Rhino.Geometry Namespace