RhinoCommon SDK
MeshTextureCoordinateList.ReverseTextureCoordinates Method
Rhino for Mac 5.1
 Reverses one coordinate direction of the texture coordinates.
The region of the bitmap the texture uses does not change. Either Us or Vs direction is flipped.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ReverseTextureCoordinates(
	int direction
)
Public Function ReverseTextureCoordinates (
	direction As Integer
) As Boolean
Parameters
direction
Type: System.Int32
0 = first texture coordinate is reversed.
1 = second texture coordinate is reversed.
Return Value
Type: Boolean
true if operation succeeded; otherwise, false.
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace