RhinoCommon SDK
ZBufferCapture.ShowMeshWires Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowMeshWires(System.Boolean)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void ShowMeshWires(
	bool on
)
Public Sub ShowMeshWires (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowMeshWires(System.Boolean)"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace