RhinoCommon SDK
ViewInfo.Viewport Property
Rhino for Mac 5.1
 Gets the viewport, or viewing frustum, associated with this view.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ViewportInfo Viewport { get; }
Public ReadOnly Property Viewport As ViewportInfo
	Get
Property Value
Type: ViewportInfo
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace