RhinoCommon SDK
ObjectTable.Delete Method (Guid, Boolean)
Rhino for Mac 5.1
 Deletes object from document. The deletion can be undone by calling UndeleteObject().
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Delete(
	Guid objectId,
	bool quiet
)
Public Function Delete (
	objectId As Guid,
	quiet As Boolean
) As Boolean
Parameters
objectId
Type: System.Guid
Id of the object to delete.
quiet
Type: System.Boolean
If false, a message box will appear when an object cannot be deleted.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
ObjectTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace