RhinoCommon SDK
GumballObject Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.Gumball.GumballObject"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Gumball.GumballObject
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class GumballObject : IDisposable
Public Class GumballObject
	Implements IDisposable
The GumballObject type exposes the following members.
Constructors
Name | Description
GumballObject
Initializes a new instance of the GumballObject class
Top
Properties
Name | Description
Frame
Top
Methods
Name | Description
Dispose()
Releases all resources used by the GumballObject
Dispose(Boolean)
Releases the unmanaged resources used by the GumballObject and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
SetFromArc
SetFromBoundingBox(BoundingBox)
SetFromBoundingBox(Plane, BoundingBox)
 Sets the gumball bounding box with respect to a frame.
SetFromCircle
SetFromCurve
SetFromEllipse
SetFromExtrusion
SetFromHatch
SetFromLight
SetFromLine
SetFromPlane
Top
See Also
Reference
Rhino.UI.Gumball Namespace