RhinoCommon SDK
Surface.IsIsoparametric Method (Curve)
Rhino for Mac 5.1
 Determines if a 2d curve is iso-parameteric in the parameter space of this surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IsoStatus IsIsoparametric(
	Curve curve
)
Public Function IsIsoparametric (
	curve As Curve
) As IsoStatus
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to test.
Return Value
Type: IsoStatus
IsoStatus flag describing the iso-parametric relationship between the surface and the curve.
See Also
Reference
Surface Class
IsIsoparametric Overload
Rhino.Geometry Namespace