RhinoCommon SDK
MaterialTable.CurrentMaterialIndex Property
Rhino for Mac 5.1
 At all times, there is a "current" material. Unless otherwise specified, new objects are assigned to the current material. The current material is never locked, hidden, or deleted.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int CurrentMaterialIndex { get; set; }
Public Property CurrentMaterialIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace