RhinoCommon SDK
EarthAnchorPoint Constructor
Rhino for Mac 5.1
 Initializes a new instance of the EarthAnchorPoint class.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public EarthAnchorPoint()
Public Sub New
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace