RhinoCommon SDK
GripStatus.Culled Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripStatus.Culled"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Culled { get; set; }
Public Property Culled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GripStatus Class
Rhino.DocObjects.Custom Namespace