RhinoCommon SDK
GumballDisplayConduit.BaseGumball Property
Rhino for Mac 5.1
Starting location.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GumballObject BaseGumball { get; }
Public ReadOnly Property BaseGumball As GumballObject
	Get
Property Value
Type: GumballObject
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace