RhinoCommon SDK
Mesh.EvaluateMeshGeometry Method
Rhino for Mac 5.1
 If the mesh has SurfaceParameters, the surface is evaluated at these parameters and the mesh geometry is updated.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool EvaluateMeshGeometry(
	Surface surface
)
Public Function EvaluateMeshGeometry (
	surface As Surface
) As Boolean
Parameters
surface
Type: Rhino.Geometry.Surface
An input surface.
Return Value
Type: Boolean
true if the operation succceeded; false otherwise.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace