RhinoCommon SDK
ReplayHistoryResult.UpdateToMesh Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToMesh(
	Mesh mesh,
	ObjectAttributes attributes
)
Public Function UpdateToMesh (
	mesh As Mesh,
	attributes As ObjectAttributes
) As Boolean
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace