RhinoCommon SDK
Polyline.IsClosedWithinTolerance Method
Rhino for Mac 5.1
 Determines whether the polyline is closed, provided a tolerance value.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsClosedWithinTolerance(
	double tolerance
)
Public Function IsClosedWithinTolerance (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
If the distance between the start and end point of the polyline is less than tolerance, the polyline is considered to be closed.
Return Value
Type: Boolean
true if the polyline is closed to within tolerance, false otherwise.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace