RhinoCommon SDK
TextureMapping.TryGetMappingSphere Method
Rhino for Mac 5.1
 Get a spherical projection parameters from this texture mapping.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetMappingSphere(
	out Sphere sphere
)
Public Function TryGetMappingSphere (
	<OutAttribute> ByRef sphere As Sphere
) As Boolean
Parameters
sphere
Type: Rhino.Geometry.Sphere
///
Return Value
Type: Boolean
 Returns true if a valid sphere is returned.
Remarks
 Generally, GetMappingShere will not return the same parameters passed to SetSphereMapping. However, the location of the sphere will be the same. If this mapping is not cylindrical, the cylinder will approximate the actual mapping primitive.
See Also
Reference
TextureMapping Class
Rhino.Render Namespace