RhinoCommon SDK
GetBaseClass.AddOptionDouble Method (String, OptionDouble, String)
Rhino for Mac 5.1
 Adds a command line option to get numbers and automatically save the value.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddOptionDouble(
	string englishName,
	ref OptionDouble numberValue,
	string prompt
)
Public Function AddOptionDouble (
	englishName As String,
	ByRef numberValue As OptionDouble,
	prompt As String
) As Integer
Parameters
englishName
Type: System.String
 Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
numberValue
Type: Rhino.Input.Custom.OptionDouble
Current value.
prompt
Type: System.String
 option prompt shown if the user selects this option. If null or empty, then the option name is used as the get number prompt.
Return Value
Type: Int32
 option index value (>0) or 0 if option cannot be added.
See Also
Reference
GetBaseClass Class
AddOptionDouble Overload
Rhino.Input.Custom Namespace