RhinoCommon SDK
BasepointZero Enumeration
Rhino for Mac 5.1
 Specifies enumerated constants used to indicate the zero level convention relating to a location on Earth.
This is used in conjunction with the EarthAnchorPoint class.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum BasepointZero
Public Enumeration BasepointZero
Members
Member name | Value | Description
GroundLevel | 0 |  The ground level is the convention for 0.
MeanSeaLevel | 1 |  The mean sea level is the convention for 0.
CenterOfEarth | 2 |  The center of the planet is the convention for 0.
See Also
Reference
Rhino.DocObjects Namespace