RhinoCommon SDK
DetailViewObject.IsActive Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.DetailViewObject.IsActive"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsActive { get; set; }
Public Property IsActive As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace