RhinoCommon SDK
LinetypeTable.AddReferenceLinetype Method
Rhino for Mac 5.1
 Adds a reference linetypes that will not be saved in files.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddReferenceLinetype(
	Linetype linetype
)
Public Function AddReferenceLinetype (
	linetype As Linetype
) As Integer
Parameters
linetype
Type: Rhino.DocObjects.Linetype
Definition of new linetype. The information in linetype is copied. If linetype.Name is empty then a unique name of the form "Linetype 01" will be automatically created.
Return Value
Type: Int32
 Index of new linetype or -1 on error.
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace