RhinoCommon SDK
Cone.ToRevSurface Method
Rhino for Mac 5.1
 Constructs a RevSurface representation of this Cone. This is synonymous with calling RevSurface.CreateFromCone().
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RevSurface ToRevSurface()
Public Function ToRevSurface As RevSurface
Return Value
Type: RevSurface
A RevSurface representation of the cone or null.
See Also
Reference
Cone Structure
Rhino.Geometry Namespace