RhinoCommon SDK
Mesh.CollapseFacesByByAspectRatio Method
Rhino for Mac 5.1
 Collapses a multiple mesh faces, determined by face aspect ratio, based on criteria found in Stan Melax's polygon reduction, see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int CollapseFacesByByAspectRatio(
	double aspectRatio
)
Public Function CollapseFacesByByAspectRatio (
	aspectRatio As Double
) As Integer
Parameters
aspectRatio
Type: System.Double
Faces with an aspect ratio less than aspectRatio are considered as candidates.
Return Value
Type: Int32
Number of faces that were collapsed in the process.
Remarks
 This number may differ from the initial number of faces that meet the input criteria because the aspect ratios of some initial faces may be altered as other faces are collapsed.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace