RhinoCommon SDK
File3dmObjectTable.AddTextDot Method (String, Point3d, ObjectAttributes)
Rhino for Mac 5.1
Adds a text dot object to the table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddTextDot(
	string text,
	Point3d location,
	ObjectAttributes attributes
)
Public Function AddTextDot (
	text As String,
	location As Point3d,
	attributes As ObjectAttributes
) As Guid
Parameters
text
Type: System.String
The text.
location
Type: Rhino.Geometry.Point3d
The location.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to link with curve.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddTextDot Overload
Rhino.FileIO Namespace