RhinoCommon SDK
ViewportInfo.Camera35mmLensLength Property
Rhino for Mac 5.1
 This property assumes the camera is horizontal and crop the film rather than the image when the aspect of the frustum is not 36/24. (35mm film is 36mm wide and 24mm high.) Setting preserves camera location, changes the frustum, but maintains the frustum's aspect.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Camera35mmLensLength { get; set; }
Public Property Camera35mmLensLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace