RhinoCommon SDK
File3dmWriteOptions.SaveUserData Property
Rhino for Mac 5.1
 Include custom user data in the file. Default is true
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SaveUserData { get; set; }
Public Property SaveUserData As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace