RhinoCommon SDK
File3dmTypeCodes.TCODE_ANNOTATION Field
Rhino for Mac 5.1
0x0020000.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_ANNOTATION
Public Const TCODE_ANNOTATION As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace