RhinoCommon SDK
DisplayPipeline.DrawConstructionPlane Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawConstructionPlane(Rhino.DocObjects.ConstructionPlane)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawConstructionPlane(
	ConstructionPlane constructionPlane
)
Public Sub DrawConstructionPlane (
	constructionPlane As ConstructionPlane
)
Parameters
constructionPlane
Type: Rhino.DocObjects.ConstructionPlane
[Missing <param name="constructionPlane"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawConstructionPlane(Rhino.DocObjects.ConstructionPlane)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace