RhinoCommon SDK
ViewportInfo.GetFarPlaneCorners Method
Rhino for Mac 5.1
 Gets the corners of far clipping plane rectangle. 4 points are returned in the order of bottom left, bottom right, top left, top right.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d[] GetFarPlaneCorners()
Public Function GetFarPlaneCorners As Point3d()
Return Value
Type: Point3d[]
 Four corner points on success. Empty array if viewport is not valid.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace