RhinoCommon SDK
ViewportInfo Class
Rhino for Mac 5.1
 Represents a viewing frustum.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.ViewportInfo
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public sealed class ViewportInfo : IDisposable,
	ISerializable
<SerializableAttribute>
Public NotInheritable Class ViewportInfo
	Implements IDisposable, ISerializable
The ViewportInfo type exposes the following members.
Constructors
Name | Description
ViewportInfo()
 Initializes a new instance.
ViewportInfo(RhinoViewport)
 Copies all of the ViewportInfo data from an existing RhinoViewport.
ViewportInfo(ViewportInfo)
 Initializes a new instance by copying values from another instance.
Top
Properties
Name | Description
Camera35mmLensLength
 This property assumes the camera is horizontal and crop the film rather than the image when the aspect of the frustum is not 36/24. (35mm film is 36mm wide and 24mm high.) Setting preserves camera location, changes the frustum, but maintains the frustum's aspect.
CameraAngle
 Gets or sets the 1/2 smallest angle. See GetCameraAngles(Double, Double, Double) for more information.
CameraDirection
 Gets the direction that the camera faces.
CameraLocation
 Gets the camera location (position) point.
CameraUp
 Gets the camera up vector.
CameraX
 Gets the unit "to the right" vector.
CameraY
 Gets the unit "up" vector.
CameraZ
 Gets the unit vector in -CameraDirection.
FrustumAspect
 Setting FrustumAspect changes the larger of the frustum's width/height so that the resulting value of width/height matches the requested aspect. The camera angle is not changed. If you change the shape of the view port with a call SetScreenPort(), then you generally want to call SetFrustumAspect() with the value returned by GetScreenPortAspect().
FrustumBottom
 Gets the frustum bottom value. This is -top if the frustum has a horizontal symmetry axis.
This number is usually negative.
FrustumBottomPlane
 Gets the frustum bottom plane that separates visibile from off-screen.
FrustumCenter
 Gets the frustum center point.
FrustumFar
 Gets the frustum far-cutting value.
FrustumFarPlane
 Gets far clipping plane if camera and frustum are valid. The plane's frame is the same as the camera's frame. The origin is located at the intersection of the camera direction ray and the far clipping plane. The plane's normal points into the frustum towards the camera location.
FrustumHeight
 Gets the frustum height. This is FrustumTop - FrustumBottom.
FrustumLeft
 Gets the frustum left value. This is -right if the frustum has a vertical symmetry axis.
This number is usually negative.
FrustumLeftPlane
 Gets the frustum left plane that separates visibile from off-screen.
FrustumMaximumDiameter
 Gets the frustum maximum diameter, or the maximum between FrustumWidth and FrustumHeight.
FrustumMinimumDiameter
 Gets the frustum minimum diameter, or the minimum between FrustumWidth and FrustumHeight.
FrustumNear
 Gets the frustum near-cutting value.
FrustumNearPlane
 Gets near clipping plane if camera and frustum are valid. The plane's frame is the same as the camera's frame. The origin is located at the intersection of the camera direction ray and the near clipping plane. The plane's normal points out of the frustum towards the camera location.
FrustumRight
 Gets the frustum right value. This is -left if the frustum has a vertical symmetry axis.
This number is usually positive.
FrustumRightPlane
 Gets the frustum right plane that separates visibile from off-screen.
FrustumTop
 Gets the frustum top value. This is -bottom if the frustum has a horizontal symmetry axis.
This number is usually positive.
FrustumTopPlane
 Gets the frustum top plane that separates visibile from off-screen.
FrustumWidth
 Gets the frustum width. This is FrustumRight - FrustumLeft.
Id
 Sets the viewport's id to the value used to uniquely identify this viewport. There is no approved way to change the viewport id once it is set in order to maintain consistency across multiple viewports and those routines that manage them.
IsCameraDirectionLocked
 Gets or sets a value that indicates whether the direction that the camera faces is unmodifiable.
IsCameraLocationLocked
 Gets or sets a value that indicates whether the camera location is unmodifiable.
IsCameraUpLocked
 Gets or sets a value that indicates whether the camera up vector is unmodifiable.
IsFrustumLeftRightSymmetric
 Gets or sets a value that indicates whether the camera frustum has a vertical symmetry axis.
IsFrustumTopBottomSymmetric
 Gets or sets a value that indicates whether the camera frustum has a horizontal symmetry axis.
IsParallelProjection
 Get or set whether this projection is parallel.
IsPerspectiveProjection
 Get or set whether this projection is perspective.
IsTwoPointPerspectiveProjection
 Gets a value that indicates whether this projection is a two-point perspective.
IsValid
 Gets a value that indicates whether this complete object is valid.
IsValidCamera
 Gets a value that indicates whether the camera is valid.
IsValidFrustum
 Gets a value that indicates whether the frustum is valid.
ScreenPortAspect
 Gets the sceen aspect ratio.
This is width / height.
TargetPoint
 The current value of the target point. This point does not play a role in the view projection calculations. It can be used as a fixed point when changing the camera so the visible regions of the before and after frustums both contain the region of interest. The default constructor sets this point on ON_3dPoint::UnsetPoint. You must explicitly call one SetTargetPoint() functions to set the target point.
ViewScale
 Applies scaling factors to parallel projection clipping coordinates by setting the m_clip_mod transformation. If you want to compress the view projection across the viewing plane, then set x = 0.5, y = 1.0, and z = 1.0.
Top
Methods
Name | Description
ChangeToParallelProjection
 Use this function to change projections of valid viewports from parallel to perspective. It will make common additional adjustments to the frustum and camera location so the resulting views are similar. The camera direction and target point are not be changed. If the current projection is parallel and symmetricFrustum, FrustumIsLeftRightSymmetric() and FrustumIsTopBottomSymmetric() are all equal, then no changes are made and true is returned.
ChangeToPerspectiveProjection
 Use this function to change projections of valid viewports from parallel to perspective. It will make common additional adjustments to the frustum and camera location so the resulting views are similar. The camera direction and target point are not changed. If the current projection is perspective and symmetricFrustum, IsFrustumIsLeftRightSymmetric, and IsFrustumIsTopBottomSymmetric are all equal, then no changes are made and true is returned.
ChangeToSymmetricFrustum
 If needed, adjusts the current frustum so it has the specified symmetries and adjust the camera location so the target plane remains visible.
ChangeToTwoPointPerspectiveProjection
 Changes projections of valid viewports to a two point perspective. It will make common additional adjustments to the frustum and camera location and direction so the resulting views are similar. If the current projection is perspective and IsFrustumIsLeftRightSymmetric is true and IsFrustumIsTopBottomSymmetric is false, then no changes are made and true is returned.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
DollyCamera
 DollyCamera() does not update the frustum's clipping planes. To update the frustum's clipping planes call DollyFrustum(d) with d = dollyVector o cameraFrameZ. To convert screen locations into a dolly vector, use GetDollyCameraVector(). Does not update frustum. To update frustum use DollyFrustum(d) with d = dollyVector o cameraFrameZ.
DollyExtents(BoundingBox, Double)
 Dolly the camera location and so that the view frustum contains all of the document objects that can be seen in view. If the projection is perspective, the camera angle is not changed.
DollyExtents(IEnumerable<GeometryBase>, Double)
 Dolly the camera location and so that the view frustum contains all of the document objects that can be seen in view. If the projection is perspective, the camera angle is not changed.
DollyFrustum
 Moves the frustum clipping planes.
Extents(Double, BoundingBox)
 Extends this viewport view to include a bounding box.
Use Extents() as a quick way to set a viewport to so that bounding volume is inside of a viewports frustrum. The view angle is used to determine the position of the camera.
Extents(Double, Sphere)
 Extends this viewport view to include a sphere.
Use Extents() as a quick way to set a viewport to so that bounding volume is inside of a viewports frustrum. The view angle is used to determine the position of the camera.
FrustumCenterPoint
 Return a point on the central axis of the view frustum. This point is a good choice for a general purpose target point.
GetBoundingBoxDepth
 Gets near and far clipping distances of a bounding box. This function ignores the current value of the viewport's near and far settings. If the viewport is a perspective projection, the it intersects the semi infinite frustum volume with the bounding box and returns the near and far distances of the intersection. If the viewport is a parallel projection, it instersects the infinte view region with the bounding box and returns the near and far distances of the projection.
GetCameraAngles
 Gets the field of view angles.
GetCameraFrame
 Gets location and vectors of this camera.
GetDollyCameraVector(Point, Point, Double)
 Gets a world coordinate dolly vector that can be passed to DollyCamera().
GetDollyCameraVector(Int32, Int32, Int32, Int32, Double)
 Gets a world coordinate dolly vector that can be passed to DollyCamera().
GetFarPlaneCorners
 Gets the corners of far clipping plane rectangle. 4 points are returned in the order of bottom left, bottom right, top left, top right.
GetFrustum
 Gets the view frustum.
GetFrustumLine(Point)
 Gets the world coordinate line in the view frustum that projects to a point on the screen.
GetFrustumLine(PointF)
 Gets the world coordinate line in the view frustum that projects to a point on the screen.
GetFrustumLine(Double, Double)
 Gets the world coordinate line in the view frustum that projects to a point on the screen.
GetNearPlaneCorners
 Gets the corners of near clipping plane rectangle. 4 points are returned in the order of bottom left, bottom right, top left, top right.
GetObjectData
 Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
GetPointDepth
 Gets the clipping distance of a point. This function ignores the current value of the viewport's near and far settings. If the viewport is a perspective projection, then it intersects the semi infinite frustum volume with the bounding box and returns the near and far distances of the intersection. If the viewport is a parallel projection, it instersects the infinte view region with the bounding box and returns the near and far distances of the projection.
GetScreenPort()
 Gets the location of viewport in pixels. See documentation for SetScreenPort.
GetScreenPort(Int32, Int32)
 Gets the location of viewport in pixels.
See value meanings in SetScreenPort.
GetSphereDepth
 Gets near and far clipping distances of a bounding sphere.
GetWorldToScreenScale
 Gets the scale factor from point in frustum to screen scale.
GetXform
 Computes a transform from a coordinate system to another.
SetCameraDirection
 Sets the direction that the camera faces.
SetCameraLocation
 Sets the camera location (position) point.
SetCameraUp
 Sets the camera up vector.
SetFrustum
 Sets the view frustum. If FrustumSymmetryIsLocked() is true and left != -right or bottom != -top, then they will be adjusted so the resulting frustum is symmetric.
SetFrustumNearFar(BoundingBox)
 Sets the frustum near and far using a bounding box.
SetFrustumNearFar(Double, Double)
 Sets the frustum near and far distances using two values.
SetFrustumNearFar(Point3d, Double)
 Sets the frustum near and far using a center point and radius.
SetFrustumNearFar(Double, Double, Double, Double, Double)
 Sets near and far clipping distance subject to constraints.
SetScreenPort(Rectangle)
 Gets the location of viewport in pixels.
See value meanings in SetScreenPort.
SetScreenPort(Rectangle, Int32, Int32)
 Gets the location of viewport in pixels.
See value meanings in SetScreenPort.
SetScreenPort(Int32, Int32, Int32, Int32, Int32, Int32)
 Location of viewport in pixels. These are provided so you can set the port you are using and get the appropriate transformations to and from screen space. // For a Windows window / int width = width of window client area in pixels; / int height = height of window client area in pixels; / port_left = 0; / port_right = width; / port_top = 0; / port_bottom = height; / port_near = 0; / port_far = 1; / SetScreenPort( port_left, port_right, / port_bottom, port_top, / port_near, port_far );
TargetDistance
 Gets the distance from the target point to the camera plane. Note that if the frustum is not symmetric, then this distance is shorter than the distance from the target to the camera location.
UnlockCamera
 Unlocks the camera vectors and location.
UnlockFrustumSymmetry
 Unlocks frustum horizontal and vertical symmetries.
ZoomToScreenRect(Rectangle)
 Zooms to a screen zone.
View changing from screen input points. Handy for using a mouse to manipulate a view. ZoomToScreenRect() may change camera and frustum settings.
ZoomToScreenRect(Int32, Int32, Int32, Int32)
 Zooms to a screen zone.
View changing from screen input points. Handy for using a mouse to manipulate a view. ZoomToScreenRect() may change camera and frustum settings.
Top
See Also
Reference
Rhino.DocObjects Namespace