RhinoCommon SDK
ViewportInfo.GetScreenPort Method (Int32, Int32)
Rhino for Mac 5.1
 Gets the location of viewport in pixels.
See value meanings in SetScreenPort.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Rectangle GetScreenPort(
	out int near,
	out int far
)
Public Function GetScreenPort (
	<OutAttribute> ByRef near As Integer,
	<OutAttribute> ByRef far As Integer
) As Rectangle
Parameters
near
Type: System.Int32
The near value. This out parameter is assigned during the call.
far
Type: System.Int32
The far value. This out parameter is assigned during the call.
Return Value
Type: Rectangle
The rectangle, or Empty rectangle on error.
See Also
Reference
ViewportInfo Class
GetScreenPort Overload
Rhino.DocObjects Namespace