RhinoCommon SDK
UserData.Read Method
Rhino for Mac 5.1
Reads the content of this data from a stream archive.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual bool Read(
	BinaryArchiveReader archive
)
Protected Overridable Function Read (
	archive As BinaryArchiveReader
) As Boolean
Parameters
archive
Type: Rhino.FileIO.BinaryArchiveReader
An archive.
Return Value
Type: Boolean
true if the data was successfully written. The default implementation always returns false.
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace