RhinoCommon SDK
ObjRef.Face Method
Rhino for Mac 5.1
 If the referenced geometry is a brep face, a brep with one face, or a surface, this returns the brep face.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepFace Face()
Public Function Face As BrepFace
Return Value
Type: BrepFace
A boundary representation face; or null on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace