RhinoCommon SDK
Curve.Split Method (Double)
Rhino for Mac 5.1
 Splits (divides) the curve at the specified parameter. The parameter must be in the interior of the curve's domain.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] Split(
	double t
)
Public Function Split (
	t As Double
) As Curve()
Parameters
t
Type: System.Double
 Parameter to split the curve at in the interval returned by Domain().
Return Value
Type: Curve[]
 Two curves on success, null on failure.
See Also
Reference
Curve Class
Split Overload
Rhino.Geometry Namespace