RhinoCommon SDK
Box.Empty Property
Rhino for Mac 5.1
 Empty Box. Empty boxes are considered to be invalid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Box Empty { get; }
Public Shared ReadOnly Property Empty As Box
	Get
Property Value
Type: Box
See Also
Reference
Box Structure
Rhino.Geometry Namespace