RhinoCommon SDK
Material.MaterialIndex Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.MaterialIndex"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int MaterialIndex { get; }
Public ReadOnly Property MaterialIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Material Class
Rhino.DocObjects Namespace