RhinoCommon SDK
GumballDisplayConduit.PickGumball Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.PickGumball(Rhino.Input.Custom.PickContext,Rhino.Input.Custom.GetPoint)"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PickGumball(
	PickContext pickContext,
	GetPoint getPoint
)
Public Function PickGumball (
	pickContext As PickContext,
	getPoint As GetPoint
) As Boolean
Parameters
pickContext
Type: Rhino.Input.Custom.PickContext
[Missing <param name="pickContext"/> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.PickGumball(Rhino.Input.Custom.PickContext,Rhino.Input.Custom.GetPoint)"]
getPoint
Type: Rhino.Input.Custom.GetPoint
[Missing <param name="getPoint"/> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.PickGumball(Rhino.Input.Custom.PickContext,Rhino.Input.Custom.GetPoint)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.PickGumball(Rhino.Input.Custom.PickContext,Rhino.Input.Custom.GetPoint)"]
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace