RhinoCommon SDK
Curve.ClosestPoints Method (Curve, Point3d, Point3d)
Rhino for Mac 5.1
 Gets closest points between this and another curves.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ClosestPoints(
	Curve otherCurve,
	out Point3d pointOnThisCurve,
	out Point3d pointOnOtherCurve
)
Public Function ClosestPoints (
	otherCurve As Curve,
	<OutAttribute> ByRef pointOnThisCurve As Point3d,
	<OutAttribute> ByRef pointOnOtherCurve As Point3d
) As Boolean
Parameters
otherCurve
Type: Rhino.Geometry.Curve
The other curve.
pointOnThisCurve
Type: Rhino.Geometry.Point3d
The point on this curve. This out parameter is assigned during this call.
pointOnOtherCurve
Type: Rhino.Geometry.Point3d
The point on other curve. This out parameter is assigned during this call.
Return Value
Type: Boolean
true on success; false on error.
See Also
Reference
Curve Class
ClosestPoints Overload
Rhino.Geometry Namespace