RhinoCommon SDK
Point3d Methods
Rhino for Mac 5.1
The Point3d type exposes the following members.
Methods
Name | Description
Add(Point3d, Point3d)
 Sums two Point3d instances.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Add(Point3d, Vector3d)
 Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Add(Point3d, Vector3f)
 Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Add(Vector3d, Point3d)
 Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
ArePointsCoplanar
 Determines whether a set of points is coplanar within a given tolerance.
CompareTo
 Compares this Point3d with another Point3d.
Component evaluation priority is first X, then Y, then Z.
CullDuplicates
 Removes duplicates in the supplied set of points.
DistanceTo
 Computes the distance between two points.
Divide
 Divides a Point3d by a number.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified Object is a Point3d and has the same values as the present point.
 (Overrides ValueType.Equals(Object).)
Equals(Point3d)
 Determines whether the specified Point3d has the same values as the present point.
GetHashCode
 Computes a hash code for the present point.
 (Overrides ValueType.GetHashCode().)
Interpolate
 Interpolate between two points.
Multiply(Double, Point3d)
 Multiplies a Point3d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Point3d, Double)
 Multiplies a Point3d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
SortAndCullPointList
 Orders a set of points so they will be connected in a "reasonable polyline" order.
Also, removes points from the list if their common distance exceeds a specified threshold.
Subtract(Point3d, Point3d)
 Subtracts a point from another point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
Subtract(Point3d, Vector3d)
 Subtracts a vector from a point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
ToString
 Constructs the string representation for the current point.
 (Overrides ValueType.ToString().)
Transform
 Transforms the present point in place. The transformation matrix acts on the left of the point. i.e.,
result = transformation*point
Top
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace