RhinoCommon SDK
RenderSettings.BackgroundColorBottom Property
Rhino for Mac 5.1
 Gets or sets the background bottom color used in rendering.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color BackgroundColorBottom { get; set; }
Public Property BackgroundColorBottom As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
RenderSettings Class
Rhino.Render Namespace