RhinoCommon SDK
ObjectTable.Lock Method
Rhino for Mac 5.1
Overload List
Name | Description
Lock(Guid, Boolean)
 If objref.Object().IsNormal() is true, then the object will be locked.
Lock(ObjRef, Boolean)
 If objref.Object().IsNormal() is true, then the object will be locked.
Lock(RhinoObject, Boolean)
 If obj.IsNormal() is true, then the object will be locked.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace