RhinoCommon SDK
Mesh.OnSwitchToNonConst Method
Rhino for Mac 5.1
 Performs some memory cleanup if necessary
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected override void OnSwitchToNonConst()
Protected Overrides Sub OnSwitchToNonConst
See Also
Reference
Mesh Class
Rhino.Geometry Namespace