RhinoCommon SDK
LightTable.Add Method (Light, ObjectAttributes)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LightTable.Add(Rhino.Geometry.Light,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	Light light,
	ObjectAttributes attributes
)
Public Function Add (
	light As Light,
	attributes As ObjectAttributes
) As Integer
Parameters
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.DocObjects.Tables.LightTable.Add(Rhino.Geometry.Light,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.LightTable.Add(Rhino.Geometry.Light,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LightTable.Add(Rhino.Geometry.Light,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
LightTable Class
Add Overload
Rhino.DocObjects.Tables Namespace