RhinoCommon SDK
ShowMessageResult Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageResult"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum ShowMessageResult
Public Enumeration ShowMessageResult
Members
Member name | Value | Description
None | 0
OK | 1
Cancel | 2
Abort | 3
Retry | 4
Ignore | 5
Yes | 6
No | 7
See Also
Reference
Rhino.UI Namespace