RhinoCommon SDK
Circle.Translate Method
Rhino for Mac 5.1
 Moves the circle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Translate(
	Vector3d delta
)
Public Function Translate (
	delta As Vector3d
) As Boolean
Parameters
delta
Type: Rhino.Geometry.Vector3d
Translation vector.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Circle Structure
Rhino.Geometry Namespace