RhinoCommon SDK
Surface Class
Rhino for Mac 5.1
 Represents a base class that is common to most RhinoCommon surface types.
A surface represents an entity that can be all visited by providing two independent parameters, usually called (u, v), or sometimes (s, t).
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 More...
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class Surface : GeometryBase
<SerializableAttribute>
Public Class Surface
	Inherits GeometryBase
The Surface type exposes the following members.
Constructors
Name | Description
Surface()
 Protected constructor for internal use.
Surface(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
IsSolid
 Gets a values indicating whether a surface is solid.
Top
Methods
Name | Description
ClosestPoint
 Input the parameters of the point on the surface that is closest to testPoint.
ClosestSide
 Gets the side that is closest, in terms of 3D-distance, to a U and V parameter.
CreateExtrusion
 Constructs a surface by extruding a curve along a vector.
CreateExtrusionToPoint
 Constructs a surface by extruding a curve to a point.
CreatePeriodicSurface
 Constructs a periodic surface from a base surface and a direction.
CreateRollingBallFillet(Surface, Surface, Double, Double)
 Constructs a rolling ball fillet between two surfaces.
CreateRollingBallFillet(Surface, Point2d, Surface, Point2d, Double, Double)
 Constructs a rolling ball fillet between two surfaces.
CreateRollingBallFillet(Surface, Boolean, Surface, Boolean, Double, Double)
 Constructs a rolling ball fillet between two surfaces.
CurvatureAt
 Computes the curvature at the given UV coordinate.
Degree
 Returns the maximum algebraic degree of any span (or a good estimate if curve spans are not algebraic).
Domain
Gets the domain in a direction.
Evaluate
 Evaluates a surface mathematically.
Extend
 Extends an untrimmed surface along one edge.
Fit
Fits a new surface through an existing surface.
FrameAt
 Computes the orient plane on a surface given a U and V parameter.
This is the simple evaluation call with no error handling.
GetNextDiscontinuity
 Searches for a derivative, tangent, or curvature discontinuity.
GetSpanVector
 Gets array of span "knots".
GetSurfaceSize
 Gets an estimate of the size of the rectangle that would be created if the 3d surface where flattened into a rectangle.
HasNurbsForm
 Is there a NURBS surface representation of this surface.
InterpolatedCurveOnSurface
 Constructs an interpolated curve on a surface, using 3D points.
InterpolatedCurveOnSurfaceUV
 Constructs an interpolated curve on a surface, using 2D surface points.
IsAtSeam
 Tests if a surface parameter value is at a seam.
IsAtSingularity
 Tests if a surface parameter value is at a singularity.
IsClosed
 Gets a value indicating if the surface is closed in a direction.
IsCone()
 Determines if the surface is a portion of a cone within RhinoMath.ZeroTolerance.
IsCone(Double)
Determines if the surface is a portion of a cone within a given tolerance.
IsContinuous
 Tests continuity at a surface parameter value.
IsCylinder()
 Determines if the surface is a portion of a cylinder within RhinoMath.ZeroTolerance.
IsCylinder(Double)
Determines if the surface is a portion of a cylinder within a given tolerance.
IsIsoparametric(BoundingBox)
 Determines if a 2d bounding box is iso-parameteric in the parameter space of this surface.
IsIsoparametric(Curve)
 Determines if a 2d curve is iso-parameteric in the parameter space of this surface.
IsIsoparametric(Curve, Interval)
 Determines if a 2D curve is iso-parameteric in the parameter space of this surface.
IsoCurve
Gets isoparametric curve.
IsPeriodic
 Gets a value indicating if thr surface is periodic in a direction (default is false).
IsPlanar()
 Tests a surface to see if it is planar to zero tolerance.
IsPlanar(Double)
 Tests a surface to see if it is planar to a given tolerance.
IsSingular
 true if surface side is collapsed to a point.
IsSphere()
 Determines if the surface is a portion of a sphere within RhinoMath.ZeroTolerance.
IsSphere(Double)
 Determines if the surface is a portion of a sphere within a given tolerance.
IsTorus()
Determines if the surface is a portion of a torus within RhinoMath.ZeroTolerance.
IsTorus(Double)
Determines if the surface is a portion of a torus within a given tolerance.
NormalAt
 Computes the surface normal at a point.
This is the simple evaluation call - it does not support error handling.
Offset
 Constructs a new surface which is offset from the current surface.
PointAt
 Evaluates a point at a given parameter.
Pullback(Curve, Double)
 Pulls a 3d curve back to the surface's parameter space.
Pullback(Curve, Double, Interval)
 Pulls a 3d curve back to the surface's parameter space.
Pushup(Curve, Double)
 Computes a 3d curve that is the composite of a 2d curve and the surface map.
Pushup(Curve, Double, Interval)
 Computes a 3d curve that is the composite of a 2d curve and the surface map.
Rebuild
 Rebuilds an existing surface to a given degree and point count.
Reverse(Int32)
 Reverses parameterization Domain changes from [a,b] to [-b,-a]
Reverse(Int32, Boolean)
 Same as Reverse, but if inPlace is set to true this Surface is modified instead of a new copy being created.
SetDomain
 Sets the domain in a direction.
ShortPath
 Constructs a geodesic between 2 points, used by ShortPath command in Rhino.
SpanCount
 Gets number of smooth nonempty spans in the parameter direction.
Split
 Splits (divides) the surface into two parts at the specified parameter
ToBrep
 Converts the surface into a Brep.
ToNurbsSurface()
 Gets a NURBS surface representation of this surface. Default tolerance of 0.0 is used.
ToNurbsSurface(Double, Int32)
 Gets a NURBS surface representation of this surface.
Transpose()
 Transposes surface parameterization (swap U and V)
Transpose(Boolean)
 Transposes surface parameterization (swap U and V)
Trim
 Constructs a sub-surface that covers the specified UV trimming domain.
TryGetCone(Cone)
Tests a surface to see if it is a portion of a cone within RhinoMath.ZeroTolerance and return the cone.
TryGetCone(Cone, Double)
Tests a surface to see if it is a portion of a cone and returns the cone.
TryGetCylinder(Cylinder)
Tests a surface to see if it is a portion of a cylinder within RhinoMath.ZeroTolerance and return the cylinder.
TryGetCylinder(Cylinder, Double)
Tests a surface to see if it is a portion of a cylinder and return the cylinder.
TryGetPlane(Plane)
Tests a surface for planarity and return the plane.
TryGetPlane(Plane, Double)
Tests a surface for planarity and return the plane.
TryGetSphere(Sphere)
Test a surface to see if it is a portion of a sphere and return the sphere.
TryGetSphere(Sphere, Double)
Test a surface to see if it is a portion of a sphere and return the sphere.
TryGetTorus(Torus)
Tests a surface to see if it is a portion of a torus within RhinoMath.ZeroTolerance and returns the torus.
TryGetTorus(Torus, Double)
Tests a surface to see if it is a portion of a torus and returns the torus.
Top
See Also
Reference
Rhino.Geometry Namespace
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.Extrusion
 Rhino.Geometry.NurbsSurface
 Rhino.Geometry.PlaneSurface
 Rhino.Geometry.RevSurface
 Rhino.Geometry.SumSurface
 Rhino.Geometry.SurfaceProxy