RhinoCommon SDK
Surface.ToBrep Method
Rhino for Mac 5.1
 Converts the surface into a Brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep ToBrep()
Public Function ToBrep As Brep
Return Value
Type: Brep
A Brep with a similar shape like this surface or null.
See Also
Reference
Surface Class
Rhino.Geometry Namespace