RhinoCommon SDK
ObjectTable.AddRhinoObject Method (BrepObject, Brep)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.BrepObject,Rhino.Geometry.Brep)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddRhinoObject(
	BrepObject brepObject,
	Brep brep
)
Public Sub AddRhinoObject (
	brepObject As BrepObject,
	brep As Brep
)
Parameters
brepObject
Type: Rhino.DocObjects.BrepObject
[Missing <param name="brepObject"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.BrepObject,Rhino.Geometry.Brep)"]
brep
Type: Rhino.Geometry.Brep
[Missing <param name="brep"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.BrepObject,Rhino.Geometry.Brep)"]
See Also
Reference
ObjectTable Class
AddRhinoObject Overload
Rhino.DocObjects.Tables Namespace