RhinoCommon SDK
Plane.RemapToPlaneSpace Method
Rhino for Mac 5.1
 Convert a point from World space coordinates into Plane space coordinates.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool RemapToPlaneSpace(
	Point3d ptSample,
	out Point3d ptPlane
)
Public Function RemapToPlaneSpace (
	ptSample As Point3d,
	<OutAttribute> ByRef ptPlane As Point3d
) As Boolean
Parameters
ptSample
Type: Rhino.Geometry.Point3d
World point to remap.
ptPlane
Type: Rhino.Geometry.Point3d
Point in plane (s,t,d) coordinates.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
D stands for distance, not disease.
See Also
Reference
Plane Structure
Rhino.Geometry Namespace