RhinoCommon SDK
Brep.GetRegions Method
Rhino for Mac 5.1
 Gets an array containing all regions in this brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepRegion[] GetRegions()
Public Function GetRegions As BrepRegion()
Return Value
Type: BrepRegion[]
An array of regions in this brep. This array can be empty, but not null.
See Also
Reference
Brep Class
Rhino.Geometry Namespace