RhinoCommon SDK
RhinoView.Destroy Event
Rhino for Mac 5.1
[Missing <summary> documentation for "E:Rhino.Display.RhinoView.Destroy"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<ViewEventArgs> Destroy
Public Shared Event Destroy As EventHandler(Of ViewEventArgs)
Value
Type: System.EventHandler<ViewEventArgs>
See Also
Reference
RhinoView Class
Rhino.Display Namespace