RhinoCommon SDK
InstanceDefinitionTable.ModifyGeometry Method (Int32, IEnumerable<GeometryBase>)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifyGeometry(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ModifyGeometry(
	int idefIndex,
	IEnumerable<GeometryBase> newGeometry
)
Public Function ModifyGeometry (
	idefIndex As Integer,
	newGeometry As IEnumerable(Of GeometryBase)
) As Boolean
Parameters
idefIndex
Type: System.Int32
[Missing <param name="idefIndex"/> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifyGeometry(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})"]
newGeometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
[Missing <param name="newGeometry"/> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifyGeometry(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifyGeometry(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})"]
See Also
Reference
InstanceDefinitionTable Class
ModifyGeometry Overload
Rhino.DocObjects.Tables Namespace