RhinoCommon SDK
Vector3d.IsPerpendicularTo Method (Vector3d)
Rhino for Mac 5.1
 Test to see whether this vector is perpendicular to within one degree of another one.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsPerpendicularTo(
	Vector3d other
)
Public Function IsPerpendicularTo (
	other As Vector3d
) As Boolean
Parameters
other
Type: Rhino.Geometry.Vector3d
Vector to compare to.
Return Value
Type: Boolean
true if both vectors are perpendicular, false if otherwise.
See Also
Reference
Vector3d Structure
IsPerpendicularTo Overload
Rhino.Geometry Namespace