RhinoCommon SDK
File3dmObjectTable.AddLinearDimension Method
Rhino for Mac 5.1
Overload List
Name | Description
AddLinearDimension(LinearDimension)
 Adds a linear dimension to the 3dm file object table.
AddLinearDimension(LinearDimension, ObjectAttributes)
 Adds a linear dimension to the 3dm file object table.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace