RhinoCommon SDK
BrepLoopList.Add Method (BrepLoopType, BrepFace)
Rhino for Mac 5.1
 Create a new boundary loop on a face. After you get this BrepLoop, you still need to create the vertices, edges, and trims that define the loop.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepLoop Add(
	BrepLoopType loopType,
	BrepFace face
)
Public Function Add (
	loopType As BrepLoopType,
	face As BrepFace
) As BrepLoop
Parameters
loopType
Type: Rhino.Geometry.BrepLoopType
[Missing <param name="loopType"/> documentation for "M:Rhino.Geometry.Collections.BrepLoopList.Add(Rhino.Geometry.BrepLoopType,Rhino.Geometry.BrepFace)"]
face
Type: Rhino.Geometry.BrepFace
[Missing <param name="face"/> documentation for "M:Rhino.Geometry.Collections.BrepLoopList.Add(Rhino.Geometry.BrepLoopType,Rhino.Geometry.BrepFace)"]
Return Value
Type: BrepLoop
New loop that needs to be filled in
See Also
Reference
BrepLoopList Class
Add Overload
Rhino.Geometry.Collections Namespace