RhinoCommon SDK
FileWriteOptions.FileVersion Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.FileVersion"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int FileVersion { get; set; }
Public Property FileVersion As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace