RhinoCommon SDK
ObjectPlotWeightSource Enumeration
Rhino for Mac 5.1
 Defines enumerated values for the source of plotting/printing weight of single objects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum ObjectPlotWeightSource
Public Enumeration ObjectPlotWeightSource
Members
Member name | Value | Description
PlotWeightFromLayer | 0 | use plot color assigned to layer.
PlotWeightFromObject | 1 | use plot color assigned to object.
PlotWeightFromParent | 3 |  for objects with parents (like objects in instance references, use parent plot color) if no parent, treat as plot_color_from_layer.
See Also
Reference
Rhino.DocObjects Namespace