RhinoCommon SDK
MaterialRefs.Keys Property
Rhino for Mac 5.1
 Gets an ICollection containing the plug-in Id's in this dictionary.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ICollection<Guid> Keys { get; }
Public ReadOnly Property Keys As ICollection(Of Guid)
	Get
Property Value
Type: ICollection<Guid>
Implements
IDictionary<TKey, TValue>.Keys
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace