RhinoCommon SDK
Unroller.AddFollowingGeometry Method (Curve)
Rhino for Mac 5.1
 Adds a curve that should be unrolled along with the surface/brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddFollowingGeometry(
	Curve curve
)
Public Sub AddFollowingGeometry (
	curve As Curve
)
Parameters
curve
Type: Rhino.Geometry.Curve
The curve.
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace