RhinoCommon SDK
Ray3d.Equals Method (Object)
Rhino for Mac 5.1
 Determines whether the specified System.Object is a Ray3d and has the same values as the present ray.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
The specified object.
Return Value
Type: Boolean
true if obj is a Ray3d and has the same position and direction as this; otherwise false.
See Also
Reference
Ray3d Structure
Equals Overload
Rhino.Geometry Namespace