RhinoCommon SDK
HatchPatternTable Methods
Rhino for Mac 5.1
The HatchPatternTable type exposes the following members.
Methods
Name | Description
Add
 Adds a new hatch pattern with specified definition to the table.
Find
 Finds the hatch pattern with a given name. Search ignores case.
GetEnumerator
Top
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace