RhinoCommon SDK
CustomDisplay.AddPoints Method (IEnumerable<Point3d>, Color, PointStyle, Int32)
Rhino for Mac 5.1
 Adds a collection of stylized points to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddPoints(
	IEnumerable<Point3d> points,
	Color color,
	PointStyle style,
	int radius
)
Public Sub AddPoints (
	points As IEnumerable(Of Point3d),
	color As Color,
	style As PointStyle,
	radius As Integer
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to add.
color
Type: System.Drawing.Color
Color of points.
style
Type: Rhino.Display.PointStyle
Display style of points.
radius
Type: System.Int32
Radius of point widgets.
See Also
Reference
CustomDisplay Class
AddPoints Overload
Rhino.Display Namespace