RhinoCommon SDK
CustomDisplay.AddPoints Method (IEnumerable<Point3d>, Color)
Rhino for Mac 5.1
 Adds a collection of colored points to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddPoints(
	IEnumerable<Point3d> points,
	Color color
)
Public Sub AddPoints (
	points As IEnumerable(Of Point3d),
	color As Color
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to add.
color
Type: System.Drawing.Color
Color of points.
See Also
Reference
CustomDisplay Class
AddPoints Overload
Rhino.Display Namespace