RhinoCommon SDK
ObjectTable.AddLeader Method (String, IEnumerable<Point3d>)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddLeader(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddLeader(
	string text,
	IEnumerable<Point3d> points
)
Public Function AddLeader (
	text As String,
	points As IEnumerable(Of Point3d)
) As Guid
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddLeader(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
points
Type: System.Collections.Generic.IEnumerable<Point3d>
[Missing <param name="points"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddLeader(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddLeader(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
See Also
Reference
ObjectTable Class
AddLeader Overload
Rhino.DocObjects.Tables Namespace