RhinoCommon SDK
BrepCurveList.Add Method
Rhino for Mac 5.1
Adds a curve
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	Curve curve
)
Public Function Add (
	curve As Curve
) As Integer
Parameters
curve
Type: Rhino.Geometry.Curve
A copy of the curve is added to this brep
Return Value
Type: Int32
 Index that should be used to reference the geometry.
-1 is returned if the input is not acceptable.
See Also
Reference
BrepCurveList Class
Rhino.Geometry.Collections Namespace