RhinoCommon SDK
CurveIntersections.Item Property
Rhino for Mac 5.1
 Gets the intersection event data at the given index.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IntersectionEvent this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As IntersectionEvent
	Get
Parameters
index
Type: System.Int32
Index of intersection event to retrieve.
Property Value
Type: IntersectionEvent
See Also
Reference
CurveIntersections Class
Rhino.Geometry.Intersect Namespace