RhinoCommon SDK
Extrusion.SetPathAndUp Method
Rhino for Mac 5.1
 Allows to set the two points at the extremes and the up vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetPathAndUp(
	Point3d a,
	Point3d b,
	Vector3d up
)
Public Function SetPathAndUp (
	a As Point3d,
	b As Point3d,
	up As Vector3d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point3d
The start point.
b
Type: Rhino.Geometry.Point3d
The end point.
up
Type: Rhino.Geometry.Vector3d
The up vector.
Return Value
Type: Boolean
true if the operation succeeded; otherwise false. Setting up=a-b will make the operation fail.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace