RhinoCommon SDK
Intersection.BrepSurface Method
Rhino for Mac 5.1
 Intersects a Brep and a Surface.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool BrepSurface(
	Brep brep,
	Surface surface,
	double tolerance,
	out Curve[] intersectionCurves,
	out Point3d[] intersectionPoints
)
Public Shared Function BrepSurface (
	brep As Brep,
	surface As Surface,
	tolerance As Double,
	<OutAttribute> ByRef intersectionCurves As Curve(),
	<OutAttribute> ByRef intersectionPoints As Point3d()
) As Boolean
Parameters
brep
Type: Rhino.Geometry.Brep
A brep to be intersected.
surface
Type: Rhino.Geometry.Surface
A surface to be intersected.
tolerance
Type: System.Double
A tolerance value.
intersectionCurves
Type: Rhino.Geometry.Curve[]
The intersection curves array argument. This out reference is assigned during the call.
intersectionPoints
Type: Rhino.Geometry.Point3d[]
The intersection points array argument. This out reference is assigned during the call.
Return Value
Type: Boolean
true on success; false on failure.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace