RhinoCommon SDK
ObjectPropertiesPage.ShouldDisplay Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.ObjectPropertiesPage.ShouldDisplay(Rhino.DocObjects.RhinoObject)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual bool ShouldDisplay(
	RhinoObject rhObj
)
Public Overridable Function ShouldDisplay (
	rhObj As RhinoObject
) As Boolean
Parameters
rhObj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhObj"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.ShouldDisplay(Rhino.DocObjects.RhinoObject)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPage.ShouldDisplay(Rhino.DocObjects.RhinoObject)"]
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace