RhinoCommon SDK
StackedDialogPage.PageControl Property
Rhino for Mac 5.1
 Return the control that represents this page. Currently only classes derived from System.Windows.Forms.Control are allowed
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract Object PageControl { get; }
Public MustOverride ReadOnly Property PageControl As Object
	Get
Property Value
Type: Object
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace