RhinoCommon SDK
ToolbarFile.GetToolbar Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFile.GetToolbar(System.Int32)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Toolbar GetToolbar(
	int index
)
Public Function GetToolbar (
	index As Integer
) As Toolbar
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.ToolbarFile.GetToolbar(System.Int32)"]
Return Value
Type: Toolbar
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFile.GetToolbar(System.Int32)"]
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace