RhinoCommon SDK
ArcCurve.Arc Property
Rhino for Mac 5.1
 Gets the arc that is contained within this ArcCurve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Arc Arc { get; }
Public ReadOnly Property Arc As Arc
	Get
Property Value
Type: Arc
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace