RhinoCommon SDK
LightTable.Find Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LightTable.Find(System.Guid,System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Find(
	Guid id,
	bool ignoreDeleted
)
Public Function Find (
	id As Guid,
	ignoreDeleted As Boolean
) As Integer
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.Tables.LightTable.Find(System.Guid,System.Boolean)"]
ignoreDeleted
Type: System.Boolean
[Missing <param name="ignoreDeleted"/> documentation for "M:Rhino.DocObjects.Tables.LightTable.Find(System.Guid,System.Boolean)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LightTable.Find(System.Guid,System.Boolean)"]
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace