RhinoCommon SDK
RhinoViewport.KeyboardDolly Method
Rhino for Mac 5.1
 Emulates the keyboard arrow key in terms of interaction.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool KeyboardDolly(
	bool leftRight,
	double amount
)
Public Function KeyboardDolly (
	leftRight As Boolean,
	amount As Double
) As Boolean
Parameters
leftRight
Type: System.Boolean
left/right dolly if true, up/down dolly if false.
amount
Type: System.Double
The dolly amount.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace