RhinoCommon SDK
DisplayModeDescription.EnglishName Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.EnglishName"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string EnglishName { get; set; }
Public Property EnglishName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace