RhinoCommon SDK
LayerTable Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.LayerTable"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.LayerTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class LayerTable : IEnumerable<Layer>,
	IEnumerable
Public NotInheritable Class LayerTable
	Implements IEnumerable(Of Layer), IEnumerable
The LayerTable type exposes the following members.
Properties
Name | Description
ActiveCount
 Returns number of layers in the layer table, excluding deleted layers.
Count
 Returns number of layers in the layer table, including deleted layers.
CurrentLayer
 At all times, there is a "current" layer. Unless otherwise specified, new objects are assigned to the current layer. The current layer is never locked, hidden, or deleted. Returns reference to the current layer. Note that this reference may become invalid after a call to AddLayer().
CurrentLayerIndex
 At all times, there is a "current" layer. Unless otherwise specified, new objects are assigned to the current layer. The current layer is never locked, hidden, or deleted. Resturns: Zero based layer table index of the current layer.
Document
Document that owns this table.
Item
 Conceptually, the layer table is an array of layers. The operator[] can be used to get individual layers. A layer is either active or deleted and this state is reported by Layer.IsDeleted.
Top
Methods
Name | Description
Add()
 Adds a new layer with default definition to the layer table.
Add(Layer)
 Adds a new layer with specified definition to the layer table.
Add(String, Color)
 Adds a new layer with specified definition to the layer table.
AddReferenceLayer()
 Adds a new reference layer with default definition to the layer table. Reference layers are not saved in files.
AddReferenceLayer(Layer)
 Adds a new reference layer with specified definition to the layer table Reference layers are not saved in files.
Delete
Deletes layer.
Find(Guid, Boolean)
Finds a layer with a matching ID.
Find(String, Boolean)
 Finds the layer with a given name. If multiple layers exist that have the same name, the first match layer index will be returned.
FindByFullPath
FindNext
ForceLayerVisible(Guid)
 Makes a layer and all of its parent layers visible.
ForceLayerVisible(Int32)
 Makes a layer and all of its parent layers visible.
GetEnumerator
GetUnusedLayerName
 Gets the next unused layer name used as default when creating new layers.
Modify
Modifies layer settings.
Purge
 Delete layer and all geometry objects on a layer
SetCurrentLayerIndex
 At all times, there is a "current" layer. Unless otherwise specified, new objects are assigned to the current layer. The current layer is never locked, hidden, or deleted.
Undelete
 Undeletes a layer that has been deleted by DeleteLayer().
UndoModify(Int32)
UndoModify(Int32, UInt32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace