RhinoCommon SDK
Brep.CreateBooleanIntersection Method
Rhino for Mac 5.1
Overload List
Name | Description
CreateBooleanIntersection(Brep, Brep, Double)
 Compute the Solid Intersection of two Breps.
CreateBooleanIntersection(IEnumerable<Brep>, IEnumerable<Brep>, Double)
 Compute the Solid Intersection of two sets of Breps.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace