RhinoCommon SDK
NurbsSurfacePointList Class
Rhino for Mac 5.1
 Provides access to the control points of a nurbs surface.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.NurbsSurfacePointList
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class NurbsSurfacePointList : IEnumerable<ControlPoint>,
	IEpsilonComparable<NurbsSurfacePointList>, IEnumerable
Public NotInheritable Class NurbsSurfacePointList
	Implements IEnumerable(Of ControlPoint), IEpsilonComparable(Of NurbsSurfacePointList),
	IEnumerable
The NurbsSurfacePointList type exposes the following members.
Properties
Name | Description
CountU
 Gets the number of control points in the U direction of this surface.
CountV
 Gets the number of control points in the V direction of this surface.
Top
Methods
Name | Description
EnsurePrivateCopy
 If you want to keep a copy of this class around by holding onto it in a variable after a command completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can call this function as many times as you want.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
GetControlPoint
 Gets the control point at the given (u, v) index.
GetGrevillePoint
 Gets the Greville point (u, v) coordinates associated with the control point at the given indices.
SetControlPoint(Int32, Int32, ControlPoint)
 Sets the control point at the given (u, v) index.
SetControlPoint(Int32, Int32, Point3d)
 Sets the control point at the given (u, v) index.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace