RhinoCommon SDK
MaterialRefs.Add Method (KeyValuePair<Guid, MaterialRef>)
Rhino for Mac 5.1
 Adds an item to this dictionary.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Add(
	KeyValuePair<Guid, MaterialRef> item
)
Public Sub Add (
	item As KeyValuePair(Of Guid, MaterialRef)
)
Parameters
item
Type: System.Collections.Generic.KeyValuePair<Guid, MaterialRef>
 The object to add to this dictionary
Implements
ICollection<T>.Add(T)
Exceptions
Exception | Condition
ArgumentNullException |  value is null.
ArgumentException |  key is empty.
See Also
Reference
MaterialRefs Class
Add Overload
Rhino.DocObjects Namespace