RhinoCommon SDK
SelectionMethod Enumeration
Rhino for Mac 5.1
 Defines enumerated values for several kinds of selection methods.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum SelectionMethod
Public Enumeration SelectionMethod
Members
Member name | Value | Description
Other | 0 |  Selected by non-mouse method (SelAll, etc.)
MousePick | 1 |  Selected by a mouse click on the object.
WindowBox | 2 |  Selected by a mouse selection window box. Window selection indicates the object is completely contained by the selection rectangle.
CrossingBox | 3 |  Selected by a mouse selection crossing box. A crossing selection indicates the object intersects with the selection rectangle.
See Also
Reference
Rhino.DocObjects Namespace