RhinoCommon SDK
GetPointMouseEventArgs.WindowPoint Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.WindowPoint"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point WindowPoint { get; }
Public ReadOnly Property WindowPoint As Point
	Get
Property Value
Type: Point
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace