RhinoCommon SDK
InstanceDefinition Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.InstanceDefinition"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.InstanceDefinition
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class InstanceDefinition
Public NotInheritable Class InstanceDefinition
The InstanceDefinition type exposes the following members.
Properties
Name | Description
ArchiveFileStatus
 Returns the archive file status of a linked instance definition.
Description
Id
Index
 Index of this instance definition in the index definition table.
IsDeleted
IsReference
 An object from a work session reference model is reference a reference object and cannot be modified. An object is a reference object if, and only if, it is on a reference layer.
IsTenuous
LayerStyle
Name
ObjectCount
 Number of objects this definition uses. This counts the objects that are used to define the geometry. This does NOT count the number of references to this instance definition.
SkipNestedLinkedDefinitions
 Controls how much geometry is read when a linked InstanceDefinition is updated.
SourceArchive
UpdateType
Url
 The hyperlink URL that is executed when the UrlDescription hyperlink is clicked on in the Insert and Block UI
UrlDescription
 The URL description displayed as a hyperlink in the Insert and Block UI
Top
Methods
Name | Description
CreatePreviewBitmap(DefinedViewportProjection, Size)
CreatePreviewBitmap(DefinedViewportProjection, DisplayMode, Size)
GetContainers
 Gets a list of all the InstanceDefinitions that contain a reference this InstanceDefinition.
GetObjects
 Gets an array with the objects that belong to this instance definition.
GetReferences
 Gets a list of the CRhinoInstanceObjects (inserts) that contains a reference this instance definition.
InUse
 Determines whether the instance definition is referenced.
Object
 returns an object used as part of this definition.
UsesDefinition
 Determines if this instance definition contains a reference to another instance definition.
Top
See Also
Reference
Rhino.DocObjects Namespace