RhinoCommon SDK
CustomDisplay.Dispose Method
Rhino for Mac 5.1
 Dispose this CustomDisplay instance. You must call this function in order to properly shut down the CustomDisplay.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace