RhinoCommon SDK
CustomMeshObject Constructor
Rhino for Mac 5.1
Overload List
Name | Description
CustomMeshObject()
Initializes a new instance of the CustomMeshObject class
CustomMeshObject(Mesh)
Initializes a new instance of the CustomMeshObject class
Top
See Also
Reference
CustomMeshObject Class
Rhino.DocObjects.Custom Namespace