RhinoCommon SDK
GumballObject Properties
Rhino for Mac 5.1
The GumballObject type exposes the following members.
Properties
Name | Description
Frame
Top
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace