RhinoCommon SDK
RhinoViewport.ChangeCounter Property
Rhino for Mac 5.1
 The value of change counter is incremented every time the view projection or construction plane changes. The user can the mouse and nestable view manipulation commands to change a view at any time. The value of change counter can be used to detect these changes in code that is sensitive to the view projection.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public uint ChangeCounter { get; }
Public ReadOnly Property ChangeCounter As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace