RhinoCommon SDK
Transform.Equals Method
Rhino for Mac 5.1
Overload List
Name | Description
Equals(Object)
 Determines if another object is a transform and its value equals this transform value.
 (Overrides ValueType.Equals(Object).)
Equals(Transform)
 Determines if another transform equals this transform value.
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace