RhinoCommon SDK
LayerTable.Purge Method
Rhino for Mac 5.1
 Delete layer and all geometry objects on a layer
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Purge(
	int layerIndex,
	bool quiet
)
Public Function Purge (
	layerIndex As Integer,
	quiet As Boolean
) As Boolean
Parameters
layerIndex
Type: System.Int32
 zero based index of layer to delete. This must be in the range 0 <= layerIndex < LayerTable.Count.
quiet
Type: System.Boolean
 If true, no warning message box appears if a layer the layer cannot be deleted because it is the current layer.
Return Value
Type: Boolean
 true if successful. false if layerIndex is out of range or the the layer cannot be deleted because it is the current layer.
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace