RhinoCommon SDK
MeshPoint.Triangle Property
Rhino for Mac 5.1
 Face triangle where the intersection takes place:
0 is unset
A is 0,1,2
B is 0,2,3
C is 0,1,3
D is 1,2,3
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public char Triangle { get; }
Public ReadOnly Property Triangle As Char
	Get
Property Value
Type: Char
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace