RhinoCommon SDK
PolyCurve.PolyCurveParameter Method
Rhino for Mac 5.1
 Converts a segment curve parameter to a polycurve parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double PolyCurveParameter(
	int segmentIndex,
	double segmentCurveParameter
)
Public Function PolyCurveParameter (
	segmentIndex As Integer,
	segmentCurveParameter As Double
) As Double
Parameters
segmentIndex
Type: System.Int32
Index of segment.
segmentCurveParameter
Type: System.Double
Parameter on segment.
Return Value
Type: Double
 Polycurve evaluation parameter or UnsetValue if the polycurve curve parameter could not be computed.
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace