RhinoCommon SDK
Material.Id Property
Rhino for Mac 5.1
Gets or sets the ID of this material.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
Material Class
Rhino.DocObjects Namespace