RhinoCommon SDK
Point2d.GetHashCode Method
Rhino for Mac 5.1
 Computes a hash number that represents the current point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A hash code that is not unique for each point.
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace