RhinoCommon SDK
BoundingBox.Union Method (BoundingBox)
Rhino for Mac 5.1
 Updates this BoundingBox to represent the union of itself and another box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Union(
	BoundingBox other
)
Public Sub Union (
	other As BoundingBox
)
Parameters
other
Type: Rhino.Geometry.BoundingBox
Box to include in this union.
Remarks
If either this BoundingBox or the other BoundingBox is InValid, the Valid BoundingBox will be the only one included in the union.
See Also
Reference
BoundingBox Structure
Union Overload
Rhino.Geometry Namespace