RhinoCommon SDK
Cylinder.CircleAt Method
Rhino for Mac 5.1
 Compute the circle at the given elevation parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Circle CircleAt(
	double linearParameter
)
Public Function CircleAt (
	linearParameter As Double
) As Circle
Parameters
linearParameter
Type: System.Double
Height parameter for circle section.
Return Value
Type: Circle
[Missing <returns> documentation for "M:Rhino.Geometry.Cylinder.CircleAt(System.Double)"]
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace