RhinoCommon SDK
Vector2f.Equality Operator
Rhino for Mac 5.1
 Determines whether two vectors have equal values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator ==(
	Vector2f a,
	Vector2f b
)
Public Shared Operator = (
	a As Vector2f,
	b As Vector2f
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector2f
The first vector.
b
Type: Rhino.Geometry.Vector2f
The second vector.
Return Value
Type: Boolean
true if the components of the two vectors are exactly equal; otherwise false.
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace