RhinoCommon SDK
GumballFrame Structure
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.Gumball.GumballFrame"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public struct GumballFrame
Public Structure GumballFrame
The GumballFrame type exposes the following members.
Properties
Name | Description
Plane
ScaleGripDistance
ScaleMode
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI.Gumball Namespace