RhinoCommon SDK
ViewTable.Find Method (String, Boolean)
Rhino for Mac 5.1
 Finds a view in this document with a main viewport that has a given name. Note that there may be multiple views in this document that have the same name. This function only returns the first view found. If you want to find all the views with a given name, use the GetViewList function and iterate through the views.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoView Find(
	string mainViewportName,
	bool compareCase
)
Public Function Find (
	mainViewportName As String,
	compareCase As Boolean
) As RhinoView
Parameters
mainViewportName
Type: System.String
The name of the main viewport.
compareCase
Type: System.Boolean
true if capitalization influences comparison; otherwise, false.
Return Value
Type: RhinoView
A Rhino view on success; null on error.
See Also
Reference
ViewTable Class
Find Overload
Rhino.DocObjects.Tables Namespace