RhinoCommon SDK
Box.GetCorners Method
Rhino for Mac 5.1
 Gets an array of the 8 corner points of this box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d[] GetCorners()
Public Function GetCorners As Point3d()
Return Value
Type: Point3d[]
An array of 8 corners.
See Also
Reference
Box Structure
Rhino.Geometry Namespace