RhinoCommon SDK
Vector3f.Equality Operator
Rhino for Mac 5.1
 Determines whether two vectors have equal values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator ==(
	Vector3f a,
	Vector3f b
)
Public Shared Operator = (
	a As Vector3f,
	b As Vector3f
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector3f
The first vector.
b
Type: Rhino.Geometry.Vector3f
The second vector.
Return Value
Type: Boolean
true if the components of the two vectors are exactly equal; otherwise false.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace