RhinoCommon SDK
CustomBrepObject Constructor (Brep)
Rhino for Mac 5.1
Initializes a new instance of the CustomBrepObject class
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected CustomBrepObject(
	Brep brep
)
Protected Sub New (
	brep As Brep
)
Parameters
brep
Type: Rhino.Geometry.Brep
[Missing <param name="brep"/> documentation for "M:Rhino.DocObjects.Custom.CustomBrepObject.#ctor(Rhino.Geometry.Brep)"]
See Also
Reference
CustomBrepObject Class
CustomBrepObject Overload
Rhino.DocObjects.Custom Namespace