RhinoCommon SDK
Line.ToX Property
Rhino for Mac 5.1
 Gets or sets the X coordinate of the line To point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ToX { get; set; }
Public Property ToX As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Line Structure
Rhino.Geometry Namespace