RhinoCommon SDK
Line.ToY Property
Rhino for Mac 5.1
 Gets or sets the Y coordinate of the line To point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ToY { get; set; }
Public Property ToY As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Line Structure
Rhino.Geometry Namespace