RhinoCommon SDK
MorphControl.Curve Property
Rhino for Mac 5.1
 Returns the morph control's curve. While this should never be null, the calling function should check.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsCurve Curve { get; }
Public ReadOnly Property Curve As NurbsCurve
	Get
Property Value
Type: NurbsCurve
See Also
Reference
MorphControl Class
Rhino.Geometry Namespace