RhinoCommon SDK
ObjectPropertiesPage.LocalPageTitle Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.ObjectPropertiesPage.LocalPageTitle"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual string LocalPageTitle { get; }
Public Overridable ReadOnly Property LocalPageTitle As String
	Get
Property Value
Type: String
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace