RhinoCommon SDK
NamedConstructionPlaneTable Class
Rhino for Mac 5.1
 Contains all named construction planes in a rhino document.
This class cannot be inherited.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.NamedConstructionPlaneTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class NamedConstructionPlaneTable : IEnumerable<ConstructionPlane>,
	IEnumerable
Public NotInheritable Class NamedConstructionPlaneTable
	Implements IEnumerable(Of ConstructionPlane), IEnumerable
The NamedConstructionPlaneTable type exposes the following members.
Properties
Name | Description
Count
Number of construction planes in the table.
Document
Gets the document that owns this table.
Item
 Conceptually, the named construction plane table is an array of ConstructionPlanes and their associated names. The operator[] can be used to get individual ConstructionPlanes.
Top
Methods
Name | Description
Add
 Adds named construction plane to document.
Delete(Int32)
 Remove named construction plane from the document.
Delete(String)
 Remove named construction plane from the document.
Find
Finds a named construction plane.
GetEnumerator
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace