RhinoCommon SDK
NurbsCurve.HasBezierSpans Property
Rhino for Mac 5.1
 Returns true if the NURBS curve has bezier spans (all distinct knots have multiplitity = degree)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool HasBezierSpans { get; }
Public ReadOnly Property HasBezierSpans As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace