RhinoCommon SDK
MouseCallback.MouseCallbackFromCPP Delegate
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.MouseCallback.MouseCallbackFromCPP"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public delegate int MouseCallbackFromCPP(
	IntPtr pRhinoView,
	int which,
	int button,
	int x,
	int y
)
Public Delegate Function MouseCallbackFromCPP (
	pRhinoView As IntPtr,
	which As Integer,
	button As Integer,
	x As Integer,
	y As Integer
) As Integer
Parameters
pRhinoView
Type: System.IntPtr
which
Type: System.Int32
button
Type: System.Int32
x
Type: System.Int32
y
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
Rhino.UI Namespace