RhinoCommon SDK
DisplayMaterial Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.DisplayMaterial"]
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayMaterial
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class DisplayMaterial : IDisposable
Public Class DisplayMaterial
	Implements IDisposable
The DisplayMaterial type exposes the following members.
Constructors
Name | Description
DisplayMaterial()
 Constructs a default material.
DisplayMaterial(Color)
 Constructs a default material with a specific diffuse color.
DisplayMaterial(DisplayMaterial)
 Duplicate another material.
DisplayMaterial(Material)
Initializes a new instance of the DisplayMaterial class
DisplayMaterial(Color, Double)
 Constructs a default material with a specific diffuse color and transparency.
DisplayMaterial(Color, Color, Color, Color, Double, Double)
 Constructs a material with custom properties.
Top
Properties
Name | Description
Ambient
 Gets or sets the Ambient color of the Material. The alpha component of the color will be ignored.
BackAmbient
 Gets or sets the Ambient color of the back side of the Material. The alpha component of the color will be ignored.
BackDiffuse
 Gets or sets the Diffuse color of the back side of the Material. The alpha component of the color will be ignored.
BackEmission
 Gets or sets the Emissive color of the back side of the Material. The alpha component of the color will be ignored.
BackShine
 Gets or sets the shine factor of the back side of the material (0.0 to 1.0)
BackSpecular
 Gets or sets the Specular color of the back side of the Material. The alpha component of the color will be ignored.
BackTransparency
 Gets or sets the transparency of the back side material (0.0 = opaque to 1.0 = transparent)
Diffuse
 Gets or sets the Diffuse color of the Material. The alpha component of the color will be ignored.
Emission
 Gets or sets the Emissive color of the Material. The alpha component of the color will be ignored.
IsTwoSided
Shine
 Gets or sets the shine factor of the material (0.0 to 1.0)
Specular
 Gets or sets the Specular color of the Material. The alpha component of the color will be ignored.
Transparency
 Gets or sets the transparency of the material (0.0 = opaque to 1.0 = transparent)
Top
Methods
Name | Description
Dispose()
Releases all resources used by the DisplayMaterial
Dispose(Boolean)
Releases the unmanaged resources used by the DisplayMaterial and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
GetBitmapTexture
GetBumpTexture
 Gets the bump texture for this display material.
GetEnvironmentTexture
GetTransparencyTexture
SetBitmapTexture(String, Boolean)
SetBitmapTexture(Texture, Boolean)
SetBumpTexture(String, Boolean)
SetBumpTexture(Texture, Boolean)
SetEnvironmentTexture(String, Boolean)
SetEnvironmentTexture(Texture, Boolean)
SetTransparencyTexture(String, Boolean)
SetTransparencyTexture(Texture, Boolean)
Top
See Also
Reference
Rhino.Display Namespace