RhinoCommon SDK
StringTable.GetValue Method (Int32)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.StringTable.GetValue(System.Int32)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string GetValue(
	int i
)
Public Function GetValue (
	i As Integer
) As String
Parameters
i
Type: System.Int32
[Missing <param name="i"/> documentation for "M:Rhino.DocObjects.Tables.StringTable.GetValue(System.Int32)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.StringTable.GetValue(System.Int32)"]
See Also
Reference
StringTable Class
GetValue Overload
Rhino.DocObjects.Tables Namespace