RhinoCommon SDK
GetTransform.HaveTransform Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetTransform.HaveTransform"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool HaveTransform { get; set; }
Public Property HaveTransform As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace