RhinoCommon SDK
ObjectTable.Select Method (IEnumerable<ObjRef>)
Rhino for Mac 5.1
 Selects a collection of objects.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Select(
	IEnumerable<ObjRef> objRefs
)
Public Function Select (
	objRefs As IEnumerable(Of ObjRef)
) As Integer
Parameters
objRefs
Type: System.Collections.Generic.IEnumerable<ObjRef>
References to objects to select.
Return Value
Type: Int32
Number of objects successfully selected.
See Also
Reference
ObjectTable Class
Select Overload
Rhino.DocObjects.Tables Namespace