RhinoCommon SDK
ObjectTable.BoundingBoxVisible Property
Rhino for Mac 5.1
 Gets the boundingbox for all visible objects (normal and locked) in this document that exist in "model" space. This bounding box does not include hidden objects or any objects that exist in layout space.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox BoundingBoxVisible { get; }
Public ReadOnly Property BoundingBoxVisible As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace