RhinoCommon SDK
RhinoViewport.Dispose Method
Rhino for Mac 5.1
Overload List
Name | Description
Dispose()
Releases all resources used by the RhinoViewport
Dispose(Boolean)
Releases the unmanaged resources used by the RhinoViewport and optionally releases the managed resources
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace