RhinoCommon SDK
LayerTable.ActiveCount Property
Rhino for Mac 5.1
 Returns number of layers in the layer table, excluding deleted layers.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ActiveCount { get; }
Public ReadOnly Property ActiveCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace