RhinoCommon SDK
GroupTableEventType Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.GroupTableEventType"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum GroupTableEventType
Public Enumeration GroupTableEventType
Members
Member name | Value | Description
Added | 0
Deleted | 1
Undeleted | 2
Modified | 3
Sorted | 4
See Also
Reference
Rhino.DocObjects.Tables Namespace