RhinoCommon SDK
CustomDisplay.ClippingBox Property
Rhino for Mac 5.1
 Gets the clipping box of this CustomDisplay.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox ClippingBox { get; }
Public ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace