RhinoCommon SDK
PickContext.PickFrustumTest Method (PointCloud, Int32, Double, Double)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.PointCloud,System.Int32@,System.Double@,System.Double@)"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PickFrustumTest(
	PointCloud cloud,
	out int pointIndex,
	out double depth,
	out double distance
)
Public Function PickFrustumTest (
	cloud As PointCloud,
	<OutAttribute> ByRef pointIndex As Integer,
	<OutAttribute> ByRef depth As Double,
	<OutAttribute> ByRef distance As Double
) As Boolean
Parameters
cloud
Type: Rhino.Geometry.PointCloud
[Missing <param name="cloud"/> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.PointCloud,System.Int32@,System.Double@,System.Double@)"]
pointIndex
Type: System.Int32
[Missing <param name="pointIndex"/> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.PointCloud,System.Int32@,System.Double@,System.Double@)"]
depth
Type: System.Double
[Missing <param name="depth"/> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.PointCloud,System.Int32@,System.Double@,System.Double@)"]
distance
Type: System.Double
[Missing <param name="distance"/> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.PointCloud,System.Int32@,System.Double@,System.Double@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.PointCloud,System.Int32@,System.Double@,System.Double@)"]
See Also
Reference
PickContext Class
PickFrustumTest Overload
Rhino.Input.Custom Namespace