RhinoCommon SDK
Linetype Constructor
Rhino for Mac 5.1
Overload List
Name | Description
Linetype()
Initializes a new instance of the Linetype class
Linetype(SerializationInfo, StreamingContext)
Initializes a new instance of the Linetype class
Top
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace