RhinoCommon SDK
OptionInteger.InitialValue Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.OptionInteger.InitialValue"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int InitialValue { get; }
Public ReadOnly Property InitialValue As Integer
	Get
Property Value
Type: Int32
See Also
Reference
OptionInteger Class
Rhino.Input.Custom Namespace