RhinoCommon SDK
UserData.Write Method
Rhino for Mac 5.1
Writes the content of this data to a stream archive.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual bool Write(
	BinaryArchiveWriter archive
)
Protected Overridable Function Write (
	archive As BinaryArchiveWriter
) As Boolean
Parameters
archive
Type: Rhino.FileIO.BinaryArchiveWriter
An archive.
Return Value
Type: Boolean
true if the data was successfully written. The default implementation always returns false.
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace