RhinoCommon SDK
RhinoViewport.GetPickTransform Method (Int32, Int32)
Rhino for Mac 5.1
 Takes a rectangle in screen coordinates and returns a transformation that maps the 3d frustum defined by the rectangle to a -1/+1 clipping coordinate box. This takes a single point and inflates it by Rhino.ApplicationSettings.ModelAidSettings.MousePickBoxRadius to define the screen rectangle.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform GetPickTransform(
	int clientX,
	int clientY
)
Public Function GetPickTransform (
	clientX As Integer,
	clientY As Integer
) As Transform
Parameters
clientX
Type: System.Int32
The client point X coordinate.
clientY
Type: System.Int32
The client point Y coordinate.
Return Value
Type: Transform
A transformation matrix.
See Also
Reference
RhinoViewport Class
GetPickTransform Overload
Rhino.Display Namespace