RhinoCommon SDK
Linetype.IsModified Property
Rhino for Mac 5.1
 true if this linetype has been modified by LinetypeTable.ModifyLinetype() and the modifications can be undone.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsModified { get; }
Public ReadOnly Property IsModified As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace