RhinoCommon SDK
ObjectTable.Replace Method (ObjRef, Arc)
Rhino for Mac 5.1
Replaces one object with new curve object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	ObjRef objref,
	Arc arc
)
Public Function Replace (
	objref As ObjRef,
	arc As Arc
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
arc
Type: Rhino.Geometry.Arc
new arc to be added. The arc is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace