RhinoCommon SDK
ObjectTable.Replace Method (ObjRef, Point3d)
Rhino for Mac 5.1
Replaces one object with new point object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	ObjRef objref,
	Point3d point
)
Public Function Replace (
	objref As ObjRef,
	point As Point3d
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
point
Type: Rhino.Geometry.Point3d
new point to be added. The point is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace