RhinoCommon SDK
ObjectTable.Replace Method (ObjRef, Polyline)
Rhino for Mac 5.1
Replaces one object with new curve object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	ObjRef objref,
	Polyline polyline
)
Public Function Replace (
	objref As ObjRef,
	polyline As Polyline
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
polyline
Type: Rhino.Geometry.Polyline
new polyline to be added. The polyline is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace