RhinoCommon SDK
ObjectTable.Replace Method (ObjRef, Circle)
Rhino for Mac 5.1
Replaces one object with new curve object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	ObjRef objref,
	Circle circle
)
Public Function Replace (
	objref As ObjRef,
	circle As Circle
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
circle
Type: Rhino.Geometry.Circle
new circle to be added. The circle is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace