RhinoCommon SDK
ObjectTable.Replace Method (ObjRef, Line)
Rhino for Mac 5.1
Replaces one object with new line curve object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	ObjRef objref,
	Line line
)
Public Function Replace (
	objref As ObjRef,
	line As Line
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
line
Type: Rhino.Geometry.Line
new line to be added. The line is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace