RhinoCommon SDK
ColorCMYK Methods
Rhino for Mac 5.1
The ColorCMYK type exposes the following members.
Methods
Name | Description
CreateFromHSL
 Constructs the nearest CMYK equivalent of an HSL color.
CreateFromLAB
 Constructs the nearest CMYK equivalent of a LAB color.
CreateFromLCH
 Constructs the nearest CMYK equivalent of a LCH color.
CreateFromXYZ
 Constructs the nearest CMYK equivalent of an XYZ color.
Top
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace