RhinoCommon SDK
Point3d.Multiply Operator
Rhino for Mac 5.1
Overload List
Name | Description
Multiply(Double, Point3d)
 Multiplies a Point3d by a number.
Multiply(Point3d, Double)
 Multiplies a Point3d by a number.
Top
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace