RhinoCommon SDK
Surface.ToNurbsSurface Method
Rhino for Mac 5.1
 Gets a NURBS surface representation of this surface. Default tolerance of 0.0 is used.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsSurface ToNurbsSurface()
Public Function ToNurbsSurface As NurbsSurface
Return Value
Type: NurbsSurface
NurbsSurface on success, null on failure.
See Also
Reference
Surface Class
ToNurbsSurface Overload
Rhino.Geometry Namespace