RhinoCommon SDK
Curve.DivideByCount Method (Int32, Boolean, Point3d[])
Rhino for Mac 5.1
 Divide the curve into a number of equal-length segments.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double[] DivideByCount(
	int segmentCount,
	bool includeEnds,
	out Point3d[] points
)
Public Function DivideByCount (
	segmentCount As Integer,
	includeEnds As Boolean,
	<OutAttribute> ByRef points As Point3d()
) As Double()
Parameters
segmentCount
Type: System.Int32
Segment count. Note that the number of division points may differ from the segment count.
includeEnds
Type: System.Boolean
If true, then the points at the start and end of the curve are included.
points
Type: Rhino.Geometry.Point3d[]
A list of division points. If the function returns successfully, this point-array will be filled in.
Return Value
Type: Double[]
Array containing division curve parameters on success, null on failure.
See Also
Reference
Curve Class
DivideByCount Overload
Rhino.Geometry Namespace