RhinoCommon SDK
LinearDimension.Arrowhead2End Property
Rhino for Mac 5.1
 Gets the arrow head end of the second extension line.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2d Arrowhead2End { get; }
Public ReadOnly Property Arrowhead2End As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace