RhinoCommon SDK
CustomObjectGrips Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.CustomObjectGrips"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Custom.CustomObjectGrips
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class CustomObjectGrips : IDisposable
Public MustInherit Class CustomObjectGrips
	Implements IDisposable
The CustomObjectGrips type exposes the following members.
Constructors
Name | Description
CustomObjectGrips
Initializes a new instance of the CustomObjectGrips class
Top
Properties
Name | Description
GripCount
GripsMoved
 If GripsMoved is true if some of the grips have ever been moved GripObject.NewLocation() sets GripsMoved=true.
NewLocation
 true if some of the grips have been moved. GripObject.NewLocation() sets NewLocation=true. Derived classes can set NewLocation to false after updating temporary display information.
OwnerObject
Owner of the grips.
Top
Methods
Name | Description
AddGrip
Dispose()
Releases all resources used by the CustomObjectGrips
Dispose(Boolean)
Releases the unmanaged resources used by the CustomObjectGrips and optionally releases the managed resources
Dragging
 Determines if grips are currently being dragged.
Finalize |  (Overrides Object.Finalize().)
Grip
NeighborGrip
Get neighbors.
NewGeometry
 If the grips control just one object, then override NewGeometry(). When NewGeometry() is called, return new geometry calculated from the current grip locations. This happens once at the end of a grip drag.
NurbsSurface
 If the grips control a NURBS surface, this returns a pointer to that surface. You can look at but you must NEVER change this surface.
NurbsSurfaceGrip
 If the grips are control points of a NURBS surface, then this gets the index of the grip that controls the (i,j)-th cv.
OnDraw
 Draws the grips. In your implementation, override this if you need to draw dynamic elements and then call this base implementation to draw the grips themselves.
OnReset
 Resets location of all grips to original spots and cleans up stuff that was created by dynamic dragging. This is required when dragging is canceled or in the Copy command when grips are "copied". The override should clean up dynamic workspace stuff.
OnResetMeshes
 Just before Rhino turns off object grips, it calls this function. If grips have modified any display meshes, they must override this function and restore the meshes to their original states.
OnUpdateMesh
 Just before Rhino shades an object with grips on, it calls this method to update the display meshes. Grips that modify surface or mesh objects must override this function and modify the display meshes here.
RegisterGripsEnabler
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace