RhinoCommon SDK
CustomObjectGrips.Dragging Method
Rhino for Mac 5.1
 Determines if grips are currently being dragged.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool Dragging()
Public Shared Function Dragging As Boolean
Return Value
Type: Boolean
true if grips are dragged.
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace