RhinoCommon SDK
ClassArrayString Class
Rhino for Mac 5.1
 Wrapper for a C++ ON_ClassArray<ON_wString> If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.ClassArrayString
Namespace: Rhino.Runtime.InteropWrappers
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class ClassArrayString : IDisposable
Public Class ClassArrayString
	Implements IDisposable
The ClassArrayString type exposes the following members.
Constructors
Name | Description
ClassArrayString
 Initializes a new ClassArrayString instance.
Top
Properties
Name | Description
Count
 Gets the number of strings in this array.
Top
Methods
Name | Description
Add
 Adds a string to the list.
ConstPointer
Gets the const (immutable) pointer of this array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
Releases the unmanaged resources used by the ClassArrayString and optionally releases the managed resources
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
Gets the non-const pointer (for modification) of this array.
ToArray
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace