RhinoCommon SDK
Vector3d.Addition Operator
Rhino for Mac 5.1
 Sums up two vectors.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Vector3d operator +(
	Vector3d vector1,
	Vector3d vector2
)
Public Shared Operator + (
	vector1 As Vector3d,
	vector2 As Vector3d
) As Vector3d
Parameters
vector1
Type: Rhino.Geometry.Vector3d
A vector.
vector2
Type: Rhino.Geometry.Vector3d
A second vector.
Return Value
Type: Vector3d
A new vector that results from the componentwise addition of the two vectors.
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace