RhinoCommon SDK
InstanceDefinitionTable.MakeSourcePathRelative Method
Rhino for Mac 5.1
 Marks the source path for a linked instance definition as relative or absolute.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MakeSourcePathRelative(
	InstanceDefinition idef,
	bool relative,
	bool quiet
)
Public Function MakeSourcePathRelative (
	idef As InstanceDefinition,
	relative As Boolean,
	quiet As Boolean
) As Boolean
Parameters
idef
Type: Rhino.DocObjects.InstanceDefinition
The instance definition to be marked.
relative
Type: System.Boolean
If true, the path should be considered as relative.
If false, the path should be considered as absolute.
quiet
Type: System.Boolean
If true, then message boxes about erroneous parameters will not be shown.
Return Value
Type: Boolean
 true if the instance defintion could be modified.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace