RhinoCommon SDK
MaterialRefs.ContainsKey Method
Rhino for Mac 5.1
 Determines whether this dictionary contains an MaterialRef with the specified plug-in id.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ContainsKey(
	Guid key
)
Public Function ContainsKey (
	key As Guid
) As Boolean
Parameters
key
Type: System.Guid
 The plug-in Id used to locate a MaterialRef in this dictionary.
Return Value
Type: Boolean
 true if this dictionary contains an element with the specified plug-in Id; otherwise, false.
Implements
IDictionary<TKey, TValue>.ContainsKey(TKey)
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace