RhinoCommon SDK
PointCloud.ClearColors Method
Rhino for Mac 5.1
 Destroys the color information in this point cloud.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void ClearColors()
Public Sub ClearColors
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace