RhinoCommon SDK
File3dm.Settings Property
Rhino for Mac 5.1
 Settings include tolerance, and unit system, and defaults used for creating views and objects.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public File3dmSettings Settings { get; }
Public ReadOnly Property Settings As File3dmSettings
	Get
Property Value
Type: File3dmSettings
See Also
Reference
File3dm Class
Rhino.FileIO Namespace