RhinoCommon SDK
RhinoObject.OnDeleteFromDocument Method
Rhino for Mac 5.1
 This call informs an object it is about to be deleted. Some objects, like clipping planes, need to do a little extra cleanup before they are deleted.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnDeleteFromDocument(
	RhinoDoc doc
)
Protected Overridable Sub OnDeleteFromDocument (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.DocObjects.RhinoObject.OnDeleteFromDocument(Rhino.RhinoDoc)"]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace