RhinoCommon SDK
LinearDimensionObject Class
Rhino for Mac 5.1
 Represents a LinearDimension that is placed in a document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.AnnotationObjectBase
 Rhino.DocObjects.LinearDimensionObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class LinearDimensionObject : AnnotationObjectBase
Public Class LinearDimensionObject
	Inherits AnnotationObjectBase
The LinearDimensionObject type exposes the following members.
Properties
Name | Description
DimensionStyle
 Gets the DimensionStyle associated with this LinearDimensionObject.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace