RhinoCommon SDK
ColorXYZ Structure
Rhino for Mac 5.1
 Represents an XYZ (Hue, Saturation, Luminance) color with double precision floating point channels. XYZ colors are based on the CIE 1931 XYZ color space standard and they mimic the natural sensitivity of cones in the human retina.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct ColorXYZ
<SerializableAttribute>
Public Structure ColorXYZ
The ColorXYZ type exposes the following members.
Constructors
Name | Description
ColorXYZ(Color)
 Constructs a new instance of ColorXYZ that is equivalent to an RGB color.
ColorXYZ(Double, Double, Double)
 Constructs a new instance of ColorXYZ with custom channel values.
ColorXYZ(Double, Double, Double, Double)
 Constructs a new instance of ColorXYZ with custom channel values.
Top
Properties
Name | Description
A
 Gets or set the Alpha channel value. Channel will be limited to 0~1.
X
 Gets or set the X channel value. Channel will be limited to 0~1.
Y
 Gets or set the Y channel value. Channel will be limited to 0~1.
Z
 Gets or set the Z channel value. Channel will be limited to 0~1.
Top
Methods
Name | Description
CreateFromCMYK
 Create the nearest XYZ equivalent of a CMYK color.
CreateFromHSL
 Create the nearest XYZ equivalent of an HSL color.
CreateFromLAB
 Create the nearest XYZ equivalent of a Lab color.
CreateFromLCH
 Create the nearest XYZ equivalent of an LCH color.
Top
Operators
Name | Description
Implicit(ColorXYZ to Color)
 Implicitly converts a XYZ color into a .Net library color.
Top
See Also
Reference
Rhino.Display Namespace