RhinoCommon SDK
DisplayPipeline.DrawBoxCorners Method (BoundingBox, Color, Double)
Rhino for Mac 5.1
 Draws corner widgets of a world aligned boundingbox.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawBoxCorners(
	BoundingBox box,
	Color color,
	double size
)
Public Sub DrawBoxCorners (
	box As BoundingBox,
	color As Color,
	size As Double
)
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to draw.
color
Type: System.Drawing.Color
Color to draw with.
size
Type: System.Double
Size (in model units) of the corner widgets.
See Also
Reference
DisplayPipeline Class
DrawBoxCorners Overload
Rhino.Display Namespace