RhinoCommon SDK
BrepFaceList.SplitKinkyFaces Method (Double, Boolean)
Rhino for Mac 5.1
 Splits any faces with creases into G1 pieces.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SplitKinkyFaces(
	double kinkTolerance,
	bool compact
)
Public Function SplitKinkyFaces (
	kinkTolerance As Double,
	compact As Boolean
) As Boolean
Parameters
kinkTolerance
Type: System.Double
Tolerance (in radians) to use for crease detection.
compact
Type: System.Boolean
If true, the Brep will be compacted if possible.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
If you need to detect whether splitting occured, compare the before and after values of Faces.Count
See Also
Reference
BrepFaceList Class
SplitKinkyFaces Overload
Rhino.Geometry.Collections Namespace