RhinoCommon SDK
Color4f Constructor (Color4f)
Rhino for Mac 5.1
Initializes a new instance of the Color4f class
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color4f(
	Color4f color
)
Public Sub New (
	color As Color4f
)
Parameters
color
Type: Rhino.Display.Color4f
[Missing <param name="color"/> documentation for "M:Rhino.Display.Color4f.#ctor(Rhino.Display.Color4f)"]
See Also
Reference
Color4f Structure
Color4f Overload
Rhino.Display Namespace