RhinoCommon SDK
RadialDimension Properties
Rhino for Mac 5.1
The RadialDimension type exposes the following members.
Properties
Name | Description
IsDiameterDimension
 Gets a value indicating whether the value refers to the diameter, rather than the radius.
Top
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace