RhinoCommon SDK
NurbsSurface Class
Rhino for Mac 5.1
 Represents a Non Uniform Rational B-Splines (NURBS) surface.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.NurbsSurface
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class NurbsSurface : Surface,
	IEpsilonComparable<NurbsSurface>
<SerializableAttribute>
Public Class NurbsSurface
	Inherits Surface
	Implements IEpsilonComparable(Of NurbsSurface)
The NurbsSurface type exposes the following members.
Constructors
Name | Description
NurbsSurface(NurbsSurface)
 Initializes a new NURBS surface by copying the values from another surface.
NurbsSurface(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
IsRational
 Gets a value indicating whether or not the nurbs surface is rational.
KnotsU
 The U direction knot vector.
KnotsV
 The V direction knot vector.
OrderU
 Gets the order in the U direction.
OrderV
 Gets the order in the V direction.
Points
 Gets a collection of surface control points that form this surface.
Top
Methods
Name | Description
CopyFrom
 Copies this NURBS surface from another NURBS surface.
Create
 Constructs a new NURBS surface with internal uninitialized arrays.
CreateFromCone
 Constructs a new NURBS surfaces from cone data.
CreateFromCorners(Point3d, Point3d, Point3d)
 Makes a surface from 3 corner points.
CreateFromCorners(Point3d, Point3d, Point3d, Point3d)
 Makes a surface from 4 corner points.
This is the same as calling CreateFromCorners(Point3d, Point3d, Point3d, Point3d, Double) with tolerance 0.
CreateFromCorners(Point3d, Point3d, Point3d, Point3d, Double)
 Makes a surface from 4 corner points.
CreateFromCylinder
 Constructs a new NURBS surfaces from cylinder data.
CreateFromPoints
 Constructs a NURBS surface from a 2D grid of control points.
CreateFromSphere
 Constructs a new NURBS surfaces from sphere data.
CreateFromTorus
 Constructs a new NURBS surfaces from torus data.
CreateNetworkSurface(IEnumerable<Curve>, Int32, Double, Double, Double, Int32)
 Builds a surface from an autosorted network of curves/edges.
CreateNetworkSurface(IEnumerable<Curve>, Int32, Int32, IEnumerable<Curve>, Int32, Int32, Double, Double, Double, Int32)
 Builds a surface from an ordered network of curves/edges.
CreateRailRevolvedSurface
 Constructs a railed Surface-of-Revolution.
CreateRuledSurface
 Constructs a ruled surface between two curves. Curves must share the same knot-vector.
CreateThroughPoints
 Constructs a NURBS surface from a 2D grid of points.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
IncreaseDegreeU
 Increase the degree of this surface in U direction.
IncreaseDegreeV
 Increase the degree of this surface in V direction.
MakeNonRational
 Makes this surface non-rational.
MakeRational
 Makes this surface rational.
Top
See Also
Reference
Rhino.Geometry Namespace