RhinoCommon SDK
DisplayPipeline.DrawSprite Method
Rhino for Mac 5.1
Overload List
Name | Description
DrawSprite(DisplayBitmap, Point2d, Single)
DrawSprite(DisplayBitmap, Point2d, Single, Color)
DrawSprite(DisplayBitmap, Point3d, Single, Boolean)
DrawSprite(DisplayBitmap, Point3d, Single, Color, Boolean)
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace