RhinoCommon SDK
Curve.PlanarClosedCurveRelationship Method
Rhino for Mac 5.1
 Determines whether two coplanar simple closed curves are disjoint or intersect; otherwise, if the regions have a containment relationship, discovers which curve encloses the other.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static RegionContainment PlanarClosedCurveRelationship(
	Curve curveA,
	Curve curveB,
	Plane testPlane,
	double tolerance
)
Public Shared Function PlanarClosedCurveRelationship (
	curveA As Curve,
	curveB As Curve,
	testPlane As Plane,
	tolerance As Double
) As RegionContainment
Parameters
curveA
Type: Rhino.Geometry.Curve
A first curve.
curveB
Type: Rhino.Geometry.Curve
A second curve.
testPlane
Type: Rhino.Geometry.Plane
A plane.
tolerance
Type: System.Double
A tolerance value.
Return Value
Type: RegionContainment
 A value indicating the relationship between the first and the second curve.
See Also
Reference
Curve Class
Rhino.Geometry Namespace