RhinoCommon SDK
CustomDisplay.AddLine Method (Line)
Rhino for Mac 5.1
 Adds a new, black line to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddLine(
	Line line
)
Public Sub AddLine (
	line As Line
)
Parameters
line
Type: Rhino.Geometry.Line
Line to add.
See Also
Reference
CustomDisplay Class
AddLine Overload
Rhino.Display Namespace