RhinoCommon SDK
Line.GetHashCode Method
Rhino for Mac 5.1
 Computes a hash number that represents this line.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A number that is not unique to the value of this line.
See Also
Reference
Line Structure
Rhino.Geometry Namespace