RhinoCommon SDK
Panels.Show Event
Rhino for Mac 5.1
 This event is called when a panel is opened or closed
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<ShowPanelEventArgs> Show
Public Shared Event Show As EventHandler(Of ShowPanelEventArgs)
Value
Type: System.EventHandler<ShowPanelEventArgs>
See Also
Reference
Panels Class
Rhino.UI Namespace