RhinoCommon SDK
Ellipse.Radius2 Property
Rhino for Mac 5.1
 Gets or sets the radius of the ellipse along the base plane Y semiaxis.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Radius2 { get; set; }
Public Property Radius2 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace