RhinoCommon SDK
GetPoint.PermitTabMode Method
Rhino for Mac 5.1
 Permits the use of the tab key to define a line constraint.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PermitTabMode(
	bool permit
)
Public Sub PermitTabMode (
	permit As Boolean
)
Parameters
permit
Type: System.Boolean
If true, then the built-in tab key mode is available.
Remarks
By default, use of the tab key is supported.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace