RhinoCommon SDK
ViewTable.GetStandardRhinoViews Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ViewTable.GetStandardRhinoViews"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoView[] GetStandardRhinoViews()
Public Function GetStandardRhinoViews As RhinoView()
Return Value
Type: RhinoView[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ViewTable.GetStandardRhinoViews"]
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace