RhinoCommon SDK
CustomCurveObject Constructor (Curve)
Rhino for Mac 5.1
Initializes a new instance of the CustomCurveObject class
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected CustomCurveObject(
	Curve curve
)
Protected Sub New (
	curve As Curve
)
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.DocObjects.Custom.CustomCurveObject.#ctor(Rhino.Geometry.Curve)"]
See Also
Reference
CustomCurveObject Class
CustomCurveObject Overload
Rhino.DocObjects.Custom Namespace