RhinoCommon SDK
PickContext.PickFrustumTest Method (NurbsCurve, Double, Double, Double)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.NurbsCurve,System.Double@,System.Double@,System.Double@)"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PickFrustumTest(
	NurbsCurve curve,
	out double t,
	out double depth,
	out double distance
)
Public Function PickFrustumTest (
	curve As NurbsCurve,
	<OutAttribute> ByRef t As Double,
	<OutAttribute> ByRef depth As Double,
	<OutAttribute> ByRef distance As Double
) As Boolean
Parameters
curve
Type: Rhino.Geometry.NurbsCurve
[Missing <param name="curve"/> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.NurbsCurve,System.Double@,System.Double@,System.Double@)"]
t
Type: System.Double
[Missing <param name="t"/> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.NurbsCurve,System.Double@,System.Double@,System.Double@)"]
depth
Type: System.Double
[Missing <param name="depth"/> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.NurbsCurve,System.Double@,System.Double@,System.Double@)"]
distance
Type: System.Double
[Missing <param name="distance"/> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.NurbsCurve,System.Double@,System.Double@,System.Double@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.NurbsCurve,System.Double@,System.Double@,System.Double@)"]
See Also
Reference
PickContext Class
PickFrustumTest Overload
Rhino.Input.Custom Namespace