RhinoCommon SDK
Quaternion.Division Operator
Rhino for Mac 5.1
 Divides all quaternion coefficients by a factor and returns a new quaternion with the result.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Quaternion operator /(
	Quaternion q,
	double y
)
Public Shared Operator / (
	q As Quaternion,
	y As Double
) As Quaternion
Parameters
q
Type: Rhino.Geometry.Quaternion
A quaternion.
y
Type: System.Double
A number.
Return Value
Type: Quaternion
A new quaternion.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace