RhinoCommon SDK
NurbsSurfacePointList.GetControlPoint Method
Rhino for Mac 5.1
 Gets the control point at the given (u, v) index.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ControlPoint GetControlPoint(
	int u,
	int v
)
Public Function GetControlPoint (
	u As Integer,
	v As Integer
) As ControlPoint
Parameters
u
Type: System.Int32
Index of control-point along surface U direction.
v
Type: System.Int32
Index of control-point along surface V direction.
Return Value
Type: ControlPoint
The control point at the given (u, v) index.
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace