RhinoCommon SDK
ClippingPlaneObject Class
Rhino for Mac 5.1
 Represents the object of a clipping plane, stored in the Rhino document and with attributes.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.ClippingPlaneObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class ClippingPlaneObject : RhinoObject
Public Class ClippingPlaneObject
	Inherits RhinoObject
The ClippingPlaneObject type exposes the following members.
Properties
Name | Description
ClippingPlaneGeometry
 Gets the clipping plane surface.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace