RhinoCommon SDK
DisplayPipeline Class
Rhino for Mac 5.1
 The display pipeline calls events during specific phases of drawing During the drawing of a single frame the events are called in the following order.
 [Begin Drawing of a Frame]
CalculateBoundingBox
CalculateClippingPanes
SetupFrustum
SetupLighting
InitializeFrameBuffer
DrawBackground
If this is a layout and detail objects exist the channels are called in the same order for each detail object (drawn as a nested viewport)
PreDrawObjects
For Each Visible Non Highlighted Object
PostDrawObjects - depth writing/testing on
DrawForeGround - depth writing/testing off
For Each Visible Highlighted Object
PostProcessFrameBuffer (If a delegate exists that requires this)
DrawOverlay (if Rhino is in a feedback mode)
 [End of Drawing of a Frame]
NOTE: There may be multiple DrawObject calls for a single object. An example of when this could happen would be with a shaded sphere. The shaded mesh is first drawn and these channels would be processed; then at a later time the isocurves for the sphere would be drawn.
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayPipeline
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class DisplayPipeline
Public NotInheritable Class DisplayPipeline
The DisplayPipeline type exposes the following members.
Properties
Name | Description
DefaultCurveThickness
 Gets the curve thickness as defined by the current display mode. Note: this only applies to curve objects, Brep and Mesh wires may have different settings.
DepthMode
DisplayPipelineAttributes
DrawingGrips
 Gets a value that indicates whether the pipeline is currently in a grip drawing operation.
DrawingSurfaces
 Gets a value that indicates whether the pipeline is currently in a surface drawing operation. Surface drawing means draw the shaded triangles of a mesh representing the surface (mesh, extrusion, or brep). This is useful when inside of a draw event or display conduit to check and see if the geometry is about to be drawn as a shaded set of triangles representing the geometry. See DrawingWires to check and see if the wireframe representation of the geometry is going to be drawn.
DrawingWires
 Gets a value that indicates whether the pipeline is currently in a curve drawing operation. This is useful when inside of a draw event or display conduit to check and see if the geometry is about to be drawn is going to be drawing the wire representation of the geometry (mesh, extrusion, or brep). See DrawingSurfaces to check and see if the shaded mesh representation of the geometry is going to be drawn.
FrameSize
 Gets the size of the framebuffer that this pipeline is drawing to.
IsDynamicDisplay
 Gets a value that indicates whether the viewport is in Dynamic Display state. Dynamic display is the state a viewport is in when it is rapidly redrawing because of an operation like panning or rotating. The pipeline will drop some level of detail while inside a dynamic display state to keep the frame rate as high as possible.
IsOpenGL
 Gets a value indicating whether or not this pipeline is drawing into an OpenGL context.
IsPrinting
 Gets a value that indicates whether this pipeline is currently drawing for printing purposes.
IsStereoMode
 Gets a value that indicates whether this pipeline is currently using an engine that is performing stereo style drawing. Stereo drawing is for providing an "enhanced 3-D" effect through stereo viewing devices.
ModelTransform
 Gets or sets the current model transformation that is applied to vertices when drawing.
ModelTransformIsIdentity
 Gets a value that indicates whether the Model Transform is an Identity transformation.
NestLevel
 Gets the current nested viewport drawing level. This is used to know if you are currently inside the drawing of a nested viewport (detail object in Rhino).
Nest level = 0 Drawing is occuring in a standard Rhino viewport or on the page viewport.
Nest level = 1 Drawing is occuring inside a detail view object.
RenderPass
 Gets the current pass that the pipeline is in for drawing a frame. Typically drawing a frame requires a single pass through the DrawFrameBuffer function, but some special display effects can be achieved through drawing with multiple passes.
ShadingRequired
 Gets or sets the "ShadingRequired" flag. This flag gets set inside the pipeline when a request is made to draw a shaded mesh but the current render engine doesn't support shaded mesh drawing...at this point the redraw mechanism will make sure everything will work the next time around.
StereoProjection
 Gets the current stereo projection if stereo mode is on.
0 = left
1 = right
 If stereo mode is not enables, this property always returns 0.
SupportsShading
 Gets whether or not this pipeline supports shaded meshes.
Viewport
ZBiasMode
Top
Methods
Name | Description
CullControlPolygon
 Returns a value indicating if only points on the side of the surface that face the camera are displayed.
Draw2dRectangle
Draw2dText(String, Color, Point2d, Boolean)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point3d, Boolean)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point2d, Boolean, Int32)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point3d, Boolean, Int32)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point2d, Boolean, Int32, String)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point3d, Boolean, Int32, String)
 Draws 2D text on the viewport.
Draw3dText(Text3d, Color)
Draw3dText(Text3d, Color, Plane)
 Draws 3d text with a different plane than what is defined in the Text3d class.
Draw3dText(Text3d, Color, Point3d)
 Draws 3d text using the Text3d plane with an adjusted origin.
Draw3dText(String, Color, Plane, Double, String)
DrawArc(Arc, Color)
 Draw a single arc object.
DrawArc(Arc, Color, Int32)
 Draw a single arc object.
DrawArrow(Line, Color)
 Draws a single arrow object. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
DrawArrow(Line, Color, Double, Double)
 Draws a single arrow object. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
DrawArrowHead
 Draws a single arrow head.
DrawArrows(Line[], Color)
 Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
DrawArrows(IEnumerable<Line>, Color)
 Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
DrawBitmap(DisplayBitmap, Int32, Int32)
 Draws a bitmap in screen coordinates
DrawBitmap(DisplayBitmap, Int32, Int32, Color)
 Draws a bitmap in screen coordinates
DrawBox(BoundingBox, Color)
 Draws the edges of a BoundingBox.
DrawBox(Box, Color)
 Draws the edges of a Box object.
DrawBox(BoundingBox, Color, Int32)
 Draws the edges of a BoundingBox.
DrawBox(Box, Color, Int32)
 Draws the edges of a Box object.
DrawBoxCorners(BoundingBox, Color)
 Draws corner widgets of a world aligned boundingbox. Widget size will be 5% of the Box diagonal.
DrawBoxCorners(BoundingBox, Color, Double)
 Draws corner widgets of a world aligned boundingbox.
DrawBoxCorners(BoundingBox, Color, Double, Int32)
 Draws corner widgets of a world aligned boundingbox.
DrawBrepShaded
 Draws a shaded mesh representation of a brep.
DrawBrepWires(Brep, Color)
 Draws all the wireframe curves of a brep object.
DrawBrepWires(Brep, Color, Int32)
 Draws all the wireframe curves of a brep object.
DrawCircle(Circle, Color)
 Draw a single circle object.
DrawCircle(Circle, Color, Int32)
 Draw a single circle object.
DrawCone(Cone, Color)
 Draw a wireframe cone.
DrawCone(Cone, Color, Int32)
 Draw a wireframe cone.
DrawConstructionPlane
DrawCurvatureGraph(Curve, Color)
 Draw a typical Rhino Curvature Graph.
DrawCurvatureGraph(Curve, Color, Int32)
 Draw a typical Rhino Curvature Graph.
DrawCurvatureGraph(Curve, Color, Int32, Int32, Int32)
 Draw a typical Rhino Curvature Graph.
DrawCurve(Curve, Color)
 Draw a single Curve object.
DrawCurve(Curve, Color, Int32)
 Draw a single Curve object.
DrawCylinder(Cylinder, Color)
 Draw a wireframe cylinder.
DrawCylinder(Cylinder, Color, Int32)
 Draw a wireframe cylinder.
DrawDirectionArrow
DrawDot(Point3d, String)
 Draws a text dot in world coordinates.
DrawDot(Int32, Int32, String)
 Draws a text dot in screen coordinates.
DrawDot(Point3d, String, Color, Color)
 Draw a text dot in world coordinates.
DrawDot(Int32, Int32, String, Color, Color)
 Draws a text dot in screen coordinates.
DrawDottedLine(Line, Color)
 Draws a single dotted line.
DrawDottedLine(Point3d, Point3d, Color)
 Draws a single dotted line.
DrawDottedPolyline
 Draws a set of connected lines (polyline) in a dotted pattern.
DrawLine(Line, Color)
 Draws a single line object.
DrawLine(Line, Color, Int32)
 Draws a single line object.
DrawLine(Point3d, Point3d, Color)
 Draws a single line object.
DrawLine(Point3d, Point3d, Color, Int32)
 Draws a single line object.
DrawLineArrow
 Draws an arrow made up of three line segments.
DrawLines(IEnumerable<Line>, Color)
 Draws a set of lines with a given color and thickness. If you want the fastest possible set of lines to be drawn, pass a Line[] for lines.
DrawLines(IEnumerable<Line>, Color, Int32)
 Draws a set of lines with a given color and thickness. If you want the fastest possible set of lines to be drawn, pass a Line[] for lines.
DrawMarker(Point3d, Vector3d, Color)
 Draws an arrow marker as a view-aligned widget.
DrawMarker(Point3d, Vector3d, Color, Int32)
 Draws an arrow marker as a view-aligned widget.
DrawMarker(Point3d, Vector3d, Color, Int32, Double)
 Draws an arrow marker as a view-aligned widget.
DrawMarker(Point3d, Vector3d, Color, Int32, Double, Double)
 Draws an arrow marker as a view-aligned widget.
DrawMeshFalseColors
 Draws the mesh faces as false color patches. The mesh must have Vertex Colors defined for this to work.
DrawMeshShaded(Mesh, DisplayMaterial)
 Draws the shaded faces of a given mesh.
DrawMeshShaded(Mesh, DisplayMaterial, Int32[])
 Draws the shaded faces of a given mesh.
DrawMeshVertices
 Draws all the vertices in a given mesh.
DrawMeshWires(Mesh, Color)
 Draws all the wires in a given mesh.
DrawMeshWires(Mesh, Color, Int32)
 Draws all the wires in a given mesh.
DrawObject(RhinoObject)
DrawObject(RhinoObject, Transform)
 Draws a RhinoObject with an applied transformation.
DrawParticles(ParticleSystem)
DrawParticles(ParticleSystem, DisplayBitmap)
DrawParticles(ParticleSystem, DisplayBitmap[])
DrawPoint(Point3d, Color)
Draws a point with a given radius, style and color.
DrawPoint(Point3d, PointStyle, Int32, Color)
Draws a point with a given radius, style and color.
DrawPointCloud(PointCloud, Int32)
 Draws a point cloud.
DrawPointCloud(PointCloud, Int32, Color)
 Draws a point cloud.
DrawPoints
Draw a set of points with a given radius, style and color.
DrawPolygon
 Draws a filled polygon.
DrawPolyline(IEnumerable<Point3d>, Color)
 Draws a single Polyline object.
DrawPolyline(IEnumerable<Point3d>, Color, Int32)
 Draws a single Polyline object.
DrawSphere(Sphere, Color)
 Draw a wireframe sphere.
DrawSphere(Sphere, Color, Int32)
 Draw a wireframe sphere.
DrawSprite(DisplayBitmap, Point2d, Single)
DrawSprite(DisplayBitmap, Point2d, Single, Color)
DrawSprite(DisplayBitmap, Point3d, Single, Boolean)
DrawSprite(DisplayBitmap, Point3d, Single, Color, Boolean)
DrawSprites(DisplayBitmap, DisplayBitmapDrawList, Single, Boolean)
DrawSprites(DisplayBitmap, DisplayBitmapDrawList, Single, Vector3d, Boolean)
DrawSurface
 Draw wireframe display for a single surface.
DrawToBitmap
 Draw a given viewport to an off-screen bitmap.
DrawTorus(Torus, Color)
 Draw a wireframe torus.
DrawTorus(Torus, Color, Int32)
 Draw a wireframe torus.
EnableClippingPlanes
 Enable or disable the Clipping Plane logic of the engine.
EnableColorWriting
 Enable or disable the ColorWriting behaviour of the engine.
EnableDepthTesting
 Enable or disable the DepthTesting behaviour of the engine. When DepthTesting is disabled, objects in front will no longer occlude objects behind them.
EnableDepthWriting
 Enable or disable the DepthWriting behaviour of the engine. When DepthWriting is disabled, drawn geometry does not affect the Z-Buffer.
EnableLighting
 Enable or disable the Lighting logic of the engine.
InterruptDrawing
 Tests to see if the pipeline should stop drawing more geometry and just show what it has so far. If a drawing operation is taking a long time, this function will return true and tell Rhino it should just finish up and show the frame buffer. This is used in dynamic drawing operations.
IsActive
 Determines if an object can be visible in this viewport based on it's object type and display attributes. This test does not check for visibility based on location of the object. NOTE: Use CRhinoDisplayPipeline::IsVisible() to perform "visibility" tests based on location (is some part of the object in the view frustum). Use CRhinoDisplayPipeline::IsActive() to perform "visibility" tests based on object type.
IsVisible(BoundingBox)
 Test a given box for visibility inside the view frustum under the current viewport and model transformation settings.
IsVisible(Point3d)
 Test a given 3d world coordinate point for visibility inside the view frustum under the current viewport and model transformation settings.
IsVisible(RhinoObject)
 Test a given object for visibility inside the view frustum under the current viewport and model transformation settings. This function calls a virtual IsVisibleFinal function that subclassed pipelines can add extra tests to. In the base class, this test only tests visibility based on the objects world coordinates location and does not pay attention to the object's attributes. NOTE: Use CRhinoDisplayPipeline::IsVisible() to perform "visibility" tests based on location (is some part of the object in the view frustum). Use CRhinoDisplayPipeline::IsActive() to perform "visibility" tests based on object type.
Measure2dText
 Determines screen rectangle that would be drawn to using the Draw2dText(..) function with the same parameters.
PopClipTesting
 Pop a ClipTesting flag off the engine's stack.
PopCullFaceMode
 Pop a FaceCull flag off the engine's stack.
PopDepthTesting
 Pop a DepthTesting flag off the engine's stack.
PopDepthWriting
 Pop a DepthWriting flag off the engine's stack.
PopModelTransform
 Pop a model transformation off the engine's model transform stack.
PushClipTesting
 Push a ClipTesting flag on the engine's stack.
PushCullFaceMode
 Push a FaceCull flag on the engine's stack.
PushDepthTesting
 Push a DepthTesting flag on the engine's stack.
PushDepthWriting
 Push a DepthWriting flag on the engine's stack.
PushModelTransform
 Push a model transformation on the engine's model transform stack.
Top
Events
Name | Description
CalculateBoundingBox
CalculateBoundingBoxZoomExtents
 Calculate a bounding to include in the Zoom Extents command.
DrawForeground
 Called after all non-highlighted objects have been drawn and PostDrawObjects has been called. Depth writing and testing are turned OFF. If you want to draw with depth writing/testing, see PostDrawObjects.
DrawOverlay
 If Rhino is in a feedback mode, the draw overlay call allows for temporary geometry to be drawn on top of everything in the scene. This is similar to the dynamic draw routine that occurs with custom get point.
ObjectCulling
PostDrawObjects
 Called after all non-highlighted objects have been drawn. Depth writing and testing are still turned on. If you want to draw without depth writing/testing, see DrawForeground.
PreDrawObject
 Called right before an individual object is being drawn. NOTE: Do not use this event unless you absolutely need to. It is called for every object in the document and can slow disply down if a large number of objects exist in the document
PreDrawObjects
 Called before objects are been drawn. Depth writing and testing are on.
Top
See Also
Reference
Rhino.Display Namespace