RhinoCommon SDK
RhinoObject.GetRenderMeshes Method
Rhino for Mac 5.1
 Gets the render meshes of some objects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ObjRef[] GetRenderMeshes(
	IEnumerable<RhinoObject> rhinoObjects,
	bool okToCreate,
	bool returnAllObjects
)
Public Shared Function GetRenderMeshes (
	rhinoObjects As IEnumerable(Of RhinoObject),
	okToCreate As Boolean,
	returnAllObjects As Boolean
) As ObjRef()
Parameters
rhinoObjects
Type: System.Collections.Generic.IEnumerable<RhinoObject>
An array, a list, or any enumerable set of Rhino objects.
okToCreate
Type: System.Boolean
true if the method is allowed to instantiate new meshes if they do not exist.
returnAllObjects
Type: System.Boolean
true if all objects should be returned.
Return Value
Type: ObjRef[]
An array of object references.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace