RhinoCommon SDK
File3dmPlugInDataTable Class
Rhino for Mac 5.1
 Table of custom data provided by plug-ins
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmPlugInDataTable
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class File3dmPlugInDataTable : IEnumerable<File3dmPlugInData>,
	IEnumerable
Public Class File3dmPlugInDataTable
	Implements IEnumerable(Of File3dmPlugInData), IEnumerable
The File3dmPlugInDataTable type exposes the following members.
Properties
Name | Description
Count
 Gets the number of File3dmPlugInData in this table.
Item
 Gets the File3dmPlugInData at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
Methods
Name | Description
Clear
 Remove all entries from this table
Dump
Prepares a text dump of table.
GetEnumerator
 Gets the enumerator that visits any File3dmPlugInData in this table.
Top
See Also
Reference
Rhino.FileIO Namespace