RhinoCommon SDK
InstanceDefinitionGeometry.Id Property
Rhino for Mac 5.1
 unique id for this instance definition
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace