RhinoCommon SDK
ViewportInfo.ViewScale Property
Rhino for Mac 5.1
 Applies scaling factors to parallel projection clipping coordinates by setting the m_clip_mod transformation. If you want to compress the view projection across the viewing plane, then set x = 0.5, y = 1.0, and z = 1.0.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public SizeF ViewScale { get; set; }
Public Property ViewScale As SizeF
	Get
	Set
Property Value
Type: SizeF
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace