RhinoCommon SDK
BrepEdge.EdgeIndex Property
Rhino for Mac 5.1
 Gets the index of this edge in the Brep.Edges collection.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int EdgeIndex { get; }
Public ReadOnly Property EdgeIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace