RhinoCommon SDK
GetLine.EnableFromBothSidesOption Method
Rhino for Mac 5.1
 If true, then the "BothSides" option shows up when the start point is inteactively picked.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableFromBothSidesOption(
	bool on
)
Public Sub EnableFromBothSidesOption (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Input.Custom.GetLine.EnableFromBothSidesOption(System.Boolean)"]
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace