RhinoCommon SDK
BinaryArchiveWriter.EnableCRCCalculation Method
Rhino for Mac 5.1
 Expert user function to control CRC calculation while reading and writing. Typically this is used when seeking around and reading/writing information in non-serial order.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool EnableCRCCalculation(
	bool enable
)
Public Function EnableCRCCalculation (
	enable As Boolean
) As Boolean
Parameters
enable
Type: System.Boolean
[Missing <param name="enable"/> documentation for "M:Rhino.FileIO.BinaryArchiveWriter.EnableCRCCalculation(System.Boolean)"]
Return Value
Type: Boolean
 Current state of CRC calculation. Use the returned value to restore the CRC calculation setting after you are finished doing your fancy pants expert IO.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace