RhinoCommon SDK
IsoStatus Enumeration
Rhino for Mac 5.1
 Defines enumerated values for isoparametric curve direction on a surface, such as X or Y, and curve sides, such as North or West boundary.
Note: odd values are all x-constant; even values > 0 are all y-constant.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum IsoStatus
Public Enumeration IsoStatus
Members
Member name | Value | Description
None | 0 |  curve is not an isoparameteric curve.
X | 1 |  curve is a "x" = constant (vertical) isoparametric curve in the interior of the surface's domain.
Y | 2 |  curve is a "y" = constant (horizontal) isoparametric curve in the interior of the surface's domain.
West | 3 |  curve is a "x" = constant isoparametric curve along the west side of the surface's domain.
South | 4 |  curve is a "y" = constant isoparametric curve along the south side of the surface's domain.
East | 5 |  curve is a "x" = constant isoparametric curve along the east side of the surface's domain.
North | 6 |  curve is a "y" = constant isoparametric curve along the north side of the surface's domain.
See Also
Reference
Rhino.Geometry Namespace