RhinoCommon SDK
GetPoint.DynamicDraw Event
Rhino for Mac 5.1
 Event to use if you want to dynamically draw things as the mouse/digitizer moves. Every time the mouse moves, DynamicDraw will be called once per viewport. The calls to DynamicDraw happen AFTER the call to MouseMove. If you are drawing anything that takes a long time, periodically call InterruptMouseMove() to see if you should stop.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public event EventHandler<GetPointDrawEventArgs> DynamicDraw
Public Event DynamicDraw As EventHandler(Of GetPointDrawEventArgs)
Value
Type: System.EventHandler<GetPointDrawEventArgs>
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace