RhinoCommon SDK
BinaryArchiveWriter.WriteIntArray Method
Rhino for Mac 5.1
 Writes a list, an array, or any enumerable of Int32 to the archive.
The return will always be an array.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteIntArray(
	IEnumerable<int> value
)
Public Sub WriteIntArray (
	value As IEnumerable(Of Integer)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<Int32>
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace