RhinoCommon SDK
ReplayHistoryResult.UpdateToLine Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToLine(
	Point3d from,
	Point3d to,
	ObjectAttributes attributes
)
Public Function UpdateToLine (
	from As Point3d,
	to As Point3d,
	attributes As ObjectAttributes
) As Boolean
Parameters
from
Type: Rhino.Geometry.Point3d
[Missing <param name="from"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)"]
to
Type: Rhino.Geometry.Point3d
[Missing <param name="to"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace