RhinoCommon SDK
Intersection.RayShoot Method
Rhino for Mac 5.1
 Computes point intersections that occur when shooting a ray to a collection of surfaces.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d[] RayShoot(
	Ray3d ray,
	IEnumerable<GeometryBase> geometry,
	int maxReflections
)
Public Shared Function RayShoot (
	ray As Ray3d,
	geometry As IEnumerable(Of GeometryBase),
	maxReflections As Integer
) As Point3d()
Parameters
ray
Type: Rhino.Geometry.Ray3d
A ray used in intersection.
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
Only Surface and Brep objects are currently supported. Trims are ignored on Breps.
maxReflections
Type: System.Int32
The maximum number of reflections. This value should be any value between 1 and 1000, inclusive.
Return Value
Type: Point3d[]
An array of points: one for each face that was passed by the faceIds out reference.
Exceptions
Exception | Condition
ArgumentNullException | geometry is null.
ArgumentOutOfRangeException | maxReflections is strictly outside the [1-1000] range.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace