RhinoCommon SDK
DisplayPipeline.DrawMarker Method (Point3d, Vector3d, Color, Int32)
Rhino for Mac 5.1
 Draws an arrow marker as a view-aligned widget.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawMarker(
	Point3d tip,
	Vector3d direction,
	Color color,
	int thickness
)
Public Sub DrawMarker (
	tip As Point3d,
	direction As Vector3d,
	color As Color,
	thickness As Integer
)
Parameters
tip
Type: Rhino.Geometry.Point3d
Location of arrow tip point.
direction
Type: Rhino.Geometry.Vector3d
Direction of arrow.
color
Type: System.Drawing.Color
Color of arrow widget.
thickness
Type: System.Int32
Thickness of arrow widget lines.
See Also
Reference
DisplayPipeline Class
DrawMarker Overload
Rhino.Display Namespace