RhinoCommon SDK
CurveProxy Properties
Rhino for Mac 5.1
The CurveProxy type exposes the following members.
Properties
Name | Description
ProxyCurveIsReversed
 True if "this" is a curve is reversed from the "real" curve geometry
Top
See Also
Reference
CurveProxy Class
Rhino.Geometry Namespace