RhinoCommon SDK
LightObject.LightGeometry Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.LightObject.LightGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Light LightGeometry { get; }
Public ReadOnly Property LightGeometry As Light
	Get
Property Value
Type: Light
See Also
Reference
LightObject Class
Rhino.DocObjects Namespace