RhinoCommon SDK
PolyCurve.SegmentIndex Method
Rhino for Mac 5.1
 Finds the segment used for evaluation at polycurve_parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int SegmentIndex(
	double polycurveParameter
)
Public Function SegmentIndex (
	polycurveParameter As Double
) As Integer
Parameters
polycurveParameter
Type: System.Double
Parameter on polycurve for segment lookup.
Return Value
Type: Int32
 Index of the segment used for evaluation at polycurve_parameter. If polycurve_parameter < Domain.Min(), then 0 is returned. If polycurve_parameter > Domain.Max(), then Count()-1 is returned.
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace