RhinoCommon SDK
BinaryArchiveWriter.Archive3dmVersion Property
Rhino for Mac 5.1
 If a 3dm archive is being read or written, then this is the version of the 3dm archive format (1, 2, 3, 4 or 5). 0 a 3dm archive is not being read/written 1 a version 1 3dm archive is being read/written 2 a version 2 3dm archive is being read/written 3 a version 3 3dm archive is being read/written 4 a version 4 3dm archive is being read/written 5 an old version 5 3dm archive is being read 50 a version 5 3dm archive is being read/written.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Archive3dmVersion { get; }
Public ReadOnly Property Archive3dmVersion As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace