RhinoCommon SDK
CustomDisplay.AddText Method (Text3d, Color)
Rhino for Mac 5.1
 Adds a new 3D text object to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddText(
	Text3d text,
	Color color
)
Public Sub AddText (
	text As Text3d,
	color As Color
)
Parameters
text
Type: Rhino.Display.Text3d
Text object to add.
color
Type: System.Drawing.Color
Color of text object.
See Also
Reference
CustomDisplay Class
AddText Overload
Rhino.Display Namespace