RhinoCommon SDK
RhinoViewport.ScreenToClient Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.ScreenToClient(System.Drawing.Point)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point ScreenToClient(
	Point screenPoint
)
Public Function ScreenToClient (
	screenPoint As Point
) As Point
Parameters
screenPoint
Type: System.Drawing.Point
[Missing <param name="screenPoint"/> documentation for "M:Rhino.Display.RhinoViewport.ScreenToClient(System.Drawing.Point)"]
Return Value
Type: Point
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.ScreenToClient(System.Drawing.Point)"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace