RhinoCommon SDK
BoundingBox Structure
Rhino for Mac 5.1
 Represents the value of two points in a bounding box defined by the two extreme corner points.
This box is therefore aligned to the world X, Y and Z axes.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct BoundingBox
<SerializableAttribute>
Public Structure BoundingBox
The BoundingBox type exposes the following members.
Constructors
Name | Description
BoundingBox(IEnumerable<Point3d>)
 Constructs a boundingbox from a collection of points.
BoundingBox(Point3d, Point3d)
 Constructs a new boundingbox from two corner points.
BoundingBox(Double, Double, Double, Double, Double, Double)
 Constructs a boundingbox from numeric extremes.
Top
Properties
Name | Description
Center
 Gets the point in the center of the boundingbox.
Diagonal
 Gets the diagonal vector of this BoundingBox. The diagonal connects the Min and Max points.
Empty
 Gets an [Empty] boundingbox. An Empty box is an invalid structure that has negative width.
IsValid
 Gets a value that indicates whether or not this boundingbox is valid. Empty boxes are not valid, and neither are boxes with unset points.
Max
 Gets or sets the point in the maximal corner.
Min
 Gets or sets the point in the minimal corner.
Unset
 Gets a boundingbox that has Unset coordinates for Min and Max.
Top
Methods
Name | Description
ClosestPoint(Point3d)
 Finds the closest point on or in the boundingbox.
ClosestPoint(Point3d, Boolean)
 Finds the closest point on or in the boundingbox.
Contains(BoundingBox)
 Determines whether this boundingbox contains another boundingbox.
This is the same as calling Contains(box,false).
Contains(Point3d)
 Tests a point for boundingbox inclusion. This is the same as calling Contains(point, false)
Contains(BoundingBox, Boolean)
 Determines whether this boundingbox contains another boundingbox.
The user can choose how to treat boundingboxes with coincidents surfaces.
Contains(Point3d, Boolean)
 Tests a point for BoundingBox inclusion.
Corner
 Gets one of the eight corners of the box.
FurthestPoint
 Finds the furthest point on the Box.
GetCorners
 Gets an array filled with the 8 corner points of this box.
See remarks for the return order.
GetEdges
 Gets an array of the 12 edges of this box.
Inflate(Double)
 Inflates the box with equal amounts in all directions. Inflating with negative amounts may result in decreasing boxes.
Invalid boxes can not be inflated.
Inflate(Double, Double, Double)
 Inflate the box with custom amounts in all directions. Inflating with negative amounts may result in decreasing boxes.
InValid boxes can not be inflated.
Intersection
 Computes the intersection of two bounding boxes.
IsDegenerate
 Determines whether a bounding box is degenerate (flat) in one or more directions.
MakeValid
 Ensures that the box is defined in an increasing fashion along X, Y and Z axes. If the Min or Max points are unset, this function will not change the box.
PointAt
 Evaluates the boundingbox with normalized parameters.
The box has idealized side length of 1x1x1.
ToBrep
 Constructs a Brep representation of this boundingbox.
ToString
 Constructs the string representation of this aligned boundingbox.
 (Overrides ValueType.ToString().)
Transform
 Updates this boundingbox to be the smallest axis aligned boundingbox that contains the transformed result of its 8 original corner points.
Union(BoundingBox)
 Updates this BoundingBox to represent the union of itself and another box.
Union(Point3d)
 Updates this BoundingBox to represent the union of itself and a point.
Union(BoundingBox, BoundingBox)
 Returns a new BoundingBox that represents the union of boxes a and b.
Union(BoundingBox, Point3d)
 Returns a new BoundingBox that represents the union of a bounding box and a point.
Top
See Also
Reference
Rhino.Geometry Namespace