RhinoCommon SDK
Transform.Rotation Method (Vector3d, Vector3d, Point3d)
Rhino for Mac 5.1
 Constructs a new rotation transformation with start and end directions and rotation center.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform Rotation(
	Vector3d startDirection,
	Vector3d endDirection,
	Point3d rotationCenter
)
Public Shared Function Rotation (
	startDirection As Vector3d,
	endDirection As Vector3d,
	rotationCenter As Point3d
) As Transform
Parameters
startDirection
Type: Rhino.Geometry.Vector3d
A start direction.
endDirection
Type: Rhino.Geometry.Vector3d
An end direction.
rotationCenter
Type: Rhino.Geometry.Point3d
A rotation center.
Return Value
Type: Transform
A transformation matrix which rotates geometry around an anchor point.
See Also
Reference
Transform Structure
Rotation Overload
Rhino.Geometry Namespace