RhinoCommon SDK
MeshTopologyEdgeList.SplitEdge Method (Int32, Double)
Rhino for Mac 5.1
 Divides a mesh edge to create two or more triangles
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SplitEdge(
	int topologyEdgeIndex,
	double t
)
Public Function SplitEdge (
	topologyEdgeIndex As Integer,
	t As Double
) As Boolean
Parameters
topologyEdgeIndex
Type: System.Int32
Edge to divide
t
Type: System.Double
 Parameter along edge. This is the same as getting an EdgeLine and calling PointAt(t) on that line
Return Value
Type: Boolean
true if successful
See Also
Reference
MeshTopologyEdgeList Class
SplitEdge Overload
Rhino.Geometry.Collections Namespace