RhinoCommon SDK
Transform.Item Property
Rhino for Mac 5.1
 Gets or sets the matrix value at the given row and column indixes.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double this[
	int row,
	int column
] { get; set; }
Public Default Property Item (
	row As Integer,
	column As Integer
) As Double
	Get
	Set
Parameters
row
Type: System.Int32
Index of row to access, must be 0, 1, 2 or 3.
column
Type: System.Int32
Index of column to access, must be 0, 1, 2 or 3.
Property Value
Type: Double
The new value at [row, column]
Return Value
Type: Double
The value at [row, column]
See Also
Reference
Transform Structure
Rhino.Geometry Namespace