RhinoCommon SDK
RhinoObject.IsDeletable Property
Rhino for Mac 5.1
 Some objects cannot be deleted, like grips on lights and annotation objects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsDeletable { get; protected set; }
Public Property IsDeletable As Boolean
	Get
	Protected Set
Property Value
Type: Boolean
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace