RhinoCommon SDK
RTreeEventArgs.Cancel Property
Rhino for Mac 5.1
 Gets or sets a value that determines if the search should be conducted farther.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Cancel { get; set; }
Public Property Cancel As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace