RhinoCommon SDK
Light.IsPointLight Property
Rhino for Mac 5.1
 Gets a value indicating whether the light style is LightStyle CameraPoint or WorldPoint.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsPointLight { get; }
Public ReadOnly Property IsPointLight As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Light Class
Rhino.Geometry Namespace