RhinoCommon SDK
DisplayPipeline.DrawObject Method (RhinoObject)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawObject(Rhino.DocObjects.RhinoObject)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawObject(
	RhinoObject rhinoObject
)
Public Sub DrawObject (
	rhinoObject As RhinoObject
)
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhinoObject"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawObject(Rhino.DocObjects.RhinoObject)"]
See Also
Reference
DisplayPipeline Class
DrawObject Overload
Rhino.Display Namespace