RhinoCommon SDK
Point2d Structure
Rhino for Mac 5.1
 Represents the two coordinates of a point in two-dimensional space, using Double-precision floating point numbers.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct Point2d : ISerializable, IEquatable<Point2d>,
	IComparable<Point2d>, IComparable, IEpsilonComparable<Point2d>
<SerializableAttribute>
Public Structure Point2d
	Implements ISerializable, IEquatable(Of Point2d),
	IComparable(Of Point2d), IComparable, IEpsilonComparable(Of Point2d)
The Point2d type exposes the following members.
Constructors
Name | Description
Point2d(Point2d)
 Initializes a new instance of Point2d by copying another Point2d.
Point2d(Point3d)
 Initializes a new instance of Point3d by copying the first two coordiantes of a Point3d.
Point2d(Vector2d)
 Initializes a new instance of Point2d by converting a vector.
Point2d(Double, Double)
 Initializes a new instance of Point2d from coordinates.
Top
Properties
Name | Description
IsValid
 If any coordinate of a point is UnsetValue, then the point is not valid.
Item
 Accesses the coordinates of this point.
MaximumCoordinate
 Gets the largest valid coordinate, or RhinoMath.UnsetValue if no coordinate is valid.
MinimumCoordinate
 Gets the smallest (both positive and negative) valid coordinate, or RhinoMath.UnsetValue if no coordinate is valid.
Origin
 Gets a point at 0,0.
Unset
 Gets a point at RhinoMath.UnsetValue,RhinoMath.UnsetValue.
X
 Gets or sets the X (first) coordinate of the point.
Y
 Gets or sets the Y (second) coordinate of the point.
Top
Methods
Name | Description
Add(Point2d, Point2d)
 Adds a point with a point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Add(Point2d, Vector2d)
 Adds a point with a vector.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Add(Vector2d, Point2d)
 Adds a vector with a point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
CompareTo
 Compares this Point2d with another Point2d.
Coordinates evaluation priority is first X, then Y.
DistanceTo
 Computes the distance between two points.
Divide
 Divides a Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Point2d and has the same values as the present point.
 (Overrides ValueType.Equals(Object).)
Equals(Point2d)
 Determines whether the specified Point2d has the same values as the present point.
GetHashCode
 Computes a hash number that represents the current point.
 (Overrides ValueType.GetHashCode().)
Multiply(Double, Point2d)
 Multiplies a Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Point2d, Double)
 Multiplies a Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Subtract(Point2d, Point2d)
 Subtracts the second point from the first point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
Subtract(Point2d, Vector2d)
 Subtracts a vector from a point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
ToString
 Constructs the string representation for the current point.
 (Overrides ValueType.ToString().)
Transform
 Transforms the present point in place. The transformation matrix acts on the left of the point. i.e.,
result = transformation*point
Top
Operators
Name | Description
Addition(Point2d, Point2d)
 Adds a point with a point.
Addition(Point2d, Vector2d)
 Adds a point with a vector.
Addition(Vector2d, Point2d)
 Adds a vector with a point.
Division
 Divides a Point2d by a number.
Equality
 Determines whether two Point2d have equal values.
GreaterThan
 Determines whether the first specified Point2d comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
GreaterThanOrEqual
 Determines whether the first specified Point2d comes after (has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
Inequality
 Determines whether two Point2d have different values.
LessThan
 Determines whether the first specified point comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
LessThanOrEqual
 Determines whether the first specified point comes before (has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
Multiply(Double, Point2d)
 Multiplies a Point2d by a number.
Multiply(Point2d, Double)
 Multiplies a Point2d by a number.
Subtraction(Point2d, Point2d)
 Subtracts point2 from point1.
Subtraction(Point2d, Vector2d)
 Subtracts a vector from a point.
Top
See Also
Reference
Rhino.Geometry Namespace