RhinoCommon SDK
Point4d Structure
Rhino for Mac 5.1
 Represents the four coordinates of a point in four-dimensional space.
The W (fourth) dimension is often considered the weight of the point as seen in 3D space.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct Point4d : ISerializable, IEquatable<Point4d>,
	IEpsilonComparable<Point4d>
<SerializableAttribute>
Public Structure Point4d
	Implements ISerializable, IEquatable(Of Point4d),
	IEpsilonComparable(Of Point4d)
The Point4d type exposes the following members.
Constructors
Name | Description
Point4d(Point3d)
 Initializes a new instance of the Point4d class from the coordinates of a point.
Point4d(Double, Double, Double, Double)
 Initializes a new instance of the Point4d class based on coordinates.
Top
Properties
Name | Description
Unset
 Gets the value of a point with all coordinates set as RhinoMath.UnsetValue.
W
 Gets or sets the W (fourth) coordinate -or weight- of this point.
X
 Gets or sets the X (first) coordinate of this point.
Y
 Gets or sets the Y (second) coordinate of this point.
Z
 Gets or sets the Z (third) coordinate of this point.
Top
Methods
Name | Description
Add
 Sums two Point4d together.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is Point4d and has same coordinates as the present point.
 (Overrides ValueType.Equals(Object).)
Equals(Point4d)
 Determines whether the specified point has same value as the present point.
GetHashCode
 Computes the hash code for the present point.
 (Overrides ValueType.GetHashCode().)
Multiply
 Multiplies a point by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Subtract
 Subtracts the second point from the first point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
Top
Operators
Name | Description
Addition
 Sums two Point4d together.
Equality
 Determines whether two Point4d have equal values.
Inequality
 Determines whether two Point4d have different values.
Multiply(Point4d, Point4d)
 Multiplies two Point4d together, returning the dot (internal) product of the two. This is not the cross product.
Multiply(Point4d, Double)
 Multiplies a point by a number.
Subtraction
 Subtracts the second point from the first point.
Top
See Also
Reference
Rhino.Geometry Namespace