RhinoCommon SDK
EarthAnchorPoint.EarthBasepointElevation Property
Rhino for Mac 5.1
 Gets or sets the point elevation on earth, in meters.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double EarthBasepointElevation { get; set; }
Public Property EarthBasepointElevation As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace