RhinoCommon SDK
NurbsSurface.CreateRuledSurface Method
Rhino for Mac 5.1
 Constructs a ruled surface between two curves. Curves must share the same knot-vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static NurbsSurface CreateRuledSurface(
	Curve curveA,
	Curve curveB
)
Public Shared Function CreateRuledSurface (
	curveA As Curve,
	curveB As Curve
) As NurbsSurface
Parameters
curveA
Type: Rhino.Geometry.Curve
First curve.
curveB
Type: Rhino.Geometry.Curve
Second curve.
Return Value
Type: NurbsSurface
A ruled surface on success or null on failure.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace