RhinoCommon SDK
GetTransform Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Input.Custom.GetTransform"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetBaseClass
 Rhino.Input.Custom.GetPoint
 Rhino.Input.Custom.GetTransform
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class GetTransform : GetPoint
Public MustInherit Class GetTransform
	Inherits GetPoint
The GetTransform type exposes the following members.
Constructors
Name | Description
GetTransform
Initializes a new instance of the GetTransform class
Top
Properties
Name | Description
HaveTransform
ObjectList
Transform
Top
Methods
Name | Description
AddTransformObjects
 Adds any objects you want transformed and grips you want transformed. Make sure no duplicates are in the list and that no grip ownwers are passed in as objects.
CalculateTransform
 Retrieves the final transformation.
Override this virtual function to provide your own custom transformation method.
GetXform
 Gets the Transformation.
Call this after having set up options and so on.
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Input.Custom Namespace