RhinoCommon SDK
HostUtils.InPlaceConstCast Method
Rhino for Mac 5.1
 DO NOT USE UNLESS YOU ARE CERTAIN ABOUT THE IMPLICATIONS.
This is an expert user function which should not be needed in most cases. This function is similar to a const_cast in C++ to allow an object to be made temporarily modifiable without causing RhinoCommon to convert the class from const to non-const by creating a duplicate.
You must call this function with a true parameter, make your modifications, and then restore the const flag by calling this function again with a false parameter. If you have any questions, please contact McNeel developer support before using!
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void InPlaceConstCast(
	GeometryBase geometry,
	bool makeNonConst
)
Public Shared Sub InPlaceConstCast (
	geometry As GeometryBase,
	makeNonConst As Boolean
)
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
Some geometry.
makeNonConst
Type: System.Boolean
A boolean value.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace