RhinoCommon SDK
DisplayPipeline.Draw3dText Method (Text3d, Color)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(Rhino.Display.Text3d,System.Drawing.Color)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Draw3dText(
	Text3d text,
	Color color
)
Public Sub Draw3dText (
	text As Text3d,
	color As Color
)
Parameters
text
Type: Rhino.Display.Text3d
[Missing <param name="text"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(Rhino.Display.Text3d,System.Drawing.Color)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(Rhino.Display.Text3d,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
Draw3dText Overload
Rhino.Display Namespace