RhinoCommon SDK
RenderSettings.RenderMeshEdges Property
Rhino for Mac 5.1
 Gets or sets a value indicating whether to instruct the rendering engine to show mesh edges.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool RenderMeshEdges { get; set; }
Public Property RenderMeshEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderSettings Class
Rhino.Render Namespace