RhinoCommon SDK
ReplayHistoryData.TryGetDouble Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetDouble(System.Int32,System.Double@)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetDouble(
	int id,
	out double value
)
Public Function TryGetDouble (
	id As Integer,
	<OutAttribute> ByRef value As Double
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetDouble(System.Int32,System.Double@)"]
value
Type: System.Double
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetDouble(System.Int32,System.Double@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetDouble(System.Int32,System.Double@)"]
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace