RhinoCommon SDK
PolyCurve.SegmentDomain Method
Rhino for Mac 5.1
 Returns the polycurve subdomain assigned to a segment curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interval SegmentDomain(
	int segmentIndex
)
Public Function SegmentDomain (
	segmentIndex As Integer
) As Interval
Parameters
segmentIndex
Type: System.Int32
Index of segment.
Return Value
Type: Interval
 The polycurve subdomain assigned to a segment curve. Returns Interval.Unset if segment_index < 0 or segment_index >= Count().
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace