RhinoCommon SDK
Font Properties
Rhino for Mac 5.1
The Font type exposes the following members.
Properties
Name | Description
Bold
FaceName
Italic
Top
See Also
Reference
Font Class
Rhino.DocObjects Namespace