RhinoCommon SDK
Plane.ValueAt Method
Rhino for Mac 5.1
 Get the value of the plane equation at the point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ValueAt(
	Point3d p
)
Public Function ValueAt (
	p As Point3d
) As Double
Parameters
p
Type: Rhino.Geometry.Point3d
evaulation point.
Return Value
Type: Double
returns pe[0]*p.X + pe[1]*p.Y + pe[2]*p.Z + pe[3] where pe[0], pe[1], pe[2] and pe[3] are the coeeficients of the plane equation.
See Also
Reference
Plane Structure
Rhino.Geometry Namespace