RhinoCommon SDK
SimpleArrayGeometryPointer Constructor (IEnumerable<GeometryBase>)
Rhino for Mac 5.1
 Create an ON_SimpleArray<ON_Geometry*> filled with items in geometry
Namespace: Rhino.Runtime.InteropWrappers
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public SimpleArrayGeometryPointer(
	IEnumerable<GeometryBase> geometry
)
Public Sub New (
	geometry As IEnumerable(Of GeometryBase)
)
Parameters
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
[Missing <param name="geometry"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})"]
See Also
Reference
SimpleArrayGeometryPointer Class
SimpleArrayGeometryPointer Overload
Rhino.Runtime.InteropWrappers Namespace