RhinoCommon SDK
ILocalizationService.LocalizeCommandName Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.ILocalizationService.LocalizeCommandName(System.Reflection.Assembly,System.Int32,System.String)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
string LocalizeCommandName(
	Assembly assembly,
	int languageId,
	string english
)
Function LocalizeCommandName (
	assembly As Assembly,
	languageId As Integer,
	english As String
) As String
Parameters
assembly
Type: System.Reflection.Assembly
[Missing <param name="assembly"/> documentation for "M:Rhino.UI.ILocalizationService.LocalizeCommandName(System.Reflection.Assembly,System.Int32,System.String)"]
languageId
Type: System.Int32
[Missing <param name="languageId"/> documentation for "M:Rhino.UI.ILocalizationService.LocalizeCommandName(System.Reflection.Assembly,System.Int32,System.String)"]
english
Type: System.String
[Missing <param name="english"/> documentation for "M:Rhino.UI.ILocalizationService.LocalizeCommandName(System.Reflection.Assembly,System.Int32,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.ILocalizationService.LocalizeCommandName(System.Reflection.Assembly,System.Int32,System.String)"]
See Also
Reference
ILocalizationService Interface
Rhino.UI Namespace