RhinoCommon SDK
File3dmObjectTable.Delete Method (Guid)
Rhino for Mac 5.1
 Deletes object from document.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Delete(
	Guid objectId
)
Public Function Delete (
	objectId As Guid
) As Boolean
Parameters
objectId
Type: System.Guid
Id of the object to delete.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
File3dmObjectTable Class
Delete Overload
Rhino.FileIO Namespace