RhinoCommon SDK
DisplayMaterial.Ambient Property
Rhino for Mac 5.1
 Gets or sets the Ambient color of the Material. The alpha component of the color will be ignored.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color Ambient { get; set; }
Public Property Ambient As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace