RhinoCommon SDK
Intersection.LinePlane Method
Rhino for Mac 5.1
 Intersects a line and a plane. This function only returns true if the intersection result is a single point (i.e. if the line is coincident with the plane then no intersection is assumed).
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool LinePlane(
	Line line,
	Plane plane,
	out double lineParameter
)
Public Shared Function LinePlane (
	line As Line,
	plane As Plane,
	<OutAttribute> ByRef lineParameter As Double
) As Boolean
Parameters
line
Type: Rhino.Geometry.Line
Line for intersection.
plane
Type: Rhino.Geometry.Plane
Plane to intersect.
lineParameter
Type: System.Double
Parameter on line where intersection occurs. If the parameter is not within the {0, 1} Interval then the finite segment does not intersect the plane.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace