RhinoCommon SDK
ObjectAttributes.ComputedPlotWeight Method (RhinoDoc)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedPlotWeight(Rhino.RhinoDoc)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ComputedPlotWeight(
	RhinoDoc document
)
Public Function ComputedPlotWeight (
	document As RhinoDoc
) As Double
Parameters
document
Type: Rhino.RhinoDoc
[Missing <param name="document"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedPlotWeight(Rhino.RhinoDoc)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedPlotWeight(Rhino.RhinoDoc)"]
See Also
Reference
ObjectAttributes Class
ComputedPlotWeight Overload
Rhino.DocObjects Namespace