RhinoCommon SDK
CustomObjectGrips.RegisterGripsEnabler Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomObjectGrips.RegisterGripsEnabler(Rhino.DocObjects.Custom.TurnOnGripsEventHandler,System.Type)"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void RegisterGripsEnabler(
	TurnOnGripsEventHandler enabler,
	Type customGripsType
)
Public Shared Sub RegisterGripsEnabler (
	enabler As TurnOnGripsEventHandler,
	customGripsType As Type
)
Parameters
enabler
Type: Rhino.DocObjects.Custom.TurnOnGripsEventHandler
[Missing <param name="enabler"/> documentation for "M:Rhino.DocObjects.Custom.CustomObjectGrips.RegisterGripsEnabler(Rhino.DocObjects.Custom.TurnOnGripsEventHandler,System.Type)"]
customGripsType
Type: System.Type
[Missing <param name="customGripsType"/> documentation for "M:Rhino.DocObjects.Custom.CustomObjectGrips.RegisterGripsEnabler(Rhino.DocObjects.Custom.TurnOnGripsEventHandler,System.Type)"]
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace