RhinoCommon SDK
Transform Methods
Rhino for Mac 5.1
The Transform type exposes the following members.
Methods
Name | Description
ChangeBasis(Plane, Plane)
 Computes a change of basis transformation. A basis change is essentially a remapping of geometry from one coordinate system to another.
ChangeBasis(Vector3d, Vector3d, Vector3d, Vector3d, Vector3d, Vector3d)
 Computes a change of basis transformation. A basis change is essentially a remapping of geometry from one coordinate system to another.
CompareTo
 Compares this transform with another transform.
M33 has highest value, then M32, etc..
Equals(Object)
 Determines if another object is a transform and its value equals this transform value.
 (Overrides ValueType.Equals(Object).)
Equals(Transform)
 Determines if another transform equals this transform value.
GetHashCode
 Gets a non-unique hashing code for this transform.
 (Overrides ValueType.GetHashCode().)
Mirror(Plane)
 Constructs a new Mirror transformation.
Mirror(Point3d, Vector3d)
 Create mirror transformation matrix The mirror transform maps a point Q to Q - (2*(Q-P)oN)*N, where P = pointOnMirrorPlane and N = normalToMirrorPlane.
Multiply
 Multiplies (combines) two transformations.
This is the same as the * operator between two transformations.
PlanarProjection
 Constructs a projection transformation.
PlaneToPlane
Rotation(Double, Point3d)
 Constructs a new rotation transformation with specified angle and rotation center.
Rotation(Double, Vector3d, Point3d)
 Constructs a new rotation transformation with specified angle, rotation center and rotation axis.
Rotation(Vector3d, Vector3d, Point3d)
 Constructs a new rotation transformation with start and end directions and rotation center.
Rotation(Double, Double, Vector3d, Point3d)
 Constructs a new rotation transformation with specified angle, rotation center and rotation axis.
Rotation(Vector3d, Vector3d, Vector3d, Vector3d, Vector3d, Vector3d)
 Constructs a transformation that maps X0 to X1, Y0 to Y1, Z0 to Z1.
Scale(Point3d, Double)
 Constructs a new uniform scaling transformation with a specified scaling anchor point.
Scale(Plane, Double, Double, Double)
 Constructs a new non-uniform scaling transformation with a specified scaling anchor point.
Shear
 Constructs a Shear transformation.
ToFloatArray
 Return the matrix as a linear array of 16 float values
ToString
 Returns a string representation of this transform.
 (Overrides ValueType.ToString().)
TransformBoundingBox
 Computes a new boundingbox that is the smallest axis aligned boundingbox that contains the transformed result of its 8 original corner points.
TransformList
 Given a list, an array or any enumerable set of points, computes a new array of tranformed points.
Translation(Vector3d)
 Constructs a new translation (move) transformation.
Translation(Double, Double, Double)
 Constructs a new translation (move) tranformation. Right column is (dx, dy, dz, 1.0).
Transpose
 Flip row/column values
TryGetInverse
 Attempts to get the inverse transform of this transform.
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace