RhinoCommon SDK
MeshVertexList.Add Method
Rhino for Mac 5.1
Overload List
Name | Description
Add(Point3d)
 Adds a new vertex to the end of the Vertex list.
Add(Point3f)
 Adds a new vertex to the end of the Vertex list.
Add(Double, Double, Double)
 Adds a new vertex to the end of the Vertex list.
Add(Single, Single, Single)
 Adds a new vertex to the end of the Vertex list.
Top
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace