RhinoCommon SDK
Curve.ClosedCurveOrientation Method (Plane)
Rhino for Mac 5.1
 Determines the orientation (counterclockwise or clockwise) of a closed planar curve in a given plane. Only works with simple (no self intersections) closed planar curves.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public CurveOrientation ClosedCurveOrientation(
	Plane plane
)
Public Function ClosedCurveOrientation (
	plane As Plane
) As CurveOrientation
Parameters
plane
Type: Rhino.Geometry.Plane
 The plane in which to solve the orientation.
Return Value
Type: CurveOrientation
The orientation of this curve in the given plane.
See Also
Reference
Curve Class
ClosedCurveOrientation Overload
Rhino.Geometry Namespace