RhinoCommon SDK
CustomBrepObject Constructor
Rhino for Mac 5.1
Initializes a new instance of the CustomBrepObject class
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected CustomBrepObject()
Protected Sub New
See Also
Reference
CustomBrepObject Class
CustomBrepObject Overload
Rhino.DocObjects.Custom Namespace