RhinoCommon SDK
Cylinder Constructor (Circle)
Rhino for Mac 5.1
 Constructs a new cylinder with infinite height.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Cylinder(
	Circle baseCircle
)
Public Sub New (
	baseCircle As Circle
)
Parameters
baseCircle
Type: Rhino.Geometry.Circle
Base circle for infinite cylinder.
See Also
Reference
Cylinder Structure
Cylinder Overload
Rhino.Geometry Namespace