RhinoCommon SDK
File3dm.ReadRevisionHistory Method
Rhino for Mac 5.1
 Quickly check a file for it's revision information. This function does not read the entire file, just what it needs to get revision information out
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool ReadRevisionHistory(
	string path,
	out string createdBy,
	out string lastEditedBy,
	out int revision,
	out DateTime createdOn,
	out DateTime lastEditedOn
)
Public Shared Function ReadRevisionHistory (
	path As String,
	<OutAttribute> ByRef createdBy As String,
	<OutAttribute> ByRef lastEditedBy As String,
	<OutAttribute> ByRef revision As Integer,
	<OutAttribute> ByRef createdOn As DateTime,
	<OutAttribute> ByRef lastEditedOn As DateTime
) As Boolean
Parameters
path
Type: System.String
path to the 3dm file
createdBy
Type: System.String
original author of the file
lastEditedBy
Type: System.String
last person to edit the file
revision
Type: System.Int32
which revision this file is at
createdOn
Type: System.DateTime
date file was created (DateTime.MinValue if not set in file)
lastEditedOn
Type: System.DateTime
date file was last edited (DateTime.MinValue if not set in file)
Return Value
Type: Boolean
true on success
See Also
Reference
File3dm Class
Rhino.FileIO Namespace