RhinoCommon SDK
BinaryArchiveReader.ReadPoint3f Method
Rhino for Mac 5.1
 Reads a Point3f from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3f ReadPoint3f()
Public Function ReadPoint3f As Point3f
Return Value
Type: Point3f
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace