RhinoCommon SDK
Localization.LocalizeCommandOptionName Method (String, Object, Int32)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.Localization.LocalizeCommandOptionName(System.String,System.Object,System.Int32)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static LocalizeStringPair LocalizeCommandOptionName(
	string english,
	Object assemblyOrObject,
	int contextId
)
Public Shared Function LocalizeCommandOptionName (
	english As String,
	assemblyOrObject As Object,
	contextId As Integer
) As LocalizeStringPair
Parameters
english
Type: System.String
[Missing <param name="english"/> documentation for "M:Rhino.UI.Localization.LocalizeCommandOptionName(System.String,System.Object,System.Int32)"]
assemblyOrObject
Type: System.Object
[Missing <param name="assemblyOrObject"/> documentation for "M:Rhino.UI.Localization.LocalizeCommandOptionName(System.String,System.Object,System.Int32)"]
contextId
Type: System.Int32
[Missing <param name="contextId"/> documentation for "M:Rhino.UI.Localization.LocalizeCommandOptionName(System.String,System.Object,System.Int32)"]
Return Value
Type: LocalizeStringPair
[Missing <returns> documentation for "M:Rhino.UI.Localization.LocalizeCommandOptionName(System.String,System.Object,System.Int32)"]
See Also
Reference
Localization Class
LocalizeCommandOptionName Overload
Rhino.UI Namespace