RhinoCommon SDK
File3dmWriteOptions.SaveAnalysisMeshes Property
Rhino for Mac 5.1
 Include analysis meshes in the file. Default is true
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SaveAnalysisMeshes { get; set; }
Public Property SaveAnalysisMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace