RhinoCommon SDK
GeometryBase.Duplicate Method
Rhino for Mac 5.1
 Constructs a deep (full) copy of this object.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual GeometryBase Duplicate()
Public Overridable Function Duplicate As GeometryBase
Return Value
Type: GeometryBase
An object of the same type as this, with the same properties and behavior.
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace