RhinoCommon SDK
MeshObject.MeshGeometry Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.MeshObject.MeshGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Mesh MeshGeometry { get; }
Public ReadOnly Property MeshGeometry As Mesh
	Get
Property Value
Type: Mesh
See Also
Reference
MeshObject Class
Rhino.DocObjects Namespace