RhinoCommon SDK
Plane.OriginZ Property
Rhino for Mac 5.1
 Gets or sets the Z coordinate of the origin of this plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double OriginZ { get; set; }
Public Property OriginZ As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Plane Structure
Rhino.Geometry Namespace