RhinoCommon SDK
ArchivableDictionary.Set Method (String, GeometryBase)
Rhino for Mac 5.1
 Sets any class deriving from the GeometryBase base class.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Set(
	string key,
	GeometryBase val
)
Public Function Set (
	key As String,
	val As GeometryBase
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: Rhino.Geometry.GeometryBase
A geometry object for that key.
Because this class is a reference type and is mutable, changes to this object will propagate to the object inside the dictionary.
It is up to the user to clone this entry when appropriate. You can use Duplicate() for this.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.GeometryBase)"]
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace