RhinoCommon SDK
RhinoViewport.MouseDollyZoom Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.MouseDollyZoom(System.Drawing.Point,System.Drawing.Point)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MouseDollyZoom(
	Point mousePreviousPoint,
	Point mouseCurrentPoint
)
Public Function MouseDollyZoom (
	mousePreviousPoint As Point,
	mouseCurrentPoint As Point
) As Boolean
Parameters
mousePreviousPoint
Type: System.Drawing.Point
[Missing <param name="mousePreviousPoint"/> documentation for "M:Rhino.Display.RhinoViewport.MouseDollyZoom(System.Drawing.Point,System.Drawing.Point)"]
mouseCurrentPoint
Type: System.Drawing.Point
[Missing <param name="mouseCurrentPoint"/> documentation for "M:Rhino.Display.RhinoViewport.MouseDollyZoom(System.Drawing.Point,System.Drawing.Point)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.MouseDollyZoom(System.Drawing.Point,System.Drawing.Point)"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace