RhinoCommon SDK
BitmapTable.GetEnumerator Method
Rhino for Mac 5.1
 BitmapTable enumerator
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<BitmapEntry> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BitmapEntry)
Return Value
Type: IEnumerator<BitmapEntry>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.BitmapTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace