RhinoCommon SDK
ObjectTable.AddEllipse Method (Ellipse)
Rhino for Mac 5.1
Adds a curve object to the document representing an ellipse.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddEllipse(
	Ellipse ellipse
)
Public Function AddEllipse (
	ellipse As Ellipse
) As Guid
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
An ellipse value.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddEllipse Overload
Rhino.DocObjects.Tables Namespace