RhinoCommon SDK
UserDataList.Add Method
Rhino for Mac 5.1
 If the userdata is already in a different UserDataList, it will be removed from that list and added to this list.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Add(
	UserData userdata
)
Public Function Add (
	userdata As UserData
) As Boolean
Parameters
userdata
Type: Rhino.DocObjects.Custom.UserData
Data element.
Return Value
Type: Boolean
Whether this operation succeeded.
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace