RhinoCommon SDK
File3dmObjectTable.AddHatch Method
Rhino for Mac 5.1
Overload List
Name | Description
AddHatch(Hatch)
 Adds a hatch to the document.
AddHatch(Hatch, ObjectAttributes)
 Adds a hatch to the document.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace