RhinoCommon SDK
DisplayPipeline.DrawArrows Method (Line[], Color)
Rhino for Mac 5.1
 Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawArrows(
	Line[] lines,
	Color color
)
Public Sub DrawArrows (
	lines As Line(),
	color As Color
)
Parameters
lines
Type: Rhino.Geometry.Line[]
Arrow shafts.
color
Type: System.Drawing.Color
Color of arrows.
See Also
Reference
DisplayPipeline Class
DrawArrows Overload
Rhino.Display Namespace