RhinoCommon SDK
File3dmObjectTable.AddCurve Method
Rhino for Mac 5.1
Overload List
Name | Description
AddCurve(Curve)
Adds a curve object to the table.
AddCurve(Curve, ObjectAttributes)
Adds a curve object to the table.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace