RhinoCommon SDK
ObjectEnumeratorSettings.HiddenObjects Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.HiddenObjects"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool HiddenObjects { get; set; }
Public Property HiddenObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace