RhinoCommon SDK
Dialogs.ShowSelectLayerDialog Method
Rhino for Mac 5.1
 Displays Rhino's single layer selection dialog.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool ShowSelectLayerDialog(
	ref int layerIndex,
	string dialogTitle,
	bool showNewLayerButton,
	bool showSetCurrentButton,
	ref bool initialSetCurrentState
)
Public Shared Function ShowSelectLayerDialog (
	ByRef layerIndex As Integer,
	dialogTitle As String,
	showNewLayerButton As Boolean,
	showSetCurrentButton As Boolean,
	ByRef initialSetCurrentState As Boolean
) As Boolean
Parameters
layerIndex
Type: System.Int32
 Initial layer for the dialog, and will receive selected layer if function returns DialogResult.OK.
dialogTitle
Type: System.String
The dialog title.
showNewLayerButton
Type: System.Boolean
true if the new layer button will be visible.
showSetCurrentButton
Type: System.Boolean
true if the set current button will be visible.
initialSetCurrentState
Type: System.Boolean
true if the current state will be initially set.
Return Value
Type: Boolean
 True if the dialog was closed with the OK button. False if the dialog was closed with escape.
See Also
Reference
Dialogs Class
Rhino.UI Namespace