RhinoCommon SDK
RhinoObjectEventArgs.TheObject Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoObjectEventArgs.TheObject"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject TheObject { get; }
Public ReadOnly Property TheObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
RhinoObjectEventArgs Class
Rhino.DocObjects Namespace