RhinoCommon SDK
InstanceDefinition Properties
Rhino for Mac 5.1
The InstanceDefinition type exposes the following members.
Properties
Name | Description
ArchiveFileStatus
 Returns the archive file status of a linked instance definition.
Description
Id
Index
 Index of this instance definition in the index definition table.
IsDeleted
IsReference
 An object from a work session reference model is reference a reference object and cannot be modified. An object is a reference object if, and only if, it is on a reference layer.
IsTenuous
LayerStyle
Name
ObjectCount
 Number of objects this definition uses. This counts the objects that are used to define the geometry. This does NOT count the number of references to this instance definition.
SkipNestedLinkedDefinitions
 Controls how much geometry is read when a linked InstanceDefinition is updated.
SourceArchive
UpdateType
Url
 The hyperlink URL that is executed when the UrlDescription hyperlink is clicked on in the Insert and Block UI
UrlDescription
 The URL description displayed as a hyperlink in the Insert and Block UI
Top
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace