RhinoCommon SDK
Mesh.CreateFromBox Method (BoundingBox, Int32, Int32, Int32)
Rhino for Mac 5.1
 Constructs new mesh that matches a bounding box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Mesh CreateFromBox(
	BoundingBox box,
	int xCount,
	int yCount,
	int zCount
)
Public Shared Function CreateFromBox (
	box As BoundingBox,
	xCount As Integer,
	yCount As Integer,
	zCount As Integer
) As Mesh
Parameters
box
Type: Rhino.Geometry.BoundingBox
A box to use for creation.
xCount
Type: System.Int32
Number of faces in x-direction.
yCount
Type: System.Int32
Number of faces in y-direction.
zCount
Type: System.Int32
Number of faces in z-direction.
Return Value
Type: Mesh
A new brep, or null on failure.
See Also
Reference
Mesh Class
CreateFromBox Overload
Rhino.Geometry Namespace