RhinoCommon SDK
SerializationOptions.WriteUserData Property
Rhino for Mac 5.1
 Gets or sets a value indicating whether to write user data.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool WriteUserData { get; set; }
Public Property WriteUserData As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace