RhinoCommon SDK
Vector2d.ToString Method
Rhino for Mac 5.1
 Constructs a string representation of the current vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A string in the form X,Y.
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace