RhinoCommon SDK
GetBaseClass.AddOptionToggle Method
Rhino for Mac 5.1
Overload List
Name | Description
AddOptionToggle(String, OptionToggle)
 Adds a command line option to toggle a setting.
AddOptionToggle(LocalizeStringPair, OptionToggle)
 Adds a command line option to toggle a setting.
Top
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace