RhinoCommon SDK
Matrix.IsSquare Property
Rhino for Mac 5.1
 Gets a value indicating whether this matrix has the same number of rows and columns. 0x0 matrices are not considered square.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSquare { get; }
Public ReadOnly Property IsSquare As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Matrix Class
Rhino.Geometry Namespace