RhinoCommon SDK
CustomGripObject Properties
Rhino for Mac 5.1
The CustomGripObject type exposes the following members.
Properties
Name | Description
Index
OriginalLocation
Weight |  (Overrides GripObject.Weight.)
Top
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace