RhinoCommon SDK
Command.EnglishName Property
Rhino for Mac 5.1
 Gets the name of the command. This method is abstract.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract string EnglishName { get; }
Public MustOverride ReadOnly Property EnglishName As String
	Get
Property Value
Type: String
See Also
Reference
Command Class
Rhino.Commands Namespace