RhinoCommon SDK
BoundingBox.Union Method (BoundingBox, Point3d)
Rhino for Mac 5.1
 Returns a new BoundingBox that represents the union of a bounding box and a point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static BoundingBox Union(
	BoundingBox box,
	Point3d point
)
Public Shared Function Union (
	box As BoundingBox,
	point As Point3d
) As BoundingBox
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to include in the union.
point
Type: Rhino.Geometry.Point3d
Point to include in the union.
Return Value
Type: BoundingBox
The BoundingBox that contains both the box and the point.
Remarks
Invalid boxes and points are ignored and will not affect the union.
See Also
Reference
BoundingBox Structure
Union Overload
Rhino.Geometry Namespace