RhinoCommon SDK
RhinoObject.IsSelectable Method
Rhino for Mac 5.1
Overload List
Name | Description
IsSelectable()
Reports if an object can be selected.
IsSelectable(Boolean, Boolean, Boolean, Boolean)
Reports if an object can be selected.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace