RhinoCommon SDK
RTreeEventArgs.IdPtr Property
Rhino for Mac 5.1
 Gets the identifier pointer of the found item.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IntPtr IdPtr { get; }
Public ReadOnly Property IdPtr As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace