RhinoCommon SDK
CalculateBoundingBoxEventArgs Properties
Rhino for Mac 5.1
The CalculateBoundingBoxEventArgs type exposes the following members.
Properties
Name | Description
BoundingBox
 Gets the current bounding box.
Top
See Also
Reference
CalculateBoundingBoxEventArgs Class
Rhino.Display Namespace