RhinoCommon SDK
BrepFaceList.SplitKinkyFace Method
Rhino for Mac 5.1
 Splits a single face into G1 pieces.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SplitKinkyFace(
	int faceIndex,
	double kinkTolerance
)
Public Function SplitKinkyFace (
	faceIndex As Integer,
	kinkTolerance As Double
) As Boolean
Parameters
faceIndex
Type: System.Int32
The index of the face to split.
kinkTolerance
Type: System.Double
Tolerance (in radians) to use for crease detection.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
 This function leaves deleted stuff in the brep. Call Brep.Compact() to remove deleted stuff.
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace