RhinoCommon SDK
Interval.Length Property
Rhino for Mac 5.1
 Gets the signed length of the numeric range. If the interval is decreasing, a negative length will be returned.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
See Also
Reference
Interval Structure
Rhino.Geometry Namespace