RhinoCommon SDK
CachedTextureCoordinates.Remove Method
Rhino for Mac 5.1
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Remove(
	Point3d item
)
Public Function Remove (
	item As Point3d
) As Boolean
Parameters
item
Type: Rhino.Geometry.Point3d
[Missing <param name="item"/> documentation for "M:Rhino.Render.CachedTextureCoordinates.Remove(Rhino.Geometry.Point3d)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.CachedTextureCoordinates.Remove(Rhino.Geometry.Point3d)"]
Implements
ICollection<T>.Remove(T)
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace