RhinoCommon SDK
ArchivableDictionary.TryGetVector3d Method
Rhino for Mac 5.1
 Get value as Vector3d, will only succeed if value was created using Set(string key, Vector3d value)
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetVector3d(
	string key,
	out Vector3d value
)
Public Function TryGetVector3d (
	key As String,
	<OutAttribute> ByRef value As Vector3d
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetVector3d(System.String,Rhino.Geometry.Vector3d@)"]
value
Type: Rhino.Geometry.Vector3d
[Missing <param name="value"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetVector3d(System.String,Rhino.Geometry.Vector3d@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetVector3d(System.String,Rhino.Geometry.Vector3d@)"]
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace