RhinoCommon SDK
HatchPatternTable.GetEnumerator Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.HatchPatternTable.GetEnumerator"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<HatchPattern> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of HatchPattern)
Return Value
Type: IEnumerator<HatchPattern>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.HatchPatternTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace