RhinoCommon SDK
ObjRef.ObjectId Property
Rhino for Mac 5.1
Returns the id of the referenced Rhino object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid ObjectId { get; }
Public ReadOnly Property ObjectId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace