RhinoCommon SDK
SaveFileDialog Class
Rhino for Mac 5.1
 Similar to the System.Windows.Forms.SaveFileDialog, but with customized Rhino user interface.
Inheritance Hierarchy
System.Object
 Rhino.UI.SaveFileDialog
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class SaveFileDialog
Public Class SaveFileDialog
The SaveFileDialog type exposes the following members.
Constructors
Name | Description
SaveFileDialog
Initializes a new instance of the SaveFileDialog class
Top
Properties
Name | Description
DefaultExt
 The default file name extension. The returned string does not include the period.
FileName
 Gets or sets a string containing the file name selected in the file dialog box.
Filter
 Gets or sets the current file name filter string, which determines the choices that appear in the "Save as file type" or "Files of type" box in the dialog box. See System.Windows.Forms.FileDialog for details.
InitialDirectory
 Gets or sets the initial directory displayed by the file dialog box.
Title
 Gets or sets the file dialog box title.
Top
Methods
Name | Description
ShowDialog
Top
See Also
Reference
Rhino.UI Namespace