RhinoCommon SDK
RhinoViewport Constructor (RhinoViewport)
Rhino for Mac 5.1
Initializes a new instance of the RhinoViewport class
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoViewport(
	RhinoViewport other
)
Public Sub New (
	other As RhinoViewport
)
Parameters
other
Type: Rhino.Display.RhinoViewport
[Missing <param name="other"/> documentation for "M:Rhino.Display.RhinoViewport.#ctor(Rhino.Display.RhinoViewport)"]
See Also
Reference
RhinoViewport Class
RhinoViewport Overload
Rhino.Display Namespace