RhinoCommon SDK
StringTable.SetString Method (String, String, String)
Rhino for Mac 5.1
 Adds or sets a user data string to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string SetString(
	string section,
	string entry,
	string value
)
Public Function SetString (
	section As String,
	entry As String,
	value As String
) As String
Parameters
section
Type: System.String
The section.
entry
Type: System.String
The entry name.
value
Type: System.String
The entry value.
Return Value
Type: String
 The previous value if successful and a previous value existed.
See Also
Reference
StringTable Class
SetString Overload
Rhino.DocObjects.Tables Namespace