RhinoCommon SDK
ObjectTable.AddLine Method (Line)
Rhino for Mac 5.1
Adds a line object to Rhino.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddLine(
	Line line
)
Public Function AddLine (
	line As Line
) As Guid
Parameters
line
Type: Rhino.Geometry.Line
[Missing <param name="line"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Line)"]
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddLine Overload
Rhino.DocObjects.Tables Namespace