RhinoCommon SDK
Circle.EpsilonEquals Method
Rhino for Mac 5.1
 Check that all values in other are within epsilon of the values in this
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool EpsilonEquals(
	Circle other,
	double epsilon
)
Public Function EpsilonEquals (
	other As Circle,
	epsilon As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.Circle
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.Circle.EpsilonEquals(Rhino.Geometry.Circle,System.Double)"]
epsilon
Type: System.Double
[Missing <param name="epsilon"/> documentation for "M:Rhino.Geometry.Circle.EpsilonEquals(Rhino.Geometry.Circle,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Circle.EpsilonEquals(Rhino.Geometry.Circle,System.Double)"]
Implements
IEpsilonComparable<T>.EpsilonEquals(T, Double)
See Also
Reference
Circle Structure
Rhino.Geometry Namespace