RhinoCommon SDK
MeshTopologyEdgeList.GetEdgesForFace Method (Int32)
Rhino for Mac 5.1
 Gets indices of edges that surround a given face.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] GetEdgesForFace(
	int faceIndex
)
Public Function GetEdgesForFace (
	faceIndex As Integer
) As Integer()
Parameters
faceIndex
Type: System.Int32
A face index.
Return Value
Type: Int32[]
A new array of indices to the topological edges that are connected with the specified face.
See Also
Reference
MeshTopologyEdgeList Class
GetEdgesForFace Overload
Rhino.Geometry.Collections Namespace