RhinoCommon SDK
DrawObjectEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.DrawObjectEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.DrawEventArgs
 Rhino.Display.DrawObjectEventArgs
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class DrawObjectEventArgs : DrawEventArgs
Public Class DrawObjectEventArgs
	Inherits DrawEventArgs
The DrawObjectEventArgs type exposes the following members.
Properties
Name | Description
DrawObject
RhinoObject
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace