RhinoCommon SDK
BrepLoopType Enumeration
Rhino for Mac 5.1
 Each brep loop has a defined type, e.g. outer, inner or point on surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum BrepLoopType
Public Enumeration BrepLoopType
Members
Member name | Value | Description
Unknown | 0 |  Unknown loop type.
Outer | 1 |  2d loop curves form a simple closed curve with a counterclockwise orientation.
Inner | 2 |  2d loop curves form a simple closed curve with a clockwise orientation.
Slit | 3 |  Always closed - used internally during splitting operations.
CurveOnSurface | 4 |  "loop" is a curveonsrf made from a single (open or closed) trim that has type TrimType.CurveOnSurface.
PointOnSurface | 5 |  "loop" is a PointOnSurface made from a single trim that has type TrimType.PointOnSurface.
See Also
Reference
Rhino.Geometry Namespace