RhinoCommon SDK
CustomDisplay.AddVector Method (Point3d, Vector3d, Color)
Rhino for Mac 5.1
 Adds a new, colored vector to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddVector(
	Point3d anchor,
	Vector3d span,
	Color color
)
Public Sub AddVector (
	anchor As Point3d,
	span As Vector3d,
	color As Color
)
Parameters
anchor
Type: Rhino.Geometry.Point3d
Anchor point of vector.
span
Type: Rhino.Geometry.Vector3d
Direction and magnitude of vector.
color
Type: System.Drawing.Color
Color of vector.
See Also
Reference
CustomDisplay Class
AddVector Overload
Rhino.Display Namespace