RhinoCommon SDK
RhinoViewport.GetFrustumBoundingBox Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.GetFrustumBoundingBox"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox GetFrustumBoundingBox()
Public Function GetFrustumBoundingBox As BoundingBox
Return Value
Type: BoundingBox
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.GetFrustumBoundingBox"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace