RhinoCommon SDK
PointCloudItem.Color Property
Rhino for Mac 5.1
 Gets or sets the color of this point cloud item.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color Color { get; set; }
Public Property Color As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace