RhinoCommon SDK
Extrusion.SetOuterProfile Method
Rhino for Mac 5.1
 Sets the outer profile of the extrusion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetOuterProfile(
	Curve outerProfile,
	bool cap
)
Public Function SetOuterProfile (
	outerProfile As Curve,
	cap As Boolean
) As Boolean
Parameters
outerProfile
Type: Rhino.Geometry.Curve
curve in the XY plane or a 2D curve.
cap
Type: System.Boolean
 If outerProfile is a closed curve, then cap determines if the extrusion has end caps. If outerProfile is an open curve, cap is ignored.
Return Value
Type: Boolean
 true if the profile was set. If the outer profile is closed, then the extrusion may also have inner profiles. If the outer profile is open, the extrusion may not have inner profiles. If the extrusion already has a profile, the set will fail.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace