RhinoCommon SDK
GumballAppearanceSettings.MenuSize Property
Rhino for Mac 5.1
Radius of menu circle.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int MenuSize { get; set; }
Public Property MenuSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace