RhinoCommon SDK
TransformSimilarityType Enumeration
Rhino for Mac 5.1
 Lists all possible outcomes for transform similarity.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum TransformSimilarityType
Public Enumeration TransformSimilarityType
Members
Member name | Value | Description
OrientationReversing | -1 |  Similarity is preserved, but orientation is flipped.
NotSimilarity | 0 |  Similarity is not preserved. Geometry needs to be deformable for this Transform to operate correctly.
OrientationPreserving | 1 |  Similarity and orientation are preserved.
See Also
Reference
Rhino.Geometry Namespace