RhinoCommon SDK
ViewportInfo.GetFrustum Method
Rhino for Mac 5.1
 Gets the view frustum.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetFrustum(
	out double left,
	out double right,
	out double bottom,
	out double top,
	out double nearDistance,
	out double farDistance
)
Public Function GetFrustum (
	<OutAttribute> ByRef left As Double,
	<OutAttribute> ByRef right As Double,
	<OutAttribute> ByRef bottom As Double,
	<OutAttribute> ByRef top As Double,
	<OutAttribute> ByRef nearDistance As Double,
	<OutAttribute> ByRef farDistance As Double
) As Boolean
Parameters
left
Type: System.Double
A left value that will be filled during the call.
right
Type: System.Double
A right value that will be filled during the call.
bottom
Type: System.Double
A bottom value that will be filled during the call.
top
Type: System.Double
A top value that will be filled during the call.
nearDistance
Type: System.Double
A near distance value that will be filled during the call.
farDistance
Type: System.Double
A far distance value that will be filled during the call.
Return Value
Type: Boolean
true if operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace