RhinoCommon SDK
ExtrusionObject Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.ExtrusionObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.ExtrusionObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class ExtrusionObject : RhinoObject
Public Class ExtrusionObject
	Inherits RhinoObject
The ExtrusionObject type exposes the following members.
Properties
Name | Description
ExtrusionGeometry
Top
Methods
Name | Description
DuplicateExtrusionGeometry
Top
See Also
Reference
Rhino.DocObjects Namespace