RhinoCommon SDK
Dialogs.ShowMessageBox Method (String, String, MessageBoxButtons, MessageBoxIcon)
Rhino for Mac 5.1
Note: This API is now obsolete.
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[ObsoleteAttribute("Use ShowMessage")]
public static DialogResult ShowMessageBox(
	string message,
	string title,
	MessageBoxButtons buttons,
	MessageBoxIcon icon
)
<ObsoleteAttribute("Use ShowMessage")>
Public Shared Function ShowMessageBox (
	message As String,
	title As String,
	buttons As MessageBoxButtons,
	icon As MessageBoxIcon
) As DialogResult
Parameters
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.Dialogs.ShowMessageBox(System.String,System.String,System.Windows.Forms.MessageBoxButtons,System.Windows.Forms.MessageBoxIcon)"]
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.Dialogs.ShowMessageBox(System.String,System.String,System.Windows.Forms.MessageBoxButtons,System.Windows.Forms.MessageBoxIcon)"]
buttons
Type: System.Windows.Forms.MessageBoxButtons
[Missing <param name="buttons"/> documentation for "M:Rhino.UI.Dialogs.ShowMessageBox(System.String,System.String,System.Windows.Forms.MessageBoxButtons,System.Windows.Forms.MessageBoxIcon)"]
icon
Type: System.Windows.Forms.MessageBoxIcon
[Missing <param name="icon"/> documentation for "M:Rhino.UI.Dialogs.ShowMessageBox(System.String,System.String,System.Windows.Forms.MessageBoxButtons,System.Windows.Forms.MessageBoxIcon)"]
Return Value
Type: DialogResult
[Missing <returns> documentation for "M:Rhino.UI.Dialogs.ShowMessageBox(System.String,System.String,System.Windows.Forms.MessageBoxButtons,System.Windows.Forms.MessageBoxIcon)"]
See Also
Reference
Dialogs Class
ShowMessageBox Overload
Rhino.UI Namespace