RhinoCommon SDK
TextEntity.MaskUsesViewportColor Property
Rhino for Mac 5.1
 If true, the viewport's color is used for the mask color. If false, the color defined by MaskColor is used
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MaskUsesViewportColor { get; set; }
Public Property MaskUsesViewportColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace