RhinoCommon SDK
TaperSpaceMorph Constructor
Rhino for Mac 5.1
 Constructs a taper space morph.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TaperSpaceMorph(
	Point3d start,
	Point3d end,
	double startRadius,
	double endRadius,
	bool bFlat,
	bool infiniteTaper
)
Public Sub New (
	start As Point3d,
	end As Point3d,
	startRadius As Double,
	endRadius As Double,
	bFlat As Boolean,
	infiniteTaper As Boolean
)
Parameters
start
Type: Rhino.Geometry.Point3d
Start of the taper axis.
end
Type: Rhino.Geometry.Point3d
End of the taper axis.
startRadius
Type: System.Double
Radius at start point.
endRadius
Type: System.Double
Radius at end point.
bFlat
Type: System.Boolean
If true, then a one-directional, one-dimensional taper is created.
infiniteTaper
Type: System.Boolean
If false, the deformation takes place only the length of the axis. If true, the deformation happens throughout the object, even if the axis is shorter.
See Also
Reference
TaperSpaceMorph Class
Rhino.Geometry.Morphs Namespace