RhinoCommon SDK
Vector3d.VectorAngle Method (Vector3d, Vector3d, Plane)
Rhino for Mac 5.1
 Computes the angle on a plane between two vectors.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static double VectorAngle(
	Vector3d a,
	Vector3d b,
	Plane plane
)
Public Shared Function VectorAngle (
	a As Vector3d,
	b As Vector3d,
	plane As Plane
) As Double
Parameters
a
Type: Rhino.Geometry.Vector3d
First vector.
b
Type: Rhino.Geometry.Vector3d
Second vector.
plane
Type: Rhino.Geometry.Plane
Two-dimensional plane on which to perform the angle measurement.
Return Value
Type: Double
On success, the angle (in radians) between a and b as projected onto the plane; RhinoMath.UnsetValue on failure.
See Also
Reference
Vector3d Structure
VectorAngle Overload
Rhino.Geometry Namespace