RhinoCommon SDK
VolumeMassProperties.Sum Method
Rhino for Mac 5.1
 Sum mass properties together to get an aggregate mass.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Sum(
	VolumeMassProperties summand
)
Public Function Sum (
	summand As VolumeMassProperties
) As Boolean
Parameters
summand
Type: Rhino.Geometry.VolumeMassProperties
mass properties to add.
Return Value
Type: Boolean
true if successful.
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace