RhinoCommon SDK
Line.ToString Method
Rhino for Mac 5.1
 Contructs the string representation of this line, in the form "From,To".
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A text string.
See Also
Reference
Line Structure
Rhino.Geometry Namespace