RhinoCommon SDK
StackedDialogPage.Children Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.StackedDialogPage.Children"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public List<StackedDialogPage> Children { get; }
Public ReadOnly Property Children As List(Of StackedDialogPage)
	Get
Property Value
Type: List<StackedDialogPage>
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace