RhinoCommon SDK
MeshVertexNormalList.AddRange Method
Rhino for Mac 5.1
 Appends a collection of normal vectors.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool AddRange(
	Vector3f[] normals
)
Public Function AddRange (
	normals As Vector3f()
) As Boolean
Parameters
normals
Type: Rhino.Geometry.Vector3f[]
Normals to append.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace