RhinoCommon SDK
Font.FaceName Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.FaceName"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string FaceName { get; }
Public ReadOnly Property FaceName As String
	Get
Property Value
Type: String
See Also
Reference
Font Class
Rhino.DocObjects Namespace