RhinoCommon SDK
BinaryArchiveFile.Open Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.FileIO.BinaryArchiveFile.Open"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Open()
Public Function Open As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveFile.Open"]
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace