RhinoCommon SDK
ViewportInfo.SetFrustum Method
Rhino for Mac 5.1
 Sets the view frustum. If FrustumSymmetryIsLocked() is true and left != -right or bottom != -top, then they will be adjusted so the resulting frustum is symmetric.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFrustum(
	double left,
	double right,
	double bottom,
	double top,
	double nearDistance,
	double farDistance
)
Public Function SetFrustum (
	left As Double,
	right As Double,
	bottom As Double,
	top As Double,
	nearDistance As Double,
	farDistance As Double
) As Boolean
Parameters
left
Type: System.Double
A new left value.
right
Type: System.Double
A new right value.
bottom
Type: System.Double
A new bottom value.
top
Type: System.Double
A new top value.
nearDistance
Type: System.Double
A new near distance value.
farDistance
Type: System.Double
A new far distance value.
Return Value
Type: Boolean
true if operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace