RhinoCommon SDK
ColorCMYK Constructor (Double, Double, Double)
Rhino for Mac 5.1
 Initializes a new instance of ColorCMYK with custom channel values. The cyan, magenta and yellow values will be adjusted based on their combined darkness.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ColorCMYK(
	double cyan,
	double magenta,
	double yellow
)
Public Sub New (
	cyan As Double,
	magenta As Double,
	yellow As Double
)
Parameters
cyan
Type: System.Double
Cyan channel hint.
magenta
Type: System.Double
Magenta channel hint.
yellow
Type: System.Double
Yellow channel hint.
See Also
Reference
ColorCMYK Structure
ColorCMYK Overload
Rhino.Display Namespace