RhinoCommon SDK
IPanelsService.IsPanelVisible Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.IsPanelVisible(System.Guid)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
bool IsPanelVisible(
	Guid panelId
)
Function IsPanelVisible (
	panelId As Guid
) As Boolean
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.IsPanelVisible(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.IsPanelVisible(System.Guid)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace