RhinoCommon SDK
EarthAnchorPoint.EarthBasepointLatitude Property
Rhino for Mac 5.1
 Gets or sets a point latitude on earth, in decimal degrees. +90 = north pole, 0 = equator, -90 = south pole.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double EarthBasepointLatitude { get; set; }
Public Property EarthBasepointLatitude As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace