RhinoCommon SDK
ObjectTable.AddPolyline Method (IEnumerable<Point3d>, ObjectAttributes)
Rhino for Mac 5.1
Adds a polyline object to Rhino.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddPolyline(
	IEnumerable<Point3d> points,
	ObjectAttributes attributes
)
Public Function AddPolyline (
	points As IEnumerable(Of Point3d),
	attributes As ObjectAttributes
) As Guid
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A Polyline; a list, an array, or any enumerable set of Point3d.
attributes
Type: Rhino.DocObjects.ObjectAttributes
attributes to apply to line.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddPolyline Overload
Rhino.DocObjects.Tables Namespace