RhinoCommon SDK
LightTable.Count Property
Rhino for Mac 5.1
Number of lights in the light table. Does not include Sun or Skylight.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace