RhinoCommon SDK
CurveList.Insert Method (Int32, Ellipse)
Rhino for Mac 5.1
 Inserts an ellipse at a given index of this list.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Insert(
	int index,
	Ellipse ellipse
)
Public Sub Insert (
	index As Integer,
	ellipse As Ellipse
)
Parameters
index
Type: System.Int32
A 0-based position in the list.
ellipse
Type: Rhino.Geometry.Ellipse
The ellipse value from which to construct the new curve.
See Also
Reference
CurveList Class
Insert Overload
Rhino.Collections Namespace