RhinoCommon SDK
VolumeMassProperties.Compute Method
Rhino for Mac 5.1
Overload List
Name | Description
Compute(Brep)
 Compute the VolumeMassProperties for a single Brep.
Compute(Mesh)
 Compute the VolumeMassProperties for a single Mesh.
Compute(Surface)
 Compute the VolumeMassProperties for a single Surface.
Top
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace