RhinoCommon SDK
OpenFileDialog Class
Rhino for Mac 5.1
 Similar to the System.Windows.Forms.OpenFileDialog, but with customized Rhino user interface.
Inheritance Hierarchy
System.Object
 Rhino.UI.OpenFileDialog
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class OpenFileDialog
Public Class OpenFileDialog
The OpenFileDialog type exposes the following members.
Constructors
Name | Description
OpenFileDialog
Create a new open file dialog.
Top
Properties
Name | Description
DefaultExt
 The default file name extension. The returned string does not include the period.
FileName
 Gets or sets a string containing the file name selected in the file dialog box.
FileNames
 Gets the names of all of the selected files in the dialog box
Filter
 Gets or sets the current file name filter string, which determines the choices that appear in the "Save as file type" or "Files of type" box in the dialog box. See System.Windows.Forms.FileDialog for details.
InitialDirectory
 Gets or sets the initial directory displayed by the file dialog box.
MultiSelect
 Gets or sets a value indicating whether the dialog box allows multiple files to be selected
Title
 Gets or sets the file dialog box title.
Top
Methods
Name | Description
ShowDialog
Show the actual dialog to allow the user to select a file.
Top
See Also
Reference
Rhino.UI Namespace