RhinoCommon SDK
ColorHSL Structure
Rhino for Mac 5.1
 Represents an HSL (Hue, Saturation, Luminance) color with double precision floating point channels. HSL colors are used primarily in Graphical User Interface environments as they provide a very natural approach to picking colors.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct ColorHSL
<SerializableAttribute>
Public Structure ColorHSL
The ColorHSL type exposes the following members.
Constructors
Name | Description
ColorHSL(Color)
 Constructs a new instance of ColorHSL that is equivalent to an RGB color.
ColorHSL(Double, Double, Double)
 Constructs a new instance of ColorHSL with custom channel values.
ColorHSL(Double, Double, Double, Double)
 Constructs a new instance of ColorHSL with custom channel values.
Top
Properties
Name | Description
A
 Gets or sets the alpha channel value. Alpha channels are limited to a 0~1 range.
H
 Gets or sets the hue channel value. Hue channels rotate between 0.0 and 1.0.
L
 Gets or sets the luminance channel value. Luminance channels are limited to a 0~1 range.
S
 Gets or sets the saturation channel value. Saturation channels are limited to a 0~1 range.
Top
Methods
Name | Description
CreateFromCMYK
 Create the nearest HSL equivalent of a CMYK color.
CreateFromLAB
 Create the nearest HSL equivalent of a LAB color.
CreateFromLCH
 Create the nearest HSL equivalent of a LCH color.
CreateFromXYZ
 Create the nearest HSL equivalent of an XYZ color.
ToArgbColor
 Convert HSL color to an equivalent System.Drawing.Color.
Top
Operators
Name | Description
Implicit(ColorHSL to Color)
 Implicitly converts a ColorHSL in a .Net library color.
Top
See Also
Reference
Rhino.Display Namespace