RhinoCommon SDK
LayerTable.UndoModify Method
Rhino for Mac 5.1
Overload List
Name | Description
UndoModify(Int32)
UndoModify(Int32, UInt32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace