RhinoCommon SDK
DetailView Methods
Rhino for Mac 5.1
The DetailView type exposes the following members.
Methods
Name | Description
SetScale
 Sets the detail viewport's projection so geometry is displayed at a certain scale.
Top
See Also
Reference
DetailView Class
Rhino.Geometry Namespace