RhinoCommon SDK
BinaryArchiveReader.EndRead3dmChunk Method
Rhino for Mac 5.1
 Calling this will skip rest of stuff in chunk if it was only partially read.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool EndRead3dmChunk(
	bool suppressPartiallyReadChunkWarning
)
Public Function EndRead3dmChunk (
	suppressPartiallyReadChunkWarning As Boolean
) As Boolean
Parameters
suppressPartiallyReadChunkWarning
Type: System.Boolean
 Generally, a call to ON_WARNING is made when a chunk is partially read. If suppressPartiallyReadChunkWarning is true, then no warning is issued for partially read chunks.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveReader.EndRead3dmChunk(System.Boolean)"]
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace