RhinoCommon SDK
Light.IsLinearLight Property
Rhino for Mac 5.1
 Gets a value indicating whether the light style is LightStyle WorldLinear.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsLinearLight { get; }
Public ReadOnly Property IsLinearLight As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Light Class
Rhino.Geometry Namespace