RhinoCommon SDK
Plane.GetHashCode Method
Rhino for Mac 5.1
 Gets a non-unique hashing code for this entity.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A particular number for a specific instance of plane.
See Also
Reference
Plane Structure
Rhino.Geometry Namespace