RhinoCommon SDK
MeshingParameters.ComputeCurvature Property
Rhino for Mac 5.1
 Gets or sets a value indicating whether or not surface curvature data will be embedded in the mesh.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ComputeCurvature { get; set; }
Public Property ComputeCurvature As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace