RhinoCommon SDK
DimensionStyle.TextAlignment Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextAlignment"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TextDisplayAlignment TextAlignment { get; set; }
Public Property TextAlignment As TextDisplayAlignment
	Get
	Set
Property Value
Type: TextDisplayAlignment
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace