RhinoCommon SDK
DimensionStyle Constructor
Rhino for Mac 5.1
Overload List
Name | Description
DimensionStyle()
Initializes a new instance of the DimensionStyle class
DimensionStyle(SerializationInfo, StreamingContext)
Initializes a new instance of the DimensionStyle class
Top
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace