RhinoCommon SDK
Material Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Material"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.Material
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class Material : CommonObject
<SerializableAttribute>
Public Class Material
	Inherits CommonObject
The Material type exposes the following members.
Constructors
Name | Description
Material()
Initializes a new instance of the Material class
Material(SerializationInfo, StreamingContext)
Initializes a new instance of the Material class
Top
Properties
Name | Description
AmbientColor
DefaultMaterial
DiffuseColor
EmissionColor
Id
Gets or sets the ID of this material.
IndexOfRefraction
 Gets or sets the index of refraction of the material, generally >= 1.0 (speed of light in vacuum)/(speed of light in material)
IsDefaultMaterial
 By default Rhino layers and objects are assigned the default rendering material.
IsDeleted
 Deleted materials are kept in the runtime material table so that undo will work with materials. Call IsDeleted to determine to determine if a material is deleted.
IsDocumentControlled
 If true this object may not be modified. Any properties or functions that attempt to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.
 (Overrides CommonObject.IsDocumentControlled.)
IsReference
 Rhino allows multiple files to be viewed simultaneously. Materials in the document are "normal" or "reference". Reference materials are not saved.
MaterialIndex
MaxShine
Name
ReflectionColor
Reflectivity
 Gets or sets how reflective a material is, 0f is no reflection 1f is 100% reflective.
RenderPlugInId
 The Id of the RenderPlugIn that is associated with this material.
Shine
 Gets or sets the shine factor of the material.
SpecularColor
Transparency
 Gets or sets the transparency of the material (0.0 = opaque to 1.0 = transparent)
TransparentColor
UseCount
 Number of objects and layers that use this material.
UserStringCount
Top
Methods
Name | Description
CommitChanges
Default
 Set material to default settings.
GetBitmapTexture
GetBumpTexture
 Gets the bump texture of this material.
GetEnvironmentTexture
GetTextures
 Get array of textures that this material uses
GetTransparencyTexture
GetUserString
 Gets a user string.
GetUserStrings
 Gets an independent copy of the collection of (user text key, user text value) pairs attached to this object.
OnSwitchToNonConst |  (Overrides CommonObject.OnSwitchToNonConst().)
SetBitmapTexture(String)
SetBitmapTexture(Texture)
SetBumpTexture(String)
SetBumpTexture(Texture)
SetEnvironmentTexture(String)
SetEnvironmentTexture(Texture)
SetTransparencyTexture(String)
SetTransparencyTexture(Texture)
SetUserString
 Attach a user string (key,value combination) to this geometry.
Top
See Also
Reference
Rhino.DocObjects Namespace