RhinoCommon SDK
Texture.MappingChannelId Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Texture.MappingChannelId"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int MappingChannelId { get; }
Public ReadOnly Property MappingChannelId As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Texture Class
Rhino.DocObjects Namespace