RhinoCommon SDK
ViewportInfo.DollyCamera Method
Rhino for Mac 5.1
 DollyCamera() does not update the frustum's clipping planes. To update the frustum's clipping planes call DollyFrustum(d) with d = dollyVector o cameraFrameZ. To convert screen locations into a dolly vector, use GetDollyCameraVector(). Does not update frustum. To update frustum use DollyFrustum(d) with d = dollyVector o cameraFrameZ.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DollyCamera(
	Vector3d dollyVector
)
Public Function DollyCamera (
	dollyVector As Vector3d
) As Boolean
Parameters
dollyVector
Type: Rhino.Geometry.Vector3d
dolly vector in world coordinates.
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace