RhinoCommon SDK
LayerTableEventArgs.EventType Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LayerTableEventArgs.EventType"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public LayerTableEventType EventType { get; }
Public ReadOnly Property EventType As LayerTableEventType
	Get
Property Value
Type: LayerTableEventType
See Also
Reference
LayerTableEventArgs Class
Rhino.DocObjects.Tables Namespace