RhinoCommon SDK
GripObject.GetCurveParameters Method
Rhino for Mac 5.1
 Retrieves the 2d parameter space values of this GripObject from the curve it's associated with.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetCurveParameters(
	out double t
)
Public Function GetCurveParameters (
	<OutAttribute> ByRef t As Double
) As Boolean
Parameters
t
Type: System.Double
[Missing <param name="t"/> documentation for "M:Rhino.DocObjects.GripObject.GetCurveParameters(System.Double@)"]
Return Value
Type: Boolean
True on success. Output is unreliable if return is false.
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace