RhinoCommon SDK
HistoryRecord Constructor
Rhino for Mac 5.1
Initializes a new instance of the HistoryRecord class
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public HistoryRecord(
	Command command,
	int version
)
Public Sub New (
	command As Command,
	version As Integer
)
Parameters
command
Type: Rhino.Commands.Command
[Missing <param name="command"/> documentation for "M:Rhino.DocObjects.HistoryRecord.#ctor(Rhino.Commands.Command,System.Int32)"]
version
Type: System.Int32
[Missing <param name="version"/> documentation for "M:Rhino.DocObjects.HistoryRecord.#ctor(Rhino.Commands.Command,System.Int32)"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace