RhinoCommon SDK
Extrusion.WallSurface Method
Rhino for Mac 5.1
 Gets one of the longitudinal surfaces of the extrusion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface WallSurface(
	ComponentIndex ci
)
Public Function WallSurface (
	ci As ComponentIndex
) As Surface
Parameters
ci
Type: Rhino.Geometry.ComponentIndex
The index specifying which precise item to retrieve.
Return Value
Type: Surface
The surface.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace