RhinoCommon SDK
LOC.COV Method (String)
Rhino for Mac 5.1
 Command option name strings that need to be localized should call this function. The COV function doesn't actually do anything but return the original string. The LocalizationProcessor application walks through the source code of a project and looks for LOC.COV. The function is then replaced with a call to Localization.LocalizeCommandOptionValue using a unique context ID.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static LocalizeStringPair COV(
	string engilsh
)
Public Shared Function COV (
	engilsh As String
) As LocalizeStringPair
Parameters
engilsh
Type: System.String
[in] The English string to localize.
Return Value
Type: LocalizeStringPair
Returns localized string pair with both the English and local names set to the English value.
See Also
Reference
LOC Class
COV Overload
Rhino.UI Namespace