RhinoCommon SDK
Mesh.ColorAt Method (Int32, Double, Double, Double, Double)
Rhino for Mac 5.1
 Evaluate a mesh normal at a set of barycentric coordinates. Barycentric coordinates must be assigned in accordance with the rules as defined by MeshPoint.T.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color ColorAt(
	int faceIndex,
	double t0,
	double t1,
	double t2,
	double t3
)
Public Function ColorAt (
	faceIndex As Integer,
	t0 As Double,
	t1 As Double,
	t2 As Double,
	t3 As Double
) As Color
Parameters
faceIndex
Type: System.Int32
Index of triangle or quad to evaluate.
t0
Type: System.Double
First barycentric coordinate.
t1
Type: System.Double
Second barycentric coordinate.
t2
Type: System.Double
Third barycentric coordinate.
t3
Type: System.Double
Fourth barycentric coordinate. If the face is a triangle, this coordinate will be ignored.
Return Value
Type: Color
The interpolated vertex color on the mesh or Color.Transparent if the faceIndex is not valid, if the barycentric coordinates could not be evaluated, or if there are no colors defined on the mesh.
See Also
Reference
Mesh Class
ColorAt Overload
Rhino.Geometry Namespace