RhinoCommon SDK
ReplayHistoryResult.UpdateToAngularDimension Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToAngularDimension(Rhino.Geometry.AngularDimension,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToAngularDimension(
	AngularDimension dimension,
	ObjectAttributes attributes
)
Public Function UpdateToAngularDimension (
	dimension As AngularDimension,
	attributes As ObjectAttributes
) As Boolean
Parameters
dimension
Type: Rhino.Geometry.AngularDimension
[Missing <param name="dimension"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToAngularDimension(Rhino.Geometry.AngularDimension,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToAngularDimension(Rhino.Geometry.AngularDimension,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToAngularDimension(Rhino.Geometry.AngularDimension,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace