RhinoCommon SDK
PipeCapMode Enumeration
Rhino for Mac 5.1
 constansts used for CreatePipe functions
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum PipeCapMode
Public Enumeration PipeCapMode
Members
Member name | Value | Description
None | 0 |  No cap
Flat | 1 |  Cap with planar surface
Round | 2 |  Cap with hemispherical surface
See Also
Reference
Rhino.Geometry Namespace