RhinoCommon SDK
MeshVertexList.Add Method (Point3f)
Rhino for Mac 5.1
 Adds a new vertex to the end of the Vertex list.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	Point3f vertex
)
Public Function Add (
	vertex As Point3f
) As Integer
Parameters
vertex
Type: Rhino.Geometry.Point3f
Location of new vertex.
Return Value
Type: Int32
The index of the newly added vertex.
See Also
Reference
MeshVertexList Class
Add Overload
Rhino.Geometry.Collections Namespace