RhinoCommon SDK
RhinoViewport.SetWallpaper Method
Rhino for Mac 5.1
Overload List
Name | Description
SetWallpaper(String, Boolean)
SetWallpaper(String, Boolean, Boolean)
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace