RhinoCommon SDK
VisualAnalysisMode.RhinoDraftAngleAnalysisModeId Property
Rhino for Mac 5.1
 Id for Rhino's built-in draft angle analysis mode. Draft angle is displayed using false colors.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid RhinoDraftAngleAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoDraftAngleAnalysisModeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace