RhinoCommon SDK
RhinoObject.RuntimeSerialNumber Property
Rhino for Mac 5.1
 Gets the objects runtime serial number.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public uint RuntimeSerialNumber { get; }
Public ReadOnly Property RuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace