RhinoCommon SDK
DetailView Constructor
Rhino for Mac 5.1
 Protected serialization constructor for internal use.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected DetailView(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
Data to be serialized.
context
Type: System.Runtime.Serialization.StreamingContext
Serialization stream.
See Also
Reference
DetailView Class
Rhino.Geometry Namespace