RhinoCommon SDK
ObjectPropertiesPage Properties
Rhino for Mac 5.1
The ObjectPropertiesPage type exposes the following members.
Properties
Name | Description
EnglishPageTitle
Icon
LocalPageTitle
PageControl
 Return the control that represents this page. This will typically be a custom user control.
SelectedObjects
 Return a list of Rhino objects to be processed by this object properties page
Top
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace