RhinoCommon SDK
Brep.GetWireframe Method
Rhino for Mac 5.1
 Constructs all the Wireframe curves for this Brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] GetWireframe(
	int density
)
Public Function GetWireframe (
	density As Integer
) As Curve()
Parameters
density
Type: System.Int32
Wireframe density. Valid values range between -1 and 99.
Return Value
Type: Curve[]
An array of Wireframe curves or null on failure.
See Also
Reference
Brep Class
Rhino.Geometry Namespace