RhinoCommon SDK
RhinoViewport.GetNearRect Method
Rhino for Mac 5.1
Get corners of near clipping plane rectangle.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d[] GetNearRect()
Public Function GetNearRect As Point3d()
Return Value
Type: Point3d[]
 [left_bottom, right_bottom, left_top, right_top] points on success null on failure.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace