RhinoCommon SDK
GetBaseClass.AcceptUndo Method
Rhino for Mac 5.1
 If you want to allow the user to have an 'undo' option in GetPoint.Get(), GetObject.GetObjects(), etc., then call AcceptUndo(true) beforehand.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AcceptUndo(
	bool enable
)
Public Sub AcceptUndo (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true if user is able to choose the 'Undo' option.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace