RhinoCommon SDK
BinaryArchiveReader.ReadObjRef Method
Rhino for Mac 5.1
 Reads a ObjRef from the archive
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjRef ReadObjRef()
Public Function ReadObjRef As ObjRef
Return Value
Type: ObjRef
the element that was read
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace