RhinoCommon SDK
ObjectAttributes.GetGroupList Method
Rhino for Mac 5.1
 Returns an array of GroupCount group indices. If GroupCount is zero, then GetGroupList() returns null.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] GetGroupList()
Public Function GetGroupList As Integer()
Return Value
Type: Int32[]
An array of group indices. null might be retuned in place of an empty array.
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace