RhinoCommon SDK
Curve.GetLength Method (Double)
Rhino for Mac 5.1
Get the length of the curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double GetLength(
	double fractionalTolerance
)
Public Function GetLength (
	fractionalTolerance As Double
) As Double
Parameters
fractionalTolerance
Type: System.Double
 Desired fractional precision. fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
Return Value
Type: Double
The length of the curve on success, or zero on failure.
See Also
Reference
Curve Class
GetLength Overload
Rhino.Geometry Namespace