RhinoCommon SDK
Linetype Constructor
Rhino for Mac 5.1
Initializes a new instance of the Linetype class
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Linetype()
Public Sub New
See Also
Reference
Linetype Class
Linetype Overload
Rhino.DocObjects Namespace