RhinoCommon SDK
CustomMeshObject.Dispose Method
Rhino for Mac 5.1
Releases all resources used by the CustomMeshObject
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
CustomMeshObject Class
Dispose Overload
Rhino.DocObjects.Custom Namespace