RhinoCommon SDK
Plane.Flip Method
Rhino for Mac 5.1
 Flip this plane by swapping out the X and Y axes and inverting the Z axis.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Flip()
Public Sub Flip
See Also
Reference
Plane Structure
Rhino.Geometry Namespace