RhinoCommon SDK
File3dm.Dump Method
Rhino for Mac 5.1
Prepares a text dump of the entire model.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Dump()
Public Function Dump As String
Return Value
Type: String
The text dump.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace