RhinoCommon SDK
Arc Constructor (Point3d, Point3d, Point3d)
Rhino for Mac 5.1
 Initializes a new arc through three points. If the points are coincident or colinear, this will result in an Invalid arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Arc(
	Point3d startPoint,
	Point3d pointOnInterior,
	Point3d endPoint
)
Public Sub New (
	startPoint As Point3d,
	pointOnInterior As Point3d,
	endPoint As Point3d
)
Parameters
startPoint
Type: Rhino.Geometry.Point3d
Start point of arc.
pointOnInterior
Type: Rhino.Geometry.Point3d
Point on arc interior.
endPoint
Type: Rhino.Geometry.Point3d
End point of arc.
See Also
Reference
Arc Structure
Arc Overload
Rhino.Geometry Namespace