RhinoCommon SDK
DisplayMaterial.SetBitmapTexture Method (String, Boolean)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayMaterial.SetBitmapTexture(System.String,System.Boolean)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetBitmapTexture(
	string filename,
	bool front
)
Public Function SetBitmapTexture (
	filename As String,
	front As Boolean
) As Boolean
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.Display.DisplayMaterial.SetBitmapTexture(System.String,System.Boolean)"]
front
Type: System.Boolean
[Missing <param name="front"/> documentation for "M:Rhino.Display.DisplayMaterial.SetBitmapTexture(System.String,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.DisplayMaterial.SetBitmapTexture(System.String,System.Boolean)"]
See Also
Reference
DisplayMaterial Class
SetBitmapTexture Overload
Rhino.Display Namespace