RhinoCommon SDK
Polyline.Smooth Method
Rhino for Mac 5.1
 Smoothens the polyline segments by averaging adjacent vertices. Smoothing requires a polyline with exclusively valid vertices.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Smooth(
	double amount
)
Public Function Smooth (
	amount As Double
) As Boolean
Parameters
amount
Type: System.Double
Amount to smooth. Zero equals no smoothing, one equals complete smoothing.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace