RhinoCommon SDK
InstanceDefinitionTable.GetUnusedInstanceDefinitionName Method (String, UInt32)
Rhino for Mac 5.1
 Gets unsed instance definition name used as default when creating new instance definitions.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string GetUnusedInstanceDefinitionName(
	string root,
	uint defaultSuffix
)
Public Function GetUnusedInstanceDefinitionName (
	root As String,
	defaultSuffix As UInteger
) As String
Parameters
root
Type: System.String
 The returned name is 'root nn' If root is empty, then 'Block' (localized) is used.
defaultSuffix
Type: System.UInt32
 Unique names are created by appending a decimal number to the localized term for "Block" as in "Block 01", "Block 02", and so on. When defaultSuffix is supplied, the search for an unused name begins at "Block suffix".
Return Value
Type: String
An unused instance definition name string.
See Also
Reference
InstanceDefinitionTable Class
GetUnusedInstanceDefinitionName Overload
Rhino.DocObjects.Tables Namespace