RhinoCommon SDK
DisplayPipeline.DrawSphere Method (Sphere, Color, Int32)
Rhino for Mac 5.1
 Draw a wireframe sphere.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawSphere(
	Sphere sphere,
	Color color,
	int thickness
)
Public Sub DrawSphere (
	sphere As Sphere,
	color As Color,
	thickness As Integer
)
Parameters
sphere
Type: Rhino.Geometry.Sphere
Sphere to draw.
color
Type: System.Drawing.Color
Color to draw with.
thickness
Type: System.Int32
Thickness (in pixels) of Sphere wires.
See Also
Reference
DisplayPipeline Class
DrawSphere Overload
Rhino.Display Namespace