RhinoCommon SDK
BrepFace.SetMesh Method
Rhino for Mac 5.1
 Sets a reference to a specified type of mesh for this brep face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetMesh(
	MeshType meshType,
	Mesh mesh
)
Public Function SetMesh (
	meshType As MeshType,
	mesh As Mesh
) As Boolean
Parameters
meshType
Type: Rhino.Geometry.MeshType
The mesh type.
mesh
Type: Rhino.Geometry.Mesh
The new mesh.
Return Value
Type: Boolean
true if the operation succeeded; otherwise false.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace