RhinoCommon SDK
ReplayHistoryResult.UpdateToTextDot Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToTextDot(Rhino.Geometry.TextDot,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToTextDot(
	TextDot dot,
	ObjectAttributes attributes
)
Public Function UpdateToTextDot (
	dot As TextDot,
	attributes As ObjectAttributes
) As Boolean
Parameters
dot
Type: Rhino.Geometry.TextDot
[Missing <param name="dot"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToTextDot(Rhino.Geometry.TextDot,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToTextDot(Rhino.Geometry.TextDot,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToTextDot(Rhino.Geometry.TextDot,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace