RhinoCommon SDK
MeshPart Class
Rhino for Mac 5.1
 Represents a portion of a mesh for partitioning
Inheritance Hierarchy
System.Object
 Rhino.Geometry.MeshPart
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MeshPart
Public Class MeshPart
The MeshPart type exposes the following members.
Properties
Name | Description
EndFaceIndex
End of subinterval of parent mesh face array
EndVertexIndex
End of subinterval of parent mesh vertex array
StartFaceIndex
Start of subinterval of parent mesh face array
StartVertexIndex
Start of subinterval of parent mesh vertex array
TriangleCount
VertexCount
EndVertexIndex - StartVertexIndex
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace