RhinoCommon SDK
OptionToggle.Finalize Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.Custom.OptionToggle.Finalize"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
See Also
Reference
OptionToggle Class
Rhino.Input.Custom Namespace