RhinoCommon SDK
PointCloudObject.DuplicatePointCloudGeometry Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.PointCloudObject.DuplicatePointCloudGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PointCloud DuplicatePointCloudGeometry()
Public Function DuplicatePointCloudGeometry As PointCloud
Return Value
Type: PointCloud
[Missing <returns> documentation for "M:Rhino.DocObjects.PointCloudObject.DuplicatePointCloudGeometry"]
See Also
Reference
PointCloudObject Class
Rhino.DocObjects Namespace