RhinoCommon SDK
GumballAppearanceSettings.TranslateZEnabled Property
Rhino for Mac 5.1
 TranslateZEnabled is true, the Z axis translation control is available. The default setting is true.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TranslateZEnabled { get; set; }
Public Property TranslateZEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace