RhinoCommon SDK
BrepTrimList.GetEnumerator Method
Rhino for Mac 5.1
 Gets an enumerator that visits all edges.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<BrepTrim> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepTrim)
Return Value
Type: IEnumerator<BrepTrim>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
BrepTrimList Class
Rhino.Geometry.Collections Namespace