RhinoCommon SDK
ConstructionPlane Constructor
Rhino for Mac 5.1
 Initializes a new instance of ConstructionPlane.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ConstructionPlane()
Public Sub New
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace