RhinoCommon SDK
DisplayPipeline.DepthMode Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.DepthMode"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DepthMode DepthMode { get; set; }
Public Property DepthMode As DepthMode
	Get
	Set
Property Value
Type: DepthMode
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace