RhinoCommon SDK
IPanelsService Methods
Rhino for Mac 5.1
The IPanelsService type exposes the following members.
Methods
Name | Description
ClosePanel
GetOpenPanelIds
GetPanel
IsPanelVisible
OpenPanel(Guid)
OpenPanel(Guid, Guid)
OpenPanelAsSibling
PanelDockBar
RegisterPanel
Top
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace