RhinoCommon SDK
BezierCurve Constructor (IEnumerable<Point2d>)
Rhino for Mac 5.1
 Create bezier curve with controls defined by a list of 2d points
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BezierCurve(
	IEnumerable<Point2d> controlPoints
)
Public Sub New (
	controlPoints As IEnumerable(Of Point2d)
)
Parameters
controlPoints
Type: System.Collections.Generic.IEnumerable<Point2d>
See Also
Reference
BezierCurve Class
BezierCurve Overload
Rhino.Geometry Namespace