RhinoCommon SDK
Light.Location Property
Rhino for Mac 5.1
 Gets or sets the light or 3D position or location.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d Location { get; set; }
Public Property Location As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Light Class
Rhino.Geometry Namespace