RhinoCommon SDK
PointCloudItem.X Property
Rhino for Mac 5.1
 Gets or sets the X component of this point cloud item location.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace