RhinoCommon SDK
MeshFace Methods
Rhino for Mac 5.1
The MeshFace type exposes the following members.
Methods
Name | Description
Flip
 Reverses the orientation of the face by swapping corners. The first corner is always maintained.
IsValid()
 Gets a value indicating whether or not this mesh face is considered to be valid. Note that even valid mesh faces could potentially be invalid in the context of a specific Mesh, if one or more of the corner indices exceeds the number of vertices on the mesh. If you want to perform a complete validity check, use IsValid(int) instead.
IsValid(Int32)
 Gets a value indicating whether or not this mesh face is considered to be valid. Unlike the simple IsValid function, this function takes upper bound indices into account.
Set(Int32, Int32, Int32)
 Sets all the corners for this face as a triangle.
Set(Int32, Int32, Int32, Int32)
 Sets all the corners for this face as a quad.
Top
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace