RhinoCommon SDK
PickContext.GetObjectUsed Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.PickContext.GetObjectUsed"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GetObject GetObjectUsed { get; }
Public ReadOnly Property GetObjectUsed As GetObject
	Get
Property Value
Type: GetObject
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace