RhinoCommon SDK
LayerTable.Undelete Method
Rhino for Mac 5.1
 Undeletes a layer that has been deleted by DeleteLayer().
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Undelete(
	int layerIndex
)
Public Function Undelete (
	layerIndex As Integer
) As Boolean
Parameters
layerIndex
Type: System.Int32
 zero based index of layer to undelete. This must be in the range 0 <= layerIndex < LayerTable.Count.
Return Value
Type: Boolean
true if successful.
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace