RhinoCommon SDK
ReplayHistoryResult.UpdateToPointCloud Method (PointCloud, ObjectAttributes)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToPointCloud(Rhino.Geometry.PointCloud,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToPointCloud(
	PointCloud cloud,
	ObjectAttributes attributes
)
Public Function UpdateToPointCloud (
	cloud As PointCloud,
	attributes As ObjectAttributes
) As Boolean
Parameters
cloud
Type: Rhino.Geometry.PointCloud
[Missing <param name="cloud"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToPointCloud(Rhino.Geometry.PointCloud,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToPointCloud(Rhino.Geometry.PointCloud,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToPointCloud(Rhino.Geometry.PointCloud,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
UpdateToPointCloud Overload
Rhino.DocObjects Namespace