RhinoCommon SDK
Material Methods
Rhino for Mac 5.1
The Material type exposes the following members.
Methods
Name | Description
CommitChanges
Default
 Set material to default settings.
GetBitmapTexture
GetBumpTexture
 Gets the bump texture of this material.
GetEnvironmentTexture
GetTextures
 Get array of textures that this material uses
GetTransparencyTexture
GetUserString
 Gets a user string.
GetUserStrings
 Gets an independent copy of the collection of (user text key, user text value) pairs attached to this object.
OnSwitchToNonConst |  (Overrides CommonObject.OnSwitchToNonConst().)
SetBitmapTexture(String)
SetBitmapTexture(Texture)
SetBumpTexture(String)
SetBumpTexture(Texture)
SetEnvironmentTexture(String)
SetEnvironmentTexture(Texture)
SetTransparencyTexture(String)
SetTransparencyTexture(Texture)
SetUserString
 Attach a user string (key,value combination) to this geometry.
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace