RhinoCommon SDK
PointCloud Class
Rhino for Mac 5.1
 Represents a collection of coordinates with optional normal vectors and colors.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.PointCloud
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class PointCloud : GeometryBase, IEnumerable<PointCloudItem>,
	IEnumerable
<SerializableAttribute>
Public Class PointCloud
	Inherits GeometryBase
	Implements IEnumerable(Of PointCloudItem), IEnumerable
The PointCloud type exposes the following members.
Constructors
Name | Description
PointCloud()
 Initializes a new instance of the PointCloud class that is empty.
PointCloud(IEnumerable<Point3d>)
 Initializes a new instance of the PointCloud class, copying the content from a set of points.
PointCloud(PointCloud)
 Initializes a new instance of the PointCloud class, copying (Merge) the content of another pointcloud.
PointCloud(SerializationInfo, StreamingContext)
 Binds with the Rhino default serializer to support object persistence.
Top
Properties
Name | Description
ContainsColors
 Gets a value indicating whether or not the points in this pointcloud have colors assigned to them.
ContainsHiddenFlags
 Gets a value indicating whether or not the points in this pointcloud have hidden flags assigned to them.
ContainsNormals
 Gets a value indicating whether or not the points in this pointcloud have normals assigned to them.
Count
 Gets the number of points in this pointcloud.
HiddenPointCount
 Gets the number of points that have their Hidden flag set.
Item
 Gets the item at the given index.
Top
Methods
Name | Description
Add(Point3d)
 Append a new point to the end of the list.
Add(Point3d, Vector3d)
 Append a new point to the end of the list.
Add(Point3d, Color)
 Append a new point to the end of the list.
Add(Point3d, Vector3d, Color)
 Append a new point to the end of the list.
AddRange
 Append a collection of points to this point cloud.
AppendNew
 Appends a new PointCloudItem to the end of this point cloud.
ClearColors
 Destroys the color information in this point cloud.
ClearHiddenFlags
 Destroys the hidden flag information in this point cloud.
ClearNormals
 Destroys the normal vector information in this point cloud.
ClosestPoint
 Returns index of the closest point in the point cloud to a given test point.
GetColors
 Copy all the point colors in this point cloud to an array.
GetEnumerator
 Gets an enumerator that allows to modify each pointcloud point.
GetNormals
 Copy all the normal vectors in this point cloud to an array.
GetPoints
 Copy all the point coordinates in this point cloud to an array.
Insert(Int32, Point3d)
 Inserts a new point into the point list.
Insert(Int32, Point3d, Vector3d)
 Inserts a new point into the point list.
Insert(Int32, Point3d, Color)
 Inserts a new point into the point list.
Insert(Int32, Point3d, Vector3d, Color)
 Inserts a new point into the point list.
InsertNew
 Inserts a new PointCloudItem at a specific position of the point cloud.
InsertRange
 Append a collection of points to this point cloud.
Merge
 Copies the point values of another pointcloud into this one.
RemoveAt
 Remove the point at the given index.
Top
See Also
Reference
Rhino.Geometry Namespace