RhinoCommon SDK
BoundingBox.Center Property
Rhino for Mac 5.1
 Gets the point in the center of the boundingbox.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d Center { get; }
Public ReadOnly Property Center As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace