RhinoCommon SDK
MeshFaceList Class
Rhino for Mac 5.1
 Provides access to the faces and Face related functionality of a Mesh.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.MeshFaceList
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MeshFaceList : IEnumerable<MeshFace>,
	IEnumerable
Public Class MeshFaceList
	Implements IEnumerable(Of MeshFace), IEnumerable
The MeshFaceList type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of mesh faces.
Item
 Returns the mesh face at the given index.
QuadCount
 Gets the number of faces that are quads (4 corners).
TriangleCount
 Gets the number of faces that are triangles (3 corners).
Top
Methods
Name | Description
AddFace(MeshFace)
 Appends a new mesh face to the end of the mesh face list.
AddFace(Int32, Int32, Int32)
 Appends a new triangular face to the end of the mesh face list.
AddFace(Int32, Int32, Int32, Int32)
 Appends a new quadragular face to the end of the mesh face list.
AddFaces
 Appends a list of faces to the end of the mesh face list.
AdjacentFaces
 Gets all faces that share a topological edge with a given face.
Clear
 Clears the Face list on the mesh.
ConvertQuadsToTriangles
Splits all quads along the short diagonal.
ConvertTrianglesToQuads
 Joins adjacent triangles into quads if the resulting quad is 'nice'.
CullDegenerateFaces
 Attempts to removes degenerate faces from the mesh.
Degenerate faces are faces that contains such a combination of indices, that their final shape collapsed in a line or point.
Before returning, this method also attempts to repair faces by juggling vertex indices.
DeleteFaces
 Removes a collection of faces from the mesh without affecting the remaining geometry.
GetConnectedFaces
 Find all connected face indices where adjacent face normals meet the criteria of angleRadians and greaterThanAngle
GetConnectedFacesToEdges
 Uses startFaceIndex and finds all connected face indexes up to unwelded or naked edges. If treatNonmanifoldLikeUnwelded is true then non-manifold edges will be considered as unwelded or naked
GetEnumerator
 Gets an enumerator that yields all faces in this collection.
GetFace
 Returns the mesh face at the given index.
GetFaceAspectRatio
 Returns the mesh face at the given index.
GetFaceBoundingBox
 Gets the bounding box of a face.
GetFaceCenter
 Gets the center point of a face.
For a triangular face, this is considered the centroid or barycenter.
For a quad, this is considered the bimedians intersection (the avarage of four points).
GetFaceVertices
 Gets the 3D location of the vertices forming a face.
GetTopologicalVertices
 Gets the topology vertex indices of a face.
HasNakedEdges
 Returns true if at least one of the face edges are not topologically connected to any other faces.
Insert
 Inserts a mesh face at a defined index in this list.
IsHidden
 Gets a value indicating whether a face is hidden.
A face is hidden if, and only if, at least one of its vertices is hidden.
RemoveAt
 Removes a face from the mesh.
SetFace(Int32, MeshFace)
 Sets a face at a specific index of the mesh.
SetFace(Int32, Int32, Int32, Int32)
 Sets a triangular face at a specific index of the mesh.
SetFace(Int32, Int32, Int32, Int32, Int32)
 Sets a quadrangular face at a specific index of the mesh.
ToIntArray
 Copies all of the faces to a linear integer of indices
Top
See Also
Reference
Rhino.Geometry.Collections Namespace