RhinoCommon SDK
ZBufferCapture.SetDisplayMode Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.SetDisplayMode(System.Guid)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetDisplayMode(
	Guid modeId
)
Public Sub SetDisplayMode (
	modeId As Guid
)
Parameters
modeId
Type: System.Guid
[Missing <param name="modeId"/> documentation for "M:Rhino.Display.ZBufferCapture.SetDisplayMode(System.Guid)"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace