RhinoCommon SDK
ObjectAttributes.LinetypeSource Property
Rhino for Mac 5.1
 The Linetype used to display an object is specified in one of two ways. If LinetypeSource is ON::linetype_from_layer, then the object's layer ON_Layer::Linetype() is used. If LinetypeSource is ON::linetype_from_object, then value of m_linetype is used.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectLinetypeSource LinetypeSource { get; set; }
Public Property LinetypeSource As ObjectLinetypeSource
	Get
	Set
Property Value
Type: ObjectLinetypeSource
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace