RhinoCommon SDK
RhinoObject.IsSelected Method
Rhino for Mac 5.1
Check selection state.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int IsSelected(
	bool checkSubObjects
)
Public Function IsSelected (
	checkSubObjects As Boolean
) As Integer
Parameters
checkSubObjects
Type: System.Boolean
 (false is good default) If true and the entire object is not selected, and some subset of the object is selected, like some edges of a surface, then 3 is returned. If false and the entire object is not selected, then zero is returned.
Return Value
Type: Int32
 0 = object is not selected. 1 = object is selected. 2 = entire object is selected persistently. 3 = one or more proper sub-objects are selected.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace