RhinoCommon SDK
Linetype.AppendSegment Method
Rhino for Mac 5.1
Adds a segment to the pattern.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AppendSegment(
	double length,
	bool isSolid
)
Public Function AppendSegment (
	length As Double,
	isSolid As Boolean
) As Integer
Parameters
length
Type: System.Double
The length of the segment to be added.
isSolid
Type: System.Boolean
 If true, the length is interpreted as a line. If false, then the length is interpreted as a space.
Return Value
Type: Int32
Index of the added segment.
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace