RhinoCommon SDK
PolylineCurve.SetPoint Method
Rhino for Mac 5.1
 Sets a point at a specified index in the polyline curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetPoint(
	int index,
	Point3d point
)
Public Sub SetPoint (
	index As Integer,
	point As Point3d
)
Parameters
index
Type: System.Int32
An index.
point
Type: Rhino.Geometry.Point3d
A point location to set.
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace