RhinoCommon SDK
Surface.IsPlanar Method (Double)
Rhino for Mac 5.1
 Tests a surface to see if it is planar to a given tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsPlanar(
	double tolerance
)
Public Function IsPlanar (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
 true if there is a plane such that the maximum distance from the surface to the plane is <= tolerance.
See Also
Reference
Surface Class
IsPlanar Overload
Rhino.Geometry Namespace