RhinoCommon SDK
VisualAnalysisMode.DrawBrepObject Method
Rhino for Mac 5.1
 Draws one brep. Override this method to add your custom behavior.
The default implementation does nothing.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void DrawBrepObject(
	BrepObject brep,
	DisplayPipeline pipeline
)
Protected Overridable Sub DrawBrepObject (
	brep As BrepObject,
	pipeline As DisplayPipeline
)
Parameters
brep
Type: Rhino.DocObjects.BrepObject
A brep object.
pipeline
Type: Rhino.Display.DisplayPipeline
The current display pipeline.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace