RhinoCommon SDK
DisplayPipelineAttributes Methods
Rhino for Mac 5.1
The DisplayPipelineAttributes type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
GetObjectData
Top
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace