RhinoCommon SDK
File3dmObject Class
Rhino for Mac 5.1
 Used to store geometry table object definition and attributes in a File3dm.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmObject
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class File3dmObject
Public Class File3dmObject
The File3dmObject type exposes the following members.
Properties
Name | Description
Attributes
 Gets the attributes that are linked with this document object.
Geometry
 Gets the geometry that is linked with this document object.
Name
 Gets or sets the Name of the object. Equivalent to this.Attributes.Name.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace