RhinoCommon SDK
RhinoViewport.IsPlanView Property
Rhino for Mac 5.1
 true if construction plane z axis is parallel to camera direction.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsPlanView { get; }
Public ReadOnly Property IsPlanView As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace