RhinoCommon SDK
File3dmHistoryRecordTable Class
Rhino for Mac 5.1
 Table of custom data provided by plug-ins
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmHistoryRecordTable
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class File3dmHistoryRecordTable
Public Class File3dmHistoryRecordTable
The File3dmHistoryRecordTable type exposes the following members.
Properties
Name | Description
Count
 Gets the number of history records in this table.
Top
Methods
Name | Description
Clear
 Remove all entries from this table
Dump
Prepares a text dump of table.
Top
See Also
Reference
Rhino.FileIO Namespace