RhinoCommon SDK
RhinoObject.OnPick Method
Rhino for Mac 5.1
 Called to determine if this object or some sub-portion of this object should be picked given a pick context.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual IEnumerable<ObjRef> OnPick(
	PickContext context
)
Protected Overridable Function OnPick (
	context As PickContext
) As IEnumerable(Of ObjRef)
Parameters
context
Type: Rhino.Input.Custom.PickContext
[Missing <param name="context"/> documentation for "M:Rhino.DocObjects.RhinoObject.OnPick(Rhino.Input.Custom.PickContext)"]
Return Value
Type: IEnumerable<ObjRef>
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.OnPick(Rhino.Input.Custom.PickContext)"]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace