RhinoCommon SDK
BinaryArchiveWriter.WriteBoolArray Method
Rhino for Mac 5.1
 Writes a list, an array, or any enumerable of Boolean to the archive.
The return will always be an array.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteBoolArray(
	IEnumerable<bool> value
)
Public Sub WriteBoolArray (
	value As IEnumerable(Of Boolean)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<Boolean>
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace