RhinoCommon SDK
Plane.ExtendThroughBox Method (BoundingBox, Interval, Interval)
Rhino for Mac 5.1
 Extends this plane through a bounding box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ExtendThroughBox(
	BoundingBox box,
	out Interval s,
	out Interval t
)
Public Function ExtendThroughBox (
	box As BoundingBox,
	<OutAttribute> ByRef s As Interval,
	<OutAttribute> ByRef t As Interval
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
A box to use as minimal extension boundary.
s
Type: Rhino.Geometry.Interval
 If this function returns true, the s parameter returns the Interval on the plane along the X direction that will encompass the Box.
t
Type: Rhino.Geometry.Interval
 If this function returns true, the t parameter returns the Interval on the plane along the Y direction that will encompass the Box.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Plane Structure
ExtendThroughBox Overload
Rhino.Geometry Namespace