RhinoCommon SDK
File3dmPlugInDataTable.Clear Method
Rhino for Mac 5.1
 Remove all entries from this table
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace