RhinoCommon SDK
DisplayConduit Constructor
Rhino for Mac 5.1
Initializes a new instance of the DisplayConduit class
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected DisplayConduit()
Protected Sub New
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace