RhinoCommon SDK
PointObject.DuplicatePointGeometry Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.PointObject.DuplicatePointGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point DuplicatePointGeometry()
Public Function DuplicatePointGeometry As Point
Return Value
Type: Point
[Missing <returns> documentation for "M:Rhino.DocObjects.PointObject.DuplicatePointGeometry"]
See Also
Reference
PointObject Class
Rhino.DocObjects Namespace