RhinoCommon SDK
File3dm.DumpSummary Method
Rhino for Mac 5.1
Prepares a text dump of model properties and settings.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string DumpSummary()
Public Function DumpSummary As String
Return Value
Type: String
The text dump.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace