RhinoCommon SDK
BinaryArchiveReader.ReadFont Method
Rhino for Mac 5.1
 Reads a Font from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Font ReadFont()
Public Function ReadFont As Font
Return Value
Type: Font
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace