RhinoCommon SDK
FlowSpaceMorph Constructor (Curve, Curve, Boolean, Boolean, Boolean)
Rhino for Mac 5.1
 Constructs a flow space morph.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public FlowSpaceMorph(
	Curve curve0,
	Curve curve1,
	bool reverseCurve0,
	bool reverseCurve1,
	bool preventStretching
)
Public Sub New (
	curve0 As Curve,
	curve1 As Curve,
	reverseCurve0 As Boolean,
	reverseCurve1 As Boolean,
	preventStretching As Boolean
)
Parameters
curve0
Type: Rhino.Geometry.Curve
Base curve.
curve1
Type: Rhino.Geometry.Curve
Target curve.
reverseCurve0
Type: System.Boolean
If true, then direction of curve0 is reversed.
reverseCurve1
Type: System.Boolean
If true, then direction of curve1 is reversed.
preventStretching
Type: System.Boolean
If true, the length of the objects along the curve directions are not changed. If false, objects are stretched or compressed in the curve direction so that the relationship to the target curve is the same as it is to the base curve.
See Also
Reference
FlowSpaceMorph Class
FlowSpaceMorph Overload
Rhino.Geometry.Morphs Namespace