RhinoCommon SDK
PickContext Constructor
Rhino for Mac 5.1
Initializes a new instance of the PickContext class
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PickContext()
Public Sub New
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace