RhinoCommon SDK
Curve.OffsetOnSurface Method (BrepFace, Double, Double)
Rhino for Mac 5.1
 Offset this curve on a brep face surface. This curve must lie on the surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] OffsetOnSurface(
	BrepFace face,
	double distance,
	double fittingTolerance
)
Public Function OffsetOnSurface (
	face As BrepFace,
	distance As Double,
	fittingTolerance As Double
) As Curve()
Parameters
face
Type: Rhino.Geometry.BrepFace
The brep face on which to offset.
distance
Type: System.Double
A distance to offset (+)left, (-)right.
fittingTolerance
Type: System.Double
A fitting tolerance.
Return Value
Type: Curve[]
Offset curves on success, or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | If face is null.
See Also
Reference
Curve Class
OffsetOnSurface Overload
Rhino.Geometry Namespace