RhinoCommon SDK
BrepObject.BrepGeometry Property
Rhino for Mac 5.1
 Gets the brep geometry linked with this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep BrepGeometry { get; }
Public ReadOnly Property BrepGeometry As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepObject Class
Rhino.DocObjects Namespace