RhinoCommon SDK
Curve.ClosedCurveOrientation Method (Vector3d)
Rhino for Mac 5.1
 Determines the orientation (counterclockwise or clockwise) of a closed planar curve in a given plane. Only works with simple (no self intersections) closed planar curves.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public CurveOrientation ClosedCurveOrientation(
	Vector3d upDirection
)
Public Function ClosedCurveOrientation (
	upDirection As Vector3d
) As CurveOrientation
Parameters
upDirection
Type: Rhino.Geometry.Vector3d
A vector that is considered "up".
Return Value
Type: CurveOrientation
The orientation of this curve with respect to a defined up direction.
See Also
Reference
Curve Class
ClosedCurveOrientation Overload
Rhino.Geometry Namespace