RhinoCommon SDK
Curve.ClosedCurveOrientation Method (Transform)
Rhino for Mac 5.1
 Determines the orientation (counterclockwise or clockwise) of a closed planar curve. Only works with simple (no self intersections) closed planar curves.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public CurveOrientation ClosedCurveOrientation(
	Transform xform
)
Public Function ClosedCurveOrientation (
	xform As Transform
) As CurveOrientation
Parameters
xform
Type: Rhino.Geometry.Transform
 Transformation to map the curve to the xy plane. If the curve is parallel to the xy plane, you may pass Identity matrix.
Return Value
Type: CurveOrientation
The orientation of this curve in the world xy-plane.
See Also
Reference
Curve Class
ClosedCurveOrientation Overload
Rhino.Geometry Namespace