RhinoCommon SDK
BrepFace.IsSurface Property
Rhino for Mac 5.1
 Gets a value indicating whether the face is synonymous with the underlying surface. If a Face has no trimming curves then it is considered a Surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSurface { get; }
Public ReadOnly Property IsSurface As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace