RhinoCommon SDK
Mesh Methods
Rhino for Mac 5.1
The Mesh type exposes the following members.
Methods
Name | Description
Append
 Appends a copy of another mesh to this one and updates indices of appended mesh parts.
ClearTextureData
 Remove all texture coordinate information from this mesh.
ClosestMeshPoint
 Gets the point on the mesh that is closest to a given test point. Similar to the ClosestPoint function except this returns a MeshPoint class which includes extra information beyond just the location of the closest point.
ClosestPoint(Point3d)
 Gets the point on the mesh that is closest to a given test point.
ClosestPoint(Point3d, Point3d, Double)
 Gets the point on the mesh that is closest to a given test point.
ClosestPoint(Point3d, Point3d, Vector3d, Double)
 Gets the point on the mesh that is closest to a given test point.
CollapseFacesByArea
 Collapses multiple mesh faces, with areas less than LessThanArea and greater than GreaterThanArea, based on the principles found in Stan Melax's mesh reduction PDF, see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
CollapseFacesByByAspectRatio
 Collapses a multiple mesh faces, determined by face aspect ratio, based on criteria found in Stan Melax's polygon reduction, see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
CollapseFacesByEdgeLength
 Collapses multiple mesh faces, with greater/less than edge length, based on the principles found in Stan Melax's mesh reduction PDF, see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
ColorAt(MeshPoint)
 Evaluate a mesh color at a set of barycentric coordinates.
ColorAt(Int32, Double, Double, Double, Double)
 Evaluate a mesh normal at a set of barycentric coordinates. Barycentric coordinates must be assigned in accordance with the rules as defined by MeshPoint.T.
Compact
 Removes any unreferenced objects from arrays, reindexes as needed and shrinks arrays to minimum required size.
CopyFrom
 Copies mesh values into this mesh from another mesh.
CreateBooleanDifference
 Computes the solid difference of two sets of Meshes.
CreateBooleanIntersection
 Computes the solid intersection of two sets of meshes.
CreateBooleanSplit
 Splits a set of meshes with another set.
CreateBooleanUnion
 Computes the solid union of a set of meshes.
CreateContourCurves(Mesh, Plane)
 Constructs contour curves for a mesh, sectioned at a plane.
CreateContourCurves(Mesh, Point3d, Point3d, Double)
 Constructs contour curves for a mesh, sectioned along a linear axis.
CreateFromBox(BoundingBox, Int32, Int32, Int32)
 Constructs new mesh that matches a bounding box.
CreateFromBox(Box, Int32, Int32, Int32)
 Constructs new mesh that matches an aligned box.
CreateFromBox(IEnumerable<Point3d>, Int32, Int32, Int32)
 Constructs new mesh from 8 corner points.
CreateFromBrep(Brep)
 Constructs a mesh from a brep.
CreateFromBrep(Brep, MeshingParameters)
 Constructs a mesh from a brep.
CreateFromClosedPolyline
 Attempts to create a Mesh that is a triangulation of a closed polyline
CreateFromCone
Constructs a mesh cone
CreateFromCylinder
Constructs a mesh cylinder
CreateFromPlanarBoundary
 Attempts to construct a mesh from a closed planar curve.
CreateFromPlane
 Constructs a planar mesh grid.
CreateFromSphere
 Constructs a mesh sphere.
CreatePartitions
 In ancient times (or modern smartphone times), some rendering engines were only able to process small batches of triangles and the CreatePartitions() function was provided to partition the mesh into subsets of vertices and faces that those rendering engines could handle.
Duplicate
 Constructs a copy of this mesh. This is the same as DuplicateMesh().
 (Overrides GeometryBase.Duplicate().)
DuplicateMesh
Constructs a copy of this mesh. This is the same as Duplicate().
EvaluateMeshGeometry
 If the mesh has SurfaceParameters, the surface is evaluated at these parameters and the mesh geometry is updated.
ExplodeAtUnweldedEdges
 Explode the mesh into submeshes where a submesh is a collection of faces that are contained within a closed loop of "unwelded" edges. Unwelded edges are edges where the faces that share the edge have unique mesh vertexes (not mesh topology vertexes) at both ends of the edge.
Flip
Reverses the direction of the mesh.
GetCachedTextureCoordinates
 Call this method to get cached texture coordinates for a texture mapping with the specified Id.
GetNakedEdgePointStatus
 Returns an array of bool values equal in length to the number of vertices in this mesh. Each value corresponds to a mesh vertex and is set to true if the vertex is not completely surrounded by faces.
GetNakedEdges
 Returns all edges of a mesh that are considered "naked" in the sense that the edge only has one face.
GetOutlines(Plane)
 Constructs the outlines of a mesh projected against a plane.
GetOutlines(RhinoViewport)
 Constructs the outlines of a mesh. The projection information in the viewport is used to determine how the outlines are projected.
GetPartition
 Retrieves a partition. See CreatePartitions(Int32, Int32) for details.
IsManifold
 Gets a value indicating whether or not the mesh is manifold. A manifold mesh does not have any edge that borders more than two faces.
IsPointInside
 Determines if a point is inside a solid mesh.
NormalAt(MeshPoint)
 Evaluate a mesh normal at a set of barycentric coordinates.
NormalAt(Int32, Double, Double, Double, Double)
 Evaluate a mesh normal at a set of barycentric coordinates. Barycentric coordinates must be assigned in accordance with the rules as defined by MeshPoint.T.
Offset(Double)
 Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals. Same as Mesh.Offset(distance, false)
Offset(Double, Boolean)
 Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals. Optionally, based on the value of solidify, adds the input mesh and a ribbon of faces along any naked edges. If solidify is false it acts exactly as the Offset(distance) function.
OnSwitchToNonConst
 Performs some memory cleanup if necessary
 (Overrides GeometryBase.OnSwitchToNonConst().)
PointAt(MeshPoint)
 Evaluate a mesh at a set of barycentric coordinates.
PointAt(Int32, Double, Double, Double, Double)
 Evaluates a mesh at a set of barycentric coordinates. Barycentric coordinates must be assigned in accordance with the rules as defined by MeshPoint.T.
PullPointsToMesh
 Pulls a collection of points to a mesh.
Reduce
 Reduce polygon count
SetCachedTextureCoordinates
 Set cached texture coordinates using the specified mapping.
SolidOrientation
 Determines orientation of a "solid" mesh.
Split(Mesh)
 Split a mesh with another mesh.
Split(IEnumerable<Mesh>)
 Split a mesh with a collection of meshes.
Split(Plane)
 Split a mesh by an infinite plane.
SplitDisjointPieces
 Splits up the mesh into its unconnected pieces.
UnifyNormals
 Attempts to fix inconsistencies in the directions of meshfaces for a mesh. This function does not modify the vertex normals, but rather rearranges the mesh face winding and face normals to make them all consistent. You may want to call Mesh.Normals.ComputeNormals() to recompute vertex normals after calling this functions.
Unweld
 Makes sure that faces sharing an edge and having a difference of normal greater than or equal to angleToleranceRadians have unique vertexes along that edge, adding vertices if necessary.
Weld
 Makes sure that faces sharing an edge and having a difference of normal greater than or equal to angleToleranceRadians share vertexes along that edge, vertex normals are averaged.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace