RhinoCommon SDK
Point2d Constructor
Rhino for Mac 5.1
Overload List
Name | Description
Point2d(Point2d)
 Initializes a new instance of Point2d by copying another Point2d.
Point2d(Point3d)
 Initializes a new instance of Point3d by copying the first two coordiantes of a Point3d.
Point2d(Vector2d)
 Initializes a new instance of Point2d by converting a vector.
Point2d(Double, Double)
 Initializes a new instance of Point2d from coordinates.
Top
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace