RhinoCommon SDK
TextEntity.MaskEnabled Property
Rhino for Mac 5.1
 Determines whether or not to draw a Text Mask
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MaskEnabled { get; set; }
Public Property MaskEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace