RhinoCommon SDK
Curve.ExtendOnSurface Method (CurveEnd, BrepFace)
Rhino for Mac 5.1
 Extends a curve on a surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve ExtendOnSurface(
	CurveEnd side,
	BrepFace face
)
Public Function ExtendOnSurface (
	side As CurveEnd,
	face As BrepFace
) As Curve
Parameters
side
Type: Rhino.Geometry.CurveEnd
The end of the curve to extend.
face
Type: Rhino.Geometry.BrepFace
BrepFace that contains the curve.
Return Value
Type: Curve
New extended curve result on success, null on failure.
See Also
Reference
Curve Class
ExtendOnSurface Overload
Rhino.Geometry Namespace