RhinoCommon SDK
Dialogs.ShowMessageBox Method
Rhino for Mac 5.1
Overload List
Name | Description
ShowMessageBox(String, String) |  Obsolete.
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessageBox(String, String, MessageBoxButtons, MessageBoxIcon) |  Obsolete.
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
Top
See Also
Reference
Dialogs Class
Rhino.UI Namespace