RhinoCommon SDK
DisplayPipeline.DrawCurve Method (Curve, Color, Int32)
Rhino for Mac 5.1
 Draw a single Curve object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawCurve(
	Curve curve,
	Color color,
	int thickness
)
Public Sub DrawCurve (
	curve As Curve,
	color As Color,
	thickness As Integer
)
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to draw.
color
Type: System.Drawing.Color
Color to draw with.
thickness
Type: System.Int32
Thickness (in pixels) of curve.
See Also
Reference
DisplayPipeline Class
DrawCurve Overload
Rhino.Display Namespace