RhinoCommon SDK
DimensionStyle.Id Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.Id"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace