RhinoCommon SDK
GumballDisplayConduit.PreTransform Property
Rhino for Mac 5.1
 The pre-transform is a transformation that needs to be applied before the gumball transformation.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform PreTransform { get; set; }
Public Property PreTransform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace