RhinoCommon SDK
GripObject.Move Method (Transform)
Rhino for Mac 5.1
 Moves the grip to a new location.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Move(
	Transform xform
)
Public Sub Move (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
 Transformation appliead to the OriginalLocation point.
See Also
Reference
GripObject Class
Move Overload
Rhino.DocObjects Namespace