RhinoCommon SDK
Surface.IsContinuous Method
Rhino for Mac 5.1
 Tests continuity at a surface parameter value.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsContinuous(
	Continuity continuityType,
	double u,
	double v
)
Public Function IsContinuous (
	continuityType As Continuity,
	u As Double,
	v As Double
) As Boolean
Parameters
continuityType
Type: Rhino.Geometry.Continuity
The continuity type to sample.
u
Type: System.Double
Surface u parameter to test.
v
Type: System.Double
Surface v parameter to test.
Return Value
Type: Boolean
true if the surface has at least the specified continuity at the (u,v) parameter.
See Also
Reference
Surface Class
Rhino.Geometry Namespace