RhinoCommon SDK
GripsDrawEventArgs.DrawControlPolygonLine Method (Line, GripStatus, GripStatus)
Rhino for Mac 5.1
 Draws the lines in a control polygons.
This is an helper function.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawControlPolygonLine(
	Line line,
	GripStatus startStatus,
	GripStatus endStatus
)
Public Sub DrawControlPolygonLine (
	line As Line,
	startStatus As GripStatus,
	endStatus As GripStatus
)
Parameters
line
Type: Rhino.Geometry.Line
Line between two grips.
startStatus
Type: Rhino.DocObjects.Custom.GripStatus
Grip status at start of line.
endStatus
Type: Rhino.DocObjects.Custom.GripStatus
Grip status at end of line.
See Also
Reference
GripsDrawEventArgs Class
DrawControlPolygonLine Overload
Rhino.DocObjects.Custom Namespace