RhinoCommon SDK
File3dmObjectTable.AddPolyline Method
Rhino for Mac 5.1
Overload List
Name | Description
AddPolyline(IEnumerable<Point3d>)
Adds a polyline object to Rhino.
AddPolyline(IEnumerable<Point3d>, ObjectAttributes)
Adds a polyline object to Rhino.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace