RhinoCommon SDK
MaterialTable.Find Method (Guid, Boolean)
Rhino for Mac 5.1
Finds a material with a matching id.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Find(
	Guid materialId,
	bool ignoreDeletedMaterials
)
Public Function Find (
	materialId As Guid,
	ignoreDeletedMaterials As Boolean
) As Integer
Parameters
materialId
Type: System.Guid
A material ID to be found.
ignoreDeletedMaterials
Type: System.Boolean
If true, deleted materials are not checked.
Return Value
Type: Int32
 >=0 index of the material with the given name -1 no material has the given name.
See Also
Reference
MaterialTable Class
Find Overload
Rhino.DocObjects.Tables Namespace