RhinoCommon SDK
VisualAnalysisMode.RhinoEmapAnalysisModeId Property
Rhino for Mac 5.1
 Id for Rhino's built-in emap analysis mode. An environment map is shown on sufaces and meshes.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid RhinoEmapAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoEmapAnalysisModeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace