RhinoCommon SDK
ViewportInfo.FrustumCenterPoint Method
Rhino for Mac 5.1
 Return a point on the central axis of the view frustum. This point is a good choice for a general purpose target point.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d FrustumCenterPoint(
	double targetDistance
)
Public Function FrustumCenterPoint (
	targetDistance As Double
) As Point3d
Parameters
targetDistance
Type: System.Double
If targetDistance > 0.0, then the distance from the returned point to the camera plane will be targetDistance. Note that if the frustum is not symmetric, the distance from the returned point to the camera location will be larger than targetDistance. If targetDistance == ON_UNSET_VALUE and the frustum is valid with near > 0.0, then 0.5*(near + far) will be used as the targetDistance.
Return Value
Type: Point3d
A point on the frustum's central axis. If the viewport or input is not valid, then ON_3dPoint::UnsetPoint is returned.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace