RhinoCommon SDK
BrepLoop Class
Rhino for Mac 5.1
 Represent a single loop in a Brep object. A loop is composed of a list of trim curves.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.BrepLoop
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class BrepLoop : GeometryBase
Public Class BrepLoop
	Inherits GeometryBase
The BrepLoop type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this loop.
Face
 BrepFace this loop belongs to.
LoopIndex
 Gets the index of this loop in the Brep.Loops collection.
LoopType
 type of loop.
Trims
 List of trims for this loop
Top
Methods
Name | Description
To2dCurve
 Create a 2d curve that traces the entire loop
To3dCurve
 Create a 3D curve that approximates the loop geometry.
Top
See Also
Reference
Rhino.Geometry Namespace