RhinoCommon SDK
Brep.CreateFromBox Method
Rhino for Mac 5.1
Overload List
Name | Description
CreateFromBox(BoundingBox)
 Constructs new brep that matches a bounding box.
CreateFromBox(Box)
 Constructs new brep that matches an aligned box.
CreateFromBox(IEnumerable<Point3d>)
 Constructs new brep from 8 corner points.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace