RhinoCommon SDK
File3dm Methods
Rhino for Mac 5.1
The File3dm type exposes the following members.
Methods
Name | Description
Audit
 Check a model to make sure it is valid and, if possible and requested, attempt to repair.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Dump
Prepares a text dump of the entire model.
DumpSummary
Prepares a text dump of model properties and settings.
DumpToTextLog
Prepares a text dump of the entire model.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
IsValid(String)
 Checks a model to make sure it is valid.
IsValid(TextLog)
 Checks a model to make sure it is valid.
Polish
 Quickly fills in the little details, like making sure there is at least one layer and table indices make sense. For a full blown check and repair, call Audit(true).
Read(String)
 Reads a 3dm file from a specified location.
Read(String, File3dm.TableTypeFilter, File3dm.ObjectTypeFilter)
 Reads a 3dm file from a specified location.
ReadApplicationData
 Reads only the application information from an existing 3dm file.
ReadArchiveVersion
 Reads only the archive 3dm version from an existing 3dm file.
ReadNotes
Reads only the notes from an existing 3dm file.
ReadPreviewImage
 Attempts to read the preview image out of a 3dm file.
ReadRevisionHistory
 Quickly check a file for it's revision information. This function does not read the entire file, just what it needs to get revision information out
ReadWithLog(String, String)
 Read a 3dm file from a specified location and log any archive reading errors.
ReadWithLog(String, File3dm.TableTypeFilter, File3dm.ObjectTypeFilter, String)
 Reads a 3dm file from a specified location.
Write(String, File3dmWriteOptions)
 Writes contents of this model to an openNURBS archive. I STRONGLY suggested that you call Polish() before calling Write so that your file has all the "fluff" that makes it complete. If the model is not valid, then Write will refuse to write it.
Write(String, Int32)
 Writes contents of this model to an openNURBS archive. I STRONGLY suggested that you call Polish() before calling Write so that your file has all the "fluff" that makes it complete. If the model is not valid, then Write will refuse to write it.
WriteWithLog
 Writes contents of this model to an openNURBS archive. I STRONGLY suggested that you call Polish() before calling Write so that your file has all the "fluff" that makes it complete. If the model is not valid, then Write will refuse to write it.
Top
See Also
Reference
File3dm Class
Rhino.FileIO Namespace