RhinoCommon SDK
ParticleSystem.GetEnumerator Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Geometry.ParticleSystem.GetEnumerator"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<Particle> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Particle)
Return Value
Type: IEnumerator<Particle>
[Missing <returns> documentation for "M:Rhino.Geometry.ParticleSystem.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace