RhinoCommon SDK
AreaMassProperties.CentroidCoordinatesMomentsOfInertiaError Property
Rhino for Mac 5.1
 Uncertainty in centroid coordinates moments of inertia calculation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d CentroidCoordinatesMomentsOfInertiaError { get; }
Public ReadOnly Property CentroidCoordinatesMomentsOfInertiaError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace