RhinoCommon SDK
CurveOffsetCornerStyle Enumeration
Rhino for Mac 5.1
 Defines enumerated values for all implemented corner styles in curve offsets.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum CurveOffsetCornerStyle
Public Enumeration CurveOffsetCornerStyle
Members
Member name | Value | Description
None | 0 |  The dafault value.
Sharp | 1 |  Offsets and extends curves with a straight line until they intersect.
Round | 2 |  Offsets and fillets curves with an arc of radius equal to the offset distance.
Smooth | 3 |  Offsets and connects curves with a smooth (G1 continuity) curve.
Chamfer | 4 |  Offsets and connects curves with a straight line between their endpoints.
See Also
Reference
Rhino.Geometry Namespace