RhinoCommon SDK
Light.Length Property
Rhino for Mac 5.1
 Gets or sets the height in linear and rectangular lights.
(ignored for non-linear/rectangular lights.)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d Length { get; set; }
Public Property Length As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
Light Class
Rhino.Geometry Namespace