RhinoCommon SDK
Transform.Rotation Method (Vector3d, Vector3d, Vector3d, Vector3d, Vector3d, Vector3d)
Rhino for Mac 5.1
 Constructs a transformation that maps X0 to X1, Y0 to Y1, Z0 to Z1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform Rotation(
	Vector3d x0,
	Vector3d y0,
	Vector3d z0,
	Vector3d x1,
	Vector3d y1,
	Vector3d z1
)
Public Shared Function Rotation (
	x0 As Vector3d,
	y0 As Vector3d,
	z0 As Vector3d,
	x1 As Vector3d,
	y1 As Vector3d,
	z1 As Vector3d
) As Transform
Parameters
x0
Type: Rhino.Geometry.Vector3d
First "from" vector.
y0
Type: Rhino.Geometry.Vector3d
Second "from" vector.
z0
Type: Rhino.Geometry.Vector3d
Third "from" vector.
x1
Type: Rhino.Geometry.Vector3d
First "to" vector.
y1
Type: Rhino.Geometry.Vector3d
Second "to" vector.
z1
Type: Rhino.Geometry.Vector3d
Third "to" vector.
Return Value
Type: Transform
A rotation transformation value.
See Also
Reference
Transform Structure
Rotation Overload
Rhino.Geometry Namespace