RhinoCommon SDK
Transform.Rotation Method (Double, Vector3d, Point3d)
Rhino for Mac 5.1
 Constructs a new rotation transformation with specified angle, rotation center and rotation axis.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform Rotation(
	double angleRadians,
	Vector3d rotationAxis,
	Point3d rotationCenter
)
Public Shared Function Rotation (
	angleRadians As Double,
	rotationAxis As Vector3d,
	rotationCenter As Point3d
) As Transform
Parameters
angleRadians
Type: System.Double
Angle (in Radians) of the rotation.
rotationAxis
Type: Rhino.Geometry.Vector3d
Axis direction of rotation operation.
rotationCenter
Type: Rhino.Geometry.Point3d
Center point of rotation. Rotation axis is vertical.
Return Value
Type: Transform
A transformation matrix which rotates geometry around an anchor point.
See Also
Reference
Transform Structure
Rotation Overload
Rhino.Geometry Namespace