RhinoCommon SDK
Transform.Rotation Method (Double, Point3d)
Rhino for Mac 5.1
 Constructs a new rotation transformation with specified angle and rotation center.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform Rotation(
	double angleRadians,
	Point3d rotationCenter
)
Public Shared Function Rotation (
	angleRadians As Double,
	rotationCenter As Point3d
) As Transform
Parameters
angleRadians
Type: System.Double
Angle (in Radians) of the rotation.
rotationCenter
Type: Rhino.Geometry.Point3d
Center point of rotation. Rotation axis is vertical.
Return Value
Type: Transform
A transformation matrix which rotates geometry around an anchor point.
See Also
Reference
Transform Structure
Rotation Overload
Rhino.Geometry Namespace