RhinoCommon SDK
DisplayBitmap.SetBlendFunction Method
Rhino for Mac 5.1
 Sets blending function used to determine how this bitmap is blended with the current framebuffer color. The default setting is SourceAlpha for source and OneMinusSourceAlpha for destination. See OpenGL's glBlendFunc for details.
http://www.opengl.org/sdk/docs/man/xhtml/glBlendFunc.xml
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetBlendFunction(
	BlendMode source,
	BlendMode destination
)
Public Sub SetBlendFunction (
	source As BlendMode,
	destination As BlendMode
)
Parameters
source
Type: Rhino.Display.BlendMode
The source blend mode.
destination
Type: Rhino.Display.BlendMode
The destination blend mode.
See Also
Reference
DisplayBitmap Class
Rhino.Display Namespace