RhinoCommon SDK
TransformCommand.SelectObjects Method
Rhino for Mac 5.1
Overload List
Name | Description
SelectObjects(String, TransformObjectList)
 Selects objects within the command.
SelectObjects(String, ObjectType, TransformObjectList)
 Selects objects within the command.
Top
See Also
Reference
TransformCommand Class
Rhino.Commands Namespace