RhinoCommon SDK
Linetype Methods
Rhino for Mac 5.1
The Linetype type exposes the following members.
Methods
Name | Description
AppendSegment
Adds a segment to the pattern.
CommitChanges
Default
 Set linetype to default settings.
GetSegment
 Gets the segment information at a index.
RemoveSegment
Removes a segment in the linetype.
SetSegment
Sets the length and type of the segment at index.
Top
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace