RhinoCommon SDK
Command Events
Rhino for Mac 5.1
The Command type exposes the following members.
Events
Name | Description
BeginCommand
 Called just before command.RunCommand().
EndCommand
 Called immediately after command.RunCommand().
UndoRedo
 Used to monitor Rhino's built in undo/redo support.
Top
See Also
Reference
Command Class
Rhino.Commands Namespace