RhinoCommon SDK
MeshClash Class
Rhino for Mac 5.1
 Represents a particular instance of a clash or intersection between two meshes.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Intersect.MeshClash
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MeshClash
Public Class MeshClash
The MeshClash type exposes the following members.
Properties
Name | Description
ClashPoint
 If valid, then the sphere centered at ClashPoint of ClashRadius distance interesects the clashing meshes.
ClashRadius
 Gets the clash, or intersection, radius.
MeshA
 Gets the first mesh.
MeshB
 Gets the second mesh.
Top
Methods
Name | Description
Search(Mesh, Mesh, Double, Int32)
 Searches the locations where the distance from the first mesh to the second mesh is less than the provided value.
Search(Mesh, IEnumerable<Mesh>, Double, Int32)
 Searches the locations where the distance from the first mesh to a mesh in the second set of meshes is less than the provided value.
Search(IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Int32)
 Searches for locations where the distance from a mesh in one set of meshes is less than distance to another mesh in a second set of meshes.
Top
See Also
Reference
Rhino.Geometry.Intersect Namespace