RhinoCommon SDK
LayerTable.UndoModify Method (Int32)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LayerTable.UndoModify(System.Int32)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UndoModify(
	int layerIndex
)
Public Function UndoModify (
	layerIndex As Integer
) As Boolean
Parameters
layerIndex
Type: System.Int32
[Missing <param name="layerIndex"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.UndoModify(System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LayerTable.UndoModify(System.Int32)"]
See Also
Reference
LayerTable Class
UndoModify Overload
Rhino.DocObjects.Tables Namespace