RhinoCommon SDK
Vector2d Constructor
Rhino for Mac 5.1
 Initializes a new instance of the vector based on two, X and Y, components.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector2d(
	double x,
	double y
)
Public Sub New (
	x As Double,
	y As Double
)
Parameters
x
Type: System.Double
The X (first) component.
y
Type: System.Double
The Y (second) component.
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace