RhinoCommon SDK
TextLog Properties
Rhino for Mac 5.1
The TextLog type exposes the following members.
Properties
Name | Description
IndentSize
 0: one tab per indent. >0: number of spaces per indent
Top
See Also
Reference
TextLog Class
Rhino.FileIO Namespace