RhinoCommon SDK
InstanceDefinitionTable.Compact Method
Rhino for Mac 5.1
 Purge deleted instance definition information that is not in use. This function is time consuming and should be used in a thoughtful manner.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Compact(
	bool ignoreUndoReferences
)
Public Sub Compact (
	ignoreUndoReferences As Boolean
)
Parameters
ignoreUndoReferences
Type: System.Boolean
 If false, then deleted instance definition information that could possibly be undeleted by the Undo command will not be deleted. If true, then all deleted instance definition information is deleted.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace