RhinoCommon SDK
BinaryArchiveReader.ReadUShort Method
Rhino for Mac 5.1
 Reads a UInt16 from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ushort ReadUShort()
Public Function ReadUShort As UShort
Return Value
Type: UInt16
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace