RhinoCommon SDK
LinetypeTable.Find Method (String, Boolean)
Rhino for Mac 5.1
Finds the linetype with a given name.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Find(
	string name,
	bool ignoreDeletedLinetypes
)
Public Function Find (
	name As String,
	ignoreDeletedLinetypes As Boolean
) As Integer
Parameters
name
Type: System.String
search ignores case.
ignoreDeletedLinetypes
Type: System.Boolean
If true, deleted linetypes are not checked.
Return Value
Type: Int32
 >=0 index of the linetype with the given name -1 no linetype has the given name.
See Also
Reference
LinetypeTable Class
Find Overload
Rhino.DocObjects.Tables Namespace