RhinoCommon SDK
Curve.FrameAt Method
Rhino for Mac 5.1
Returns a 3d frame at a parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool FrameAt(
	double t,
	out Plane plane
)
Public Function FrameAt (
	t As Double,
	<OutAttribute> ByRef plane As Plane
) As Boolean
Parameters
t
Type: System.Double
Evaluation parameter.
plane
Type: Rhino.Geometry.Plane
The frame is returned here.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace