RhinoCommon SDK
FileType Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.FileIO.FileType"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileType
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class FileType
Public Class FileType
The FileType type exposes the following members.
Constructors
Name | Description
FileType
Initializes a new instance of the FileType class
Top
Properties
Name | Description
Description
Extension
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace