RhinoCommon SDK
StringTable.Delete Method (String)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.StringTable.Delete(System.String)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Delete(
	string key
)
Public Sub Delete (
	key As String
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.DocObjects.Tables.StringTable.Delete(System.String)"]
See Also
Reference
StringTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace