RhinoCommon SDK
NurbsSurfacePointList Properties
Rhino for Mac 5.1
The NurbsSurfacePointList type exposes the following members.
Properties
Name | Description
CountU
 Gets the number of control points in the U direction of this surface.
CountV
 Gets the number of control points in the V direction of this surface.
Top
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace