RhinoCommon SDK
MostRecentCommandDescription.Macro Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Commands.MostRecentCommandDescription.Macro"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Macro { get; set; }
Public Property Macro As String
	Get
	Set
Property Value
Type: String
See Also
Reference
MostRecentCommandDescription Class
Rhino.Commands Namespace