RhinoCommon SDK
File3dmTypeCodes.TCODE_SHORT Field
Rhino for Mac 5.1
0x80000000.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_SHORT
Public Const TCODE_SHORT As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace