RhinoCommon SDK
PickContext.View Property
Rhino for Mac 5.1
 This view can be a model view or a page view. When view is a page view, then you need to distingish between the viewports MainViewport() and ActiveViewport(). When m_view is a model view, both MainViewport() and ActiveViewport() return the world view's viewport.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoView View { get; set; }
Public Property View As RhinoView
	Get
	Set
Property Value
Type: RhinoView
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace