RhinoCommon SDK
InstanceDefinitionLayerStyle Enumeration
Rhino for Mac 5.1
 A InstanceDefinitionUpdateType.Static or InstanceDefinitionUpdateType.LinkedAndEmbedded idef must have LayerStyle = Unset, a InstanceDefinitionUpdateType.Linked InstanceDefnition must have LayerStyle = Active or Reference
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum InstanceDefinitionLayerStyle
Public Enumeration InstanceDefinitionLayerStyle
Members
Member name | Value | Description
None | 0
Active | 1
Reference | 2
See Also
Reference
Rhino.DocObjects Namespace