RhinoCommon SDK
DisplayPipeline.CalculateBoundingBox Event
Rhino for Mac 5.1
[Missing <summary> documentation for "E:Rhino.Display.DisplayPipeline.CalculateBoundingBox"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<CalculateBoundingBoxEventArgs> CalculateBoundingBox
Public Shared Event CalculateBoundingBox As EventHandler(Of CalculateBoundingBoxEventArgs)
Value
Type: System.EventHandler<CalculateBoundingBoxEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace