RhinoCommon SDK
BrepFace Methods
Rhino for Mac 5.1
The BrepFace type exposes the following members.
Methods
Name | Description
AdjacentEdges
 Gets the indices of all the BrepEdges that delineate this Face.
AdjacentFaces
 Gets the indices of all the BrepFaces that surround (are adjacent to) this face.
ChangeSurface
 Expert user tool that replaces the 3d surface geometry use by the face.
CreateExtrusion
 Extrude a face in a Brep.
DuplicateFace
 Duplicate a face from the brep to create new single face brep.
DuplicateSurface
 Gets a copy to the untrimmed surface that this face is based on.
GetMesh
 Obtains a reference to a specified type of mesh for this brep face.
IsPointOnFace
 Tests if a parameter space point is on the interior of a trimmed face.
PullPointsToFace
 Pulls one or more points to a brep face.
RebuildEdges
 Rebuild the edges used by a face so they lie on the surface.
SetDomain
 Sets the surface domain of this face.
 (Overrides Surface.SetDomain(Int32, Interval).)
SetMesh
 Sets a reference to a specified type of mesh for this brep face.
Split(IEnumerable<Curve>, Double)
 Split this face using 3D trimming curves.
TrimAwareIsoCurve
 Similar to IsoCurve function, except this function pays attention to trims on faces and may return multiple curves.
TrimAwareIsoIntervals
 Gets intervals where the iso curve exists on a BrepFace (trimmed surface)
UnderlyingSurface
 Gets the untrimmed surface that is the base of this face.
Top
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace