RhinoCommon SDK
DisplayPipeline.DrawBrepWires Method (Brep, Color, Int32)
Rhino for Mac 5.1
 Draws all the wireframe curves of a brep object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawBrepWires(
	Brep brep,
	Color color,
	int wireDensity
)
Public Sub DrawBrepWires (
	brep As Brep,
	color As Color,
	wireDensity As Integer
)
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to draw.
color
Type: System.Drawing.Color
Color of Wireframe curves.
wireDensity
Type: System.Int32
 "Density" of wireframe curves.
-1 = no internal wires.
 0 = default internal wires.
>0 = custom high density.
See Also
Reference
DisplayPipeline Class
DrawBrepWires Overload
Rhino.Display Namespace