RhinoCommon SDK
MeshTopologyVertexList.MeshVertexIndices Method
Rhino for Mac 5.1
 Gets all indices of the mesh vertices that a given topology vertex represents.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] MeshVertexIndices(
	int topologyVertexIndex
)
Public Function MeshVertexIndices (
	topologyVertexIndex As Integer
) As Integer()
Parameters
topologyVertexIndex
Type: System.Int32
Index of a topology vertex in Mesh.TopologyVertices to query.
Return Value
Type: Int32[]
 Indices of all vertices that in Mesh.Vertices that a topology vertex represents.
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace