RhinoCommon SDK
ObjectTable.Hide Method (ObjRef, Boolean)
Rhino for Mac 5.1
 If objref.Object().IsNormal() is true, then the object will be hidden.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Hide(
	ObjRef objref,
	bool ignoreLayerMode
)
Public Function Hide (
	objref As ObjRef,
	ignoreLayerMode As Boolean
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
reference to object to hide.
ignoreLayerMode
Type: System.Boolean
 if true, the object will be hidden even if it is on a layer that is locked or off.
Return Value
Type: Boolean
true if the object was successfully hidden.
See Also
Reference
ObjectTable Class
Hide Overload
Rhino.DocObjects.Tables Namespace