RhinoCommon SDK
GetObject.DisablePreSelect Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetObject.DisablePreSelect"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DisablePreSelect()
Public Sub DisablePreSelect
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace