RhinoCommon SDK
IDialogService Interface
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.IDialogService"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public interface IDialogService
Public Interface IDialogService
The IDialogService type exposes the following members.
Methods
Name | Description
ShowCheckListBox
ShowComboListBox
ShowEditBox
ShowListBox
ShowNumberBox
WrapAsIWin32Window
Top
See Also
Reference
Rhino.UI Namespace