RhinoCommon SDK
BrepTrim.GetTrimParameter Method
Rhino for Mac 5.1
 Get corresponding trim parameter at given edge parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetTrimParameter(
	double edgeParameter,
	out double trimParameter
)
Public Function GetTrimParameter (
	edgeParameter As Double,
	<OutAttribute> ByRef trimParameter As Double
) As Boolean
Parameters
edgeParameter
Type: System.Double
[Missing <param name="edgeParameter"/> documentation for "M:Rhino.Geometry.BrepTrim.GetTrimParameter(System.Double,System.Double@)"]
trimParameter
Type: System.Double
[Missing <param name="trimParameter"/> documentation for "M:Rhino.Geometry.BrepTrim.GetTrimParameter(System.Double,System.Double@)"]
Return Value
Type: Boolean
true on success
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace