RhinoCommon SDK
File3dmWriteOptions Properties
Rhino for Mac 5.1
The File3dmWriteOptions type exposes the following members.
Properties
Name | Description
SaveAnalysisMeshes
 Include analysis meshes in the file. Default is true
SaveRenderMeshes
 Include Render meshes in the file. Default is true
SaveUserData
 Include custom user data in the file. Default is true
Version
 File version. Default is 5
Top
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace