RhinoCommon SDK
Curve.ExtendOnSurface Method
Rhino for Mac 5.1
Overload List
Name | Description
ExtendOnSurface(CurveEnd, BrepFace)
 Extends a curve on a surface.
ExtendOnSurface(CurveEnd, Surface)
 Extends a curve on a surface.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace