RhinoCommon SDK
BinaryArchiveReader.ReadCompressedBuffer Method
Rhino for Mac 5.1
 Reads an array of compressed Byte information from the archive and uncompresses it.
An array is returned even if the input was another enumerable type.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public byte[] ReadCompressedBuffer()
Public Function ReadCompressedBuffer As Byte()
Return Value
Type: Byte[]
The array that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace