RhinoCommon SDK
ToolbarFileCollection Properties
Rhino for Mac 5.1
The ToolbarFileCollection type exposes the following members.
Properties
Name | Description
Count
 Number of open toolbar files
Item
MruSidebarIsVisible
SidebarIsVisible
Top
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace