RhinoCommon SDK
File3dmPlugInDataTable.Item Property
Rhino for Mac 5.1
 Gets the File3dmPlugInData at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public File3dmPlugInData this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As File3dmPlugInData
	Get
Parameters
index
Type: System.Int32
Index of File3dmPlugInData to access.
Return Value
Type: File3dmPlugInData
The File3dmPlugInData at [index].
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace