RhinoCommon SDK
GetPoint.Constrain Method (Arc)
Rhino for Mac 5.1
Constrains the picked point to lie on an arc.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Constrain(
	Arc arc
)
Public Function Constrain (
	arc As Arc
) As Boolean
Parameters
arc
Type: Rhino.Geometry.Arc
An arc to use as constraint.
Return Value
Type: Boolean
true if constraint could be applied.
See Also
Reference
GetPoint Class
Constrain Overload
Rhino.Input.Custom Namespace