RhinoCommon SDK
MeshTextureCoordinateList.Clear Method
Rhino for Mac 5.1
 Clears the Texture Coordinate list on the mesh.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace