RhinoCommon SDK
GumballAppearanceSettings.TranslateZXEnabled Property
Rhino for Mac 5.1
 When TranslateZX is true, the ZX plane translation control is available in appropriate views. The default setting is true.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TranslateZXEnabled { get; set; }
Public Property TranslateZXEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace