RhinoCommon SDK
BrepRegionFaceSide.Brep Property
Rhino for Mac 5.1
 The brep this side belongs to.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepRegionFaceSide Class
Rhino.Geometry Namespace