RhinoCommon SDK
ObjectAttributes.IsDocumentControlled Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectAttributes.IsDocumentControlled"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override bool IsDocumentControlled { get; }
Public Overrides ReadOnly Property IsDocumentControlled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace