RhinoCommon SDK
GetPoint.ConstrainToTargetPlane Method
Rhino for Mac 5.1
 Constrains point to lie on a plane that is parallel to the viewing plane and passes through the view's target point.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void ConstrainToTargetPlane()
Public Sub ConstrainToTargetPlane
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace