RhinoCommon SDK
Arc.Trim Method
Rhino for Mac 5.1
 Sets arc's angle domain (in radians) as a subdomain of the circle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Trim(
	Interval domain
)
Public Function Trim (
	domain As Interval
) As Boolean
Parameters
domain
Type: Rhino.Geometry.Interval
 0 < domain[1] - domain[0] <= 2.0 * RhinoMath.Pi.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Arc Structure
Rhino.Geometry Namespace