RhinoCommon SDK
Vector3d.IsZero Property
Rhino for Mac 5.1
 Gets a value indicating whether the X, Y, and Z values are all equal to 0.0.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsZero { get; }
Public ReadOnly Property IsZero As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace