RhinoCommon SDK
MaterialRefCreateParams Class
Rhino for Mac 5.1
 Options passed to MaterialRefs.Create
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.MaterialRefCreateParams
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MaterialRefCreateParams
Public Class MaterialRefCreateParams
The MaterialRefCreateParams type exposes the following members.
Constructors
Name | Description
MaterialRefCreateParams
Initializes a new instance of the MaterialRefCreateParams class
Top
Properties
Name | Description
BackFaceMaterialId
 The Id of the Material used to render the back of an object.
BackFaceMaterialIndex
 The index of the material used to render the back of an object
FrontFaceMaterialId
 The Id of the Material used to render the front of an object.
FrontFaceMaterialIndex
 The index of the material used to render the front of an object
MaterialSource
 Determines if the simple material should come from the object or from it's layer.
PlugInId
 Identifies a rendering plug-in
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace