RhinoCommon SDK
File3dmObjectTable.AddEllipse Method
Rhino for Mac 5.1
Overload List
Name | Description
AddEllipse(Ellipse)
Adds a curve object to the document representing an ellipse.
AddEllipse(Ellipse, ObjectAttributes)
Adds a curve object to the document representing an ellipse.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace