RhinoCommon SDK
MeshPoint.Point Property
Rhino for Mac 5.1
 Gets the location (position) of this point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d Point { get; }
Public ReadOnly Property Point As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace