RhinoCommon SDK
MeshFaceList.GetConnectedFacesToEdges Method
Rhino for Mac 5.1
 Uses startFaceIndex and finds all connected face indexes up to unwelded or naked edges. If treatNonmanifoldLikeUnwelded is true then non-manifold edges will be considered as unwelded or naked
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] GetConnectedFacesToEdges(
	int startFaceIndex,
	bool treatNonmanifoldLikeUnwelded
)
Public Function GetConnectedFacesToEdges (
	startFaceIndex As Integer,
	treatNonmanifoldLikeUnwelded As Boolean
) As Integer()
Parameters
startFaceIndex
Type: System.Int32
Initial face index
treatNonmanifoldLikeUnwelded
Type: System.Boolean
 True means non-manifold edges will be handled like unwelded edges, False means they aren't considered
Return Value
Type: Int32[]
Array of connected face indexes
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace