RhinoCommon SDK
GetBaseClass.GotDefault Method
Rhino for Mac 5.1
 Returns true if user pressed Enter to accept a default point, number, or string set using SetDefaultPoint, SetDefaultNumber, or SetDefaultString.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GotDefault()
Public Function GotDefault As Boolean
Return Value
Type: Boolean
true if the result if the default point, number or string set. Otherwise, false.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace