RhinoCommon SDK
MaterialTable Methods
Rhino for Mac 5.1
The MaterialTable type exposes the following members.
Methods
Name | Description
Add()
 Adds a new material to the table based on the default material.
Add(Material)
 Adds a new material to the table based on a given material.
Add(Material, Boolean)
 Adds a new material to the table based on a given material.
DeleteAt
 Removes a material at a specific position from this material table.
Find(Guid, Boolean)
Finds a material with a matching id.
Find(String, Boolean)
 Finds a meterial with a given name.
GetEnumerator
Modify
Modify material settings.
ResetMaterial
Top
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace