RhinoCommon SDK
Texture.TextureType Property
Rhino for Mac 5.1
 Controls how the pixels in the bitmap are interpreted
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TextureType TextureType { get; set; }
Public Property TextureType As TextureType
	Get
	Set
Property Value
Type: TextureType
See Also
Reference
Texture Class
Rhino.DocObjects Namespace