RhinoCommon SDK
Transform.Equals Method (Transform)
Rhino for Mac 5.1
 Determines if another transform equals this transform value.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Equals(
	Transform other
)
Public Function Equals (
	other As Transform
) As Boolean
Parameters
other
Type: Rhino.Geometry.Transform
Another transform.
Return Value
Type: Boolean
true if other has the same value as this transform; otherwise, false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Transform Structure
Equals Overload
Rhino.Geometry Namespace