RhinoCommon SDK
RhinoViewport.GetPickTransform Method (Point)
Rhino for Mac 5.1
 Takes a rectangle in screen coordinates and returns a transformation that maps the 3d frustum defined by the rectangle to a -1/+1 clipping coordinate box. This takes a single point and inflates it by Rhino.ApplicationSettings.ModelAidSettings.MousePickBoxRadius to define the screen rectangle.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform GetPickTransform(
	Point clientPoint
)
Public Function GetPickTransform (
	clientPoint As Point
) As Transform
Parameters
clientPoint
Type: System.Drawing.Point
The client point.
Return Value
Type: Transform
A transformation matrix.
See Also
Reference
RhinoViewport Class
GetPickTransform Overload
Rhino.Display Namespace