RhinoCommon SDK
Line.ClosestParameter Method
Rhino for Mac 5.1
 Finds the parameter on the infinite line segment that is closest to a test point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ClosestParameter(
	Point3d testPoint
)
Public Function ClosestParameter (
	testPoint As Point3d
) As Double
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to project onto the line.
Return Value
Type: Double
The parameter on the line that is closest to testPoint.
See Also
Reference
Line Structure
Rhino.Geometry Namespace