RhinoCommon SDK
DisplayPipeline.DrawArrowHead Method
Rhino for Mac 5.1
 Draws a single arrow head.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawArrowHead(
	Point3d tip,
	Vector3d direction,
	Color color,
	double screenSize,
	double worldSize
)
Public Sub DrawArrowHead (
	tip As Point3d,
	direction As Vector3d,
	color As Color,
	screenSize As Double,
	worldSize As Double
)
Parameters
tip
Type: Rhino.Geometry.Point3d
Point of arrow head tip.
direction
Type: Rhino.Geometry.Vector3d
Direction in which arrow head is pointing.
color
Type: System.Drawing.Color
Color of arrow head.
screenSize
Type: System.Double
If screenSize != 0.0, then the size (in screen pixels) of the arrow head will be equal to the screenSize.
worldSize
Type: System.Double
If worldSize != 0.0 and screensize == 0.0 the size of the arrow head will be equal to the number of units in worldSize.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace