RhinoCommon SDK
SerializationOptions Constructor
Rhino for Mac 5.1
 Initializes a new instance of the SerializationOptions class.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public SerializationOptions()
Public Sub New
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace