RhinoCommon SDK
HistoryRecord.SetSurface Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetSurface(System.Int32,Rhino.Geometry.Surface)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetSurface(
	int id,
	Surface value
)
Public Function SetSurface (
	id As Integer,
	value As Surface
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetSurface(System.Int32,Rhino.Geometry.Surface)"]
value
Type: Rhino.Geometry.Surface
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetSurface(System.Int32,Rhino.Geometry.Surface)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetSurface(System.Int32,Rhino.Geometry.Surface)"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace