RhinoCommon SDK
NurbsSurface Constructor
Rhino for Mac 5.1
Overload List
Name | Description
NurbsSurface(NurbsSurface)
 Initializes a new NURBS surface by copying the values from another surface.
NurbsSurface(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace