RhinoCommon SDK
Interval.IncludesInterval Method (Interval)
Rhino for Mac 5.1
 Tests another interval for Interval inclusion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IncludesInterval(
	Interval interval
)
Public Function IncludesInterval (
	interval As Interval
) As Boolean
Parameters
interval
Type: Rhino.Geometry.Interval
Interval to test.
Return Value
Type: Boolean
true if the other interval is contained within or is coincident with the limits of this Interval; otherwise false.
See Also
Reference
Interval Structure
IncludesInterval Overload
Rhino.Geometry Namespace