RhinoCommon SDK
ColorHSL.L Property
Rhino for Mac 5.1
 Gets or sets the luminance channel value. Luminance channels are limited to a 0~1 range.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double L { get; set; }
Public Property L As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace