RhinoCommon SDK
DisplayPipeline.DrawMarker Method
Rhino for Mac 5.1
Overload List
Name | Description
DrawMarker(Point3d, Vector3d, Color)
 Draws an arrow marker as a view-aligned widget.
DrawMarker(Point3d, Vector3d, Color, Int32)
 Draws an arrow marker as a view-aligned widget.
DrawMarker(Point3d, Vector3d, Color, Int32, Double)
 Draws an arrow marker as a view-aligned widget.
DrawMarker(Point3d, Vector3d, Color, Int32, Double, Double)
 Draws an arrow marker as a view-aligned widget.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace