RhinoCommon SDK
StringTable.Delete Method
Rhino for Mac 5.1
Overload List
Name | Description
Delete(String)
Delete(String, String)
 Removes user data strings from the document.
Top
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace