RhinoCommon SDK
Interop.TryCopyFromOnArc Method
Rhino for Mac 5.1
 Attempts to copy the contents of a RMA.OpenNURBS.OnArc to a Rhino.Geometry.Arc.
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool TryCopyFromOnArc(
	Object source,
	out Arc destination
)
Public Shared Function TryCopyFromOnArc (
	source As Object,
	<OutAttribute> ByRef destination As Arc
) As Boolean
Parameters
source
Type: System.Object
A source OnArc.
destination
Type: Rhino.Geometry.Arc
A destination arc.
Return Value
Type: Boolean
true if the operation succeeded; false otherwise.
See Also
Reference
Interop Class
Rhino.Runtime Namespace