RhinoCommon SDK
Box.Union Method
Rhino for Mac 5.1
 Constructs a union between this Box and the given point. This grows the box in directions so it contains the point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Union(
	Point3d point
)
Public Sub Union (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to include.
See Also
Reference
Box Structure
Rhino.Geometry Namespace