RhinoCommon SDK
DisplayModeDescription.SupportsShadeCommand Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.SupportsShadeCommand"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SupportsShadeCommand { get; set; }
Public Property SupportsShadeCommand As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace