RhinoCommon SDK
DisplayPipeline.PreDrawObjects Event
Rhino for Mac 5.1
 Called before objects are been drawn. Depth writing and testing are on.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<DrawEventArgs> PreDrawObjects
Public Shared Event PreDrawObjects As EventHandler(Of DrawEventArgs)
Value
Type: System.EventHandler<DrawEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace