RhinoCommon SDK
GumballObject.SetFromEllipse Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromEllipse(Rhino.Geometry.Ellipse)"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFromEllipse(
	Ellipse ellipse
)
Public Function SetFromEllipse (
	ellipse As Ellipse
) As Boolean
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
[Missing <param name="ellipse"/> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromEllipse(Rhino.Geometry.Ellipse)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromEllipse(Rhino.Geometry.Ellipse)"]
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace