RhinoCommon SDK
ColorLCH.MakePositive Method
Rhino for Mac 5.1
 Ensure the Chromaticity of this color is positive.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void MakePositive()
Public Sub MakePositive
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace