RhinoCommon SDK
BrepTrim.Edge Property
Rhino for Mac 5.1
 Brep edge this trim belongs to. This will be null for singular trims
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepEdge Edge { get; }
Public ReadOnly Property Edge As BrepEdge
	Get
Property Value
Type: BrepEdge
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace