RhinoCommon SDK
BinaryArchiveWriter.WriteShortArray Method
Rhino for Mac 5.1
 Writes a list, an array, or any enumerable of Int16 to the archive.
The return will always be an array.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteShortArray(
	IEnumerable<short> value
)
Public Sub WriteShortArray (
	value As IEnumerable(Of Short)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<Int16>
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace