RhinoCommon SDK
StretchSpaceMorph Constructor (Point3d, Point3d, Point3d)
Rhino for Mac 5.1
 Constructs a stretch space morph.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public StretchSpaceMorph(
	Point3d start,
	Point3d end,
	Point3d point
)
Public Sub New (
	start As Point3d,
	end As Point3d,
	point As Point3d
)
Parameters
start
Type: Rhino.Geometry.Point3d
Start of stretch axis.
end
Type: Rhino.Geometry.Point3d
End of stretch axis.>
point
Type: Rhino.Geometry.Point3d
End of new stretch axis.
See Also
Reference
StretchSpaceMorph Class
StretchSpaceMorph Overload
Rhino.Geometry.Morphs Namespace