RhinoCommon SDK
Point3d.Unset Property
Rhino for Mac 5.1
 Gets the value of a point at location RhinoMath.UnsetValue,RhinoMath.UnsetValue,RhinoMath.UnsetValue.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d Unset { get; }
Public Shared ReadOnly Property Unset As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace