RhinoCommon SDK
Point4d.Unset Property
Rhino for Mac 5.1
 Gets the value of a point with all coordinates set as RhinoMath.UnsetValue.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point4d Unset { get; }
Public Shared ReadOnly Property Unset As Point4d
	Get
Property Value
Type: Point4d
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace