RhinoCommon SDK
DisplayBitmapDrawList.SetPoints Method (IEnumerable<Point3d>, IEnumerable<Color>)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayBitmapDrawList.SetPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{System.Drawing.Color})"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetPoints(
	IEnumerable<Point3d> points,
	IEnumerable<Color> colors
)
Public Sub SetPoints (
	points As IEnumerable(Of Point3d),
	colors As IEnumerable(Of Color)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
[Missing <param name="points"/> documentation for "M:Rhino.Display.DisplayBitmapDrawList.SetPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{System.Drawing.Color})"]
colors
Type: System.Collections.Generic.IEnumerable<Color>
[Missing <param name="colors"/> documentation for "M:Rhino.Display.DisplayBitmapDrawList.SetPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{System.Drawing.Color})"]
See Also
Reference
DisplayBitmapDrawList Class
SetPoints Overload
Rhino.Display Namespace