RhinoCommon SDK
DisplayBitmapDrawList.SetPoints Method (IEnumerable<Point3d>, Color)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayBitmapDrawList.SetPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetPoints(
	IEnumerable<Point3d> points,
	Color blendColor
)
Public Sub SetPoints (
	points As IEnumerable(Of Point3d),
	blendColor As Color
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
[Missing <param name="points"/> documentation for "M:Rhino.Display.DisplayBitmapDrawList.SetPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color)"]
blendColor
Type: System.Drawing.Color
[Missing <param name="blendColor"/> documentation for "M:Rhino.Display.DisplayBitmapDrawList.SetPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color)"]
See Also
Reference
DisplayBitmapDrawList Class
SetPoints Overload
Rhino.Display Namespace