RhinoCommon SDK
Surface.Pullback Method
Rhino for Mac 5.1
Overload List
Name | Description
Pullback(Curve, Double)
 Pulls a 3d curve back to the surface's parameter space.
Pullback(Curve, Double, Interval)
 Pulls a 3d curve back to the surface's parameter space.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace