RhinoCommon SDK
Unroller.ExplodeSpacing Property
Rhino for Mac 5.1
 Gets or sets a value determining whether spacing should be exploded.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ExplodeSpacing { get; set; }
Public Property ExplodeSpacing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Unroller Class
Rhino.Geometry Namespace