RhinoCommon SDK
Intersection.BrepPlane Method
Rhino for Mac 5.1
 Intersects a Brep with an (infinite) plane.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool BrepPlane(
	Brep brep,
	Plane plane,
	double tolerance,
	out Curve[] intersectionCurves,
	out Point3d[] intersectionPoints
)
Public Shared Function BrepPlane (
	brep As Brep,
	plane As Plane,
	tolerance As Double,
	<OutAttribute> ByRef intersectionCurves As Curve(),
	<OutAttribute> ByRef intersectionPoints As Point3d()
) As Boolean
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to intersect.
plane
Type: Rhino.Geometry.Plane
Plane to intersect with.
tolerance
Type: System.Double
Tolerance to use for intersections.
intersectionCurves
Type: Rhino.Geometry.Curve[]
The intersection curves will be returned here.
intersectionPoints
Type: Rhino.Geometry.Point3d[]
The intersection points will be returned here.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace