RhinoCommon SDK
RhinoDeselectAllObjectsEventArgs Properties
Rhino for Mac 5.1
The RhinoDeselectAllObjectsEventArgs type exposes the following members.
Properties
Name | Description
Document
ObjectCount
Top
See Also
Reference
RhinoDeselectAllObjectsEventArgs Class
Rhino.DocObjects Namespace