RhinoCommon SDK
Brep.CreateBooleanIntersection Method (IEnumerable<Brep>, IEnumerable<Brep>, Double)
Rhino for Mac 5.1
 Compute the Solid Intersection of two sets of Breps.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep[] CreateBooleanIntersection(
	IEnumerable<Brep> firstSet,
	IEnumerable<Brep> secondSet,
	double tolerance
)
Public Shared Function CreateBooleanIntersection (
	firstSet As IEnumerable(Of Brep),
	secondSet As IEnumerable(Of Brep),
	tolerance As Double
) As Brep()
Parameters
firstSet
Type: System.Collections.Generic.IEnumerable<Brep>
First set of Breps.
secondSet
Type: System.Collections.Generic.IEnumerable<Brep>
Second set of Breps.
tolerance
Type: System.Double
Tolerance to use for intersection operation.
Return Value
Type: Brep[]
An array of Brep results or null on failure.
Remarks
The solid orientation of the breps make a difference when calling this function
See Also
Reference
Brep Class
CreateBooleanIntersection Overload
Rhino.Geometry Namespace