RhinoCommon SDK
Curve.IsContinuous Method
Rhino for Mac 5.1
 Test continuity at a curve parameter value.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsContinuous(
	Continuity continuityType,
	double t
)
Public Function IsContinuous (
	continuityType As Continuity,
	t As Double
) As Boolean
Parameters
continuityType
Type: Rhino.Geometry.Continuity
Type of continuity to test for.
t
Type: System.Double
Parameter to test.
Return Value
Type: Boolean
 true if the curve has at least the c type continuity at the parameter t.
See Also
Reference
Curve Class
Rhino.Geometry Namespace