RhinoCommon SDK
ObjectTable.FindByCrossingWindowRegion Method (RhinoViewport, IEnumerable<Point3d>, Boolean, ObjectType)
Rhino for Mac 5.1
 Finds objects bounded by a polyline region
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject[] FindByCrossingWindowRegion(
	RhinoViewport viewport,
	IEnumerable<Point3d> region,
	bool inside,
	ObjectType filter
)
Public Function FindByCrossingWindowRegion (
	viewport As RhinoViewport,
	region As IEnumerable(Of Point3d),
	inside As Boolean,
	filter As ObjectType
) As RhinoObject()
Parameters
viewport
Type: Rhino.Display.RhinoViewport
viewport to use for selection
region
Type: System.Collections.Generic.IEnumerable<Point3d>
list of points that define the
inside
Type: System.Boolean
should objects returned be the ones inside of this region (or outside)
filter
Type: Rhino.DocObjects.ObjectType
filter down list by object type
Return Value
Type: RhinoObject[]
An array of RhinoObjects that are inside of this region
See Also
Reference
ObjectTable Class
FindByCrossingWindowRegion Overload
Rhino.DocObjects.Tables Namespace