RhinoCommon SDK
OptionInteger Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Input.Custom.OptionInteger"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.OptionInteger
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class OptionInteger : IDisposable
Public Class OptionInteger
	Implements IDisposable
The OptionInteger type exposes the following members.
Constructors
Name | Description
OptionInteger(Int32)
Initializes a new instance of the OptionInteger class
OptionInteger(Int32, Boolean, Int32)
 Initializes a new instance of the OptionInteger class.
OptionInteger(Int32, Int32, Int32)
 Initializes a new instance of the OptionInteger class wiht both lower and upper limits.
Top
Properties
Name | Description
CurrentValue
InitialValue
Top
Methods
Name | Description
Dispose()
Releases all resources used by the OptionInteger
Dispose(Boolean)
Releases the unmanaged resources used by the OptionInteger and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Input.Custom Namespace