RhinoCommon SDK
BrepTrim Properties
Rhino for Mac 5.1
The BrepTrim type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this trim.
Edge
 Brep edge this trim belongs to. This will be null for singular trims
Face
 Brep face this trim belongs to
IsoStatus
Loop
 Loop that this trim belongs to
TrimIndex
 Gets the index of this trim in the Brep.Trims collection.
TrimType
Type of trim
Top
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace