RhinoCommon SDK
IDialogService Methods
Rhino for Mac 5.1
The IDialogService type exposes the following members.
Methods
Name | Description
ShowCheckListBox
ShowComboListBox
ShowEditBox
ShowListBox
ShowNumberBox
WrapAsIWin32Window
Top
See Also
Reference
IDialogService Interface
Rhino.UI Namespace