RhinoCommon SDK
SweepOneRail.PerformSweep Method (Curve, IEnumerable<Curve>, IEnumerable<Double>)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double})"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] PerformSweep(
	Curve rail,
	IEnumerable<Curve> crossSections,
	IEnumerable<double> crossSectionParameters
)
Public Function PerformSweep (
	rail As Curve,
	crossSections As IEnumerable(Of Curve),
	crossSectionParameters As IEnumerable(Of Double)
) As Brep()
Parameters
rail
Type: Rhino.Geometry.Curve
[Missing <param name="rail"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double})"]
crossSections
Type: System.Collections.Generic.IEnumerable<Curve>
[Missing <param name="crossSections"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double})"]
crossSectionParameters
Type: System.Collections.Generic.IEnumerable<Double>
[Missing <param name="crossSectionParameters"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double})"]
Return Value
Type: Brep[]
[Missing <returns> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double})"]
See Also
Reference
SweepOneRail Class
PerformSweep Overload
Rhino.Geometry Namespace