RhinoCommon SDK
PlugIn.ReadDocument Method
Rhino for Mac 5.1
 Called whenever a Rhino document is being loaded and plug-in user data was encountered written by a plug-in with this plug-in's GUID.
Namespace: Rhino.PlugIns
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void ReadDocument(
	RhinoDoc doc,
	BinaryArchiveReader archive,
	FileReadOptions options
)
Protected Overridable Sub ReadDocument (
	doc As RhinoDoc,
	archive As BinaryArchiveReader,
	options As FileReadOptions
)
Parameters
doc
Type: Rhino.RhinoDoc
A Rhino document that is being loaded.
archive
Type: Rhino.FileIO.BinaryArchiveReader
 OpenNURBS file archive object Rhino is using to read this file. Use BinaryArchiveReader.Read*() functions to read plug-in data. If any BinaryArchive.Read*() functions throws an exception then archive.ReadErrorOccurve will be true and you should immediately return.
options
Type: Rhino.FileIO.FileReadOptions
Describes what is being written.
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace