RhinoCommon SDK
RhinoView.TitleVisible Property
Rhino for Mac 5.1
 Visibility of the viewport title window.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TitleVisible { get; set; }
Public Property TitleVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoView Class
Rhino.Display Namespace