RhinoCommon SDK
CustomObjectGrips.Grip Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomObjectGrips.Grip(System.Int32)"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public CustomGripObject Grip(
	int index
)
Public Function Grip (
	index As Integer
) As CustomGripObject
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Custom.CustomObjectGrips.Grip(System.Int32)"]
Return Value
Type: CustomGripObject
[Missing <returns> documentation for "M:Rhino.DocObjects.Custom.CustomObjectGrips.Grip(System.Int32)"]
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace