RhinoCommon SDK
ObjectTable.Replace Method (Guid, Line)
Rhino for Mac 5.1
Replaces one object with new line curve object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	Guid objectId,
	Line line
)
Public Function Replace (
	objectId As Guid,
	line As Line
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
line
Type: Rhino.Geometry.Line
new line to be added. The line is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace