RhinoCommon SDK
DisplayBitmapDrawList.MaximumCachedSortLists Property
Rhino for Mac 5.1
 Maximum number of cached sort order index lists stored on this class. Default is 10, but depending on the number of points in this list you may get better performance by setting this value to a certain percentage of the point count.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int MaximumCachedSortLists { get; set; }
Public Property MaximumCachedSortLists As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace