RhinoCommon SDK
ObjectPropertiesPage.PageControl Property
Rhino for Mac 5.1
 Return the control that represents this page. This will typically be a custom user control.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract Object PageControl { get; }
Public MustOverride ReadOnly Property PageControl As Object
	Get
Property Value
Type: Object
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace