RhinoCommon SDK
Mesh.Offset Method (Double)
Rhino for Mac 5.1
 Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals. Same as Mesh.Offset(distance, false)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Mesh Offset(
	double distance
)
Public Function Offset (
	distance As Double
) As Mesh
Parameters
distance
Type: System.Double
A distance value to use for offsetting.
Return Value
Type: Mesh
A new mesh on success, or null on failure.
See Also
Reference
Mesh Class
Offset Overload
Rhino.Geometry Namespace