RhinoCommon SDK
RhinoViewport.GetDepth Method (Point3d, Double)
Rhino for Mac 5.1
Gets clipping distance of a point.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetDepth(
	Point3d point,
	out double distance
)
Public Function GetDepth (
	point As Point3d,
	<OutAttribute> ByRef distance As Double
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
A 3D point.
distance
Type: System.Double
A computed distance is assigned to this out parameter if this call succeeds.
Return Value
Type: Boolean
 true if the point is ing the view frustum and near_dist/far_dist were set. false if the bounding box does not intesect the view frustum.
See Also
Reference
RhinoViewport Class
GetDepth Overload
Rhino.Display Namespace