RhinoCommon SDK
UserDataList Properties
Rhino for Mac 5.1
The UserDataList type exposes the following members.
Properties
Name | Description
Count
Number of UserData objects in this list.
Top
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace