RhinoCommon SDK
RhinoTransformObjectsEventArgs Properties
Rhino for Mac 5.1
The RhinoTransformObjectsEventArgs type exposes the following members.
Properties
Name | Description
ObjectCount
Objects
ObjectsWillBeCopied
Transform
Top
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace