RhinoCommon SDK
StatusBar.SetMessagePane Method
Rhino for Mac 5.1
 Sets the message pane to a message.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void SetMessagePane(
	string message
)
Public Shared Sub SetMessagePane (
	message As String
)
Parameters
message
Type: System.String
The message value.
See Also
Reference
StatusBar Class
Rhino.UI Namespace