RhinoCommon SDK
StackedDialogPage Methods
Rhino for Mac 5.1
The StackedDialogPage type exposes the following members.
Methods
Name | Description
OnActivate
Called when this page is activated/deactivated.
OnApply
Called when stacked dialog OK button is pressed.
OnCancel
Called when stacked dialog Cancel button is pressed.
OnCreateParent
OnDefaults
Called when stacked dialog Defaults button is pressed (see ShowDefaultsButton).
OnHelp
OnSizeParent
Top
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace