RhinoCommon SDK
VisualAnalysisMode.DrawPointCloudObject Method
Rhino for Mac 5.1
 Draws one point cloud. Override this method to add your custom behavior.
The default implementation does nothing.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void DrawPointCloudObject(
	PointCloudObject pointCloud,
	DisplayPipeline pipeline
)
Protected Overridable Sub DrawPointCloudObject (
	pointCloud As PointCloudObject,
	pipeline As DisplayPipeline
)
Parameters
pointCloud
Type: Rhino.DocObjects.PointCloudObject
A point cloud object.
pipeline
Type: Rhino.Display.DisplayPipeline
The current display pipeline.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace