RhinoCommon SDK
RhinoViewport.GetPickTransform Method (Rectangle)
Rhino for Mac 5.1
 Takes a rectangle in screen coordinates and returns a transformation that maps the 3d frustum defined by the rectangle to a -1/+1 clipping coordinate box.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform GetPickTransform(
	Rectangle clientRectangle
)
Public Function GetPickTransform (
	clientRectangle As Rectangle
) As Transform
Parameters
clientRectangle
Type: System.Drawing.Rectangle
The client rectangle.
Return Value
Type: Transform
A transformation matrix.
See Also
Reference
RhinoViewport Class
GetPickTransform Overload
Rhino.Display Namespace