RhinoCommon SDK
DisplayConduit.CalculateBoundingBoxZoomExtents Method
Rhino for Mac 5.1
 If you want to participate in the Zoom Extents command with your display conduit, then you will need to override ZoomExtentsBoundingBox. Typically you could just call your CalculateBoundingBox override, but you may also want to spend a little more time here and compute a tighter bounding box for your conduit geometry if that is needed.
The default implementation does nothing.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void CalculateBoundingBoxZoomExtents(
	CalculateBoundingBoxEventArgs e
)
Protected Overridable Sub CalculateBoundingBoxZoomExtents (
	e As CalculateBoundingBoxEventArgs
)
Parameters
e
Type: Rhino.Display.CalculateBoundingBoxEventArgs
The event argument contain the current bounding box state.
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace