RhinoCommon SDK
LightTableEventType Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.LightTableEventType"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum LightTableEventType
Public Enumeration LightTableEventType
Members
Member name | Value | Description
Added | 0
Deleted | 1
Undeleted | 2
Modified | 3
Sorted | 4 | LightTable.Sort() potentially changed sort order.
See Also
Reference
Rhino.DocObjects.Tables Namespace