RhinoCommon SDK
Light.IsEnabled Property
Rhino for Mac 5.1
 Gets or sets a value that defines if the light is turned on (true) or off (false).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsEnabled { get; set; }
Public Property IsEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Light Class
Rhino.Geometry Namespace