RhinoCommon SDK
ObjectTable.FindByCrossingWindowRegion Method
Rhino for Mac 5.1
Overload List
Name | Description
FindByCrossingWindowRegion(RhinoViewport, IEnumerable<Point3d>, Boolean, ObjectType)
 Finds objects bounded by a polyline region
FindByCrossingWindowRegion(RhinoViewport, Point2d, Point2d, Boolean, ObjectType)
 Finds objects bounded by a region
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace