RhinoCommon SDK
Sphere Constructor (Plane, Double)
Rhino for Mac 5.1
 Initializes a new sphere given the plane of the equator circle and radius.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Sphere(
	Plane equatorialPlane,
	double radius
)
Public Sub New (
	equatorialPlane As Plane,
	radius As Double
)
Parameters
equatorialPlane
Type: Rhino.Geometry.Plane
A plane that will be intesecting the sphere at the same distance from both poles (parameterization singularieties).
radius
Type: System.Double
A radius value.
See Also
Reference
Sphere Structure
Sphere Overload
Rhino.Geometry Namespace