RhinoCommon SDK
ViewTable.RedrawEnabled Property
Rhino for Mac 5.1
Returns or sets (enable or disables) screen redrawing.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool RedrawEnabled { get; set; }
Public Property RedrawEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace