RhinoCommon SDK
Curve.Offset Method (Point3d, Vector3d, Double, Double, CurveOffsetCornerStyle)
Rhino for Mac 5.1
 Offsets this curve. If you have a nice offset, then there will be one entry in the array. If the original curve had kinks or the offset curve had self intersections, you will get multiple segments in the offset_curves[] array.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] Offset(
	Point3d directionPoint,
	Vector3d normal,
	double distance,
	double tolerance,
	CurveOffsetCornerStyle cornerStyle
)
Public Function Offset (
	directionPoint As Point3d,
	normal As Vector3d,
	distance As Double,
	tolerance As Double,
	cornerStyle As CurveOffsetCornerStyle
) As Curve()
Parameters
directionPoint
Type: Rhino.Geometry.Point3d
A point that indicates the direction of the offset.
normal
Type: Rhino.Geometry.Vector3d
The normal to the offset plane.
distance
Type: System.Double
The positive or negative distance to offset.
tolerance
Type: System.Double
The offset or fitting tolerance.
cornerStyle
Type: Rhino.Geometry.CurveOffsetCornerStyle
Corner style for offset kinks.
Return Value
Type: Curve[]
Offset curves on success, null on failure.
See Also
Reference
Curve Class
Offset Overload
Rhino.Geometry Namespace