RhinoCommon SDK
BrepSurfaceList.Item Property
Rhino for Mac 5.1
 Gets the Surface at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As Surface
	Get
Parameters
index
Type: System.Int32
Index of Surface to access.
Return Value
Type: Surface
The Surface at [index].
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
See Also
Reference
BrepSurfaceList Class
Rhino.Geometry.Collections Namespace