RhinoCommon SDK
BinaryArchiveWriter.WriteObjRefArray Method
Rhino for Mac 5.1
 Writes a list, an array, or any enumerable of ObjRef to the archive.
The return will always be an array.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteObjRefArray(
	IEnumerable<ObjRef> objrefs
)
Public Sub WriteObjRefArray (
	objrefs As IEnumerable(Of ObjRef)
)
Parameters
objrefs
Type: System.Collections.Generic.IEnumerable<ObjRef>
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace