RhinoCommon SDK
GetObject.EnableSelPrevious Method
Rhino for Mac 5.1
 By default, any object selected during a command becomes part of the "previous selection set" and can be reselected by the SelPrev command. If you need to select objects but do not want them to be selected by a subsquent call to SelPrev, then call EnableSelPrev = false.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableSelPrevious(
	bool enable
)
Public Sub EnableSelPrevious (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
[Missing <param name="enable"/> documentation for "M:Rhino.Input.Custom.GetObject.EnableSelPrevious(System.Boolean)"]
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace