RhinoCommon SDK
File3dmSettings.PageAngleToleranceRadians Property
Rhino for Mac 5.1
Gets or sets the page space angle tolerance.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double PageAngleToleranceRadians { get; set; }
Public Property PageAngleToleranceRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace