RhinoCommon SDK
Surface.IsCone Method
Rhino for Mac 5.1
 Determines if the surface is a portion of a cone within RhinoMath.ZeroTolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsCone()
Public Function IsCone As Boolean
Return Value
Type: Boolean
true if the surface is a portion of a cone.
See Also
Reference
Surface Class
IsCone Overload
Rhino.Geometry Namespace