RhinoCommon SDK
NurbsSurface.CreateFromCone Method
Rhino for Mac 5.1
 Constructs a new NURBS surfaces from cone data.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static NurbsSurface CreateFromCone(
	Cone cone
)
Public Shared Function CreateFromCone (
	cone As Cone
) As NurbsSurface
Parameters
cone
Type: Rhino.Geometry.Cone
A cone value.
Return Value
Type: NurbsSurface
A new NURBS surface, or null on error.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace