RhinoCommon SDK
ViewportInfo.FrustumLeftPlane Property
Rhino for Mac 5.1
 Gets the frustum left plane that separates visibile from off-screen.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Plane FrustumLeftPlane { get; }
Public ReadOnly Property FrustumLeftPlane As Plane
	Get
Property Value
Type: Plane
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace