RhinoCommon SDK
GripsDrawEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.GripsDrawEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.DrawEventArgs
 Rhino.DocObjects.Custom.GripsDrawEventArgs
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class GripsDrawEventArgs : DrawEventArgs
Public Class GripsDrawEventArgs
	Inherits DrawEventArgs
The GripsDrawEventArgs type exposes the following members.
Properties
Name | Description
ControlPolygonStyle
 What kind of line is used to display things like control polygons. 0 = no control polygon, 1 = solid control polygon, 2 = dotted control polygon.
DrawDynamicStuff
 If true, then draw stuff that does not move when grips are dragged, like the control polygon of the "original" curve.
DrawStaticStuff
 If true, then draw stuff that moves when grips are dragged, like the curve being bent by a dragged control point.
GripColor
GripStatusCount
LockedGripColor
SelectedGripColor
Top
Methods
Name | Description
DrawControlPolygonLine(Line, GripStatus, GripStatus)
 Draws the lines in a control polygons.
This is an helper function.
DrawControlPolygonLine(Line, Int32, Int32)
 Draws the lines in a control polygons.
This is an helper function.
DrawControlPolygonLine(Point3d, Point3d, Int32, Int32)
 Draws the lines in a control polygons.
This is an helper function.
GripStatus
RestoreViewportSettings
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace