RhinoCommon SDK
ObjectTable.FindByFilter Method
Rhino for Mac 5.1
 Same as GetObjectList but converts the result to an array.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject[] FindByFilter(
	ObjectEnumeratorSettings filter
)
Public Function FindByFilter (
	filter As ObjectEnumeratorSettings
) As RhinoObject()
Parameters
filter
Type: Rhino.DocObjects.ObjectEnumeratorSettings
The object enumerator filter to customize inclusion requirements.
Return Value
Type: RhinoObject[]
A Rhino object array. This array can be emptry but not null.
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace