RhinoCommon SDK
GetOption Constructor
Rhino for Mac 5.1
Initializes a new instance of the GetOption class
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GetOption()
Public Sub New
See Also
Reference
GetOption Class
Rhino.Input.Custom Namespace