RhinoCommon SDK
Curve.ProjectToBrep Method (Curve, IEnumerable<Brep>, Vector3d, Double, Int32[])
Rhino for Mac 5.1
 Projects a Curve onto a collection of Breps along a given direction.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] ProjectToBrep(
	Curve curve,
	IEnumerable<Brep> breps,
	Vector3d direction,
	double tolerance,
	out int[] brepIndices
)
Public Shared Function ProjectToBrep (
	curve As Curve,
	breps As IEnumerable(Of Brep),
	direction As Vector3d,
	tolerance As Double,
	<OutAttribute> ByRef brepIndices As Integer()
) As Curve()
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to project.
breps
Type: System.Collections.Generic.IEnumerable<Brep>
Breps to project onto.
direction
Type: Rhino.Geometry.Vector3d
Direction of projection.
tolerance
Type: System.Double
Tolerance to use for projection.
brepIndices
Type: System.Int32[]
(out) Integers that identify for each resulting curve which Brep it was projected onto.
Return Value
Type: Curve[]
An array of projected curves or null if the projection set is empty.
See Also
Reference
Curve Class
ProjectToBrep Overload
Rhino.Geometry Namespace