RhinoCommon SDK
CustomUndoEventArgs.Tag Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Commands.CustomUndoEventArgs.Tag"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Object Tag { get; }
Public ReadOnly Property Tag As Object
	Get
Property Value
Type: Object
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace