RhinoCommon SDK
CustomDisplay.IsDisposed Property
Rhino for Mac 5.1
 Gets a value indicating whether this CustomDisplay instance has been disposed. Once a CustomDisplay has been disposed, you can no longer use it.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsDisposed { get; }
Public ReadOnly Property IsDisposed As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace