RhinoCommon SDK
Point2d.Transform Method
Rhino for Mac 5.1
 Transforms the present point in place. The transformation matrix acts on the left of the point. i.e.,
result = transformation*point
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Transform(
	Transform xform
)
Public Sub Transform (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to apply.
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace