RhinoCommon SDK
Rectangle3d.MakeIncreasing Method
Rhino for Mac 5.1
 Ensures the X and Y dimensions are increasing or singleton intervals.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void MakeIncreasing()
Public Sub MakeIncreasing
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace