RhinoCommon SDK
GripStatus.Visible Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripStatus.Visible"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Visible { get; }
Public ReadOnly Property Visible As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GripStatus Class
Rhino.DocObjects.Custom Namespace