RhinoCommon SDK
ObjRef.SelectionMethod Method
Rhino for Mac 5.1
 Gets the method used to select this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public SelectionMethod SelectionMethod()
Public Function SelectionMethod As SelectionMethod
Return Value
Type: SelectionMethod
The method used to select this object.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace