RhinoCommon SDK
Brep.DuplicateNakedEdgeCurves Method
Rhino for Mac 5.1
 Duplicate naked edges of this Brep
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] DuplicateNakedEdgeCurves(
	bool outer,
	bool inner
)
Public Function DuplicateNakedEdgeCurves (
	outer As Boolean,
	inner As Boolean
) As Curve()
Parameters
outer
Type: System.Boolean
[Missing <param name="outer"/> documentation for "M:Rhino.Geometry.Brep.DuplicateNakedEdgeCurves(System.Boolean,System.Boolean)"]
inner
Type: System.Boolean
[Missing <param name="inner"/> documentation for "M:Rhino.Geometry.Brep.DuplicateNakedEdgeCurves(System.Boolean,System.Boolean)"]
Return Value
Type: Curve[]
[Missing <returns> documentation for "M:Rhino.Geometry.Brep.DuplicateNakedEdgeCurves(System.Boolean,System.Boolean)"]
See Also
Reference
Brep Class
Rhino.Geometry Namespace