RhinoCommon SDK
Plane.ToString Method
Rhino for Mac 5.1
 Constructs the string representation of this plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
Text.
See Also
Reference
Plane Structure
Rhino.Geometry Namespace