RhinoCommon SDK
CurveObject Methods
Rhino for Mac 5.1
The CurveObject type exposes the following members.
Methods
Name | Description
DuplicateCurveGeometry
Top
See Also
Reference
CurveObject Class
Rhino.DocObjects Namespace