RhinoCommon SDK
Line.Flip Method
Rhino for Mac 5.1
 Flip the endpoints of the line segment.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Flip()
Public Sub Flip
See Also
Reference
Line Structure
Rhino.Geometry Namespace