RhinoCommon SDK
ObjectTable.Replace Method (Guid, Mesh)
Rhino for Mac 5.1
Replaces one object with new mesh object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	Guid objectId,
	Mesh mesh
)
Public Function Replace (
	objectId As Guid,
	mesh As Mesh
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
mesh
Type: Rhino.Geometry.Mesh
 new mesh to be added A duplicate of the mesh is added to the Rhino model.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace