RhinoCommon SDK
BinaryArchiveException Constructor
Rhino for Mac 5.1
 Initializes a new instance of the BinaryArchiveException class.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BinaryArchiveException(
	string message
)
Public Sub New (
	message As String
)
Parameters
message
Type: System.String
The inner message to show to users.
See Also
Reference
BinaryArchiveException Class
Rhino.FileIO Namespace