RhinoCommon SDK
Ellipse Constructor
Rhino for Mac 5.1
Overload List
Name | Description
Ellipse(Plane, Double, Double)
 Initializes a new ellipse from base plane and both principal radii.
Ellipse(Point3d, Point3d, Point3d)
 Initializes a new ellipse from a center point and the two semiaxes intersections.
Top
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace