RhinoCommon SDK
DisplayPipeline.DrawBitmap Method (DisplayBitmap, Int32, Int32)
Rhino for Mac 5.1
 Draws a bitmap in screen coordinates
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawBitmap(
	DisplayBitmap bitmap,
	int left,
	int top
)
Public Sub DrawBitmap (
	bitmap As DisplayBitmap,
	left As Integer,
	top As Integer
)
Parameters
bitmap
Type: Rhino.Display.DisplayBitmap
bitmap to draw
left
Type: System.Int32
where top/left corner of bitmap should appear in screen coordinates
top
Type: System.Int32
where top/left corner of bitmap should appear in screen coordinates
See Also
Reference
DisplayPipeline Class
DrawBitmap Overload
Rhino.Display Namespace