RhinoCommon SDK
Interval.Min Property
Rhino for Mac 5.1
 Gets the smaller of T0 and T1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Min { get; }
Public ReadOnly Property Min As Double
	Get
Property Value
Type: Double
See Also
Reference
Interval Structure
Rhino.Geometry Namespace