RhinoCommon SDK
SelCommand.RunCommand Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Commands.SelCommand.RunCommand(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected override Result RunCommand(
	RhinoDoc doc,
	RunMode mode
)
Protected Overrides Function RunCommand (
	doc As RhinoDoc,
	mode As RunMode
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Commands.SelCommand.RunCommand(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
mode
Type: Rhino.Commands.RunMode
[Missing <param name="mode"/> documentation for "M:Rhino.Commands.SelCommand.RunCommand(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Commands.SelCommand.RunCommand(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
See Also
Reference
SelCommand Class
Rhino.Commands Namespace