RhinoCommon SDK
PickContext.PickFrustumTest Method (Point3d, Double, Double)
Rhino for Mac 5.1
Utility for picking 3d point
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PickFrustumTest(
	Point3d point,
	out double depth,
	out double distance
)
Public Function PickFrustumTest (
	point As Point3d,
	<OutAttribute> ByRef depth As Double,
	<OutAttribute> ByRef distance As Double
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
[Missing <param name="point"/> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Point3d,System.Double@,System.Double@)"]
depth
Type: System.Double
 depth returned here for point picks. LARGER values are NEARER to the camera. SMALLER values are FARTHER from the camera.
distance
Type: System.Double
 planar distance returned here for point picks. SMALLER values are CLOSER to the pick point
Return Value
Type: Boolean
true if there is a hit
See Also
Reference
PickContext Class
PickFrustumTest Overload
Rhino.Input.Custom Namespace