RhinoCommon SDK
BinaryArchiveReader.BeginRead3dmChunk Method
Rhino for Mac 5.1
Overload List
Name | Description
BeginRead3dmChunk(UInt32, Int64)
 Begins reading a chunk that must be in the archive at this location.
BeginRead3dmChunk(UInt32, Int32, Int32)
 Begins reading a chunk that must be in the archive at this location.
Top
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace