RhinoCommon SDK
Circle.Diameter Property
Rhino for Mac 5.1
 Gets or sets the diameter (radius * 2.0) of this circle. Diameters should be positive values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Diameter { get; set; }
Public Property Diameter As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Circle Structure
Rhino.Geometry Namespace