RhinoCommon SDK
MaterialRefCreateParams Constructor
Rhino for Mac 5.1
Initializes a new instance of the MaterialRefCreateParams class
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MaterialRefCreateParams()
Public Sub New
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace