RhinoCommon SDK
CommonObject Class
Rhino for Mac 5.1
 Base class for .NET classes that wrap C++ unmanaged Rhino classes.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 More...
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public abstract class CommonObject : IDisposable,
	ISerializable
<SerializableAttribute>
Public MustInherit Class CommonObject
	Implements IDisposable, ISerializable
The CommonObject type exposes the following members.
Constructors
Name | Description
CommonObject()
 Allows construction from inheriting classes.
CommonObject(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
HasUserData
 Gets true if this class has any custom information attached to it through UserData.
IsDocumentControlled
 If true this object may not be modified. Any properties or functions that attempt to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.
IsValid
Tests an object to see if it is valid.
UserData
 List of custom information that is attached to this class.
UserDictionary
 Dictionary of custom information attached to this class. The dictionary is actually user data provided as an easy to use sharable set of information.
Top
Methods
Name | Description
ConstructConstObject
 Assigns a parent object and a subobject index to this.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
EnsurePrivateCopy
 If you want to keep a copy of this class around by holding onto it in a variable after a command completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can call this function as many times as you want.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetObjectData
 Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
IsValidWithLog
 Determines if an object is valid. Also provides a report on errors if this object happens not to be valid.
NonConstOperation
 For derived classes implementers.
Defines the necessary implementation to free the instance from being const.
OnSwitchToNonConst
 Is called when a non-const operation first occurs.
Top
See Also
Reference
Rhino.Runtime Namespace
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.BitmapEntry
 Rhino.DocObjects.DimensionStyle
 Rhino.DocObjects.HatchPattern
 Rhino.DocObjects.Layer
 Rhino.DocObjects.Linetype
 Rhino.DocObjects.Material
 Rhino.DocObjects.ObjectAttributes
 Rhino.DocObjects.Texture
 Rhino.Geometry.GeometryBase
 Rhino.Render.CachedTextureCoordinates
 Rhino.Render.TextureMapping