RhinoCommon SDK
Point4d.W Property
Rhino for Mac 5.1
 Gets or sets the W (fourth) coordinate -or weight- of this point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double W { get; set; }
Public Property W As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace