RhinoCommon SDK
BinaryArchiveWriter.WritePoint3d Method
Rhino for Mac 5.1
 Writes a Point3d value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WritePoint3d(
	Point3d value
)
Public Sub WritePoint3d (
	value As Point3d
)
Parameters
value
Type: Rhino.Geometry.Point3d
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace