RhinoCommon SDK
BinaryArchiveWriter.WritePoint3f Method
Rhino for Mac 5.1
 Writes a Point3f value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WritePoint3f(
	Point3f value
)
Public Sub WritePoint3f (
	value As Point3f
)
Parameters
value
Type: Rhino.Geometry.Point3f
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace