RhinoCommon SDK
Texture.Enabled Property
Rhino for Mac 5.1
 If the texture is enabled then it will be visible in the rendered display otherwise it will not.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Texture Class
Rhino.DocObjects Namespace