RhinoCommon SDK
OptionDouble.InitialValue Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.OptionDouble.InitialValue"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double InitialValue { get; }
Public ReadOnly Property InitialValue As Double
	Get
Property Value
Type: Double
See Also
Reference
OptionDouble Class
Rhino.Input.Custom Namespace