RhinoCommon SDK
MeshFaceList.RemoveAt Method
Rhino for Mac 5.1
 Removes a face from the mesh.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void RemoveAt(
	int index
)
Public Sub RemoveAt (
	index As Integer
)
Parameters
index
Type: System.Int32
The index of the face that will be removed.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If index is < 0 or >= Count.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace