RhinoCommon SDK
GetLine.FeedbackColor Property
Rhino for Mac 5.1
 If set, the feedback color is used to draw the dynamic line when the second point is begin picked. If not set, the active layer color is used.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color FeedbackColor { get; set; }
Public Property FeedbackColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace