RhinoCommon SDK
ObjectAttributes.Mode Property
Rhino for Mac 5.1
 An object must be in one of three modes: normal, locked or hidden. If an object is in normal mode, then the object's layer controls visibility and selectability. If an object is locked, then the object's layer controls visibility by the object cannot be selected. If the object is hidden, it is not visible and it cannot be selected.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectMode Mode { get; set; }
Public Property Mode As ObjectMode
	Get
	Set
Property Value
Type: ObjectMode
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace