RhinoCommon SDK
Mesh.GetOutlines Method (RhinoViewport)
Rhino for Mac 5.1
 Constructs the outlines of a mesh. The projection information in the viewport is used to determine how the outlines are projected.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Polyline[] GetOutlines(
	RhinoViewport viewport
)
Public Function GetOutlines (
	viewport As RhinoViewport
) As Polyline()
Parameters
viewport
Type: Rhino.Display.RhinoViewport
A viewport to determine projection direction.
Return Value
Type: Polyline[]
An array of polylines, or null on error.
See Also
Reference
Mesh Class
GetOutlines Overload
Rhino.Geometry Namespace