RhinoCommon SDK
BitmapTable.ExportToFiles Method
Rhino for Mac 5.1
Exports all the bitmaps in the table to files.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ExportToFiles(
	string directoryPath,
	int overwrite
)
Public Function ExportToFiles (
	directoryPath As String,
	overwrite As Integer
) As Integer
Parameters
directoryPath
Type: System.String
 full path to the directory where the bitmaps should be saved. If NULL, a dialog is used to interactively get the directory name.
overwrite
Type: System.Int32
0 = no, 1 = yes, 2 = ask.
Return Value
Type: Int32
Number of bitmaps written.
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace