RhinoCommon SDK
MeshFaceList.HasNakedEdges Method
Rhino for Mac 5.1
 Returns true if at least one of the face edges are not topologically connected to any other faces.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool HasNakedEdges(
	int faceIndex
)
Public Function HasNakedEdges (
	faceIndex As Integer
) As Boolean
Parameters
faceIndex
Type: System.Int32
A face index.
Return Value
Type: Boolean
true if that face makes the mesh open, otherwise false.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace