RhinoCommon SDK
OptionDouble Constructor (Double)
Rhino for Mac 5.1
Initializes a new instance of the OptionDouble class
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public OptionDouble(
	double initialValue
)
Public Sub New (
	initialValue As Double
)
Parameters
initialValue
Type: System.Double
[Missing <param name="initialValue"/> documentation for "M:Rhino.Input.Custom.OptionDouble.#ctor(System.Double)"]
See Also
Reference
OptionDouble Class
OptionDouble Overload
Rhino.Input.Custom Namespace