RhinoCommon SDK
NurbsCurvePointList.SetPoint Method (Int32, Point3d)
Rhino for Mac 5.1
 Sets a specific control-point.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetPoint(
	int index,
	Point3d point
)
Public Function SetPoint (
	index As Integer,
	point As Point3d
) As Boolean
Parameters
index
Type: System.Int32
Index of control-point to set.
point
Type: Rhino.Geometry.Point3d
Coordinate of control-point.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.NurbsCurvePointList.SetPoint(System.Int32,Rhino.Geometry.Point3d)"]
See Also
Reference
NurbsCurvePointList Class
SetPoint Overload
Rhino.Geometry.Collections Namespace