RhinoCommon SDK
VisualAnalysisMode.DrawMesh Method
Rhino for Mac 5.1
 Draws a mesh.
The default implementation does nothing.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void DrawMesh(
	RhinoObject obj,
	Mesh mesh,
	DisplayPipeline pipeline
)
Protected Overridable Sub DrawMesh (
	obj As RhinoObject,
	mesh As Mesh,
	pipeline As DisplayPipeline
)
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
A Rhino object corresponding to the surface.
mesh
Type: Rhino.Geometry.Mesh
The mesh geometry.
pipeline
Type: Rhino.Display.DisplayPipeline
The current display pipeline.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace