RhinoCommon SDK
BrepEdge.TrimIndices Method
Rhino for Mac 5.1
 Gets the indices of all trims associated with this edge.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] TrimIndices()
Public Function TrimIndices As Integer()
Return Value
Type: Int32[]
Empty array on failure.
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace