RhinoCommon SDK
BrepFaceList.RemoveAt Method
Rhino for Mac 5.1
 Deletes a face at a specified index.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void RemoveAt(
	int faceIndex
)
Public Sub RemoveAt (
	faceIndex As Integer
)
Parameters
faceIndex
Type: System.Int32
The index of the mesh face.
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace