RhinoCommon SDK
Rectangle3d.PointAt Method (Double, Double)
Rhino for Mac 5.1
 Gets a point in Rectangle space.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAt(
	double x,
	double y
)
Public Function PointAt (
	x As Double,
	y As Double
) As Point3d
Parameters
x
Type: System.Double
Normalized parameter along Rectangle width.
y
Type: System.Double
Normalized parameter along Rectangle height.
Return Value
Type: Point3d
The point at the given x,y parameter.
See Also
Reference
Rectangle3d Structure
PointAt Overload
Rhino.Geometry Namespace