RhinoCommon SDK
Extrusion.CreatePipeExtrusion Method
Rhino for Mac 5.1
 Gets an extrusion form of a pipe.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Extrusion CreatePipeExtrusion(
	Cylinder cylinder,
	double otherRadius,
	bool capTop,
	bool capBottom
)
Public Shared Function CreatePipeExtrusion (
	cylinder As Cylinder,
	otherRadius As Double,
	capTop As Boolean,
	capBottom As Boolean
) As Extrusion
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
IsFinite must be true.
otherRadius
Type: System.Double
 If cylinder.Radius is less than other radius, then the cylinder will be the inside of the pipe.
capTop
Type: System.Boolean
If true, the end at cylinder.Height2 will be capped.
capBottom
Type: System.Boolean
If true, the end at cylinder.Height1 will be capped.
Return Value
Type: Extrusion
Extrusion on success. null on failure.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace