RhinoCommon SDK
GroupTable Class
Rhino for Mac 5.1
 Group tables store the list of groups in a Rhino document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.GroupTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class GroupTable
Public NotInheritable Class GroupTable
The GroupTable type exposes the following members.
Properties
Name | Description
Count
Number of groups in the group table.
Document
Document that owns this group table.
Top
Methods
Name | Description
Add()
Adds a new empty group to the group table.
Add(IEnumerable<Guid>)
 Adds a new group to the group table with a set of objects.
Add(String)
Adds a new empty group to the group table.
Add(String, IEnumerable<Guid>)
 Adds a new group to the group table with a set of objects.
AddToGroup(Int32, IEnumerable<Guid>)
 Adds a list of objects to an existing group.
AddToGroup(Int32, Guid)
 Adds an object to an existing group.
ChangeGroupName
Delete
 Deletes a group from this table.
Deleted groups are kept in the runtime group table so that undo will work with groups. Call IsDeleted() to determine if a group is deleted.
Find
Finds a group with a given name.
GroupMembers
 Gets an array of all of the objects in a group.
GroupName
GroupNames
GroupObjectCount
Hide
IsDeleted
Lock
Show
Undelete
Unlock
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace