RhinoCommon SDK
AreaMassProperties.WorldCoordinatesFirstMoments Property
Rhino for Mac 5.1
 Returns the world coordinate first moments if they were able to be calculated. X is integral of "x dm" over the area Y is integral of "y dm" over the area Z is integral of "z dm" over the area.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d WorldCoordinatesFirstMoments { get; }
Public ReadOnly Property WorldCoordinatesFirstMoments As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace