RhinoCommon SDK
ObjectTable.TransformWithHistory Method (RhinoObject, Transform)
Rhino for Mac 5.1
 Constructs a new object that is the transformation of the existing object and records history of the transformation if history recording is turned on. If history recording is not enabled, this function will act the same as Transform(obj, xform, false)
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid TransformWithHistory(
	RhinoObject obj,
	Transform xform
)
Public Function TransformWithHistory (
	obj As RhinoObject,
	xform As Transform
) As Guid
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
 Rhino object to transform.
xform
Type: Rhino.Geometry.Transform
transformation to apply.
Return Value
Type: Guid
 Id of the new object that is the transformation of the existing_object. The new object has identical attributes.
Remarks
 If the object is locked or on a locked layer, then it cannot be transformed.
See Also
Reference
ObjectTable Class
TransformWithHistory Overload
Rhino.DocObjects.Tables Namespace