RhinoCommon SDK
ColorLCH Constructor (Double, Double, Double, Double)
Rhino for Mac 5.1
 Constructs a new instance of ColorLCH with custom channel values.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ColorLCH(
	double alpha,
	double lightness,
	double chroma,
	double hue
)
Public Sub New (
	alpha As Double,
	lightness As Double,
	chroma As Double,
	hue As Double
)
Parameters
alpha
Type: System.Double
Value of Alpha channel. This channel is limited to 0~1.
lightness
Type: System.Double
Value of Lightness channel. This channel is limited to 0~1.
chroma
Type: System.Double
Value of Chroma channel. This channel is limited to -1~1.
hue
Type: System.Double
Value of Hue channel. This channel is limited to 0~360.
See Also
Reference
ColorLCH Structure
ColorLCH Overload
Rhino.Display Namespace