RhinoCommon SDK
SerializationOptions.RhinoVersion Property
Rhino for Mac 5.1
 Gets or sets a value indicating the Rhino version.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int RhinoVersion { get; set; }
Public Property RhinoVersion As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace