RhinoCommon SDK
HatchPattern Properties
Rhino for Mac 5.1
The HatchPattern type exposes the following members.
Properties
Name | Description
Description
FillType
Index
 Index in the hatch pattern table for this pattern. -1 if not in the table.
IsDeleted
 Deleted hatch patterns are kept in the runtime hatch pattern table so that undo will work with hatch patterns. Call IsDeleted to determine to determine if a hatch pattern is deleted.
IsReference
 Rhino allows multiple files to be viewed simultaneously. Hatch patterns in the document are "normal" or "reference". Reference hatch patterns are not saved.
Name
Top
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace