RhinoCommon SDK
TextDot.Text Property
Rhino for Mac 5.1
 Gets or sets the text of the textdot.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
Property Value
Type: String
See Also
Reference
TextDot Class
Rhino.Geometry Namespace