RhinoCommon SDK
PickMode Enumeration
Rhino for Mac 5.1
 Picking can happen in wireframe or shaded display mode
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum PickMode
Public Enumeration PickMode
Members
Member name | Value | Description
Wireframe | 1
Shaded | 2
See Also
Reference
Rhino.Input.Custom Namespace