RhinoCommon SDK
Sphere.LatitudeDegrees Method
Rhino for Mac 5.1
 Computes the parallel at a specific latitude angle.
The angle is specified in degrees.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Circle LatitudeDegrees(
	double degrees
)
Public Function LatitudeDegrees (
	degrees As Double
) As Circle
Parameters
degrees
Type: System.Double
An angle in degrees for the meridian.
Return Value
Type: Circle
A circle.
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace