RhinoCommon SDK
CustomObjectGrips.OnDraw Method
Rhino for Mac 5.1
 Draws the grips. In your implementation, override this if you need to draw dynamic elements and then call this base implementation to draw the grips themselves.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnDraw(
	GripsDrawEventArgs args
)
Protected Overridable Sub OnDraw (
	args As GripsDrawEventArgs
)
Parameters
args
Type: Rhino.DocObjects.Custom.GripsDrawEventArgs
The grips draw event arguments.
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace