RhinoCommon SDK
BinaryArchiveReader.ReadBool Method
Rhino for Mac 5.1
 Reads a Boolean from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ReadBool()
Public Function ReadBool As Boolean
Return Value
Type: Boolean
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace