RhinoCommon SDK
RTree.Insert Method (Point2d, IntPtr)
Rhino for Mac 5.1
Inserts an element into the tree.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Insert(
	Point2d point,
	IntPtr elementId
)
Public Function Insert (
	point As Point2d,
	elementId As IntPtr
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point2d
A point.
elementId
Type: System.IntPtr
A pointer.
Return Value
Type: Boolean
true if element was successfully inserted.
See Also
Reference
RTree Class
Insert Overload
Rhino.Geometry Namespace