RhinoCommon SDK
RTree.Insert Method (BoundingBox, IntPtr)
Rhino for Mac 5.1
Inserts an element into the tree.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Insert(
	BoundingBox box,
	IntPtr elementId
)
Public Function Insert (
	box As BoundingBox,
	elementId As IntPtr
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
A bounding box.
elementId
Type: System.IntPtr
A pointer.
Return Value
Type: Boolean
true if element was successfully inserted.
See Also
Reference
RTree Class
Insert Overload
Rhino.Geometry Namespace