RhinoCommon SDK
FontTable Class
Rhino for Mac 5.1
 Font tables store the list of fonts in a Rhino document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.FontTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class FontTable : IEnumerable<Font>,
	IEnumerable
Public NotInheritable Class FontTable
	Implements IEnumerable(Of Font), IEnumerable
The FontTable type exposes the following members.
Properties
Name | Description
Count
Number of fonts in the table.
CurrentIndex
 At all times, there is a "current" font. Unless otherwise specified, new dimension objects are assigned to the current font. The current font is never deleted. Returns: Zero based font index of the current font.
Document
Document that owns this table.
Item
Top
Methods
Name | Description
FindOrCreate
GetEnumerator
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace