RhinoCommon SDK
Curve.PullToBrepFace Method (Curve, BrepFace, Double)
Rhino for Mac 5.1
 Pull a curve to a BrepFace using closest point projection.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] PullToBrepFace(
	Curve curve,
	BrepFace face,
	double tolerance
)
Public Shared Function PullToBrepFace (
	curve As Curve,
	face As BrepFace,
	tolerance As Double
) As Curve()
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to pull.
face
Type: Rhino.Geometry.BrepFace
Brepface that pulls.
tolerance
Type: System.Double
Tolerance to use for pulling.
Return Value
Type: Curve[]
An array of pulled curves, or an empty array on failure.
See Also
Reference
Curve Class
PullToBrepFace Overload
Rhino.Geometry Namespace