RhinoCommon SDK
PlugIn.RegisterCommand Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.RegisterCommand(Rhino.Commands.Command)"]
Namespace: Rhino.PlugIns
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected bool RegisterCommand(
	Command command
)
Protected Function RegisterCommand (
	command As Command
) As Boolean
Parameters
command
Type: Rhino.Commands.Command
[Missing <param name="command"/> documentation for "M:Rhino.PlugIns.PlugIn.RegisterCommand(Rhino.Commands.Command)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.RegisterCommand(Rhino.Commands.Command)"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace