RhinoCommon SDK
DisplayPipeline.DrawCylinder Method (Cylinder, Color)
Rhino for Mac 5.1
 Draw a wireframe cylinder.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawCylinder(
	Cylinder cylinder,
	Color color
)
Public Sub DrawCylinder (
	cylinder As Cylinder,
	color As Color
)
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
Cylinder to draw.
color
Type: System.Drawing.Color
Color to draw with.
See Also
Reference
DisplayPipeline Class
DrawCylinder Overload
Rhino.Display Namespace