RhinoCommon SDK
Point3f.Origin Property
Rhino for Mac 5.1
 Gets the value of a point at location 0,0,0.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3f Origin { get; }
Public Shared ReadOnly Property Origin As Point3f
	Get
Property Value
Type: Point3f
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace