RhinoCommon SDK
Particle Class
Rhino for Mac 5.1
 Represents a simple particle.
This base class only defines position and display properties (size, color, bitmap id). You will most likely create a class that derives from this particle class to perform some sort of physical simulation (movement over time or frames).
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Particle
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class Particle
Public Class Particle
The Particle type exposes the following members.
Constructors
Name | Description
Particle
 Initializes a new instance of the Particle class.
Top
Properties
Name | Description
Color
DisplayBitmapIndex
Index
 Index in ParentSystem for this Particle. Can change when the particle system is modified.
Location
3d Location of the Particle.
ParentSystem
 Gets the parent particle system of this particle.
Size
Top
Methods
Name | Description
Update
 Base class implementation does nothing.
Top
See Also
Reference
Rhino.Geometry Namespace