RhinoCommon SDK
File3dmNotes.WindowRectangle Property
Rhino for Mac 5.1
 Gets or sets the position of the Notes when they were saved.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Rectangle WindowRectangle { get; set; }
Public Property WindowRectangle As Rectangle
	Get
	Set
Property Value
Type: Rectangle
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace