RhinoCommon SDK
BinaryArchiveWriter.WritePointF Method
Rhino for Mac 5.1
 Writes a PointF value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WritePointF(
	PointF value
)
Public Sub WritePointF (
	value As PointF
)
Parameters
value
Type: System.Drawing.PointF
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace