RhinoCommon SDK
BrepFace.CreateExtrusion Method
Rhino for Mac 5.1
 Extrude a face in a Brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep CreateExtrusion(
	Curve pathCurve,
	bool cap
)
Public Function CreateExtrusion (
	pathCurve As Curve,
	cap As Boolean
) As Brep
Parameters
pathCurve
Type: Rhino.Geometry.Curve
The path to extrude along.
cap
Type: System.Boolean
If true, the extrusion is capped with a translation of the face being extruded
Return Value
Type: Brep
A Brep on success or null on failure.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace