RhinoCommon SDK
Linetype Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Linetype"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.Linetype
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class Linetype : CommonObject
<SerializableAttribute>
Public Class Linetype
	Inherits CommonObject
The Linetype type exposes the following members.
Constructors
Name | Description
Linetype()
Initializes a new instance of the Linetype class
Linetype(SerializationInfo, StreamingContext)
Initializes a new instance of the Linetype class
Top
Properties
Name | Description
Id
 Gets the ID of this linetype object.
IsDeleted
 Gets a value indicating whether this linetype has been deleted and is currently in the Undo buffer.
IsModified
 true if this linetype has been modified by LinetypeTable.ModifyLinetype() and the modifications can be undone.
IsReference
 Gets a value indicting whether this linetype is a referenced linetype. Referenced linetypes are part of referenced documents.
LinetypeIndex
The index of this linetype.
Name
The name of this linetype.
PatternLength
Total length of one repeat of the pattern.
SegmentCount
Number of segments in the pattern.
Top
Methods
Name | Description
AppendSegment
Adds a segment to the pattern.
CommitChanges
Default
 Set linetype to default settings.
GetSegment
 Gets the segment information at a index.
RemoveSegment
Removes a segment in the linetype.
SetSegment
Sets the length and type of the segment at index.
Top
See Also
Reference
Rhino.DocObjects Namespace