RhinoCommon SDK
ObjectTable Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.ObjectTable"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.ObjectTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class ObjectTable : IEnumerable<RhinoObject>,
	IEnumerable
Public NotInheritable Class ObjectTable
	Implements IEnumerable(Of RhinoObject), IEnumerable
The ObjectTable type exposes the following members.
Properties
Name | Description
BoundingBox
 Gets the boundingbox for all objects (normal, locked and hidden) in this document that exist in "model" space. This bounding box does not include objects that exist in layout space.
BoundingBoxVisible
 Gets the boundingbox for all visible objects (normal and locked) in this document that exist in "model" space. This bounding box does not include hidden objects or any objects that exist in layout space.
Document
 Gets the document that owns this object table.
Top
Methods
Name | Description
Add(GeometryBase)
 Adds geometry that is not further specified.
This is meant, for example, to handle addition of sets of different geometrical entities.
Add(GeometryBase, ObjectAttributes)
 Adds geometry that is not further specified.
This is meant, for example, to handle addition of sets of different geometrical entities.
AddAngularDimension(AngularDimension)
AddAngularDimension(AngularDimension, ObjectAttributes)
AddAngularDimension(AngularDimension, ObjectAttributes, HistoryRecord, Boolean)
AddArc(Arc)
Adds a curve object to the document representing an arc.
AddArc(Arc, ObjectAttributes)
Adds a curve object to the document representing an arc.
AddArc(Arc, ObjectAttributes, HistoryRecord, Boolean)
AddBrep(Brep)
Adds a brep object to Rhino.
AddBrep(Brep, ObjectAttributes)
Adds a brep object to Rhino.
AddBrep(Brep, ObjectAttributes, HistoryRecord, Boolean)
AddBrep(Brep, ObjectAttributes, HistoryRecord, Boolean, Boolean)
AddCircle(Circle)
Adds a curve object to the document representing a circle.
AddCircle(Circle, ObjectAttributes)
Adds a curve object to the document representing a circle.
AddCircle(Circle, ObjectAttributes, HistoryRecord, Boolean)
AddClippingPlane(Plane, Double, Double, IEnumerable<Guid>)
 Adds a clipping plane object to Rhino.
AddClippingPlane(Plane, Double, Double, Guid)
 Adds a clipping plane object to Rhino.
AddClippingPlane(Plane, Double, Double, IEnumerable<Guid>, ObjectAttributes)
 Adds a clipping plane object to Rhino.
AddClippingPlane(Plane, Double, Double, IEnumerable<Guid>, ObjectAttributes, HistoryRecord, Boolean)
AddClippingPlane(Plane, Double, Double, Guid, ObjectAttributes, HistoryRecord, Boolean)
AddCurve(Curve)
Adds a curve object to Rhino.
AddCurve(Curve, ObjectAttributes)
Adds a curve object to Rhino.
AddCurve(Curve, ObjectAttributes, HistoryRecord, Boolean)
AddEllipse(Ellipse)
Adds a curve object to the document representing an ellipse.
AddEllipse(Ellipse, ObjectAttributes)
Adds a curve object to the document representing an ellipse.
AddEllipse(Ellipse, ObjectAttributes, HistoryRecord, Boolean)
AddExplodedInstancePieces
AddExtrusion(Extrusion)
Adds an extrusion object to Rhino.
AddExtrusion(Extrusion, ObjectAttributes)
Adds an extrusion object to Rhino.
AddExtrusion(Extrusion, ObjectAttributes, HistoryRecord, Boolean)
AddHatch(Hatch)
AddHatch(Hatch, ObjectAttributes)
AddHatch(Hatch, ObjectAttributes, HistoryRecord, Boolean)
AddInstanceObject(Int32, Transform)
AddInstanceObject(Int32, Transform, ObjectAttributes)
AddLeader(IEnumerable<Point3d>)
AddLeader(String, IEnumerable<Point3d>)
AddLeader(Plane, IEnumerable<Point2d>)
AddLeader(String, Plane, IEnumerable<Point2d>)
AddLeader(Plane, IEnumerable<Point2d>, ObjectAttributes)
AddLeader(String, Plane, IEnumerable<Point2d>, ObjectAttributes)
AddLeader(String, Plane, IEnumerable<Point2d>, ObjectAttributes, HistoryRecord, Boolean)
AddLine(Line)
Adds a line object to Rhino.
AddLine(Line, ObjectAttributes)
Adds a line object to Rhino.
AddLine(Point3d, Point3d)
Adds a line object to Rhino.
AddLine(Point3d, Point3d, ObjectAttributes)
Adds a line object to Rhino.
AddLine(Point3d, Point3d, ObjectAttributes, HistoryRecord, Boolean)
AddLinearDimension(LinearDimension)
AddLinearDimension(LinearDimension, ObjectAttributes)
AddLinearDimension(LinearDimension, ObjectAttributes, HistoryRecord, Boolean)
AddMesh(Mesh)
Adds a mesh object to Rhino.
AddMesh(Mesh, ObjectAttributes)
Adds a mesh object to Rhino.
AddMesh(Mesh, ObjectAttributes, HistoryRecord, Boolean)
AddMorphControl(MorphControl)
AddMorphControl(MorphControl, ObjectAttributes)
AddPictureFrame
 Creates a PictureFrame object from a plane and a path to an image file, Note, a PictureFrame object is just a Plane surface or mesh that has a material with a texture assigned to it that displays in all display modes.
AddPoint(Point3d)
Adds a point object to the document.
AddPoint(Point3f)
Adds a point object to the document.
AddPoint(Point3d, ObjectAttributes)
Adds a point object to the document.
AddPoint(Point3f, ObjectAttributes)
Adds a point object to the document.
AddPoint(Double, Double, Double)
 Adds a point object to the document.
AddPoint(Point3d, ObjectAttributes, HistoryRecord, Boolean)
Adds a point object to the document
AddPointCloud(IEnumerable<Point3d>)
Adds a point cloud object to the document.
AddPointCloud(PointCloud)
Adds a point cloud object to the document.
AddPointCloud(IEnumerable<Point3d>, ObjectAttributes)
Adds a point cloud object to the document.
AddPointCloud(PointCloud, ObjectAttributes)
Adds a point cloud object to the document.
AddPointCloud(IEnumerable<Point3d>, ObjectAttributes, HistoryRecord, Boolean)
Adds a point cloud object to the document.
AddPointCloud(PointCloud, ObjectAttributes, HistoryRecord, Boolean)
Adds a point cloud object to the document.
AddPoints(IEnumerable<Point3d>)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3f>)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3d>, ObjectAttributes)
 Adds multiple points to the document.
AddPoints(IEnumerable<Point3f>, ObjectAttributes)
 Adds multiple points to the document.
AddPolyline(IEnumerable<Point3d>)
Adds a polyline object to Rhino.
AddPolyline(IEnumerable<Point3d>, ObjectAttributes)
Adds a polyline object to Rhino.
AddPolyline(IEnumerable<Point3d>, ObjectAttributes, HistoryRecord, Boolean)
AddRadialDimension(RadialDimension)
AddRadialDimension(RadialDimension, ObjectAttributes)
AddRadialDimension(RadialDimension, ObjectAttributes, HistoryRecord, Boolean)
AddRhinoObject(CustomBrepObject)
AddRhinoObject(CustomMeshObject)
AddRhinoObject(CustomPointObject)
AddRhinoObject(BrepObject, Brep)
AddRhinoObject(CurveObject, Curve)
AddRhinoObject(MeshObject, Mesh)
AddRhinoObject(PointObject, Point)
AddSphere(Sphere)
AddSphere(Sphere, ObjectAttributes)
AddSphere(Sphere, ObjectAttributes, HistoryRecord, Boolean)
AddSurface(Surface)
Adds a surface object to Rhino.
AddSurface(Surface, ObjectAttributes)
Adds a surface object to Rhino.
AddSurface(Surface, ObjectAttributes, HistoryRecord, Boolean)
AddText(Text3d)
 Adds an annotation text object to the document.
AddText(TextEntity)
AddText(Text3d, ObjectAttributes)
 Adds an annotation text object to the document.
AddText(TextEntity, ObjectAttributes)
AddText(TextEntity, ObjectAttributes, HistoryRecord, Boolean)
AddText(String, Plane, Double, String, Boolean, Boolean)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean, ObjectAttributes)
 Adds an annotation text object to the document.
AddText(String, Plane, Double, String, Boolean, Boolean, TextJustification)
AddText(String, Plane, Double, String, Boolean, Boolean, TextJustification, ObjectAttributes)
AddText(String, Plane, Double, String, Boolean, Boolean, ObjectAttributes, HistoryRecord, Boolean)
AddText(String, Plane, Double, String, Boolean, Boolean, TextJustification, ObjectAttributes, HistoryRecord, Boolean)
AddTextDot(TextDot)
Adds a text dot object to Rhino.
AddTextDot(String, Point3d)
Adds a text dot object to Rhino.
AddTextDot(TextDot, ObjectAttributes)
Adds a text dot object to Rhino.
AddTextDot(String, Point3d, ObjectAttributes)
Adds a text dot object to Rhino.
AddTextDot(TextDot, ObjectAttributes, HistoryRecord, Boolean)
AllObjectsSince
 Gets all the objects that have been added to the document since a given runtime serial number.
Delete(IEnumerable<Guid>, Boolean)
 Deletes a collection of objects from the document.
Delete(Guid, Boolean)
 Deletes object from document. The deletion can be undone by calling UndeleteObject().
Delete(ObjRef, Boolean)
 Deletes objref.Object(). The deletion can be undone by calling UndeleteObject().
Delete(RhinoObject, Boolean)
 Deletes object from document. The deletion can be undone by calling UndeleteObject().
Duplicate(Guid)
 Same as TransformObject(objref, ON_Xform.Identity, false)
Duplicate(ObjRef)
 Duplicates the object that is referenced by objref.
Same as Transform(objref, Transform.Identity, false)
Duplicate(RhinoObject)
 Duplicates the object that is referenced by obj.
Same as TransformObject(obj, Transform.Identityy, false)
Find(Guid)
 Uses the object guid to find a rhino object. Deleted objects cannot be found by id. The guid is the value that is stored on RhinoObject.Id In a single document, no two active objects have the same guid. If an object is replaced with a new object, then the guid persists. For example, if the _Move command moves an object, then the moved object inherits it's guid from the starting object. If the Copy command copies an object, then the copy gets a new guid. This guid persists through file saving/openning operations. This function will not find grip objects.
Find(UInt32)
 Use the object runtime serial number to find a rhino object in the document. This is the value stored on RhinoObject.RuntimeObjectSerialNumber. The RhinoObject constructor sets the runtime serial number and every instance of a RhinoObject class will have a unique serial number for the duration of the Rhino application. If an object is replaced with a new object, then the new object will have a different runtime serial number. Deleted objects stored in the undo list maintain their runtime serial numbers and this funtion will return pointers to these objects. Call RhinoObject.IsDeleted if you need to determine if the returned object is active or deleted. The runtime serial number is not saved in files.
FindByCrossingWindowRegion(RhinoViewport, IEnumerable<Point3d>, Boolean, ObjectType)
 Finds objects bounded by a polyline region
FindByCrossingWindowRegion(RhinoViewport, Point2d, Point2d, Boolean, ObjectType)
 Finds objects bounded by a region
FindByDrawColor
 Finds all objects whose draw color matches a given color.
FindByFilter
 Same as GetObjectList but converts the result to an array.
FindByGroup
 Finds all RhinoObjects that are in a given group.
FindByLayer(String)
 Finds all RhinoObjects that are in a given layer.
FindByLayer(Layer)
 Finds all RhinoObjects that are in a given layer.
FindByObjectType
FindByUserString(String, String, Boolean)
 Finds all objects whose UserString matches the search patterns.
FindByUserString(String, String, Boolean, Boolean, Boolean, ObjectEnumeratorSettings)
 Finds all objects whose UserString matches the search patterns.
FindByUserString(String, String, Boolean, Boolean, Boolean, ObjectType)
 Finds all objects whose UserString matches the search patterns.
FindByWindowRegion(RhinoViewport, IEnumerable<Point3d>, Boolean, ObjectType)
 Finds objects bounded by a polyline region
FindByWindowRegion(RhinoViewport, Point2d, Point2d, Boolean, ObjectType)
 Finds objects bounded by a polyline region
FindClippingPlanesForViewport
 Finds all of the clipping plane objects that actively clip a viewport.
GetEnumerator
GetObjectList(Type)
GetObjectList(ObjectEnumeratorSettings)
GetObjectList(ObjectType)
GetSelectedObjects
GripUpdate
 Altered grip positions on a RhinoObject are used to calculate an updated object that is added to the document.
Hide(Guid, Boolean)
 If Object().IsNormal() is true, then the object will be hidden.
Hide(ObjRef, Boolean)
 If objref.Object().IsNormal() is true, then the object will be hidden.
Hide(RhinoObject, Boolean)
 If obj.IsNormal() is true, then the object will be hidden.
Lock(Guid, Boolean)
 If objref.Object().IsNormal() is true, then the object will be locked.
Lock(ObjRef, Boolean)
 If objref.Object().IsNormal() is true, then the object will be locked.
Lock(RhinoObject, Boolean)
 If obj.IsNormal() is true, then the object will be locked.
ModifyAttributes(Guid, ObjectAttributes, Boolean)
 Modifies an object's attributes. Cannot be used to change object id.
ModifyAttributes(ObjRef, ObjectAttributes, Boolean)
 Modifies an object's attributes. Cannot be used to change object id.
ModifyAttributes(RhinoObject, ObjectAttributes, Boolean)
 Modifies an object's attributes. Cannot be used to change object id.
ModifyTextureMapping(Guid, Int32, TextureMapping)
ModifyTextureMapping(ObjRef, Int32, TextureMapping)
ModifyTextureMapping(RhinoObject, Int32, TextureMapping)
MostRecentObject
 Gets the most recently added object that is still in the Document.
ObjectCount
Purge(UInt32)
 Removes object from document and deletes the pointer. Typically you will want to call Delete instead in order to keep the object on the undo list.
Purge(RhinoObject)
 Removes object from document and deletes the pointer. Typically you will want to call Delete instead in order to keep the object on the undo list.
Replace(Guid, Arc)
Replaces one object with new curve object.
Replace(Guid, Brep)
Replaces one object with new brep object.
Replace(Guid, Circle)
Replaces one object with new curve object.
Replace(Guid, Curve)
Replaces one object with new curve object.
Replace(Guid, Line)
Replaces one object with new line curve object.
Replace(Guid, Mesh)
Replaces one object with new mesh object.
Replace(Guid, Point3d)
Replaces one object with new point object.
Replace(Guid, PointCloud)
 Replaces one object with new pointcloud object.
Replace(Guid, Polyline)
Replaces one object with new curve object.
Replace(Guid, Surface)
Replaces one object with new surface object.
Replace(Guid, TextDot)
Replaces one object with new textdot object.
Replace(Guid, TextEntity)
 Replaces one object with new text object.
Replace(ObjRef, RhinoObject)
 Replaces one object with another. Conceptually, this function is the same as calling Setting new_object attributes = old_object attributes DeleteObject(old_object); AddObject(old_object);
Replace(ObjRef, Arc)
Replaces one object with new curve object.
Replace(ObjRef, Brep)
 Replaces one object with new brep object.
Replace(ObjRef, Circle)
Replaces one object with new curve object.
Replace(ObjRef, Curve)
 Replaces one object with new curve object.
Replace(ObjRef, Line)
Replaces one object with new line curve object.
Replace(ObjRef, Mesh)
 Replaces one object with new mesh object.
Replace(ObjRef, Point3d)
Replaces one object with new point object.
Replace(ObjRef, PointCloud)
 Replaces one object with new pointcloud object.
Replace(ObjRef, Polyline)
Replaces one object with new curve object.
Replace(ObjRef, Surface)
 Replaces one object with new surface object.
Replace(ObjRef, TextDot)
Replaces one object with new textdot object.
Replace(ObjRef, TextEntity)
 Replaces one object with new text object.
Select(IEnumerable<Guid>)
 Selects a collection of objects.
Select(Guid)
 Select a single object.
Select(ObjRef)
 Select a single object.
Select(IEnumerable<ObjRef>)
 Selects a collection of objects.
Select(IEnumerable<Guid>, Boolean)
 Selects or deselects a collection of objects.
Select(Guid, Boolean)
 Select or deselects a single object.
Select(ObjRef, Boolean)
 Select or deselects a single object.
Select(IEnumerable<ObjRef>, Boolean)
 Selects or deselects a collection of objects.
Select(Guid, Boolean, Boolean)
 Select or deselects a single object.
Select(ObjRef, Boolean, Boolean)
 Select or deselects a single object.
Select(Guid, Boolean, Boolean, Boolean)
 Select or deselects a single object.
Select(ObjRef, Boolean, Boolean, Boolean)
 Select or deselects a single object.
Select(Guid, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Select or deselects a single object.
Select(ObjRef, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Select or deselects a single object.
Show(Guid, Boolean)
 If Object().IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
Show(ObjRef, Boolean)
 If objref.Object().IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
Show(RhinoObject, Boolean)
 If obj.IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
Transform(Guid, Transform, Boolean)
 Constructs a new object that is the transformation of the existing object and deletes the existing object if deleteOriginal is true.
Transform(ObjRef, Transform, Boolean)
 Constructs a new object that is the transformation of the existing object and deletes the existing object if deleteOriginal is true.
Transform(RhinoObject, Transform, Boolean)
 Constructs a new object that is the transformation of the existing object and deletes the existing object if deleteOriginal is true.
TransformWithHistory(Guid, Transform)
 Constructs a new object that is the transformation of the existing object and records history of the transformation if history recording is turned on. If history recording is not enabled, this function will act the same as Transform(objectId, xform, false)
TransformWithHistory(ObjRef, Transform)
 Constructs a new object that is the transformation of the existing object and records history of the transformation if history recording is turned on. If history recording is not enabled, this function will act the same as Transform(objref, xform, false)
TransformWithHistory(RhinoObject, Transform)
 Constructs a new object that is the transformation of the existing object and records history of the transformation if history recording is turned on. If history recording is not enabled, this function will act the same as Transform(obj, xform, false)
Undelete(UInt32)
Undelete(RhinoObject)
Unlock(Guid, Boolean)
 If Object().IsLocked() is true, then the object will be returned to normal (visible and selectable) mode.
Unlock(ObjRef, Boolean)
 If objref.Object().IsLocked() is true, then the object will be returned to normal (visible and selectable) mode.
Unlock(RhinoObject, Boolean)
 If obj.IsLocked() is true, then the object will be returned to normal (visible and selectable) mode.
UnselectAll()
Unselect objects.
UnselectAll(Boolean)
Unselect objects.
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace