RhinoCommon SDK
Color4f.BlendTo Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.Color4f.BlendTo(System.Single,Rhino.Display.Color4f)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color4f BlendTo(
	float t,
	Color4f col
)
Public Function BlendTo (
	t As Single,
	col As Color4f
) As Color4f
Parameters
t
Type: System.Single
[Missing <param name="t"/> documentation for "M:Rhino.Display.Color4f.BlendTo(System.Single,Rhino.Display.Color4f)"]
col
Type: Rhino.Display.Color4f
[Missing <param name="col"/> documentation for "M:Rhino.Display.Color4f.BlendTo(System.Single,Rhino.Display.Color4f)"]
Return Value
Type: Color4f
[Missing <returns> documentation for "M:Rhino.Display.Color4f.BlendTo(System.Single,Rhino.Display.Color4f)"]
See Also
Reference
Color4f Structure
Rhino.Display Namespace