RhinoCommon SDK
TwistSpaceMorph Class
Rhino for Mac 5.1
Deforms objects by rotating them around an axis.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SpaceMorph
 Rhino.Geometry.Morphs.TwistSpaceMorph
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class TwistSpaceMorph : SpaceMorph,
	IDisposable
Public Class TwistSpaceMorph
	Inherits SpaceMorph
	Implements IDisposable
The TwistSpaceMorph type exposes the following members.
Constructors
Name | Description
TwistSpaceMorph
 Constructs a twist space morph.
Top
Properties
Name | Description
InfiniteTwist
 If true, the deformation is constant throughout the object, even if the axis is shorter than the object. If false, the deformation takes place only the length of the axis.
TwistAngleRadians
 Twist angle in radians.
TwistAxis
Axis to rotate about.
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
MorphPoint
Morphs an Euclidean point.
This method is abstract.
 (Overrides SpaceMorph.MorphPoint(Point3d).)
Top
See Also
Reference
Rhino.Geometry.Morphs Namespace