RhinoCommon SDK
Mesh.CreateFromCone Method
Rhino for Mac 5.1
Constructs a mesh cone
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Mesh CreateFromCone(
	Cone cone,
	int vertical,
	int around
)
Public Shared Function CreateFromCone (
	cone As Cone,
	vertical As Integer,
	around As Integer
) As Mesh
Parameters
cone
Type: Rhino.Geometry.Cone
[Missing <param name="cone"/> documentation for "M:Rhino.Geometry.Mesh.CreateFromCone(Rhino.Geometry.Cone,System.Int32,System.Int32)"]
vertical
Type: System.Int32
Number of faces in the top-to-bottom direction
around
Type: System.Int32
Number of faces around the cone
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.CreateFromCone(Rhino.Geometry.Cone,System.Int32,System.Int32)"]
Exceptions
Exception | Condition
ArgumentException | Thrown when cone is invalid.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace