RhinoCommon SDK
Interop Methods
Rhino for Mac 5.1
The Interop type exposes the following members.
Methods
Name | Description
CreateFromNativePointer
 Constructs a RhinoCommon Geometry class from a given ON_Geomety*. The ON_Geometry* must be declared on the heap and its lifetime becomes controlled by RhinoCommon.
FileWriteOptionsConstPointer
 Returns the underlying const CRhinoFileWriteOptions* for a Rhino.FileIO.FileWriteOptions object. You should only be interested in using this function if you are writing C++ code.
FromOnBrep
 Copies a Rhino_DotNet brep to a RhinoCommon brep class.
FromOnCurve
 Copies a Rhino_DotNet curve to a RhinoCommon curve class.
FromOnMesh
 Copies a Rhino_DotNet mesh to a RhinoCommon mesh class.
FromOnSurface
 Copies a Rhino_DotNet surface to a RhinoCommon Surface class.
NativeGeometryConstPointer
 Returns the underlying const ON_Geometry* for a RhinoCommon class. You should only be interested in using this function if you are writing C++ code.
NativeGeometryNonConstPointer
 Returns the underlying non-const ON_Geometry* for a RhinoCommon class. You should only be interested in using this function if you are writing C++ code.
NativeNonConstPointer
 Get ON_Viewport* from a ViewportInfo instance
NativeRhinoDocPointer
 Gets the C++ CRhinoDoc* for a given RhinoCommon RhinoDoc class.
PlugInPointer
 Gets a C++ plug-in pointer for a given RhinoCommon plug-in.
This is a Rhino SDK function.
RhinoObjectConstPointer
 Returns the underlying const CRhinoObject* for a RhinoCommon class. You should only be interested in using this function if you are writing C++ code.
RhinoObjectFromPointer
 Constructs a RhinoCommon Rhino object from an unmanaged C++ RhinoObject pointer.
ToIRhinoViewport
 Convert a Rhino.Display.Viewport to an RMA.Rhino.IRhinoViewport.
ToOnBrep
 Constructs a Rhino_DotNet OnBrep that is a copy of a given brep.
ToOnCurve
 Constructs a Rhino_DotNet OnCurve that is a copy of a given curve.
ToOnMesh
 Constructs a Rhino_DotNet OnMesh that is a copy of a given mesh.
ToOnSurface
 Constructs a Rhino_DotNet OnSurface that is a copy of a given curve.
ToOnXform
 Constructs a Rhino_DotNet OnXform from a given RhinoCommon Transform.
TryCopyFromOnArc
 Attempts to copy the contents of a RMA.OpenNURBS.OnArc to a Rhino.Geometry.Arc.
TryCopyToOnArc
 Attempts to copy the contents of a Rhino.Geometry.Arc to a RMA.OpenNURBS.OnArc.
Top
See Also
Reference
Interop Class
Rhino.Runtime Namespace