RhinoCommon SDK
Mesh.HasCachedTextureCoordinates Property
Rhino for Mac 5.1
 Will return true if SetCachedTextureCoordinates has been called; otherwise will return false.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool HasCachedTextureCoordinates { get; }
Public ReadOnly Property HasCachedTextureCoordinates As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Mesh Class
Rhino.Geometry Namespace