RhinoCommon SDK
BinaryArchiveWriter.WriteRectangle Method
Rhino for Mac 5.1
 Writes a Rectangle value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteRectangle(
	Rectangle value
)
Public Sub WriteRectangle (
	value As Rectangle
)
Parameters
value
Type: System.Drawing.Rectangle
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace