RhinoCommon SDK
HatchPattern.Description Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Description"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace