RhinoCommon SDK
Box.Transform Method
Rhino for Mac 5.1
 Transforms this Box using a Transformation matrix. If the Transform does not preserve Similarity, the dimensions of the resulting box cannot be trusted.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation matrix to apply to this Box.
Return Value
Type: Boolean
true if the Box was successfully transformed, false if otherwise.
See Also
Reference
Box Structure
Rhino.Geometry Namespace