RhinoCommon SDK
RhinoObject.IsInstanceDefinitionGeometry Property
Rhino for Mac 5.1
 true if the object is used as part of an instance definition.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsInstanceDefinitionGeometry { get; }
Public ReadOnly Property IsInstanceDefinitionGeometry As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace