RhinoCommon SDK
ObjectTable.AddRadialDimension Method (RadialDimension, ObjectAttributes, HistoryRecord, Boolean)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddRadialDimension(
	RadialDimension dimension,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddRadialDimension (
	dimension As RadialDimension,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
dimension
Type: Rhino.Geometry.RadialDimension
[Missing <param name="dimension"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
history
Type: Rhino.DocObjects.HistoryRecord
[Missing <param name="history"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
reference
Type: System.Boolean
[Missing <param name="reference"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
See Also
Reference
ObjectTable Class
AddRadialDimension Overload
Rhino.DocObjects.Tables Namespace