RhinoCommon SDK
GetBaseClass.AcceptCustomMessage Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetBaseClass.AcceptCustomMessage(System.Boolean)"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AcceptCustomMessage(
	bool enable
)
Public Sub AcceptCustomMessage (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
[Missing <param name="enable"/> documentation for "M:Rhino.Input.Custom.GetBaseClass.AcceptCustomMessage(System.Boolean)"]
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace