RhinoCommon SDK
GripsDrawEventArgs.DrawDynamicStuff Property
Rhino for Mac 5.1
 If true, then draw stuff that does not move when grips are dragged, like the control polygon of the "original" curve.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DrawDynamicStuff { get; }
Public ReadOnly Property DrawDynamicStuff As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace