RhinoCommon SDK
HistoryRecord.SetBools Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetBools(System.Int32,System.Collections.Generic.IEnumerable{System.Boolean})"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetBools(
	int id,
	IEnumerable<bool> values
)
Public Function SetBools (
	id As Integer,
	values As IEnumerable(Of Boolean)
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetBools(System.Int32,System.Collections.Generic.IEnumerable{System.Boolean})"]
values
Type: System.Collections.Generic.IEnumerable<Boolean>
[Missing <param name="values"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetBools(System.Int32,System.Collections.Generic.IEnumerable{System.Boolean})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetBools(System.Int32,System.Collections.Generic.IEnumerable{System.Boolean})"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace