RhinoCommon SDK
Surface.ToNurbsSurface Method (Double, Int32)
Rhino for Mac 5.1
 Gets a NURBS surface representation of this surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsSurface ToNurbsSurface(
	double tolerance,
	out int accuracy
)
Public Function ToNurbsSurface (
	tolerance As Double,
	<OutAttribute> ByRef accuracy As Integer
) As NurbsSurface
Parameters
tolerance
Type: System.Double
tolerance to use when creating NURBS representation.
accuracy
Type: System.Int32
 0 = unable to create NURBS representation with desired accuracy.
 1 = success - returned NURBS parameterization matches the surface's to the desired accuracy.
 2 = success - returned NURBS point locus matches the surface's to the desired accuracy and the domain of the NURBS surface is correct. However, this surface's parameterization and the NURBS surface parameterization may not match to the desired accuracy. This situation happens when getting NURBS representations of surfaces that have a transendental parameterization like spheres, cylinders, and cones.
Return Value
Type: NurbsSurface
NurbsSurface on success, null on failure.
See Also
Reference
Surface Class
ToNurbsSurface Overload
Rhino.Geometry Namespace