RhinoCommon SDK
BoundingBox.Inflate Method (Double, Double, Double)
Rhino for Mac 5.1
 Inflate the box with custom amounts in all directions. Inflating with negative amounts may result in decreasing boxes.
InValid boxes can not be inflated.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Inflate(
	double xAmount,
	double yAmount,
	double zAmount
)
Public Sub Inflate (
	xAmount As Double,
	yAmount As Double,
	zAmount As Double
)
Parameters
xAmount
Type: System.Double
Amount (in model units) to inflate this box in the x direction.
yAmount
Type: System.Double
Amount (in model units) to inflate this box in the y direction.
zAmount
Type: System.Double
Amount (in model units) to inflate this box in the z direction.
See Also
Reference
BoundingBox Structure
Inflate Overload
Rhino.Geometry Namespace