RhinoCommon SDK
ArchivableDictionary.Set Method (String, MeshingParameters)
Rhino for Mac 5.1
 Sets a MeshingParameters.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Set(
	string key,
	MeshingParameters val
)
Public Function Set (
	key As String,
	val As MeshingParameters
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: Rhino.Geometry.MeshingParameters
An object for that key.
Because this class is a reference type and is mutable, changes to this object will propagate to the object inside the dictionary.
It is up to the user to clone this entry when appropriate.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.MeshingParameters)"]
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace