RhinoCommon SDK
GetPoint.ConstrainToVirtualCPlaneIntersection Method
Rhino for Mac 5.1
 If enabled, the picked point is constrained to be on the intersection of the plane and the virtual CPlane going through the plane origin. If the planes are parallel, the constraint works just like planar constraint.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ConstrainToVirtualCPlaneIntersection(
	Plane plane
)
Public Function ConstrainToVirtualCPlaneIntersection (
	plane As Plane
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
The plane used for the plane - virtual CPlane intersection.
Return Value
Type: Boolean
true if the operation succeeded; false otherwise.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace