RhinoCommon SDK
GetPoint.PermitElevatorMode Method
Rhino for Mac 5.1
 Permits the use of the control key to define a line constraint.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PermitElevatorMode(
	int permitMode
)
Public Sub PermitElevatorMode (
	permitMode As Integer
)
Parameters
permitMode
Type: System.Int32
 0: no elevator modes are permitted 1: fixed plane elevator mode (like the Line command) 2: cplane elevator mode (like object dragging)
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace