RhinoCommon SDK
Cone.Axis Property
Rhino for Mac 5.1
Unit vector axis of cone.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d Axis { get; }
Public ReadOnly Property Axis As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Cone Structure
Rhino.Geometry Namespace