RhinoCommon SDK
File3dmObjectTable.AddHatch Method (Hatch, ObjectAttributes)
Rhino for Mac 5.1
 Adds a hatch to the document.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddHatch(
	Hatch hatch,
	ObjectAttributes attributes
)
Public Function AddHatch (
	hatch As Hatch,
	attributes As ObjectAttributes
) As Guid
Parameters
hatch
Type: Rhino.Geometry.Hatch
A hatch.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to brep.
Return Value
Type: Guid
A unique identifier for the hatch, or Empty on failure.
See Also
Reference
File3dmObjectTable Class
AddHatch Overload
Rhino.FileIO Namespace