RhinoCommon SDK
PanelIds.Materials Property
Rhino for Mac 5.1
 Rhino material browser
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid Materials { get; }
Public Shared ReadOnly Property Materials As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace