RhinoCommon SDK
TextLog Constructor
Rhino for Mac 5.1
Overload List
Name | Description
TextLog()
 Creates a text log that stores all text in memory. Use ToString on this version of the TextLog to get the text that we written
TextLog(String)
 Creates a text log that writes all text to a file. If no filename is provided, then text is written to StdOut
Top
See Also
Reference
TextLog Class
Rhino.FileIO Namespace