RhinoCommon SDK
RevSurface.Create Method (Curve, Line, Double, Double)
Rhino for Mac 5.1
 Constructs a new surface of revolution from a generatrix curve and an axis.
This overload accepts a slice start and end angles.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static RevSurface Create(
	Curve revoluteCurve,
	Line axisOfRevolution,
	double startAngleRadians,
	double endAngleRadians
)
Public Shared Function Create (
	revoluteCurve As Curve,
	axisOfRevolution As Line,
	startAngleRadians As Double,
	endAngleRadians As Double
) As RevSurface
Parameters
revoluteCurve
Type: Rhino.Geometry.Curve
A generatrix.
axisOfRevolution
Type: Rhino.Geometry.Line
An axis.
startAngleRadians
Type: System.Double
An angle in radias for the start.
endAngleRadians
Type: System.Double
An angle in radias for the end.
Return Value
Type: RevSurface
A new surface of revolution, or null if any of the inputs is invalid or on error.
See Also
Reference
RevSurface Class
Create Overload
Rhino.Geometry Namespace