RhinoCommon SDK
VolumeMassProperties.Compute Method (Brep)
Rhino for Mac 5.1
 Compute the VolumeMassProperties for a single Brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static VolumeMassProperties Compute(
	Brep brep
)
Public Shared Function Compute (
	brep As Brep
) As VolumeMassProperties
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to measure.
Return Value
Type: VolumeMassProperties
The VolumeMassProperties for the given Brep or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When brep is null.
See Also
Reference
VolumeMassProperties Class
Compute Overload
Rhino.Geometry Namespace