RhinoCommon SDK
BinaryArchiveFile.Close Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.FileIO.BinaryArchiveFile.Close"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Close()
Public Sub Close
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace