RhinoCommon SDK
ObjectTable.GetObjectList Method (ObjectType)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectList(Rhino.DocObjects.ObjectType)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerable<RhinoObject> GetObjectList(
	ObjectType typeFilter
)
Public Function GetObjectList (
	typeFilter As ObjectType
) As IEnumerable(Of RhinoObject)
Parameters
typeFilter
Type: Rhino.DocObjects.ObjectType
[Missing <param name="typeFilter"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectList(Rhino.DocObjects.ObjectType)"]
Return Value
Type: IEnumerable<RhinoObject>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectList(Rhino.DocObjects.ObjectType)"]
See Also
Reference
ObjectTable Class
GetObjectList Overload
Rhino.DocObjects.Tables Namespace