RhinoCommon SDK
Transform.Scale Method (Point3d, Double)
Rhino for Mac 5.1
 Constructs a new uniform scaling transformation with a specified scaling anchor point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform Scale(
	Point3d anchor,
	double scaleFactor
)
Public Shared Function Scale (
	anchor As Point3d,
	scaleFactor As Double
) As Transform
Parameters
anchor
Type: Rhino.Geometry.Point3d
Defines the anchor point of the scaling operation.
scaleFactor
Type: System.Double
Scaling factor in all directions.
Return Value
Type: Transform
A transform matrix which scales geometry uniformly around the anchor point.
See Also
Reference
Transform Structure
Scale Overload
Rhino.Geometry Namespace