RhinoCommon SDK
RhinoGet.GetPointOnMesh Method
Rhino for Mac 5.1
Overload List
Name | Description
GetPointOnMesh(Guid, String, Boolean, Point3d)
 Gets a point constrained to an existing mesh in the document.
GetPointOnMesh(MeshObject, String, Boolean, Point3d)
 Gets a point constrained to an existing mesh in the document.
Top
See Also
Reference
RhinoGet Class
Rhino.Input Namespace