RhinoCommon SDK
ControlPoint Constructor (Point3d, Double)
Rhino for Mac 5.1
 Constructs a new weighted control point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ControlPoint(
	Point3d pt,
	double weight
)
Public Sub New (
	pt As Point3d,
	weight As Double
)
Parameters
pt
Type: Rhino.Geometry.Point3d
Coordinate of Control Point.
weight
Type: System.Double
Weight factor of Control Point. You should not use weights equal to or less than zero.
See Also
Reference
ControlPoint Structure
ControlPoint Overload
Rhino.Geometry Namespace