RhinoCommon SDK
ControlPoint Constructor (Double, Double, Double, Double)
Rhino for Mac 5.1
 Constructs a new weighted control point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ControlPoint(
	double x,
	double y,
	double z,
	double weight
)
Public Sub New (
	x As Double,
	y As Double,
	z As Double,
	weight As Double
)
Parameters
x
Type: System.Double
X coordinate of Control Point.
y
Type: System.Double
Y coordinate of Control Point.
z
Type: System.Double
Z coordinate of Control Point.
weight
Type: System.Double
Weight factor of Control Point. You should not use weights equal to or less than zero.
See Also
Reference
ControlPoint Structure
ControlPoint Overload
Rhino.Geometry Namespace