RhinoCommon SDK
DisplayPipeline.DrawBox Method (BoundingBox, Color)
Rhino for Mac 5.1
 Draws the edges of a BoundingBox.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawBox(
	BoundingBox box,
	Color color
)
Public Sub DrawBox (
	box As BoundingBox,
	color As Color
)
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to draw.
color
Type: System.Drawing.Color
Color to draw in.
See Also
Reference
DisplayPipeline Class
DrawBox Overload
Rhino.Display Namespace