RhinoCommon SDK
DisplayPipeline.DrawDot Method (Point3d, String)
Rhino for Mac 5.1
 Draws a text dot in world coordinates.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawDot(
	Point3d worldPosition,
	string text
)
Public Sub DrawDot (
	worldPosition As Point3d,
	text As String
)
Parameters
worldPosition
Type: Rhino.Geometry.Point3d
Location of dot in world coordinates.
text
Type: System.String
Text content of dot.
See Also
Reference
DisplayPipeline Class
DrawDot Overload
Rhino.Display Namespace