RhinoCommon SDK
ObjectAttributes.DrawColor Method
Rhino for Mac 5.1
Overload List
Name | Description
DrawColor(RhinoDoc)
DrawColor(RhinoDoc, Guid)
Top
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace