RhinoCommon SDK
Texture Constructor
Rhino for Mac 5.1
Overload List
Name | Description
Texture()
 Initializes a new texture.
Texture(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
See Also
Reference
Texture Class
Rhino.DocObjects Namespace