RhinoCommon SDK
Circle.IsValid Property
Rhino for Mac 5.1
 A valid circle has radius larger than 0.0 and a base plane which is must also be valid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Circle Structure
Rhino.Geometry Namespace