RhinoCommon SDK
FontTable.Count Property
Rhino for Mac 5.1
Number of fonts in the table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
FontTable Class
Rhino.DocObjects.Tables Namespace