RhinoCommon SDK
Polyline.PointAt Method
Rhino for Mac 5.1
 Gets the point on the polyline at the given parameter. The integer part of the parameter indicates the index of the segment.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAt(
	double t
)
Public Function PointAt (
	t As Double
) As Point3d
Parameters
t
Type: System.Double
Polyline parameter.
Return Value
Type: Point3d
The point on the polyline at t.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace