RhinoCommon SDK
FileReadOptions Constructor
Rhino for Mac 5.1
Initializes a new instance of the FileReadOptions class
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public FileReadOptions()
Public Sub New
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace