RhinoCommon SDK
CustomObjectGrips.NewLocation Property
Rhino for Mac 5.1
 true if some of the grips have been moved. GripObject.NewLocation() sets NewLocation=true. Derived classes can set NewLocation to false after updating temporary display information.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool NewLocation { get; set; }
Public Property NewLocation As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace