RhinoCommon SDK
Panels.OpenPanel Method (Type)
Rhino for Mac 5.1
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void OpenPanel(
	Type panelType
)
Public Shared Sub OpenPanel (
	panelType As Type
)
Parameters
panelType
Type: System.Type
 Class type of the panel to open.
See Also
Reference
Panels Class
OpenPanel Overload
Rhino.UI Namespace