RhinoCommon SDK
Panels.OpenPanel Method (Guid, Guid)
Rhino for Mac 5.1
 In Mac Rhino this will just call the version of OpenPanel that takes a class type Id. In Windows Rhino this will look for a dock bar with the specified Id and open or move the specified panel to that dock bar.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid OpenPanel(
	Guid dockBarId,
	Guid panelId
)
Public Shared Function OpenPanel (
	dockBarId As Guid,
	panelId As Guid
) As Guid
Parameters
dockBarId
Type: System.Guid
 Id of the dock bar hosting one or more panels.
panelId
Type: System.Guid
 Class type Id for the panel to open.
Return Value
Type: Guid
 Returns true if the
See Also
Reference
Panels Class
OpenPanel Overload
Rhino.UI Namespace