RhinoCommon SDK
VisualAnalysisMode.Id Property
Rhino for Mac 5.1
 Gets the visual analysis mode GUID. The Guid is specified with the GuidAttribute applied to the class.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace