RhinoCommon SDK
ObjectEnumeratorSettings.VisibleFilter Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.VisibleFilter"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool VisibleFilter { get; set; }
Public Property VisibleFilter As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace