RhinoCommon SDK
DisplayPipeline.DrawLine Method (Point3d, Point3d, Color, Int32)
Rhino for Mac 5.1
 Draws a single line object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawLine(
	Point3d from,
	Point3d to,
	Color color,
	int thickness
)
Public Sub DrawLine (
	from As Point3d,
	to As Point3d,
	color As Color,
	thickness As Integer
)
Parameters
from
Type: Rhino.Geometry.Point3d
Line from point.
to
Type: Rhino.Geometry.Point3d
Line to point.
color
Type: System.Drawing.Color
Color to draw line in.
thickness
Type: System.Int32
Thickness (in pixels) of line.
See Also
Reference
DisplayPipeline Class
DrawLine Overload
Rhino.Display Namespace