RhinoCommon SDK
Material Constructor
Rhino for Mac 5.1
Initializes a new instance of the Material class
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Material()
Public Sub New
See Also
Reference
Material Class
Material Overload
Rhino.DocObjects Namespace