RhinoCommon SDK
GetBaseClass.GetSelectedEnumValueFromSelectionList<T> Method
Rhino for Mac 5.1
 Returns the selected enum value by looking at the list of values from which to select. Use this in combination with AddOptionEnumSelectionList<T>(String, IEnumerable<T>, Int32)
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public T GetSelectedEnumValueFromSelectionList<T>(
	IEnumerable<T> selectionList
)
where T : struct, new(), IConvertible
Public Function GetSelectedEnumValueFromSelectionList(Of T As {Structure, New, IConvertible}) (
	selectionList As IEnumerable(Of T)
) As T
Parameters
selectionList
Type: System.Collections.Generic.IEnumerable<T>
Type Parameters
T
Return Value
Type: T
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetBaseClass.GetSelectedEnumValueFromSelectionList``1(System.Collections.Generic.IEnumerable{``0})"]
Exceptions
Exception | Condition
ArgumentException | Gets thrown if type T is not an enum type.
IndexOutOfRangeException | If 0 >= CurrentListOptionIndex or CurrentListOptionIndex > N where N is the number of enum values.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace