RhinoCommon SDK
ObjectTable.AllObjectsSince Method
Rhino for Mac 5.1
 Gets all the objects that have been added to the document since a given runtime serial number.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject[] AllObjectsSince(
	uint runtimeSerialNumber
)
Public Function AllObjectsSince (
	runtimeSerialNumber As UInteger
) As RhinoObject()
Parameters
runtimeSerialNumber
Type: System.UInt32
Runtime serial number of the last object not to include in the list.
Return Value
Type: RhinoObject[]
An array of objects or null if no objects were added since the given runtime serial number.
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace