RhinoCommon SDK
ObjectTable.Lock Method (RhinoObject, Boolean)
Rhino for Mac 5.1
 If obj.IsNormal() is true, then the object will be locked.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Lock(
	RhinoObject obj,
	bool ignoreLayerMode
)
Public Function Lock (
	obj As RhinoObject,
	ignoreLayerMode As Boolean
) As Boolean
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
normal object to lock.
ignoreLayerMode
Type: System.Boolean
 if true, the object will be locked even if it is on a layer that is locked or off.
Return Value
Type: Boolean
true if the object was successfully locked.
See Also
Reference
ObjectTable Class
Lock Overload
Rhino.DocObjects.Tables Namespace