RhinoCommon SDK
Extrusion.IsCappedAtTop Property
Rhino for Mac 5.1
 Gets a value indicating whether the surface that fills the top profile is existing.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsCappedAtTop { get; }
Public ReadOnly Property IsCappedAtTop As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace