RhinoCommon SDK
DisplayPipeline.DrawMeshFalseColors Method
Rhino for Mac 5.1
 Draws the mesh faces as false color patches. The mesh must have Vertex Colors defined for this to work.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawMeshFalseColors(
	Mesh mesh
)
Public Sub DrawMeshFalseColors (
	mesh As Mesh
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to draw.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace