RhinoCommon SDK
ZBiasMode Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.ZBiasMode"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum ZBiasMode
Public Enumeration ZBiasMode
Members
Member name | Value | Description
Neutral | 0
TowardsCamera | 1
AwayFromCamera | 2
See Also
Reference
Rhino.Display Namespace