RhinoCommon SDK
Command.LastCommandResult Property
Rhino for Mac 5.1
 Gets the result code of the last command.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result LastCommandResult { get; }
Public Shared ReadOnly Property LastCommandResult As Result
	Get
Property Value
Type: Result
See Also
Reference
Command Class
Rhino.Commands Namespace