RhinoCommon SDK
Intersection.MeshPlane Method (Mesh, IEnumerable<Plane>)
Rhino for Mac 5.1
 Intersects a mesh with a collection of (infinite) planes.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Polyline[] MeshPlane(
	Mesh mesh,
	IEnumerable<Plane> planes
)
Public Shared Function MeshPlane (
	mesh As Mesh,
	planes As IEnumerable(Of Plane)
) As Polyline()
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to intersect.
planes
Type: System.Collections.Generic.IEnumerable<Plane>
Planes to intersect with.
Return Value
Type: Polyline[]
An array of polylines describing the intersection loops or null (Nothing in Visual Basic) if no intersections could be found.
Exceptions
Exception | Condition
ArgumentNullException | If planes is null.
See Also
Reference
Intersection Class
MeshPlane Overload
Rhino.Geometry.Intersect Namespace