RhinoCommon SDK
Interpolator Constructor (Int32, Double)
Rhino for Mac 5.1
 Constructs a new Interpolator with a specified amount of numbers.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interpolator(
	int amount,
	double defaultValue
)
Public Sub New (
	amount As Integer,
	defaultValue As Double
)
Parameters
amount
Type: System.Int32
Number of values to add to this Interpolator. Must be equal to or larger than zero.
defaultValue
Type: System.Double
Number to add.
See Also
Reference
Interpolator Class
Interpolator Overload
Rhino.Geometry Namespace