RhinoCommon SDK
Interpolator Constructor (Int32)
Rhino for Mac 5.1
 Constructs an empty Interpolator with a certain capacity.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interpolator(
	int initialCapacity
)
Public Sub New (
	initialCapacity As Integer
)
Parameters
initialCapacity
Type: System.Int32
Number of items this interpolator can store without resizing.
See Also
Reference
Interpolator Class
Interpolator Overload
Rhino.Geometry Namespace