RhinoCommon SDK
Interpolator Constructor (RhinoList<Double>)
Rhino for Mac 5.1
 Copy all the numbers from an existing RhinoList.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interpolator(
	RhinoList<double> list
)
Public Sub New (
	list As RhinoList(Of Double)
)
Parameters
list
Type: Rhino.Collections.RhinoList<Double>
List to mimic.
See Also
Reference
Interpolator Class
Interpolator Overload
Rhino.Geometry Namespace