RhinoCommon SDK
Interpolator Constructor (IEnumerable<Double>)
Rhino for Mac 5.1
 Constructs an Interpolator from a collection of numbers.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interpolator(
	IEnumerable<double> collection
)
Public Sub New (
	collection As IEnumerable(Of Double)
)
Parameters
collection
Type: System.Collections.Generic.IEnumerable<Double>
Collection of numbers to duplicate.
See Also
Reference
Interpolator Class
Interpolator Overload
Rhino.Geometry Namespace