RhinoCommon SDK
OptionsDialogPage Constructor
Rhino for Mac 5.1
Initializes a new instance of the OptionsDialogPage class
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected OptionsDialogPage(
	string englishPageTitle
)
Protected Sub New (
	englishPageTitle As String
)
Parameters
englishPageTitle
Type: System.String
[Missing <param name="englishPageTitle"/> documentation for "M:Rhino.UI.OptionsDialogPage.#ctor(System.String)"]
See Also
Reference
OptionsDialogPage Class
Rhino.UI Namespace