RhinoCommon SDK
MeshFace.B Property
Rhino for Mac 5.1
 Gets or sets the second corner index of the mesh face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int B { get; set; }
Public Property B As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace