RhinoCommon SDK
MeshFace.A Property
Rhino for Mac 5.1
 Gets or sets the first corner index of the mesh face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int A { get; set; }
Public Property A As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace