RhinoCommon SDK
Point2f Constructor (Double, Double)
Rhino for Mac 5.1
 Initializes a new two-dimensional point from two double-precision floating point numbers as coordinates.
Coordinates will be internally converted to floating point numbers. This might cause precision loss.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2f(
	double x,
	double y
)
Public Sub New (
	x As Double,
	y As Double
)
Parameters
x
Type: System.Double
X component of vector.
y
Type: System.Double
Y component of vector.
See Also
Reference
Point2f Structure
Point2f Overload
Rhino.Geometry Namespace