RhinoCommon SDK
Mesh.CreateFromBox Method (Box, Int32, Int32, Int32)
Rhino for Mac 5.1
 Constructs new mesh that matches an aligned box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Mesh CreateFromBox(
	Box box,
	int xCount,
	int yCount,
	int zCount
)
Public Shared Function CreateFromBox (
	box As Box,
	xCount As Integer,
	yCount As Integer,
	zCount As Integer
) As Mesh
Parameters
box
Type: Rhino.Geometry.Box
Box to match.
xCount
Type: System.Int32
Number of faces in x-direction.
yCount
Type: System.Int32
Number of faces in y-direction.
zCount
Type: System.Int32
Number of faces in z-direction.
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.CreateFromBox(Rhino.Geometry.Box,System.Int32,System.Int32,System.Int32)"]
See Also
Reference
Mesh Class
CreateFromBox Overload
Rhino.Geometry Namespace