RhinoCommon SDK
Mesh.CreateFromBox Method (IEnumerable<Point3d>, Int32, Int32, Int32)
Rhino for Mac 5.1
 Constructs new mesh from 8 corner points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Mesh CreateFromBox(
	IEnumerable<Point3d> corners,
	int xCount,
	int yCount,
	int zCount
)
Public Shared Function CreateFromBox (
	corners As IEnumerable(Of Point3d),
	xCount As Integer,
	yCount As Integer,
	zCount As Integer
) As Mesh
Parameters
corners
Type: System.Collections.Generic.IEnumerable<Point3d>
 8 points defining the box corners arranged as the vN labels indicate.
v7_____________v6
\             |\
\            | \
\ _____________\
v4         |   v5
v3--|----------v2
 \  |           \
  \ |            \
   \|             \
    v0_____________v1
xCount
Type: System.Int32
Number of faces in x-direction.
yCount
Type: System.Int32
Number of faces in y-direction.
zCount
Type: System.Int32
Number of faces in z-direction.
Return Value
Type: Mesh
A new brep, or null on failure.
Return Value
Type: Mesh
A new box mesh, on null on error.
See Also
Reference
Mesh Class
CreateFromBox Overload
Rhino.Geometry Namespace