RhinoCommon SDK
ViewportInfo.SetScreenPort Method (Rectangle)
Rhino for Mac 5.1
 Gets the location of viewport in pixels.
See value meanings in SetScreenPort.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetScreenPort(
	Rectangle windowRectangle
)
Public Function SetScreenPort (
	windowRectangle As Rectangle
) As Boolean
Parameters
windowRectangle
Type: System.Drawing.Rectangle
A new rectangle.
Return Value
Type: Boolean
true if input is valid.
See Also
Reference
ViewportInfo Class
SetScreenPort Overload
Rhino.DocObjects Namespace