RhinoCommon SDK
ControlPoint Constructor
Rhino for Mac 5.1
Overload List
Name | Description
ControlPoint(Point3d)
 Constructs a new unweighted control point.
ControlPoint(Point4d)
 Constructs a new weighted control point.
ControlPoint(Point3d, Double)
 Constructs a new weighted control point.
ControlPoint(Double, Double, Double)
 Constructs a new unweighted control point.
ControlPoint(Double, Double, Double, Double)
 Constructs a new weighted control point.
Top
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace