RhinoCommon SDK
CachedTextureCoordinates.Item Property
Rhino for Mac 5.1
 Gets the element at the specified index. Never call the set method, it will always throw a NotSupportedException because this list is read-only.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Point3d
	Get
	Set
Parameters
index
Type: System.Int32
 The zero-based index of the element to get.
Return Value
Type: Point3d
 The element at the specified index.
Implements
IList<T>.Item[Int32]
Exceptions
Exception | Condition
NotSupportedException |  IList implementation, this list is always read-only so calling the set method will always cause a NotSupportedException to be thrown.
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace