RhinoCommon SDK
Layer.IsChildOf Method (Int32)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(System.Int32)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsChildOf(
	int layerIndex
)
Public Function IsChildOf (
	layerIndex As Integer
) As Boolean
Parameters
layerIndex
Type: System.Int32
[Missing <param name="layerIndex"/> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(System.Int32)"]
See Also
Reference
Layer Class
IsChildOf Overload
Rhino.DocObjects Namespace