RhinoCommon SDK
BitmapTable Properties
Rhino for Mac 5.1
The BitmapTable type exposes the following members.
Properties
Name | Description
Count
Gets the number of bitmaps in the table.
Document
Gets the document that owns this bitmap table.
Item
 Conceptually, the bitmap table is an array of bitmaps. The operator[] can be used to get individual bitmaps.
Top
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace