RhinoCommon SDK
BrepCurveList Methods
Rhino for Mac 5.1
The BrepCurveList type exposes the following members.
Methods
Name | Description
Add
Adds a curve
GetEnumerator
Get an enumerator that visits all curves.
Top
See Also
Reference
BrepCurveList Class
Rhino.Geometry.Collections Namespace