RhinoCommon SDK
OptionColor.Dispose Method
Rhino for Mac 5.1
Overload List
Name | Description
Dispose()
Releases all resources used by the OptionColor
Dispose(Boolean)
Releases the unmanaged resources used by the OptionColor and optionally releases the managed resources
Top
See Also
Reference
OptionColor Class
Rhino.Input.Custom Namespace