RhinoCommon SDK
GetObject.EnableClearObjectsOnEntry Method
Rhino for Mac 5.1
 By default the picked object list is cleared when GetObject.GetObjects() is called. If you are reusing a GetObject class and do not want the existing object list cleared when you call Input, then call EnableClearObjectsOnEntry(false) before calling GetObjects().
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableClearObjectsOnEntry(
	bool enable
)
Public Sub EnableClearObjectsOnEntry (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
The state to set.
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace