RhinoCommon SDK
Curve.GetNurbsFormParameterFromCurveParameter Method
Rhino for Mac 5.1
Convert a curve parameter to a NURBS curve parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetNurbsFormParameterFromCurveParameter(
	double curveParameter,
	out double nurbsParameter
)
Public Function GetNurbsFormParameterFromCurveParameter (
	curveParameter As Double,
	<OutAttribute> ByRef nurbsParameter As Double
) As Boolean
Parameters
curveParameter
Type: System.Double
Curve parameter.
nurbsParameter
Type: System.Double
Nurbs form parameter.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
 If GetNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.
See Also
Reference
Curve Class
Rhino.Geometry Namespace