RhinoCommon SDK
DisplayPipeline.DrawPolyline Method (IEnumerable<Point3d>, Color)
Rhino for Mac 5.1
 Draws a single Polyline object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawPolyline(
	IEnumerable<Point3d> polyline,
	Color color
)
Public Sub DrawPolyline (
	polyline As IEnumerable(Of Point3d),
	color As Color
)
Parameters
polyline
Type: System.Collections.Generic.IEnumerable<Point3d>
Polyline to draw.
color
Type: System.Drawing.Color
Color to draw in.
See Also
Reference
DisplayPipeline Class
DrawPolyline Overload
Rhino.Display Namespace