RhinoCommon SDK
Curve.TryGetPlane Method
Rhino for Mac 5.1
Overload List
Name | Description
TryGetPlane(Plane)
Test a curve for planarity and return the plane.
TryGetPlane(Plane, Double)
Test a curve for planarity and return the plane.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace