RhinoCommon SDK
ViewInfo Properties
Rhino for Mac 5.1
The ViewInfo type exposes the following members.
Properties
Name | Description
Name
 Gets or sets the name of the NamedView.
Viewport
 Gets the viewport, or viewing frustum, associated with this view.
Top
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace