RhinoCommon SDK
MeshVertexList.CombineIdentical Method
Rhino for Mac 5.1
 Merges identical vertices.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool CombineIdentical(
	bool ignoreNormals,
	bool ignoreAdditional
)
Public Function CombineIdentical (
	ignoreNormals As Boolean,
	ignoreAdditional As Boolean
) As Boolean
Parameters
ignoreNormals
Type: System.Boolean
 If true, vertex normals will not be taken into consideration when comparing vertices.
ignoreAdditional
Type: System.Boolean
 If true, texture coordinates, colors, and principal curvatures will not be taken into consideration when comparing vertices.
Return Value
Type: Boolean
 true if the mesh is changed, in which case the mesh will have fewer vertices than before.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace