RhinoCommon SDK
IPanelsService.OpenPanel Method (Guid, Guid)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid,System.Guid)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
Guid OpenPanel(
	Guid dockBarId,
	Guid panelId
)
Function OpenPanel (
	dockBarId As Guid,
	panelId As Guid
) As Guid
Parameters
dockBarId
Type: System.Guid
[Missing <param name="dockBarId"/> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid,System.Guid)"]
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid,System.Guid)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid,System.Guid)"]
See Also
Reference
IPanelsService Interface
OpenPanel Overload
Rhino.UI Namespace