RhinoCommon SDK
BrepVertexList.GetEnumerator Method
Rhino for Mac 5.1
 Gets an enumerator that visits all surfaces.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<BrepVertex> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepVertex)
Return Value
Type: IEnumerator<BrepVertex>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
BrepVertexList Class
Rhino.Geometry.Collections Namespace