RhinoCommon SDK
Dialogs.ShowMessage Method
Rhino for Mac 5.1
Overload List
Name | Description
ShowMessage(String, String)
 Same as System.Windows.Froms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessage(String, String, ShowMessageButton, ShowMessageIcon)
 Same as System.Windows.Froms.MessageBox.Show but using a message box tailored to Rhino.
Top
See Also
Reference
Dialogs Class
Rhino.UI Namespace