RhinoCommon SDK
PolylineCurve Constructor
Rhino for Mac 5.1
 Initializes a new empty polyline curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PolylineCurve()
Public Sub New
See Also
Reference
PolylineCurve Class
PolylineCurve Overload
Rhino.Geometry Namespace