RhinoCommon SDK
Curve.Contains Method
Rhino for Mac 5.1
Overload List
Name | Description
Contains(Point3d)
 Computes the relationship between a point and a closed curve region. This curve must be closed or the return value will be Unset. Both curve and point are projected to the World XY plane.
Contains(Point3d, Plane)
 Computes the relationship between a point and a closed curve region. This curve must be closed or the return value will be Unset.
Contains(Point3d, Plane, Double)
 Computes the relationship between a point and a closed curve region. This curve must be closed or the return value will be Unset.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace