RhinoCommon SDK
RhinoView.Close Method
Rhino for Mac 5.1
 Remove this View from Rhino. DO NOT attempt to use this instance of this class after calling Close.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Close()
Public Function Close As Boolean
Return Value
Type: Boolean
true on success
See Also
Reference
RhinoView Class
Rhino.Display Namespace