RhinoCommon SDK
RhinoViewport.ChangeToParallelProjection Method
Rhino for Mac 5.1
 Use this function to change projections of valid viewports from persective to parallel. It will make common additional adjustments to the frustum so the resulting views are similar. The camera location and direction will not be changed.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ChangeToParallelProjection(
	bool symmetricFrustum
)
Public Function ChangeToParallelProjection (
	symmetricFrustum As Boolean
) As Boolean
Parameters
symmetricFrustum
Type: System.Boolean
true if you want the resulting frustum to be symmetric.
Return Value
Type: Boolean
 If the current projection is parallel and bSymmetricFrustum, FrustumIsLeftRightSymmetric() and FrustumIsTopBottomSymmetric() are all equal, then no changes are made and true is returned.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace