RhinoCommon SDK
Curve.IsCircle Method
Rhino for Mac 5.1
 Test a curve to see if it can be represented by a circle within RhinoMath.ZeroTolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsCircle()
Public Function IsCircle As Boolean
Return Value
Type: Boolean
 true if the Curve can be represented by a circle within tolerance.
See Also
Reference
Curve Class
IsCircle Overload
Rhino.Geometry Namespace