RhinoCommon SDK
MeshFace Constructor
Rhino for Mac 5.1
Overload List
Name | Description
MeshFace(Int32, Int32, Int32)
 Constructs a new triangular Mesh face.
MeshFace(Int32, Int32, Int32, Int32)
 Constructs a new quadrangular Mesh face.
Top
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace