RhinoCommon SDK
MaterialRefs.Clear Method
Rhino for Mac 5.1
 Removes all items from this dictionary.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace