RhinoCommon SDK
DisplayModeDescription.GetDisplayMode Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayModeDescription.GetDisplayMode(System.Guid)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static DisplayModeDescription GetDisplayMode(
	Guid id
)
Public Shared Function GetDisplayMode (
	id As Guid
) As DisplayModeDescription
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Display.DisplayModeDescription.GetDisplayMode(System.Guid)"]
Return Value
Type: DisplayModeDescription
[Missing <returns> documentation for "M:Rhino.Display.DisplayModeDescription.GetDisplayMode(System.Guid)"]
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace