RhinoCommon SDK
GetResult Enumeration
Rhino for Mac 5.1
 Possible results from GetObject.Get(), GetPoint.Get(), etc...
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum GetResult
Public Enumeration GetResult
Members
Member name | Value | Description
NoResult | 0
Cancel | 1 | User wants to cancel current command.
Nothing | 2 | User pressed enter - typically used to accept defaults.
Option | 3 | User specified an option - call Option() to get option index.
Number | 4 | User entered a real number - call Number() to get value.
Color | 5 | User entered a color - call Color() to get value.
Undo | 6 | User pressed undo.
Miss | 7 | User clicked and missed.
Point | 8 | User picked 3d point - call Point() to get 3d point.
Point2d | 9 |  User picked 2d window point in CRhinoGetPoint::Get2dPoint() call ON_2dPoint() to get the point and View() to get the view.
Line2d | 10 |  User picked a 2d line in CRhinoGetPoint::Get2dLine() call Line2d() to get the line and View() to get the view.
Rectangle2d | 11 |  User picked a 2d rectangle in CRhinoGetPoint::Get2dRectangle() call Rectangle2d() to get the rectangle and View() to get the view.
Object | 12 | User selected an object - call Object() to get object.
String | 13 | User typed a string - call String() to get the string.
CustomMessage | 14 |  A custom message was posted to the RhinoGet
Timeout | 15 |  The getter waited for the amount of time specifed in RhinoGet::SetWaitDuration() and then gave up.
Circle | 16 | call CRhinoGetCircle::GetCircle() to get the circle.
Plane | 17 | call CRhinoGetPlane::GetPlane() to get the plane.
Cylinder | 18 | call CRhinoGetCylinder::GetCylinder() to get the cylinder.
Sphere | 19 | call CRhinoGetSphere::GetSphere() to get the sphere.
Angle | 20 | call CRhinoGetAngle::Angle() to get the angle in radians (CRhinoGetAngle() returns this for typed number, too).
Distance | 21 | call CRhinoGetDistance::Distance() to get the distance value.
Direction | 22 | call CRhinoGetDirection::Direction() to get the direction vector.
Frame | 23 | call CRhinoGetFrame::Frame() to get the frame that was picked.
User1 | 4294967295
User2 | 4294967294
User3 | 4294967293
User4 | 4294967292
User5 | 4294967291
ExitRhino | 268435455 | Stop now, do not cleaup, just return ASAP.
See Also
Reference
Rhino.Input Namespace