RhinoCommon SDK
DisplayPipeline.CullControlPolygon Method
Rhino for Mac 5.1
 Returns a value indicating if only points on the side of the surface that face the camera are displayed.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool CullControlPolygon()
Public Shared Function CullControlPolygon As Boolean
Return Value
Type: Boolean
true if backfaces of surface and mesh control polygons are culled. This value is determined by the _CullControlPolygon command.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace