RhinoCommon SDK
Plane.FitPlaneToPoints Method (IEnumerable<Point3d>, Plane, Double)
Rhino for Mac 5.1
Fit a plane through a collection of points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static PlaneFitResult FitPlaneToPoints(
	IEnumerable<Point3d> points,
	out Plane plane,
	out double maximumDeviation
)
Public Shared Function FitPlaneToPoints (
	points As IEnumerable(Of Point3d),
	<OutAttribute> ByRef plane As Plane,
	<OutAttribute> ByRef maximumDeviation As Double
) As PlaneFitResult
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to fit to.
plane
Type: Rhino.Geometry.Plane
Resulting plane.
maximumDeviation
Type: System.Double
The distance from the furthest point to the plane.
Return Value
Type: PlaneFitResult
A value indicating the result of the operation.
See Also
Reference
Plane Structure
FitPlaneToPoints Overload
Rhino.Geometry Namespace