RhinoCommon SDK
Material.SetBitmapTexture Method
Rhino for Mac 5.1
Overload List
Name | Description
SetBitmapTexture(String)
SetBitmapTexture(Texture)
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace