RhinoCommon SDK
VisualAnalysisMode.Find Method (Type)
Rhino for Mac 5.1
 Finds a visual analysis mode by type.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static VisualAnalysisMode Find(
	Type t
)
Public Shared Function Find (
	t As Type
) As VisualAnalysisMode
Parameters
t
Type: System.Type
A visual analysis mode type.
Return Value
Type: VisualAnalysisMode
A visual analysis mode on success, or null on error.
See Also
Reference
VisualAnalysisMode Class
Find Overload
Rhino.Display Namespace