RhinoCommon SDK
GetLine.HaveFeedbackColor Property
Rhino for Mac 5.1
 If true, the feedback color is used to draw the dynamic line when the second point is begin picked. If false, the active layer color is used.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool HaveFeedbackColor { get; }
Public ReadOnly Property HaveFeedbackColor As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace