RhinoCommon SDK
Torus.Plane Property
Rhino for Mac 5.1
 Gets or sets the plane for the torus large circle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Torus Structure
Rhino.Geometry Namespace