RhinoCommon SDK
BinaryArchiveReader.ReadPlane Method
Rhino for Mac 5.1
 Reads a Plane from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Plane ReadPlane()
Public Function ReadPlane As Plane
Return Value
Type: Plane
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace