RhinoCommon SDK
Vector3d.VectorAngle Method (Vector3d, Vector3d)
Rhino for Mac 5.1
 Compute the angle between two vectors.
This operation is commutative.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static double VectorAngle(
	Vector3d a,
	Vector3d b
)
Public Shared Function VectorAngle (
	a As Vector3d,
	b As Vector3d
) As Double
Parameters
a
Type: Rhino.Geometry.Vector3d
First vector for angle.
b
Type: Rhino.Geometry.Vector3d
Second vector for angle.
Return Value
Type: Double
If the input is valid, the angle (in radians) between a and b; RhinoMath.UnsetValue otherwise.
See Also
Reference
Vector3d Structure
VectorAngle Overload
Rhino.Geometry Namespace