RhinoCommon SDK
Mesh.PartitionCount Property
Rhino for Mac 5.1
 Number of partition information chunks stored on this mesh based on the last call to CreatePartitions
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int PartitionCount { get; }
Public ReadOnly Property PartitionCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Mesh Class
Rhino.Geometry Namespace