RhinoCommon SDK
ColorHSL.ToArgbColor Method
Rhino for Mac 5.1
 Convert HSL color to an equivalent System.Drawing.Color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color ToArgbColor()
Public Function ToArgbColor As Color
Return Value
Type: Color
A .Net framework library color value.
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace