RhinoCommon SDK
GetLine.FixedLength Property
Rhino for Mac 5.1
 If FixedLength > 0, the line must have the specified length
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double FixedLength { get; set; }
Public Property FixedLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace