RhinoCommon SDK
RhinoGet.GetSpiral Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetSpiral(Rhino.Geometry.NurbsCurve@)"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetSpiral(
	out NurbsCurve spiral
)
Public Shared Function GetSpiral (
	<OutAttribute> ByRef spiral As NurbsCurve
) As Result
Parameters
spiral
Type: Rhino.Geometry.NurbsCurve
[Missing <param name="spiral"/> documentation for "M:Rhino.Input.RhinoGet.GetSpiral(Rhino.Geometry.NurbsCurve@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetSpiral(Rhino.Geometry.NurbsCurve@)"]
See Also
Reference
RhinoGet Class
Rhino.Input Namespace