RhinoCommon SDK
BrepRegion.IsFinite Property
Rhino for Mac 5.1
 Gets a value indicating whether this region is finite.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsFinite { get; }
Public ReadOnly Property IsFinite As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace