RhinoCommon SDK
ObjectTable.Purge Method
Rhino for Mac 5.1
Overload List
Name | Description
Purge(UInt32)
 Removes object from document and deletes the pointer. Typically you will want to call Delete instead in order to keep the object on the undo list.
Purge(RhinoObject)
 Removes object from document and deletes the pointer. Typically you will want to call Delete instead in order to keep the object on the undo list.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace