RhinoCommon SDK
Localization Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.Localization"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Localization
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static class Localization
Public NotInheritable Class Localization
The Localization type exposes the following members.
Properties
Name | Description
CurrentLanguageId
RunningAsEnglish
Top
Methods
Name | Description
FormatNumber
 Get a string version of a number in a given unit system / display mode.
LocalizeCommandName(String)
 Commands that need to be localized should call this function.
LocalizeCommandName(String, Object)
LocalizeCommandOptionName(String, Int32)
LocalizeCommandOptionName(String, Object, Int32)
LocalizeCommandOptionValue(String, Int32)
LocalizeCommandOptionValue(String, Object, Int32)
LocalizeDialogItem
 Look in the dialog item list for the specified key and return the translated localized string if the key is found otherwise return the English string.
LocalizeString(String, Int32)
 Returns localized version of a given English string. This function should be autogenerated by the RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
LocalizeString(String, Object, Int32)
 Returns localized version of a given English string. This function should be autogenerated by the RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
SetLanguageId
 Sets the Id used for Localization in RhinoCommon. Only useful for when using RhinoCommon outside of the Rhino process
UnitSystemName
 Gets localized unit system name. Uses current application locale id.
Top
See Also
Reference
Rhino.UI Namespace