RhinoCommon SDK
Line.UnitTangent Property
Rhino for Mac 5.1
 Gets the tangent of the line segment. Note that tangent vectors are always unit vectors.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d UnitTangent { get; }
Public ReadOnly Property UnitTangent As Vector3d
	Get
Property Value
Type: Vector3d
Sets only the direction of the line, the length is maintained.
See Also
Reference
Line Structure
Rhino.Geometry Namespace