RhinoCommon SDK
Line.Unset Property
Rhino for Mac 5.1
 Gets a line segment which has Unset end points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Line Unset { get; }
Public Shared ReadOnly Property Unset As Line
	Get
Property Value
Type: Line
See Also
Reference
Line Structure
Rhino.Geometry Namespace