RhinoCommon SDK
DisplayPipeline.DrawBrepShaded Method
Rhino for Mac 5.1
 Draws a shaded mesh representation of a brep.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawBrepShaded(
	Brep brep,
	DisplayMaterial material
)
Public Sub DrawBrepShaded (
	brep As Brep,
	material As DisplayMaterial
)
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to draw.
material
Type: Rhino.Display.DisplayMaterial
Material to draw faces with.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace