RhinoCommon SDK
Material.GetUserString Method
Rhino for Mac 5.1
 Gets a user string.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string GetUserString(
	string key
)
Public Function GetUserString (
	key As String
) As String
Parameters
key
Type: System.String
id used to retrieve the string.
Return Value
Type: String
string associated with the key if successful. null if no key was found.
See Also
Reference
Material Class
Rhino.DocObjects Namespace