RhinoCommon SDK
BrepTrim.SetTrimCurve Method (Int32, Interval)
Rhino for Mac 5.1
 Set 2d curve geometry used by a b-rep trim.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetTrimCurve(
	int curve2dIndex,
	Interval subDomain
)
Public Function SetTrimCurve (
	curve2dIndex As Integer,
	subDomain As Interval
) As Boolean
Parameters
curve2dIndex
Type: System.Int32
index of 2d curve in m_C2[] array
subDomain
Type: Rhino.Geometry.Interval
[Missing <param name="subDomain"/> documentation for "M:Rhino.Geometry.BrepTrim.SetTrimCurve(System.Int32,Rhino.Geometry.Interval)"]
Return Value
Type: Boolean
true if successful
See Also
Reference
BrepTrim Class
SetTrimCurve Overload
Rhino.Geometry Namespace