RhinoCommon SDK
Circle Constructor
Rhino for Mac 5.1
Overload List
Name | Description
Circle(Double)
 Initializes a circle with center (0,0,0) in the world XY plane.
Circle(Arc)
 Initializes a circle from an arc.
Circle(Plane, Double)
 Initializes a circle on a plane with a given radius.
Circle(Point3d, Double)
 Initializes a circle parallel to the world XY plane with given center and radius.
Circle(Plane, Point3d, Double)
 Initializes a circle parallel to a given plane with given center and radius.
Circle(Point3d, Point3d, Point3d)
 Initializes a circle through three 3d points. The start/end of the circle is at point1.
Circle(Point3d, Vector3d, Point3d)
 Initializes a circle from two 3d points and a tangent at the first point. The start/end of the circle is at point "startPoint".
Top
See Also
Reference
Circle Structure
Rhino.Geometry Namespace