RhinoCommon SDK
DisplayPipeline.DrawDirectionArrow Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawDirectionArrow(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawDirectionArrow(
	Point3d location,
	Vector3d direction,
	Color color
)
Public Sub DrawDirectionArrow (
	location As Point3d,
	direction As Vector3d,
	color As Color
)
Parameters
location
Type: Rhino.Geometry.Point3d
[Missing <param name="location"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawDirectionArrow(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)"]
direction
Type: Rhino.Geometry.Vector3d
[Missing <param name="direction"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawDirectionArrow(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawDirectionArrow(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace