RhinoCommon SDK
MeshFaceList.SetFace Method (Int32, Int32, Int32, Int32)
Rhino for Mac 5.1
 Sets a triangular face at a specific index of the mesh.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFace(
	int index,
	int vertex1,
	int vertex2,
	int vertex3
)
Public Function SetFace (
	index As Integer,
	vertex1 As Integer,
	vertex2 As Integer,
	vertex3 As Integer
) As Boolean
Parameters
index
Type: System.Int32
A position in the list.
vertex1
Type: System.Int32
The first vertex index.
vertex2
Type: System.Int32
The second vertex index.
vertex3
Type: System.Int32
The third vertex index.
Return Value
Type: Boolean
true if the operation succeeded, otherwise false.
See Also
Reference
MeshFaceList Class
SetFace Overload
Rhino.Geometry.Collections Namespace