RhinoCommon SDK
GeometryBase.GetBoundingBox Method (Transform)
Rhino for Mac 5.1
 Aligned Boundingbox solver. Gets the world axis aligned boundingbox for the transformed geometry.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox GetBoundingBox(
	Transform xform
)
Public Function GetBoundingBox (
	xform As Transform
) As BoundingBox
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to apply to object prior to the BoundingBox computation. The geometry itself is not modified.
Return Value
Type: BoundingBox
The accurate boundingbox of the transformed geometry in world coordinates or BoundingBox.Empty if not bounding box could be found.
See Also
Reference
GeometryBase Class
GetBoundingBox Overload
Rhino.Geometry Namespace