RhinoCommon SDK
Arc.Transform Method
Rhino for Mac 5.1
 Transforms the arc using a Transformation matrix.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Transformations to apply. Note that arcs cannot handle non-euclidian transformations.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Arc Structure
Rhino.Geometry Namespace