RhinoCommon SDK
BinaryArchiveWriter.WriteSByte Method
Rhino for Mac 5.1
 Writes a SByte value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteSByte(
	sbyte value
)
Public Sub WriteSByte (
	value As SByte
)
Parameters
value
Type: System.SByte
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace