RhinoCommon SDK
Extrusion.IsCappedAtBottom Property
Rhino for Mac 5.1
 Gets a value indicating whether the surface that fills the bottom profile is existing.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsCappedAtBottom { get; }
Public ReadOnly Property IsCappedAtBottom As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace