RhinoCommon SDK
TextureMapping.TryGetMappingCylinder Method
Rhino for Mac 5.1
 Get a cylindrical projection parameters from this texture mapping.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetMappingCylinder(
	out Cylinder cylinder
)
Public Function TryGetMappingCylinder (
	<OutAttribute> ByRef cylinder As Cylinder
) As Boolean
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
[Missing <param name="cylinder"/> documentation for "M:Rhino.Render.TextureMapping.TryGetMappingCylinder(Rhino.Geometry.Cylinder@)"]
Return Value
Type: Boolean
 Returns true if a valid cylinder is returned.
Remarks
 Generally, GetMappingCylinder will not return the same parameters passed to SetCylinderMapping. However, the location of the cylinder will be the same. If this mapping is not cylindrical, the cylinder will approximate the actual mapping primitive.
See Also
Reference
TextureMapping Class
Rhino.Render Namespace