RhinoCommon SDK
LinearDimension Class
Rhino for Mac 5.1
 Represents a linear dimension.
This entity refers to the geometric element that is independent from the document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.LinearDimension
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class LinearDimension : AnnotationBase
<SerializableAttribute>
Public Class LinearDimension
	Inherits AnnotationBase
The LinearDimension type exposes the following members.
Constructors
Name | Description
LinearDimension()
 Initializes a new instance of the LinearDimension class.
LinearDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
LinearDimension(Plane, Point2d, Point2d, Point2d)
Initializes a new instance of the LinearDimension class
Top
Properties
Name | Description
Aligned
 Gets or sets a value indicating whether this annotation is aligned.
Arrowhead1End
 Gets the arrow head end of the first extension line.
Arrowhead2End
 Gets the arrow head end of the second extension line.
DimensionStyleIndex
 Index of DimensionStyle in document DimStyle table used by the dimension.
DistanceBetweenArrowTips
 Gets the distance between arrow tips.
ExtensionLine1End
 Gets the end of the first extension line.
ExtensionLine2End
 Gets the end of the second extension line.
TextPosition
 Gets and sets the position of text on the plane.
Top
Methods
Name | Description
FromPoints
 Initializes a new instance of the LinearDimension class, based on three points.
SetLocations
 Sets the three locations of the point, using two-dimensional points that refer to the plane of the annotation.
Top
See Also
Reference
Rhino.Geometry Namespace