RhinoCommon SDK
RunMode Enumeration
Rhino for Mac 5.1
 Provides enumerated constants for a command running mode. This is currently interactive or scripted.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum RunMode
Public Enumeration RunMode
Members
Member name | Value | Description
Interactive | 0 |  Can use dialogs for input. Must use message boxes to report serious error conditions.
Scripted | 1 |  All input must come from command line, GetPoint, GetObject, GetString, etc. Must use message boxes to report serious error conditions. Script mode gets used when a command is run with a hyphen (-) prefix.
See Also
Reference
Rhino.Commands Namespace