RhinoCommon SDK
ViewInfo Class
Rhino for Mac 5.1
 Represents the name and orientation of a View (and named view).
views can be thought of as cameras.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.ViewInfo
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class ViewInfo : IDisposable
Public Class ViewInfo
	Implements IDisposable
The ViewInfo type exposes the following members.
Properties
Name | Description
Name
 Gets or sets the name of the NamedView.
Viewport
 Gets the viewport, or viewing frustum, associated with this view.
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.DocObjects Namespace