RhinoCommon SDK
Cylinder.ToRevSurface Method
Rhino for Mac 5.1
 Constructs a RevSurface representation of this Cylinder. This is synonymous with calling RevSurface.CreateFromCylinder().
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RevSurface ToRevSurface()
Public Function ToRevSurface As RevSurface
Return Value
Type: RevSurface
A RevSurface representation of the cylinder or null.
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace