RhinoCommon SDK
LightTableEventArgs.LightIndex Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTableEventArgs.LightIndex"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int LightIndex { get; }
Public ReadOnly Property LightIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace