RhinoCommon SDK
InstanceDefinition.UpdateType Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.UpdateType"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public InstanceDefinitionUpdateType UpdateType { get; }
Public ReadOnly Property UpdateType As InstanceDefinitionUpdateType
	Get
Property Value
Type: InstanceDefinitionUpdateType
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace