RhinoCommon SDK
Surface.Transpose Method
Rhino for Mac 5.1
 Transposes surface parameterization (swap U and V)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface Transpose()
Public Function Transpose As Surface
Return Value
Type: Surface
New transposed surface on success, null on failure.
See Also
Reference
Surface Class
Transpose Overload
Rhino.Geometry Namespace