RhinoCommon SDK
MaterialTableEventArgs Properties
Rhino for Mac 5.1
The MaterialTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
Index
OldSettings
Top
See Also
Reference
MaterialTableEventArgs Class
Rhino.DocObjects.Tables Namespace