RhinoCommon SDK
MeshPoint.Mesh Property
Rhino for Mac 5.1
 The mesh that is ralated to this point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Mesh Mesh { get; }
Public ReadOnly Property Mesh As Mesh
	Get
Property Value
Type: Mesh
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace