RhinoCommon SDK
RhinoObjectSelectionEventArgs.RhinoObjects Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoObjectSelectionEventArgs.RhinoObjects"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject[] RhinoObjects { get; }
Public ReadOnly Property RhinoObjects As RhinoObject()
	Get
Property Value
Type: RhinoObject[]
See Also
Reference
RhinoObjectSelectionEventArgs Class
Rhino.DocObjects Namespace