RhinoCommon SDK
Brep.CreateFromCornerPoints Method (Point3d, Point3d, Point3d, Double)
Rhino for Mac 5.1
 Makes a brep with one face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep CreateFromCornerPoints(
	Point3d corner1,
	Point3d corner2,
	Point3d corner3,
	double tolerance
)
Public Shared Function CreateFromCornerPoints (
	corner1 As Point3d,
	corner2 As Point3d,
	corner3 As Point3d,
	tolerance As Double
) As Brep
Parameters
corner1
Type: Rhino.Geometry.Point3d
A first corner.
corner2
Type: Rhino.Geometry.Point3d
A second corner.
corner3
Type: Rhino.Geometry.Point3d
A third corner.
tolerance
Type: System.Double
 Minimum edge length without collapsing to a singularity.
Return Value
Type: Brep
A boundary representation, or null on error.
See Also
Reference
Brep Class
CreateFromCornerPoints Overload
Rhino.Geometry Namespace