RhinoCommon SDK
BinaryArchiveWriter.WriteShort Method
Rhino for Mac 5.1
 Writes a Int16 value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteShort(
	short value
)
Public Sub WriteShort (
	value As Short
)
Parameters
value
Type: System.Int16
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace