RhinoCommon SDK
PanelIds.Display Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.PanelIds.Display"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid Display { get; }
Public Shared ReadOnly Property Display As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace