RhinoCommon SDK
BrepFaceList.SplitKinkyFaces Method
Rhino for Mac 5.1
Overload List
Name | Description
SplitKinkyFaces()
 Splits any faces with creases into G1 pieces.
SplitKinkyFaces(Double)
 Splits any faces with creases into G1 pieces.
SplitKinkyFaces(Double, Boolean)
 Splits any faces with creases into G1 pieces.
Top
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace