RhinoCommon SDK
PolylineCurve.PointCount Property
Rhino for Mac 5.1
 Gets the number of points in this polyline.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int PointCount { get; }
Public ReadOnly Property PointCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace