RhinoCommon SDK
Polyline.BreakAtAngles Method
Rhino for Mac 5.1
 Breaks this polyline into sections at sharp kinks. Closed polylines will also be broken at the first and last vertex.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Polyline[] BreakAtAngles(
	double angle
)
Public Function BreakAtAngles (
	angle As Double
) As Polyline()
Parameters
angle
Type: System.Double
Angle (in radians) between adjacent segments for a break to occur.
Return Value
Type: Polyline[]
An array of polyline segments, or null on error.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace