RhinoCommon SDK
Brep.CullUnusedVertices Method
Rhino for Mac 5.1
Culls vertices with m_vertex_index == -1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool CullUnusedVertices()
Public Function CullUnusedVertices As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace