RhinoCommon SDK
ClippingPlaneObject Properties
Rhino for Mac 5.1
The ClippingPlaneObject type exposes the following members.
Properties
Name | Description
ClippingPlaneGeometry
 Gets the clipping plane surface.
Top
See Also
Reference
ClippingPlaneObject Class
Rhino.DocObjects Namespace