RhinoCommon SDK
LightTable Properties
Rhino for Mac 5.1
The LightTable type exposes the following members.
Properties
Name | Description
Count
Number of lights in the light table. Does not include Sun or Skylight.
Document
Document that owns this light table.
Item
Top
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace