RhinoCommon SDK
Point3d.SortAndCullPointList Method
Rhino for Mac 5.1
 Orders a set of points so they will be connected in a "reasonable polyline" order.
Also, removes points from the list if their common distance exceeds a specified threshold.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d[] SortAndCullPointList(
	IEnumerable<Point3d> points,
	double minimumDistance
)
Public Shared Function SortAndCullPointList (
	points As IEnumerable(Of Point3d),
	minimumDistance As Double
) As Point3d()
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable of Point3d.
minimumDistance
Type: System.Double
Minimum allowed distance among a pair of points. If points are closer than this, only one of them will be kept.
Return Value
Type: Point3d[]
The new array of sorted and culled points.
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace