RhinoCommon SDK
CustomObjectGrips.GripsMoved Property
Rhino for Mac 5.1
 If GripsMoved is true if some of the grips have ever been moved GripObject.NewLocation() sets GripsMoved=true.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GripsMoved { get; }
Public ReadOnly Property GripsMoved As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace