RhinoCommon SDK
GetObject.Get Method
Rhino for Mac 5.1
 Call to select a single object.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GetResult Get()
Public Function Get As GetResult
Return Value
Type: GetResult
 Success - objects selected. Cancel - user pressed ESCAPE to cancel the get. See GetResults for other possible values that may be returned when options, numbers, etc., are acceptable responses.
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace