RhinoCommon SDK
Arc Constructor (Circle, Double)
Rhino for Mac 5.1
 Initializes a new instance of an arc from a base circle and an angle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Arc(
	Circle circle,
	double angleRadians
)
Public Sub New (
	circle As Circle,
	angleRadians As Double
)
Parameters
circle
Type: Rhino.Geometry.Circle
Circle to base arc upon.
angleRadians
Type: System.Double
Sweep angle of arc (in radians)
See Also
Reference
Arc Structure
Arc Overload
Rhino.Geometry Namespace