RhinoCommon SDK
MeshFaceNormalList.ComputeFaceNormals Method
Rhino for Mac 5.1
 Computes all the face normals for this mesh based on the physical shape of the mesh.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ComputeFaceNormals()
Public Function ComputeFaceNormals As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace