RhinoCommon SDK
BitmapTable.ExportToFile Method
Rhino for Mac 5.1
Writes a bitmap to a file.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ExportToFile(
	int index,
	string path
)
Public Function ExportToFile (
	index As Integer,
	path As String
) As Boolean
Parameters
index
Type: System.Int32
The index of the bitmap to be written.
path
Type: System.String
 The full path, including file name and extension, name of the file to write.
Return Value
Type: Boolean
true if successful.
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace