RhinoCommon SDK
NurbsSurface.CreateNetworkSurface Method
Rhino for Mac 5.1
Overload List
Name | Description
CreateNetworkSurface(IEnumerable<Curve>, Int32, Double, Double, Double, Int32)
 Builds a surface from an autosorted network of curves/edges.
CreateNetworkSurface(IEnumerable<Curve>, Int32, Int32, IEnumerable<Curve>, Int32, Int32, Double, Double, Double, Int32)
 Builds a surface from an ordered network of curves/edges.
Top
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace