RhinoCommon SDK
ObjectTable.FindByUserString Method (String, String, Boolean, Boolean, Boolean, ObjectEnumeratorSettings)
Rhino for Mac 5.1
 Finds all objects whose UserString matches the search patterns.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject[] FindByUserString(
	string key,
	string value,
	bool caseSensitive,
	bool searchGeometry,
	bool searchAttributes,
	ObjectEnumeratorSettings filter
)
Public Function FindByUserString (
	key As String,
	value As String,
	caseSensitive As Boolean,
	searchGeometry As Boolean,
	searchAttributes As Boolean,
	filter As ObjectEnumeratorSettings
) As RhinoObject()
Parameters
key
Type: System.String
Search pattern for UserString keys (supported wildcards are: ? = any single character, * = any sequence of characters).
value
Type: System.String
Search pattern for UserString values (supported wildcards are: ? = any single character, * = any sequence of characters).
caseSensitive
Type: System.Boolean
If true, string comparison will be case sensitive.
searchGeometry
Type: System.Boolean
If true, UserStrings attached to the geometry of an object will be searched.
searchAttributes
Type: System.Boolean
If true, UserStrings attached to the attributes of an object will be searched.
filter
Type: Rhino.DocObjects.ObjectEnumeratorSettings
Filter used to restrict the number of objects searched.
Return Value
Type: RhinoObject[]
An array of all objects whose UserString matches with the search patterns or null when no such objects could be found.
See Also
Reference
ObjectTable Class
FindByUserString Overload
Rhino.DocObjects.Tables Namespace