RhinoCommon SDK
Interval.FromIntersection Method
Rhino for Mac 5.1
 Returns a new Interval that is the Intersection of the two input Intervals.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Interval FromIntersection(
	Interval a,
	Interval b
)
Public Shared Function FromIntersection (
	a As Interval,
	b As Interval
) As Interval
Parameters
a
Type: Rhino.Geometry.Interval
The first input interval.
b
Type: Rhino.Geometry.Interval
The second input interval.
Return Value
Type: Interval
If the intersection is not empty, then intersection = [max(a.Min(),b.Min()), min(a.Max(),b.Max())] The interval [ON.UnsetValue,ON.UnsetValue] is considered to be the empty set interval. The result of any intersection involving an empty set interval or disjoint intervals is the empty set interval.
See Also
Reference
Interval Structure
Rhino.Geometry Namespace