RhinoCommon SDK
ObjRef.Hatch Method
Rhino for Mac 5.1
 Gets the hatch if the referenced geometry is one.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Hatch Hatch()
Public Function Hatch As Hatch
Return Value
Type: Hatch
A hatch; or null if the referenced object is not a hatch
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace