RhinoCommon SDK
ObjectTable.Add Method (GeometryBase, ObjectAttributes)
Rhino for Mac 5.1
 Adds geometry that is not further specified.
This is meant, for example, to handle addition of sets of different geometrical entities.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Add(
	GeometryBase geometry,
	ObjectAttributes attributes
)
Public Function Add (
	geometry As GeometryBase,
	attributes As ObjectAttributes
) As Guid
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
The base geometry. This cannot be null.
attributes
Type: Rhino.DocObjects.ObjectAttributes
The object attributes. This can be null.
Return Value
Type: Guid
The new object ID on success.
Exceptions
Exception | Condition
ArgumentNullException | If geometry is null.
See Also
Reference
ObjectTable Class
Add Overload
Rhino.DocObjects.Tables Namespace