RhinoCommon SDK
ObjectAttributes.AddToGroup Method
Rhino for Mac 5.1
 Adds object to the group with specified index by appending index to group list.
If the object is already in group, nothing is changed.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddToGroup(
	int groupIndex
)
Public Sub AddToGroup (
	groupIndex As Integer
)
Parameters
groupIndex
Type: System.Int32
The index that will be added.
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace