RhinoCommon SDK
Material.OnSwitchToNonConst Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.OnSwitchToNonConst"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected override void OnSwitchToNonConst()
Protected Overrides Sub OnSwitchToNonConst
See Also
Reference
Material Class
Rhino.DocObjects Namespace