RhinoCommon SDK
RhinoViewport.ViewportType Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.ViewportType"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ViewportType ViewportType { get; }
Public ReadOnly Property ViewportType As ViewportType
	Get
Property Value
Type: ViewportType
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace