RhinoCommon SDK
RTreeEventArgs.IdB Property
Rhino for Mac 5.1
 If search is using two r-trees, IdB is element b in the search.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int IdB { get; }
Public ReadOnly Property IdB As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace