RhinoCommon SDK
DisplayMaterial.IsTwoSided Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayMaterial.IsTwoSided"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsTwoSided { get; set; }
Public Property IsTwoSided As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace