RhinoCommon SDK
MeshObject Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.MeshObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.MeshObject
 Rhino.DocObjects.Custom.CustomMeshObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MeshObject : RhinoObject
Public Class MeshObject
	Inherits RhinoObject
The MeshObject type exposes the following members.
Properties
Name | Description
MeshGeometry
Top
Methods
Name | Description
DuplicateMeshGeometry
SetMesh
 Only for developers who are defining custom subclasses of MeshObject. Directly sets the internal mesh geometry for this object. Note that this function does not work with Rhino's "undo".
Top
See Also
Reference
Rhino.DocObjects Namespace