RhinoCommon SDK
Extrusion.ProfileCount Property
Rhino for Mac 5.1
 Gets the amount of profile curves.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ProfileCount { get; }
Public ReadOnly Property ProfileCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace