RhinoCommon SDK
MeshFaceList.AddFace Method
Rhino for Mac 5.1
Overload List
Name | Description
AddFace(MeshFace)
 Appends a new mesh face to the end of the mesh face list.
AddFace(Int32, Int32, Int32)
 Appends a new triangular face to the end of the mesh face list.
AddFace(Int32, Int32, Int32, Int32)
 Appends a new quadragular face to the end of the mesh face list.
Top
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace