RhinoCommon SDK
ObjectTable.Show Method (RhinoObject, Boolean)
Rhino for Mac 5.1
 If obj.IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Show(
	RhinoObject obj,
	bool ignoreLayerMode
)
Public Function Show (
	obj As RhinoObject,
	ignoreLayerMode As Boolean
) As Boolean
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
the normal object to show.
ignoreLayerMode
Type: System.Boolean
 if true, the object will be shown even if it is on a layer that is locked or off.
Return Value
Type: Boolean
true if the object was successfully shown.
See Also
Reference
ObjectTable Class
Show Overload
Rhino.DocObjects.Tables Namespace