RhinoCommon SDK
Color4f.B Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.Color4f.B"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public float B { get; }
Public ReadOnly Property B As Single
	Get
Property Value
Type: Single
See Also
Reference
Color4f Structure
Rhino.Display Namespace