RhinoCommon SDK
RhinoGet.GetPointOnMesh Method (Guid, String, Boolean, Point3d)
Rhino for Mac 5.1
 Gets a point constrained to an existing mesh in the document.
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetPointOnMesh(
	Guid meshObjectId,
	string prompt,
	bool acceptNothing,
	out Point3d point
)
Public Shared Function GetPointOnMesh (
	meshObjectId As Guid,
	prompt As String,
	acceptNothing As Boolean,
	<OutAttribute> ByRef point As Point3d
) As Result
Parameters
meshObjectId
Type: System.Guid
An ID of a mesh in the document.
prompt
Type: System.String
Text prompt.
acceptNothing
Type: System.Boolean
true if nothing else should be accepted.
point
Type: Rhino.Geometry.Point3d
A point value will be assigned to this out parameter during this call.
Return Value
Type: Result
A command result based on user choice.
See Also
Reference
RhinoGet Class
GetPointOnMesh Overload
Rhino.Input Namespace