RhinoCommon SDK
UserDictionary.Read Method
Rhino for Mac 5.1
 Is called to read this entity.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected override bool Read(
	BinaryArchiveReader archive
)
Protected Overrides Function Read (
	archive As BinaryArchiveReader
) As Boolean
Parameters
archive
Type: Rhino.FileIO.BinaryArchiveReader
An archive.
Return Value
Type: Boolean
Always returns true.
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace