RhinoCommon SDK
LineCurve.Line Property
Rhino for Mac 5.1
 Gets or sets the Line value inside this curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line Line { get; set; }
Public Property Line As Line
	Get
	Set
Property Value
Type: Line
See Also
Reference
LineCurve Class
Rhino.Geometry Namespace