RhinoCommon SDK
Intersection.LineCylinder Method
Rhino for Mac 5.1
 Intersects a line with a cylinder using exact calculations.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static LineCylinderIntersection LineCylinder(
	Line line,
	Cylinder cylinder,
	out Point3d intersectionPoint1,
	out Point3d intersectionPoint2
)
Public Shared Function LineCylinder (
	line As Line,
	cylinder As Cylinder,
	<OutAttribute> ByRef intersectionPoint1 As Point3d,
	<OutAttribute> ByRef intersectionPoint2 As Point3d
) As LineCylinderIntersection
Parameters
line
Type: Rhino.Geometry.Line
Line for intersection.
cylinder
Type: Rhino.Geometry.Cylinder
Cylinder for intersection.
intersectionPoint1
Type: Rhino.Geometry.Point3d
First intersection point.
intersectionPoint2
Type: Rhino.Geometry.Point3d
Second intersection point.
Return Value
Type: LineCylinderIntersection
If None is returned, the first point is the point on the line closest to the cylinder and the second point is the point on the cylinder closest to the line.
If Single is returned, the first point is the point on the line and the second point is the same point on the cylinder.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace