RhinoCommon SDK
Curve.SpanCount Property
Rhino for Mac 5.1
 Gets the number of non-empty smooth (c-infinity) spans in the curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int SpanCount { get; }
Public ReadOnly Property SpanCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Curve Class
Rhino.Geometry Namespace