RhinoCommon SDK
GroupTable.GroupNames Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.GroupTable.GroupNames(System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string[] GroupNames(
	bool ignoreDeletedGroups
)
Public Function GroupNames (
	ignoreDeletedGroups As Boolean
) As String()
Parameters
ignoreDeletedGroups
Type: System.Boolean
[Missing <param name="ignoreDeletedGroups"/> documentation for "M:Rhino.DocObjects.Tables.GroupTable.GroupNames(System.Boolean)"]
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.GroupTable.GroupNames(System.Boolean)"]
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace