RhinoCommon SDK
GumballObject.SetFromBoundingBox Method
Rhino for Mac 5.1
Overload List
Name | Description
SetFromBoundingBox(BoundingBox)
SetFromBoundingBox(Plane, BoundingBox)
 Sets the gumball bounding box with respect to a frame.
Top
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace