RhinoCommon SDK
CustomBrepObject.Dispose Method
Rhino for Mac 5.1
Overload List
Name | Description
Dispose()
Releases all resources used by the CustomBrepObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomBrepObject and optionally releases the managed resources
Top
See Also
Reference
CustomBrepObject Class
Rhino.DocObjects.Custom Namespace