RhinoCommon SDK
Arc.Circumference Property
Rhino for Mac 5.1
 Gets the circumference of the circle that is coincident with this arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Circumference { get; }
Public ReadOnly Property Circumference As Double
	Get
Property Value
Type: Double
See Also
Reference
Arc Structure
Rhino.Geometry Namespace