RhinoCommon SDK
Point3d.Addition Operator (Point3d, Point3d)
Rhino for Mac 5.1
 Sums two Point3d instances.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d operator +(
	Point3d point1,
	Point3d point2
)
Public Shared Operator + (
	point1 As Point3d,
	point2 As Point3d
) As Point3d
Parameters
point1
Type: Rhino.Geometry.Point3d
A point.
point2
Type: Rhino.Geometry.Point3d
A point.
Return Value
Type: Point3d
A new point that results from the addition of point1 and point2.
See Also
Reference
Point3d Structure
Addition Overload
Rhino.Geometry Namespace