RhinoCommon SDK
GetBaseClass.AddOptionInteger Method (LocalizeStringPair, OptionInteger, String)
Rhino for Mac 5.1
 Adds a command line option to get integers and automatically save the value.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddOptionInteger(
	LocalizeStringPair optionName,
	ref OptionInteger intValue,
	string prompt
)
Public Function AddOptionInteger (
	optionName As LocalizeStringPair,
	ByRef intValue As OptionInteger,
	prompt As String
) As Integer
Parameters
optionName
Type: Rhino.UI.LocalizeStringPair
 Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
intValue
Type: Rhino.Input.Custom.OptionInteger
The current integer value.
prompt
Type: System.String
 option prompt shown if the user selects this option. If null or empty, then the option name is used as the get number prompt.
Return Value
Type: Int32
 option index value (>0) or 0 if option cannot be added.
See Also
Reference
GetBaseClass Class
AddOptionInteger Overload
Rhino.Input.Custom Namespace