RhinoCommon SDK
MeshPart.VertexCount Property
Rhino for Mac 5.1
EndVertexIndex - StartVertexIndex
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int VertexCount { get; }
Public ReadOnly Property VertexCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace