RhinoCommon SDK
ObjectTable.AddSphere Method (Sphere, ObjectAttributes, HistoryRecord, Boolean)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddSphere(
	Sphere sphere,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddSphere (
	sphere As Sphere,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
sphere
Type: Rhino.Geometry.Sphere
[Missing <param name="sphere"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
history
Type: Rhino.DocObjects.HistoryRecord
[Missing <param name="history"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
reference
Type: System.Boolean
[Missing <param name="reference"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)"]
See Also
Reference
ObjectTable Class
AddSphere Overload
Rhino.DocObjects.Tables Namespace