RhinoCommon SDK
MaterialTable.ResetMaterial Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.MaterialTable.ResetMaterial(System.Int32)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ResetMaterial(
	int materialIndex
)
Public Function ResetMaterial (
	materialIndex As Integer
) As Boolean
Parameters
materialIndex
Type: System.Int32
[Missing <param name="materialIndex"/> documentation for "M:Rhino.DocObjects.Tables.MaterialTable.ResetMaterial(System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.MaterialTable.ResetMaterial(System.Int32)"]
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace