RhinoCommon SDK
UnknownUserData Class
Rhino for Mac 5.1
 Represents user data with unknown origin.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Custom.UserData
 Rhino.DocObjects.Custom.UnknownUserData
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class UnknownUserData : UserData
Public Class UnknownUserData
	Inherits UserData
The UnknownUserData type exposes the following members.
Constructors
Name | Description
UnknownUserData
 Constructs a new unknown data entity.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace