RhinoCommon SDK
Line.To Property
Rhino for Mac 5.1
 End point of line segment.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d To { get; set; }
Public Property To As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Line Structure
Rhino.Geometry Namespace