RhinoCommon SDK
OpenFileDialog.InitialDirectory Property
Rhino for Mac 5.1
 Gets or sets the initial directory displayed by the file dialog box.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string InitialDirectory { get; set; }
Public Property InitialDirectory As String
	Get
	Set
Property Value
Type: String
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace