RhinoCommon SDK
GripsDrawEventArgs.DrawControlPolygonLine Method (Line, Int32, Int32)
Rhino for Mac 5.1
 Draws the lines in a control polygons.
This is an helper function.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawControlPolygonLine(
	Line line,
	int startStatus,
	int endStatus
)
Public Sub DrawControlPolygonLine (
	line As Line,
	startStatus As Integer,
	endStatus As Integer
)
Parameters
line
Type: Rhino.Geometry.Line
Line between two grips.
startStatus
Type: System.Int32
Index of Grip status at start of line.
endStatus
Type: System.Int32
Index if Grip status at end of line.
See Also
Reference
GripsDrawEventArgs Class
DrawControlPolygonLine Overload
Rhino.DocObjects.Custom Namespace