RhinoCommon SDK
RhinoView Class
Rhino for Mac 5.1
 A RhinoView represents a single "window" display of a document. A view could contain one or many RhinoViewports (many in the case of Layout views with detail viewports). Standard Rhino modeling views have one viewport.
Inheritance Hierarchy
System.Object
 Rhino.Display.RhinoView
 Rhino.Display.RhinoPageView
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class RhinoView
Public Class RhinoView
The RhinoView type exposes the following members.
Properties
Name | Description
ActiveViewport
 The ActiveViewport is the same as the MainViewport for standard RhinoViews. In a RhinoPageView, the active viewport may be the RhinoViewport of a child detail object. Most of the time, you will use ActiveViewport unless you explicitly need to work with the main viewport.
ActiveViewportID
 Returns viewport ID for the active viewport. Faster than ActiveViewport function when working with page views.
Bounds
 Gets or sets the size and location of the view including its nonclient elements, in pixels, relative to the parent control.
ClientRectangle
 Gets the rectangle that represents the client area of the view.
Document
EnableDrawing
 Gets or sets the 'drawing enabled' flag. By default, drawing is enabled.
There are some rare situations where scipts want to disable drawing for a while.
Floating
 Floating state of RhinoView. if true, then the view will be in a floating frame window. Otherwise the view will be embeded in the main frame.
Handle
 Gets the window handle that this view is bound to.
MainViewport
 A RhinoView contains a "main viewport" that fills the entire view client window. RhinoPageViews may also contain nested child RhinoViewports for implementing detail viewports. The MainViewport will always return this RhinoView's m_vp.
Maximized
ScreenRectangle
 Gets the rectangle that represents the client area of the view in screen coordinates.
TitleVisible
 Visibility of the viewport title window.
Top
Methods
Name | Description
CaptureToBitmap()
 Capture View contents to a bitmap.
CaptureToBitmap(Size)
 Capture View contents to a bitmap.
CaptureToBitmap(DisplayModeDescription)
 Capture View contents to a bitmap using a display mode description to define how drawing is performed.
CaptureToBitmap(DisplayPipelineAttributes)
 Captures view contents to a bitmap using display attributes to define how drawing is performed.
CaptureToBitmap(Size, DisplayModeDescription)
 Capture View contents to a bitmap using a display mode description to define how drawing is performed.
CaptureToBitmap(Size, DisplayPipelineAttributes)
 Capture View contents to a bitmap using display attributes to define how drawing is performed.
CaptureToBitmap(Boolean, Boolean, Boolean)
 Captures the view contents to a bitmap allowing for visibility of grid and axes.
CaptureToBitmap(Size, Boolean, Boolean, Boolean)
 Captures a part of the view contents to a bitmap allowing for visibility of grid and axes.
ClientToScreen(Point)
ClientToScreen(Point2d)
Close
 Remove this View from Rhino. DO NOT attempt to use this instance of this class after calling Close.
CreateShadedPreviewImage
Creates a bitmap preview image of model.
CreateWireframePreviewImage
Creates a bitmap preview image of model.
Redraw
Redraws this view.
ScreenToClient(Point)
 Converts a point in screen coordinates to client coordinates for this view.
ScreenToClient(Point2d)
SpeedTest
Top
Events
Name | Description
Create
Destroy
Rename
SetActive
Top
See Also
Reference
Rhino.Display Namespace