RhinoCommon SDK
Dialogs.ShowNumberBox Method
Rhino for Mac 5.1
Overload List
Name | Description
ShowNumberBox(String, String, Double)
ShowNumberBox(String, String, Double, Double, Double)
Top
See Also
Reference
Dialogs Class
Rhino.UI Namespace