RhinoCommon SDK
ObjectTable.AddArc Method (Arc, ObjectAttributes)
Rhino for Mac 5.1
Adds a curve object to the document representing an arc.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddArc(
	Arc arc,
	ObjectAttributes attributes
)
Public Function AddArc (
	arc As Arc,
	attributes As ObjectAttributes
) As Guid
Parameters
arc
Type: Rhino.Geometry.Arc
An arc value.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to arc.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddArc Overload
Rhino.DocObjects.Tables Namespace