RhinoCommon SDK
RhinoObject.Select Method (Boolean, Boolean)
Rhino for Mac 5.1
Selects an object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Select(
	bool on,
	bool syncHighlight
)
Public Function Select (
	on As Boolean,
	syncHighlight As Boolean
) As Integer
Parameters
on
Type: System.Boolean
The new selection state; true activates selection.
syncHighlight
Type: System.Boolean
 If true, then the object is hightlighted if it is selected and not hightlighted if is is not selected.
Highlighting can be and stay out of sync, as its specification is independent.
Return Value
Type: Int32
0: object is not selected.
1: object is selected.
2: object is selected persistently.
Remarks
 Objects that are locked, hidden, or on locked or hidden layers cannot be selected. If IsSelectableWithGripsOn() returns false, then an that object is not selectable if it has grips turned on.
See Also
Reference
RhinoObject Class
Select Overload
Rhino.DocObjects Namespace