RhinoCommon SDK
RhinoObject.Select Method (Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
Rhino for Mac 5.1
Selects an object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Select(
	bool on,
	bool syncHighlight,
	bool persistentSelect,
	bool ignoreGripsState,
	bool ignoreLayerLocking,
	bool ignoreLayerVisibility
)
Public Function Select (
	on As Boolean,
	syncHighlight As Boolean,
	persistentSelect As Boolean,
	ignoreGripsState As Boolean,
	ignoreLayerLocking As Boolean,
	ignoreLayerVisibility As Boolean
) As Integer
Parameters
on
Type: System.Boolean
The new selection state; true activates selection.
syncHighlight
Type: System.Boolean
 If true, then the object is highlighted if it is selected and unhighlighted if is is not selected.
Highlighting can be and stay out of sync, as its specification is independent.
persistentSelect
Type: System.Boolean
 Objects that are persistently selected stay selected when a command terminates.
ignoreGripsState
Type: System.Boolean
 If true, then objects with grips on can be selected. If false, then the value returned by the object's IsSelectableWithGripsOn() function decides if the object can be selected when it has grips turned on.
ignoreLayerLocking
Type: System.Boolean
 If true, then objects on locked layers can be selected. If false, then objects on locked layers cannot be selected.
ignoreLayerVisibility
Type: System.Boolean
 If true, then objects on hidden layers can be selectable. If false, then objects on hidden layers cannot be selected.
Return Value
Type: Int32
0: object is not selected.
1: object is selected.
2: object is selected persistently.
Remarks
 Objects that are locked, hidden, or on locked or hidden layers cannot be selected. If IsSelectableWithGripsOn() returns false, then an that object is not selectable if it has grips turned on.
See Also
Reference
RhinoObject Class
Select Overload
Rhino.DocObjects Namespace