RhinoCommon SDK
ObjRef.Edge Method
Rhino for Mac 5.1
 Gets the edge if this reference geometry is one.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepEdge Edge()
Public Function Edge As BrepEdge
Return Value
Type: BrepEdge
A boundary representation edge; or null on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace