RhinoCommon SDK
TextEntity.FontIndex Property
Rhino for Mac 5.1
 Gets or sets the index of font in document font table used by the text.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int FontIndex { get; set; }
Public Property FontIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace