RhinoCommon SDK
DisplayConduit.PostDrawObjects Method
Rhino for Mac 5.1
 Called after all non-highlighted objects have been drawn. Depth writing and testing are still turned on. If you want to draw without depth writing/testing, see DrawForeground.
The default implementation does nothing.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void PostDrawObjects(
	DrawEventArgs e
)
Protected Overridable Sub PostDrawObjects (
	e As DrawEventArgs
)
Parameters
e
Type: Rhino.Display.DrawEventArgs
The event argument contains the current viewport and display state.
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace