RhinoCommon SDK
BrepTrimList.Add Method (Int32)
Rhino for Mac 5.1
 Add a new trim that will be part of an inner, outer, or slit loop to the brep.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepTrim Add(
	int curve2dIndex
)
Public Function Add (
	curve2dIndex As Integer
) As BrepTrim
Parameters
curve2dIndex
Type: System.Int32
index of 2d trimming curve
Return Value
Type: BrepTrim
New Trim
Remarks
 You should set the trim's tolerance, type, iso, li, and m_ei values. In general, you should try to use the Add( edge, bRev3d, loop, c2i ) version of NewTrim. If you want to add a singular trim, use AddSingularTrim. If you want to add a crvonsrf trim, use AddCurveOnFace. If you want to add a ptonsrf trim, use AddPointOnFace.
See Also
Reference
BrepTrimList Class
Add Overload
Rhino.Geometry.Collections Namespace