RhinoCommon SDK
GeometryAttributeFilter Enumeration
Rhino for Mac 5.1
 If an object passes the geometry TYPE filter, then the geometry ATTRIBUTE filter is applied.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[FlagsAttribute]
public enum GeometryAttributeFilter
<FlagsAttribute>
Public Enumeration GeometryAttributeFilter
Members
Member name | Value | Description
WireCurve | 1 |  3d wire curve If you want to accept only wire or edge curves, then specify wire_curve or edge_curve, otherwise both wire and edge curves will pass the attribute filter.
EdgeCurve | 2 |  3d curve of a surface edge If you want to accept only wire or edge curves, then specify wire_curve or edge_curve, otherwise both wire and edge curves will pass the attribute filter.
ClosedCurve | 4 |  Closed Curves and Edges are acceptable If you want to accept only closed or open curves, then specify either closed_curve or open_curve. Otherwise both closed and open curves will pass the attribute filter.
OpenCurve | 8 |  Open Curves and Edges are acceptable If you want to accept only closed or open curves, then specify either closed_curve or open_curve. Otherwise both closed and open curves will pass the attribute filter.
SeamEdge | 16 |  seam edges are acceptable attributes of acceptable trimming edge objects (associated with an ON_BrepTrim). If none of these attributes are explicitly specified, then any kind of trimming edge will pass the attribute filter.
ManifoldEdge | 32 |  edges with 2 different surfaces pass attributes of acceptable trimming edge objects (associated with an ON_BrepTrim). If none of these attributes are explicitly specified, then any kind of trimming edge will pass the attribute filter.
NonmanifoldEdge | 64 |  edges with 3 or more surfaces pass attributes of acceptable trimming edge objects (associated with an ON_BrepTrim). If none of these attributes are explicitly specified, then any kind of trimming edge will pass the attribute filter.
MatedEdge | 112 |  any mated edge passes attributes of acceptable trimming edge objects (associated with an ON_BrepTrim). If none of these attributes are explicitly specified, then any kind of trimming edge will pass the attribute filter.
SurfaceBoundaryEdge | 128 |  boundary edges on surface sides pass attributes of acceptable trimming edge objects (associated with an ON_BrepTrim). If none of these attributes are explicitly specified, then any kind of trimming edge will pass the attribute filter.
TrimmingBoundaryEdge | 256 |  boundary edges that trim a surface pass attributes of acceptable trimming edge objects (associated with an ON_BrepTrim). If none of these attributes are explicitly specified, then any kind of trimming edge will pass the attribute filter.
BoundaryEdge | 384 |  ant boundary edge passes attributes of acceptable trimming edge objects (associated with an ON_BrepTrim). If none of these attributes are explicitly specified, then any kind of trimming edge will pass the attribute filter.
ClosedSurface | 512 |  If you want to accept only closed or open surfaces, then specify either closed_surface or open_surface. Otherwise both closed and open surfaces will pass the attribute filter.
OpenSurface | 1024 |  If you want to accept only closed or open surfaces, then specify either closed_surface or open_surface. Otherwise both closed and open surfaces will pass the attribute filter.
TrimmedSurface | 2048 |  If you want to accept only trimmed or untrimmed surfaces, then specify either trimmed_surface or untrimmed_surface. Otherwise both trimmed and untrimmed surfaces will pass the attribute filter.
UntrimmedSurface | 4096 |  If you want to accept only trimmed or untrimmed surfaces, then specify either trimmed_surface or untrimmed_surface. Otherwise both trimmed and untrimmed surfaces will pass the attribute filter.
SubSurface | 8192 |  If you want to accept only sub-surfaces of (multi-surface) polysrf, then specify sub_surface. If you do not want to accept sub-surfaces, then specify top_surface. Otherwise sub-surfaces and top surfaces will pass the attribute filter.
TopSurface | 16384 |  If you want to accept only sub-surfaces of (multi-surface) polysrf, then specify sub_surface. If you do not want to accept sub-surfaces, then specify top_surface. Otherwise sub-surfaces and top surfaces will pass the attribute filter.
ManifoldPolysrf | 32768 |  If you want to accept only manifold or nonmanifold polysrfs, then specify manifold_polysrf or nonmanifold_polysrf. Otherwise both manifold and nonmanifold polysrfs will pass the attribute filter.
NonmanifoldPolysrf | 65536 |  If you want to accept only manifold or nonmanifold polysrfs, then specify manifold_polysrf or nonmanifold_polysrf. Otherwise both manifold and nonmanifold polysrfs will pass the attribute filter.
ClosedPolysrf | 131072 |  If you want to accept only closed or open polysrfs, then specify either closed_polysrf or open_polysrf. Otherwise both closed and open polysrfs will pass the attribute filter.
OpenPolysrf | 262144 |  If you want to accept only closed or open polysrfs, then specify either closed_polysrf or open_polysrf. Otherwise both closed and open polysrfs will pass the attribute filter.
ClosedMesh | 524288 |  If you want to accept only closed or open meshs, then specify either closed_mesh or open_mesh. Otherwise both closed and open meshs will pass the attribute filter.
OpenMesh | 1048576 |  If you want to accept only closed or open meshs, then specify either closed_mesh or open_mesh. Otherwise both closed and open meshs will pass the attribute filter.
BoundaryInnerLoop | 2097152 | all trimming edges are boundary edges.
MatedInnerLoop | 4194304 | all trimming edges are mated.
InnerLoop | 6291456 | any inner loop is acceptable.
BoundaryOuterLoop | 8388608 | all trimming edges are boundary edges.
MatedOuterLoop | 16777216 | all trimming edges are mated.
OuterLoop | 25165824 | any outer loop is acceptable.
SpecialLoop | 33554432 | slit, crvonsrf, ptonsrf, etc.
AcceptAllAttributes | 4294967295
See Also
Reference
Rhino.Input.Custom Namespace