RhinoCommon SDK
Brep.Faces Property
Rhino for Mac 5.1
 Gets the brep faces list accessor.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepFaceList Faces { get; }
Public ReadOnly Property Faces As BrepFaceList
	Get
Property Value
Type: BrepFaceList
See Also
Reference
Brep Class
Rhino.Geometry Namespace