RhinoCommon SDK
NurbsSurfacePointList.GetGrevillePoint Method
Rhino for Mac 5.1
 Gets the Greville point (u, v) coordinates associated with the control point at the given indices.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2d GetGrevillePoint(
	int u,
	int v
)
Public Function GetGrevillePoint (
	u As Integer,
	v As Integer
) As Point2d
Parameters
u
Type: System.Int32
Index of control-point along surface U direction.
v
Type: System.Int32
Index of control-point along surface V direction.
Return Value
Type: Point2d
A Surface UV coordinate on success, Point2d.Unset on failure.
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace