RhinoCommon SDK
VolumeMassProperties.CentroidCoordinatesSecondMoments Property
Rhino for Mac 5.1
 Second moments with respect to centroid coordinate system. X = integral of (x-x0)^2 dm Y = integral of (y-y0)^2 dm Z = integral of (z-z0)^2 dm where (x0,y0,z0) = centroid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d CentroidCoordinatesSecondMoments { get; }
Public ReadOnly Property CentroidCoordinatesSecondMoments As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace