RhinoCommon SDK
Interop.NativeGeometryNonConstPointer Method
Rhino for Mac 5.1
 Returns the underlying non-const ON_Geometry* for a RhinoCommon class. You should only be interested in using this function if you are writing C++ code.
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static IntPtr NativeGeometryNonConstPointer(
	GeometryBase geometry
)
Public Shared Function NativeGeometryNonConstPointer (
	geometry As GeometryBase
) As IntPtr
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
A geometry object. This can be null and in such a case Zero is returned.
Return Value
Type: IntPtr
A pointer to the non-const geometry.
See Also
Reference
Interop Class
Rhino.Runtime Namespace