RhinoCommon SDK
Ray3d.Position Property
Rhino for Mac 5.1
 Gets the starting position of this ray.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d Position { get; }
Public ReadOnly Property Position As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace