RhinoCommon SDK
MeshVertexColorList.SetColor Method (MeshFace, Color)
Rhino for Mac 5.1
 Sets a color at the three or four vertex indices of a specified face.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetColor(
	MeshFace face,
	Color color
)
Public Function SetColor (
	face As MeshFace,
	color As Color
) As Boolean
Parameters
face
Type: Rhino.Geometry.MeshFace
A face to use to retrieve indices.
color
Type: System.Drawing.Color
A color.
Return Value
Type: Boolean
true on success; false on error.
See Also
Reference
MeshVertexColorList Class
SetColor Overload
Rhino.Geometry.Collections Namespace