RhinoCommon SDK
GripObject.Move Method (Vector3d)
Rhino for Mac 5.1
 Moves the grip to a new location.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Move(
	Vector3d delta
)
Public Sub Move (
	delta As Vector3d
)
Parameters
delta
Type: Rhino.Geometry.Vector3d
 Translation applied to the OriginalLocation point.
See Also
Reference
GripObject Class
Move Overload
Rhino.DocObjects Namespace