RhinoCommon SDK
TextEntity Constructor
Rhino for Mac 5.1
Overload List
Name | Description
TextEntity()
 Initializes a new instance of the TextEntity class.
TextEntity(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace