RhinoCommon SDK
Intersection.MeshMeshAccurate Method
Rhino for Mac 5.1
 Intersects two meshes. Overlaps and near misses are handled.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Polyline[] MeshMeshAccurate(
	Mesh meshA,
	Mesh meshB,
	double tolerance
)
Public Shared Function MeshMeshAccurate (
	meshA As Mesh,
	meshB As Mesh,
	tolerance As Double
) As Polyline()
Parameters
meshA
Type: Rhino.Geometry.Mesh
First mesh for intersection.
meshB
Type: Rhino.Geometry.Mesh
Second mesh for intersection.
tolerance
Type: System.Double
Intersection tolerance.
Return Value
Type: Polyline[]
An array of intersection polylines.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace