RhinoCommon SDK
Mesh.CreateFromPlanarBoundary Method
Rhino for Mac 5.1
 Attempts to construct a mesh from a closed planar curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Mesh CreateFromPlanarBoundary(
	Curve boundary,
	MeshingParameters parameters
)
Public Shared Function CreateFromPlanarBoundary (
	boundary As Curve,
	parameters As MeshingParameters
) As Mesh
Parameters
boundary
Type: Rhino.Geometry.Curve
must be a closed planar curve.
parameters
Type: Rhino.Geometry.MeshingParameters
parameters used for creating the mesh.
Return Value
Type: Mesh
 New mesh on success or null on failure.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace