RhinoCommon SDK
PickContext.MeshHitFlag Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Input.Custom.PickContext.MeshHitFlag"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum MeshHitFlag
Public Enumeration MeshHitFlag
Members
Member name | Value | Description
Invalid | -1
Vertex | 0
Edge | 1
Face | 2
See Also
Reference
Rhino.Input.Custom Namespace