RhinoCommon SDK
MeshingParameters Class
Rhino for Mac 5.1
 Represents settings used for creating a mesh representation of a brep or surface.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.MeshingParameters
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MeshingParameters : IDisposable
Public Class MeshingParameters
	Implements IDisposable
The MeshingParameters type exposes the following members.
Constructors
Name | Description
MeshingParameters
 Initializes a new instance with default values.
Initial values are same as Default.
Top
Properties
Name | Description
Coarse
 Gets meshing parameters for coarse meshing.
This corresponds with the "Jagged and Faster" default in Rhino.
ComputeCurvature
 Gets or sets a value indicating whether or not surface curvature data will be embedded in the mesh.
Default
 Get default meshing parameters.
GridAmplification
 Gets or sets the grid amplification factor. Values lower than 1.0 will decrease the number of initial quads, values higher than 1.0 will increase the number of initial quads.
GridAngle
 Gets or sets the maximum allowed angle difference (in radians) for a single sampling quad. The angle pertains to the surface normals.
GridAspectRatio
 Gets or sets the maximum allowed aspect ratio of sampling quads.
GridMaxCount
 Gets or sets the maximum number of grid quads in the initial sampling grid.
GridMinCount
 Gets or sets the minimum number of grid quads in the initial sampling grid.
JaggedSeams
 Gets or sets whether or not the mesh is allowed to have jagged seams. When this flag is set to true, meshes on either side of a Brep Edge will not match up.
MaximumEdgeLength
 Gets or sets the maximum allowed mesh edge length.
Minimal
Gets minimal meshing parameters.
MinimumEdgeLength
 Gets or sets the minimum allowed mesh edge length.
MinimumTolerance
 Gets or sets the minimum tolerance.
RefineAngle
 Gets or sets the mesh parameter refine angle.
RefineGrid
 Gets or sets a value indicating whether or not the sampling grid can be refined when certain tolerances are not met.
RelativeTolerance
 Gets or sets the relative tolerance.
SimplePlanes
 Gets or sets a value indicating whether or not planar areas are allowed to be meshed in a simplified manner.
Smooth
 Gets meshing parameters for smooth meshing.
This corresponds with the "Smooth and Slower" default in Rhino.
Tolerance
 Gets or sets the maximum allowed edge deviation. This tolerance is measured between the center of the mesh edge and the surface.
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
DocumentCurrentSetting
 Gets the MeshingParameters that are currently set for a document. These are the same settings that are shown in the DocumentProperties "mesh settings" user interface.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Geometry Namespace