RhinoCommon SDK
Curve.IsArc Method
Rhino for Mac 5.1
Overload List
Name | Description
IsArc()
 Test a curve to see if it can be represented by an arc or circle within RhinoMath.ZeroTolerance.
IsArc(Double)
 Test a curve to see if it can be represented by an arc or circle within the given tolerance.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace