RhinoCommon SDK
MaterialTable Properties
Rhino for Mac 5.1
The MaterialTable type exposes the following members.
Properties
Name | Description
Count
 Returns number of materials in the material table, including deleted materials.
CurrentMaterialIndex
 At all times, there is a "current" material. Unless otherwise specified, new objects are assigned to the current material. The current material is never locked, hidden, or deleted.
CurrentMaterialSource
 Gets or sets the current material source.
Document
Document that owns this table.
Item
 Conceptually, the material table is an array of materials. The operator[] can be used to get individual materials. A material is either active or deleted and this state is reported by Material.IsDeleted.
Top
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace