RhinoCommon SDK
OpenFileDialog Methods
Rhino for Mac 5.1
The OpenFileDialog type exposes the following members.
Methods
Name | Description
ShowDialog
Show the actual dialog to allow the user to select a file.
Top
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace