RhinoCommon SDK
GetObject.ObjectCount Property
Rhino for Mac 5.1
 Gets the number of objects that were selected.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ObjectCount { get; }
Public ReadOnly Property ObjectCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace