RhinoCommon SDK
Arc.AngleDomain Property
Rhino for Mac 5.1
 Gets or sets the angle domain (in Radians) of this arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interval AngleDomain { get; set; }
Public Property AngleDomain As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
Arc Structure
Rhino.Geometry Namespace