RhinoCommon SDK
Polyline.CollapseShortSegments Method
Rhino for Mac 5.1
 Collapses all segments until none are shorter than tolerance. This function is significantly slower than DeleteShortSegments, since it recursively operates on the shortest segment. When a segment is collapsed the end-points are placed in the center of the segment.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int CollapseShortSegments(
	double tolerance
)
Public Function CollapseShortSegments (
	tolerance As Double
) As Integer
Parameters
tolerance
Type: System.Double
Tolerance to use during collapsing.
Return Value
Type: Int32
The number of segments that were collapsed.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace
Polyline.DeleteShortSegments(Double)