RhinoCommon SDK
Matrix.BackSolvePoints Method
Rhino for Mac 5.1
 Solves M*x=b where M is upper triangular with a unit diagonal and b is a column of 3d points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d[] BackSolvePoints(
	double zeroTolerance,
	Point3d[] b
)
Public Function BackSolvePoints (
	zeroTolerance As Double,
	b As Point3d()
) As Point3d()
Parameters
zeroTolerance
Type: System.Double
(>=0.0) used to test for "zero" values in b in underdetermined systems of equations.
b
Type: Rhino.Geometry.Point3d[]
The values in B[RowCount],...,B[B.Length-1] are tested to make sure they are "zero".
Return Value
Type: Point3d[]
 Array of length ColumnCount on success. null on error.
See Also
Reference
Matrix Class
Rhino.Geometry Namespace