RhinoCommon SDK
PointCloud.InsertRange Method
Rhino for Mac 5.1
 Append a collection of points to this point cloud.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void InsertRange(
	int index,
	IEnumerable<Point3d> points
)
Public Sub InsertRange (
	index As Integer,
	points As IEnumerable(Of Point3d)
)
Parameters
index
Type: System.Int32
Index at which to insert the new collection.
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to append.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace