RhinoCommon SDK
PointCloud.Add Method
Rhino for Mac 5.1
Overload List
Name | Description
Add(Point3d)
 Append a new point to the end of the list.
Add(Point3d, Vector3d)
 Append a new point to the end of the list.
Add(Point3d, Color)
 Append a new point to the end of the list.
Add(Point3d, Vector3d, Color)
 Append a new point to the end of the list.
Top
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace