RhinoCommon SDK
Intersection.CurveBrepFace Method
Rhino for Mac 5.1
 Intersects a curve with a Brep face.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool CurveBrepFace(
	Curve curve,
	BrepFace face,
	double tolerance,
	out Curve[] overlapCurves,
	out Point3d[] intersectionPoints
)
Public Shared Function CurveBrepFace (
	curve As Curve,
	face As BrepFace,
	tolerance As Double,
	<OutAttribute> ByRef overlapCurves As Curve(),
	<OutAttribute> ByRef intersectionPoints As Point3d()
) As Boolean
Parameters
curve
Type: Rhino.Geometry.Curve
A curve.
face
Type: Rhino.Geometry.BrepFace
A brep face.
tolerance
Type: System.Double
Fitting and near miss tolerance.
overlapCurves
Type: Rhino.Geometry.Curve[]
A overlap curves array argument. This out reference is assigned during the call.
intersectionPoints
Type: Rhino.Geometry.Point3d[]
A points array argument. This out reference is assigned during the call.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace