RhinoCommon SDK
Material.GetBumpTexture Method
Rhino for Mac 5.1
 Gets the bump texture of this material.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Texture GetBumpTexture()
Public Function GetBumpTexture As Texture
Return Value
Type: Texture
A texture; or null if no bump texture has been added to this material.
See Also
Reference
Material Class
Rhino.DocObjects Namespace