RhinoCommon SDK
BinaryArchiveWriter.WriteSizeF Method
Rhino for Mac 5.1
 Writes a SizeF value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteSizeF(
	SizeF value
)
Public Sub WriteSizeF (
	value As SizeF
)
Parameters
value
Type: System.Drawing.SizeF
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace