RhinoCommon SDK
MeshFaceList.AdjacentFaces Method
Rhino for Mac 5.1
 Gets all faces that share a topological edge with a given face.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] AdjacentFaces(
	int faceIndex
)
Public Function AdjacentFaces (
	faceIndex As Integer
) As Integer()
Parameters
faceIndex
Type: System.Int32
A face index.
Return Value
Type: Int32[]
All indices that share an edge.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace