RhinoCommon SDK
Curve.DuplicateSegments Method
Rhino for Mac 5.1
 Polylines will be exploded into line segments. ExplodeCurves will return the curves in topological order.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] DuplicateSegments()
Public Function DuplicateSegments As Curve()
Return Value
Type: Curve[]
 An array of all the segments that make up this curve.
See Also
Reference
Curve Class
Rhino.Geometry Namespace