RhinoCommon SDK
BrepLoopList.GetEnumerator Method
Rhino for Mac 5.1
 Gets an enumerator that visits all edges.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<BrepLoop> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepLoop)
Return Value
Type: IEnumerator<BrepLoop>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
BrepLoopList Class
Rhino.Geometry.Collections Namespace