RhinoCommon SDK
MeshFaceList.ConvertQuadsToTriangles Method
Rhino for Mac 5.1
Splits all quads along the short diagonal.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ConvertQuadsToTriangles()
Public Function ConvertQuadsToTriangles As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace