RhinoCommon SDK
Dialogs.KillSplash Method
Rhino for Mac 5.1
 Destroy the splash screen if it is being displayed.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void KillSplash()
Public Shared Sub KillSplash
See Also
Reference
Dialogs Class
Rhino.UI Namespace