RhinoCommon SDK
Brep.CreateFromOffsetFace Method
Rhino for Mac 5.1
 Offsets a face including trim information to create a new brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep CreateFromOffsetFace(
	BrepFace face,
	double offsetDistance,
	double offsetTolerance,
	bool bothSides,
	bool createSolid
)
Public Shared Function CreateFromOffsetFace (
	face As BrepFace,
	offsetDistance As Double,
	offsetTolerance As Double,
	bothSides As Boolean,
	createSolid As Boolean
) As Brep
Parameters
face
Type: Rhino.Geometry.BrepFace
the face to offset.
offsetDistance
Type: System.Double
An offset distance.
offsetTolerance
Type: System.Double
 Use 0.0 to make a loose offset. Otherwise, the document's absolute tolerance is usually sufficient.
bothSides
Type: System.Boolean
When true, offset to both sides of the input face.
createSolid
Type: System.Boolean
When true, make a solid object.
Return Value
Type: Brep
 A new brep if successful. The brep can be disjoint if bothSides is true and createSolid is false, or if createSolid is true and connecting the offsets with side surfaces fails. null if unsuccessful.
See Also
Reference
Brep Class
Rhino.Geometry Namespace