RhinoCommon SDK
DisplayPipeline.EnableDepthWriting Method
Rhino for Mac 5.1
 Enable or disable the DepthWriting behaviour of the engine. When DepthWriting is disabled, drawn geometry does not affect the Z-Buffer.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableDepthWriting(
	bool enable
)
Public Sub EnableDepthWriting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true to enable DepthWriting, false to disable.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace