RhinoCommon SDK
TextDotObject Class
Rhino for Mac 5.1
 Represents a text dot that is a document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.TextDotObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class TextDotObject : RhinoObject
Public Class TextDotObject
	Inherits RhinoObject
The TextDotObject type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace