RhinoCommon SDK
TextureMappingType Enumeration
Rhino for Mac 5.1
 Defines enumerated constants for mapping types such as planar, cylindrical or spherical.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum TextureMappingType
Public Enumeration TextureMappingType
Members
Member name | Value | Description
None | 0 | No mapping is selected.
SurfaceParameters | 1 | (u, v) = linear transform of surface params, w = 0.
PlaneMapping | 2 | (u, v, w) = 3d coordinates wrt frame.
CylinderMapping | 3 | (u, v, w) = longitude, height, radius.
SphereMapping | 4 | (u, v, w) = longitude,latitude,radius.
BoxMapping | 5 | Box mapping type.
MeshMappingPrimitive | 6 | Mapping primitive is a mesh.
SurfaceMappingPrimitive | 7 | Mapping primitive is a surface.
BrepMappingPrimitive | 8 | Mapping primitive is a brep.
See Also
Reference
Rhino.Render Namespace