RhinoCommon SDK
LightTable.Item Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTable.Item(System.Int32)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public LightObject this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As LightObject
	Get
Parameters
index
Type: System.Int32
Property Value
Type: LightObject
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace