RhinoCommon SDK
Arc.MidPoint Property
Rhino for Mac 5.1
 Gets the mid-point of the arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d MidPoint { get; }
Public ReadOnly Property MidPoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Arc Structure
Rhino.Geometry Namespace