RhinoCommon SDK
DisplayModeDescription.PipelineLocked Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.PipelineLocked"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PipelineLocked { get; set; }
Public Property PipelineLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace