RhinoCommon SDK
OptionColor Properties
Rhino for Mac 5.1
The OptionColor type exposes the following members.
Properties
Name | Description
CurrentValue
InitialValue
Top
See Also
Reference
OptionColor Class
Rhino.Input.Custom Namespace