RhinoCommon SDK
SaveFileDialog Methods
Rhino for Mac 5.1
The SaveFileDialog type exposes the following members.
Methods
Name | Description
ShowDialog
Top
See Also
Reference
SaveFileDialog Class
Rhino.UI Namespace