RhinoCommon SDK
ReplayHistoryData.GetRhinoObjRef Method
Rhino for Mac 5.1
 In ReplayHistory, use GetRhinoObjRef to convert the information in a history record into the ObjRef that has up to date RhinoObject pointers
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjRef GetRhinoObjRef(
	int id
)
Public Function GetRhinoObjRef (
	id As Integer
) As ObjRef
Parameters
id
Type: System.Int32
HistoryRecord value id
Return Value
Type: ObjRef
ObjRef on success, null if not successful
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace