RhinoCommon SDK
MeshTopologyVertexList.ConnectedTopologyVertices Method
Rhino for Mac 5.1
Overload List
Name | Description
ConnectedTopologyVertices(Int32)
 Gets all topological vertices that are connected to a given vertex.
ConnectedTopologyVertices(Int32, Boolean)
 Gets all topological vertices that are connected to a given vertex.
Top
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace