RhinoCommon SDK
MaterialTable.GetEnumerator Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.MaterialTable.GetEnumerator"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<Material> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Material)
Return Value
Type: IEnumerator<Material>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.MaterialTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace