RhinoCommon SDK
Mesh.PointAt Method (MeshPoint)
Rhino for Mac 5.1
 Evaluate a mesh at a set of barycentric coordinates.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAt(
	MeshPoint meshPoint
)
Public Function PointAt (
	meshPoint As MeshPoint
) As Point3d
Parameters
meshPoint
Type: Rhino.Geometry.MeshPoint
MeshPoint instance contiaining a valid Face Index and Barycentric coordinates.
Return Value
Type: Point3d
A Point on the mesh or Point3d.Unset if the faceIndex is not valid or if the barycentric coordinates could not be evaluated.
See Also
Reference
Mesh Class
PointAt Overload
Rhino.Geometry Namespace