RhinoCommon SDK
File3dmSettings.ModelBasepoint Property
Rhino for Mac 5.1
 Gets or sets the model basepoint that is used when the file is read as an instance definition.
This point is mapped to the origin in the instance definition.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d ModelBasepoint { get; set; }
Public Property ModelBasepoint As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace