RhinoCommon SDK
Brep.CreatePlanarBreps Method (CurveList)
Rhino for Mac 5.1
 Constructs a set of planar Breps as outlines by the loops.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep[] CreatePlanarBreps(
	CurveList inputLoops
)
Public Shared Function CreatePlanarBreps (
	inputLoops As CurveList
) As Brep()
Parameters
inputLoops
Type: Rhino.Collections.CurveList
Curve loops that delineate the planar boundaries.
Return Value
Type: Brep[]
An array of Planar Breps or null on error.
See Also
Reference
Brep Class
CreatePlanarBreps Overload
Rhino.Geometry Namespace