RhinoCommon SDK
TurnOnGripsEventHandler Delegate
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.TurnOnGripsEventHandler"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public delegate void TurnOnGripsEventHandler(
	RhinoObject rhObj
)
Public Delegate Sub TurnOnGripsEventHandler (
	rhObj As RhinoObject
)
Parameters
rhObj
Type: Rhino.DocObjects.RhinoObject
See Also
Reference
Rhino.DocObjects.Custom Namespace