RhinoCommon SDK
MeshTopologyEdgeList.GetTopologyVertices Method
Rhino for Mac 5.1
Gets the two topology vertices for a given topology edge.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IndexPair GetTopologyVertices(
	int topologyEdgeIndex
)
Public Function GetTopologyVertices (
	topologyEdgeIndex As Integer
) As IndexPair
Parameters
topologyEdgeIndex
Type: System.Int32
An index of a topology edge.
Return Value
Type: IndexPair
The pair of vertex indices the edge connects.
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace