RhinoCommon SDK
Sphere.NormalAt Method
Rhino for Mac 5.1
 Computes the normal at a specific angular location on the sphere.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d NormalAt(
	double longitudeRadians,
	double latitudeRadians
)
Public Function NormalAt (
	longitudeRadians As Double,
	latitudeRadians As Double
) As Vector3d
Parameters
longitudeRadians
Type: System.Double
A number within the interval [0, 2pi].
latitudeRadians
Type: System.Double
A number within the interval [-pi/2, pi/2].
Return Value
Type: Vector3d
A vector.
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace