RhinoCommon SDK
RadialDimensionObject Class
Rhino for Mac 5.1
 A radius style dimension
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.AnnotationObjectBase
 Rhino.DocObjects.RadialDimensionObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class RadialDimensionObject : AnnotationObjectBase
Public Class RadialDimensionObject
	Inherits AnnotationObjectBase
The RadialDimensionObject type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace