RhinoCommon SDK
Mesh.Duplicate Method
Rhino for Mac 5.1
 Constructs a copy of this mesh. This is the same as DuplicateMesh().
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override GeometryBase Duplicate()
Public Overrides Function Duplicate As GeometryBase
Return Value
Type: GeometryBase
A mesh.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace