RhinoCommon SDK
Brep.IsPointInside Method
Rhino for Mac 5.1
 Determines if point is inside Brep. This question only makes sense when the brep is a closed manifold. This function does not not check for closed or manifold, so result is not valid in those cases. Intersects a line through point with brep, finds the intersection point Q closest to point, and looks at face normal at Q. If the point Q is on an edge or the intersection is not transverse at Q, then another line is used.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsPointInside(
	Point3d point,
	double tolerance,
	bool strictlyIn
)
Public Function IsPointInside (
	point As Point3d,
	tolerance As Double,
	strictlyIn As Boolean
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
3d point to test.
tolerance
Type: System.Double
 3d distance tolerance used for intersection and determining strict inclusion. A good default is RhinoMath.SqrtEpsilon.
strictlyIn
Type: System.Boolean
 if true, point is in if inside brep by at least tolerance. if false, point is in if truly in or within tolerance of boundary.
Return Value
Type: Boolean
 true if point is in, false if not.
See Also
Reference
Brep Class
Rhino.Geometry Namespace