RhinoCommon SDK
GroupTable.Lock Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.GroupTable.Lock(System.Int32)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Lock(
	int groupIndex
)
Public Function Lock (
	groupIndex As Integer
) As Integer
Parameters
groupIndex
Type: System.Int32
[Missing <param name="groupIndex"/> documentation for "M:Rhino.DocObjects.Tables.GroupTable.Lock(System.Int32)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.GroupTable.Lock(System.Int32)"]
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace