RhinoCommon SDK
ViewportInfo.GetXform Method
Rhino for Mac 5.1
 Computes a transform from a coordinate system to another.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform GetXform(
	CoordinateSystem sourceSystem,
	CoordinateSystem destinationSystem
)
Public Function GetXform (
	sourceSystem As CoordinateSystem,
	destinationSystem As CoordinateSystem
) As Transform
Parameters
sourceSystem
Type: Rhino.DocObjects.CoordinateSystem
The coordinate system to map from.
destinationSystem
Type: Rhino.DocObjects.CoordinateSystem
The coordinate system to map into.
Return Value
Type: Transform
The 4x4 transformation matrix (acts on the left).
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace