RhinoCommon SDK
BrepRegionFaceSide.SurfaceNormalPointsIntoRegion Property
Rhino for Mac 5.1
 Gets true if BrepFace's surface normal points into region; false otherwise.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SurfaceNormalPointsIntoRegion { get; }
Public ReadOnly Property SurfaceNormalPointsIntoRegion As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BrepRegionFaceSide Class
Rhino.Geometry Namespace