RhinoCommon SDK
AreaMassProperties.Area Property
Rhino for Mac 5.1
 Gets the area solution.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
Property Value
Type: Double
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace