RhinoCommon SDK
ArcCurve Class
Rhino for Mac 5.1
 Represent arcs and circles.
ArcCurve.IsCircle returns true if the curve is a complete circle.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Curve
 Rhino.Geometry.ArcCurve
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class ArcCurve : Curve
<SerializableAttribute>
Public Class ArcCurve
	Inherits Curve
The ArcCurve type exposes the following members.
Constructors
Name | Description
ArcCurve()
 Initializes a new ArcCurve instance.
Radius is set to 1, position to Origin and Domain to full span (circle).
ArcCurve(Arc)
 Initializes a new ArcCurve instance, copying values from another Arc.
ArcCurve(ArcCurve)
 Initializes a new ArcCurve instance, copying values from another ArcCurve.
ArcCurve(Circle)
 Initializes a new ArcCurve instance, copying the shape of a Circle.
Parameterization will be [0;circle.Circumference]
ArcCurve(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
ArcCurve(Arc, Double, Double)
 Initializes a new ArcCurve instance, copying values from another Arc and specifying the needed parametrization of the arc.
Arc will not be cut again at these parameterizations.
ArcCurve(Circle, Double, Double)
 Initializes a new ArcCurve instance, copying values from a Circle and specifying the needed parametrization of the arc.
Circle will not be newly cut at these parameterizations.
Top
Properties
Name | Description
AngleDegrees
 Gets the angles of this arc in degrees.
AngleRadians
 Gets the angles of this arc in radians.
Arc
 Gets the arc that is contained within this ArcCurve.
IsCompleteCircle
 Gets a value indicating whether or not this curve can be represented by a complete circle.
Radius
 Gets the radius of this ArcCurve.
Top
Methods
Name | Description
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The Nurbs Curves segments do not have fully multiple interior knots.
 3. Rational Nurbs curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent Colinear or Cocircular segments are combined.
Top
Remarks
Details:
an ArcCurve is a subcurve of a circle, with a constant speed parameterization. The parameterization is an affine linear reparameterzation of the underlying arc m_arc onto the domain m_t.
A valid ArcCurve has Radius()>0 and 0<AngleRadians()<=2*PI and a strictly increasing Domain.
See Also
Reference
Rhino.Geometry Namespace