RhinoCommon SDK
Line.FromZ Property
Rhino for Mac 5.1
 Gets or sets the Z coordinate of the line From point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double FromZ { get; set; }
Public Property FromZ As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Line Structure
Rhino.Geometry Namespace