RhinoCommon SDK
Line.FromX Property
Rhino for Mac 5.1
 Gets or sets the X coordinate of the line From point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double FromX { get; set; }
Public Property FromX As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Line Structure
Rhino.Geometry Namespace