RhinoCommon SDK
Box.Contains Method (BoundingBox)
Rhino for Mac 5.1
 Test a boundingbox for Box inclusion. This is the same as calling Contains(box,false)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Contains(
	BoundingBox box
)
Public Function Contains (
	box As BoundingBox
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to test.
Return Value
Type: Boolean
true if the box is on the inside of or coincident with this Box.
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace