RhinoCommon SDK
Brep.Split Method (Brep, Double)
Rhino for Mac 5.1
 Splits a Brep into pieces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] Split(
	Brep splitter,
	double intersectionTolerance
)
Public Function Split (
	splitter As Brep,
	intersectionTolerance As Double
) As Brep()
Parameters
splitter
Type: Rhino.Geometry.Brep
A splitting surface or polysurface.
intersectionTolerance
Type: System.Double
The tolerance with which to compute intersections.
Return Value
Type: Brep[]
A new array of breps. This array can be empty.
See Also
Reference
Brep Class
Split Overload
Rhino.Geometry Namespace