RhinoCommon SDK
RhinoGet.GetRectangle Method (GetBoxMode, Point3d, IEnumerable<String>, Point3d[])
Rhino for Mac 5.1
 Gets a 3d rectangle made up of four points.
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetRectangle(
	GetBoxMode mode,
	Point3d firstPoint,
	IEnumerable<string> prompts,
	out Point3d[] corners
)
Public Shared Function GetRectangle (
	mode As GetBoxMode,
	firstPoint As Point3d,
	prompts As IEnumerable(Of String),
	<OutAttribute> ByRef corners As Point3d()
) As Result
Parameters
mode
Type: Rhino.Input.GetBoxMode
A get box mode.
firstPoint
Type: Rhino.Geometry.Point3d
The first corner used. Pass Point3d.Unset if you do not want to set this.
prompts
Type: System.Collections.Generic.IEnumerable<String>
Optional prompts to display while getting points. May be null.
corners
Type: Rhino.Geometry.Point3d[]
Corners of the rectangle in counter-clockwise order will be assigned to this out parameter during this call.
Return Value
Type: Result
Commands.Result.Success if successful.
See Also
Reference
RhinoGet Class
GetRectangle Overload
Rhino.Input Namespace