RhinoCommon SDK
BezierCurve.IsValid Property
Rhino for Mac 5.1
Tests an object to see if it is valid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace