RhinoCommon SDK
EarthAnchorPoint.ModelEast Property
Rhino for Mac 5.1
Earth directions in model coordinates.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d ModelEast { get; set; }
Public Property ModelEast As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace