RhinoCommon SDK
ColorLAB Constructor
Rhino for Mac 5.1
Overload List
Name | Description
ColorLAB(Color)
 Constructs a new instance of ColorLAB that is equivalent to an RGB color.
ColorLAB(Double, Double, Double)
 Constructs a new instance of ColorLAB with custom channel values.
ColorLAB(Double, Double, Double, Double)
 Constructs a new instance of ColorLAB with custom channel values.
Top
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace