RhinoCommon SDK
RenderSettings.AntialiasLevel Property
Rhino for Mac 5.1
 0=none, 1=normal, 2=best.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AntialiasLevel { get; set; }
Public Property AntialiasLevel As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RenderSettings Class
Rhino.Render Namespace