RhinoCommon SDK
BrepVertex.VertexIndex Property
Rhino for Mac 5.1
 Gets the index of this vertex in the Brep.Vertices collection.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int VertexIndex { get; }
Public ReadOnly Property VertexIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace