RhinoCommon SDK
RenderSettings.FlatShade Property
Rhino for Mac 5.1
 Gets or sets a value indicating whether to render using flat shading.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool FlatShade { get; set; }
Public Property FlatShade As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderSettings Class
Rhino.Render Namespace