RhinoCommon SDK
DisplayBitmapDrawList Constructor
Rhino for Mac 5.1
Initializes a new instance of the DisplayBitmapDrawList class
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DisplayBitmapDrawList()
Public Sub New
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace