RhinoCommon SDK
ViewportInfo.GetCameraAngles Method
Rhino for Mac 5.1
 Gets the field of view angles.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetCameraAngles(
	out double halfDiagonalAngleRadians,
	out double halfVerticalAngleRadians,
	out double halfHorizontalAngleRadians
)
Public Function GetCameraAngles (
	<OutAttribute> ByRef halfDiagonalAngleRadians As Double,
	<OutAttribute> ByRef halfVerticalAngleRadians As Double,
	<OutAttribute> ByRef halfHorizontalAngleRadians As Double
) As Boolean
Parameters
halfDiagonalAngleRadians
Type: System.Double
1/2 of diagonal subtended angle. This out parameter is assigned during this call.
halfVerticalAngleRadians
Type: System.Double
1/2 of vertical subtended angle. This out parameter is assigned during this call.
halfHorizontalAngleRadians
Type: System.Double
1/2 of horizontal subtended angle. This out parameter is assigned during this call.
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace