RhinoCommon SDK
DetailViewObject Properties
Rhino for Mac 5.1
The DetailViewObject type exposes the following members.
Properties
Name | Description
DetailGeometry
IsActive
Viewport
Top
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace