RhinoCommon SDK
GripsDrawEventArgs.SelectedGripColor Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripsDrawEventArgs.SelectedGripColor"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color SelectedGripColor { get; set; }
Public Property SelectedGripColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace