RhinoCommon SDK
RhinoObject.IsSelectable Method
Rhino for Mac 5.1
Reports if an object can be selected.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSelectable()
Public Function IsSelectable As Boolean
Return Value
Type: Boolean
true if object is capable of being selected.
Remarks
 Objects that are locked, hidden, or on locked or hidden layers cannot be selected. If IsSelectableWithGripsOn() returns false, then an that object is not selectable if it has grips turned on.
See Also
Reference
RhinoObject Class
IsSelectable Overload
Rhino.DocObjects Namespace