RhinoCommon SDK
CustomCurveObject Constructor
Rhino for Mac 5.1
Overload List
Name | Description
CustomCurveObject()
Initializes a new instance of the CustomCurveObject class
CustomCurveObject(Curve)
Initializes a new instance of the CustomCurveObject class
Top
See Also
Reference
CustomCurveObject Class
Rhino.DocObjects.Custom Namespace