RhinoCommon SDK
RhinoViewport.CameraX Property
Rhino for Mac 5.1
Gets the "unit to the right" vector.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d CameraX { get; }
Public ReadOnly Property CameraX As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace