RhinoCommon SDK
LightTableEventArgs.OldState Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTableEventArgs.OldState"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Light OldState { get; }
Public ReadOnly Property OldState As Light
	Get
Property Value
Type: Light
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace