RhinoCommon SDK
HistoryRecord.SetTransorm Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetTransorm(System.Int32,Rhino.Geometry.Transform)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetTransorm(
	int id,
	Transform value
)
Public Function SetTransorm (
	id As Integer,
	value As Transform
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetTransorm(System.Int32,Rhino.Geometry.Transform)"]
value
Type: Rhino.Geometry.Transform
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetTransorm(System.Int32,Rhino.Geometry.Transform)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetTransorm(System.Int32,Rhino.Geometry.Transform)"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace