RhinoCommon SDK
Line.Inequality Operator
Rhino for Mac 5.1
 Determines whether two lines have different values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator !=(
	Line a,
	Line b
)
Public Shared Operator <> (
	a As Line,
	b As Line
) As Boolean
Parameters
a
Type: Rhino.Geometry.Line
A line.
b
Type: Rhino.Geometry.Line
Another line.
Return Value
Type: Boolean
true if a has any coordinate that distinguishes it from b; otherwise false.
See Also
Reference
Line Structure
Rhino.Geometry Namespace