RhinoCommon SDK
ViewportInfo.GetDollyCameraVector Method
Rhino for Mac 5.1
Overload List
Name | Description
GetDollyCameraVector(Point, Point, Double)
 Gets a world coordinate dolly vector that can be passed to DollyCamera().
GetDollyCameraVector(Int32, Int32, Int32, Int32, Double)
 Gets a world coordinate dolly vector that can be passed to DollyCamera().
Top
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace