RhinoCommon SDK
Brep.Trim Method (Brep, Double)
Rhino for Mac 5.1
 Trims a brep with an oriented cutter. The parts of the brep that lie inside (opposite the normal) of the cutter are retained while the parts to the outside (in the direction of the normal) are discarded. If the Cutter is closed, then a connected component of the Brep that does not intersect the cutter is kept if and only if it is contained in the inside of cutter. That is the region bounded by cutter opposite from the normal of cutter, If cutter is not closed all these components are kept.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] Trim(
	Brep cutter,
	double intersectionTolerance
)
Public Function Trim (
	cutter As Brep,
	intersectionTolerance As Double
) As Brep()
Parameters
cutter
Type: Rhino.Geometry.Brep
A cutting brep.
intersectionTolerance
Type: System.Double
A tolerance value with which to compute intersections.
Return Value
Type: Brep[]
This Brep is not modified, the trim results are returned in an array.
See Also
Reference
Brep Class
Trim Overload
Rhino.Geometry Namespace