RhinoCommon SDK
Panels.OpenPanelAsSibling Method
Rhino for Mac 5.1
 In Mac Rhino this will currently just call OpenPanel, in Windows Rhino this will look for a dock bar which contains the sibling panel and add this panel to that dock bar as necessary, if the panel was in another dock bar it will be moved to this dock bar.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool OpenPanelAsSibling(
	Guid panelId,
	Guid siblingPanelId
)
Public Shared Function OpenPanelAsSibling (
	panelId As Guid,
	siblingPanelId As Guid
) As Boolean
Parameters
panelId
Type: System.Guid
 The class Id of the panel type to open.
siblingPanelId
Type: System.Guid
 The class Id of the sibling panel.
Return Value
Type: Boolean
 Returns true if the panel was successfully opened.
See Also
Reference
Panels Class
Rhino.UI Namespace