RhinoCommon SDK
LinearDimension Properties
Rhino for Mac 5.1
The LinearDimension type exposes the following members.
Properties
Name | Description
Aligned
 Gets or sets a value indicating whether this annotation is aligned.
Arrowhead1End
 Gets the arrow head end of the first extension line.
Arrowhead2End
 Gets the arrow head end of the second extension line.
DimensionStyleIndex
 Index of DimensionStyle in document DimStyle table used by the dimension.
DistanceBetweenArrowTips
 Gets the distance between arrow tips.
ExtensionLine1End
 Gets the end of the first extension line.
ExtensionLine2End
 Gets the end of the second extension line.
TextPosition
 Gets and sets the position of text on the plane.
Top
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace