RhinoCommon SDK
Line.MinimumDistanceTo Method
Rhino for Mac 5.1
Overload List
Name | Description
MinimumDistanceTo(Line)
 Finds the shortest distance between this line as a finite segment and another finite segment.
MinimumDistanceTo(Point3d)
 Finds the shortest distance between this line as a finite segment and a test point.
Top
See Also
Reference
Line Structure
Rhino.Geometry Namespace