RhinoCommon SDK
InstanceDefinition.Url Property
Rhino for Mac 5.1
 The hyperlink URL that is executed when the UrlDescription hyperlink is clicked on in the Insert and Block UI
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Url { get; }
Public ReadOnly Property Url As String
	Get
Property Value
Type: String
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace