RhinoCommon SDK
Surface.IsIsoparametric Method (BoundingBox)
Rhino for Mac 5.1
 Determines if a 2d bounding box is iso-parameteric in the parameter space of this surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IsoStatus IsIsoparametric(
	BoundingBox bbox
)
Public Function IsIsoparametric (
	bbox As BoundingBox
) As IsoStatus
Parameters
bbox
Type: Rhino.Geometry.BoundingBox
Bounding box to test.
Return Value
Type: IsoStatus
IsoStatus flag describing the iso-parametric relationship between the surface and the bounding box.
See Also
Reference
Surface Class
IsIsoparametric Overload
Rhino.Geometry Namespace