RhinoCommon SDK
LightTableEventArgs.EventType Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTableEventArgs.EventType"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public LightTableEventType EventType { get; }
Public ReadOnly Property EventType As LightTableEventType
	Get
Property Value
Type: LightTableEventType
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace