RhinoCommon SDK
CustomObjectGrips.NurbsSurface Method
Rhino for Mac 5.1
 If the grips control a NURBS surface, this returns a pointer to that surface. You can look at but you must NEVER change this surface.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual NurbsSurface NurbsSurface()
Protected Overridable Function NurbsSurface As NurbsSurface
Return Value
Type: NurbsSurface
A pointer to a NURBS surface or null.
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace