RhinoCommon SDK
Brep Constructor
Rhino for Mac 5.1
Initializes a new empty brep
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep()
Public Sub New
See Also
Reference
Brep Class
Brep Overload
Rhino.Geometry Namespace