RhinoCommon SDK
DisplayPipeline.Draw2dText Method
Rhino for Mac 5.1
Overload List
Name | Description
Draw2dText(String, Color, Point2d, Boolean)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point3d, Boolean)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point2d, Boolean, Int32)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point3d, Boolean, Int32)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point2d, Boolean, Int32, String)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point3d, Boolean, Int32, String)
 Draws 2D text on the viewport.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace