RhinoCommon SDK
ObjectTable.AddText Method (TextEntity)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Geometry.TextEntity)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddText(
	TextEntity text
)
Public Function AddText (
	text As TextEntity
) As Guid
Parameters
text
Type: Rhino.Geometry.TextEntity
[Missing <param name="text"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Geometry.TextEntity)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Geometry.TextEntity)"]
See Also
Reference
ObjectTable Class
AddText Overload
Rhino.DocObjects.Tables Namespace