RhinoCommon SDK
ObjectTable.AddText Method (String, Plane, Double, String, Boolean, Boolean, ObjectAttributes)
Rhino for Mac 5.1
 Adds an annotation text object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddText(
	string text,
	Plane plane,
	double height,
	string fontName,
	bool bold,
	bool italic,
	ObjectAttributes attributes
)
Public Function AddText (
	text As String,
	plane As Plane,
	height As Double,
	fontName As String,
	bold As Boolean,
	italic As Boolean,
	attributes As ObjectAttributes
) As Guid
Parameters
text
Type: System.String
Text string.
plane
Type: Rhino.Geometry.Plane
Plane of text.
height
Type: System.Double
Height of text.
fontName
Type: System.String
Name of FontFace.
bold
Type: System.Boolean
Bold flag.
italic
Type: System.Boolean
Italic flag.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes that will be linked with the object.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddText Overload
Rhino.DocObjects.Tables Namespace