RhinoCommon SDK
ObjRef.GeometryComponentIndex Property
Rhino for Mac 5.1
 Gets the component index of the referenced (sub) geometry. Some objects have subobjects that are valid pieces of geometry. For example, breps have edges and faces that are valid curves and surfaces. Each subobject has a component index that is > 0. The parent geometry has a component index = -1.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ComponentIndex GeometryComponentIndex { get; }
Public ReadOnly Property GeometryComponentIndex As ComponentIndex
	Get
Property Value
Type: ComponentIndex
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace