RhinoCommon SDK
GumballObject.SetFromBoundingBox Method (Plane, BoundingBox)
Rhino for Mac 5.1
 Sets the gumball bounding box with respect to a frame.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFromBoundingBox(
	Plane frame,
	BoundingBox frameBoundingBox
)
Public Function SetFromBoundingBox (
	frame As Plane,
	frameBoundingBox As BoundingBox
) As Boolean
Parameters
frame
Type: Rhino.Geometry.Plane
The frame.
frameBoundingBox
Type: Rhino.Geometry.BoundingBox
Bounding box with respect to frame.
Return Value
Type: Boolean
 true if input is valid and gumball is set. false if input is not valid. In this case, gumball is set to the default.
See Also
Reference
GumballObject Class
SetFromBoundingBox Overload
Rhino.UI.Gumball Namespace