RhinoCommon SDK
Layer.GetPersistentVisibility Method
Rhino for Mac 5.1
 The persistent visbility setting is used for layers whose visibilty can be changed by a "parent" object. A common case is when a layer is a child layer (ParentId is not nil). In this case, when a parent layer is turned off, then child layers are also turned off. The persistent visibility setting determines what happens when the parent is turned on again.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetPersistentVisibility()
Public Function GetPersistentVisibility As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.GetPersistentVisibility"]
Remarks
 Returns true if this layer's visibility is controlled by a parent object and the parent is turned on (after being off), then this layer will also be turned on. Returns false if this layer's visibility is controlled by a parent object and the parent layer is turned on (after being off), then this layer will continue to be off. When the persistent visbility is not explicitly set, this property returns the current value of IsVisible
See Also
Reference
Layer Class
Rhino.DocObjects Namespace