RhinoCommon SDK
File3dmTypeCodes.TCODE_CRC Field
Rhino for Mac 5.1
0x8000.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_CRC
Public Const TCODE_CRC As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace