RhinoCommon SDK
ReplayHistoryResult.UpdateToExtrusion Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToExtrusion(Rhino.Geometry.Extrusion,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToExtrusion(
	Extrusion extrusion,
	ObjectAttributes attributes
)
Public Function UpdateToExtrusion (
	extrusion As Extrusion,
	attributes As ObjectAttributes
) As Boolean
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
[Missing <param name="extrusion"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToExtrusion(Rhino.Geometry.Extrusion,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToExtrusion(Rhino.Geometry.Extrusion,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToExtrusion(Rhino.Geometry.Extrusion,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace