RhinoCommon SDK
MaterialTableEventArgs.OldSettings Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.MaterialTableEventArgs.OldSettings"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Material OldSettings { get; }
Public ReadOnly Property OldSettings As Material
	Get
Property Value
Type: Material
See Also
Reference
MaterialTableEventArgs Class
Rhino.DocObjects.Tables Namespace