RhinoCommon SDK
Intersection.ProjectPointsToBrepsEx Method
Rhino for Mac 5.1
 Projects points onto breps.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d[] ProjectPointsToBrepsEx(
	IEnumerable<Brep> breps,
	IEnumerable<Point3d> points,
	Vector3d direction,
	double tolerance,
	out int[] indices
)
Public Shared Function ProjectPointsToBrepsEx (
	breps As IEnumerable(Of Brep),
	points As IEnumerable(Of Point3d),
	direction As Vector3d,
	tolerance As Double,
	<OutAttribute> ByRef indices As Integer()
) As Point3d()
Parameters
breps
Type: System.Collections.Generic.IEnumerable<Brep>
The breps projection targets.
points
Type: System.Collections.Generic.IEnumerable<Point3d>
The points to project.
direction
Type: Rhino.Geometry.Vector3d
The direction to project.
tolerance
Type: System.Double
The tolerance used for intersections.
indices
Type: System.Int32[]
Return points[i] is a projection of points[indices[i]]
Return Value
Type: Point3d[]
 Array of projected points, or null in case of any error or invalid input.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace