RhinoCommon SDK
Rectangle3d.ClosestPoint Method (Point3d, Boolean)
Rhino for Mac 5.1
 Gets the point on the rectangle that is closest to a test-point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d ClosestPoint(
	Point3d point,
	bool includeInterior
)
Public Function ClosestPoint (
	point As Point3d,
	includeInterior As Boolean
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
Point to project.
includeInterior
Type: System.Boolean
If false, the point is projected onto the boundary edge only, otherwise the interior of the rectangle is also taken into consideration.
Return Value
Type: Point3d
The point on the rectangle closest to the test point or Point3d.Unset on failure.
See Also
Reference
Rectangle3d Structure
ClosestPoint Overload
Rhino.Geometry Namespace