RhinoCommon SDK
Curve.SpanDomain Method
Rhino for Mac 5.1
 Get the domain of the curve span with the given index. Use the SpanCount property to test how many spans there are.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interval SpanDomain(
	int spanIndex
)
Public Function SpanDomain (
	spanIndex As Integer
) As Interval
Parameters
spanIndex
Type: System.Int32
Index of span.
Return Value
Type: Interval
Interval of the span with the given index.
See Also
Reference
Curve Class
Rhino.Geometry Namespace