RhinoCommon SDK
BezierCurve.ControlVertexCount Property
Rhino for Mac 5.1
 Number of control vertices in this curve
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ControlVertexCount { get; }
Public ReadOnly Property ControlVertexCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace