RhinoCommon SDK
ExtrusionObject.ExtrusionGeometry Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.ExtrusionObject.ExtrusionGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Extrusion ExtrusionGeometry { get; }
Public ReadOnly Property ExtrusionGeometry As Extrusion
	Get
Property Value
Type: Extrusion
See Also
Reference
ExtrusionObject Class
Rhino.DocObjects Namespace