RhinoCommon SDK
Plane.Rotate Method
Rhino for Mac 5.1
Overload List
Name | Description
Rotate(Double, Vector3d)
 Rotate the plane about its origin point.
Rotate(Double, Vector3d, Point3d)
 Rotate the plane about a custom anchor point.
Rotate(Double, Double, Vector3d)
 Rotate the plane about its origin point.
Rotate(Double, Double, Vector3d, Point3d)
Rotate the plane about a custom anchor point.
Top
See Also
Reference
Plane Structure
Rhino.Geometry Namespace