RhinoCommon SDK
PolyCurve.Append Method (Arc)
Rhino for Mac 5.1
 Appends and matches the start of the arc to the end of polycurve. This function will fail if the polycurve is closed or if SegmentCount > 0 and the arc is closed.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Append(
	Arc arc
)
Public Function Append (
	arc As Arc
) As Boolean
Parameters
arc
Type: Rhino.Geometry.Arc
Arc segment to append.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
PolyCurve Class
Append Overload
Rhino.Geometry Namespace