RhinoCommon SDK
SelCommand.TestLights Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Commands.SelCommand.TestLights"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TestLights { get; set; }
Public Property TestLights As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SelCommand Class
Rhino.Commands Namespace