RhinoCommon SDK
ControlPoint Structure
Rhino for Mac 5.1
 Represents control-point geometry with three-dimensional position and weight.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct ControlPoint : IEpsilonComparable<ControlPoint>
<SerializableAttribute>
Public Structure ControlPoint
	Implements IEpsilonComparable(Of ControlPoint)
The ControlPoint type exposes the following members.
Constructors
Name | Description
ControlPoint(Point3d)
 Constructs a new unweighted control point.
ControlPoint(Point4d)
 Constructs a new weighted control point.
ControlPoint(Point3d, Double)
 Constructs a new weighted control point.
ControlPoint(Double, Double, Double)
 Constructs a new unweighted control point.
ControlPoint(Double, Double, Double, Double)
 Constructs a new weighted control point.
Top
Properties
Name | Description
Location
 Gets or sets the location of the control point. Internally, Rhino stores the location of a weighted control-point as a pre-multiplied coordinate, but RhinoCommon always provides Euclidean coordinates for control-points, regardless of weight.
Unset
 Gets the predefined unset control point.
Weight
 Gets or sets the weight of this control point.
Top
Methods
Name | Description
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Top
See Also
Reference
Rhino.Geometry Namespace