RhinoCommon SDK
RhinoPageView.ActiveViewport Property
Rhino for Mac 5.1
 The ActiveViewport is the same as the MainViewport for standard RhinoViews. In a RhinoPageView, the active viewport may be the RhinoViewport of a child detail object. Most of the time, you will use ActiveViewport unless you explicitly need to work with the main viewport.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override RhinoViewport ActiveViewport { get; }
Public Overrides ReadOnly Property ActiveViewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace