RhinoCommon SDK
File3dm.HatchPatterns Property
Rhino for Mac 5.1
 Hatch patterns in this file
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IList<HatchPattern> HatchPatterns { get; }
Public ReadOnly Property HatchPatterns As IList(Of HatchPattern)
	Get
Property Value
Type: IList<HatchPattern>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace