RhinoCommon SDK
ObjectTable.Replace Method (Guid, PointCloud)
Rhino for Mac 5.1
 Replaces one object with new pointcloud object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	Guid objectId,
	PointCloud pointcloud
)
Public Function Replace (
	objectId As Guid,
	pointcloud As PointCloud
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
pointcloud
Type: Rhino.Geometry.PointCloud
 new pointcloud to be added A duplicate of the pointcloud is added to the Rhino model.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace