RhinoCommon SDK
ObjectTable.Replace Method (ObjRef, Surface)
Rhino for Mac 5.1
 Replaces one object with new surface object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	ObjRef objref,
	Surface surface
)
Public Function Replace (
	objref As ObjRef,
	surface As Surface
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
reference to old object to be replaced. The objref.Object() will be deleted.
surface
Type: Rhino.Geometry.Surface
 new surface to be added A duplicate of the surface is added to the Rhino model.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace