RhinoCommon SDK
InstanceDefinitionTable.GetEnumerator Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.GetEnumerator"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<InstanceDefinition> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of InstanceDefinition)
Return Value
Type: IEnumerator<InstanceDefinition>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace