RhinoCommon SDK
RTree.CreatePointCloudTree Method
Rhino for Mac 5.1
 Constructs a new tree with an element for each pointcloud point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static RTree CreatePointCloudTree(
	PointCloud cloud
)
Public Shared Function CreatePointCloudTree (
	cloud As PointCloud
) As RTree
Parameters
cloud
Type: Rhino.Geometry.PointCloud
A pointcloud.
Return Value
Type: RTree
A new tree, or null on error.
See Also
Reference
RTree Class
Rhino.Geometry Namespace