RhinoCommon SDK
DisplayMaterial.GetTransparencyTexture Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayMaterial.GetTransparencyTexture(System.Boolean)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Texture GetTransparencyTexture(
	bool front
)
Public Function GetTransparencyTexture (
	front As Boolean
) As Texture
Parameters
front
Type: System.Boolean
[Missing <param name="front"/> documentation for "M:Rhino.Display.DisplayMaterial.GetTransparencyTexture(System.Boolean)"]
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.Display.DisplayMaterial.GetTransparencyTexture(System.Boolean)"]
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace