RhinoCommon SDK
IPanelsService.OpenPanelAsSibling Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.OpenPanelAsSibling(System.Guid,System.Guid)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
bool OpenPanelAsSibling(
	Guid panelId,
	Guid siblingPanelId
)
Function OpenPanelAsSibling (
	panelId As Guid,
	siblingPanelId As Guid
) As Boolean
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.OpenPanelAsSibling(System.Guid,System.Guid)"]
siblingPanelId
Type: System.Guid
[Missing <param name="siblingPanelId"/> documentation for "M:Rhino.UI.IPanelsService.OpenPanelAsSibling(System.Guid,System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.OpenPanelAsSibling(System.Guid,System.Guid)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace