RhinoCommon SDK
ReplayHistoryData.TryGetTransform Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetTransform(System.Int32,Rhino.Geometry.Transform@)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetTransform(
	int id,
	out Transform value
)
Public Function TryGetTransform (
	id As Integer,
	<OutAttribute> ByRef value As Transform
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetTransform(System.Int32,Rhino.Geometry.Transform@)"]
value
Type: Rhino.Geometry.Transform
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetTransform(System.Int32,Rhino.Geometry.Transform@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetTransform(System.Int32,Rhino.Geometry.Transform@)"]
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace