RhinoCommon SDK
Interval.Max Property
Rhino for Mac 5.1
 Gets the larger of T0 and T1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Max { get; }
Public ReadOnly Property Max As Double
	Get
Property Value
Type: Double
See Also
Reference
Interval Structure
Rhino.Geometry Namespace