RhinoCommon SDK
RhinoObject.IsSelectable Method (Boolean, Boolean, Boolean, Boolean)
Rhino for Mac 5.1
Reports if an object can be selected.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSelectable(
	bool ignoreSelectionState,
	bool ignoreGripsState,
	bool ignoreLayerLocking,
	bool ignoreLayerVisibility
)
Public Function IsSelectable (
	ignoreSelectionState As Boolean,
	ignoreGripsState As Boolean,
	ignoreLayerLocking As Boolean,
	ignoreLayerVisibility As Boolean
) As Boolean
Parameters
ignoreSelectionState
Type: System.Boolean
 If true, then selected objects are selectable. If false, then selected objects are not selectable.
ignoreGripsState
Type: System.Boolean
 If true, then objects with grips on can be selected. If false, then the value returned by the object's IsSelectableWithGripsOn() function decides if the object can be selected.
ignoreLayerLocking
Type: System.Boolean
 If true, then objects on locked layers are selectable. If false, then objects on locked layers are not selectable.
ignoreLayerVisibility
Type: System.Boolean
 If true, then objects on hidden layers are selectable. If false, then objects on hidden layers are not selectable.
Return Value
Type: Boolean
true if object is capable of being selected.
Remarks
 Objects that are locked, hidden, or on locked or hidden layers cannot be selected. If IsSelectableWithGripsOn() returns false, then an that object is not selectable if it has grips turned on.
See Also
Reference
RhinoObject Class
IsSelectable Overload
Rhino.DocObjects Namespace