RhinoCommon SDK
LinetypeTable.Delete Method (Int32, Boolean)
Rhino for Mac 5.1
Deletes linetype.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Delete(
	int index,
	bool quiet
)
Public Function Delete (
	index As Integer,
	quiet As Boolean
) As Boolean
Parameters
index
Type: System.Int32
zero based index of linetype to delete.
quiet
Type: System.Boolean
 If true, no warning message box appears if a linetype the linetype cannot be deleted because it is the current linetype or it contains active geometry.
Return Value
Type: Boolean
 true if successful. false if linetypeIndex is out of range or the linetype cannot be deleted because it is the current linetype or because it linetype is referenced by active geometry.
See Also
Reference
LinetypeTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace