RhinoCommon SDK
Command.InScriptRunnerCommand Method
Rhino for Mac 5.1
 This is a low level tool to determine if Rhino is currently running a script running command like "ReadCommandFile" or the RhinoScript plug-in's "RunScript".
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool InScriptRunnerCommand()
Public Shared Function InScriptRunnerCommand As Boolean
Return Value
Type: Boolean
true if a script running command is active.
See Also
Reference
Command Class
Rhino.Commands Namespace