RhinoCommon SDK
BinaryArchiveReader.ReadGeometry Method
Rhino for Mac 5.1
 Reads a GeometryBase-derived object from the archive.
The GeometryBase class is abstract.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GeometryBase ReadGeometry()
Public Function ReadGeometry As GeometryBase
Return Value
Type: GeometryBase
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace