RhinoCommon SDK
MaterialRefs.Remove Method
Rhino for Mac 5.1
Overload List
Name | Description
Remove(KeyValuePair<Guid, MaterialRef>)
 Removes the element with the specified plug-in id from the this dictionary.
Remove(Guid)
 Removes the MaterialRef with the specified plug-in Id from this dictionary.
Top
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace