RhinoCommon SDK
ReplayHistoryResult.ExistingObject Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.ReplayHistoryResult.ExistingObject"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject ExistingObject { get; }
Public ReadOnly Property ExistingObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace