RhinoCommon SDK
File3dmObjectTable.AddTextDot Method (TextDot)
Rhino for Mac 5.1
Adds a text dot object to Rhino.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddTextDot(
	TextDot dot
)
Public Function AddTextDot (
	dot As TextDot
) As Guid
Parameters
dot
Type: Rhino.Geometry.TextDot
The text dot.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddTextDot Overload
Rhino.FileIO Namespace