RhinoCommon SDK
HistoryRecord.SetObjRef Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetObjRef(System.Int32,Rhino.DocObjects.ObjRef)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetObjRef(
	int id,
	ObjRef value
)
Public Function SetObjRef (
	id As Integer,
	value As ObjRef
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetObjRef(System.Int32,Rhino.DocObjects.ObjRef)"]
value
Type: Rhino.DocObjects.ObjRef
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetObjRef(System.Int32,Rhino.DocObjects.ObjRef)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetObjRef(System.Int32,Rhino.DocObjects.ObjRef)"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace