RhinoCommon SDK
ObjectAttributes.ViewportId Property
Rhino for Mac 5.1
 If ViewportId is nil, the object is active in all viewports. If ViewportId is not nil, then this object is only active in a specific view. This field is primarily used to assign page space objects to a specific page, but it can also be used to restrict model space to a specific view.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid ViewportId { get; set; }
Public Property ViewportId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace