RhinoCommon SDK
NamedViewTable.Add Method (ViewInfo)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Add(Rhino.DocObjects.ViewInfo)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	ViewInfo view
)
Public Function Add (
	view As ViewInfo
) As Integer
Parameters
view
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="view"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Add(Rhino.DocObjects.ViewInfo)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Add(Rhino.DocObjects.ViewInfo)"]
See Also
Reference
NamedViewTable Class
Add Overload
Rhino.DocObjects.Tables Namespace