RhinoCommon SDK
MeshFaceList.GetFaceAspectRatio Method
Rhino for Mac 5.1
 Returns the mesh face at the given index.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double GetFaceAspectRatio(
	int index
)
Public Function GetFaceAspectRatio (
	index As Integer
) As Double
Parameters
index
Type: System.Int32
Index of face to get. Must be larger than or equal to zero and smaller than the Face Count of the mesh.
Return Value
Type: Double
The mesh face at the given index on success or MeshFace.Unset if the index is out of range.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace