RhinoCommon SDK
HistoryRecord.SetPoint3d Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetPoint3d(System.Int32,Rhino.Geometry.Point3d)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetPoint3d(
	int id,
	Point3d value
)
Public Function SetPoint3d (
	id As Integer,
	value As Point3d
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetPoint3d(System.Int32,Rhino.Geometry.Point3d)"]
value
Type: Rhino.Geometry.Point3d
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetPoint3d(System.Int32,Rhino.Geometry.Point3d)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetPoint3d(System.Int32,Rhino.Geometry.Point3d)"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace