RhinoCommon SDK
File3dm.ReadArchiveVersion Method
Rhino for Mac 5.1
 Reads only the archive 3dm version from an existing 3dm file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static int ReadArchiveVersion(
	string path
)
Public Shared Function ReadArchiveVersion (
	path As String
) As Integer
Parameters
path
Type: System.String
The file from which to read the archive version.
Return Value
Type: Int32
The 3dm file archive version.
Exceptions
Exception | Condition
FileNotFoundException | If path does not exist, is null or cannot be accessed because of permissions.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace