RhinoCommon SDK
LinetypeTable.Item Property
Rhino for Mac 5.1
 Conceptually, the linetype table is an array of linetypes. The operator[] can be used to get individual linetypes. A linetype is either active or deleted and this state is reported by Linetype.IsDeleted.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Linetype this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As Linetype
	Get
Parameters
index
Type: System.Int32
zero based array index.
Return Value
Type: Linetype
 Refererence to the linetype. If index is out of range, the current linetype is returned. Note that this reference may become invalid after AddLinetype() is called.
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace