RhinoCommon SDK
GumballObject.SetFromLight Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromLight(Rhino.Geometry.Light)"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFromLight(
	Light light
)
Public Function SetFromLight (
	light As Light
) As Boolean
Parameters
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromLight(Rhino.Geometry.Light)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromLight(Rhino.Geometry.Light)"]
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace