RhinoCommon SDK
SweepOneRail.PerformSweep Method
Rhino for Mac 5.1
Overload List
Name | Description
PerformSweep(Curve, Curve)
PerformSweep(Curve, IEnumerable<Curve>)
PerformSweep(Curve, Curve, Double)
PerformSweep(Curve, IEnumerable<Curve>, IEnumerable<Double>)
Top
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace