RhinoCommon SDK
ObjectAttributes.Space Property
Rhino for Mac 5.1
 Starting with V4, objects can be in either model space or page space. If an object is in page space, then ViewportId is not nil and identifies the page it is on.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ActiveSpace Space { get; set; }
Public Property Space As ActiveSpace
	Get
	Set
Property Value
Type: ActiveSpace
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace