RhinoCommon SDK
BitmapTable.DeleteBitmap Method
Rhino for Mac 5.1
Deletes a bitmap.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DeleteBitmap(
	string bitmapFilename
)
Public Function DeleteBitmap (
	bitmapFilename As String
) As Boolean
Parameters
bitmapFilename
Type: System.String
The bitmap file name.
Return Value
Type: Boolean
 true if successful. false if the bitmap cannot be deleted because it is the current bitmap or because it bitmap contains active geometry.
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace