RhinoCommon SDK
Matrix.Addition Operator
Rhino for Mac 5.1
 Adds two matrices and returns a new sum matrix.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Matrix operator +(
	Matrix a,
	Matrix b
)
Public Shared Operator + (
	a As Matrix,
	b As Matrix
) As Matrix
Parameters
a
Type: Rhino.Geometry.Matrix
A first matrix to use in calculation.
b
Type: Rhino.Geometry.Matrix
Another matrix to use in calculation.
Return Value
Type: Matrix
The sum matrix.
Exceptions
Exception | Condition
ArgumentException |  When the two matrices are not the same size.
See Also
Reference
Matrix Class
Rhino.Geometry Namespace