RhinoCommon SDK
RhinoView Properties
Rhino for Mac 5.1
The RhinoView type exposes the following members.
Properties
Name | Description
ActiveViewport
 The ActiveViewport is the same as the MainViewport for standard RhinoViews. In a RhinoPageView, the active viewport may be the RhinoViewport of a child detail object. Most of the time, you will use ActiveViewport unless you explicitly need to work with the main viewport.
ActiveViewportID
 Returns viewport ID for the active viewport. Faster than ActiveViewport function when working with page views.
Bounds
 Gets or sets the size and location of the view including its nonclient elements, in pixels, relative to the parent control.
ClientRectangle
 Gets the rectangle that represents the client area of the view.
Document
EnableDrawing
 Gets or sets the 'drawing enabled' flag. By default, drawing is enabled.
There are some rare situations where scipts want to disable drawing for a while.
Floating
 Floating state of RhinoView. if true, then the view will be in a floating frame window. Otherwise the view will be embeded in the main frame.
Handle
 Gets the window handle that this view is bound to.
MainViewport
 A RhinoView contains a "main viewport" that fills the entire view client window. RhinoPageViews may also contain nested child RhinoViewports for implementing detail viewports. The MainViewport will always return this RhinoView's m_vp.
Maximized
ScreenRectangle
 Gets the rectangle that represents the client area of the view in screen coordinates.
TitleVisible
 Visibility of the viewport title window.
Top
See Also
Reference
RhinoView Class
Rhino.Display Namespace