RhinoCommon SDK
GetLine.EnableFromMidPointOption Method
Rhino for Mac 5.1
 If true, the the "MidPoint" options shows up
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableFromMidPointOption(
	bool on
)
Public Sub EnableFromMidPointOption (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Input.Custom.GetLine.EnableFromMidPointOption(System.Boolean)"]
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace