RhinoCommon SDK
ViewportInfo.FrustumFarPlane Property
Rhino for Mac 5.1
 Gets far clipping plane if camera and frustum are valid. The plane's frame is the same as the camera's frame. The origin is located at the intersection of the camera direction ray and the far clipping plane. The plane's normal points into the frustum towards the camera location.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Plane FrustumFarPlane { get; }
Public ReadOnly Property FrustumFarPlane As Plane
	Get
Property Value
Type: Plane
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace