RhinoCommon SDK
TransformCommand.TransformObjects Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Commands.TransformCommand.TransformObjects(Rhino.Collections.TransformObjectList,Rhino.Geometry.Transform,System.Boolean,System.Boolean)"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected void TransformObjects(
	TransformObjectList list,
	Transform xform,
	bool copy,
	bool autoHistory
)
Protected Sub TransformObjects (
	list As TransformObjectList,
	xform As Transform,
	copy As Boolean,
	autoHistory As Boolean
)
Parameters
list
Type: Rhino.Collections.TransformObjectList
[Missing <param name="list"/> documentation for "M:Rhino.Commands.TransformCommand.TransformObjects(Rhino.Collections.TransformObjectList,Rhino.Geometry.Transform,System.Boolean,System.Boolean)"]
xform
Type: Rhino.Geometry.Transform
[Missing <param name="xform"/> documentation for "M:Rhino.Commands.TransformCommand.TransformObjects(Rhino.Collections.TransformObjectList,Rhino.Geometry.Transform,System.Boolean,System.Boolean)"]
copy
Type: System.Boolean
[Missing <param name="copy"/> documentation for "M:Rhino.Commands.TransformCommand.TransformObjects(Rhino.Collections.TransformObjectList,Rhino.Geometry.Transform,System.Boolean,System.Boolean)"]
autoHistory
Type: System.Boolean
[Missing <param name="autoHistory"/> documentation for "M:Rhino.Commands.TransformCommand.TransformObjects(Rhino.Collections.TransformObjectList,Rhino.Geometry.Transform,System.Boolean,System.Boolean)"]
See Also
Reference
TransformCommand Class
Rhino.Commands Namespace