RhinoCommon SDK
MeshVertexColorList.Add Method
Rhino for Mac 5.1
Overload List
Name | Description
Add(Color)
 Adds a new vertex color to the end of the color list.
Add(Int32, Int32, Int32)
 Adds a new vertex color to the end of the color list.
Top
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace