RhinoCommon SDK
File3dmNotes.IsHtml Property
Rhino for Mac 5.1
 Gets or sets the text format. If the format is HTML, true; false otherwise.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsHtml { get; set; }
Public Property IsHtml As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace