RhinoCommon SDK
RhinoViewport.FrustumAspect Property
Rhino for Mac 5.1
Gets the width/height ratio of the frustum.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double FrustumAspect { get; }
Public ReadOnly Property FrustumAspect As Double
	Get
Property Value
Type: Double
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace