RhinoCommon SDK
GetPoint.TryGetBasePoint Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetPoint.TryGetBasePoint(Rhino.Geometry.Point3d@)"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetBasePoint(
	out Point3d basePoint
)
Public Function TryGetBasePoint (
	<OutAttribute> ByRef basePoint As Point3d
) As Boolean
Parameters
basePoint
Type: Rhino.Geometry.Point3d
[Missing <param name="basePoint"/> documentation for "M:Rhino.Input.Custom.GetPoint.TryGetBasePoint(Rhino.Geometry.Point3d@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetPoint.TryGetBasePoint(Rhino.Geometry.Point3d@)"]
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace