RhinoCommon SDK
Curve.Contains Method (Point3d)
Rhino for Mac 5.1
 Computes the relationship between a point and a closed curve region. This curve must be closed or the return value will be Unset. Both curve and point are projected to the World XY plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PointContainment Contains(
	Point3d testPoint
)
Public Function Contains (
	testPoint As Point3d
) As PointContainment
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to test.
Return Value
Type: PointContainment
Relationship between point and curve region.
See Also
Reference
Curve Class
Contains Overload
Rhino.Geometry Namespace