RhinoCommon SDK
BinaryArchiveWriter.WriteObjRef Method
Rhino for Mac 5.1
 Writes a ObjRef to the archive
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteObjRef(
	ObjRef objref
)
Public Sub WriteObjRef (
	objref As ObjRef
)
Parameters
objref
Type: Rhino.DocObjects.ObjRef
[Missing <param name="objref"/> documentation for "M:Rhino.FileIO.BinaryArchiveWriter.WriteObjRef(Rhino.DocObjects.ObjRef)"]
Return Value
Type:
the element that was read
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace