RhinoCommon SDK
Arc.Equals Method
Rhino for Mac 5.1
Overload List
Name | Description
Equals(Object)
 Determines whether another object is an arc and has the same value as this arc.
 (Overrides ValueType.Equals(Object).)
Equals(Arc)
 Determines whether another arc has the same value as this arc.
Top
See Also
Reference
Arc Structure
Rhino.Geometry Namespace