RhinoCommon SDK
File3dm.Materials Property
Rhino for Mac 5.1
 Materials in this file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IList<Material> Materials { get; }
Public ReadOnly Property Materials As IList(Of Material)
	Get
Property Value
Type: IList<Material>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace