RhinoCommon SDK
StringTable.GetValue Method (String, String)
Rhino for Mac 5.1
 Gets a user data string from the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string GetValue(
	string section,
	string entry
)
Public Function GetValue (
	section As String,
	entry As String
) As String
Parameters
section
Type: System.String
The section at which to get the value.
entry
Type: System.String
The entry to search for.
Return Value
Type: String
The user data.
See Also
Reference
StringTable Class
GetValue Overload
Rhino.DocObjects.Tables Namespace