RhinoCommon SDK
PointObject Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.PointObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.PointObject
 Rhino.DocObjects.Custom.CustomPointObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class PointObject : RhinoObject
Public Class PointObject
	Inherits RhinoObject
The PointObject type exposes the following members.
Properties
Name | Description
PointGeometry
Top
Methods
Name | Description
DuplicatePointGeometry
Top
See Also
Reference
Rhino.DocObjects Namespace