RhinoCommon SDK
Brep.CreateFromBox Method (Box)
Rhino for Mac 5.1
 Constructs new brep that matches an aligned box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep CreateFromBox(
	Box box
)
Public Shared Function CreateFromBox (
	box As Box
) As Brep
Parameters
box
Type: Rhino.Geometry.Box
Box to match.
Return Value
Type: Brep
A Brep with 6 faces that is similar to the Box.
See Also
Reference
Brep Class
CreateFromBox Overload
Rhino.Geometry Namespace