RhinoCommon SDK
GetBaseClass.Color Method
Rhino for Mac 5.1
Gets a color if Get*() returns GetResult.Color.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color Color()
Public Function Color As Color
Return Value
Type: Color
The color chosen by the user.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace