RhinoCommon SDK
CurveList.Add Method (Arc)
Rhino for Mac 5.1
 Adds an arc to this list.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Add(
	Arc arc
)
Public Sub Add (
	arc As Arc
)
Parameters
arc
Type: Rhino.Geometry.Arc
An arc value that will be the model of the new internal curve.
See Also
Reference
CurveList Class
Add Overload
Rhino.Collections Namespace