RhinoCommon SDK
GetInteger Constructor
Rhino for Mac 5.1
Initializes a new instance of the GetInteger class
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GetInteger()
Public Sub New
See Also
Reference
GetInteger Class
Rhino.Input.Custom Namespace