RhinoCommon SDK
GetTransform.AddTransformObjects Method
Rhino for Mac 5.1
 Adds any objects you want transformed and grips you want transformed. Make sure no duplicates are in the list and that no grip ownwers are passed in as objects.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddTransformObjects(
	TransformObjectList list
)
Public Sub AddTransformObjects (
	list As TransformObjectList
)
Parameters
list
Type: Rhino.Collections.TransformObjectList
A custom transform object list.
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace