RhinoCommon SDK
BinaryArchiveReader.BeginRead3dmChunk Method (UInt32, Int64)
Rhino for Mac 5.1
 Begins reading a chunk that must be in the archive at this location.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool BeginRead3dmChunk(
	out uint typeCode,
	out long value
)
Public Function BeginRead3dmChunk (
	<OutAttribute> ByRef typeCode As UInteger,
	<OutAttribute> ByRef value As Long
) As Boolean
Parameters
typeCode
Type: System.UInt32
[Missing <param name="typeCode"/> documentation for "M:Rhino.FileIO.BinaryArchiveReader.BeginRead3dmChunk(System.UInt32@,System.Int64@)"]
value
Type: System.Int64
[Missing <param name="value"/> documentation for "M:Rhino.FileIO.BinaryArchiveReader.BeginRead3dmChunk(System.UInt32@,System.Int64@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveReader.BeginRead3dmChunk(System.UInt32@,System.Int64@)"]
See Also
Reference
BinaryArchiveReader Class
BeginRead3dmChunk Overload
Rhino.FileIO Namespace