RhinoCommon SDK
Matrix.Invert Method
Rhino for Mac 5.1
 Modifies this matrix to become its own inverse.
Matrix might be non-invertible (singular) and the return value will be false.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Invert(
	double zeroTolerance
)
Public Function Invert (
	zeroTolerance As Double
) As Boolean
Parameters
zeroTolerance
Type: System.Double
The admitted tolerance for 0.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
See Also
Reference
Matrix Class
Rhino.Geometry Namespace