RhinoCommon SDK
ColorLCH.C Property
Rhino for Mac 5.1
 Gets or sets the Chroma channel. Chroma is defined from -1.0 to +1.0.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double C { get; set; }
Public Property C As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace