RhinoCommon SDK
LayerTable.AddReferenceLayer Method (Layer)
Rhino for Mac 5.1
 Adds a new reference layer with specified definition to the layer table Reference layers are not saved in files.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddReferenceLayer(
	Layer layer
)
Public Function AddReferenceLayer (
	layer As Layer
) As Integer
Parameters
layer
Type: Rhino.DocObjects.Layer
 definition of new layer. The information in layer is copied. If layer.Name is empty the a unique name of the form "Layer 01" will be automatically created.
Return Value
Type: Int32
 >=0 index of new layer -1 layer not added because a layer with that name already exists.
See Also
Reference
LayerTable Class
AddReferenceLayer Overload
Rhino.DocObjects.Tables Namespace