RhinoCommon SDK
Surface.CreateRollingBallFillet Method (Surface, Point2d, Surface, Point2d, Double, Double)
Rhino for Mac 5.1
 Constructs a rolling ball fillet between two surfaces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Surface[] CreateRollingBallFillet(
	Surface surfaceA,
	Point2d uvA,
	Surface surfaceB,
	Point2d uvB,
	double radius,
	double tolerance
)
Public Shared Function CreateRollingBallFillet (
	surfaceA As Surface,
	uvA As Point2d,
	surfaceB As Surface,
	uvB As Point2d,
	radius As Double,
	tolerance As Double
) As Surface()
Parameters
surfaceA
Type: Rhino.Geometry.Surface
A first surface.
uvA
Type: Rhino.Geometry.Point2d
A point in the parameter space of FaceA near where the fillet is expected to hit the surface.
surfaceB
Type: Rhino.Geometry.Surface
A second surface.
uvB
Type: Rhino.Geometry.Point2d
A point in the parameter space of FaceB near where the fillet is expected to hit the surface.
radius
Type: System.Double
A radius value.
tolerance
Type: System.Double
A tolerance value used for approximating and intersecting offset surfaces.
Return Value
Type: Surface[]
A new array of rolling ball fillet surfaces; this array can be empty on failure.
Exceptions
Exception | Condition
ArgumentNullException | If surfaceA or surfaceB are null.
See Also
Reference
Surface Class
CreateRollingBallFillet Overload
Rhino.Geometry Namespace