RhinoCommon SDK
BezierCurve.CreateCubicBeziers Method
Rhino for Mac 5.1
 Constructs an array of cubic, non-rational beziers that fit a curve to a tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static BezierCurve[] CreateCubicBeziers(
	Curve sourceCurve,
	double distanceTolerance,
	double kinkTolerance
)
Public Shared Function CreateCubicBeziers (
	sourceCurve As Curve,
	distanceTolerance As Double,
	kinkTolerance As Double
) As BezierCurve()
Parameters
sourceCurve
Type: Rhino.Geometry.Curve
A curve to approximate.
distanceTolerance
Type: System.Double
 The max fitting error. Use RhinoMath.SqrtEpsilon as a minimum.
kinkTolerance
Type: System.Double
 If the input curve has a g1-discontinuity with angle radian measure greater than kinkTolerance at some point P, the list of beziers will also have a kink at P.
Return Value
Type: BezierCurve[]
A new array of bezier curves. The array can be empty and might contain null items.
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace