RhinoCommon SDK
ObjectTable.AddBrep Method (Brep, ObjectAttributes, HistoryRecord, Boolean, Boolean)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean,System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddBrep(
	Brep brep,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference,
	bool splitKinkySurfaces
)
Public Function AddBrep (
	brep As Brep,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean,
	splitKinkySurfaces As Boolean
) As Guid
Parameters
brep
Type: Rhino.Geometry.Brep
[Missing <param name="brep"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean,System.Boolean)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean,System.Boolean)"]
history
Type: Rhino.DocObjects.HistoryRecord
[Missing <param name="history"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean,System.Boolean)"]
reference
Type: System.Boolean
[Missing <param name="reference"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean,System.Boolean)"]
splitKinkySurfaces
Type: System.Boolean
[Missing <param name="splitKinkySurfaces"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean,System.Boolean)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean,System.Boolean)"]
See Also
Reference
ObjectTable Class
AddBrep Overload
Rhino.DocObjects.Tables Namespace