RhinoCommon SDK
ObjectTable.AddBrep Method (Brep, ObjectAttributes)
Rhino for Mac 5.1
Adds a brep object to Rhino.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddBrep(
	Brep brep,
	ObjectAttributes attributes
)
Public Function AddBrep (
	brep As Brep,
	attributes As ObjectAttributes
) As Guid
Parameters
brep
Type: Rhino.Geometry.Brep
A duplicate of this brep is added to Rhino.
attributes
Type: Rhino.DocObjects.ObjectAttributes
attributes to apply to brep.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddBrep Overload
Rhino.DocObjects.Tables Namespace