RhinoCommon SDK
Rectangle3d.RecenterPlane Method (Int32)
Rhino for Mac 5.1
 Recenters the base plane on one of the corners.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void RecenterPlane(
	int index
)
Public Sub RecenterPlane (
	index As Integer
)
Parameters
index
Type: System.Int32
 Index of corner, valid values are:
0 = lower left (min-x, min-y)
1 = lower right (max-x, min-y)
2 = upper right (max-x, max-y)
3 = upper left (min-x, max-y)
See Also
Reference
Rectangle3d Structure
RecenterPlane Overload
Rhino.Geometry Namespace