RhinoCommon SDK
Plane.PointAt Method
Rhino for Mac 5.1
Overload List
Name | Description
PointAt(Double, Double)
 Evaluate a point on the plane.
PointAt(Double, Double, Double)
 Evaluate a point on the plane.
Top
See Also
Reference
Plane Structure
Rhino.Geometry Namespace