RhinoCommon SDK
Unroller.AddFollowingGeometry Method (IEnumerable<Curve>)
Rhino for Mac 5.1
 Adds curves that should be unrolled along with the surface/brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddFollowingGeometry(
	IEnumerable<Curve> curves
)
Public Sub AddFollowingGeometry (
	curves As IEnumerable(Of Curve)
)
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
An array, a list or any enumerable set of curves.
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace