RhinoCommon SDK
RhinoObject.IsReference Property
Rhino for Mac 5.1
 Gets a value indicating if an object is a reference object. An object from a work session reference model is a reference object and cannot be modified. An object is a reference object if, and only if, it is on a reference layer.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsReference { get; }
Public ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace