RhinoCommon SDK
Interval.Equals Method (Object)
Rhino for Mac 5.1
 Determines whether the specified Object is equal to the current Interval, comparing by value.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
The other object to compare with.
Return Value
Type: Boolean
true if obj is an Interval and has the same bounds; false otherwise.
See Also
Reference
Interval Structure
Equals Overload
Rhino.Geometry Namespace