RhinoCommon SDK
AnnotationBase Class
Rhino for Mac 5.1
 Provides a common base class to all annotation geometry.
This class refers to the geometric element that is independent from the document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 More...
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class AnnotationBase : GeometryBase
<SerializableAttribute>
Public Class AnnotationBase
	Inherits GeometryBase
The AnnotationBase type exposes the following members.
Constructors
Name | Description
AnnotationBase()
 Protected constructor for internal use.
AnnotationBase(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
Index
 Index of DimensionStyle in document DimStyle table used by the dimension.
NumericValue
 Gets the numeric value, depending on geometry type.
LinearDimension: distance between arrow tips
RadialDimension: radius or diamater depending on type
AngularDimension: angle in degrees
Leader or Text: UnsetValue
Plane
 Gets or sets the plane containing the annotation.
Text
 Gets or sets the text for this annotation.
TextFormula
 Gets or sets a formula for this annotation.
TextHeight
 Gets or sets the text height in model units.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.AngularDimension
 Rhino.Geometry.Leader
 Rhino.Geometry.LinearDimension
 Rhino.Geometry.OrdinateDimension
 Rhino.Geometry.RadialDimension
 Rhino.Geometry.TextEntity