RhinoCommon SDK
BinaryArchiveReader.ReadRay3d Method
Rhino for Mac 5.1
 Reads a Ray3d from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Ray3d ReadRay3d()
Public Function ReadRay3d As Ray3d
Return Value
Type: Ray3d
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace