RhinoCommon SDK
DisplayPipeline.DisplayPipelineAttributes Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.DisplayPipelineAttributes"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DisplayPipelineAttributes DisplayPipelineAttributes { get; }
Public ReadOnly Property DisplayPipelineAttributes As DisplayPipelineAttributes
	Get
Property Value
Type: DisplayPipelineAttributes
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace