RhinoCommon SDK
GetPoint.EnableDrawLineFromPoint Method
Rhino for Mac 5.1
 Controls drawing of dynamic a line from the start point.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableDrawLineFromPoint(
	bool enable
)
Public Sub EnableDrawLineFromPoint (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
 if true, a dynamic line is drawn from the DrawLineFromPoint startPoint to the point being picked.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace