RhinoCommon SDK
RhinoGet.GetAngle Method
Rhino for Mac 5.1
 Allows user to interactively pick an angle
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetAngle(
	string commandPrompt,
	Point3d basePoint,
	Point3d referencePoint,
	double defaultAngleRadians,
	out double angleRadians
)
Public Shared Function GetAngle (
	commandPrompt As String,
	basePoint As Point3d,
	referencePoint As Point3d,
	defaultAngleRadians As Double,
	<OutAttribute> ByRef angleRadians As Double
) As Result
Parameters
commandPrompt
Type: System.String
if null, a default prompt will be displayed
basePoint
Type: Rhino.Geometry.Point3d
[Missing <param name="basePoint"/> documentation for "M:Rhino.Input.RhinoGet.GetAngle(System.String,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double@)"]
referencePoint
Type: Rhino.Geometry.Point3d
[Missing <param name="referencePoint"/> documentation for "M:Rhino.Input.RhinoGet.GetAngle(System.String,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double@)"]
defaultAngleRadians
Type: System.Double
[Missing <param name="defaultAngleRadians"/> documentation for "M:Rhino.Input.RhinoGet.GetAngle(System.String,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double@)"]
angleRadians
Type: System.Double
[Missing <param name="angleRadians"/> documentation for "M:Rhino.Input.RhinoGet.GetAngle(System.String,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetAngle(System.String,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double@)"]
See Also
Reference
RhinoGet Class
Rhino.Input Namespace