RhinoCommon SDK
RhinoViewport.PreviousViewProjection Method
Rhino for Mac 5.1
 Sets the view projection and target to the settings that were active before the last call to NextViewProjection.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PreviousViewProjection()
Public Function PreviousViewProjection As Boolean
Return Value
Type: Boolean
true if the view stack was popped.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace