RhinoCommon SDK
ObjRef.Mesh Method
Rhino for Mac 5.1
 Gets the mesh if the referenced geometry is one.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Mesh Mesh()
Public Function Mesh As Mesh
Return Value
Type: Mesh
A mesh; or null if the referenced object is not a mesh, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace