RhinoCommon SDK
PickContext.PickStyle Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.PickContext.PickStyle"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PickStyle PickStyle { get; set; }
Public Property PickStyle As PickStyle
	Get
	Set
Property Value
Type: PickStyle
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace