RhinoCommon SDK
Curve.IsInPlane Method (Plane)
Rhino for Mac 5.1
Test a curve to see if it lies in a specific plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsInPlane(
	Plane testPlane
)
Public Function IsInPlane (
	testPlane As Plane
) As Boolean
Parameters
testPlane
Type: Rhino.Geometry.Plane
Plane to test for.
Return Value
Type: Boolean
 true if the maximum distance from the curve to the testPlane is <= RhinoMath.ZeroTolerance.
See Also
Reference
Curve Class
IsInPlane Overload
Rhino.Geometry Namespace