RhinoCommon SDK
CustomDisplay.AddPoints Method (IEnumerable<Point3d>)
Rhino for Mac 5.1
 Adds a collection of black points to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddPoints(
	IEnumerable<Point3d> points
)
Public Sub AddPoints (
	points As IEnumerable(Of Point3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to add.
See Also
Reference
CustomDisplay Class
AddPoints Overload
Rhino.Display Namespace