RhinoCommon SDK
DisplayPipeline.DrawBoxCorners Method (BoundingBox, Color)
Rhino for Mac 5.1
 Draws corner widgets of a world aligned boundingbox. Widget size will be 5% of the Box diagonal.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawBoxCorners(
	BoundingBox box,
	Color color
)
Public Sub DrawBoxCorners (
	box As BoundingBox,
	color As Color
)
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to draw.
color
Type: System.Drawing.Color
Color to draw with.
See Also
Reference
DisplayPipeline Class
DrawBoxCorners Overload
Rhino.Display Namespace