RhinoCommon SDK
File3dmObjectTable.AddPointCloud Method (PointCloud)
Rhino for Mac 5.1
Adds a point cloud object to the document.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddPointCloud(
	PointCloud cloud
)
Public Function AddPointCloud (
	cloud As PointCloud
) As Guid
Parameters
cloud
Type: Rhino.Geometry.PointCloud
PointCloud to add.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddPointCloud Overload
Rhino.FileIO Namespace