RhinoCommon SDK
PointObject Properties
Rhino for Mac 5.1
The PointObject type exposes the following members.
Properties
Name | Description
PointGeometry
Top
See Also
Reference
PointObject Class
Rhino.DocObjects Namespace