RhinoCommon SDK
Quaternion.Product Method
Rhino for Mac 5.1
 The quaternion product of p and q. This is the same value as p*q.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Quaternion Product(
	Quaternion p,
	Quaternion q
)
Public Shared Function Product (
	p As Quaternion,
	q As Quaternion
) As Quaternion
Parameters
p
Type: Rhino.Geometry.Quaternion
The first trasform.
q
Type: Rhino.Geometry.Quaternion
The second trasform.
Return Value
Type: Quaternion
A transform value.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace