RhinoCommon SDK
Vector3f.Z Property
Rhino for Mac 5.1
 Gets or sets the Z (third) component of this vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public float Z { get; set; }
Public Property Z As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace