RhinoCommon SDK
ObjectAttributes.ComputedPlotColor Method
Rhino for Mac 5.1
Overload List
Name | Description
ComputedPlotColor(RhinoDoc)
ComputedPlotColor(RhinoDoc, Guid)
Top
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace