RhinoCommon SDK
VolumeMassProperties.Centroid Property
Rhino for Mac 5.1
 Gets the volume centroid in the world coordinate system.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d Centroid { get; }
Public ReadOnly Property Centroid As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace