RhinoCommon SDK
VisualAnalysisMode.RhinoCurvatureGraphAnalysisModeId Property
Rhino for Mac 5.1
 Id for Rhino's built-in curvature graphs analysis mode. Curvature hair is shown on curves and surfaces.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid RhinoCurvatureGraphAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoCurvatureGraphAnalysisModeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace