RhinoCommon SDK
MaterialRefs.Values Property
Rhino for Mac 5.1
 Gets an ICollection containing the MaterialRef objects in this dictionary.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ICollection<MaterialRef> Values { get; }
Public ReadOnly Property Values As ICollection(Of MaterialRef)
	Get
Property Value
Type: ICollection<MaterialRef>
Implements
IDictionary<TKey, TValue>.Values
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace