RhinoCommon SDK
CurveProxy Constructor
Rhino for Mac 5.1
 Protected constructor for internal use.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected CurveProxy()
Protected Sub New
See Also
Reference
CurveProxy Class
Rhino.Geometry Namespace