RhinoCommon SDK
Vector3f.Multiply Method
Rhino for Mac 5.1
Overload List
Name | Description
Multiply(Single, Vector3f)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector3f, Vector3f)
 Multiplies two vectors together, returning the dot product (or inner product). This differs from the cross product.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector3f, Single)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Top
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace