RhinoCommon SDK
MeshTopologyEdgeList.SplitEdge Method (Int32, Point3d)
Rhino for Mac 5.1
 Divides a mesh edge to create two or more triangles
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SplitEdge(
	int topologyEdgeIndex,
	Point3d point
)
Public Function SplitEdge (
	topologyEdgeIndex As Integer,
	point As Point3d
) As Boolean
Parameters
topologyEdgeIndex
Type: System.Int32
Edge to divide
point
Type: Rhino.Geometry.Point3d
 Location to perform the split
Return Value
Type: Boolean
true if successful
See Also
Reference
MeshTopologyEdgeList Class
SplitEdge Overload
Rhino.Geometry.Collections Namespace