RhinoCommon SDK
Texture.WrapU Property
Rhino for Mac 5.1
 Texture wrapping mode in the U direction
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TextureUvwWrapping WrapU { get; set; }
Public Property WrapU As TextureUvwWrapping
	Get
	Set
Property Value
Type: TextureUvwWrapping
See Also
Reference
Texture Class
Rhino.DocObjects Namespace