RhinoCommon SDK
Cone.Unset Property
Rhino for Mac 5.1
 Gets an invalid Cone.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Cone Unset { get; }
Public Shared ReadOnly Property Unset As Cone
	Get
Property Value
Type: Cone
See Also
Reference
Cone Structure
Rhino.Geometry Namespace