RhinoCommon SDK
MappingTag Constructor
Rhino for Mac 5.1
Initializes a new instance of the MappingTag class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MappingTag()
Public Sub New
See Also
Reference
MappingTag Class
Rhino.Render Namespace