RhinoCommon SDK
ObjRef.Trim Method
Rhino for Mac 5.1
 If the referenced geometry is an edge of a surface, this returns the associated brep trim.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepTrim Trim()
Public Function Trim As BrepTrim
Return Value
Type: BrepTrim
A boundary representation trim; or null on error
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace