RhinoCommon SDK
UndoRedoEventArgs.IsEndUndo Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsEndUndo"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsEndUndo { get; }
Public ReadOnly Property IsEndUndo As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace