RhinoCommon SDK
DisplayPipeline.DrawMeshWires Method (Mesh, Color, Int32)
Rhino for Mac 5.1
 Draws all the wires in a given mesh.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawMeshWires(
	Mesh mesh,
	Color color,
	int thickness
)
Public Sub DrawMeshWires (
	mesh As Mesh,
	color As Color,
	thickness As Integer
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh for wire drawing.
color
Type: System.Drawing.Color
Color of mesh wires.
thickness
Type: System.Int32
Thickness (in pixels) of mesh wires.
See Also
Reference
DisplayPipeline Class
DrawMeshWires Overload
Rhino.Display Namespace