RhinoCommon SDK
ObjectTable.AddRhinoObject Method (CustomMeshObject)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomMeshObject)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddRhinoObject(
	CustomMeshObject meshObject
)
Public Sub AddRhinoObject (
	meshObject As CustomMeshObject
)
Parameters
meshObject
Type: Rhino.DocObjects.Custom.CustomMeshObject
[Missing <param name="meshObject"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomMeshObject)"]
See Also
Reference
ObjectTable Class
AddRhinoObject Overload
Rhino.DocObjects.Tables Namespace