RhinoCommon SDK
Curve.PointAtStart Property
Rhino for Mac 5.1
 Evaluates point at the start of the curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAtStart { get; }
Public ReadOnly Property PointAtStart As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Curve Class
Rhino.Geometry Namespace