RhinoCommon SDK
Transform.Transpose Method
Rhino for Mac 5.1
 Flip row/column values
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform Transpose()
Public Function Transpose As Transform
Return Value
Type: Transform
[Missing <returns> documentation for "M:Rhino.Geometry.Transform.Transpose"]
See Also
Reference
Transform Structure
Rhino.Geometry Namespace