RhinoCommon SDK
MaterialTableEventArgs.EventType Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.MaterialTableEventArgs.EventType"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MaterialTableEventType EventType { get; }
Public ReadOnly Property EventType As MaterialTableEventType
	Get
Property Value
Type: MaterialTableEventType
See Also
Reference
MaterialTableEventArgs Class
Rhino.DocObjects.Tables Namespace