RhinoCommon SDK
DisplayPipelineAttributes.ViewDisplayAttributes.WorldAxisColorX Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes.WorldAxisColorX"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color WorldAxisColorX { get; set; }
Public Property WorldAxisColorX As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace