RhinoCommon SDK
MouseCallbackEventArgs.View Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.View"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoView View { get; }
Public ReadOnly Property View As RhinoView
	Get
Property Value
Type: RhinoView
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace