RhinoCommon SDK
Extrusion Constructor (SerializationInfo, StreamingContext)
Rhino for Mac 5.1
 Protected serialization constructor.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected Extrusion(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
The serialization data.
context
Type: System.Runtime.Serialization.StreamingContext
The serialization context stream.
See Also
Reference
Extrusion Class
Extrusion Overload
Rhino.Geometry Namespace