RhinoCommon SDK
Localization Properties
Rhino for Mac 5.1
The Localization type exposes the following members.
Properties
Name | Description
CurrentLanguageId
RunningAsEnglish
Top
See Also
Reference
Localization Class
Rhino.UI Namespace