RhinoCommon SDK
PickContext.PickGroupsEnabled Property
Rhino for Mac 5.1
 Thue if GroupObjects should be added to the pick list
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PickGroupsEnabled { get; set; }
Public Property PickGroupsEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace