RhinoCommon SDK
MostRecentCommandDescription Class
Rhino for Mac 5.1
 Stores the macro and display string of the most recent command.
Inheritance Hierarchy
System.Object
 Rhino.Commands.MostRecentCommandDescription
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MostRecentCommandDescription
Public Class MostRecentCommandDescription
The MostRecentCommandDescription type exposes the following members.
Constructors
Name | Description
MostRecentCommandDescription
Initializes a new instance of the MostRecentCommandDescription class
Top
Properties
Name | Description
DisplayString
Macro
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Commands Namespace