RhinoCommon SDK
Curve.IsCircle Method
Rhino for Mac 5.1
Overload List
Name | Description
IsCircle()
 Test a curve to see if it can be represented by a circle within RhinoMath.ZeroTolerance.
IsCircle(Double)
 Test a curve to see if it can be represented by a circle within the given tolerance.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace