RhinoCommon SDK
Hatch.PatternScale Property
Rhino for Mac 5.1
 Gets or sets the scaling factor of the pattern.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double PatternScale { get; set; }
Public Property PatternScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Hatch Class
Rhino.Geometry Namespace