RhinoCommon SDK
MeshFaceList.IsHidden Method
Rhino for Mac 5.1
 Gets a value indicating whether a face is hidden.
A face is hidden if, and only if, at least one of its vertices is hidden.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsHidden(
	int faceIndex
)
Public Function IsHidden (
	faceIndex As Integer
) As Boolean
Parameters
faceIndex
Type: System.Int32
A face index.
Return Value
Type: Boolean
true if hidden, false if fully visible.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace