RhinoCommon SDK
ObjectAttributes.MaterialIndex Property
Rhino for Mac 5.1
 Gets or sets the material index.
If you want something simple and fast, set the index of the rendering material.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int MaterialIndex { get; set; }
Public Property MaterialIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace