RhinoCommon SDK
Cone.Height Property
Rhino for Mac 5.1
 Gets or sets the height of the circular right cone.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Cone Structure
Rhino.Geometry Namespace