RhinoCommon SDK
ColorXYZ.CreateFromLAB Method
Rhino for Mac 5.1
 Create the nearest XYZ equivalent of a Lab color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorXYZ CreateFromLAB(
	ColorLAB lab
)
Public Shared Function CreateFromLAB (
	lab As ColorLAB
) As ColorXYZ
Parameters
lab
Type: Rhino.Display.ColorLAB
Target color in LAB space.
Return Value
Type: ColorXYZ
The XYZ equivalent of the LAB color.
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace