RhinoCommon SDK
Curve.CreateControlPointCurve Method (IEnumerable<Point3d>, Int32)
Rhino for Mac 5.1
 Constructs a curve from a set of control-point locations.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve CreateControlPointCurve(
	IEnumerable<Point3d> points,
	int degree
)
Public Shared Function CreateControlPointCurve (
	points As IEnumerable(Of Point3d),
	degree As Integer
) As Curve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Control points.
degree
Type: System.Int32
Degree of curve. The number of control points must be at least degree+1.
Return Value
Type: Curve
[Missing <returns> documentation for "M:Rhino.Geometry.Curve.CreateControlPointCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)"]
See Also
Reference
Curve Class
CreateControlPointCurve Overload
Rhino.Geometry Namespace