RhinoCommon SDK
MeshPart.TriangleCount Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Geometry.MeshPart.TriangleCount"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int TriangleCount { get; }
Public ReadOnly Property TriangleCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace