RhinoCommon SDK
Point3d Explicit Conversion Operators
Rhino for Mac 5.1
Overload List
Name | Description
Explicit(Point3d to Vector3d)
 Converts a point in a vector, needing casting.
Explicit(Vector3d to Point3d)
 Converts a vector in a point, needing casting.
Top
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace