RhinoCommon SDK
GumballFrame Properties
Rhino for Mac 5.1
The GumballFrame type exposes the following members.
Properties
Name | Description
Plane
ScaleGripDistance
ScaleMode
Top
See Also
Reference
GumballFrame Structure
Rhino.UI.Gumball Namespace