RhinoCommon SDK
HistoryRecord.SetVector3d Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetVector3d(System.Int32,Rhino.Geometry.Vector3d)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetVector3d(
	int id,
	Vector3d value
)
Public Function SetVector3d (
	id As Integer,
	value As Vector3d
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetVector3d(System.Int32,Rhino.Geometry.Vector3d)"]
value
Type: Rhino.Geometry.Vector3d
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetVector3d(System.Int32,Rhino.Geometry.Vector3d)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetVector3d(System.Int32,Rhino.Geometry.Vector3d)"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace