RhinoCommon SDK
BrepLoop.To2dCurve Method
Rhino for Mac 5.1
 Create a 2d curve that traces the entire loop
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve To2dCurve()
Public Function To2dCurve As Curve
Return Value
Type: Curve
[Missing <returns> documentation for "M:Rhino.Geometry.BrepLoop.To2dCurve"]
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace