RhinoCommon SDK
BrepLoop.To3dCurve Method
Rhino for Mac 5.1
 Create a 3D curve that approximates the loop geometry.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve To3dCurve()
Public Function To3dCurve As Curve
Return Value
Type: Curve
A 3D curve that approximates the loop or null on failure.
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace