RhinoCommon SDK
GetBaseClass.EnableTransparentCommands Method
Rhino for Mac 5.1
 Control the availability of transparent commands during the get.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableTransparentCommands(
	bool enable
)
Public Sub EnableTransparentCommands (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
 If true, then transparent commands can be run during the get. If false, then transparent commands cannot be run during the get.
Remarks
 Some Rhino commands are "transparent" and can be run inside of other commands. Examples of transparent commands include the view manipulation commands like ZoomExtents, Top, etc., and the selection commands like SelAll, SelPoint, etc. By default transparent commands can be run during any get. If you want to disable this feature, then call EnableTransparentCommands(false) before calling GetString, GetPoint, GetObject, etc.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace