RhinoCommon SDK
RhinoViewport.SetWallpaper Method (String, Boolean)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.SetWallpaper(System.String,System.Boolean)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetWallpaper(
	string imageFilename,
	bool grayscale
)
Public Function SetWallpaper (
	imageFilename As String,
	grayscale As Boolean
) As Boolean
Parameters
imageFilename
Type: System.String
[Missing <param name="imageFilename"/> documentation for "M:Rhino.Display.RhinoViewport.SetWallpaper(System.String,System.Boolean)"]
grayscale
Type: System.Boolean
[Missing <param name="grayscale"/> documentation for "M:Rhino.Display.RhinoViewport.SetWallpaper(System.String,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.SetWallpaper(System.String,System.Boolean)"]
See Also
Reference
RhinoViewport Class
SetWallpaper Overload
Rhino.Display Namespace