RhinoCommon SDK
DisplayPipeline.DrawArrow Method
Rhino for Mac 5.1
Overload List
Name | Description
DrawArrow(Line, Color)
 Draws a single arrow object. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
DrawArrow(Line, Color, Double, Double)
 Draws a single arrow object. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace