RhinoCommon SDK
ConstructionPlane.GridSpacing Property
Rhino for Mac 5.1
 Gets or sets the distance between grid lines.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double GridSpacing { get; set; }
Public Property GridSpacing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace