RhinoCommon SDK
Quaternion.Scalar Property
Rhino for Mac 5.1
 The real (scalar) part of the quaternion
This is A.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Scalar { get; }
Public ReadOnly Property Scalar As Double
	Get
Property Value
Type: Double
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace