RhinoCommon SDK
Light.CoordinateSystem Property
Rhino for Mac 5.1
 Gets a value, determined by LightStyle, that explains whether the camera diretions are relative to World or Camera spaces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public CoordinateSystem CoordinateSystem { get; }
Public ReadOnly Property CoordinateSystem As CoordinateSystem
	Get
Property Value
Type: CoordinateSystem
See Also
Reference
Light Class
Rhino.Geometry Namespace