RhinoCommon SDK
MeshFaceList.GetFaceBoundingBox Method
Rhino for Mac 5.1
 Gets the bounding box of a face.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox GetFaceBoundingBox(
	int faceIndex
)
Public Function GetFaceBoundingBox (
	faceIndex As Integer
) As BoundingBox
Parameters
faceIndex
Type: System.Int32
A face index.
Return Value
Type: BoundingBox
A new bounding box, or Empty on error.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace