RhinoCommon SDK
OptionInteger Properties
Rhino for Mac 5.1
The OptionInteger type exposes the following members.
Properties
Name | Description
CurrentValue
InitialValue
Top
See Also
Reference
OptionInteger Class
Rhino.Input.Custom Namespace