RhinoCommon SDK
ColorXYZ Methods
Rhino for Mac 5.1
The ColorXYZ type exposes the following members.
Methods
Name | Description
CreateFromCMYK
 Create the nearest XYZ equivalent of a CMYK color.
CreateFromHSL
 Create the nearest XYZ equivalent of an HSL color.
CreateFromLAB
 Create the nearest XYZ equivalent of a Lab color.
CreateFromLCH
 Create the nearest XYZ equivalent of an LCH color.
Top
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace