RhinoCommon SDK
GetObject.ChooseOneQuestion Property
Rhino for Mac 5.1
 By default, if a call to Input is permitted to select different parts of the same object, like a polysurface and an edge of that polysurface, then the top-most object is automatically selected. If you want the choose-one-object mechanism to include pop up in these cases, then call EnableChooseOneQuestion = true before calling GetObjects().
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ChooseOneQuestion { get; set; }
Public Property ChooseOneQuestion As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace