RhinoCommon SDK
VisualAnalysisMode.ObjectSupportsAnalysisMode Method
Rhino for Mac 5.1
 Gets a value indicating if this visual analysis mode can be used on a given Rhino object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual bool ObjectSupportsAnalysisMode(
	RhinoObject obj
)
Public Overridable Function ObjectSupportsAnalysisMode (
	obj As RhinoObject
) As Boolean
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
The object to be tested.
Return Value
Type: Boolean
true if this mode can indeed be used on the object; otherwise false.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace