RhinoCommon SDK
CustomDisplay.AddLine Method (Line, Color, Int32)
Rhino for Mac 5.1
 Adds a new, colored line to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddLine(
	Line line,
	Color color,
	int thickness
)
Public Sub AddLine (
	line As Line,
	color As Color,
	thickness As Integer
)
Parameters
line
Type: Rhino.Geometry.Line
Line to add.
color
Type: System.Drawing.Color
Color of line.
thickness
Type: System.Int32
Thickness of line.
See Also
Reference
CustomDisplay Class
AddLine Overload
Rhino.Display Namespace