RhinoCommon SDK
File3dmNotes Constructor
Rhino for Mac 5.1
 Creates empty default notes
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public File3dmNotes()
Public Sub New
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace