RhinoCommon SDK
Curve.PointAtEnd Property
Rhino for Mac 5.1
 Evaluates point at the end of the curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAtEnd { get; }
Public ReadOnly Property PointAtEnd As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Curve Class
Rhino.Geometry Namespace