RhinoCommon SDK
Interval.Equals Method
Rhino for Mac 5.1
Overload List
Name | Description
Equals(Object)
 Determines whether the specified Object is equal to the current Interval, comparing by value.
 (Overrides ValueType.Equals(Object).)
Equals(Interval)
 Determines whether the specified Interval is equal to the current Interval, comparing by value.
Top
See Also
Reference
Interval Structure
Rhino.Geometry Namespace