RhinoCommon SDK
StackedDialogPage.HasChildren Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.StackedDialogPage.HasChildren"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool HasChildren { get; }
Public ReadOnly Property HasChildren As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace