RhinoCommon SDK
ColorCMYK Implicit Conversion (ColorCMYK to Color)
Rhino for Mac 5.1
 Implicitly converts a CMYK color into a .Net library color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static implicit operator Color (
	ColorCMYK cmyk
)
Public Shared Widening Operator CType (
	cmyk As ColorCMYK
) As Color
Parameters
cmyk
Type: Rhino.Display.ColorCMYK
A CMYK color.
Return Value
Type: Color
A ARGB .Net library color.
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace