RhinoCommon SDK
Interval.IncludesInterval Method
Rhino for Mac 5.1
Overload List
Name | Description
IncludesInterval(Interval)
 Tests another interval for Interval inclusion.
IncludesInterval(Interval, Boolean)
 Tests another interval for Interval inclusion.
Top
See Also
Reference
Interval Structure
Rhino.Geometry Namespace