RhinoCommon SDK
BrepCurveList.GetEnumerator Method
Rhino for Mac 5.1
Get an enumerator that visits all curves.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<Curve> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Curve)
Return Value
Type: IEnumerator<Curve>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
BrepCurveList Class
Rhino.Geometry.Collections Namespace