RhinoCommon SDK
NurbsCurve.IsDuplicate Method
Rhino for Mac 5.1
 Determines if two curves are similar.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool IsDuplicate(
	NurbsCurve curveA,
	NurbsCurve curveB,
	bool ignoreParameterization,
	double tolerance
)
Public Shared Function IsDuplicate (
	curveA As NurbsCurve,
	curveB As NurbsCurve,
	ignoreParameterization As Boolean,
	tolerance As Double
) As Boolean
Parameters
curveA
Type: Rhino.Geometry.NurbsCurve
First curve used in comparison.
curveB
Type: Rhino.Geometry.NurbsCurve
Second curve used in comparison.
ignoreParameterization
Type: System.Boolean
if true, parameterization and orientaion are ignored.
tolerance
Type: System.Double
tolerance to use when comparing control points.
Return Value
Type: Boolean
true if curves are similar within tolerance.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace