RhinoCommon SDK
RenderSettings.BackgroundColorTop Property
Rhino for Mac 5.1
 Gets or sets the background top color used in rendering.
Sets also the background color if a solid background color is set.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color BackgroundColorTop { get; set; }
Public Property BackgroundColorTop As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
RenderSettings Class
Rhino.Render Namespace