RhinoCommon SDK
PolyCurve Class
Rhino for Mac 5.1
 Represents a curve that is the result of joining several (possibly different) types of curves.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Curve
 Rhino.Geometry.PolyCurve
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class PolyCurve : Curve
<SerializableAttribute>
Public Class PolyCurve
	Inherits Curve
The PolyCurve type exposes the following members.
Constructors
Name | Description
PolyCurve()
 Initializes a new, empty polycurve.
PolyCurve(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
HasGap
 This is a quick way to see if the curve has gaps between the sub curve segments.
IsNested
 Gets a value indicating whether or not a PolyCurve contains nested PolyCurves.
SegmentCount
 Gets the number of segments that make up this Polycurve.
Top
Methods
Name | Description
Append(Arc)
 Appends and matches the start of the arc to the end of polycurve. This function will fail if the polycurve is closed or if SegmentCount > 0 and the arc is closed.
Append(Curve)
 Appends and matches the start of the curve to the end of polycurve. This function will fail if the PolyCurve is closed or if SegmentCount > 0 and the new segment is closed.
Append(Line)
 Appends and matches the start of the line to the end of polycurve. This function will fail if the polycurve is closed.
Duplicate
 Duplicates this polycurve.
When not overridden in a derived class, this calls DuplicatePolyCurve().
 (Overrides Curve.Duplicate().)
DuplicatePolyCurve
 Duplicates this polycurve.
This is the same as Duplicate().
Explode
 Explodes this PolyCurve into a list of Curve segments. This will not explode nested polycurves. Call RemoveNesting() first if you need all individual segments.
PolyCurveParameter
 Converts a segment curve parameter to a polycurve parameter.
RemoveNesting
 Explodes nested polycurve segments and reconstructs this curve from the shattered remains. The result will have not have any PolyCurves as segments but it will have identical locus and parameterization.
SegmentCurve
 Gets the segment curve at the given index.
SegmentCurveParameter
 Converts a polycurve parameter to a segment curve parameter.
SegmentDomain
 Returns the polycurve subdomain assigned to a segment curve.
SegmentIndex
 Finds the segment used for evaluation at polycurve_parameter.
SegmentIndexes
Finds the segments that overlap the Polycurve sub domain.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The Nurbs Curves segments do not have fully multiple interior knots.
 3. Rational Nurbs curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent Colinear or Cocircular segments are combined.
Top
See Also
Reference
Rhino.Geometry Namespace