RhinoCommon SDK
InstanceDefinition.GetReferences Method
Rhino for Mac 5.1
 Gets a list of the CRhinoInstanceObjects (inserts) that contains a reference this instance definition.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public InstanceObject[] GetReferences(
	int wheretoLook
)
Public Function GetReferences (
	wheretoLook As Integer
) As InstanceObject()
Parameters
wheretoLook
Type: System.Int32
0 = get top level references in active document.
1 = get top level and nested references in active document.
2 = check for references from other instance definitions.
Return Value
Type: InstanceObject[]
An array of instance objects. The returned array can be empty, but not null.
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace