RhinoCommon SDK
Material.GetBitmapTexture Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.GetBitmapTexture"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Texture GetBitmapTexture()
Public Function GetBitmapTexture As Texture
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.GetBitmapTexture"]
See Also
Reference
Material Class
Rhino.DocObjects Namespace