RhinoCommon SDK
CustomPointObject Constructor
Rhino for Mac 5.1
Overload List
Name | Description
CustomPointObject()
Initializes a new instance of the CustomPointObject class
CustomPointObject(Point)
Initializes a new instance of the CustomPointObject class
Top
See Also
Reference
CustomPointObject Class
Rhino.DocObjects.Custom Namespace