RhinoCommon SDK
Layer.Default Method
Rhino for Mac 5.1
 Sets layer to default settings.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Default()
Public Sub Default
Remarks
If you are modifying a layer inside a Rhino document, you must call CommitChanges for the modifications to take effect.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace