RhinoCommon SDK
BrepTrim.IsReversed Method
Rhino for Mac 5.1
 Get orientation of trim with respect to it's corresponding edge.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsReversed()
Public Function IsReversed As Boolean
Return Value
Type: Boolean
true if the 2d trim and 3d edge have opposite orientations
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace