RhinoCommon SDK
ILocalizationService Interface
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.ILocalizationService"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public interface ILocalizationService
Public Interface ILocalizationService
The ILocalizationService type exposes the following members.
Methods
Name | Description
LocalizeCommandName
LocalizeDialogItem
LocalizeString
Top
See Also
Reference
Rhino.UI Namespace